[{"title":"A Special Study Day:  People With Different Takes on the Shroud","post":"Nice to see that Professor Luigi Garlaschelli’s paper is entitled “The Shroud and the problem of ‘Reproduction'”.\n\n","date":"October 17, 2014 at 9:14 am","url":"https://shroudstory.com/2014/10/17/a-special-study-day-people-with-different-takes-on-the-shroud/","cat":"conference","id":"comment-163123","author":"Louis","site":"shroudstory"},{"title":"A Special Study Day:  People With Different Takes on the Shroud","post":"I am very curious to know something about the state of the research conducted by Professor Campanella.\nThat Chemistry Professor had announced that it has developed new methods for dating artifacts cellulose (wood, paper, vegetable textile fibers).\nHe had stated that his methods would be suitable for dating the Shroud of Turin …\nUnfortunately there has been no recent news about this area.\nAm I wrong ?\n— —\nThen we have to know what he want to say in the : “Introduction to the study day”…\nIn my opinion we need to know at least something about what it will mean Professor Campanella.\nSo I ask:\nNo one knows the past words spoken in the past by Prof. Campanella?\nThere is no registration or a summary ?\n— —\nI do not think that nuclear experts and geologists are present (ie: see the famous question of aragonite and location for its origin) …\n— — *** *** — —\nInstead the discussion that took place (in this blog) about the “speed of the Resurrection” made me come up with who first brought about an important measure …\nRømer’s determination of the speed of light was the demonstration in 1676 that light has a finite speed!\nThat light Rømer estimated would take about 22 minutes to travel a distance equal to the diameter of Earth’s orbit around the Sun: this is equivalent to about 220,000 Kilometres per second in modern units, about 26% lower than the true value …\nUnfortunately most of Rømer’s papers were destroyed in the Copenhagen Fire of 1728, but one manuscript that survived contains a listing of about sixty observations of eclipses of Io from 1668 to 1678…\nSo … …returning to our interesting and lengthy discussions …\nWhere are our estimates for the phenomenon of “Resurrection”?\nI think we have to consider a bit better studies done by Paolo Di Lazzaro…\n— —\nI apologize for the length of this small intervention…\n\n","date":"October 17, 2014 at 9:48 am","url":"https://shroudstory.com/2014/10/17/a-special-study-day-people-with-different-takes-on-the-shroud/","cat":"conference","id":"comment-163127","author":"piero","site":"shroudstory"},{"title":"A Special Study Day:  People With Different Takes on the Shroud","post":"Piero, good suggestion, I had raised the issue from the point of view of biblical studies and therefore theology, leaving the rest to scientists.\n\n","date":"October 17, 2014 at 10:00 am","url":"https://shroudstory.com/2014/10/17/a-special-study-day-people-with-different-takes-on-the-shroud/","cat":"conference","id":"comment-163132","author":"Louis","site":"shroudstory"},{"title":"A Special Study Day:  People With Different Takes on the Shroud","post":"Waiting for the exact explanation of Prof. Dr Paolo Di Lazzaro about his ideas about the speed of light and the Resurrection (I think that in its interpretation are approximately equal, and then depending on the thickness of the effect of color produced on linen fibers we can infer something about the right measurement …) we can say a few words about the past of Science …\n-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-\nThe speed of light and the speed of Resurrection …\n(History of Science can help us).\nThere is an analogy with “our problem” :\nthe scholarly ambiguities of Descartes illustrate how high the difficulties were :\na propagation of light “within an instant” : a very short moment?\nor an instantaneous phenomenon?\nIn the “Dioptrique” Descartes seems to conclude in favour of an instantaneous propagation\n(a duration that would be independent of the distance)…\n… But in a letter to Mersenne he wrote:\n“I declare contradictory that an infinite velocity may occur in Nature”\nSource : Costabel, 1978: “La propagation de la lumière sans trasport de matière de Descartes à Huygens”,\nin Roemer et la vitesse de la Lumière, Paris, Vrin.\nCreativity and Technology in Experimentation.\nI understand that an event open to the public in Rome (next workshop at La Sapienza University)\nis not an Analytical Laboratory and also direct confrontations of scholars having different views is not a Lab team work…\nCellulose is synthesized in plant at the cell membrane by an ordered synthase complex\nby polymerization of glucose residues using beta-glycosidic bonds.\nNanometer thick crystalline microfibrils have high tensile strength and make up\nthe fundamental structural unit in plant cell walls.\nThere is also a matrix of other polysaccharides that cross-link the microfibrils\nusing hydrogen bonding. Then see also the question of “Hydrogen bonding plane”.\nIf I am right Hydrogen bonding play a role in linen material as :\n– Intramolecular Hydrogen bonding\n– Intrasheet Hydrogen bonding\n– Intersheet .Hydrogen bonding.\nHigh-resolution microscopy provided evidence for the presence of single crystal microfibrils.\nThe nano crystalline cellulose (NCC or CNC) usage as reinforcement in biodegradable polymeric\nsystems is a relatively new field in Nanotechnology …\nThe type of nano crystals obtained from wood have similar properties to carbon nanotubes (CNT)\nsuch as stiffness and tensile strength.\nTheir dimension is 2-5 nm x 150-300 nm …\nThe axial modulus of crystalline cellulose is near 150 GPa which is greater than Kevlar (130 GPa).\nUsing AFM techniques on linen fibrils we can detect something about structural features and\nmorphology of ancient fibrils is different with respect modern fibrils.\nAFM force–displacement curves can be obtained by applying a vertical force in direction of CNC\ndiameter (transverse direction).\nThe mechanical properties of CNC (and, for example, mica) are known to be anisotropic.\nBut here I never wrote something about transverse elastic modulus (= differences)\nor readily accessible surface of strain-distorted tilt and twist regions…\nIf the linen fibrils treated with alpha particles are more brittle,\nthen the results obtained from three-point (=3P) bending tests\n(… or from AFM nanomechanical mapping) will be different\nwith respect the untreated linen material.\nWe can easily measure these differences using the 3P bending test\n(or with AFM nanomechanical mapping)\nAlso AFM 3P bending tests on fibrils can solve in part our burning thirst of knowledge.\nBut we can reach an improved knowledge comparing the results obtained working\nat micro and nano level with the other at macro level …\n\n","date":"October 18, 2014 at 6:18 am","url":"https://shroudstory.com/2014/10/17/a-special-study-day-people-with-different-takes-on-the-shroud/","cat":"conference","id":"comment-163410","author":"piero","site":"shroudstory"},{"title":"A Special Study Day:  People With Different Takes on the Shroud","post":"The speed of light is utterly irrelevant to the study of the image image formation of the Shroud. If it is authentic, it happened in a dark, sealed tomb, in the middle of the night. If the body began to emit light, it was because of a miracle, during which God could have made the speed of light any value he wished, or indeed, instantaneous. That’s miracles for you.\n\n","date":"October 18, 2014 at 6:31 am","url":"https://shroudstory.com/2014/10/17/a-special-study-day-people-with-different-takes-on-the-shroud/","cat":"conference","id":"comment-163417","author":"Hugh Farey","site":"shroudstory"},{"title":"A Special Study Day:  People With Different Takes on the Shroud","post":"In my opinion, Prof. Dr. Di Lazzaro do not think like Hugh Farey …\nHowever, I do not propose the theory that the Resurrection was\nan instantaneous phenomenon, I just want to see the data obtained\nand what Science can tell us …\nAnd frankly, I think these words inaccurate produce only vain discourses …\nWhat might be of interest is an accurate measurement. \nSee also the question of controls about the true epoch …\nWe need the AFM control of linen fibrils and the AFM 3-point bending test (and/or\nthe nanomechanical mapping)…\nWho can do these jobs ?\n\n","date":"October 19, 2014 at 10:28 am","url":"https://shroudstory.com/2014/10/17/a-special-study-day-people-with-different-takes-on-the-shroud/","cat":"conference","id":"comment-163771","author":"piero","site":"shroudstory"},{"title":"A Special Study Day:  People With Different Takes on the Shroud","post":"Both AFM and TEM can achieve nanometer resolution and are therefore effective for imaging cellulose nanocrystals.\nBut this is not the exact wok that we have to do…\nWhat we have to see is the difference (behavior) for ancient and modern linen fibrils.\nBut my first interest (in 1998) was the determination of cellulosic DP using the AFM techniques in order to guess something about the true epoch for the material …\n\n","date":"October 20, 2014 at 6:22 am","url":"https://shroudstory.com/2014/10/17/a-special-study-day-people-with-different-takes-on-the-shroud/","cat":"conference","id":"comment-163985","author":"Piero","site":"shroudstory"},{"title":"A Special Study Day:  People With Different Takes on the Shroud","post":"Glad to see that Hugh is following my lead.\n\n","date":"October 18, 2014 at 7:52 am","url":"https://shroudstory.com/2014/10/17/a-special-study-day-people-with-different-takes-on-the-shroud/","cat":"conference","id":"comment-163433","author":"Louis","site":"shroudstory"}]
