[{"title":"CIS Conference Program","post":"I am curious about the text by Paola Jacomussi\n(her own report treated the argument: “the color of the Shroud”…)\nbecause she is a n INRIM researcher.\nHowever I am still curious about the question “gloss and linen” …\n— —-\nFor example, see also the study by Jacomussi and others:\n– “Multidimensional Reflectometry for Industry” (xD-Reflect) an European research project\nLink:\nhttp://www.researchgate.net/publication/262953592_Multidimensional_Reflectometry_for_Industry_%28xD-Reflect%29_an_European_research_project\nAbstract:\nThe European Metrology Research Program (EMRP) is a metrology-focused program of coordinated Research and Development (RD) funded by the European Commission and participating countries within the European Association of National Metrology Institutes (EURAMET). It supports and ensures research collaboration between them by launching and managing different types of project calls. Within the EMRP Call 2012 “Metrology for Industry”, the joint research project (JRP) entitled “Multidimensional Reflectometry for Industry” (xD-Reflect) was submitted by a consortium of 8 National Metrology Institutes (NMIs) and 2 universities and was subsequently funded. The general objective of xD-Reflect is to meet the demands from industry to describe the overall macroscopic appearance of modern surfaces by developing and improving methods for optical measurements which correlate with the visual sensation being evoked. In particular, the project deals with the “Goniochromatism”, “Gloss” and “Fluorescence” properties of dedicated artifacts, which will be investigated in three main work packages (WP). Two additional transversal WP reinforce the structure: “Modelling and Data Analysis” with the objective to give an irreducible set of calibration schemes and handling methods and “Visual Perception”, which will produce perception scales for the different visual attributes. Multidimensional reflectometry involves the enhancement of spectral and spatial resolution of reference gonioreflectometers for BRDF measurements using modern detectors, conoscopic optical designs, CCD cameras, line scan cameras, and modern light sources in order to describe new effects like sparkle and graininess/coarseness.\nMore information and updated news concerning the project can be found on the xD-Reflect website http://www.xdreflect.eu/ .\n— —\nSome explanation about the word “Goniochromatism”:\n= The phenomenon where the color of a material changes as the angle of illumination and/or viewing is changed. (Colour physics for industry, 2nd edn. McDonald, Roderick, Society of Dyers and Colourists, West Yorkshire, England, 1997)…\nLink:\nhttp://www.springerreference.com/docs/link/2161987.html?s=363412&t=Goniochromatism\nSee also under the address:\nhttps://www.google.com/patents/US5624731\n>Goniochromatism is a phenomenon encountered when a surface\nis coated with luster pigments having light interference properties.\n…\nLight interference arises through interactions between reflections from the upper and lower surfaces of the platelets. When an interference pigment is coated on a white surface, he reflection color is seen in the highlight and the transmission color in the background. The variations in color with the angle of incidence and the angle of observations is referred to as goniochromatism. Hence the color one sees when looking at a goniochromatic layer varies with changes in angular position relative to this layer. … … …\n— —\nThen see also my past message\nsent in December 20, 2013 at 10:50 am \n>… … I have known the luster of linen fibrils.\nAl Adler pointed the finger on presumed “bioplastic coating”\n(“… he seems to be unaware that all linen looks like this. It is caled luster …”) and then he indicated three textile references, respectively dated : 1947, 1950 and 1976 (the last is the following : “Essentials of Textiles”, Holt, Rinehart and Winston, NY 1976).\n>I want to add that I never saw (in studies about the Shroud)\nthe exact measurement of the luster.\n>See also : the residual linen wax, etc., etc.\nIn the other message (that I have sent in\nDecember 20, 2013 at 11:46 am): \n>… Al Adler wrote :\n>>His work (= the attempt by Garza-Valdes) lacks hard convincing quantitative evidence on which one can judge the merit of his claims\n>Instead if we read the\nBSTS NEWSLETTER NO: 44 – November/December 1996\nA Visit to Dr.Leoncio Garza-Valdes in San Antonio\n>There are the following words :\n>>A clear plastic coating may also explain one oddity noted from my own personal viewing of the Shroud in 1973 – that the cloth seemed to have a surprising surface ‘sheen’ …\n>Link :\nhttp://www.shroud.com/bsts4401.htm#visit\n— —\nhttp://en.wikipedia.org/wiki/Glossmeter\n>>A glossmeter (also gloss meter) is an instrument which is used to measure gloss of materials such as paint, plastics and paper. Gloss is a measure of the proportion of light that has a specular reflection from the surface, it is defined by the ASTM as “angular selectivity of reflectance, involving surface-reflected light, responsible for the degree to which reflected highlights or images of objects may be seen as superimposed on a surface”. …\n>There is an old article in :\nJournal of the Textile Institute Transactions\nVolume 28, Issue 9, 1937 \n>A Photometer for the Measurement of the LUSTRE or GLOSS of TEXTILE AND OTHER MATERIALS PART 1. Construction of Instrument\n>Link :\nhttp://www.tandfonline.com/doi/pdf/10.1080/19447023708658822\nand\nI have found another old reference :\n>Article:\nGeorge S. Buck, JR andFrank A. McCord\nLuster and Cotton\nTextile Research Journal November 1949 19: 715-754\n—————\nProbably she (being an INRIM researcher!)\nhas the useful experience on that argument …\nSee also the paper by Jacomussi that presents the experience of INRIM\nin lighting the Turin Shroud at the 2010 Turin Shroud exhibition:\nhttp://rice.iuav.it/227/1/10_iacomussi-rossi.pdf\n\n","date":"May 6, 2015 at 8:54 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","id":"comment-198472","author":"piero","site":"shroudstory"},{"title":"CIS Conference Program","post":"I beg your pardon, perhaps there was a big problem with the line!\nIt was certainly not my intention to disturb the blog with a triple and unnecessary repetition !!!\nI believe that this incident is an example of “digital hooliganism”.\nIn any case it was not my intention to repeat three times the same things!\n\n","date":"May 6, 2015 at 9:35 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","id":"comment-198478","author":"piero","site":"shroudstory"},{"title":"CIS Conference Program","post":"Dan,\nI hope that you can delete the other two (redundant) messages…\nThe problem happened because I tried to see,\nbut my messages didn’t appeared!\n… and after this fact: three (near identical) messages!\n— —\nIn this message I forgot to write that, unfortunately, I have\nthe mail box (= my email) saturated … and maybe it could have been\nthe source of the problem.\nBut I’m not sure of that because many minutes have passed\nand I had to lose time…\nIn short: I was delayed again!\n\n","date":"May 6, 2015 at 9:48 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","id":"comment-198481","author":"piero","site":"shroudstory"},{"title":"CIS Conference Program","post":"Fixed\n\n","date":"May 7, 2015 at 8:47 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","id":"comment-198539","author":"Dan","site":"shroudstory"},{"title":"CIS Conference Program","post":"Thank you!\n\n","date":"May 7, 2015 at 11:50 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","id":"comment-198545","author":"piero","site":"shroudstory"},{"title":"CIS Conference Program","post":"Most interesting. Thanks Paolo.\n\n","date":"May 6, 2015 at 9:36 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","id":"comment-198479","author":"Max patrick Hamon","site":"shroudstory"},{"title":"CIS Conference Program","post":"Hmm Thanks Piero…\n\n","date":"May 6, 2015 at 9:36 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","id":"comment-198480","author":"Max patrick Hamon","site":"shroudstory"},{"title":"CIS Conference Program","post":"Max,\nAlso I wanted to write something about the intervention\nby Rainer Riesner …\nand I did found a link to discuss:\nhttp://khazarzar.skeptik.net/books/hist_jes.pdf\n… But I want to take life as it comes and then I can try to speak\nfrom a humorous point of view and then I can indicate\nthe Robot-based Gonioreflectometer…\nLink:\nhttp://cdn.intechopen.com/pdfs-wm/284.pdf\nbecause man can err, but instead the robots cannot be wrong\n(= do not mistake the program assigned to them,\nprovided that the program is right!) …\nIn any case I don’t see great problems of “glossy side” for the Shroud,\nonly a particular (and interesting) questions (…and see also:\nthe old problem of the exact quantity of residual “flax wax”)\n\n","date":"May 6, 2015 at 10:16 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","id":"comment-198482","author":"piero","site":"shroudstory"},{"title":"CIS Conference Program","post":"Errata corrige:\n>only particular (and interesting) questions \ninstead of:\nonly a particular (and interesting) questions\n\n","date":"May 6, 2015 at 10:18 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","id":"comment-198483","author":"piero","site":"shroudstory"},{"title":"CIS Conference Program","post":"Please forgive me for what happened yesterday,\nbut it was not my intention to create confusion.\n— —\nI have read what were the topics touched by the meeting held on 2 May…\nI think that a scientist like Paolo Di Lazzaro is certainly capable\nof executing interesting AFM controls on linen and so I guess\nthat some research performed with the use of the AFM techniques\n(Applied Microscopy) have been blocked, pending further funding\n(thus: in order to publish studies with an adequate level and not\nonly amateurish works…).\nMy words are based also on the fact that we have not even\nyet seen the publication of a report on Raman controls of the year 2002.\nHere an example of AFM controls:\nQuantitative Mapping of the Elastic Modulus of Soft Materials with HarmoniX and PeakForce QNM AFM Modes\nby\nMaxim E. Dokukin and Igor Sokolov \nAbstract\n>The modulus of elasticity of soft materials on the nanoscale is of interest when studying thin films, nanocomposites, and biomaterials. Two novel modes of atomic force microscopy (AFM) have been introduced recently: HarmoniX and PeakForce QNM. Both modes produce distribution maps of the elastic modulus over the sample surface. Here we investigate the question of how quantitative these maps are when studying soft materials. Three different polymers with a macroscopic Young’s modulus of 0.6–0.7 GPa (polyurethanes) and 2.7 GPa (polystyrene) are analyzed using these new modes. The moduli obtained are compared to the data measured with the other commonly used techniques, dynamic mechanical analyzer (DMA), regular AFM, and nanoindenter. We show that the elastic modulus is overestimated in both the HarmoniX and PeakForce QNM modes when using regular sharp probes because of excessively overstressed material in the samples. We further demonstrate that both AFM modes can work in the linear stress–strain regime when using a relatively dull indentation probe (starting from ∼210 nm). The analysis of the elasticity models to be used shows that the JKR model should be used for the samples considered here instead of the DMT model, which is currently implemented in HarmoniX and PeakForce QNM modes. Using the JKR model and∼240 nm AFM probe in the PeakForce QNM mode, we demonstrate that a quantitative mapping of the elastic modulus of polymeric materials is possible. A spatial resolution of ∼50 nm and a minimum 2 to 3 nm indentation depth are achieved.\nLink:\nhttp://pubs.acs.org/doi/abs/10.1021/la302706b\nAs you already know, the measurements on the modulus of elasticity\n(= Young’s modulus) are useful for determining the probable\nage (= probable epoch) of the material…\n— — —\nIf we have to go beyond the known informations on\n“Compatibility between Shroud of Oviedo and the Holy Shroud”,\nthen we must use the right tools (= AFM techniques, IMO) and compare\nboth linen materials (using the adequate AFM apparels\n[= microscopes that permit other controls, for example:\nAFM-Raman analyses, etc. …]).\nHave you understood what is the situation ?\nThen …\nNow I hope in your interesting replies!\n— —\nHere antoher reference:\nAtomic Force Microscopy Techniques for Nanomechanical Characterization: A Polymeric Case Study\nby\nMelania Reggente, Marco Rossi, Livia Angeloni, Emanuela Tamburri, Massimiliano Lucci, Ivan Davoli, Maria Letizia Terranova, Daniele Passeri\nAbstract\n>Atomic force microscopy (AFM) is a versatile tool to perform mechanical characterization of surface samples at the nanoscale. In this work, we review two of such methods, namely contact resonance AFM (CR-AFM) and torsional harmonics AFM (TH-AFM). First, such techniques are illustrated and their applicability on materials with elastic moduli in different ranges are discussed, together with their main advantages and limitations. Then, a case study is presented in which we report the mechanical characterization using both CR-AFM and TH-AFM of polyaniline and polyaniniline doped with nanodiamond particles tablets prepared by a pressing process. We determined the indentation modulus values of their surfaces, which were found in fairly good agreement, thus demonstrating the accuracy of the techniques. Finally, the determined surface elastic moduli have been compared with the bulk ones measured through standard indentation testing.\nIn any case: polyaniline and polyaniniline are not cellulosic chains on linen fibrils!…\n\n","date":"May 7, 2015 at 8:13 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","id":"comment-198534","author":"piero","site":"shroudstory"}]
