[{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"Colin Berry is wrong about scorching.\nPDL is wrong about lasers.\nSo why bother?\n\n","date":"September 18, 2014 at 10:36 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152237","author":"anoxie","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"I may indeed be wrong. But I’m still waiting for cogent reasons, based on detailed evaluation of rival models, so as to convince me of that fact.\nEx cathedra  dismissals on internet sites, unsupported by a shred of experimental evidence,  cut no ice whatsoever – which is why I have less and less time for this particular troll-infested community. \nThank goodness for the Hughs and the DavidGs, the only reason for my not having deleted the site from bookmarks long ago.\nAnd rest assured: if this comment appears on my screen with “Comment awaiting moderation”, it will be my last word here until there’s a new site manager.\n\n","date":"September 18, 2014 at 12:30 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152255","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"Who knows how the great-algorithm-in-the-sky makes decisions. Maybe it is the frequent use of the word troll.\n\n","date":"September 18, 2014 at 1:17 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152267","author":"Dan","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"Bye, troll-tolerator.\n\n","date":"September 18, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152272","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"Colin said:  “Wrong. The STURP summary does not use the word ‘scorch’ at all.”  Then he says, “[STURP] points out that such changes can be the result of thermal OR chemical treatments, which in most people’s books would be described as “scorches.”\n     So you destroy your own argument by quibbling about the specific word “scorch”.  Shame on you.\nColin said, “The STURP summary makes no mention whatsoever of cloth-body distance. The reference in the STURP summary to the capture and encoding of 3D information has possible explanations that do NOT obligatorily require any postulates re ‘cloth-body’ distance.”\n     But the Report says, “Computer image enhancement\nand analysis by a device known as a VP-8 image analyser show that the image has unique three-dimensional\ninformation encoded in it … the image of the face with the high\nresolution has been amply demonstrated by photography.”  The nose is darkest because it is closest to the linen, the eye sockets are lightest becasue they are furthest away, i.e., cloth to body distance made the 3-D effect. \nColin said, “The energy of the uv CAN be dissipated safely in other forms, notably as thermal energy.”\nKohler at Ohio State, whose work was sponsored by the National Institutes of Health and was performed at Ohio State’s Center for Chemical and Biophysical Dynamics, which is funded by the National Science Foundation, stated,\n“Eventually, the energy does turn into heat, but the important point is that the energy is retained within the molecule for much longer times,” he added. “This can cause all kinds of photochemical havoc.”\nColin said, “I may indeed be wrong.”  Yep.\n\n","date":"September 18, 2014 at 4:15 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152303","author":"Nabber","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"Thanks for reminding me why I don’t bother with internet forums anymore.\n\n","date":"September 18, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152327","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"Many people read more of their own ideas into STuRP’s formal conclusion than is justified. Di Lazzaro says that the conclusion denies the possibility of a scorch, when in fact it does exactly the opposite, if, as Colin suggests we interpret “something which resulted in oxidation, dehydration and conjugation of the polysaccharide structure of the microfibrils of the linen” and “a similar type of change in linen can be obtained by sulfuric acid or heat” as, indeed, forms of scorch.\nSimilarly, the STuRP conclusion’s reference to the 3D quality of the image very carefully omits any mention of any form of transfer of information across a “cloth-body distance” although it comes down quite firmly in favour of a contact transfer. It is a subtle point, but the fact that the image seems to relate to a possible cloth-body distance does not mean that some kind of transfer of information across that distance actually caused it. A charcoal copy of the shroud would also imply some form cloth-body-distance/intensity relationship, but would obviously not be made by it.\nFinally Nabber finds a quotation which almost exactly parallels Colin’s statement about UV above, but seems to think it means the opposite. Bern Kohler’s mention of ‘photochemical havoc’ refers specifically to the damage caused by UV radiation to human cells; as Colin says “one is right to flag up the dangers of excessive uv exposure where humans and their crops are concerned.” Kohler, like Colin, is well aware that most materials are unaffected by UV radiation.\nColin’s criticism of these specific points in di Lazzaro’s interpretation of the STuRP conclusion is entirely justified. As I have also asked of my own postings, if he has said something incorrect, please point it out.\n\n","date":"September 18, 2014 at 6:53 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152333","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"You mean Nabber has leeched off Colin’s content about Di Lazzaro? \nNabber, your life is going to be difficult.\n\n","date":"September 19, 2014 at 3:04 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152416","author":"anoxie","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"I think Berry quibbles about the word “scorch”, especially after all his endless and fruitless theories about bas-relief, etc., etc., etc.  I think we all know what each other means by scorch, by now.\nHugh says:  “Nabber finds a quotation which parallels Colin’s statement about UV , but seems to think it means the opposite. Kohler’s mention of ‘photochemical havoc’ refers specifically to the damage caused by UV radiation to human cells”.\nHugh, your personal knowledge of the effects of UV radiation leads you to imply that photochemical reactions only affect human cells, and not the cells of linen fabric?  \nHugh says, “Kohler, like Colin, is well aware that most materials are unaffected by UV radiation.”  \nI didn’t realize that you personally knew what Kohler is “well aware of.”  And that statement is poppycock, anyway.  All fabrics are affected by UV radiation, as well as many other materials.\nIt’s also pedantic of you and him to insist that the STURP summary said nothing about cloth-to-body distances, when STURP members (Jackson, et.al.) have put out reams of articles on the subject ever since the STURP report.\n\n","date":"September 22, 2014 at 2:43 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-153710","author":"Nabber","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"The true fact is textile mordanting and pre-mordanting of colour without pigment) does look like a very light scorch or “pre-scorch”.\n\n","date":"September 19, 2014 at 2:40 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152409","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"Reminder: the Turin Shroud image is translucent (> structural pigment)\n\n","date":"September 19, 2014 at 2:49 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152411","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"Typo:  read structural colour instead of structural pigment\n\n","date":"September 19, 2014 at 2:56 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152413","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"Curiosity: \nIn which feather the greater part of the colour is based upon structural coloration? In the peacock feather (of which pattern is reminiscent of the TS herringbone weave pattern).\nNow in Late Antique and medieval symbolism, which animal is the symbol  besides the all seeing eye of God, of resurrection and immortality of Christ: the peacock. Now the TS is linked with Christ’s resurrection and immortality…\n\n","date":"September 19, 2014 at 3:35 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152418","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf","post":"Addition: In the TS dorsal image of the back of the head for instance, we can see ocellated (little-eye shaped like) blood spots, which seen in conjunction with the 3:1 twill weave pattern are reminiscent of a  peacok’s ocelli.\n\n","date":"September 19, 2014 at 4:18 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","id":"comment-152428","author":"Max Patrick Hamon","site":"shroudstory"}]
