[{"title":"A Report on the Bari Conference","post":"Dear Dan, I am curious to read the PDF file.\n— —\nNow I have a question.\nAnd this is ….\nAn unsolved problem of Archaeological Chemistry :\nthe Shroud/tablecloth hypothesis (formulated by R. and J. Jackson)\nand inherent lack of chemical evaluations using adequate scientific tools…\nYesterday I have reread an old paper by Rebecca and John Jackson : “The Jewish and Early Christian History of the Turin Shroud”.\nThey proposed that the Shroud of Turin, besides being the possible burial cloth of Christ, also served as the tablecloth for the Lord’s Supper.\nThe double usage for the Turin cloth unified two very different liturgical traditions associated with the Mass… : the altar/sacrifical tradition and\nthe Lord’s Supper/meal tradition.\nThey presented a possible evidence found directly on the Shroud itself for the tablecloth hypothesis…\nCheroset is eaten using green herbs, then dipping stains might fall onto thr linen and then they also indicated the Gospel (John 13:26),\nbecause “dipping is mentioned in the Gospel” (when Jesus offers a little slice of bread, dipped into the wine, to Judas).\nThey discovered drip patterns, adjacent to the legs of the frontal image.\nConsidering the final drip spot at the end of a central linear pattern found at the midpoint of the Shroud, they saw that this drip spot happened to fall within the thermal discoloration zone of the 1532 fire. Also they saw that part of this spot was charred black (obviously by the 1532 fire).\nNow the problem to solve [after the restore operation (year 2002), etc., etc.] is connected with the pattern of drips found on the Shroud :\nIs it possible to know (using Raman controls, CFM, etc.) the truth about the origin for these stains ?\nAre we sure that these drip patterns went into the Shroud before the body and blood images ?\nWhere are our conjectures about useful advanced controls ?\nAre these controls an useless waste of time or not ?\n————————————————————————-\nIn their work the Jacksons indicated that:\n– Cheroset was a mixture of red wine, nuts and apples.\n– Cheroset in Passover liturgy symbolizes the nortar that the Israelite slaves used in the construction of bricks for the Pharaoh’s building projects,\n– Cheroset is a vital element in the Passover “Seder” Liturgy and cannot be deleted or even replacet with another food item\n[Abarbanel Haggadah, Mesorah Publishers, p. 121)\n————————————————————————-\nLink:\nhttp://en.wikipedia.org/wiki/Charoset\n>Charoset, haroset, or charoses (Hebrew: חֲרֽוֹסֶת [ḥărōset]) is a sweet, dark-colored paste made of fruits and nuts eaten at the Passover Seder.\nSee also under :\nhttp://www.sacred-texts.com/jud/etm/etm068.htm\n>Cheroset is a kind of mixture or compound, made with dates, raisins, and other fruit, with vinegar, to commemorate the lime, &c., with which our ancestors were forced to labour in Egypt\n\n","date":"September 10, 2014 at 8:58 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-149883","author":"piero","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"Maria da Gloria Moreira wrote:\n>There was also a weird presentation by Professor Valery Shalatonin from bielorussian Minsk University describing the detection of an electric field around a real size replica of the Shroud and it’s biological effects-this was indeed very interesting and a brand new issue.\nThen, see also another strange work by V. Shalatonin :\n“A study of the endogenous electromagnetic field into the space around the flower plants”\nShalatonin\nDept. of Telecommun. Syst., Univ. of Inf. & Radioelectron., Minsk\nConference: Infrared and Millimeter Waves, 2007 and the 2007 15th International Conference on Terahertz Electronics. IRMMW-THz. Joint 32nd International Conference on\nSource: IEEE Xplore \nAbstract:\nEndogenous electromagnetic low-frequency component of the biofield of the flower plants was studied experimentally. It was found that a borderline of bioinformation field surrounding plants (10-70 cm from a flower) transforms into bioinformation radiation, which is spread far beyond the detected border. …\nLink:\nhttp://www.researchgate.net/publication/4332499_A_study_of_the_endogenous_electromagnetic_field_into_the_space_around_the_flower_plants\n— — *** *** — —\nI remember that Maria da Glória (and the husband Antero de Frias Moreira)\nwrote something in this blog (May 2, 2012) about the\n“Two Thousand Year-Old Ointment Residue Discovered on the Shroud”\nHere the opinion:\n>…Dr.Marcia Boi’s presentation, which although it showed images with a good quality,\ndid not convince us on the validity of her claims.\n— —\nPerhaps, despite the rejection by Maria da Glória, the question of the\n“Residue of 2,000 year-old ointments found on Shroud of Turin” is still interesting,\nbecause, during her presentation (in 2012), Boi said the Gospels indicate Jesus was buried with royal honors, “which involved preparing the body with ointments and oils.”\nShe also said the ointments and oils present on the linen have protected it from insects\nand fungus over the centuries.\nLink:\nhttp://www.ewtnnews.com/catholic-news/World.php?id=5357#ixzz1ti3Bx769\nBut…\nWhere are the true proofs ?\nWhere are the analytical proofs ?\nIs it possible to check the ancient linen fibrils using CFM (= Chemical Force Microscopy)?\n— — — *** *** *** — — —\nHere another question.\nI also indicated the AFM three-point bending test in order to know the truth\nabout the Elastic Modulus using a non destructive way (instead Giulio Fanti used\nthe system with the load at break).\nIn the past (December 9, 2013) I wrote:\n>I believe that Giulio Fanti can improve the system using the NEMS …\n>The nanoelectromechanical way !\n>What is your opinion ?\n>Do you know the NEMS, the NanoElectroMechanical Systems ?\nRecently I have thinked at the possibility to use\nthe Contact resonance AFM (= CR-AFM).\nCR-AFM is a technique that can provide information about\nthe viscoelastic properties of a material in contact with an\nAFM probe by measuring the contact stiffness between the probe and sample …\nIn CR-AFM, an AFM cantilever is oscillated, and the amplitude\nand frequency of the resonance modes of the cantilever are monitored.\nWhen a probe or sample is oscillated, the tip sample interaction\ncan be approximated as an ideal spring-dashpot system\n(see also : the Voigt-Kelvin model) …\nUnfortunately (using Google) I have not found the references\nabout textiles submitted to the Contact resonance AFM …\n— —\nSo …\nWhat is your opinion?\n\n","date":"September 10, 2014 at 9:55 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-149898","author":"Piero","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"Piero, Jesus was buried with royal honours after being executed as a criminal? Where did you get that from? Jesus was not buried like Herod and Joseph of Arimathea and Nicodemus gave Jesus the most decent Jewish burial they could, given the circumstances, and that was no royal burial.\nYou are outdated regarding the burial, which is controversial:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nData is being gathered to write Part IV, which will be a nail in the coffin of the “Jesus family tomb” documentary/book.\nRegarding Bari, the scientific papers should be judged by other scientists. I don’t believe that Paolo di Lazzaro and Giulio Fanti think that they reproduced what we see in the “original”, they merely propounded the process by which the image may have been formed. A little more and we would have got the impression that it was only worthwhile listening to the “historiographical and philosophical” approach presented there. But there is no need to go to a conference just for that, one can read Larry Hurtado, Luke Timothy Johnson and Peter Kreeft at home.\n\n","date":"September 10, 2014 at 10:36 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-149903","author":"Louis","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"Thank you for your interesting answer.\nUnfortunately today I have no other time…\nfor the Contact resonance AFM (= CR-AFM)…\nI hope to write something tomorrow.\nI beg your pardon about the question of “royal burial”.\nIn any case I would still think with reverence for the burial of Jesus.\nThe Deposition of Jesus is a particular moment …\n\n","date":"September 10, 2014 at 10:52 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-149908","author":"Piero","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"No need to apologise, your field is science and you are good at it. I am pursuing biblical archaeology.\n\n","date":"September 10, 2014 at 11:35 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-149916","author":"Louis","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"Barrie S mentioned that STURP took a computer to Turin in 1978, but it didn’t work.  That was probably the last time a computer was anywhere near the Shroud.  I suspect that several of Piero’s questions and suggestions might be able to be answered at some future time with a detailed spectral analysis, possibly even at the molecular level, with the aid of modern number crunching abilities of computer analysis of the spectra.  Who knows?  We might even be able to detect flowers, pollen residues that escaped being vacuumed off in 2002, even perhaps wine and cheroset residues if they’re still there, although probably now degraded.  Meantime we shall have to wait until such time as Vatican authorities have more confidence in scientists’ abilities and open-mindedness than they seem to have at present.  Too much of the science seems to be agenda driven, regardless of what side of the authenticity divide one looks at it.\n\n","date":"September 11, 2014 at 5:03 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-150132","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"“Meantime we shall have to wait until such time as Vatican authorities have more confidence in scientists’ abilities and open-mindedness than they seem to have at present.”\nThe Vatican never said that they didn’t have confidence in scientists’ abilities and open-mindedness.\n\n","date":"September 11, 2014 at 7:42 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-150169","author":"PHPL","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"Bishop Marcello Sanchez Sorondo, the Chancellor of the Pontifical Academy of Sciences emailed me with these words: “The opinion of the PAS is that in order to do something scientific, another test should be carried out but since the institutions that carry out these tests are rather anticlerical, the PAS currently thinks that it would not be prudent to reopen the matter until other scientific identification systems are devised.” Although not in any sense an official statement of policy, it does suggest that at present the Vatican does indeed lack confidence in scientists’  open-mindedness, if not their expertise.\n\n","date":"September 11, 2014 at 8:10 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-150180","author":"Hugh Farey","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"“Meantime we shall have to wait until such time as Vatican authorities have more confidence in scientists’ abilities and open-mindedness than they seem to have at present. Too much of the science seems to be agenda driven, regardless of what side of the authenticity divide one looks at it.”\nIt seems wise.\n\n","date":"September 11, 2014 at 9:00 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-150190","author":"anoxie","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"In my opinion, to be able to make a speech ordered…\nIt would be better to consider two things …\nFirst :\nMichele Loconsole (during Orvieto’s worldwide conference, year 2000)\ndenied the hypothesis by Jackson.\nSee:\nM. Loconsole: the Judaic burial. Correlations between the Judaic sources and the Holy Shroud of Turin  (Tuesday, August 29, 2000)\nLink:\nhttps://www.shroud.com/orvieto.htm\nSecond:\nThe least squares fitting algorithm is the most commonly used algorithm\nin Raman spectroscopy.\nBut the method indicated in a paper\n(A hybrid least squares and principal component analysis algorithm for Raman spectroscopy.  Van de Sompel D, Garai E, Zavaleta C, Gambhir SS.\nConf Proc IEEE Eng Med Biol Soc. 2011;2011:6971-4.\nhttp://www.ncbi.nlm.nih.gov/pubmed/22255942 )\nis a hybrid least squares and\nprincipal component analysis algorithm that\n>explicitly accounts for any variations expected in the reference spectra used\nin the signal decomposition.\nThey compared the novel algorithm to the least squares method\nwith a low-order polynomial residual model, and demonstrated\nthe novel algorithm’s superior performance by comparing quantitative error metrics…\nI am not expert in this particular field, but this problem of algorithm in\nRaman analysis seems a question to take into account\nwhen we want to speak about Raman spectral analyses.\nIt’s very interesting to see a software that works on Raman\nspectrum interpretation helping you to identify functional groups\nand their characteristic shifts …\nSorry. Perhaps you know the argument Raman better than myself…\nIn any case (for others who do not know the question),\nunder the address:\nhttp://www.renishaw.com/en/raman-spectra-explained–25807\nthere is the following explanation :\n>We graphically depict the results of our measurements as a Raman spectrum.\n>We plot the intensity of the scattered light (y-axis) for each energy (frequency) of light (x-axis). The frequency is traditionally measured in a unit called the wavenumber (number of waves per cm, cm-1).\n>We plot the x-axis frequencies relative to that of the laser as it is the shift in energy of the light that is of particular interest.\nSee also the other address:\n\n= The Raman shifts and relative intensities of all of the Raman bands\nof the material. With this, we can identify the material…\n\n","date":"September 11, 2014 at 5:57 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-150144","author":"Piero","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"Hi Piero\nJust to clarify a quotation you made from us in your second comment on this post I \n«remember that Maria da Glória (and the husband Antero de Frias Moreira)\nwrote something in this blog (May 2, 2012) about the\n“Two Thousand Year-Old Ointment Residue Discovered on the Shroud”\nHere the opinion:\n>…Dr.Marcia Boi’s presentation, which although it showed images with a good quality,\ndid not convince us on the validity of her claims.»\nAt Bari Dr Marzia Boi has done an interesting presentation about Shroud pollen issue the image quality was excellent, it had been agreable indeed to listen the speaker reasonig nevertheless in my humble opinion her claims are flawed and I’ll try to explain you why:\nThe tenets of her theory are: \nAs main pollens on the Shroud are from entomophilous pollination they could not have got iinto the fabric weave interstices by usual contamination.\nMax Frei and other botanists namely Professor Avinoam Danin and Uri Baruch misidentified Gundelia Tournefortii pollens which in her opinion are Helichrisum spp. and you may read on her paper\n«The genus of Helichrysum seems to be the most abundant\npollen on the linen» and «by pressing the Helichrisum floers an excellent oil is produced»\nThe body of the Man of The Shroud was anoited with oils and balsams, so the reason for finding entomophilous pollens like the alleged Gundelia Tournefortii which turned out to be Helichrisum was because of the body anointment.\nPlacement of flowers on the cloth beside or over the body is once more categorically discarded    « plants were never allowed to touch the cadaver directly» and the same applies to body washing            «The body prepared for funeral and burial was\nnot washed or cleaned with water; proof of this is the presence\nof blood and the stains from wounds that can be seen on the\nShroud».\nMy reasons to question this theory are as follows:\nIt puzzles my mind why experienced botanists like Max Frei and most importantly, israeli botanists would misidentify a kind of pollen from their own country.\nDr. Marzia Boi bases this claim only on photographs, not direct examination by microscope of any remainig pollen samples.\nThe competence and honesty of professor Danin was personally mentioned to me by a jewish speaker at Bari conference.\nThe presence of entomophilous pollen- in this case Helichrisum not the allegedly misidentified Goundekla Tournefortii-on the fabric is allegedly justified because the body had been embalmed with an expensive Helichrisum oil.\nActually you can read references to deposition of flowers beside the body in ancient jewish burial rituals- you just have to google it ,an a lot of reliable information will pop up.\nThis practice was confirmed to me at 2012 Valencia Shroud Congress by Dr. Rebecca Jackson who is an expert in ancient jewish history and customs.\nSo it turns out that the presence of entomophilous pollens can be easily explained by the deposition of flowers on the Shroud.\nBlood marks on the Shroud namely the scourge marks are very well defined and their boundaries are clear cut.\nIf the body had not been washed and was extensively anointed with oils and balsams the bloody material would have surely spread. so it turns out scourge marks would be absolutely  undefined.\nThe question of washing or not washing the body has already been approached on this blog and I agree with Professor Zugibe’s opinion that the Man of the Shroud «was washed»\nAt least a kind of hasty washing had to be done namely life blood shed  on the dorsal trunk otherwise we would see a big undefined blood stain on the cloth, not the multiple so well defined dumbell scourge marks-actually this is the proof that the body was washed, at least in some areas.\nThese are the main reasons why we were not convinced at Valencia and this second presentation although quite well constructed did’t convince me either.\n                                                                                regards\n                                                                      Antero de Frias Moreira\n                                                                  Centro Português de Sindonologia\n\n","date":"September 13, 2014 at 7:52 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-150680","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"A Report on the Bari Conference","post":"More rubbish being posted on the blog. Marzia Boi is a biologist, not a palynologist, and one must be a broken record to repeat over and over again that Professor Avinoam Danin stands by Uri Baruch’s findings. For more, Prof. Litt did not publish his findings.\nAdditional rubbish: There are complaints about just about everything that has been done in Shroud studies. It begins with STURP, then includes the conferences. You can bet that the next one will be Saint Louis.\nSuggestion: Why are those who are slinging mud organise a Shroud conference and present papers. One must then see if these present gospel truth.\n\n","date":"September 13, 2014 at 10:02 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","id":"comment-150708","author":"Louis","site":"shroudstory"}]
