[{"title":"Does it Matter if the Shroud is a Fake?","post":"Our Almighty God did not create a 3 D image of Jesus revealing the most important time in world history for ALL to SEE, for no REASON.\nIf we read John 3:16 we truly understand why God preserved a 3 D image of Jesus.\nFor God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.\nThe Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance. 2 Peter 3:9. King James Bible\nWhat more evidence do we need to believe, repent, FOLLOW Jesus and be SAVED?\n\n","date":"July 14, 2015 at 6:26 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205628","author":"Simon Brown","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"If anyone can prove the Shroud is a fake? then they will be more famous than Jesus.\n\n","date":"July 14, 2015 at 6:31 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205629","author":"Simon Brown","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"Or the other way around.\n\n","date":"July 14, 2015 at 7:37 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205636","author":"Paulette","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"100’s of the BEST scientists on the planet have already proved the Shroud is the same cloth as told in the gospel of John 19 – 20.\nPlease read the 100’s of peer reviewed, scientific, facts, papers and evidence proving the visible and physical evidences of the crucifixion, death, and the ultimate Resurrection of Jesus (Yeshua) meaning Salvation.\nResearched by the best researchers, experts and scientists in the world, proving the facts of God’s love for ALL humans, by sending Jesus who suffered severe pain and punishment by being whipped and nailed to a cross. NOT to condemn us. NO. But to save us. ALL HERE http://wwwrealdiscoveriesorg-simon.blogspot.co.uk/2015/02/read-100s-of-peer-reviewed-scientific.html\n\n","date":"July 14, 2015 at 10:52 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205659","author":"Simon Brown","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"It’s a nice little piece, reasonably balanced for the bbc ( which usually seems to take an ultra atheistic view of things). Not totally accurate though eg. Names Charles Freeman as a scientist!!!!\n\n","date":"July 14, 2015 at 6:47 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205630","author":"Thomas","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"Very strange, especially as I spent some time with a researcher and producer from BBC HISTORY the other day, but the BBC is so big that everyone operates independently of each other.\n\n","date":"July 14, 2015 at 7:48 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205638","author":"Charles Freeman","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"Her question has an obvious answer: Because it has something to do with Jesus.\n\n","date":"July 14, 2015 at 9:36 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205652","author":"Louis","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"Had nothing been left, Jesus would still be the Anointed One and His atoning death would still cover our sins. “A wicked and adulterous generation seeketh after a sign.”\n\n","date":"July 14, 2015 at 9:38 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205653","author":"Richard Arthur","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"[removed by moderator]\n\n","date":"July 14, 2015 at 1:00 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205682","author":"Simon Brown","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"This is not the forum for dueling with scripture quotations or for link farming.  In the above comment, I removed the quotation and the link to your lengthy prophecies in the Bible compendium.\n\n","date":"July 14, 2015 at 2:24 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205687","author":"Dan","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"By the same token, you should not let Piero get away with his lengthy cut-and-paste entries.  He should just let a link stand for his unusually obtuse entries.\n\n","date":"July 15, 2015 at 2:01 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205881","author":"Nabber","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"I have to concur with Nabber on that one.\n\n","date":"July 15, 2015 at 2:39 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205892","author":"David Goulet","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"Here a strange question (and you can try to answer):\nWhat has to do with the Shroud (and our friend\nJohn Klotz!) the recent (and further) evidence for\nthe existence of pentaquarks?\nLarge Hadron Collider discovers new pentaquark particle.\n>Scientists at the Large Hadron Collider have announced\nthe discovery of a new particle called the pentaquark.\n>It was first predicted to exist in the 1960s but, much\nlike the Higgs boson particle before it, the pentaquark\neluded science for decades until its detection at the LHC.\n>The discovery, which amounts to a new form of matter,\nwas made by the Hadron Collider’s LHCb experiment. …\nLink:\nhttp://www.bbc.com/news/science-environment-33517492\nHere an old evidence:\n>July 21, 2003–At the Conference on the Intersections of\nParticle and Nuclear Physics held May 2003 in New York City,\nresearcher Stepan Stepanyan from the DOE Office of\nScience’s Thomas Jefferson National Accelerator Facility\nrevealed the most convincing evidence yet of a subatomic\nparticle consisting of five quarks.\n>He was representing his CLAS (CEBAF Large Acceptance\nSpectrometer) collaboration, a multi-national group of\nresearchers, as he presented Jefferson Lab research\nsupporting the existence of the “pentaquark.”\nCEBAF–Continuous Electron Beam Accelerator Facility–is an\nOffice of Science national user facility managed and\noperated by Jefferson Laboratory. … …\nLink:\nhttp://www.eurekalert.org/features/doe/2003-07/djna-pne080103.php\n— —\nWas the Corpse transformed in “new form of matter”?\nI don’t believe in that strange idea, but I would\nto deepen around the question of the …”new form of matter”…\nand the “Sign of the Shroud”…\n\n","date":"July 14, 2015 at 11:12 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205664","author":"piero","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":">LHCb spokesperson Guy Wilkinson commented:\n“The pentaquark is not just any new particle…\nIt represents a way to aggregate quarks, namely\nthe fundamental constituents of ordinary protons and\nneutrons, in a pattern that has never been observed\nbefore in over fifty years of experimental searches.\n>”Studying its properties may allow us to understand\nbetter how ordinary matter, the protons and neutrons\nfrom which we’re all made, is constituted.”\nLink:\nhttp://www.bbc.com/news/science-environment-33517492\nUnderstanding the structure of matter it has been revolutionized\nin 1964 when the American physicist Murray Gell-Mann\nproposed the theory on the structure of matter,\naccording to which the particles that form the nucleus of\nthe atom (protons and neutrons) are made up of\nthree quarks while another class of particles, mesons,\nare made of quark-antiquark pairs.\n— —\n>In 2003 came experimental evidence of a\nfive-quark combination which is being called a\npentaquark.\n>Strong evidence for the pentaquark came\nfrom experiments at the Jefferson Lab in\nNewport News, Virginia during 2003.\n>The experiments involved multi-GeV photons\nimpacting a deuterium target.\n>The evidence showed a five-quark baryon state\nat a mass of 1.54 GeV with a narrow width of 22 MeV.\n>The new particle is being called Theta-plus,\nwith a composition of two up quarks, two down\nquarks and an anti-strange quark.\n>The combination of quark charges +2/3(u), -1/3 (d)\nand 1/3 (anti-strange) gives a net charge of +1.\n>The lifetime of the particle is about 10-20 seconds.\n>The decay is classified as a strong interaction decay\nto a neutron and a K+ meson\nLink:\nhttp://hyperphysics.phy-astr.gsu.edu/hbase/particles/pquark.html\nSo, I think that we need to update our old knowledges…\n\n","date":"July 14, 2015 at 11:28 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205671","author":"piero","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"Piero, Thanks for the update on the LHC which I’ve been neglecting of late.  Doubtless we will eventually see an entirely new batch of technologies develop when all the new data becomes more widely known.  The pentaquark would still seem to be the same matter common in our own universe, just a different combination of quarks.  I tend to see the resurrected body as made up of an entirely different as yet unknown kind of matter, existing in a different universe, of which our own universe may be a subset.  Dark matter which is abundant throughout the universe as yet remains a mystery.  Interestingly, two, three and five are Fibonacci numbers which are pervasive throughout nature, either singly or in pairs.  I wonder if there might be an octoquark?\n\n","date":"July 14, 2015 at 3:54 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205702","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"Jesus icons also generate devotion.\nFrom the Latin Patriarchate of Jerusalem a report on the Bethlehem icon school:\nhttp://en.lpj.org/2015/06/26/iconography-a-byzantine-art-born-in-the-holy-land/\n\n","date":"July 14, 2015 at 5:14 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205710","author":"Louis","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"You wrote: “I tend to see the resurrected body as\nmade up of an entirely different as yet unknown kind\nof matter, existing in a different universe, of which\nour own universe may be a subset. …”\nIt’s an interesting idea.\nBut a bit heretic, IMO…\nAn “unknown kind of matter” seems to be too limited\n(with respect to the infinite power of God…) about the\nfinal transformation for the Corpse/Body.\nAlso the resurrection in “another universe” (“multiverse”?)\nseem to be a sort of mocking result… because this new universe\ncan be uncomprehensible for us. This seems to be near a\nsort of “recycled buddhism” =  a rebirth, not in this poor world,\nbut in another universe that can be a bit unknown (So …\nIs that “universe” the Purgatory? Was the Manoppelo’s Face\nthe message from the journey through the Purgatory?\nJesus saved the souls of the Purgatory and this Face\nis the result of our perception … but we are not yet able\nto understand the true meaning?). Probably it is better\nwhat the Christian Tradition taught, with three\ndifferent cases : Paradise, Purgatory and Hell…\nIn my opinion we cannot try to compute, microscopically\nor macroscopically, the power of God-Father when\nHe (…with and through the Holy Spirit) resurrected\nfrom the death His Son… This is a religious\nquestion and (IMO) atoms, nuclear particles,\nquarks or strings are far from that problem…\nIn any case I am curious to see what kind of results\nwill be obtained from true advanced controls…\nWe can also discuss whether the body has passed\nthrough a phase of dematerialization perhaps involving\nthe formation of antimatter or new states of matter,\nthe non-ordinary states (with very short life span).\nBut the question for the moment is only completely\ntheoretical. In principle I am opposed to this idea of\ndematerialization with transient phases.\nBut I can not exclude it, in fact, we have not yet\nat hand concrete results derived from advanced\ncontrols (with SPM, etc.) of those colored thin layers which\nthen form the Body Image on the Shroud.\n— *** — *** —\nPenta Quark: particle consisting of five quarks.\nOctoquark: particle consisting of eight quarks.\nI have found the word octoquark in the following phrase:\n>…In addition one can look for the corresponding octoquark states uuduudcc state in pp scattering at GSI.\nTransversity 2005: Como, Ilay, 7-10 September 2005\n Di Dr. Vincenzo Barone,Philip G. Ratcliffe\n>As part of a Ministry-funded inter-university Research Project, this workshop was organised to gather together experimentalists and theoreticians engaged in investigating the nature of transverse spin in hadronic physics, with the intent of favouring the exchange of up-to-date theoretical and experimental ideas and news on the subject. Over 70 physicists took part and very nearly all the major experiments involved in transverse-spin studies were officially represented, as too were the main theory groups working in the field. New results and new analyses sparked many interesting and lively discussions.\nSee also:\nThe hexaquark-flavoured antiK-N-N state computed microscopically with a clusterized octoquark.\nP. Bicudo\n(Submitted on 13 Apr 2008)\n    The possible production processes of the antiK-NN are explored. We derive microscopically, with the RGM, the microscopic derivation of the K-N and antiK-N interactions. We discuss the binding or not binding of the different antiK-N and antiK-NN systems. When binding occurs, the respective decay widths are also discussed. \nNote: Talk given at 11th International Conference on Meson-Nucleon Physics and the Structure of the Nucleon (MENU 2007), Julich, Germany, 10-14 Sep 2007. In the Proceedings of 11th International Conference on Meson-Nucleon Physics and the Structure of the Nucleon (MENU 2007), Julich, Germany, 10-14 Sep 2007, pp 131. \nLink:\nhttp://arxiv.org/abs/0804.2090\n— —\nQuark-Antiquark Combinations.\nLet’s note by q = quark 0 {Up, Down, Top, Bottom, Strange, Charm},\nand by a = antiquark 0 {Up^, Down^, Top^, Bottom^, Strange^, Charm^}.\nLink:\nhttp://zenodo.org/record/9034/files/unmatter-definitions.pdf\nThen, we can try to see the “Quark-Antiquark Combinations”\nat p. 7 (of 10):\n>… – if n = 2, we have: qa (biquark – for example the mesons and antimesons);\n>- if n = 3, we have qqq, aaa (triquark – for example the baryons and antibaryons);\n… … …\n>- if n = 5, we have qqqqa, aaaaq (pentaquark);\n… … …\n>- if n = 8, we have qqqqaaaa, qqqqqqaa, qqaaaaaa (octoquark);\n… … …\n>- if n = 10, we have qqqqqaaaaa, qqqqqqqqaa, qqaaaaaaaa (decaquark);\netc.\nUnder the same address:\nhttp://zenodo.org/record/9034/files/unmatter-definitions.pdf\nwe can read:\n>Unmatter Combinations.\n– For combinations of 2 we have: qa (unmatter biquark), [mesons and antimesons]; the number of all possible unmatter combinations will be 6·6 = 36, but not all of them will\nbind together.\n– For combinations of 5 we have:\nqqqqa, or aaaaq (unmatter pentaquarks);\nthe number of all possible unmatter\ncombinations will be\n64·6+64·6 = 15,552,\nbut not all of them will bind together\n– For combinations of 8 we have:\nqqqqaaaa, qqqqqqqa, qaaaaaaa (unmatter octoquarks);\nthe number of all possible unmatter\ncombinations will be\n64·64 + 67·61 + 61·67 = 5,038,848,\nbut not all of them will bind together.\nUnmatter =\na new kind of matter whose atoms include both nucleons and antinucleons, with a very short life span of no more than 10 ^-20 sec.\nStable states of unmatter can be built on quarks and anti-quarks: applying the unmatter principle, obtained is a quantum chromodynamics formula that gives many combinations of unmatter built on quarks and antiquarks. …\nLinks:\nhttp://www.academia.edu/6763035/Verifying_Unmatter_by_Experiments_More_Types_of_Unmatter_and_a_Quantum_Chromodynamics_Formula\nhttp://arxiv.org/abs/1507.03414\n— —\nWere the Shroud and the Manoppello’s Veil\nthe first results of a School of Galactic Icons\ncoming from other (Extraterrestrial) Institutes of Art?\n\n","date":"July 15, 2015 at 10:12 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205858","author":"piero","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"Piero, I do not see my idea of a resurrected body being of an unknown kind of matter as heretical at all.  In fact it is sound, both rationally and theologically. \nWhat is heretical is to assert that the resurrection was that of a “spiritual body”, which is a contradiction in terms.  If it is a spirit, it cannot be a body.  \n1.  It is possible that a spirit may be perceived by men because of a special divine dispensation.  Mystics and the scriptures refer to appearances of angels for instance.  In Matthew’s gospel, angels appear to St Joseph, but are said to have appeared to him “in a dream”.  But a spirit cannot be touched, nor does it eat food.  Normally a spirit cannot interact with the matter of our universe. \n2.  In the accounts of the resurrection, Jesus appears to the apostles (perception); Thomas “touches” his wounds; Jesus “walks” and “talks” with apostles on the way to Emmaus, he “sups” with them;  when they are gathered in the upper room, he asks if they have something to eat;  when they go fishing, he is seen preparing breakfast for them.  I assert that a spirit can do none of those things!  Therefore he has some kind of resurrected “body” !  \n3.  Normal matter cannot pass through walls;  Nor can normal matter spontaneously “appear” and “disappear”;  nor can it normally levitate itself into the clouds as the apostles saw at the Ascension.  Therefore the matter that comprised Christ’s resurrected body must be some kind of matter, as yet unknown to us.  That can be the only logical conclusion!\n\n","date":"July 16, 2015 at 5:54 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-205930","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"daveb of wellington nz says:\n” Normal matter cannot pass through walls; Nor can normal matter spontaneously “appear” and “disappear”; nor can it normally levitate itself into the clouds as the apostles saw at the Ascension. Therefore the matter that comprised Christ’s resurrected body must be some kind of matter, as yet unknown to us. That can be the only logical conclusion!”\n***Angel says:  Or, known to us, as the transition metal Cooper pairs (superconductors).  I mentioned the transition metal Cooper pairs to Colin Berry a while back, referencing levitation, but he refused to believe.  Since that time physics has found the transition metal superconductors to perform exactly as I stated to Colin.\nThe superconductors levitate, lose weight, etc.\nLevitation and Magnetism associated with superconductors\nSuperconsuperconductors.htmlductors\nhttp://www.explainthatstuff.com/\nAs well, the combination of 5 quarks would be referred to as an “octaquark,” rather than an “octoquark.”\nSee the following:\nThermodynamics with density and temperature dependent …\nby XJ Wen – ‎2005 – ‎Cited by 49 – ‎Related articlesJun 6, 2005 – … with an anti-strange quark, such as the pentaquark (u^2d^2\\bar{s}) for baryon nmber 1 and the octaquark (u^4d^3\\bar{s}) for dibaryon etc.\nhttp://arxiv.org/abs/hep-ph/0506050\nWith that in mind Jesus may have levitated at the resurrection with the aid of a metal superconductor.\nI love your in-depth and thorough thought processes  :)\nMy younger sister just died of pancreatic cancer.\nBest,\n\n","date":"July 20, 2015 at 12:55 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-206218","author":"Angel","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"P.S.  There is also a relationship between Magnetic Resonance Imaging (MRi) and superconductors.\nPerhaps this is how the Shroud image was formed. \nUses for Superconductors\n http://www.superconductors.org/uses.htm\nJust a thought!\nBest,\n\n","date":"July 20, 2015 at 2:16 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-206223","author":"Angel","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"Hello Angel, Thank you for your comments about Cooper Pairs which I had not known about, but I had been aware of other properties of superconductors, as early as my undergraduate days now in the long distant past.  You didn’t mention whether Cooper Pairs also have the property of passing through walls or spontaneously disappearing and reappearing elsewhere.  But I’ll check up on your links. \nMy comments on the octaquarks were pure speculation based on no more than 8 being a Fibonacci number.  You’re probably aware that the series is: 0, 1, 1, 2, 3, 5, 8, 13, 21 … Each number is the sum of the previous two, and were discovered by Leonardo Fibonacci  in the 13th century.  They occur abundantly in nature and have several fascinating properties including a relationship with the golden ratio.  I can drivel on about them for hours.  Need we search for a tredecim quark?  \nThank you for your kind comments concerning my contributions to the site, and my sincere condolences at the loss of your sister.  Blessings, Daveb\n\n","date":"July 20, 2015 at 4:03 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-206230","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Does it Matter if the Shroud is a Fake?","post":"Dear Dave,\nThank you for your condolences regarding my younger sister’s death and you’re welcome.  I do love reading your posts!\nYes, I completely comprehend Fibonnaci numbers, as this topic was included in one of my undergrad chemistry courses.\nAfter the Higgs-Boson (God particle) was isolated by CERN, I began researching Cooper pairs, Bose-Einstein Condensates (BECs) and the Meisner effect, \nSpecifically, referencing Cooper pairs or BECs, I believe metal superconductors, in the solid state, can lose weight and can emit light in the form of waves (like laser beams)..   There is a link below that has scientifically confirmed both forms of light (particle and wave).\nPerhaps this antigravimetric process (Cooper pairs/superconductor) was utilized by Jesus at the resurrection, during levitation, which would be in agreement with Isabel Piczek’s Event Horizon theory,  I wonder if iron was in the tomb?\nAs well, the same would have been responsible for the fast-pulsed laser light that may have produced the image on the Shroud, as theorized by Fanti.\nThe garment composing Jesus’ spiritual body would, more than likely, have been composed of bright white light, as seen by Mary Magdalene when she viewed Him as the gardener, on the side of the road near the garden tomb.\nIf superconductors are antigravity, then that would explain Jesus entering through the walls when He visited the disciples after His death.  \nThere are a few scientists working on superconductors, warp drives, induced gravity propulsion and antigravity space craft, etc., that may be utilized for space travel in the not-too-distant future.  Some, like Dr. Boylan state, the Lockheed X-22a (two man discoid with onboard laser weaponry) is an antigravity craft, but it is a secret  military project, and who knows if it is true.  The photo of the Lockheed X-22a on google images is impressive though. \nI’m not a physicist, but perhaps Isabel Piczek could shed some light on the subject of superconductors, with respect to transition metals (those that fill d-orbitals).\nReferencing light or antigravity propulsion using superconductors, see the links.\nFirst Ever Photograph of light behaving as both a particle and a wave\nhttps://richarddawkins.net/2015/03/first-ever-photograph-of-light-as-a-particle-and-a-wave/\nSynopsis: A Cooper-Pair Laser\nhttp://physics.aps.org/synopsis-for/10.1103/PhysRevB.90.020506\nCooper pairs\nhttps://en.wikipedia.org/wiki/Cooper_pair\nBest,\n\n","date":"July 21, 2015 at 3:06 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","id":"comment-206295","author":"Angel","site":"shroudstory"}]
