[{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Does anybody know if Dr. Eric Jumper is the only STURP member who thinks that the “Shroud cannot have a first century origin”? For me this is new because I thought that all STURP members, after examining the cloth, reached the conclusion that the Shroud was genuine…..\n\n","date":"January 25, 2013 at 5:29 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22672","author":"Gabriel","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"I think many scientists capitulated to the C-14 results because to do otherwise would have been a career killer.\n\n","date":"January 25, 2013 at 6:46 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22675","author":"Russ Breault","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Russ, I believe you may be right. Although I don’t believe many of the STURP team actually rejected the Shroud solely on evidence of the C14 dating, a few obviously did. I believe R.Rogers may have also been one who did, and for those few who did, it baffles the mind that the C14 dating result ‘alone’ could have convinced them of anything. These people were of exceptional minds, and I being a simple newb can see ‘clearly’ how unreliable the 1988 tests could be, or were, and also understand that basically; one C14 dating can not be taken as proof of anything.\nGabriel, I don’t believe any of the STURP members claimed it was genuine, but they did reach the conclusion it definitely was not the work of an artist, i.e; a painting or an etching, or a bas-relief etc;. Basically not a forgery of any kind. As Barrie Schwortz is fond of saying; “We can tell you what it isn’t, but we can’t tell you what it is” ;-)\nR\n\n","date":"January 26, 2013 at 5:38 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22702","author":"Ron","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Ron, thanks for your clarification. I was needing it, because if one reads the literature on the Shroud it gives the impression that the STURP as such, reached the conclusion that the Shroud was authentic. Thanks again.\n\n","date":"January 26, 2013 at 7:53 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22711","author":"Gabriel","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Dan, is there any way to find out if this talk will be taped or webcast? If yes, how would one obtain a copy or tap into a webcast.\n\n","date":"January 25, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22676","author":"Shroud Encounter","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"This would be great, i’d like to know Pr Jumper’s latest views on the Shroud.\n\n","date":"January 27, 2013 at 6:45 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22816","author":"anoxie","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Has anyone attempted to determine who is on the cloth rather than trying to prove that it is Jesus because the image looks like Jesus after the crucifixion?\n\n","date":"January 25, 2013 at 11:05 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22688","author":"Jean L Genibrel","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"I believe the concensus is, (by anyone who has studied the image extensively along with Gospel scriptures), that the image could not be of anyone else but that of Jesus Christ. In fact I believe several have concluded that the chance this image could be of anyone else other then Jesus, is in the billions to one.\nR\n\n","date":"January 26, 2013 at 5:43 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22703","author":"Ron","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"And I believe that the consensus is exactly the opposite, which is that the shroud never came anywhere near Jesus. That’s the trouble with consensuses; it’s impossible to read every opinion there is, and to give each one its due weight. Fifteen people parroting one opinion may be of less importance than two or three deriving opinions of their own from their own exploration of the subject. Almost all the scientific papers on shroud.com do not, in fact, come down on one side or the other. Their thrust is more towards whether the shroud image occurred naturally or artificially. Naturally, in this case, usually includes supernaturally. On this subject, I believe the consensus is that the shroud image is natural.These two consensuses are, of course, difficult to reconcile, and therein, I believe, lies the enduring fascination of the shroud. Attempts have been made to use probability to settle the matter one way or another, but they have been somewhat naive.\nI’m not sure I follow Jean L Gabriel’s question. Our knowledge of particular first century crucifixion victims is vanishingly small. Our knowledge of crucifixion at all is pretty slight. Archaeology has given us two scribbled drawings and a heel bone with a nail in it. In modern forensics, we might make a list of all the characteristics on the shroud and compare them with a list of possible victims, to see which one fitted the evidence best. The trouble with the shroud is that we only know one of the possible victims, and we don’t know if he was typical of hundreds, or unique. If being crowned with thorns and pierced with a spear are unique indicators, we need look no further, but there is no evidence that they were. Or weren’t.\n\n","date":"January 26, 2013 at 7:55 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22713","author":"Hugh Farey","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"I failed to give note that this post was based on a tip from Kelly Kearse. Kelly didn’t complain, I just noticed the omission. Apologies.\n\n","date":"January 26, 2013 at 7:25 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22707","author":"Dan","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Dan,\nNot necessary, no problem :)  Thanks\n\n","date":"January 26, 2013 at 8:29 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22717","author":"Kelly Kearse","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Regarding the identity of the man, if we can assume that the forensic pathologists are correct, ie Bucklin, Zugibe and others, that the man seen on the shroud was a real man who died from the wounds pictured. AND if we can assume that the blood chemistry is correct, ie Adler, Heller and others, that the blood is in fact blood from actual wounds. Then there are two choices, either the shroud is the result of an actual crucifixion or one that was staged.  The problem with the staged hypothesis, is that as far as we know, corpses do not make images on linen shrouds.  There is nothing else like it in all the museums in the world…only shrouds covered with stains of body decomposition…no images. If it was the result of an actual crucifixion then a simple comparison should reveal the identity. The uniqueness of Christ’s crucifixion are numerous starting with a crown of thorns as a singular mockery as King of the Jews, severe scourging as a last ditch effort by Pilate to release him–he didn’t think he was guilty of a crime worthy of capital punishment–plus he was spooked by his wife’s dream. His  legs were not broken and he received a side wound instead because he was already dead when it came time to remove the bodies–consequence of the scourging no doubt. He was given an individual burial even though most who were crucified were thrown into a common grave.  He was wrapped in a very expensive linen–one suited for a high priestly garment.  All this together would indicate it is probably Jesus.  Is it Conclusive?  Not by today’s scientific standards—but probably enough to hold up in a courtroom as the “preponderance of evidence”–the burden of proof necessary for a civil trial.\n\n","date":"January 26, 2013 at 11:02 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22732","author":"Russ Breault","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Gentlemen, and ladies, of the jury; while I wholly agree with m’learned friend’s observations about what happened to Jesus, I submit that he cannot be at all sure about what happened to people who weren’t Jesus. The crown of thorns? Jesus was far from unique in claiming to be the rightful king. As Jesus Christ Superstar so charmingly put it: “You Jews produce Messiahs by the sackful!” Leaders of any insurrection might have been similarly treated. Legs not broken? This, we are told, is because he was already dead. No doubt a number of crucified victims were already dead and didn’t need the bother of having their legs broken. Scourging? A common punishment; whether or not as a prelude to crucifixion we just don’t know. Common grave? Then where are all the others?\nExpensive shroud? So he had rich friends. So would anybody who could finance an insurrection (see crown of thorns, above).\nMembers of the Jury, I do not dispute that the collection of pieces of evidence attested by the shroud point to Jesus, but I put it you that if a guilty/not guilty verdict hung on your decision, you could not say the case had been proved beyond reasonable doubt.\n\n","date":"January 26, 2013 at 12:03 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22736","author":"Hugh Farey","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"As far as I know, no one else EVER claimed to be King of the Jews! Your thought that the concensus is the opposite is just plain rediculous, sorry. Common crucifixions did not as far as I’ve read, include the extent of scourging witnessed by the victim on the Shroud. This was a rarity amongst crucifixions. Common graves?  How many bones would you expect to find, which hadn’t been carried off by wild animals? The concensus follows that crucifixion in this fashion did not last, and can be claimed to be within the first few centuries AD, at the latest. The point was originally that with all these ‘particular’ details mentioned, and put all together, what would the ‘chances’ be that some other unlucky soul suffered the ‘exact’ same. Statistically it is in Billions to 1, and that is conservative. To argue otherwise, is simply being blind to the truth.\nI am not alone when I say there is NO doubt the man on the Shroud is Jesus or a depiction of him, and not someone else.\nR\n\n","date":"January 27, 2013 at 11:44 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22827","author":"Ron","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"In response to Advocatus Diaboll Hugh and supplementary to salient points made by Advocatus Russ: \n(i) The victim was Jewish, as evidenced by his long hair and beard, whereas it was the custom in other contemporary cultures to be clean-shaven and short-haired; \n(ii) The Shroud is clearly a burial cloth with the victim laid out in death, but is unique in that there is no body present; \n(iii) The image is that of a body within no more than 40 hours of death as there no sign of corruption.  \n(iii) There is no evidence of smearing of fluid remnants nor damage to the cloth resulting from deliberate removal of the body within the 40 hours of death by persons unknown; \n(iv) Ergo the body disappeared within 40 hours of death by some means unknown, but very likely by the process called resurrection; There is only one crucifixion victim in history who has a claim to have been resurrected; \n(v) The cloth having contained a dead body and being blood-stained was to be deemed “unclean” by the same Jewish culture and therefore not to be conserved nor revered, but nevertheless for some good reason was so conserved and revered; \n(vi) Advocatus Diaboli assertion: “Common grave? Then where are all the others?” is most peculiar.  Is he denying that the bones of other crucifixion victims, of which there were countless thousand no longer lie in the soil of the Middle East but have also been resurrected?  But if he is looking for evidence of crucifixion among these bones he will not find it, as it was the common practice of Roman soldiery to recover crucifixion nails because they were highly prized as medical talismans.  It is only the case of a jammed heel-bone nail which could not be so recovered that this nail provided evidence of crucifixion in the particular case he mentions.  .  \nI conclude that the circumstantial evidence is far more conclusive than Advocatus Diaboli allows, and that indeed the case is proved beyond all REASONABLE doubt!  Those who wish to maintain UNREASONABLE doubts may do so if they are so inclined to hold to such view.  But that is not how the judicial system works!\n\n","date":"January 26, 2013 at 3:27 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22753","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Thurston the Shroud skeptic who made Pia and Vignon miserable, stated that it is either the Shroud of Jesus or a forgery intended to be Jesus. He opted for the forgery. The story of Christ’s crucifixion has survived nearly two millennia. If the skeptics have another candidate tell us who he is. You can’t because only one figure in history was treated the way Christ was and there is not the slightest scintilla of evidence that anyone else was. \nFrankly, I  feel sorry for those who are so embittered against Christianity (for some very good reasons by the way- the Fourth Crusade is maybe reason enough) that they can not recognize the truth that is before them, truth that is proven BY SCIENCE.\n\n","date":"January 26, 2013 at 4:07 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22754","author":"John Klotz","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Advocatus Diaboli! I love it. I think daveb has inferred my modus operandi, in shroud studies as in the rest of my scientific endeavours. As essential for the conversion of hypotheses into facts as for the conversion of good men into saints.\nI don’t know how many first century Jewish common graves have been excavated, but surely we don’t actually need a nail to infer crucifixion. A hole in a heel bone would do. Are there any? Nope. And curiously (perhaps) the only crucified bone we have was found in an ossuary, not in a common grave.\n\n","date":"January 26, 2013 at 5:41 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22760","author":"Hugh Farey","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Try excavating Jewish graves with a muster of the ultra-orthodox throwing rocks at you, the usual experience of archaeologists there.  A nailed heel-bone – that was an act of incompetence presumably by a rookie soldier – the usual technique was to nail between the talus bones in the feet – check Barbet – he explains the usual process in great detail.  I know about the popped carpal wrist bone found in an ossuary.- oddly the only other evidence in that ossuary was a few fibres of a burial cloth – James Cameron hoped to get a match with the Shroud – perhaps he made a tactical error in consulting the Jesuits about it – it came to nothing – incompetence upon incmpetence – Shades of Talpiot!\n\n","date":"January 26, 2013 at 6:20 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22764","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Error in mine above – it was not James Cameron seeking to get a match between fibres in the Talpiot Jesus ossuary and the TS, but Charles Pellegrino, one of the authors of a book on the Talpiot tomb.\n\n","date":"January 26, 2013 at 7:18 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22768","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Charles Pellegrino consulted the Sri Lankan diocesan priest Father Mervyn Fernando, a close friend of Arthur C. Clarke for twenty-five years, about the Talpiot tomb and was referred to Corinthians, chapter 15. Apparently the priest also jokingly told him that it was doubting Thomas who was buried in the tomb. Father Fernando’s expertise lies in Teilhard de Chardin studies, quite different from what Clarke, who believed that life was finite, was pursuing. Pellegrino may have consulted Franciscans in the Holy Land, which Jesuits one can’t say. The opinion of one Jesuit — no Shroud enthusiast — known for impeccable critical credentials appears in the article “Jesus was not buried in Talpiot, Parts I and II” on the HSG website.\nPellegrino mentioned MtDNA and “Jesus ossuary” bio-concretions ignoring the report published by Dr. Amos Kloner, who was Jerusalem’s District Archaelogist for many years, that as many as thirty-six people were buried in the Talpiot tomb. More studies are being undertaken but if care is not taken there will a lot more flights of wild imagination coming from those well-known quarters.\n\n","date":"January 27, 2013 at 10:34 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22822","author":"Louis","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"I doubt if Pellegrino would have had a problem with 1 Cor 15.  It may have influenced a comment he once made that apart from the carpal wrist bone that the only other evidence in the Jesus ossuary were traces of linen fibres.  Some place had to be found for the immediate placement of the burial cloth as it contained blood, and an ossuary in a family tomb would be as good as any other.  Dr Kloner may be correct in his assessment of 36 persons being buried at Talpiot, but otherwise ITA archaeologists generally generate no confidence in any of their assessments of potentially Christian burial sites.  \nThe whole Talpiot business was badly mishandled from the very beginning.  It was exacerbated by (1) the initial rushed investigation (2) ultra-orthodox Jews attacking the archaeologists (3) the demands of the Israeli developers for quick access to the site for their building work (4) the ITA policy of cleaning newly discovered ossuaries without gathering any useful scientific information of their contents (5) Jacobovici’s outrageous sensationalist claims and assertions (6) The predictable conservative evangelical Christian reactions to those outrageous claims (7) Western archaeologists miffed at amateur investigations (8) The defensive posturing of the ITA in the aftermath (9) The failure to take proper account of statistical probabilities in the combination of names appearing on the ossuaries.  \nNo-one knows nor ever will know the truth about Talpiot, because it was sheer incompetence upon incompetence!  And now it is too late because any useful information that might have enlightened has now been irretrievably lost, and positions have become lamentably entrenched.  It might well have become one of the most important early Christian sites in Christendom, or not as the case might be. Jesus was not buried at Talpiot but in Joseph of Arimathea’s tomb – then he rose from the dead.  But what happened to his burial cloths afterwards?  Nobody knows! Too late! Too late!\n\n","date":"January 27, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22839","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Professor Kloner is a respected authority in Israel and archaeologists who deny this play into the hands of those judged to have made sensationalist claims and assertions. Generally these archaeologists are agenda-driven, with theological agendas of course, and strive to prove that the NT accounts are fiction and also that the OT is full of truth. One should be open to the truth in both cases and hard evidence should be provided by archaeologists or those claiming to be archaeologists.\nIt is the risen Christ, and not the burial cloth, that led to the birth of Christianity. Therefore there are no details about what happened to the cloth. To deny that is to buy de Wesselow’s theory, and there we are led to another agenda, this time with no theology, but meant to be pleasing to agnostics.\n\n","date":"January 27, 2013 at 7:05 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22847","author":"Louis","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"(1) Professor Kloner may be a respected archaeologist in Israel.  Louis claims he was District Archaeologist there.  I presume that means he was associated with the Israeli Antiquities Authority.  (the IAA – not ITA as I incorrectly had it above).  The IAA has its own agenda, which is to support the interests of the Jewish established religion there, to support Zionism, to defend its own questionable actions and errors, and has little interest in respect of any remnants in the origins of Christianity there; I have already commented on its inadquate treatment of ossuaries found there, whether Christian or other; \n(2) I am nobody’s catpaw, and desisting from any argument that might play into the hands of others is only relevant to point-scoring in a religious or political argument.  It can have no place in any objective scientific enquiry;  certainly there is little evidence of any kind of objective enquiry in the Talpiot case, and that is the nub of my complaint about it;   \n(3) Agenda driven enquiries are not the exclusive domain of agnostic archaeologists, nor the IAA defending the indefensible, nor sensationalist authors with books to sell, nor even biblical literalists and other evangelicals, but are to be found in every place.  Two such agenda driven personalities can be found in the personalities of such worthy churchmen as Canon Ulysse Chevalier and Jesuit apologist Herbert Thurston.\n\n","date":"January 28, 2013 at 4:36 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22878","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Consensus again… to my mind, a consensus is achieved when the majority of a group of interrelating people agree on something. I believe, for example, that there is a consensus among climate scientists that global CO2 levels are increasing. There are many scientists who disagree, but the consensus is… etc. etc.\nIt is in this context that I believe that, if there is any consensus at all, the consensus among those interested in the shroud is that it is not the burial cloth of Jesus. That doesn’t mean it’s true, it’s just what most of them believe, I think.\nAs to people who claimed to be king of the Jews, the ever-useful Wikipedia lists eight others from around the time of Jesus, from Simon of Perea (c. 4BC) to Lukuas (115AD), and they were just the leaders of the main revolts against the Romans. Any of them, or any of their officers might have merited some form of mock-helmet. The identification of the injuries made by a cap of spikes with a royal crown is very much a post hoc propter hoc argument.\nAs far as Ron has read, he says, crucifixions did not normally include a severe flogging beforehand. I would be interested to know of any first or second century sources for that statement, and whether they applied across the Roman empire, or locally to the area from which they come. My own reading suggests that we simply do not know.\nSimilarly, I do not believe there is any evidence that Jewish crucifixion victims were ‘normally’ thrown into common graves, and even if they were, I do not believe the graves were then likely to have been excavated by wild animals. As I have mentioned, the only crucifixion victim whose remains have been identified as such was in a family ossuary. Daveb suggests, sensibly, that there may be no way of identifying crucifixion victims from their bones anyway, except in the case of the poor chap whose execution was bungled.\nRon concludes his latest comment by saying that there is no doubt that the shroud is Jesus – “or a depiction of him.” While I agree that if the image is a depiction, it is most likely that it is a depiction of Jesus (not a certainly, as there are a few other candidates, but a strong probability), I think that if it is not a “depiction,” then the probability that it comes from the body of Jesus is considerably less.\nAs to the consensus being “ridiculous” then for all I know Ron might be right; lots of consensuses are. That doesn’t stop them from being consensuses, however.\nFinally, although I have said that I think estimates of probability are naive, I think that of behalf of the ridiculous consensusees, I’ll try to make one. I’m going to claim (and I challenge anyone to produce archaeological or historical evidence against these), that 25% of all crucifixion victims did not have their legs broken but were stabbed as a confirmation of death, that 5% were mercilessly flogged before being crucified, and that 1% were treated to a spiked helmet or crown. Assuming these three treatments were independent, then 1 in every 8000 crucifixions had injuries similar to those on the shroud. Let us suppose that the Romans crucified Jews for about 400 years, at a rate of 1 a day except during rebellions when the number rose to 500 a day according to Josephus. Let’s go for a total of 160 000. That means that 20 were crucified in the same way as Jesus. Of those, one left a shroud that remains to this day. I wonder which one…\n(daveb, I’m sure, will counter this argument very reasonably, but I make it just to show that wild claims of billions to one owe more to hopeful faith than to statistics)\n\n","date":"January 27, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22849","author":"Hugh Farey","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"NT scriptures suggest that Jesus was scourged ‘excessively’ and only because Pilot did not find him deserving of crucifixion, initially. This along with the use of some commonsense would seem the reasonable conclusion, as it would be very unlikely the Romans would want to bring any victim to near death before they were crucified.Crucifixion was supposed to be a long drawn out affair, afterall. As for your Kings, and with a quick Wiki read; Simon of Perea was beheaded, Lukuas apparently disappeared with no trace…so we can rule them both out as being the ones we see on the Shroud. Please list the others so we can eliminate them also as candidates.\nFurthermore, crucifixion victims in most of the Roman world were purported to have been left on they’re crosses to rot or to be devoured by animals as a deterent to others. Only in Judea, since the Jewish law would not allow for the bodies to hang overnight, were victims likely removed. So it is safe to assume they would be taken down, and since in only one instance has evidence of a crucifixion victim ever been found in tombs, out of hundreds of finds, it can and is safely assumed by most archaeologists, that most crucifixion victims would have been buried in mass graves, and likely open graves. As for your concensus, lets not forget this victim of the Shroud just happened to be removed from the Shroud within 36 hours, (this is assuming ofcourse it is a real burial Shroud and not a depiction, which most all scientific evidence seems to agree).\nRon\n\n","date":"January 27, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22850","author":"Ron","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"I think Ron may be incorrect in asserting that it was the regular practice to dump Jewish crucified bodies into a common or open grave, and that Jesus is the only know case of a decent burial.  Pierre Barbet was not only a highly competent pathologist, but he was also a competent scholar in the classics.  And this competency illuminates much of his book “A Doctor at Calvary”.  He is able to cite several classic authorities on the then current practices. Ron can find in Barbet’s work that relatives’ requests for the bodies of executed criminals were usually granted as a matter of form, and were only denied for the worst offences such as piracy, rebellion or general insurrection, or when the military wished to make an impression on the general population.  Barbet even comments that acceptance of bribes for the bodies was considered immoral by the Roman authorities.  \nComing now to Hugh’s question as to the identity of the TS man, I have another challenge for him and I’m about to raise the probability stakes. \nIt is known that there was such an object as the “The Image of Edessa”, which lies behind the 3rd century Abgar legend, or the Doctrine of Addai.  The principal in the legend is King Abgar V, a 1st century contemporary of Jesus, but which in reality more likely refers to King Abgar VIII the Great in the 2nd century and who is credited with establishing Christianity in the city by about 150 AD, certainly by 200 AD.  The “Image of Edessa” was said to be a miraculous portrait of Jesus, which soon afterwards disappeared, possibly to Antioch, but resurfaced in Edessa about 525 AD,  Very many copies of the “Image of Edessa” were made and distributed throughout eastern Christendom, including for example the Christ Pantocrator, along with many others.  The “Image of Edessa”, whatever it was, was eventually taken to Constantinople becoming part of the King’s relic collection.  \nNow Hugh can make any number of comparisons he likes with these various early portraits of Christ.  He will then discover, perhaps to his astonishment, that many of these very early portraits of Christ bear an uncanny resemblance to the facial image on the Shroud.  This was first observed by Paul Vignon around 1902.  The writer Ian Wilson made what he believed was a strong case for the Image of Edessa being the Shroud folded in such a way as to conceal its identity as a burial cloth.  Practically all Byzantine art historians disagree with him, but this is irrelevant to the thread of the present argument.    \nThe point is that standard likenesses of Christ were developed in the very early centuries of Christianity, which had as their basis an alleged image of him.  And these likenesses conform to the facial image of the TSM.  I agree that it is possible that these early Edessans and their various copyists might, just might have been mistaken as to the identity of the person on whatever the image was they happened to have.  But nevertheless it raises the probability stakes in the jigsaw, and it is becoming less circumstantial than ever.  \nWork with that one, Hugh!   Kind regards, daveb.\n\n","date":"January 28, 2013 at 5:42 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22886","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Daveb; “I think Ron may be incorrect in asserting that it was the regular practice to dump Jewish crucified bodies into a common or open grave, and that Jesus is the only know case of a decent burial.” – Dave I never asserted this conclusion, it has been concluded or surmised by many archaeologolists. This assertion comes from the fact that only in one case as evidence ever been found of a crucified victim from the many tombs in Israel. I did not mention Jesus, I was referring to the Givat HaMivtar findings as the only find. Since in hundreds of finds, evidence of crucifixion appears only once it is assumed most crucifixion victims would or must have been buried in mass graves. Although no mass graves have been found to date to back this assertion, there may be several reasons for this, including the graves may have been left open for a period and bones scattered.\nR\n\n","date":"February 2, 2013 at 6:43 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-23223","author":"Ron","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Well. I think we looked at this some months ago, in connection with the coins of Justinian II of Byzantium. Suffice it to say that until the statue of Zeus from Olympia was removed to Byzantium in about 420AD, most (all?) pictures of Christ had short frizzy hair and a stubbly beard. When pictures of Christ with long beard and hair appeared, some people deplored the fact that he resembled the statue of Zeus, and Theodoros Anagnostes claims that the first painter to produce one suffered a withered arm in consequence, although the church’s rapid acceptance of the style is demonstrated by the painter’s recovery after the intercession of Archbishop Gennadios. The Image of Edessa appears about a hundred years later, although legend has since given it earlier, spurious, provenance.\nBack to Ron. Nowhere in the bible does it appear that Jesus’s scourging was ‘excessive.’ Only John even mentions scourging, and Luke implies that Jesus was given more of a token punishment – a chastisement, as some translations have it. Matthew and Mark refer more to a general beating-up than a judicial punishment.\nA list of Jewish Messiahs can be found by typing in ‘Jewish Messiahs’ in Google, and Josephus’s mentions of crucifixion by typing in ‘Josephus Crucifixion.’ I should be interested if Ron can find a link to a single one of his ‘most archaeologists’ who think mass open graves were a feature of first century Palestine. Either way he seems to disagree with them himself by quoting Josephus, who says that Jews took particular care of their dead and buried them before nightfall.\n[and how about this for a frivolous coincidence? Look at the left hand of the statue of Zeus preserved in Leningrad, and then at the right hand of almost any pantocrator. Wouldn’t it be funny if that peculiar ‘blessing’ gesture, of some fingers curled around an invisible staff and others pointing upwards, in fact derived from a statue, transported from Olympia to Byzantium, which was missing its spear. You read it here first, folks!]\n\n","date":"January 28, 2013 at 10:15 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22910","author":"Hugh Farey","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"Therefore following through on Hugh’s logic, by noting the resemblance between the Shroud’s facial image and the various early icons, Justinian coins and so on, we may deduce that not only the Shroud but whatever the Image of Edessa was, (if it was not identical to the Shroud), are actually the burial cloth and an image of the totally mythical Greek god Zeus.  I can understand why we read this preposterous hypothesis on this blog first.  Most pseudo-skeptics, often quite intelligent people, can come up with more credible, though hardly as imaginative, arguments.  Advocatus Diaboli will have to do a lot better than that!  Must try harder!\n\n","date":"January 28, 2013 at 3:11 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22929","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"The Colorado center has just made public http://www.shroudofturin.com/shroud.html a very interesting document ” The Shroud   A Critical Summary of Observations, Data and Hypotheses ” with many of the things we customarily discuss in this blog\n\n","date":"January 28, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22933","author":"Gabriel","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"The identification of the pantocrator images with Zeus goes back much further than this blog, and appears almost unquestioned throughout most of the historical studies of Byzantine iconography and numismatology. The suggestion that it might be based on the shroud is relatively new (c. 1970) and not as far as I know (but how can I find out?) yet part of mainstream Byzantine consensus (ah! that word again…). In the unlikely event that that the previous couple of hundred years of historical supposition turns out to be true, then the shroud was ultimately based on the pantocrator, not the other way round. If it was a very early production, it may have become a self-fulfilling prophesy, as it were, and then become the model for lots of icons which indeed were based on it. Preposterous as this idea seems to the illuminati, it is not, I think, without considerable support.\n\n","date":"January 28, 2013 at 6:22 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22937","author":"Hugh Farey","site":"shroudstory"},{"title":"Eric J. Jumper to Speak on the Shroud of Turin","post":"There is a very funny charge against me on this blog: I “claim that Professor Amos Kloner was the District Archaeologist for Jerusalem”. It is always more convincing to get facts straight before making any comments. The Israel Antiquities Authority (IAA) is a respectable institution and has excavated Christian sites in Israel with all the attention they deserve, just as they do with Jewish sites. Here again, anyone who is interested in getting the facts straight should know that. So far there there is absolutely no evidence that Talpiot was a Christian burial site, more work will be done, but as remarked earlier if care is not taken there will be more flights of wild imagination. \nCanon Ulysse Chevalier and Father Herbert Thurston were highly respected authorities and there are agenda-driven papers in the realm of Shroud studies also. No wonder the Church and many churchmen continue to remain silent on authenticity.\n\n","date":"January 28, 2013 at 6:44 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","id":"comment-22940","author":"Louis","site":"shroudstory"}]
