[{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"“Last Saturday I gave two sold-out presentations at the truly amazing Children’s Museum of Indianapolis and got to see their beautiful National Geographic Sacred Journey’s Exhibit in person.” \n“Sold out”. That kind of says it all, in more ways than one…\n\n","date":"September 24, 2015 at 7:26 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211052","author":"Colin Berry","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"I might have phrased it differently. One could look at Barrie’s pro-authenticity stance, and many appearances promoting that stance, as evidence that he is no longer an objective sindonologist. Should he then be the ‘face’ of STERA – which should be recognized as an objective organization? Optics matter. I think that is a fair question, respectfully.\nDo I think he is doing these talks/presentations simply for monetary gain and late-life fame? No. But I can’t know his motivation without being able to read his mind and heart. Can anyone besides Barrie?\np.s. His referencing the ‘sold-out’ presentations I take as his way of conveying the great interest in the Shroud. I didn’t see it as grandstanding. But that’s my take, others may feel otherwise.\n\n","date":"September 24, 2015 at 8:44 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211061","author":"David Goulet","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"I think otherwi$e, DavidG. Who foots the bill for all this globetrotting (like responding to an invite from, and then carefully pandering to the Big Tent in Hampshire)… ?\n\n","date":"September 24, 2015 at 9:05 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211063","author":"Colin Berry","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"David: “Do I think he is doing these talks/presentations simply for monetary gain and late-life fame? No. But I can’t know his motivation without being able to read his mind and heart. Can anyone besides Barrie?”\nCB: “I think otherwi$e, DavidG.”.\nSee this infamous “$” \nI know personally Barrie since about 10 years. \nI know that he is the most honest person I ever meet.\nHis motivation? David, I can’t believe you don’t know his motivation. \nI am disgusted by these comments.\nAdieu.\nThibault.\n\n","date":"September 24, 2015 at 2:58 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211093","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"For the record, Thibault, I think Barrie is a genuine and very good person. I do not believe he is motivated by $ – but I’m not his confessor either. I think Colin’s comment was poorly framed and betrayed a personal bias – but there is some validity to his observation that optically it may appear Barrie has lost some objectivity on the debate — confirmation bias is something anyone can be guilty of. I also think it is healthy, for even humble and decent people, to be constructively criticized from time to time, as this is what keeps them humble and decent. I mean no disrespect to Barrie, I’m merely trying to see both sides of a point.\n\n","date":"September 24, 2015 at 3:09 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211094","author":"David Goulet","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"David, the problem is what you consider “objectivity”.\nThe problem is that nowadays, we are being manipulated from all sides on unparalleled scale. All media, TV, radio stations, newspapers, internet portals have their own point of view, which they often want impose the public. Being really ‘objective’ this days is really hard task.\nAnd in the world of the Shroud, it is even harder. Everyone has his or her opinion on all relevant matter, and judging who is right, and who is wrong, is extremely hard, especially for inexperience person. Which is often utilized by some people -mostly sceptics, but not only -who try to spread confusion, blur the image, raise thousands arguments against usually accepted view (no matter if those arguments are nonsensical for those who have expertise), multiply the problems, issues , “what ifs”, and so on. Thus raising uncertainty and mistrust in usually accepted results -resulting eventually in a growing number of preys, who -disappointed by apparent lack of “objectivity” and with heads full of doubts -easily swallow the “alternative concepts” prepared by those who spread confusion, no matter those “alternatives” are actually rubbish. \nWhen you deal with such controversial topic as the Shroud, be prepared for plenty of half-truths and manipulations. And don’t get caught!\n\n","date":"September 24, 2015 at 3:31 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211102","author":"O.K.","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"I see Barrie’s position as almost exactly analogous to my own. Our persuasions are built on the evidence as we see it, and we are happy to explain exactly what that evidence is, and how our personal conclusions were arrived at. Neither of us are proselytisers for our opinions, and both are happy to explain our opponents’ points of view as well. Having met Barrie, I think I would also go so far as to say that we both suffer fools gladly, which is no doubt a factor in his popularity as a lecturer. And if anybody in the USA would like me to come and talk on the Shroud at their expense, I should be delighted.\nI don’t see why the ‘face’ of STERA, any more than the ‘face’ of the BSTS, shouldn’t have opinions, and shouldn’t let people know what they are, as long as we understand and respect everybody else’s point of view. I doubt if any similar historical/religious/scientific organisation is any more impartial than we are, and many are undoubtedly considerably less so.\n\n","date":"September 24, 2015 at 1:02 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211087","author":"Hugh Farey","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"“Neither of us are proselytisers for our opinions, and both are happy to explain our opponents’ points of view as well.”\nI never thought I’d live to see the presentational styles of Hugh Farey and Barrie M.Schwortz  being bookended here or elsewhere…\n\n","date":"September 24, 2015 at 1:24 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211089","author":"Colin Berry","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"I am grateful for Barrie for his interesting comments in one article on the orthochromatic film that Enrie used and the way it distorted the images on the Shroud. In the Santo Stefano complex of churches in Bologna there is a chapel dedicated to the Shroud which is  still using a Jackson / Jumper computerised three dimensional model  of Christ based on these distorted images. I was able to give my group a mini- lecture comparing it with the famous terracotta  Lamentation of Niccolo dell’Arca in a neighbouring church which has another three dimensional figure of Christ laid out for burial. Niccolo makes you think about how a dead body would actually look if it were laid out for burial.\n\n","date":"September 24, 2015 at 3:30 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211101","author":"Charles Freeman","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"I am grateful for Barrie for his interesting comments in one article on the orthochromatic film that Enrie used and the way it distorted the images on the Shroud. In the Santo Stefano complex of churches in Bologna there is a chapel dedicated to the Shroud which is still using a Jackson / Jumper computerised three dimensional model of Christ based on these distorted images. \nCharles, shut up with this nonsense.\n\n","date":"September 24, 2015 at 3:33 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211103","author":"O.K.","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"I am sorry  but I thought it was common knowledge – although I first  read of it in one of Barrie’s  articles – that the Enrie photographs  distorted the images because of their film  and thus were unreliable sources.\nIn a recent two page article of mine on the Shroud published in the (Anglican) Church Times to coincide with the papal visit to Turin, they used a close up-of the face on their front cover which showed it looking completely different from the Enrie photographs and ,it seemed, from the Durante photographs. But, of course, no one should be working from photographs.\nI don’t expect many takers from this site for my own lectures on the Shroud but for medieval churches trying to raise sums for restoration in Suffolk, they are free and the organisers keep what they charge for their funds. The last one raised well over £ 700.\nThe Santo Stefano model is a full size three- dimensional model made, I think, in some kind of plastic.\n\n","date":"September 25, 2015 at 12:31 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211142","author":"Charles Freeman","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Charles you may want to come in contact with a few of my Eastman Kodak peers who will contest that all films comes with anomalies. And in fact, color films has more. Especially if you think your E-4 film processing technician gave two hoots about the chemistry plot indicating leuco cyan.\n\n","date":"September 27, 2015 at 4:07 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211370","author":"Giorgio HSG","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Thanks,Giorgio. A professional photographer has been giving me lessons and that is her first mantra. A photograph never tells us what is really there. Yet, I was still surprised to learn, via Barrie’s article, quite how hopeless that Enrie photographs were for discerning the ‘reality’ of the Shroud.\n\n","date":"September 28, 2015 at 1:43 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211394","author":"Charles Freeman","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"I don’t think we must get carried away about the hopelessness of photography as a means of capturing an accurate representation of an object. As long as we understand the limitations of the various films/cameras/lighting/etc it is a very useful tool, and the Enrie photographs are no exception. Their main divergence from reality in in the contrast between the image and the background, but this is usually thought of as a benefit rather than a failing.\n\n","date":"September 28, 2015 at 4:13 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211402","author":"Hugh Farey","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"I agree with Hugh’s assertion. I like to add that photography is a great tool for documentation of supporting evidence. As for the Ernie’s image,  I think it’s exceptional.  His understanding of lighting and the film’s characteristics is evident in his images. He was able to  compensate for the film’s inherent blue green sensitivity by increasing his exposure and by formulating his own developer.  His first generation prints can clearly distinguish between the blood and the charred scars left from the fire. With the original plate still in existence, pan masking techniques can be employed that can further increase the films gamut.  But the fact remains, it’s still silver haloid.\n\n","date":"September 28, 2015 at 5:50 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211409","author":"Giorgio HSG","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Hi Giorgio\nYou are perhaps the best person to consult about the prints. I have about half a dozen slides from the Holy Shroud Guild and the quality is excellent, but the Giuseppe Enrie photograph is not one of them.\nYou know about Giancarlo Durante and HAL and there is an additional problem when it comes to film, as you can read in the exchange between Barrie Schwortz and Dr. Paolo Di Lazzaro, in Q/A 7:\n https://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\nWhat would you say?\n\n","date":"September 28, 2015 at 8:59 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211416","author":"Louis","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Hello Louis, I agree with Barrie’s assessment completely. Cyan dyes are the most unstable and will be the first to fade. \nLight source itself are also problematic. Every light source is not equally balanced in Kelvin temperature. If I am not mistaking, Barrie had only three light sources to work with. 2 were 500 watts and 1 was 1000 watts. He positioned them at 45 degree angle or so with the set of 500’s at one end of the Shroud and the 1000 watt source at the other. The poor guy had to work with time constraints and the material he had on hand. It’s a miracle he was  able to capture technically sound images with the tools he had. Also keep in mind, shooting with tungsten film that diverges or converges certain light waves to achieve white light balance becomes problematic in fine research because it’s either discards  or absorbs certain  light waves.\n As for your second question, I do have a copies of the Durante’s image but not of Hal. As far as Enrie’s images, it’s unfortunate that the Guild didn’t have anyone that understood film. and as a result, the Guild passed along many poor Enrie duplicate copies that I wish they didn’t. In one such example, Dr. Jackson announced in the 1977 Shroud Conference hosted by the Guild,  that the 1973 color photos obtained by Battista and Cordiglia were far superior than the Enrie’s images. Of course that was not the case, however Dr. Jackson was never privy to the original 16×20 glass plates and would have know idea of the resolution and the actual contrast of the film. As a result, the Enrie image was condemned from that moment  by many Sindonologist from this side of the Atlantic.\n\n","date":"September 28, 2015 at 10:14 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211420","author":"Giorgio HSG","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Thanks for the response, Giorgio. The situation is complicated, and therefore it seems that we will have to depend on the almost 2000 microphotographs taken during the restoration. They will fill the gaps and enable us to clear doubts.\n\n","date":"September 28, 2015 at 10:44 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211428","author":"Louis","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"The difference, to me, Hugh, is that Barrie appears to have been co-opted as a champion of the authentist side. That’s not his fault. He’s been put on a pedestal by some, to the point I  feel like he’s being upheld by some Christian Shroudies as a modern Nicodemus — ‘the good Jew’. Because he remains Jewish this makes him even more ‘valuable’ as an icon. The fact that he’s a warm and charming man only makes him more desirable as a champion. I’m talking plainly and openly here, I mean no disrespect to anyone.\nThere’s a palpable emotionalism tied to his relationship with the Shroud. This is not the case with you on the other side of the debate.\nWe all know that there is much more to this debate than just science and history. The Shroud is a lightening rod for our deeper beliefs. Barrie is not just another Shroudie, he’s much more. He didn’t plan it that way, no one did. It’s an organic process driven by human psychology and, dare I say, providence.\n\n","date":"September 24, 2015 at 3:23 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211098","author":"David Goulet","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"addenda, when I speak of emotionalism I don’t mean from Barrie, but from others.\n\n","date":"September 24, 2015 at 3:24 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211099","author":"David Goulet","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Hugh has clearly stated his position, one that he has always held, and I can only find one difficulty. This is when he says:\n“I don’t see why the ‘face’ of STERA, any more than the ‘face’ of the BSTS, shouldn’t have opinions”\nIt should actually be “faces” because both BSTS and STERA have members. Obviously one cannot ask all those who subscribe to the BSTS newsletter — some 300 when Ian Wilson was the editor — about their views. However, STERA has just a few members on its board of directors and the website is said to be open to factually supported views.\nWhat we should know is whether all the members of the board think alike, that is, what exacty do they think is factually supported views. What does each member see on the Shroud?\nPerhaps Joe Marino, who is generally the PRO, should be able to answer this question.\n\n","date":"September 24, 2015 at 3:19 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211097","author":"Louis","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"If folk here were invited to give a talk on the Shroud to a Children’s Museum, would they want the parents to be charged an $18 dollar admission fee? What if those same parents came to this site, and discovered Barrie M.schwortz soliciting for voluntary donations to support his website and STERA, on the grounds they are ‘non-profit making organizations’?\nBarrie M Schwortz, now a self-styled scientist,  fronts what can only be described as a pro-authenticity road $how. It must be a nice little earner…\n\n","date":"September 24, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211104","author":"Colin Berry","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Colin, why don’t you try yourself? Or do you have $$$ up to the hilt?\n\n","date":"September 24, 2015 at 3:42 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211105","author":"O.K.","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"OK: It’s getting on for 4 years since I took a third look at shroudology (post STURP, post radiocarbon dating) and decided to do what probably no one has attempted previously, namely to report a research investigation online and in real time, from start to finish, no matter how long it took. Expenses? Certainly – but all hobbies involve some expense. If mine weren’t for linen, chemicals, microscope etc it would be for bikes or golf clubs or craft beer…\n\n","date":"September 24, 2015 at 3:55 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211106","author":"Colin Berry","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Expenses? Certainly – but all hobbies involve some expense. If mine weren’t for linen, chemicals, microscope etc it would be for bikes or golf clubs or craft beer…\nSimilar issue.\nAnyway:","date":"September 24, 2015 at 3:58 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211107","author":"O.K.","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"It looks like we are going to have to moderate.\n\n","date":"September 24, 2015 at 6:37 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211115","author":"Dan","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Colin, I certainly hope that Barrie earned several thousand dollars for STERA with his recent talks–but he probably didn’t.  Why is it that people feel that a comedian, musician, magician or any number of thousands of people on the college, church or corporate lecture circuit can command $5K, $10K up to $50K for a one hour talk, yet if someone speaks professionally on the Shroud it should be free.  That is total BS and you know it.  When someone stands up before a crowd and offers their lifelong expertise on a subject, takes two days out of their life and endures the hardships of travel, they better damn well get paid for it.  It is ludicrous and obtuse to think otherwise.\n\n","date":"September 24, 2015 at 8:02 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211123","author":"Russ Breault","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Dan: \nSorry, but you blog appears to be now something like a an English tabloid.\nSee for example: “Barrie M Schwortz, now a self-styled scientist, fronts what can only be described as a pro-authenticity road $how. It must be a nice little earner…”\nWhat do you think?\n\n","date":"September 24, 2015 at 4:05 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211108","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"It is too bad.\n\n","date":"September 24, 2015 at 6:40 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211117","author":"Dan","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"At least English tabloids can be relied upon to spell Inidanappolis (sic) correctly…  ;-)\n\n","date":"September 24, 2015 at 4:33 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211110","author":"Colin Berry","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"“‘Sold out”.  That kind of says it all, in more ways than one…   “Who foots the bill for all this globetrotting”  “It must be a nice little earner…” are risible comments.  And to use $ in places of “s” is just disgusting.\nBarrie earns a very modest salary as President of STERA.  His car is 19 years old.  Organizations pay for his travel expenses and give an honorarium–what’s so questionable about that?  That’s just standard for most speakers.\nBarrie says on his site it’s up to people to decide if they believe the Shroud is authentic or not.  He doesn’t keep track of how many people end up deciding if the Shroud’s authentic or not.  Barrie lets his board of directors vote on whether papers should be added to the site.  Regarding Louis’ question about what does each member see on the Shroud, that’s an impossibly complex answer and I don’t want to speak for others.  I personally have been open to different opinions about the Shroud, having published anti-authenticity articles in the printed newsletter I used to do and allowing anti-authenticity papers to be read at conferences in Columbus and St. Louis.\nWith comments as cited at the beginning of this being posted, it’s no wonder some people just choose to ignore the blog.\n\n","date":"September 24, 2015 at 6:55 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211118","author":"Joe Marino","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Colin keeps saying he is leaving this blog. This time, I’m saying it. At least for awhile.\n\n","date":"September 24, 2015 at 7:28 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211122","author":"Dan","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Thanks for the response, Joe. My emphasis was on what is said to be factually supported views and I suppose there are big differences between STERA members, given what one reads and sees.\n\n","date":"September 24, 2015 at 7:25 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211120","author":"Louis","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Let me start by thanking Hugh Farey, Thibault Heimburger, Joe Marino, O.K. and David G. for their kind words and their support. It is truly appreciated. Even though Hugh and I disagree on many issues, we share a mutual respect for each other’s points of view and we definitely had an enjoyable time together at the Hampshire event in August.\nFor the record, the term “sold out” in my recent post was taken directly from the description of my presentations on the Museum’s website (https://www.childrensmuseum.org/exhibits/national-geographic-sacred-journeys/barrie-schwortz) and had nothing to do with finances. Admission to my lectures was free and was simply included with a paid admission to the museum. All of the proceeds go directly to support this amazing facility, which happens to be the largest children’s museum in the world. (Look it up). \nI would never get to travel and lecture anywhere if STERA, Inc. had to bear the costs, so all airline tickets, hotels and most meals are typically covered by the sponsoring organizations. As for the event in England, all my expenses were covered by the Review of Religions, the publication that invited me to attend and served as my sponsor. However, neither STERA, Inc. nor I received ANY honorarium or payment for speaking at their Jalsa event. I attended solely to open a dialogue about the Shroud with a very large Muslim group that expressed a sincere interest in the subject matter and a deep belief in its authenticity. That was enough for me to set aside my own personal concerns and inhibitions and gratefully accept the invitation. How would YOU like to be a Jewish man attending a Muslim convention to discuss a Christian relic?\nYes, I do express my personal beliefs when I am lecturing or appearing publicly (as does every other Shroud lecturer), but I try to never do so on Shroud.com unless the article is clearly labeled as an editorial. That way people can separate my personal views from those of our board members or the organization itself. And no, there is never total agreement, even among the board members. If total agreement were essential for friendship in the Shroud world, NO ONE would have ANY friends! Most importantly, I never attempt to convince anyone of anything and always say so in my lectures. However, that philosophy is best expressed on the front page of Shroud.com, which has carried the following statement for almost 20 years:\n“We believe that if you have access to the facts, you can make up your own mind about the Shroud.”\nAs for “pandering” at the U.K. event, I was very open with the audiences and clearly stated that I personally believe the man of the Shroud was dead, knowing full well that I was challenging a core belief of the group that invited me. But I did so honestly and respectfully and I know that my position was appreciated by the audience. It was anything but pandering. In fact, the blogger in question lives in England and he could have easily attended the Hampshire event himself. If he had, he would have graciously been given an opportunity to express his own views, just as Hugh Farey, Pam Moon and David Rolfe did. Maybe he will do so at next year’s event, but I suspect he prefers the semi-anonymity of the internet rather than appearing anywhere in person. \nYes, STERA, Inc. usually does receive an honorarium for most of my lectures (including the ones I gave at the museum), but that is paid directly to STERA, Inc. and not to me personally. The lecture fees are a small part of our very modest revenue stream that supports our work and keeps the website free of any advertising. I receive a fixed monthly salary for my full time work in maintaining the website and taking care of the organization’s day to day business. Since we are a formal 501(c)(3) non-profit organization granted tax free status by the I.R.S., our tax returns are a matter of public record. In fact, Dan Porter has included that information on this blog in past years.\nOne final thought. I absolutely do believe that one can have a personal point of view and still remain objective. Does anyone actually believe that they are mutually exclusive or that every objective person in the world has NO point of view?  I have changed my mind many times on various facets of Shroud research and am willing to do so again whenever credible evidence is presented. I have been doing this for 38 years and have dealt with just about every skeptic that has come down the path. Fortunately, most of them are reasonably respectful and state their views professionally without the ad hominem personal attacks that this blogger has become notorious for. As I stated in a previous post on this blog, a little respect goes a long way.\n\n","date":"September 24, 2015 at 10:16 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211129","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Hey Barrie, i’m a pretty big fan of yours when it comes to the shroud. I’m writing an article right now nothing major just on a friends blog (i’m only 18) and since you’re a photographer i’m wondering if you have some good pictures showing the serum stains around the blood. I’ve seen a lot of good ones, but they are usually hard to find again.\nThanks!\n\n","date":"September 24, 2015 at 11:35 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211136","author":"Matthew L.","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Hi Matthew – Contact me directly by e-mail via http://www.shroud.com/email.htm and I might be able to help.\n\n","date":"September 25, 2015 at 12:41 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211143","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Well said Barrie.  All who actually know you are honored to be your friend.  You are a man of honesty and integrity and you shouldn’t have to defend yourself against idiots.\n\n","date":"September 24, 2015 at 11:51 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211140","author":"Russ Breault","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Thanks for this detailed rebuttal. Case closed.\n\n","date":"September 25, 2015 at 8:31 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211169","author":"David Goulet","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Why is Barrie M. Schwortz doing all this ?\n\n","date":"September 25, 2015 at 2:01 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211147","author":"PHPL","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"I still think it was a big mistake to go to Jalsa Salana, which is based on flawed history:\n https://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nWhat has been achieved? Painstaking research by Shroud researchers is being used to continue with the story that Jesus survived the crucifixion and went to India. From what I’ve read, pathologists do not say that they see Jesus “alive” on the Shroud.\nI am sorry to have to say that the pioneer American sindonologists Fathers Adam Otterbein and Peter Rinaldi must have turned over in their graves.\n\n","date":"September 25, 2015 at 8:31 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211168","author":"Louis","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Really Louis?  I guess they must have been spinning in their graves in 2010 when the spiritual leader of the Ahmadiyya Muslim sect (the one I visited in England) was given a personal viewing of the Shroud while it was on public display in Turin by none other than Msgr. Giuseppe Ghiberti, the then President of the Turin Diocesan Commission on the Shroud. (I’ll post a link to a video of that event in our next update). Do you think that was a mistake too? Apparently, you did not know Otterbein or Rinaldi personally or you would understand that they would not have allowed the fundamental differences between the two faiths to inhibit sincere dialogue about the Shroud.\n\n","date":"September 25, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211203","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Really, Barrie, I mean what I say and I will tell you why;\nMonsignor Giuseppe Ghiberti is a theologian, not a biblical scholar. In his position he could only be courteous, it was part of public relations, nothing more, and he would do the same if some “Jagadguru” of a Hindu sect had gone to see the Shroud.\nIt is correct that I never Fathers Otterbein and Rinaldi personally, but it doesn’t seem that it makes a big difference. So what is this talk about “sincere dialogue” they would accept? I make it a point to read what is being said, and from what I was given to understand there were to be two other sessions in Hampshire after the “Shroud talk”, one dwelling on Mark Guscin’s work on the Sudarium and the other on “Jesus in India”. Would the good fathers call this “sincere dialogue”? Can you show me any document to substantiate your claim?\nDid you notice that there was a board at Hampshire saying “The Holy Shroud”. How can it be called the “Holy Shroud” in a convention held by a sect that believes that Jesus survived the crucifixion and went to India? That would make Jesus the biggest liar, trickster or expert magician in history and the relic would have to be preserved not in Turin but in some Museum of magic and there are several of these in the world.\nMy article has been online for a number of years and I presume you have not read it. I received an e-mail from an important person investigating the Shroud officially, and whose name I cannot reveal, telling me that it laid the Kashmir tomb theory to rest:\n.  https://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nIn this article there is mention of a Russian man who believed Jesus had been to India, apparently indulging in make believe because of his private agenda. It is on some of this man’s research that Holger Kersten based his book. I am only mentioning Kersten here because you mentioned him during the Q/A at the end of your talk in Hampshire. Was it necessary to mention him? Wasn’t that a sign of encouragement for the sect that is claiming that Jesus is buried in India?\nI have to go go further on this point and ask: would you do the same thing when lecturing on the Shroud in the Catholic and Protestant churches in the USA?\nIf it is your interest in promoting “sincere dialogue” there are other Muslim sects about which you may not be aware. One of them believes that Jesus was indeed crucified and died on the cross:\nhttp://ismailignosis.com/2013/03/29/the-crucifixion-in-shia-ismaili-islam/\nI am obliged to go further and say that obsession with monotheism can be dangerous. You must be reading the news. Einstein wrote against it, but for different reasons. And what was that? He was a scientist, and was influenced by Spinoza. I prefer to subscribe to Descartes’ view until there is real evidence that can prove he was wrong. I have a very learned Orthodox Jewish friend and we sometimes discuss world events and the Bible over coffee. He once asked me why Christians could not view Jesus as Jews viewed Moses. He believed in Jesus’ sayings as spiritual. He then told me that he believed that the Koran’s view of God was different from what is written about the deity in both Torah and Tanakh. See how it is? Whose monotheism is correct?\nIn today’s sceptical world, churches are becoming empty in Europe, American youngsters are not that religious, 70% of Israelis are secular. It is due to what RD wrote, and also due to world events. Freud became highly sceptical because of the evil he knew that was coming with the Nazi holocaust:\nhttps://www.academia.edu/15308857/Freuds_incomplete_speculation_on_monotheism\nand the scepticism is even seen in literature:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\nThere is a lot to think when there is time.\n\n","date":"September 25, 2015 at 7:03 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211210","author":"Louis","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"You point out that obsession with monotheism is dangerous. Something else that is dangerous is to be obsessed with imposing a narrative onto other people’s lives.\n\n","date":"September 25, 2015 at 7:24 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211214","author":"David Goulet","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"David, could you please explain further, with reference to the discussion?\n\n","date":"September 25, 2015 at 8:00 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211217","author":"Louis","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"Further to my previous comment, who got a really special showing in 2010, with the right to swing incense in front of the Shroud, was a Russian Orthodox prelate. Click on the first image on the right:\n http://www.spc.rs/eng/metropolitan_hilarion_leads_worship_shroud_turin\n\n","date":"October 4, 2015 at 8:42 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211760","author":"Louis","site":"shroudstory"},{"title":"Facebook:  Barrie Schwortz on Indianapolis","post":"http://elpais.com/elpais/2015/09/25/inenglish/1443171082_956639.html\nMuch as I admire Stephen Hawking, I find it difficult to swallow his scientism. If obsession with monotheism can be dangerous (as noted in the comment above), so can obsession with science, with no room for God. It leaves out the question of purpose even with chaos in the universe. Other great scientists and thinkers, Sagan, Gould, Popper, Chardin, Jaspers thought differently:    https://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nFreud thought that purpose, or meaning in life, was irrelevant. That was what he told Marie Bonaparte. She did not think he was a scientist, and neither was he a Scripture scholar.\nThe best proposal came from Gould:\nhttps://www.academia.edu/14727603/Why_Stephen_Jay_Gould_proposed_the_principle_of_Non-overlapping_Magisteria\nShroud studies can be an important part of the quest.\n\n","date":"September 26, 2015 at 9:46 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","id":"comment-211260","author":"Louis","site":"shroudstory"}]
