[{"title":"Finally, An Explanation for the Exclamation Mark!","post":"Good for Dr. Michael Tite, whom Ian Wilson has always defended. Wilson also told ‘Time’ that he was absolutely sure that the Shroud wrapped a dead body.\nDr. Tite also had the opportunity to see the relic once again during the Round Table held in Turin, to which he was invited by Cardinal Severino Poletto. I remember the late Daniel Raffard de Brienne, who was also present at the event, telling me that he found it amusing that those in the anti-authenticity camp were in favour of another round of radiocarbon dating.\n\n","date":"November 25, 2015 at 8:13 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215087","author":"Louis","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"Based on his background, Dr. Tite is missing a substantial amount of actual science.  In 1988, he traded it for money.\n\n","date":"November 25, 2015 at 9:25 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215112","author":"Dcn Andy","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"Why these scientists are still defending the results of Carbon Dating and not the sampling procedure? This implies that they traded results for money.\n\n","date":"November 26, 2015 at 4:47 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215148","author":"Sampath Fernando","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"It implies no such thing, and I don’t believe either Sampath or Dcn Andy really think it does. They are suggesting that the scientists responsible for the carbon dating, eight in the USA, six in Britain and two in Switzerland, were all paid either to falsify the results, or to keep quiet about the falsification. Not to mention the other five authors of the Nature paper. I consider this calumny as absurd as Stephen Jones’s hacker hypothesis, and I think that if either Sampath or Dcn Andy give the implications of their throwaway remarks a moment’s thought, they will agree with me. I certainly hope so.\n\n","date":"November 26, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215151","author":"Hugh Farey","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"Yes Hugh your logic iscorrect. My problem is why no one is talking about the sampling procedure. Although the scientists followed the correct procedures to get the results the sample they analysed was not a representative one. Why these scientists are not mentioning the sample is a Grab sample from the controversial corner and not the representative one from the whole shroud.\n\n","date":"November 26, 2015 at 6:29 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215153","author":"Sampath Fernando","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"My logic is impeccable. Your suggestion that “they traded results for money” and Dcn Andy’s that Dr Tite traded ‘science’ ‘for money’ suggests that all those defending a medieval date for the Shroud either knew or suspected that that their finding was false, but were paid off, satisfactorily, for their perpetual silence. Is that in fact what you and Dcn Andy believe?\n\n","date":"November 26, 2015 at 7:27 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215154","author":"Hugh Farey","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"Hi Mr. Farey  \nTheir finding of a medieval date was wrong  because their sampling was wrong. Are you agreeing or not?\n\n","date":"November 26, 2015 at 8:09 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215155","author":"Sampath Fernando","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"No, I certainly don’t agree. I find the evidence that the sample dated was inadequate is insufficient to discredit the medieval date. Others disagree, and that’s fine. What isn’t fine is the implication that those who carried out the carbon dating knew that the date was wrong and were paid to lie about their findings, as you and Dcn Andy suggest.\n\n","date":"November 27, 2015 at 2:27 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215165","author":"Hugh Farey","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"Hi Mr. Farey\nAre there any reason why they never talk anything about the wrong sampling procedure? They talk only about the results. Why?\n\n","date":"November 27, 2015 at 4:30 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215197","author":"Sampath Fernando","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"There are many possibilities.  As far as the sample itself was concerned, there was no need to discuss whether it was representative or not as there was no reason to suppose that it wasn’t. There still isn’t, in my view. If you mean why is there no discussion about the details of the protocols established and subsequently substantially changed, culminating in an hour of discussion between Riggi and Gonella about where to make the cut, then I imagine they didn’t think it relevant to the radiocarbon dating itself. The Catholic Church, as I understand it, commissioned The British Museum to coordinate the dating, but it was the Catholic Church which decided which laboratories to use and where the sample was to be taken from. That having been done, by whichever means, any further comment was irrelevant.\n\n","date":"November 27, 2015 at 6:16 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215200","author":"Hugh Farey","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"It was actually Cardinal Anastasio Ballestrero who bungled the job because of his Carmelite spirituality. He did regret what he did later. For the view of an insider, who said that there was pressure on the Church and more:\n https://www.academia.edu/14795646/An_interview_with_Professor_Heinrich_Pfeiffer_SJ\n\n","date":"November 27, 2015 at 7:21 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215206","author":"Louis","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"There does seem to have been a certain amount of internecene wrangling. However, there is insufficient evidence that any of it affected the accuracy of the radiocarbon date, and for the report commissioned by Cardinal Ballestrero to discuss his, or his colleagues’, squabbles would have been inappropriate.\n\n","date":"November 28, 2015 at 3:04 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215225","author":"Hugh Farey","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"“Fibres of other origins had got mixed up with the original fabric” – Professor Giovanni Riggi, who cut the sample in 1988:\nhttps://www.academia.edu/16338005/Shroud_Studies_bring_Good_News_-_February_2003\nNo examination was made of the chemical composition of the sample, which was taken from the dirtiest site on the Shroud.\nAnother problem was that when Cardinal Anastasio Ballestrero and Dr. Michael Tite remained in the sacristy for more than an hour, the period when the samples were put into the containers, nothing was videotaped. This gave rise to the story about a sample-switching plot, particularly in France.\nThere is no evidence that this happened, but one can see how everything went wrong from beginning to end.\n\n","date":"November 28, 2015 at 6:14 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215236","author":"Louis","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"Dear Sampath\nI’d summarize this issue like this:\nThe sample removing did not follow the established protocol.\nExperts have chosen a bad location for cutting the sample.\nI do not question the technical laboratory procedures for dating the sample by AMS, but dating discrepancies should raise doubts about homogeneity of the sample and presence of rogue fibers, a fact that had not been considered.\nIt’s true that at least british scientists were very glad with the results of radiocarbon dating, and there was an obscure funding for the British Museum after the press release announcing the results 1260-1390 A.D.-NEVERTHELESS THIS IS BY NO MEANS EVIDENCE THAT THE RESULTS WERE FALSIFIED….\nLater studies as everyone knows( I will not go on arguing..) confirmed what previous Shroud researchers as Professor Adler supposed I mean that the sample was not representative of the rest of the Shroud, backing Sue Benford and Joe Marino’s reweaving hypothesis.\nSo it turns out we stil don’t have a valid radiocarbon dating of the Shroud.\nProfessor Marinelli pointed out this important issue in Valencia Shroud Congress 2012:\nA new radiocarbon sample should be done only after a mature analysis by experts from several fields of science namely textile, physics and chemistry.\nProfessor Rogers pointed out that thymol use in cleaning the Shroud container could compromise the accuracy of a new radiocarbon dating of the cloth.\nIf the Savoy’s cutted small pieces of the Shroud and also extrated threads to integrate them into copies of the Shroud or as gifts as historian Dr. Carlos Evaristo claims, then this will make things even worse for an accurate new radiocarbon dating.\n                                                              regards\n                                             Antero de Frias Moreira\n                                  Centro Português de Sindonologia\n\n","date":"November 27, 2015 at 5:21 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215171","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"I originally made the point that Michael Tite apparently said in his lecture that it was he who insisted on there being textile experts to ensure that this area was not a reweave.\nYou need to explain why these specialists got it wrong and no one who was present had any issues with the sample. So far as I can see those with a problem with the sample were not there, were not experts in medieval weaves,and have not themselves examined this corner of the Shroud. Nor have they been able to provide even photographic evidence to suggest that the sample area is unrepresentative of the whole.\n\n","date":"November 27, 2015 at 1:48 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215164","author":"Charles Freeman","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"“Experts have chosen a bad location for cutting the sample.”\n—————-\nRaes (textile expert who has personally examined the Shroud) chose a nearby location to take his so called “Raes Sample”. Vidal and Testore (textile experts who have personally examined the Shroud) have chosen that corner to take the C14 sample.  Vercelli and Flury-Lemberg (textile experts who have personally examined the Shroud) found the same corner homogeneous with the rest of the Shroud. If Professor (?) Marinelli or others have a problem thinking that this is a bad location, I do not know what can convince them.\n——————-\nProfessor [?] Rogers pointed out that thymol use in cleaning the Shroud container could compromise the accuracy of a new radiocarbon dating of the cloth.\n——————\nThe C14 date might change marginally using a sample contaminted by thymol , but in order to move foward the date by 1300 years (what sindonologists wish) the amount of thymol (which is a white solid) in the sample should weigh more that the linen. Furthermore, C14 samples are cleaned with organic solvents before the C14 determination, and the traces of thymol would be removed anyway. Actually, the late Ray Rogers also said (this time correctly) that a new C14 analysis could be performed using the charred material from the  1532 fire removed during restauration of 2002, since fire does not alter the ratio between carbon isotopes.\n\n","date":"November 27, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215192","author":"Marco Bella","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"I have commented before that Thymol treated antiquities have been, and perhaps still are, subjected to radiocarbon dating with no ill effect.\n\n","date":"November 27, 2015 at 6:22 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215202","author":"Hugh Farey","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"And as I commented recently, it will continue to go on and on and on with absolutely no resolution.  \nThe main flaw I see is that a well-established practice of taking grab samples from known ancient textiles was followed, such as those found in tombs, burial clothes and mummy wrappings.  That is fine for such cloths where there can be better than reasonable confidence that such cloths have never been subject to any kind of recent repair.  \nThat is not the case with the Shroud.  It is known that the Savoy family removed small pieces and threads from time to time, as occasional gifts for family members, and various notables.  Repairs were carried out to preserve the appearance of the cloth,  and it has been alleged that these were skilfully done to the point of being difficult to detect.  Therefore the underlying assumption of homogeneity, the basis for a grab sample, is highly suspect.  \nWe all know that Raymond Rogers, the one chemist who was most familiar with the chemistry of the Shroud was convinced that he had detected such a repair at the site of the grab sample.  That is sufficient in itself to raise suspicion.  \nI would concur with the the main thrust of Antero’s comment, but with one exception:\n“A new radiocarbon sample should be done only after a mature analysis by experts from several fields of science namely textile, physics and chemistry.”  \nThe exception is omitting to mention the importance of representative sampling in any such analysis.  Even scientists with their specialist expertise are often unaware of the proper techniques involved in taking truly representative samples, and lack the necessary training in proper sampling theory.  They are more often focused on the complex technology of their own particular discipline, than they are of being aware of the complex mathematical techniques involved in the theory of Applied Statistics essential to a valid testable sampling regime.      \nThere is course a practicable problem in conserving the integrity of the relic, and it would seem likely that this was a significant factor in the choice of the 1988 sampling site.  Perhaps further testing would be better deferred to a later time when less intrusive testing might eventually become available.  \nIn the meantime, we may have to be satisfied with the fact of ongoing controversy among the diverse points of view.  However, because of the lack of representative sampling in 1988, I consider it an error of close-mindedness to make any kind of dogmatic assertions concerning the 1988 sampling.  Remember, that no other kind of tests on the sample, apart from radiocarbon dating, were permitted at that time!\n\n","date":"November 28, 2015 at 5:25 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215234","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"We also have to remember that any reweaving,not that any has actually been found in the sample area, does not lead to a first century date. I get shirt collars mended after five years, a 1350 Shroud might well need mending in 1530. The odd thing is that that the areas that needed patching up were not patched up or only in such a way that the patching was obvious.\nI know of no case where a relic was touched up in a way that new material fitted with the original. I am not sure why this would ever be done, they would have wanted to preserve the identity of the original, not try to add something similar to it that might deceive anyone. In the case of the Shroud they seem to have wanted to preserve signs of a past history, the poker holes and the firemarks, not conceal them.\nThe reweave theory never made any sense.\n\n","date":"November 28, 2015 at 11:43 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215246","author":"Charles Freeman","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"Sebastian Valfré, according to legend, insisted on using black thread for exactly that reason, to distinguish his work from the original, and the Poor Clares and other patch repairers made no attempt whatever to do a neat job – three quarters of their patches didn’t even cover the holes they were trying to mend!\nApart from the very obvious mending around the burns, and the hemming around the edges of the cloth, there is no evidence of any repair elsewhere on the Shroud, is there?\n\n","date":"November 28, 2015 at 1:43 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215249","author":"Hugh Farey","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"“Apart from the very obvious mending around the burns, and the hemming around the edges of the cloth, there is no evidence of any repair elsewhere on the Shroud, is there?”\nAccording to the textile experts, no. \nAccording to Rogers’ experiments on actual Raes/C14 threads, yes (cotton content, dye, splice in Raes#1,vanillin).\nThere is a conflict between two types of expertise.\nThe Shroud must be dated again.\n\n","date":"November 28, 2015 at 4:01 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215255","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"And as I  stated above it yet goes on and on and on …. \nThe only obvious patches were the burn hole repairs of 1532 by a group of Poor Clare nuns, who were given the simple task of patching up what was nearly a major disaster. \n“The reweave theory never made any sense.” ??!!  It does make sense for instance that Margaret of Austria, with all the resources she had available and well-known for her particular skills in tapestry, would seek to preserve the integrity and original appearance of this important Savoy endowment.  Similarly, it also makes sense that Princess Clotilde might well act likewise in 1868!\n\n","date":"November 28, 2015 at 1:52 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215250","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"So long as no one can see any signs of reweaving this is  a futile exercise. The integrity of the Shroud was not an issue when the corners were cut off, possibly by none less that Margaret of Austria, to hand around. The reweave theory comes out of the sky and has no connection with any reality. Again and again, we have been awaiting evidence in support of it but it has never come.\n\n","date":"November 28, 2015 at 2:22 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215251","author":"Charles Freeman","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"All these people might well have thought the Shroud was a bit tatty and needed a quick stitch here and there to make it a bit more presentable, and no doubt Margaret and Clothilde were excellent seamstresses themselves and with access to others even better. However, there is no evidence that any of them did anything, apart from the exceptions already mentioned. Mending, extra threads, interweaving and extra stitches are all visible, and there is absolutely no sign of them even under the magnification of Shroud 2.0. Anybody who disagrees can either post a screengrab of the relevant spot, or must insist that truly invisible mending is actually possible, which it isn’t.\n\n","date":"November 28, 2015 at 2:35 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215252","author":"Hugh Farey","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"See Thibault comment Nov 28, more recent posting “Analysis of Fibres, Raes Area”: \n“Rogers (not myself – [ie TH]), using micro-chemistry, found a dye on the other Raes (and C14) threads he had.\nHe also found and end-to-end splice in Raes #1. Villareal and al. from the Los Alamos laboratory confirmed this observation and found that the splice was secured by a brown crust which seems to be some kind of resin.”  \nSuggests it may be indicative of some kind of reweaving to me!  T’ain’t homogeneous!\n\n","date":"November 28, 2015 at 6:00 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215265","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Finally, An Explanation for the Exclamation Mark!","post":"Not really. A smudge of water soluble material – not dye – on a few fibres less than a centimetre long, and  a thread which appears to be glued end-to-end – not spliced – in wholly insufficient to persuade me that radiocarbon sample was inadequate.\nThe words ‘dye’ and ‘splice’ have in my view been overemphasised. A dye suggests a waterfast chemical rather than something embedded in a water-soluble gum, and a splice something with rather more structural integrity than the end-to-end joint observed.\n\n","date":"November 29, 2015 at 5:06 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","id":"comment-215277","author":"Hugh Farey","site":"shroudstory"}]
