[{"title":"Shroud of Turin Talk in Gilroy, California","post":"95 % confident ? One contradiction after another…that’s just what we don’t need.With all of the controversy over the carbon dating I’d like to know how they can be 95% confident.\n\n","date":"June 18, 2013 at 10:45 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37313","author":"john macgillivray","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"If one considers faulty sampling and violation of the protocol to lead to 95% confidence, one is professing a voodoo “science”\n\n","date":"June 18, 2013 at 11:57 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37317","author":"jesterof","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"It was not random sampling of the Shroud, and never intended as such. Would you expect it to be? What if a random-sampling protocol had specified a sample from one of the eyes? \nIt was sampling of 3 contiguous samples from an inconspicuous corner of the Shroud – as permitted by the custodians.\nKindly cease demonising the scientists for showing a proper sensibility for the feelings of those who never wanted their ‘Holy relic’ to be messed around with by scientists… Oh, I forgot. Demonising is what you do best…\n\n","date":"June 18, 2013 at 12:16 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37320","author":"colinsberry","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"honorless besserwisser foodie not knowing how to keep a man’s word arrived LOL\n\n","date":"June 18, 2013 at 12:22 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37322","author":"jesterof","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"The failure of an internet troll to apologize for her character attacks  will not prevent me from pointing out her retreat into mumbo-jumbo and pseudo-science…But then, some of us have encountered US-based lately-acquired MDs  for whom those letters mean Minor Deity. \nLady, I have met any number of your sort, and indeed worked with them. You do not impress me with your feeble understanding of scientific principles. Stick to anaethetising your patients. If I were one of your patients, I would beg to be anaesthetised.\n\n","date":"June 18, 2013 at 12:35 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37323","author":"colinsberry","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"It was no random sampling. The true fact is it was deliberately meant to reach a four-star result in order to prove the Turin Shroud a fake!\nIn 2007, I wrote a paper entitled:  LINCEUL DE TURIN : FAUSSE RELIQUE OU FAUSSE DATATION Carbone 14 ? and subtitled: (Contre-enquête sur un fiasco scientifique). Here is a relevant excerpt: \n               “L’Académie pontificale des sciences fut exclue du projet au profit du seul British Museum pour la coordination et la réalisation finale du test. Or, depuis le canular de « l’Homme de Piltdown » (création de toute pièce, par deux scientifiques, du « chaînon manquant » dans la chaîne de l’évolution du singe à l’homme), le British Museum de Londres n’était pas un institut au-dessus de tout soupçon. De plus, non seulement le directeur de son laboratoire, le Dr Michael Tite, coordinateur du projet de datation par la méthode du radiocarbone, ignorait tout ou presque de l’histoire et de la complexité de la relique mais celui-ci était aussi un « anti-Suaire » déclaré qui entendait bien prouver qu’il s’agissait d’un faux du XIVe siècle. À l’instar de Tite, les deux experts textiles et les directeurs des trois autres laboratoires n’étaient pas des spécialistes du Linceul de Turin qu’ils virent pour la première fois, le 21 avril 1988, le jour même du prélèvement de l’échantillon.\n                 • Le refus de toute interdisciplinarité\n                 Le groupe de recherches multidisciplinaires à l’origine même du projet de datation par le radiocarbone et composé d’une quarantaine de spécialistes américains de la relique, ne fut pas invité à prendre part à l’expérience par le cardinal Anastasio Ballestéro, custode pontifical de la précieuse toile de lin et ce sur l’avis de son conseiller scientifique le Pr Luigi Gonella († 2007) qui subissait la pression du Dr Tite et de son « petit groupe carbone 14 ». Raison officielle invoquée a posteriori par le Pr Jacques Évin porte-parole de l’expertise : “[…] chaque discipline scientifique qui étudiait la célèbre pièce de tissu se [devait] de rester indépendante sauf à démontrer qu’une cause d’impression de l’image [avait] entraîné un changement de la teneur en radiocarbone”. De fait, il eut été indispensable de relativiser le fameux résultat “1260-1390” au regard de ceux déjà obtenus par des techniques de mesure d’âge plus directes et plus concrètes qui, elles, n’étaient pas du tout en contradiction avec une datation de près de deux mille ans. Restreindre une problématique à un domaine d’étude qui en interdit le véritable dénouement est, en soi, une faute de méthode.\n                 • Une expertise non archéologique et « anti-Suaire » globalement orientée\n                  Avec l’aval de l’Église, le Dr Tite (qui était donc hostile à l’authenticité du Linceul de Turin) avait fait prélever sur la relique un échantillon d’un seul tenant et en avait fait mesurer la teneur en radiocarbone par la seule méthode de la Spectrométrie de Masse après Accélération ce dans le souci évident d’obtenir les mesures les plus homogènes possibles entre les trois laboratoires et un résultat final “quatre étoiles” « prouvant » que la relique était fausse. Or, la contre-expertise le démontre bien : le matériel daté censé n’être pas ou que très peu pollué, avait subi non seulement un dégât des eaux et une pyrolyse locale lors de l’incendie de 1532 mais aussi une teinture et une réparation invisible (voire même deux) avec un remplacement substantiel de lin par du coton beaucoup plus récent (sur les quatre seuls fils prélevés au hasard au niveau de l’échantillon parent C14 pour analyse en 1982, 1988 et 2002, pas moins de trois avaient fait l’objet d’une épissure bout à bout avec un fil d’origine différente). Pour toutes ces raisons – et une ou deux autres cumulative(s) qui reste(nt) encore à être explorées expérimentalement –, il est parfaitement abusif aujourd’hui, du point de vue de la simple honnêteté intellectuelle, d’annoncer comme incontestable la datation médiévale de la relique quand, de fait, celle-ci pourrait être beaucoup plus ancienne. Pour être véritablement exemplaire, la datation au 14C, eût demandé des conditions beaucoup mieux adaptées à la complexité matérielle de l’objet textile et, de la part du coordinateur du projet, une approche plus impartiale et plus prudente des mesures de la teneur en radiocarbone des trois sous-échantillons.”\n\n","date":"June 18, 2013 at 2:34 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37326","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Reminder: on August 7, 2012 at 10:19 am ( #12 Reply), I wrote:\n“Statistically speaking, the true reliability of 14c dating is only about 70% (from Barta’s, Meacham’s and Voruz & Meanen’s studies). It is even lower for textile samples.”\n\n","date":"June 18, 2013 at 2:41 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37327","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Additional excerpt:\n“Sous-estimation de la complexité matérielle de l’objet archéologique à dater\n                 Tout rapiécé à l’aide de morceaux de corporal (ou nappe d’autel) et consolidé par une doublure en toile de Hollande suites aux dommages qui lui furent causés lors de l’incendie de la Sainte-Chapelle de Chambéry, en 1532, le Linceul de Turin est tout sauf une pièce de tissu homogène. Si l’échantillon carbone 14 officiel, fut choisi loin (et encore pas si loin) de tout rapiéçage visible et de toute zone carbonisée, deux imprudences « de taille » perçaient cependant dans cette première procédure mise en place. \n                Pour savoir si l’on se trouvait ou non en présence d’un échantillon typique du Linceul, une information fondamentale sur la structure de son lin originel aurait due impérativement être vérifiée in situ par les deux experts textiles chargés de superviser le prélèvement de 1988 : celle de la normalité de ses irrégularités de tissage. Pour ce faire, il eut été nécessaire de procéder, sous un éclairage rasant et en fluorescence UV, à une observation minutieuse à la loupe, au compte-fil et à la binoculaire non seulement des abords mais aussi au niveau même du cœur du site de prélèvement de l’échantillon carbone 14 afin de lever toute ambiguïté possible en ce domaine. On négligea totale-ment cette dernière précaution.\n                 Or, tel qu’il apparaît sous fluorescences UV et sous éclairage rasant, – et donc tel que ne le virent jamais les deux experts textiles –, le fragment prélevé empiétait, par le bas sur une grande auréole d’eau dentelée vestige de l’incendie de 15329 tout en mordant en plein, dans deux aires hautement suspectes de réparations.\n  Abstraction faite des zones carbonisées, la première de ces deux aires, au cinquième à cheval sur le pli barrant à la verticale le site de prélèvement, offrait, un aspect nettement plus raide et plus sombre que sur tout le reste de la surface du drap. Il s’agissait ici soit d’un dépôt de salissures graisseuses résultant des nombreuses manipulations de ce coin de la toile, soit d’une teinture locale destinée à camoufler, selon l’art des tapissiers, une restauration à l’identique de la texture, soit des deux. Dans la seconde aire plus claire et à droite de ce même pli et à gauche d’un pli courbe, on pouvait distinguer tout aussi\nnettement une anomalie structurelle : comme un réseau de fils plus dense de forme serpentine caractéristique d’une zone d’accroc ou de cisaillage ayant fait l’objet de micro reprises. Vues dans ces conditions très particulières d’observation, cette pollution et ces anomalies d’aspect ne sauraient être confondues avec une simple ombre portée, un pli du tissu ou bien une irrégularité normale apparue au cours du tissage10.\n                 Ainsi, dès le départ, la validité du résultat final se retrouva-t-elle être très sérieusement hypothéquée. De toute évidence, les deux experts textiles, les représentants des trois laboratoires et le coordinateur du projet n’étant pas des spécialistes du Linceul de Turin, ignoraient que dans sa composition matérielle même, la relique s’avère beaucoup plus complexe qu’il n’y paraît à première vue.\n                 Il faut, en effet, savoir que, lors des ostensions et afin de garantir aux observateurs présents la vision la plus parfaite et la plus logique de la double empreinte du Crucifié, la relique était déployée entièrement à l’horizon-tale. Une bande de couture bourrelée courant sur toute sa longueur avait été confectionnée permettant une meilleure préhension du drap. L’échantillon parent, extrait d’un seul tenant entre 8 à 10 cm du bord supérieur du coin gauche et le long de la couture de repli du tissu sur lui-même, se superposait donc presque parfaitement à la zone où – depuis au moins le XIVe siècle et jusqu’au XIXe siècle –  la grande étoffe de lin avait été tenue en tenaille entre le creux de la paume et trois ou quatre des doigts de la main droite de plusieurs générations de dignitaires ecclésiastiques officiant à mains nues. \n                 Ainsi, à cet endroit très précis du drap, la toile, tantôt soumise à de fortes tensions et à des pressions répétées d’extrémités onglées plus ou moins coupantes, tantôt exposée aux griffures du chaton des bagues d’évêques et d’archevêques, avait-elle fini, un jour, par être abrasée, accrochée, cisaillée et/ou trouée et faire l’objet d’une (voire même de plus d’une) microreconstruction(s) fil à fil invisible(s) à l’œil nu hors examen ad hoc.\n  Or, pour dater correctement au carbone 14 un objet textile ancien – un étudiant en archéologie aurait pu le savoir –, il était tout sauf recommandé de prélever un seul et unique échantillon de tissu dans une telle zone. Il eut été beaucoup plus avisé et moins destructeur de procéder à un échantillonnage de quelques fils en plusieurs endroits beaucoup plus fiables en vue d’assurer, par intercomparaison, la représentativité de la datation.”\n\n","date":"June 18, 2013 at 3:00 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37329","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Max, would you say there was a plot? One problem is that Cardinal Ballestrero remained for a long time in the sacristy together with Professor Tite; This is not to say that the British Museum representative was dishonest, but the fact that this part was not videotaped paved the way for talk about a sample-switching plot. The cardinal was no Shroud enthusiast, Professor Gonella ignored the protocols and Riggi chose a sample from the dirtiest part of the relic and, further, there was no chemical analysis. How nice.\n\n","date":"June 18, 2013 at 4:57 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37333","author":"Louis","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"On January 20, 2005, a paper published in Thermochimicaacta, highly regarded peer reviewed scientific journal, by Ray Rogers (Senior chemist at the Los Alamos Nat. Lab.) concluded that the original sample was not part of the original cloth.  In August , 2008, eight researchers corroborated his results.  The 1988 carbon dating is meaningless!\n\n","date":"June 18, 2013 at 5:22 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37335","author":"Larry","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Highly regarded or not, that journal was one that Rogers had helped to found, and on which he served as editor for many years (see wiki). It is highly unlikely that any other peer-reviewed journal would have accepted Rogers’ paper, given the uncertain provenance  and history of the few ‘leftover’  threads that used for his studies. Still more sloppy Shroudology – of which there is a surfeit. The 1988 dating is statistically open to dispute certainly (through no fault of the scientists) – but the idea that it is scientifically “meaningless” is just wishful thinking on some people’s part. Had it returned a 1st century answer, we’d be reading here that it was “conclusive evidence”, the last word on the matter.\n\n","date":"June 18, 2013 at 6:10 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37340","author":"colinsberry","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"I am not saying there was a ‘plot’. I am just saying the expertise was oriented by (at least) two claimed anti-authenticists (namely Tite + Hall).\n\n","date":"June 18, 2013 at 5:27 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37336","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Agree, there were just too many pre-conceived ideas for the procedure, beginning from the cutting of the sample till the announcement, to have been taken seriously. From what one can judge, the BM scepticism was such a strong influence that the people there dictated the terms. Professor Jerôme Lejeune of France was one of those famous scientists who recognised this attitude and dismissed the carbon dating. Later, Cardinal Ballestrero did say that he had been manipulated, he only did not say how, perhaps to avoid putting some of the people involved in an embarrassing situation.\n\n","date":"June 19, 2013 at 6:09 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37409","author":"Louis","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Typo: globally oriented\n\n","date":"June 18, 2013 at 5:42 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37337","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Reminder: on August 7, 2012 at 7:43 am ( #9 Reply), I also wrote:\n“When it comes to CONCLUSIVELY carbon date claimed old burial linens, history of their conservation conditions (and first and foremeost the specific burial rite they were subjected to) is vital information.”\n\n","date":"June 18, 2013 at 5:51 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37339","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"CSB: “The 1988 dating is statistically open to dispute certainly (through no fault of the scientists) – but the idea that it is scientifically “meaningless” is just wishful thinking on some people’s part.” \nThe only scientific significance that the 1988 dating has is that the sample showed a date AD 1260-1390, and that the sample therefore is unlikely to be younger than that. To then make an induction as the blurb for the Gilroy Library blurb does, [“These results provided evidence that the Shroud of Turin was not the reported cloth that Jesus Christ was wrapped in after the crucifixion.”] is to ignore the controveries concerning the sampling, the evidence that the sample was not in fact truly representative of the cloth, and to go beyond the limits of valid scientific method. \nRogers himself is known to have initially accepted the results and was sceptical of the allegations made by Marino and Benford. True scientist that he was when he looked into the matter, he had to change his mind. To then claim that publication in his journal is tainted merely because he helped to found the journal, is to close the eyes to the evidence he presents. It is a minor matter compared to the gross failure of representative sampling. \nPam Moon has recently published three papers which can be found on the shroud-enigma web-site. Perhaps the most significant of these is: “Coloured Dissolved Organic Matter (CDOM) contamination, mould damage, biocides and the carbon-14 dating of the Shroud of Turin.” After reading this paper, anyone has to be sceptical that C-14 can reliably date any textile whatsoever, unless it has been permanently hermetically sealed for most of its history. I have yet to be made aware of any ancient textile dated by C-14 which has also been corroborated by means independent of C-14 (e.g. proven provenance).\n\n","date":"June 18, 2013 at 7:31 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37343","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Or in a brief summary – faulty sampling leads to faulty conclusions and therefore is one total embarrassment, not science.\n\n","date":"June 18, 2013 at 11:14 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37349","author":"jesterof","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Jesterof, I think there are additional implications. Read Pam Moon’s paper I quoted above, and you’ll see the reasons there why C-14 would seem to be an unreliable method to date any ancient textile, regardless of proper sampling protocols.\n\n","date":"June 18, 2013 at 11:28 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37350","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Publishing  a non-thermochemical paper in one’s own  specialist thermochemical journal does not necessarily “taint” one’s findings, and I never said it did. But it does rather take the shine off claims that Rogers paper was considered worthy of publication in a “peer-reviewed” journal, when clearly those keen to talk it up are unaware of the special circumstances, or the fact that the journal editors were probably aware that their one-time colleague did not have long to live. \nIn any case, the appropriate place for Rogers’ paper was not a thermochemical journal, regardless of his pre-Shroud interests. What’s thermochemistry got to do with forensic-style studies on a few threads? The appropriate place for a paper attacking the radiocarbon dating would have been the non-specialist “Nature” itself, the very journal which published the 1988 findings. Did Rogers maybe submit it to Nature and have it rejected? Might Nature have accepted it as a letter rather than the more prestigious “full length” paper format? That’s the thing you see. Unless you’re an insider, you only get to know who accepts a paper. You never get to know of the ones who rejected it – or on what grounds.\nAs an ex-reviewer myself I would have accepted the 1988 paper, warts an’ all. while insisting that the authors state the provisional nature of the results, and the need for additional sampling sites, but would have rejected Rogers paper out of hand. Rogers should never have embarked on those studies in the first place. There was a furtive loner quality about it – especially the manner by which he came to receive his material. Maybe if he had lived longer he could have been persuaded to take his findings to the Shroud’s custodians and persuaded them to have the entire dating repeated, but with a proper sampling frame. He could also have argued for some parallel chemical characterization, e.g. to measure the cellulose or total carbohydrate content of the sampled material as a guide to likely levels of contamination. To listen to some here, one could be forgiven for thinking that the Shroud was now mainly a mix of fungal fibres and field pollen, held together with generations of handlers’ skin grease.\n\n","date":"June 19, 2013 at 2:37 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37356","author":"colinsberry","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"It’s an interesting dilemma for a scientist with Rogers’ integrity, given his very close association with Shroud research over the years, and also what must have been his awareness of all the personal agenda driven motives of everyone involved in the entire project. By whatever means he came by the material, he becomes aware that the sample is not representative of the whole cloth and there are grounds for the samples having come from a patch. However Flury-Lemburg has claimed (still claims) that there are no such signs, and she is a voice that matters. He knows that the custodians are unlikely to agree to revisiting the experiment, and that if he does nothing, the C-14 labs and anti-authenticists will be trumpeting their false triumph and that will be the scientific conclusion of the matter. In the meantime, he is sitting on this special information, and he knows he hasn’t much time left to him. He could follow the appropriate professional steps and salve his conscience that way, but he knows that it will be ineffective. I think he took the only proper course that a person with true integrity in his circumstances could do, and that was to get his findings published in the only way immediately available to him, and by that means ensure that posterity knew of it, and they could then make of it whatever they might.\n\n","date":"June 19, 2013 at 3:47 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37358","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"But Rogers also did some trumpeting,especially of his claim that his thread was a splice of two different ones, and that an attempt has been made to disguise that fact with yellow dye. Does that not implant in the reader’s mind the idea of subterfuge and conspiracy? If so, then at what period of history? Medieval? Why would anyone go to great trouble to invisibly restore a damaged corner, taking the trouble to perform end-to-end splicing on individual fibres, artificially aged with dye. That medieval scenario simply does not make sense. \nSo what did Rogers think? That maybe the alleged splicing and dyeing had been done on or after 1988 in an attempt to contaminate Shroud samples with modern carbon? Was Rogers deliberately trying to implant the idea of a dark conspiracy to discredit the Shroud? Or was Rogers just an honest foot soldier, dutifully reporting what he saw, or thought he saw, leaving others to make what they wanted of his alarmist findings?  If the latter, then who’s to say that the real conspiracy, if there was one, was to discredit the radiocarbon dating retroactively by slipping some post-88 doctored threads into the public domain, i.e. onto a respected scientist not given to suspecting, far less entertaining conspiracy theories, such that the entire 88 sample then becomes discredited on a guilt-by-association basis.\nI have a hunch – just that – that Raymond Rogers may have been used, and that he was too trusting to realize that he was being used. But he was culpable in one respect – he should never have submitted his extracurricular homework on a few donated threads to his own professional journal, such that 8 years later folk on this site still crow about his work having appeared in a prestigious peer-reviewed journal, the Latinized title of which is invariably mispelled!\n\n","date":"June 19, 2013 at 4:15 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37359","author":"colinsberry","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"What I cannot find in Rogers’s work, nor really in Marino & Benford’s, or Atkinson’s statistical paper, is any evidence to suggest the proportion of contamination required. In order to skew a 1st century cloth unto the 13th century, using 16th century material, about 80% of the test sample has to consist of the more recent contamination. Even using modern material (which I intrinsically find more likely), more than 60% of the test sample would have to be interpolated. The discovery of the odd cotton fibre or a thin coating of paint doesn’t really begin to answer this objection to the “invisible patch” hypothesis.\n\n","date":"June 19, 2013 at 5:39 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37363","author":"Hugh Farey","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Re Ramsey’s famous quote : “[T]he radiocarbon dating results putting it at 1260 – 1390AD were reliable, and that the suggestions of contamination or medieval repair were unlikely.”\nReminder, on January 4, 2012 at 11:56 am (#7 Reply), by way of comment, I wrote:\n“Actually Ramsay is “right to a certain extent”.\nSuch a high contamination does not imply a medieval repair in terms of microreconstructions. XIXth century microreconstructions are most likely (either by the princess Clothilde of Savoy-Bonaparte or the Master of upholstery in the Royal court of Savoy, in 1863).”\nIn my 2007 research paper, I also wrote: \n“Technique de pointe et facteurs (trop) humains \n                 Quant au fil extrait à partir de l’échantillon du Coin de Raës prélevé dans une zone à la fois adjacente à celle de l’échantillon officiel du Linceul de Turin et contiguë à la longue bande supérieure du drap, sa datation à deux extrémités très hétérogènes (IIe- XIIe siècle) par le laboratoire de l’Institut de Technologie de la Californie en 1982, pourrait bien avoir été une datation qu’à  moitié aberrante. Elle ne ferait que refléter la réalité d’un fil ayant subi une épissure bout à bout présentant l’une de ses deux sections composée des fibres d’un fil (tardo-antique) authentique, vierge ou pratiquement vierge de toute fibre étrangère, et l’autre composée de 33 à 50% de fibres étrangères beaucoup plus tardives (du XIXe siècle) et mêlées aux fibres du lin originel. \nTaille réelle moyenne de chacun des trois sous-échantillons du Linceul de Turin datés en 1988\n                 On aurait, en effet, bien tort de perdre de vue ici que toute la valeur réelle de la datation C14 de 1988, ne repose que sur trois sous-échantillons ne s’avérant, en moyenne, pas plus grands qu’un timbre-poste de 1,69 x 1,32 cm et pesant chacun, toujours en moyenne, 52,83 mg. Le poids unitaire du Linceul étant estimé à 0,023 g/cm2 ± 10%, au sein de l’échantillon parent C14 pesant 158,5 mg ± 0,3mg, il suffirait au pire d’un remplacement soit d’à peine 106 millièmes de gramme ± 10% de fibres textiles originelles du Ier siècle par une quantité égale de fibres beaucoup plus récentes issues de réparations invisibles effectuées entre 1858 et 1988 (estimation haute selon Jackson), soit de seulement 79 millièmes de gramme ± 10% (estimation basse selon Évin) pour que la relique présumée de « 1260-1390 » soit définitivement enlevée au Moyen Age et se retrouve placée à l’époque coloniale romaine. Autant dire qu’à l’échelle de la réalité matérielle de l’objet archéologique\nanalysé, il suffirait de presque rien20.\n                 Vingt années de contre-expertises plus tard, un noyau irréductible de faits avérés nous conduit donc à affirmer que les échantillons, dont furent mesurées en 1988 les teneurs carbone 14 résiduelles, n’étaient pas uniquement composés de carbone présent à l’origine dans le matériel daté mais intégraient des matières carbonées secondaires (dites de pollution) issues d’activités humaines postérieures à la formation du lin. Que ce soit par les deux experts textiles « commis d’office » pour superviser le prélèvement ou bien par les trois laboratoires retenus pour réaliser la datation officielle du Linceul de Turin, ces carbones plus récents (essentiellement « de remplace-ment ») ne furent ni détectés ni éliminés.”\nRe Mme Metchild Flury-Lemberg’s opinion, I commented in a note:\n” 10. – Lorsque l’on sait que de petites reconstructions invisibles à l’œil nu et à la lumière naturelle du jour pouvaient se trouver très circonscrites au cœur même du site de l’échantillon carbone 14 daté, on est pour le moins étonné qu’une experte textile de la valeur de Mme Metchild Flury-Lemberg, sans même avoir jamais examiné de visu ledit cœur de l’échantillon ni avoir pris connaissance de la photographie précise et contrastée d’Enrié, puisse affirmer sans ambages que la texture dudit échantillon était uniforme et intacte. Partant du principe qu’un expert textile se devait d’être très attentif à l’origine (et à la représentativité) des fils qu’il observe, de toute évidence, il demeure difficile pour Mme Metchild Flury-Lemberg d’accepter un seul instant l’idée que des confrères aient pu, juste avant la découpe de l’échantillon brut,  ne pas procéder, à l’aide de loupes, compte-fils et binoculaires, à l’examen des fils de chaîne et de trame au cœur même du site de prélèvement.”\n\n","date":"June 19, 2013 at 6:35 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37366","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"To say that Rogers may have been used, is merely to sow a suspicion for which there are no grounds, nor any evidence. To say that his findings are “alarmist” is to under-rate their importance given that they are a powerful argument that potentially, if not actually, discredits the much publicised C-14 tests that would dismiss what may well be the most important relic in Christendom. \nAs to why anyone would go to the trouble in the 16th century to make such a patch, you may ask Mr Michael Ehrlich of ‘Without A Trace, Inc’ of Chicago, as to why his firm has been carrying out such work for at least 20 years (as at 2005), refer the Benford & Marino paper of 2005; Or you may consult his web-site (www.withoutatrace.com). It was certainly within the resources of the House of Savoy who then owned the relic. Mr Ehrlich apparently claims that such work was commonly carried out on highly valued or precious textiles such as tapestries during the 16th century. \nIt is not known how much foreign material it takes to skew the carbon dating of a textile, except by some theoretical model. In addition to reweave material, there is also the question of contamination, fungal, biocides, etc. What is required to settle the matter is a comparison of ancient textiles dated by both C-14 and by some other independent means, such as known proven provenance. I am unaware that there are presently any such examples!\n\n","date":"June 19, 2013 at 6:37 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37367","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"How can you claim that Rogers’ homework with ‘undocumented’ material discredits anything, least of the ’88 dating, given the subsequent report from Freer-Waters and Jull with authentic material?\nhttps://journals.uair.arizona.edu/index.php/radiocarbon/article/view/3419\nI think you should at least mention contrary findings, even if you have grounds for doubting their reliability. Failure to do that simple continues the process – all too apparennt on this site – of elevating Raymond N.Rogers to a state of near-sainthood. Reminder – he was plain Mr. Rogers, a thermochemist working in a Government centre on safety-testing of chemical explosives. Yes, he was gifted and resourceful experimentalist, but sometimes could not see the wood for the trees. And I I say, he should NOT have submitted his private probings of an undocumented thread or two to his own professional journal on which he had “influence”, though one makes allowance for the fact that he must have known he did not have long to live when he did so circa 2005.\nWhile I have little doubt that medieval Shroud custodians had the skill and patience to invisibly repair damaged fabric – though I doubt whether end-to-end splicing of threads was considered necessary, given the irregularity and flaws in the weave-   it seems scarcely credible that anyone would have gone to all that trouble simply for an inconspicuous corner. End-to-end-splicing and dyeing is more likely to be modern-day jiggery-pokery – and I say that as someone who generally has little time for conspiracy theories. But then a single  mischief-making individual (excluding Rogers), wishing to defend or promote a position –  hardly amounts to a conspiracy – more a cheap and rather pathetic stunt.\n\n","date":"June 19, 2013 at 8:00 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37371","author":"colinsberry","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"It is potentially credible that a damaged corner was mended given the status of the shroud as a holy relic.\n\n","date":"June 19, 2013 at 8:27 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37372","author":"matthias","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Notes re Tite & Bowman’s statistical sleight-of-hand:\n“4. – Lissage qui ressemble plus à un tour de passe-passe statistique par l’utilisation de la fameuse méthode statistique  de Wilson et de Ward dont la capacité à rendre homogène des résultats hétérogènes est bien connue des spécialistes. 5. – Annoncé officiellement à 5 % (soit juste le seuil de validité admis), le niveau de signification (ou degré de cohérence) des résultats interlaboratoires,  une fois recalculé, s’avéra être totalement faux. Il était, en fait, de 1,04 % c’est-à-dire bien en dessous du seuil critique impliquant, soit qu’une erreur systématique avait été commise au cours de l’analyse (ce qui n’était pas le cas) soit que l’échantillon n’était pas homogène (ce qui était précisément le cas). Ainsi, “par obligation de résultat”, Mme Sheridan Bowman, la responsable de la partie statistique de l’expérience, avait-elle « arrondi » ce chiffre de 1,04% » à 5%. On ne peut que regretter cet excès de zèle par complaisance envers son patron, le Dr Michael Tite. Celui-ci n’avait, en effet,\njamais fait mystère qu’il ne croyait pas à l’authenticité du Linceul de Turin.”\n\n","date":"June 19, 2013 at 6:44 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37368","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Actually, the 1988 Turin Shroud radiocarbon dating is nothing but a textbook case of bad archaeology and the way a scientifically non-conclusive result (originally biased by a conflict of interest (AMS Radiocarbon Dating  method promotion) and two anti-authenticists’ intersubjective denial (Tite & hall)) can be turned into a conclusive result with at least 95% confidence.\n\n","date":"June 19, 2013 at 7:01 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37369","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"\nmatthias :\nIt is potentially credible that a damaged corner was mended given the status of the shroud as a holy relic.\n\nSo why was it folded lengthwise down its midline, at the time it acquired the 1532 burn holes? Midline folding (needed to explain the bilateral symmetry of the burn holes) would inevitably have tended, over time, to create an unsightly fold mark  or even permanent crease down the middle of the face and torso. Is that how one stores a holy relic? Why was it not rolled up instead, or folded in ways that did not leave creases anywhere in the body image area? \nCome to think of it, why weren’t the L-shaped poker holes repaired by re-weaving, assuming they were acquired pre-1532? Or the later 1532 burn holes either, for that matter, instead of being infilled with patches of new cloth?\nSorry, but I see no evidence that the Shroud was given the reverential care one would normally expect to be bestowed on a supposedly fragile 15 centuries-old artefact, least of all a supposedly holy relic. Quite the contrary in fact. Did its medieval custodians know something about its provenance as to make them somewhat lackadaisical about handling and storage?\n\n","date":"June 19, 2013 at 8:58 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37375","author":"colinsberry","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"If the L-shaped holes were known to exist on the Shroud (going back to the Pray Manuscript), then they had become an indicator of the Shroud’s provenance. Meaning if a medieval forger made a copy of the Shroud, he would have had to include the burn holes. A lack of burn holes would have been a clear sign this was not the true Shroud but a copy. Sometimes you show reverence for something by allowing it to remain ‘spoiled’.\nI don’t know about the folds though.\n\n","date":"June 19, 2013 at 9:40 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37380","author":"David Goulet","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"I don’t think most people folding cloth would consciously consider damage from folding in the manner they might do in folding a valuable artistic print, for example. Also if was folded to allow for practical protective storage then that might have been done in the overall best protective interest of the shroud. The L shaped holes might have been left for a number of reasons, including that they were attributed some symbolic significance, or were considered too close to the image to repair without affecting the image\n\n","date":"June 19, 2013 at 9:50 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37382","author":"matthias","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"The true fact is, the geometrical fourfold series of blackened-rimmed L-shaped burn-holes could date back PRIOR TO 390 CE (see the apse of Santa Pudenziana with the mosaic of Christ in majesty).\n\n","date":"June 20, 2013 at 6:04 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37449","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"Even now, the images of rusty thumbtacks are clearly visible…\n\n","date":"June 19, 2013 at 10:26 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37384","author":"Hugh Farey","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"In the C14 corner, the image is not that of a rusty thumbtack at all but the mark left by a measuring instrument (Riggi di Numana’s) in 1988.\n\n","date":"June 20, 2013 at 6:27 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37452","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"\ndaveb of wellington nz :\nJesterof, I think there are additional implications. Read Pam Moon’s paper I quoted above, and you’ll see the reasons there why C-14 would seem to be an unreliable method to date any ancient textile, regardless of proper sampling protocols.\n\nThanks.\nAgreed.\nIt might have not been known in 1988, but today only kooks will still stick to the notion that it is valid, no matter what\n\n","date":"June 19, 2013 at 10:45 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37385","author":"jesterof","site":"shroudstory"},{"title":"Shroud of Turin Talk in Gilroy, California","post":"I took the leisurely step to attend the meeting at Gilroy. Mark Okuda did a nice clear presentation. It was a college level science workshop. He personally did not appear to have any take about the authenticity of the Shroud. Which is refreshing. In essence, the presentation was not really about the Shroud, but how a scientific investigation can be done about the Shroud. He focused around some of the science involved in authenticating the Shroud as a shroud. Since it was a science workshop, you had some scientific instruments, like microscopes around the room for people to use,  blood testing kits, radio C14 calculations to be done, etc. For the microscopes, he showed how to distinguish between linen and cotton fibrils. The difference was quite clear. One striking aspect is that a linen fibril has lots of microscopic fractures across its width. It would be easy for anybody to confuse these fractures with colored  fibrils. Overall, Mark Okuda is a really good teacher. As a side note, it was free (i.e., paid by the Santa Clara county library administration) and the presentation might be repeated again in the Santa Clara county (essentially, the Silicon Valley).\n\n","date":"June 19, 2013 at 8:20 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","id":"comment-37415","author":"Mario Latendresse","site":"shroudstory"}]
