[{"title":"Shroud Presentations in Silver City, New Mexico","post":"Can someone please explain to me how the Shroud is “an act of God’s great love?”  I see the Image on the Shroud only as a mystery of how one person could have had such an amazing cause and effect not just in life but astoundingly in death!  I’m having difficulty in seeing this as a “receipt for our salvation” or as “an act of God’s great love.”  P.S. I am not an atheist or an anti-Christian…\n\n","date":"May 24, 2014 at 7:21 am","url":"https://shroudstory.com/2014/05/24/shroud-presentations-in-silver-city-new-mexico/","cat":"event","id":"comment-123977","author":"clublu22014","site":"shroudstory"},{"title":"Shroud Presentations in Silver City, New Mexico","post":"To me, Christianity interprets Christ’s actions represented on the Shroud as acts to redeem humanity from slavery to sin.  Sin can be described as the disordered loves in our life – when our love is disordered, it is out of sync with the design for our life.  The love is in the willful suffering, death and resurrection of Jesus – He was not murdered the way He was without choice, His choice to do this to redeem us.  I hope that helps you to answer your question.  If you would like to discuss further, click my name and click on the Webmaster e-mail link.\n\n","date":"May 24, 2014 at 10:01 am","url":"https://shroudstory.com/2014/05/24/shroud-presentations-in-silver-city-new-mexico/","cat":"event","id":"comment-124011","author":"Andy","site":"shroudstory"},{"title":"Shroud Presentations in Silver City, New Mexico","post":"A lot more information will have to be extracted from the Shroud before any theological affirmations can be made with a degree of certainty. The foremost authority, Ian Wilson, wrote decades ago that Jesus is seen breaking the bounds of death, Pope John Paul II said it reminded us of the mystery of life and death. One can say that if “proved” to be authentic we will have to mix both points of view simply because, as I have written more than once on this blog, the relic will not answer all our questions, there is a lot more mystery in existence.\n\n","date":"May 24, 2014 at 10:43 am","url":"https://shroudstory.com/2014/05/24/shroud-presentations-in-silver-city-new-mexico/","cat":"event","id":"comment-124021","author":"Louis","site":"shroudstory"},{"title":"Shroud Presentations in Silver City, New Mexico","post":"Andy, I respect your faith perspective, but that aside, not relying on the NT telling us about Jesus and salvation… just looking at the Shroud and all the abuse taken by this one individual, and that after death, this one man could project that abuse in a 3-D negative photograph on a burial sheet of linen, that can’t be duplicated and has been preserved ever since tells me that this is a force unknown to mankind.  I admire Pauline theology, but I think we could be asking more probing questions scientifically and theologically about this cause and effect after death.  I think the love behind it is truly unknown and obfuscated by the abuse of that concurrent culture.\n\n","date":"May 24, 2014 at 1:11 pm","url":"https://shroudstory.com/2014/05/24/shroud-presentations-in-silver-city-new-mexico/","cat":"event","id":"comment-124061","author":"clublu22014","site":"shroudstory"}]
