[{"title":"Fly on the wall summary of the BSTS Meeting","post":"[David Rolfe]  read out a goodwill message from Ian Wilson (now living in New Zealand).\nI haven’t been able to find any reference that Ian Wilson is now living here in New Zealand.  Last I heard he lived in Queensland (Australia)  Northern hemispherites can sometimes be confused about geography south of the equator.  There’s about 1200 miles of Tasman Sea (We call it “The Ditch”)  between the two countries.  Happy to stand corrected, if Ian now actually lives here!  Maybe NZ was the address Ian gave in his info to DR?\n\n","date":"October 23, 2012 at 3:27 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18143","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"Why is there no mention of Mannix?\n\n","date":"October 23, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18152","author":"Louis","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"Oops. My mistake and apologies to Ian Wilson and everybody who lives in Australia and New Zealand. Sadly Denis Mannix was unable to be at the meeting because of ill health.\n\n","date":"October 24, 2012 at 5:32 am","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18172","author":"Hugh Farey","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"This is entered on behalf of Denis Mannix\nShroud Maillard hypothesis.\nThe present proposal is not to study the Maillard reaction at all. In Shroud circles the expression “the Maillard reaction” has come to be used as a general term for Ray Rogers’ claim that the image has been formed by a Maillard reaction and, more surprisingly, that it involved gases that retained, within their gaseous state, information about some physical characteristics eg. the shape,  of their source. His claim is based on experiments that he carried out simulating the conditions with the tomb.\n   The work proposed is designed to test only the latter part of this claim by Rogers which is quite a surprising claim ie. that a clear image (comparable with the image on the Shroud) can be made on a recipient surface by gases that rise in a thermal current and retain, during their movement, the details of the surface, (wounds, fingers etc) from which they  were released.  This claim will be tested by the accuracy of the image they generate on a reactant surface. At the same time it will test to what extent any simultaneous diffusion within the gas phase obscures the image. This is as far as the proposal goes.\nThis high quality image is an essential prerequisite before we go on to study what reaction has caused the image. If we do get the high quality image may some people may still need verify that it has the same chemical composition as the image on the Shroud. This would then lead into studies of the possible  reactions that might have formed the image, including the Maillard reaction.\nDenis Mannix\n\n","date":"October 24, 2012 at 6:18 am","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18175","author":"David Rolfe","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"Could Denis Mannix quote Rogers’ claim ? I’m not in Shroud circles, and when I asked Thibault for more details about Rogers’ hypothesis, there was no mention of thermal currents.\nI think diffusion is the distant mechanism involved in body image formation. But image formation includes contact and diffusion.\n\n","date":"October 26, 2012 at 1:13 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18367","author":"anoxie","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"In his ‘An Amino-Carbonyl reaction (Maillard reaction) may explain the image formation’ (www.shroud.com/pdfs/rogers7.pdf), Rogers dismisses any form of gaseous diffusion as responsible for the image, as ‘vapours and liquids penetrate the cloth.’ I think we have to go back to Vignon for the idea that convection currents would carry gases preferentially upwards to the cloth, opposing the general omni-directional diffusion.\n\n","date":"October 26, 2012 at 2:07 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18371","author":"Hugh Farey","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"I agree 100% with this scheme. I would add that convection currents could be triggered by a very small and declining- with- time temperature gradient. This implies very low velocities for amines/sweat/oinments/whatever from the body, and such a motion is compatible with  low Reynolds numbers, that is with a laminar flow. In this case, a vertical motion of very narrow flow lines of amines emerging from the body and impacting/ reacting on the cloth, could explain\ni) the resolution of the image (related to the size of the flow lines)\nii)the vertical anisotropy of the image\n\n","date":"October 26, 2012 at 2:27 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18374","author":"Gabriel","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"\nHugh Farey :\nRogers dismisses any form of gaseous diffusion as responsible for the image\n\nThis is a complete misunderstanding of Rogers’ hypothesis. One step foward, two steps backward.\n\n","date":"October 26, 2012 at 3:07 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18375","author":"anoxie","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"I hope I haven’t misunderstood Rogers’s work. All the experiments he describes are contacts, and he says that hypotheses “based solely on vapour-diffusion… mechanisms” have been “eliminated” (by Pellicori and Evans). He does describe the use of ammonia vapour as a developer of a latent contact image, and later mentions gaseous reactive amines, but does not regard them as playing any part in image formation “away from contact points.” If you understand his experiments differently, I would be most happy to be corrected.\n\n","date":"October 26, 2012 at 4:00 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18379","author":"Hugh Farey","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"Ok. So far the best (and most coherent) explanation of his hypothesis is here : ROGERS’ MAILLARD REACTION\n\n","date":"October 26, 2012 at 5:25 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18383","author":"anoxie","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"Let us not forget to also ask another question: why all this happened only in the case Jesus’ burial cloth? — if it is the genuine article.\n\n","date":"October 26, 2012 at 6:07 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18386","author":"Louis","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"It’s difficult to distinguish Rogers from the person he’s answering in the Maillard Reaction paper, but if I understand him correctly, he replies to a query about gaseous amines by beginning “ammonia would leave a fog of colour on the cloth… The image was not primarily formed by ammonia.” He goes on to say that heavier amines would continue to evolve, and would “diffuse from the skin to the cloth from the entire surface of the skin.” Without sufficient data, Rogers then makes very educated guesses about evolution rates, and considers that they are likely to be so slow that reaction between gases and cloth are likely to be ‘diffusion controlled,’ which I take to mean somewhat similar to the ‘fog of colour’ he ascribes to ammonia. He then considers what his correspondent calls the ‘path-length dependent attenuation of the concentration,’ but without, I feel, much enthusiasm, considering various surface factors to be more important. It is clear, I think, that he is not very hopeful that gas diffusion along path-length dependent gradients provides the answer to the formation of the image; however he does seem to have changed his earlier position slightly in favour of a possibility that gas diffusion plays a bigger part than he first thought. I think his last paragraph is magnificent – he is a great loss.\n\n","date":"October 26, 2012 at 7:35 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18387","author":"Hugh Farey","site":"shroudstory"},{"title":"Fly on the wall summary of the BSTS Meeting","post":"\nHugh Farey :\nhowever he does seem to have changed his earlier position slightly in favour of a possibility that gas diffusion plays a bigger part than he first thought.\n\nDuring the STuRP they rules out diffusion because the image is superficial. Then, 20 years later, he run new tests and found out it was the reactant on the cloth which could be superficial but gases could have diffused through the cloth.\nHis theory seems to have been dismissed in Shroud circles. Evidence of starch is not obvious, reactive amines initially proposed (cadaverine and putrecine) have been ruled out.\nBut his views on kinetics and diffusion are very interesting, and a chemical reaction is a credible rational explanation.\nIf you have time, you should try to reproduce his experiments to determine reachable resolution thanks to a diffusion mechanism.\n\n","date":"October 27, 2012 at 1:13 am","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","id":"comment-18398","author":"anoxie","site":"shroudstory"}]
