[{"title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?","post":"This is what I heard from Richard: \nERIC WOULD NOT ALLOW THE TALK TO BE TAPED.  THE TALK WAS GEARED TO A GROUP OF STUDENTS.  THERE WERE ABOUT 50 OR SO THERE.  \nTHE TALK WAS CASUAL AND RELAXED, ERIC WAS IN GOOD FORM WITH SOME COMICAL REMARKS AS HE SHOWED IMAGES OF THE 78 STURP STUDY.  \nERIC WAS VERY SPECIFIC IN STATING DURING HIS TALK AND FOLLOWING HIS TALK THAT HE WOULD NOT BE IN ANY FURTHER SHROUD RESEARCH.  HIS ONLY CONCESSION WAS THE CHANGE IN HIS THINKING AFTER READING RAY’S PAPER [and the book Wrapped Up in the Shroud:  Chronicle of a Passion]. \nHE REMINISCED WITH FONDNESS MANY OF THE STURP PEOPLE WITH A BIG SMILE ON HIS FACE.  HE WAS SPECIFIC ABOUT THE IMPORTANT WORK OF AL ADLER AND BARRIE SCHWORTZ. \nJoe\n\n","date":"January 31, 2013 at 12:20 pm","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","id":"comment-23092","author":"jmarino240","site":"shroudstory"},{"title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?","post":"jmarino240: “HIS ONLY CONCESSION WAS THE CHANGE IN HIS THINKING AFTER READING RAY’S PAPER [and the book Wrapped Up in the Shroud: Chronicle of a Passion]. ”\nDoes this mean that he now thinks that the Shroud is authentic?Or simply that supports the chemical mechanism (Maillard) proposed by Rogers to explain the image? Or the point about the medieval reweaving?\nI am really intrigued about the position of the codirector of STURP who along these years has gone so unnoticed (at least for me) and, as we could read in a previous post, considers?/considered? that the Shroud could not be a 1st Century cloth.\n\n","date":"February 1, 2013 at 2:54 am","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","id":"comment-23136","author":"Gabriel","site":"shroudstory"},{"title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?","post":"Joe Marino’s book “Wrapped in the Shroud” referenced by Jumper is not about the maillard reaction.  It was Sue Benhem and he unraveling the C-14 tests because  the repair of the corner from which the C-14 samples were taken.\n\n","date":"February 1, 2013 at 7:20 am","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","id":"comment-23147","author":"John Klotz","site":"shroudstory"},{"title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?","post":"correction “Sue Benford”\nMy apologies to Joe.\n\n","date":"February 1, 2013 at 8:45 am","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","id":"comment-23150","author":"John Klotz","site":"shroudstory"},{"title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?","post":"It’s too bad he can’t stick around a bit. When reading the into on what happened with STURP, he displayed a talent for making correct, decisive decisions under many trying circumstances.\nWe might ave much to learn from him, but I think of us could say “thank you for what you did.”\nJCK\n\n","date":"January 31, 2013 at 3:18 pm","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","id":"comment-23101","author":"John Klotz","site":"shroudstory"},{"title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?","post":"Thanks Joe.  I would love to hear Eric talk about the Shroud.  That would be such fun.\n\n","date":"January 31, 2013 at 10:45 pm","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","id":"comment-23130","author":"Andy Weiss","site":"shroudstory"},{"title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?","post":"Richard Orareo elaborated a bit in another email to me:  ERIC DID NOT GO INTO ANY INTENTION OF ELABORATING ON HIS NEW POSITION.  HE SIMPLY RE-STATED WHAT THE ANNOUNCEMENT SAID ABOUT HIS CHANGE OF POSITION.  HE IS SIMPLY LESS RIGID ABOUT THE C 14 RESULTS AND REMAINS CERTAIN OF THE VAPOR DISCHARGE THEORY OF IMAGE FORMATION.\n\n","date":"February 1, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","id":"comment-23188","author":"Joe Marino","site":"shroudstory"},{"title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?","post":"Somewhere I read the Blood of Jesus the Christ is AB. Also Publius Lentulus govenor of Judea wrote to Tiberius Caesar emperor of Rome a wonderful description of Jesus. He has blue eyes.This was found in escavated city written in Aramaic in stone.The last test of the Shroud took a piece of It from where the nuns had repaired the Shroud and made the Shroud appear younger. The carbon dating is off anyway. Eric Jumper was kind enough to write back to me when he was examining the cloth way back in New London, Ct. He really was a doubting Thomas then and hopefully he and other skeptics will wake up.  How many “proofs” does God have to give us anyway?  God asks for our faith.  God bless all who care.\n\n","date":"November 19, 2013 at 1:41 pm","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","id":"comment-52039","author":"Barbara Kvietkus","site":"shroudstory"}]
