[{"title":"Marco Bella: Shroud of Turin–Between History and Pseudoscience","post":"I have read the following words about Marco Bella :\n>Dal Marzo 2003, all’ottobre 2005 ha svolto le proprie ricerche nel gruppo del Prof. KA\nJørgensen, Aarhus Universitet, Aarhus, Danimarca, nel campo dell’organocatalisi asimmetrica tramite alcaloidi della Cinchona.\n      Rough translation = Since March 2003 to October 2005, he performed his research in the group of Prof. KA Jørgensen, Aarhus Universitet, Aarhus, Denmark. in the field of asymmetric organocatalysis by Cinchona alkaloids.. \nCinchona, common name quina, is a genus of about 25 recognized species in the family Rubiaceae, native to the tropical Andes forests of western South America…\nLink: http://en.wikipedia.org/wiki/Cinchona\n>The name of the genus is due to Linnaeus, who named the tree in 1742 after the Second Countess of Chinchón, the wife of a viceroy of Peru, who, in 1638 (according to accounts at the time, now disparaged) was introduced by native Quechua healers to the medicinal properties of cinchona bark.\nIn any case the following words by Marco Bella are questionable:\n>Ours is a country in the face of irrefutable evidence (such as dated by carbon-14) do not want to resign.\nThen it would be interesting to know what think MarcoBella (researches) about the Shroud from the chemical point of view (= Maillard Reaction or not, Corona DIscharge effects, VUV effects, thermal imprint experiments, etc.)… but this does not seem to appear from the lecture of the article…\n\n","date":"October 29, 2014 at 4:38 am","url":"https://shroudstory.com/2014/10/29/marco-bella-shroud-of-turinbetween-history-and-pseudoscience/","cat":"event","id":"comment-166484","author":"piero","site":"shroudstory"},{"title":"Marco Bella: Shroud of Turin–Between History and Pseudoscience","post":"I know that it is not meant to be a concise summary of what will be discussed there, but this abstract seems like a blantant oversimplication of the topic as a whole and is incredibly pretentious in its claims (i.e. “The country is wrong and refuses to accept the evidence!”, “We *know* what it cannot be…”) in a manner that completely minimizes the work of serious scientists that have rebutted these arguments.\n\n","date":"October 29, 2014 at 8:16 am","url":"https://shroudstory.com/2014/10/29/marco-bella-shroud-of-turinbetween-history-and-pseudoscience/","cat":"event","id":"comment-166533","author":"Eric","site":"shroudstory"},{"title":"Marco Bella: Shroud of Turin–Between History and Pseudoscience","post":"Eric, I agree with you.\nBut Marco Bella is not the first comer in Chemistry…\nI have read that:\n>Marco Bella was born (1972) and educated in Roma, Italy, where he received his PhD (2000) and “Laurea” (1997) in Chemistry from “Sapienza” University of Roma …\nWhat amazes me is the carelessness with which he has accepted\n(or he seems to have accepted) the past “verdict of 1988 C14″…\nWhy such a haste in the face of a topic so hot?\n… But really, to better understand the issue, it is necessary to know what\nis the curriculum of Statistics of the Chemist Marco Bella.\n… and not a word of comment on the particular case of control for ancient woods and linens made ​​by professor Campanella, who indicated a sensoristic approach…\nWhat do you think?\nWithout the use of advanced microscopies (= AFM, CFM, etc. … and adequate set of tests) I do not think he can easily dismiss hastily years of controversies.\nI do not think Dr. Marco Bella as “an expert microscopist”, but\nI certainly do not subscribe prior convictions against him!\nHere I can not show disrespect for a Ph Dr. who has earned his titles.\nPerhaps it would be better to discuss with him the issues touched on here.\n— —\nIn any case, the question of the past C14 test, (year: 1988) is a long story…\n… and perhaps this remark can also include the strange speculations around the presumed role of KGB, written (recently) by Stephen Jones … in short, it would become an endless poem!\n— — —\nWe’ll see if they succeed in Rome to debate better than what we do (perhaps badly) …\n\n","date":"October 29, 2014 at 1:28 pm","url":"https://shroudstory.com/2014/10/29/marco-bella-shroud-of-turinbetween-history-and-pseudoscience/","cat":"event","id":"comment-166610","author":"piero","site":"shroudstory"},{"title":"Marco Bella: Shroud of Turin–Between History and Pseudoscience","post":"I believe that the omission of anything besides the author’s own POV may very well have been a PR move. By displaying a slant towards the skeptic side, I assume that he expects to attract a heavily skeptic crowd. The title also suggests that this was the original intention. Since it was taken from his blog, I can only assume that this is not the “official” document and he is just rallying his troops. Although, since the seminary is free, I have no idea why he would try to apeal to a certain public.\nThe alternative could be a lack of understanding of the topic. I would not speculate on the validity of Bella’s credentials within his own field. But his disregard for one half of this argument was premature and, in my opinion, may very well reflect that he has not reviewed the papers published by people on both sides… Had he done so, then he should not have brushed aside the issues like that.\nRegardless of the answer, I still believe that the manner in which it was presented was completely inadequate. \nUnfortunately, the unwillingness to proceed with new testing -even of the non invasive kind- keeps the C14 tests as the most “up to date” large scale study and somebody that is not informed, could very easily believe that they are unchallenged… And that could be easily exploited, just as seen here.\n\n","date":"October 29, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/10/29/marco-bella-shroud-of-turinbetween-history-and-pseudoscience/","cat":"event","id":"comment-166653","author":"Eric","site":"shroudstory"},{"title":"Marco Bella: Shroud of Turin–Between History and Pseudoscience","post":"Since it appears you really like the subject:\nhttp://www.ilfattoquotidiano.it/2015/04/13/sindone-quando-la-storia-puo-essere-rigorosa-quanto-la-scienza/1584100/\nPS please do not use google translator. I will be happy to provide an English version.\n\n","date":"April 13, 2015 at 1:12 pm","url":"https://shroudstory.com/2014/10/29/marco-bella-shroud-of-turinbetween-history-and-pseudoscience/","cat":"event","id":"comment-196234","author":"Marco Bella","site":"shroudstory"}]
