[{"title":"New Official St. Louis Conference Website","post":"The question underlined by Louis in a past message, on this blog, the directionality for the presumed radiations that generated the Holy Imprint on linen sheet, seems to be a particular argument …\n“Wave of matter and waves of energy… When both generated from the first  instant of an unknown phenomenon.” … This can be the title to study for the thoroughbred scientific intervention …\nUsing our Science we can start to discuss this question considering the natural explanations for what seems to be the natural result from the condensation-reaction-evaporation cycles (= wet conditions, IR from the body, aromas and cadaveric emissions) … or … we can delve into the new hard Physics, trying to be updated …\nFor example :\nStephen Hawking has published a new study where the quantum fluctuations of Space-Time\nare involved in the “Black Hole’s weather-forecast” …\nBut, before to speak on that new and difficult matter (as connected with the new interpretation for “The Sign”), at least we have to know what Hawking exactly wrote … !\nIn any case (IMO) we have to answer to the question :\nWas the Shroud the result from the directional radiation similar that of the Black Hole (=BH) ?\n— —\nHave you read the new theory by Stephen Hawking (DAMTP, University of Cambridge, UK) ?\nHere the title :\nInformation Preservation and Weather Forecasting for Black Holes\nhttp://arxiv.org/pdf/1401.5761v1.pdf\n— —\nSee also :\nStephen Hawking Thinks Universe Is Not so Holey After All\nLink :\nhttp://guardianlv.com/2014/01/stephen-hawking-thinks-universe-is-not-so-holey-after-all/\n… at the end, there is\nthe conclusion :\n> … … If Stephen Hawking came to this conclusion about black holes actually being grey holes, why is it only being talked about now, 10 years into the future? Scientific progress takes time and although Hawking submitted a paper about his new theory on January 22, it still must pass a peer review to make the transition to go from being scientific theory to scientific fact. If it does, then thinking that the universe isn’t so “holey” might not be such a crazy notion after all.\n— —\nI have several doubts … and I ask your opinion.\nIn my idea we have to investigate the linen fibrils using the SPM techinques, but there are other subtle things to take into account …\nWell.\nWhat is your opinion about the Black Hole Radiation (= BHR) and the new theory by S. Hawking in order to improve the investigations/speculations on BIF (= Body Image Formation)?\n\n","date":"January 28, 2014 at 9:40 am","url":"https://shroudstory.com/2014/01/28/new-official-st-louis-conference-website/","cat":"event","id":"comment-74958","author":"piero","site":"shroudstory"},{"title":"New Official St. Louis Conference Website","post":"The message sent by Louis was the following :\nJanuary 24, 2014 at 7:57 am\n>If it is vertical radiation then it could be counted as another unique characteristic of the Shroud. After all, we have other conflicting information.\n— —\nThe idea of BHR seems to be interesting and the photon sphere is a spherical boundary of zero thickness !\nSorry … Here  I am very limited …\nFor example : I don’t know the exact composition of accretion disk around a black hole …\nI have read that relativistic jets are extremely powerful jets of plasma which emerge from presumed massive objects … But all these things seem to be far from the Shroud.\nWhere is the truth ?\nOnly investigating (in a non-destructive manner) the linen fibrils (taken from the Shroud) we can improve our knowledges.\nThe 14C tests are not the right way to approach the BIF problem.\n\n","date":"January 28, 2014 at 9:59 am","url":"https://shroudstory.com/2014/01/28/new-official-st-louis-conference-website/","cat":"event","id":"comment-74960","author":"piero","site":"shroudstory"},{"title":"New Official St. Louis Conference Website","post":"Good evening, Piero. My comment was prompted by someone else’s comment that the radiation had to follow a known pattern, assuming that any other proposition would be a violation of the laws of nature, created in some sort of Platonic heaven as many assume. There seems to be no reason why divine agency should be trapped by, or obey, the laws of nature and exceptions to ordinary behaviour is what the Catholic Church calls miracles, after examining the conditions that warrant an exception.\nIt is good that you brought Stephen Hawking into the scenario, for he goes beyond Einstein by asking the right questions, not limiting himself to Spinoza’s “deity” to which Einstein subscribed. He has all the marks of a true scientist, not indulging in scientism, knowing that science will never answer all questions. That is why he is a member of the Pontifical Academy of Sciences.\n\n","date":"January 28, 2014 at 10:39 am","url":"https://shroudstory.com/2014/01/28/new-official-st-louis-conference-website/","cat":"event","id":"comment-74966","author":"Louis","site":"shroudstory"},{"title":"New Official St. Louis Conference Website","post":"I would like to go, but I already have plans that weekend.  I’m sure that will break your hearts.  :o)\n\n","date":"January 28, 2014 at 8:45 pm","url":"https://shroudstory.com/2014/01/28/new-official-st-louis-conference-website/","cat":"event","id":"comment-75020","author":"Andy Weiss","site":"shroudstory"}]
