[{"title":"On the Day of the BSTS Meeting","post":"“Denis Mannix, chemist, has been revisiting the material published on the Maillard reaction theory and will reveal the results of his investigation so far.”\nI’m waiting for a comprehensive review of literature and the results of his investigation.\n\n","date":"October 21, 2012 at 8:03 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-17971","author":"anoxie","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"Thanks for posting this, Dan. I appreciate the space you give to a sceptic who nevertheless appreciates that there are mysteries surrounding the Shroud that leave many aspects of  its provenance and creation open.\nI have consistently argues that the Wilson /Edessa trail is a false one without sufficient evidence to sustain it. i feel that it has been accepted far too uncritically. However, by discarding it we open up new possibilities of research that have not,so far as I can see, been properly explored. Wilson has acted as a deadweight on research.\nI leave aside the scientific aspects as I am not qualified to judge them but the following are possibilities.\n1) If the Shroud originated in Jerusalem, one needs to explore the other routes by which it may have come into Europe- these would include its arrival among the relics we know we transferred DIRECT from Jerusalem to Constantinople in the fourth and fifth centuries. We also need to look more thoroughly at the relic lists of the Fourth Crusaders to see if there is anything in them than could be seen as a Shroud- as well  earlier references to cloth being given by the Byzantine emperors as gifts at least one of which is referred to as a shroud.  Then there are the many relics brought direct to Europe from Jerusalem after its capture in the First Crusade (1099) such as the Shroud of Cadouin (though this is known to be eleventh century). The reports of pollen from the Middle East on the Shroud are relevant here.\n2) There is a lot of talk about weaves, linings and stitchings. These need to be brought together to provide a clearer picture of when similar weaves to those of the Shroud were being produced and by whom. It is commonly said that similar weaves and stitchings from the first century  are known- I would like to see pictures of these but also place them in the wider context of similar weavings from other centuries.\n3). The sudarium of Oviedo was only part of a cache of relics that were together in a chest in 1075. Do the others still survive? What light would they shine on the sudarium if examined properly?\n4) There are 150 Greeks words, at least, beginning with tetra-almost every one relates to ‘four’ .Would an analysis of these bring us closer to understanding tetradiplon? Similarly there seem to interesting possibilities in examining the uses of Greek words beginning with ‘dipl’ such as ‘diploe’, etc.\nThere are many more areas to research. There are many contributors to this blog who say they are ‘shroud researchers’ (although it is depressing to see how many of these seem to be repeating  Wilson’s hypotheses without producing any insights of their own – I was especially frustrated by de Wesselow’s claim that he had worked on the Shroud for six years but I have not found any genuine new research in his book, The Sign!) so I hope they can take on these points.\n Although I have my own doubts about the early dating of the Shroud, none of these avenues of research is incompatible with the Shroud  being authentic. It just needs the readiness to break out of the Wilson mindset to breathe new life into the subject.\n\n","date":"October 21, 2012 at 11:40 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-17975","author":"Charles Freeman","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"Re CF 2): Weaves & Cloths:  I referred in recent posting under Diana Fulbright header, to her paper givng several examples of cloths and weaves found in Judean Desert:  “Akeldama repudiation of Turin Shroud omits evidence from the Judean desert”, Diana Fulbright, Frascati Conference May 2010.  Paper is secured, but when I went back to it, Google said it was damaged and could not be repaired.  I originally found it at:\nhttp://www.acheiropoietos.info/proceedings/FulbrightAkeldamaWeb.pdf\nIf you can’t find it here, try Frascati Shroud Conference.\nPaper includes several photographs, and micro-photos, close-ups and weaves, and also desert weavers, etc. .\n\n","date":"October 21, 2012 at 3:57 pm","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-17980","author":"daveb of wellington nz","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"DaveB. Thanks for this useful article. There still seems some surprise about early weaving although this has been one of the main activities of communities since the earliest times (the earliest archaeological evidence for a woven cloth now goes back 25,000 years) and very well documented even when examples do not survive- e.g. the vast number of depictions of woven clothing on Greek vases- the size of which can be easily measured, just as can the peplos of 430s BC shown on the Parthenon frieze. Looms are shown on vases and there are lots of literary references to wool workers in the Greek world  from Homer onwards (and much earlier in the Middle Eastern sources where textile making was probably the largest industry). Everyone wore clothes that were woven. I don’t know what Diana Fulbright does not draw on the mass of this other evidence but only on the tiny and probably unrepresentative samples that survive. That is why i argued above for the wider context.\nBy the time of Jesus weaving  was considered to be the mark of the virtuous stay-at-home woman and the emperor Augustus (died AD 14) insisted that his wife Livia should be at home supervising the in-house weaving.\nThe problem is  the same forms of weaving persisted for generations so that Gilbert Raes, as quoted by Diana Fulbright , states:\n“The type of weave [the herringbone pattern of the Turin Shroud] is not particularly distinctive and does not enable us to determine the period in which it was produced” .\nThat is the problem- although the Shroud is fine linen the weave does not stand out as especially distinctive. As Prof. Fulbright shows, via Flury-Lemburg, that the Shroud weave is known in the Tyrol as far back as 800 BC and there are certainly medieval examples ,so one has  a long time span.\nI notice that Prof. Fulbright appears to use radio-carbon dates for  cloth up to 6000 BC without comment  – so there is SOMEONE who believes it is a relevant way of dating cloth.\n\n","date":"October 22, 2012 at 4:19 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-18015","author":"Charles Freeman","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"I believe Professor Fulbright wrote her paper in response to comments, partly arising from the single plain weave shroud at Akeldama, and partly exposing the lie to elaborate weaves such as 3:1 herring bone twill of the TS were uncommon in 1st C Palestine, which is the reason for her examples being confined to the Judean desert.  The paper needs to be understood in that context, so that other examples from elsewhere were not relevant in that context.\n\n","date":"October 22, 2012 at 4:33 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-18017","author":"daveb of wellington nz","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"I partially take your point  but Fulbright weakens her argument for a Jerusalem source for the Shroud by giving, at the end of her article, examples of a similar weave to the Shroud from the Tyrol, southern England, Sweden, Dura-Europus , Egypt and Pompeii, thus showing it was a common weave throughout Europe and as far east as Dura-Europus. So what does this tell us? Just that, as Raes noted, it is impossible to date or allocate the place of manufacture of the Shroud from the weave alone so that approach needs to be abandoned. As DF has accepted the radio-carbon dates for her, much older , samples without comment, I assume she would be happy to use them on the Shroud itself.\nIncidentally Google Images :’ Looms Greek vases’ will show that large pieces of cloth could be woven and there should be similar evidence in H. Ling Roth’s Ancient Egyptian and Greek Looms. I don’t know where the idea that only small cloths could be woven in ancient times ever came from.\n\n","date":"October 22, 2012 at 4:48 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-18018","author":"Charles Freeman","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"BSTS is open to all, so sceptics are bound to raise questions, but it is clear that Mannix will be in the limelight. As for Dawkins examining the Shroud, given the fact that he wanted criminal charges against Benedict XVI, will he enter Church-opened property? Further, if he wants to see everything to believe, has he seen everything in the theory of evolution? Can he answer the Pope’s contention that you cannot haul generations into the laboratory?\n\n","date":"October 21, 2012 at 11:42 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-17976","author":"Louis","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"Louis- yes they say they are open to all on their website, but I seem only be able to find articles that support the authenticity of the Shroud in their material, so the image that they project is pro-authenticity. Perhaps a full ‘minutes’ of today’s meeting will contain contributions by sceptics and one will be reassured  that they are genuinely open to all.\nWasn’t the Dawkins challenge always a non-starter. He won’t be allowed to examine the Shroud but no scientist would ever take up the challenge without being able to examine the Shroud, assess the tests they would want to do, many of them involving new techniques, and then do them before making a judgement.\n\n","date":"October 21, 2012 at 2:08 pm","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-17977","author":"Charles Freeman","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"Charles, Yes, I agree to what you have said in the first paragraph, because one needs to be fair and both viewpoints must be presented. Any good pro-authenticity scholar can tackle a sceptical viewpoint openly, as it has been done in the book “The Shroud. Fresh light on the 2000-year-old mystery”.\nAs far as I know, the Church has asked scientists to make research on the provenance of the Shroud, but this will take time and you can be sure that there will be advice on which new techniques to choose. However, to be fair again, the previous tests can not be ruled out when the important characteristics they have demonstrated are taken into account. \nWhen Jung read Nietzsche, in fact dedicated some time to lecturing on “Zarathustra”, he discovered that the philosopher was very much a Christian — unconsciously. It was not exactly hard to reach this conclusion. Shortly before his death Nietzsche dispatched a letter to the Vatican Secretary of State asking him to look at “the crucified one”, referring to the state of his health. The cynicism did not hide his unconscious and, for some reason or the other, he was given a Lutheran burial. You will wonder why all this is being said,so here is the explanation:\nRichard Dawkins has been described as a “cultural Christian”, but it is much more than that. He is unconsciously very much an Anglican, so much so that he carries with him all those old (and mostly forgotten) prejudices against the Catholic Church that were once in vogue in the Church of England. He discussed evolution with Archbishop Rowan Rowan Williams, a most noble mind in Christianity today, knowing that the prelate believes in the theory of evolution, although he also believes that man was made in the image of God.\nSome of Dawkins’ hostility seems to be derived from the fact that the Shroud is in the hands of the Catholic Church, which he hates. (Perhaps he is second only to Cromwell, or third in the line, that is, after Paisley). So there is the problem of a “Catholic” relic in the hands of an institution for which he has only demonstrated hatred. Is he the right person to teach about morality? He is pulling the rug under the people whose faith has sustained them in the face of tremendous difficulties and suffering. Faith among people in such circumstances prompted a “tough hombre” like (US Army) General Creighton Abrams to convert to Catholicism in Vietnam.      \nThe other difficulties are that image information does not fall within his area of expertise, which means that he will necessarily have to rely on what other scientists say and have said. If he could only be like Hawking, who also denies the existence of God, but is a member of the Pontifical Academy of Science —- and demonstrates no hatred.\n\n","date":"October 21, 2012 at 3:57 pm","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-17979","author":"Louis","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"Fasciniating commentary Louis; I didn’t know that about Nietzsche, I thought he was the first of the modern atheists – “God is dead”, “We have killed God”.  Hawking seems to have fluctuated a bit – His early writings on “Big Bang” theory seem to have him believing in a Creator, and then he satisfied himself that it was all going to be automatic anyway, and there was no need for God, perhaps he wasn’t prepared to make the leap of faith into the dark – like others such e.g. Betrand Russell “He had to know!”  Re Pontifical Academy of Sciences” I recall reading several years ago a few science papers written by Pope Pius XII (Eugenio Pacelli) on qasars – he had an active interest in modern astronomy.\n\n","date":"October 21, 2012 at 4:12 pm","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-17981","author":"daveb of wellington nz","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"David, there seem to be things that Nietzsche wrote that have not come to light and one must not forget that his sister was the self-appointed editor and made profit from it. Did she know something to justify giving him a Lutheran burial? Did the fall that eventually led to the death of his father, a Lutheran pastor, made him lose his faith completely?\nHawking changes his mind and admits it openly and does he really believe everything is automatic (in a mechanistic universe) and ignores the fact that the creation of the universe is not exactly natural?\nPius XII issued an encyclical ” Divino afflanteSpiritu” in 1943, allowing the Biblical Commission to play a more open-minded role in biblical scholarship, therefore his interest in astronomy is not surprising. The encyclical went beyond what Leo XIII and Pius X had started.\nHopefully an interview granted by one of the world’s topmost biblical scholars on what we know about the Bible, conducted around two years ago, and with an introduction that dwells on the scientific issues, will be posted on a suitable website shortly.\n\n","date":"October 21, 2012 at 5:00 pm","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-17983","author":"Louis","site":"shroudstory"},{"title":"On the Day of the BSTS Meeting","post":"\nCharles Freeman :I partially take your point but Fulbright weakens her argument for a Jerusalem source for the Shroud by giving, at the end of her article, examples of a similar weave to the Shroud from the Tyrol, southern England, Sweden, Dura-Europus , Egypt and Pompeii, thus showing it was a common weave throughout Europe and as far east as Dura-Europus. So what does this tell us? Just that, as Raes noted, it is impossible to date or allocate the place of manufacture of the Shroud from the weave alone so that approach needs to be abandoned. As DF has accepted the radio-carbon dates for her, much older , samples without comment, I assume she would be happy to use them on the Shroud itself.Incidentally Google Images :’ Looms Greek vases’ will show that large pieces of cloth could be woven and there should be similar evidence in H. Ling Roth’s Ancient Egyptian and Greek Looms. I don’t know where the idea that only small cloths could be woven in ancient times ever came from.\nI don’t recall anyone ‘EVER’ using the 3 to1 herringbone weave ‘alone’ as evidence for the Shroud “to date or allocate the place of manufacture”, except that it certainly was not manufactured in medieval times, as by then it was not ecomical to do so and the looms themselfs had changed. I also believe archealogical evidence shows quite clearly, large and very large cloths were being created in ancient times, and with various stitch counts, weave patterns and even multiple type stock. I’ve read somewhere of cloths being loomed in ancient Egypt four times the width and twice the length of the Shroud! From what I recall, skeptic’s arguments in the past have been that cloths the size and complexity of the Shroud were not manufactured in ancient times. The evidence too the contrary of this, just strengthens the Shroud probable ancient provenance actually.\nR\n\n","date":"October 22, 2012 at 7:33 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","id":"comment-18027","author":"Ron","site":"shroudstory"}]
