[{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"We must always decode the language of Benedict 16. When he speaks of the Shroud as the “icon of the Holy Saturday”, this means that the Church doesn’t considers at all this relic and its image as a (direct or indirect) of the resurrection but as a natural outcome from the interaction of a dead body and the Shroud it covered, exactly like the work of Ray Rogers, Pierre Barbet, Alan Adler and some others suggest. Because, as far as I know, Holy Saturday is the day when the body of Christ was still dead in the tomb and covered of his Shroud!  \nJohn Jackson and many others shroudies seem to believe that trying to prove the Resurrection while using the Shroud and his image is really the right thing to do when you are a “good Christian” and a scientist.  Unfortunately for Jackson, I think the way Benedict 16 called the Shroud is a great proof that the way Jackson and cie is seeing it (and wants to “use” it) is totally inconsistent with the Church’s point of view (which I totally share)!\n\n","date":"February 27, 2013 at 12:07 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25822","author":"Yannick Clément","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"A little mistake can be seen in my first phrase. You should read this instead : “the Church doesn’t considers at all this relic and its image as a (direct or indirect) outcome of the resurrection.\nSorry.\n\n","date":"February 27, 2013 at 12:09 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25823","author":"Yannick Clément","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"I’m not so certain that a secret decoder ring is necessary.  Perhaps it is worth considering the possibility that  your own views may be casting a rather big shadow here?  In May of 2010, Benedict also spoke that “This is the mystery of Holy Saturday! Truly from there, from the darkness of the death of the Son of God, the light of a new hope gleamed: the light of the Resurrection. And it seems to me that, looking at this sacred Cloth through the eyes of faith, one may perceive something of this light. Effectively, the Shroud was immersed in that profound darkness that was at the same time luminous”.\n\n","date":"February 27, 2013 at 3:20 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25837","author":"Kelly Kearse","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"Kelly, you have a remarkable competence in expressing the plain truth in a very tactful manner.  If I’d got here first, I would have been much more blunt about YC’s comment! “We must always decode the language of Benedict 16.”  What arrogance!\n\n","date":"February 27, 2013 at 3:31 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25839","author":"daveb of wellington nz","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"You don’t need a Phd to understand the difference between the Holy Saturday and Easter !!!  In the Catholic tradition, the Holy Saturday is the day Jesus went to Hadès (the place where the deads were parked if you pardon me the expression).  The Resurrection is not linked to that day but to Easter morning.  When the pope linked the Shroud with Holy Saturday, clearly he was meaning that we should not seek some kind of an evidence of the Resurrection on that cloth.  And if you do Dave (or Kelly or Ron or anyone else), then truly, I’m sad for you…\n\n","date":"February 27, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25849","author":"Yannick Clément","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"I lost my Decoder ring long ago, but in Benedict’s statements; “looking at this sacred Cloth through the eyes of faith, one may perceive something of this light.” and “Effectively, the Shroud was immersed in that profound darkness that was at the same time luminous”…Is he possibly hinting to all what he actually believes caused the image? …In essence the LIGHT of the resurrection? …I believe this is exactly what he is saying.\nR\n\n","date":"February 27, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25842","author":"Ron","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"Interesting remark Kelly but I think you should be very careful yourself “that your own views may be casting a rather big shadow here”… When the Pope said “looking at this sacred Cloth through the eyes of faith, one may perceive something of this light”, I really don’t think he was meaning that we can see any kind of physical trace or any scientific piece of evidence of the Resurrection of Jesus on the Shroud! If you think that way, I’m sorry to tell you that it’s a dangerous extrapolation…  I often said that myself on this blog : With the eyes of faith, it is possible to see some signs of the Resurrection on that cloth and I’m certain that this was the real sense of Benedict’s statement about being able to see “something of this light” on the Shroud.  He was certainly not meaning that the image was the product of a flash of light that came at the moment of the Resurrection!!!  COME ON!!!\n\n","date":"February 27, 2013 at 5:51 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25854","author":"Yannick Clément","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"If Benedict 16 would have wanted to make us believe that the Shroud was directly or even just indirectly linked to the Resurrection, he would have used the expression “Icon of Easter” !  COME ON !  The Church NEVER claimed that there is any link at all between that cloth (which she NEVER claimed to be genuine by the way) and the Resurrection of Christ.  Of course, anyone can make that kind of link personally, but what I wanted to emphasize is the FACT that the official teaching of the Church versus the Shroud NEVER intend to make believe that some kind of evidence of the Resurrection can be seen on that cloth!  You can think otherwise of course, but be sure that if you do, you don’t follow the official teaching of the Church.  Why it is so hard to understand that the Shroud is a cloth that show a DEAD MAN, not a living Christ in glory ???\n\n","date":"February 27, 2013 at 4:57 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25850","author":"Yannick Clément","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"Lets use some commonsense here Yannick!…’Actions speak louder then words’, remember that old saying? IF the(Church) did not believe this Shroud to be authentic, then ask yourself, why would they spend millions to protect it? If it is simply a cloth, it would or should mean nothing to them, even if thought of as a fine piece of art. Seriously I think you should read Benedict’s words a little closer.\nR\n\n","date":"February 27, 2013 at 5:18 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25851","author":"Ron","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"Ron, be careful not to mix things here! I’m CONVINCED that Ratzinger personally believe the Shroud to be genuine and I’m sure it is also true for a majority of the Catholic clergy, but as a Pope, he can’t say that the Shroud is the genuine Shroud of Jesus Christ because science WILL NEVER BE ABLE TO PROVE WHAT WAS THE IDENTITY OF THE SHROUD MAN!  Also, the fact that many popes (Benedict 16 is just one among many) personally believe the Shroud to be authentic DON’T MEAN FOR ONE SECOND that they also believed that the image on the cloth is a product (direct or not) of the Resurrection!  Again, we must be careful here not to mix things up here!\n\n","date":"February 27, 2013 at 5:40 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25852","author":"Yannick Clément","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"Another portion of Benedict’s May 2010 homily, “I think that if thousands and thousands of people come to venerate it without counting those who contemplate it through images it is because they see in it not only darkness but also the light; not so much the defeat of life and of love, but rather victory, the victory of life over death, of love over hatred. They indeed see the death of Jesus, but they also see his Resurrection”\nThe entire homily may be found here:\nhttp://www.shroud.com/pdfs/Benedict%2002May2010.pdf.\nI’ve looked, but I didn’t see a “P.S. I was only kidding!” at the bottom of the document.\nOpinions vary, but I’m not seeing any mention of ovaltine here\n\n","date":"February 27, 2013 at 6:06 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25856","author":"Kelly Kearse","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"Nice comment M. Kearse.  But it’s important to understand that when Benedict 16 said “They indeed see the death of Jesus, but they also see his Resurrection”, he should have add this (or people who read or listen to this speach should have add this in their head) :  WITH THE EYES OF FAITH !!!!  So, let’s read again the real meaning of the Pope’s talk: “They also see his Resurrection WITH THE EYES OF FAITH !”  \nThis is truly crucial to understand that there is NO PROOFS OF THE RESURRECTION ON THE SHROUD and there will never be. Only with the EYES OF FAITH can someone see some SIGNS (NOT SCIENTIFIC PROOFS) of the Resurrection of that cloth.  This is the reality now and this will most certainly be the reality 1000 years from now !\nSo, the only way someone can be able to “also see his Resurrection” on the Shroud is and will forever be THROUGH THE EYES OF FAITH, which are very different than the eyes of science…  I’m sorry for some of you who will read this but this is the reality :  With the pure eyes of science alone, the only thing someone can see on the Shroud is the image of a tortured and dead man who looked like the Byzantine presentation of Jesus.  NOTHING ELSE…\n\n","date":"February 28, 2013 at 11:49 am","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25932","author":"Yannick Clément","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"Benedict XVI said “Holy Saturday” because the image shows a dead man and the words “at the same time luminous” could mean in the process of resurrection. If he had said “Icon of Easter Sunday” that would be interpreting the image as de Wesselow did. There was no need for any Shroud from that Sunday onwards — at least in the primitive Church.\n\n","date":"February 27, 2013 at 6:11 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25859","author":"Louis","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"YC wrote: “we must be careful” and before even finishing his sentence most peremptorily asserts in the name of science: “science WILL NEVER BE ABLE TO PROVE WHAT WAS THE IDENTITY OF THE SHROUD MAN” (his bolds). \nWho is YC to speak so LOUD in the name of science? How can he tell for sure? Perhaps (in the same vein of its very first comment) it is worth considering the possibility (as Kelly would mildly put it) that ‘his own views may be casting a (rather big) shadow of doubt here as to the relevance of his status as spokesman for Science on such an issue?\n\n","date":"February 27, 2013 at 6:22 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25860","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"assume the shroud is the burial cloth of Jesus then it is the object that was in physical contact with the body of Jesus at the instant of ressurrection. The question then becomes would this intimate physical object be affected by this unique event; taking into account  the unique image on the shroud I would say it is a witness to the ressurection.\n\n","date":"February 27, 2013 at 10:41 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25870","author":"Paul","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"A question related to the Shroud exhibition itself, for those in the know: during this event, or a longer public display, is the Shroud simply raised upward and Inserted into a larger frame for viewing, or is it removed from its more permanent storage case & transferred to another (temporary) unit for public viewing? Does it ever leave the argon-containing, humidity-regulated environment, even for a short transfer?\n\n","date":"February 27, 2013 at 9:02 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25868","author":"Kelly Kearse","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"The cabinet in which the Shroud is stored in an nitrogen/argon environment is the same cabinet in which it is displayed. The framed Shroud is raised hydraulically into position and then lowered at the end of an exhibition. It is always stored in its temperature and humidity controlled case.\n\n","date":"February 27, 2013 at 9:32 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25869","author":"Barrie Schwortz","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"Thanks Barrie, for the info.  Safe travels on your upcoming trip/lecture tour-that’s quite a marathon schedule, especially with several lectures in a single day\n\n","date":"February 27, 2013 at 10:59 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25871","author":"Kelly Kearse","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"I second that wish…\n\n","date":"February 28, 2013 at 11:50 am","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-25934","author":"Yannick Clément","site":"shroudstory"},{"title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral","post":"Here, I would like to make a complementary comment concerning the one I wrote 2 days ago in a reply to a post made by Kelly Kearse.\nI that comment, I was trying to convince Mr. Kearse (and anyone else) to be very cautious before taking the words of Benedict 16 that he quoted at first level and thinking that the Pope was telling his audience that we could really see some kind of a direct and physical piece of evidence of the Resurrection in the image that is on the Shroud.  Honestly, I think this is a bad understanding of the Pope’s speech.  We must go deeper into Benedict’s reflection and that’s why I used the image of a decoder in my first comment on top of that page.\nAs I said with great emphasis (because this is so important to understand), the only way someone can see a sign (or some signs) of the Resurrection on the Shroud (not proofs!) is through the eyes of FAITH, not through the eyes of science, which can ONLY see and describe the image of a beaten, scourged, crucified and dead man on that cloth and NOTHING ELSE.   \nNote that this kind of observation with the eyes of science must be done and, in fact, was remarkably done during the first half of the 20th century by French scientists like Vignon and Barbet and also by Monsignor Rinaldi (who are the real pioneers of Shroud science) and later on, by the STURP team and others after that who, because they were analysing the Shroud solely through the eyes of science, could not describe anything else than the image of a crucified and dead person!  With this kind of physical “look”, it is truly IMPOSSIBLE to see something that can look like a physical proof of the Resurrection on the cloth, simply because this event goes beyond the scope of a true scientific analysis.  \nOn that subject, Ray Rogers had some very good and true things to say in his book and I’m sure he said those things because he was aware that in some scientific study of the Shroud (some of them being done by ancient members of STURP unfortunately), some scientists were denaturalising Shroud science by trying to “prove” the Resurrection with the image that we see on the cloth  (or at the very least, strongly suggesting the reality of that supernatural event), which is not what we can call an authentic and a good science.       \nSo, I’ll repeat it: the only way someone can see something related to the Resurrection on that cloth is through the eyes of FAITH and nothing else and I’m 100% certain that this is what the Pope was meaning in his Turin speech.  And I would like to add that, in order for someone to reach that kind of profound level of scrutiny, he MUST go BEYOND the body image and the bloodstains we can see on the Shroud, simply because there is nothing on the cloth (not even the supposed undisturbed aspect of the bloodstains) that can be consider as a definitive proof that something supernatural happen in that shroud.  I’m really convinced of this and, in fact, I think the most important sign of the Resurrection we can detect on that cloth with the eyes of faith is the Shroud itself!  To me, the simple fact that such a gruesome burial cloth has been kept and preserved for all these years speaks of the Resurrection of Christ louder than anything else!\nIn fact, I don’t think that was anything different 2000 years ago with the empty tomb!  That’s why I have a tendency to consider the Shroud in the same category as the empty tomb, which is truly an historical fact that was seen at the time by some persons as a SIGN (not a proof) of the Resurrection of Jesus Christ. Again, we must understand that these believers could never have reach that point simply through the “eyes of science” and they needed their eyes of FAITH instead!  Without that kind of look, IT WAS SIMPLY IMPOSSIBLE for anyone in Jerusalem at the time to see anything else than an empty tomb that once contained for a time the crucified body of Jesus of Nazareth…  So, I really think we should understand that the words of Benedict 16 concerning a possible way to “see” the Resurrection on the Shroud as something that is completely related to faith and not science and I also think we could change the word “Shroud” for the expression “the empty tomb” in the discourse of the Pope and the meaning would not change at all!  Don’t forget that the Shroud can also be seen as an empty object because we know for a fact that it contained the dead body of a man for less than 72 hours and that body “disappeared” at one point.  In the end, the reality is this: these two material objects that are the Shroud and the empty tomb can only be view as two signs of the Resurrection and never as two proofs of that event and, in order to reach that point, the eyes of faith are truly needed.  \nI sincerely think that this is the heart of that speech of Benedict 16 concerning the Shroud.  And by using the expression “icon of the Holy Saturday”, I think he made things quite clear (at least for me) that this cloth was more directly and physically related to the dead body of Christ than to his glorious resurrected body that first appear to Mary Magdalen the next morning, even though we can still see some signs of that supernatural event by looking at the Shroud WITH THE EYES OF FAITH!\n\n","date":"March 1, 2013 at 9:27 am","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","id":"comment-26021","author":"Yannick Clément","site":"shroudstory"}]
