[{"title":"Palm Sunday: Jesus’ Triumphal Entry into Jerusalem","post":"Dan,\nII have been kind of diverted today, by another interest of mine – JFK. For the past two years we have been celebrating day by day the 150th anniversary of events in the Civil War. This year is of course huge. There is the horrific Union loss at Chancellorsville followed by the turning point victories at Vicksburg and Gettysburg in July, followed by the Gettysburg address at which redefined our  Nation, turning us toward the fundamental values of the Declaration of Independence.\nThis is also the fiftieth anniversary of two events of the JFK presidency. The first was the June speech at American University in DC where he first publicly proposed a ban on the atmospheric testing of Atomic weapons. Both he and Khrushchev and looked into the abyss the previous year during he Cuban Missile Crisis and knew the desperate path the World was trodding toward nuclear anihilation.\nKennedy’s speech is best remembered by this phrase about the need for Us-Soviet cooperation:\nFor in the final analysis, our most basic common link is that we all inhabit this small planet. We all breathe the same air. We all cherish our children’s future. And we are all mortal.\nKennedy lost the White House on November 22, 1963. There is substantial evidence that he did plan to pull of Viet Nam after the 1964 election and already had drafted an order to pull back our commitment. All that ended in Dallas, His successor gave the military-industrial complex the war it wanted.\nLincoln finally won is war in 1865. He visited vanquished Richmond but a week later he too was assassinated.\nI have come to believe the enduring truth of the Christian faith (or myth, if that suits you) is not the resurrection but its transfiguring of all human experience into the divine. Lincoln and Kennedy both enjoyed great triumphs before their assassins struck. The cheers in Dallas were still ringing in JFK’s ears when all went black.\nToday is Palm Sunday when Jesus rode into Jerusalem on the back of an ass. Cheers were ringing also n his ears. Then came the crucifixion and three days of black for his disciples. And then cam Easter morning and the witness of Mary Magdalene that some thing had marvelous had happened.\nToday is Palm Sunday and we can not forget even as we celebrate that Good Friday lies only five days in the future. But then two days more and it is Easter.\nI close with a quotation from Elaine Pagels, autyher of the Gnostic Gospels:\n“In its portrait of Christ’s life and his passion, orthodox teaching offered a means of interpreting fundamental elements of human experience. Rejecting the gnostic view that Jesus was a spiritual being, the orthodox insisted that he, like the rest of humanity, was born, lived in a family, became hungry and tired, ate and drank wine, suffered and died. They even went so far as to insist that he rose bodily from the dead. Here again, as we have seen, orthodox tradition implicitly affirms bodily experience as the central fact of human life. What one does physically—one eats and drinks, engages in sexual life or avoids it, saves one’s life or gives it up—all are vital elements in one’s religious development. But those gnostics who regarded the essential part of every person as the “inner spirit” dismissed such physical experience, pleasurable or painful, as a distraction from spiritual reality—indeed, as an illusion. No wonder, then, that far more people identified with the orthodox portrait than with the “bodiless spirit” of gnostic tradition. Not only the martyrs, but all Christians who have suffered for 2,000 years, who have feared and faced death, have found their experience validated in the story of the human Jesus.”\nWe in this generation are blessed with a new revelation: His Shroud which not only registers the fact of His crucifixion, but whispers the hope of His Resurrection (and ours),\n\n","date":"March 24, 2013 at 12:05 pm","url":"https://shroudstory.com/2013/03/24/palm-sunday-jesus-triumphal-entry-into-jerusalem/","cat":"event","id":"comment-28272","author":"John Klotz","site":"shroudstory"}]
