[{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"Scientifically interpreting gray scale into 3D data means thinking of an underlying image formation mechanism and a shroud body configuration. These points should be explicitly mentioned.\n\n","date":"April 12, 2014 at 5:11 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-98618","author":"anoxie","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"I congratulate Dr. Dan Porter for exposing his doubts on Bernardo Galmarini’s work , his approach was made in a truly scientific way as an expert in this field he is.\nNeverheless as he pointed out, there is 3D information embedded in Shroud image that enabled Dr. Petrus Soons to achieve such a remarquable result I mean the Hologram of the Man of the Shroud,\nCuriously,the «two halves of the body» are like bas reliefs with same apparent imperfections in anatomical proportions I mean the head seems to be too small relative to trunk dimension, the right forearm is «too long» etc, there is a missing middle slice of the body about 18 cm? in correspondence to the distance between the front an dorsal head images on the Shroud.\nIf the Hologram was an «artistic» artwork shouldn’t those imperfections be suppressed?\nCould the same result be obtained from any other image even with some artistic additions I mean from regular phptographs, paintings , phptographs from statues bas reliefs etc.?\nI guess the answer is straightforward NO! \nI had the privilege to wach the Hologram of the Man of the Shroud in Museo Della Sindone in Turin and it had been a very touching experience, no matter if a little artistic skill was blended with science.\nDr. Petrus Soons has given the Shroud World an amazing gift and we should recognize this and give value to his work and commitment to Shroud studies..\n                                                                         regards\n                                                           Antero de Frias Moreira\n                                                    (Centro Português de Sindonologia)\n\n","date":"April 12, 2014 at 7:47 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-98657","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"Dr Soons’ images, like those of Ray Downing, are intriguing and encourage speculation about the man depicted on the Shroud, whether or not it is derived from Jesus himself or an artistic imagination. However, the Shroud is not a hologram, in any of the various senses of the word.\nIt is true that a partial three dimensional form (either material, such as Jackson’s cardboard layers, or virtual, as a digital database in a computer) can be constructed from the image on the shroud, and that holograms can be made from three dimensional forms, but that does not mean that the two dimensional image is a hologram, and more than any other two dimensional image is a hologram.\nSoons’ holograms are not derived from the image on the Shroud, but from Bernardo Galmarini’s digital three dimensional form of that image. And that requires a great deal more explanation than is given on Soons’ website. It seems to be a truism that the intensity of the image at any one place appears to be inversely related to a distance between a body and a shroud. However the nature of this inverse relationship is far from obvious, and depends on the position of the body, the position of the shroud, and precisely what is meant by the ‘distance between the two’ (vertical, perpendicular to the cloth, perpendicular to the body, the shortest distance between a point on the body and a point on the cloth, or vice versa). Having established that, one must then determine whether the intensity/distance relationship is linear, exponential, quadratic or something else. These factors are not part of the shroud and must be inferred by the ‘sculptor’ based, I’m afraid, on what he thinks the final form should look like, not on any objective data on the image itself.\nIt would be interesting to give a sculptor an ordinary full face photograph of someone, and ask them to produce a three dimensional face from it. How wildly inaccurate would it be? And then make a hologram of it. Would it be recognisable?\n\n","date":"April 12, 2014 at 10:03 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-98685","author":"Hugh Farey","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"However, the Shroud is not a hologram, in any of the various senses of the word.\nHugh, I know that those are artificial holograms based on Enrie, but Petrus Soons deeply disagree with you:\nhttp://shroud3d.com/home-page/introduction-holographic-observations-in-the-shroud-image-holographic-theory\nAll these observations pointed to the fact that there is a great probability, that apart from the 3D-distance information in the gray-scale of the image there could also be holographic information hidden in the Shroud.\nIf it confirms (Shroud photographs from multiple angles desirable), then… good bye sceptics!\n\n","date":"April 12, 2014 at 12:42 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-98725","author":"O.K.","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"He does disagree, doesn’t he? And he’s wrong, until he demonstrates otherwise. A hologram is not a subjective feeling about something.\n\n","date":"April 12, 2014 at 1:05 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-98735","author":"Hugh Farey","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"Let us not forget a dummy.\n\n","date":"April 12, 2014 at 10:47 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-98699","author":"Louis","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"A peer-reviewed paper would have helped.\n\n","date":"April 12, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-98736","author":"Louis","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"Why so categorically state that Dr. Petrus Soons is wrong?\nWho’s the expert in holography?\nIt can be read in Dr. Petrus Soons website that theoretical physicist Dr. Sue Benson also considered the possibility that the Shroud image could be an hologram and no matter what skeptics claim on this blog  it’s a FACT (not a guess or a wish…) that the only image that could be processed from photographs to obtain an HOLOGRAM was the Shroud Image.\nDespite there is still no peer reviewed paper on this issue as Louis suggested ,no Holograms can be obtained from regular photographs. and that is a fact.\n                                                                                              regards\n                                                                                  Antero de Frias Moreira\n                                                                          (Centro Português de Sindonologia)\n\n","date":"April 14, 2014 at 7:42 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99165","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"There are many types of holograms, and there are varying ways of classifying them. We can divide them into two types: reflection holograms and transmission holograms.\nA. The reflection hologram\nThe reflection hologram, in which a truly three-dimensional image is seen near its surface, is the most common type shown in galleries. The hologram is illuminated by a “spot” of white\nincandescent light, held at a specific angle and distance and located on the viewer’s side of the hologram. Thus, the image consists of light reflected by the hologram. Recently, these\nholograms have been made and displayed in color—their images optically indistinguishable\nfrom the original objects. If a mirror is the object, the holographic image of the mirror reflects\nwhite light; if a diamond is the object, the holographic image of the diamond is seen to\n“sparkle.”\nAlthough mass-produced holograms such as the eagle on the VISA card are viewed with\nreflected light, they are actually transmission holograms “mirrorized” with a layer of aluminum\non the back.\nB. Transmission holograms\nThe typical transmission hologram is viewed with laser light, usually of the same type used to\nmake the recording. This light is directed from behind the hologram and the image is transmitted to the observer’s side. The virtual image can be very sharp and deep. For example, through a small hologram, a full-size room with people in it can be seen as if the hologram were a window. If this hologram is broken into small pieces (to be less wasteful, the hologram can be covered by a piece of paper with a hole in it), one can still see the entire scene through each piece. Depending on the location of the piece (hole), a different perspective is observed. Furthermore, if an undiverged laser beam is directed backward (relative to the direction of the reference beam) through the hologram, a real image can be projected onto a screen located at the original position of the object.\nsmall semi-transparent object is illuminated by a light source. The object scatters the light\nand creates a second wave which superposes on the recording medium with the reference wave originating from the source. \nOf course, the idea of a holography is to encode the phase information into intensity variation. In an amplitude hologram, the phase information is recorded as transmission variation (optical density variation). When the Silver-Halide \flm is exposed to light and developed, the grains of silver halides are changed into metallic silver and the transmittance of the \flm is altered. The amplitude transmittance ~t(x; y) = t0 􀀀 \fI(x; y)T varies spatially the same way as the exposure intensity.  But, in a phase hologram, the phase information is recorded as index variation. Thus the amplitude transmittance has magnitude equals to 1 and a varying phase ~t(x; y) = e􀀀i\b(x;y).\n\n","date":"April 14, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99297","author":"David Bowman","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"Irrespective, we could not presume a scorch to not have similar qualities.\n\n","date":"April 14, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99301","author":"David Bowman","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"Thank you, David. The Shroud is not a hologram. Nor is it a fact (or FACT) that it is the only image from which a hologram can be derived. Other images have not been tried and found wanting – they have never been tried at all. Any X-ray will produce an equally good or better 3D image, from which an equally good or better hologram could be derived. So could Garlaschelli’s image of the shroud, or one of those produced by the photographic techniques.\n\n","date":"April 14, 2014 at 5:18 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99306","author":"Hugh Farey","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"If your curiosity was piqued, here are the subdivisions of holographic photography:\n“120° Integral Stereogram (Multiplex)\nA type of white light transmission hologram which is formed by recording multiple\nphotographs onto a single hologram. The resulting image usually only provides horizontal\nparallax, and often provides the effect of an animated three dimensional image. 120°\nintegral stereograms are not complete cylinders\n360° Integral Stereogram (Multiplex)\nA type of white light transmission hologram which is formed by recording multiple\nphotographs onto a single hologram. the resulting image usually only provides horizontal\nparallax, and often provides the effect of an animated three dimensional image. 360°\nintegral stereograms are complete cylinders, and are often mounted on a motor-driven base\nwhich allows them to rotate at a constant speed.\nComputer Generated Stereogram\nHologram produced from multiple 2-d perspective recordings of computer-generated\nimages. Images can be analog, animated, reduced or enlarged. This is an alternative to the\nanalog hologram process, in which the subject is imaged directly onto the film with a laser\nexposure.\nDichromated Gelatin (reflection)\nDichromated Gelatin (DCG) is a chemical-gelatin mix that produces very bright images in a\ngolden-yellow color. The images have the least range of depth, but they are viewable in\nnormal room light without special spotlights.\nEmbossed Mylar Foil (white light transmission)\nHolograms stamped on foil in large numbers, from a transmission hologram master, and\noften used in applications where high security is desired. Embossed holograms are\ntransmission holograms with a mirror. The holographic information is transferred from light\nsensitive glass plates to nickel embossing shims. The holographic images are “printed” by\nstamping the interference pattern onto plastic and then backing the images with a light\nreflecting foil. The resulting hologram can be duplicated millions of times for a few cents\napiece.\nHolographic Stereogram\nHologram produced from movie footage of a rotating subject. Images can be computer\ngenerated, animated, reduced or enlarged, or photographed on site. This is an alternative to\nthe original hologram process, in which the subject is imaged directly onto the film with a\nlaser exposure.\nEmbossed holograms\nEmbossed holograms are used in the security industry because they are difficult to\ncounterfeit.\nLaser Transmission\nA type of hologram which is constructed by causing the object beam and reference beam to\ninterfere from the same side of the holographic film or plate. In order to view the\nreconstructed image, semi-coherent filtered light or very coherent laser light is transmitted to\nthe viewer through the hologram. Other types of holograms use a laser transmission\nhologram as the master, from which copies are made. This is the earliest type of hologram\ndeveloped by Leith and Upatniks in 1962. Transmission holograms are lit from the rear (like\na photographic transparency) and bend light as it passes through the hologram to your eyes\nto form the image.Rainbow Holograms\nSee “White Light Transmission Holograms.”\nReflection Holograms\nReflection Holograms are lit from the front, reflecting the light to you as you view it, like a\npainting or photograph hung on a wall. Different film emulsions produce images with\ndifferent characteristics. (Silver Halide, Dichromated Gelatin, Photo Polymer)\nWhite Light Transmission Holograms\nWhite light transmission holograms are illuminated with incandescent light (white light) and\nproduce images that contain the rainbow spectrum of colors. The colors change as the\nviewer moves up and down and are often called “rainbow” holograms. Holographers have\ndeveloped considerable control over the colors displayed in this type hologram to produce\nimages in a specific color or in near full, natural color. Transmission holograms are lit from\nthe rear (like a photographic transparency) and bend light as it passes through the hologram to your eyes to form the image.”\n\n","date":"April 14, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99308","author":"David Bowman","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"To Dr. David Bowman\nI praise your comments on holograms and I’ll read them carefully.\nI guess you’re an expert on holography so I’d like to put some questions.\nIf you had to give an advice on Dr. Petrus Soons hologram of the Man of the Shroud and alleged holographic properties of the Shroud image what would be your straightforward answer?\nAccordingly to the criteria you mentioned on making holograms would it be possible to obtain an Hologram from a image impressed on a linen sheet like the image of the Man of the Shroud and would the same result be achieved with the Garlaschelli’s Shroud?\nI apologize for adressing you this way but I guess your opinion will be welcome to most people who comment on this wonderful blog \n                                                                          regards\n                                                            Antero de Frias Moreira\n                                                          (Centro Português de Sindonologia)\n\n","date":"April 15, 2014 at 9:33 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99562","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"1) Well, Soons image seems to be on-axis, and, the biggest challenge of the on-axis holography are the twin-images: a conjugate image locating right in front of the true image. Instead of sending the reference beam and object beam in line, it has been proposed that separating and sending them at diff\u000berent angles. However, to separate the beam was di\u000efficult in practice at that time, when the best coherent source was the high pressure mercury lamp, with coherent length of only about 0.1mm. The \ffirst o\u000bff-axis hologram worked until two men, Leith and Upatnieks, came up an optical trick: to choose one line of the mercury lamp and send it to a grating. Two di\u000bfferent orders of the light after the grating are used as the reference and object beam, which are automatically propagating at di\u000bfferent angles. \nWith this off\u000b-axis hologram it is possible to detect the object wave without being\ndisturbed by the reference beam which propagates along another direction. Off\u000b-axis holography requires the use of a laser for coherence requirement.\nSoons should give us the off-axis conjugate image.\n2) The fundamental di\u000bfference between a transmission hologram and a refection hologram lies in the direction of the interference fringes that are recored inside the photosensitive emulsion. In a transmission hologram, the reference wave and object wave entering\nthe emulsion from the same side produce interference fringes in planes that are perpendicular to the plane of the emulsion; while in a reflection hologram, the reference wave and object wave entering the emulsion from di\u000bfferent sides produce interference fringes in planes that are parallel to the plane of the emulsion. Observation of the image in a transmission hologram requires the same reference beam that exposed it, and viewing through the plate; while in a reflection hologram, a spot light or sunlight is good enough and the image is observed by viewing the reflection from the plate. \nWe should anticipate Garlaschelli’s Shroud to then, obligingly, to give quality results in the  diffracted interference fringes in planes that are perpendicular to the emulsion plane. This phenomenon may happen in X-rays, photographic techniques as well.\nP.S. The hyperboloidal surfaces inside the thin emulsion layer of holographic film, approach flat planes and are perpendicular to the film surface, like venetian blinds in the “open” position. However, because of the inherent characteristics of this family of hyperboloid “mirrors”, each successive reflection will have a precise phase shift of 2p because the optical path is increased by precisely the distance of one wavelength. All the reflected waves are precisely in phase and, therefore, add in amplitude, resulting in a strongest possible wave front representing the object beam. Thus, we may anticipate the phenomenon in other Shroud images like Garlaschelli’s.\n\n","date":"April 15, 2014 at 1:38 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99616","author":"David Bowman","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"The problem is not how you treat the 3D data (into a hologram, a bronze or a 3D printer), but how you generate these data.\nIt seems “the 3D information was extracted by means of gray scale mapping (also called displacement mapping) by Galmarini in Argentina”, VP8 style, no more.\n\n","date":"April 15, 2014 at 2:48 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99636","author":"anoxie","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"If you want to ascertain potential “holographic” qualities within X-rays or photographs for instance, I’ll give you a short “lesson”. The low cost of equipment makes it possible for many of the following exercises to be performed as “homework.”\nAll the experiments require the use of a laser and chemicals for processing the holograms.\nand duly observe all safety rules concerning lasers and chemicals.\nGenerally, the developer and bleach solutions are mixed by the instructor. Since the photochemistry of holography is an ongoing research, it will change as improvements are found. Thus, no particular regime is discussed here. Use according to the detailed instructions that accompany each processing kit provided by the manufacturer.\nSimilarly, the holographic plate or film used will change with time. Use them in accordance with the instructions of the supplier. The exposure time and the appropriate processing scheme are also provided.\nEquipment and facilities\nHolograms are made in darkened areas free from drafts, vibration, and noise. Because of the relatively low sensitivity of the recording material, sufficient light is allowed so that one can see comfortably after dark adaptation. To achieve this, use a 25-watt green light bulb in a lamp. Place the lamp under the table, cover it with aluminum foil to adjust the light, and direct it toward the floor. Do not allow direct light to shine on the holography system or on the developing station.\nIf the room has windows, cover them with black plastic sheets. Enough light can leak through to allow minimum vision after dark adaptation. In case of doubt, leave a holographic plate on a table and expose it to the ambient light for ten minutes. Develop it. If it turns dark, there is too much light.\nFlowing tap water is desirable but not necessary. A large tray of clean water can be used to rinse the developed hologram. White trays are desirable because they allow continual inspection. An alternative is to use glass trays resting on white paper.\nMake sure all fire codes are observed.\nA. Reflection hologram\nEquipment requirement: Darkened room with green safe-light, sturdy table or counter, optical table supported by “lazy balls,” mounted diode laser system, object on platform with three-point support, shutter, processing trays with chemicals, and holographic plates.\nFigure 10-15—shown earlier—indicates the setup for making a “one-beam reflection hologram,” sometimes called a Lippmann (Nobel Prize in physics, 1908) or Denisyuk hologram.\nProcedure\nA. Choose a solid object that looks bright when illuminated with laser light and whose size is not bigger than the hologram to be made. Mount (hot glue) it on a small platform made of wood or sheet metal (15 cm × 15 cm) with three round-head short screws underneath (to prevent rocking). Mount the laser on a stand about 25 cm high and direct the light down at 45° at the object, with the light spreading horizontally. The distance between the laser and the object is about 40 cm. Now turn on the safe light and turn off the room light.\nB. After the laser has been warmed up for at least five minutes, block the light from reaching the object using a self-standing black cardboard. (We will call this the shutter.)\nC. Lean a holoplate directly on the object, with the sticky side touching it. Wait at least 10 seconds.\nD. Lift the shutter, but still blocking the light, for 2 seconds, to allow any vibration to subside. Then lift the shutter away completely to allow the light to pass through the holoplate. The exposure is usually about 5 seconds. (Consult the instructions that accompany the plates.) Then block the light again.\nE. Develop the hologram according to instructions from the manufacturer.\nAfter the hologram is dried, view it with a spot light such as a pen light, projector, or direct sunlight. Optional: Spray paint the sticky side (emulsion side) with a flat (or “antique”) black paint to provide a darker background and greatly improve the visibility of the image.\nB. Transmission holograms\n1. Without a mirror\nEquipment requirement: Same as for the “reflection hologram” in section A. above. In addition, a stand-alone plate holder is needed. Make one exactly the same way as the object platform described above. Instead of the object, install two long (12 cm) screws on top with a separation less than the width of the holoplate to be used. Paint the screws a diffused black color.\nProcedure\nA. Set up the system as shown in Figure 10-19. The diode laser is mounted 5 cm above the optical table with the beam spreading horizontally. One side of the beam illuminates the object or objects, and the other side serves as reference beam.\nFigure 10-19 The simplest configuration for making a transmission hologram\nB. Block the beam with the shutter, turn off the room light, and, on the stand-alone plate holder, lean a holoplate vertically against the black screws with the sticky side facing the object(s). Wait 10 seconds.\nC. Lift the shutter and expose for about 30 seconds. Note: If there is a draft across your system, the long exposure time of 30 seconds requires you to put a large box over the entire system during the exposure.\nD. Develop and dry as before.\nE. This hologram must be viewed with laser light. To do so, lean the finished hologram back on the black screws the same way as during exposure. Cover or remove the objects and look through the hologram toward the location of the objects. A virtual image can be seen as if the object is still there.\nF. To observe the real image:\n− Relocate the finished hologram in the position where it was exposed.\n− Remove the object and, in its place, position a vertical white screen (cardboard) facing the hologram.\n− Darken the room and direct a collimated laser beam through the center of the hologram in a direction that is 180° from the original reference beam, i.e., back toward the location of the diode laser used for making the hologram.\nAll light paths are now reversed and a two-dimensional image is projected onto the screen. Move the laser beam to different locations of the hologram and observe the changing perspectives of the image.\nAs must be said, this is a mere synopsis. I have not presented every facet. \nRegards,\nDavid Bowman\n\n","date":"April 15, 2014 at 9:19 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99709","author":"David Bowman","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"Hmm… in the posting there were a few images therein. They must not have registered, sorry.\n\n","date":"April 15, 2014 at 9:39 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99720","author":"David Bowman","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"To Anoxie\nAre you meaning that a «gray scale mapping» was produced from the Shroud image by Bernardo Galmarini and  from it a 3D image of the Man of the Shroud was achieved , and the Hologram was  produced from treating those 3D data?\nMy interpretation of Dr. Petrus Soons explanation fits that.\nIf this is true then the crux is can we get accurate gray scale mapping from images other than Shroud image to «build anatomically near perfect 3D images» ?\n                                                                                                regards\n                                                                               Antero de Frias Moreira\n                                                              ( Centro Português de Sindonologia)\nP.S. I thank Dr.David Bowman for his  technical explanation on Holograms\n\n","date":"April 16, 2014 at 5:37 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99859","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"Yes, at least the basic step seems to be “gray scale mapping” if one reads shroud3d.com. Then there must have been several “procedures” to get “anatomically near perfect 3D images”, which are great, but not scientific.\nLet’s think of the fuzzy borders and local resolution variations, they’ve disappeared in the final image.\nTheoretically, if you consider a high map, you assume one point on the shroud corresponds to one point on the body. This is right for contact points but not for distant points, which explains why this approach is basically flawed.\n\n","date":"April 16, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-99997","author":"anoxie","site":"shroudstory"},{"title":"Petrus Soons to Present His Scientific Research at the University of Miami","post":"Dr. Soons’ work hs such promise and is very interesting.\n\n","date":"April 18, 2014 at 7:51 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","id":"comment-100970","author":"Andy","site":"shroudstory"}]
