[{"title":"Picture of Veneration in a Ukrainian Parish","post":"It seems you are trying to poke and prod Catholics with this post.  That’s not very charitable.  Any knowledgeable Catholic understands that there are churches in union with Rome that permit married priests.  Did you know that many married ordained ministers from other churches upon becoming Roman Catholic petitioned and were permitted to be ordained priests in the Roman Catholic Church?  In light of this, your revealing that there are Anglican use priests who are married is really just part and parcel of our ordinary life.\n\n","date":"March 10, 2013 at 10:33 am","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","id":"comment-26988","author":"Andy Weiss","site":"shroudstory"},{"title":"Picture of Veneration in a Ukrainian Parish","post":"Wait a minute, Andy. I’m not just writing for knowledgable Catholics. And I’m not trying to be uncharitable. But prod, yes indeed. I’d like to see full communion, indeed union. That requires married priests and women priests and I see no reason why not.  Will it happen on my lifetime? No. But I think it will someday.\n\n","date":"March 10, 2013 at 12:26 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","id":"comment-26999","author":"Dan","site":"shroudstory"},{"title":"Picture of Veneration in a Ukrainian Parish","post":"You really didn’t address what I pointed out: that you seem to be poking and prodding Catholics with this post.\nFull communion requires the dropping of the women priests.  Will it happen?  If so, it will be in God’s time, not ours.  There will be no full communion without that elimination.  Mark my words.\n\n","date":"March 10, 2013 at 2:37 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","id":"comment-27006","author":"Andy Weiss","site":"shroudstory"},{"title":"Picture of Veneration in a Ukrainian Parish","post":"I suspect that there may be an error in the following assertion: “One big difference is that Byzantine Rite priests are allowed to marry and have children.”  My understanding is that in the Greek Orthodox churches for example, it is more usual for seminarians in their last year before ordination to the priesthood, to be encouraged to marry at that time.  It is unusual, if not strictly forbidden, for an ordained priest to then marry. Orthodox bishops are selected from unmarried priests, usually those who have followed a monastic vocation, rather than a pastoral vocation. [Notwithstanding St Paul’s injunction that a bishop should only be married to one wife] I would be surprised to learn that this Orthodox discipline is any different among Uniate Ukranians.\n\n","date":"March 10, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","id":"comment-27014","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Picture of Veneration in a Ukrainian Parish","post":"Extract from Encyclopedia Britannica on Eastern Orthodoxy:\n“The lower orders of the clergy—i.e., priests and deacons—are generally married men. The present canonical legislation allows the ordination of married men to the diaconate and the priesthood, provided that they were married only once and that their wives are neither widows nor divorcees. These stipulations reflect the general principle of absolute monogamy, which the Eastern Church considered as a Christian norm to which candidates for the priesthood are to comply strictly. Deacons and priests cannot marry after their ordination.”\n“Bishops, however, are selected from among the unmarried clergy or widowed priests. The rule defining the requirement for an unmarried episcopate was issued at a time (6th century) when monks represented the elite of the clergy. The contemporary decrease in the number of monks in the Orthodox Church has created a serious problem in some territorial churches, in that new candidates for the episcopacy are difficult to find.”\nA similar discipline would apply in all Byzantine or other Eastern rite churches in communion with Rome.\n\n","date":"March 10, 2013 at 5:56 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","id":"comment-27016","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Picture of Veneration in a Ukrainian Parish","post":"I need to write here a copy of a previous comment I adressed to Andy in another topic because it’s truly relevant for the subject matter of this particular topic:\nAndy, don’t you forget that Mary Magdalen was the very first person to have received a missionary task from the Resurrected Christ when he said to her : “Go and tell my brothers that I am resurrected!!!”.\nSo, if Jesus himself wanted that some women became missionaries, who are we to close the door to some Catholic women who says that they have clearly received a call for priesthood from the Holy Spirit???\nIf Jesus judged that women were good enough to become missionaries, why not priests???\n\n","date":"March 10, 2013 at 7:45 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","id":"comment-27027","author":"Yannick Clément","site":"shroudstory"},{"title":"Picture of Veneration in a Ukrainian Parish","post":"Yannick I think you are reading a little too much into that particular NT statement. Jesus did not send Mary Magdalen out to preach the word, but in particular, to tell the deciples what had transpired. If you don’t believe me, please read on a little ifurther n John 20, to John 20:21. This is where Jesus ordains the “12” with the spirit and to go forth and preach. Now one can ask was Mary among those in the room that evening? I don’t think so, as one would think if she was and if there were any others outside of the ’12’ there, it would have been mentioned…The mention of the ’12’ is simply a ‘title’, as we all know very well that Thomas and Judas were not there.\nPersonally, I cannot find any reason why woman cannot be ordained, or why priests can’t marry. Several of the apostles were married I believe, so what’s the problem. Furthermore we have very little knowledge on what happened to Mary Magdalen and the several other woman that followed Jesus. Did they preach or just accompany the other apostles? It’s hard to say. But I think it unlikely they preached considering the ‘outlook’ towards women in that period.\nR\n\n","date":"March 10, 2013 at 8:35 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","id":"comment-27031","author":"Ron","site":"shroudstory"},{"title":"Picture of Veneration in a Ukrainian Parish","post":"Ron, there are many ways to understand a certain part of the Gospel.  Jesus DID sent Mary to tell the Good News to the apostles and to me, that’s a missionary task AND THAT’S SAYS A LOT ABOUT JESUS POINT OF VIEW REGARDING WOMEN.  The actual Catholic Church is far behind that view of Christ in my mind.\n\n","date":"March 11, 2013 at 8:28 am","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","id":"comment-27068","author":"Yannick Clément","site":"shroudstory"},{"title":"Picture of Veneration in a Ukrainian Parish","post":"\nYannick Clément :Ron, there are many ways to understand a certain part of the Gospel. Jesus DID sent Mary to tell the Good News to the apostles and to me, that’s a missionary task AND THAT’S SAYS A LOT ABOUT JESUS POINT OF VIEW REGARDING WOMEN. The actual Catholic Church is far behind that view of Christ in my mind.\nSorry but there is not “many ways” to interpret that specific comment! It is clear Jesus simply asked Mary to tell the apostles that she had seen him and he was alive,…nothing more. If you want to go adding to that, that is your prerogative, but it is wrong. There is no evidence that Jesus ordained any of the women or that he inpired them to go out and preach whatsoever. But who is to know for sure what transpired back then, in circumstances as these. No gospel of Mary Magdalene or anyone else exists of Jesus’s women followers, unless you want to accept the gnostic gospels as authentic or worse that you want to believe the early church destroyed them. As I stated before, I have no issue personally about women being ordained, but I do not make the rules and I certainly do not have the confidence to rule against what the church fathers have decided.\nI also don’t believe we have the right to say the church is behind the times….It could be said the other way in the sense that people are turning thier backs on church doctrine to suit their new “politically correct” view of the world.\nR\n\n","date":"March 11, 2013 at 3:30 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","id":"comment-27088","author":"Ron","site":"shroudstory"},{"title":"Picture of Veneration in a Ukrainian Parish","post":"As I said, that’s your opinion, but I disagree with it.  I think the Church should always tend to show the unconditional loving face of God to the world and right now, that’s not always what I see.  I often see “pharisaism” (you can also call this “intolerance” based on some very ancient Judeo-Christian traditions) inside the Church and that piss me off a lot because that’s exactly what Jesus fought against during all his entire ministry and that’s also the main reason why he was killed.  \nBut in a sense, the fact that the Church isn’t perfectly showing this unconditional loving face of God to the world is normal since it is made of poor human beings like you and me (and God wanted that way).  But that’s not a reason to constantly praying that she change for the best (as we pray for each other in that same way).  The Church is not perfect like all the humans are not perfect and there will always be some places for good changes that will make her look more and more like God who is Love.\nAnd if you think the Church is not far behind the EVOLUTION of society in many aspects of its doctrine, then I think you should change your glasses…  And please, don’t pretend that equality of sex, anti-homophobia, anti-racism, etc. are not a great evolution in human history, which, by the way, was not at all initiated by the Church but mainly by the secular world!!!  Don’t you believe like me that the Holy Spirit is still at work in our world and that he’s the driving force behind all these positive changes?  And don’t you believe like me that the Holy Spirit can inspire men that are not Christian at all? This action of the Holy Spirit outside the official Church is even acknowledge by the Catechism of the Catholic Church!\n\n","date":"March 11, 2013 at 3:49 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","id":"comment-27089","author":"Yannick Clément","site":"shroudstory"}]
