[{"title":"Pope Francis’ June 21 & 22 Schedule Details","post":"The proposed visit of Pope Francis to the Waldensian Temple is interesting, and only time will tell if it yields a fruitful outcome.  Judging from some of the sad comments on the linked web-site, a strong bitter anti-papal feeling and resentment is still evident among the Waldensian community, while yet another comment is curious that the Pope is visiting heretics.  Evidently a spirit of ecumenism has yet to spread its roots in that corner of the world. \nThe original Waldensian movement is one of the earliest reform groups, and dates from the preaching of Valdes in Lyon 1170-76.  At the Lateran Council of 1179, Valdes made a profession of orthodoxy and was confirmed in his vow of poverty by Pope Alexander III.  However Valdes did not receive the recognition he sought, was condemned by the archbishop of Lyon, and in 1184 Pope Lucius III placed the Waldensians under a ban.  Thereafter the Waldensians departed from orthodoxy, and the movement spread rapidly throughout Europe.  Rome responded vigorously turning from excommunication to active persecution and execution.  \nA number returned to orthodoxy, and by the end of the 15th century the movement was confined to the French and Italian valleys of the Cottian Alps.  A second period in their history began in 1526 when they were introduced to Reformation theology, and thereafter eventually becoming in effect a Swiss Protestant Church, with some emphasis on predestination and millenialism.  Years of persecution continued until they were granted full civil rights in 1848.  In the 19th century, a number of Waldensian emigrants migrated to Uruguay, and thence established a number of small communities in the United States. \nThe interest of Pope Francis in the Italian Waldensians seems to be connected to his own parents’ origins in the Po Valley, where he still has family, and which seems to remain a stronghold of the movement.  It seems typical of Francis that he reaches out to those most disconnected from the main stream, and always in a spirit of reconciliation.  He will be reinforced in the knowledge that the prayers of many will accompany him, in the hope of a fruitful and conciliatory outcome.\n\n","date":"June 2, 2015 at 5:39 am","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","id":"comment-200868","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Pope Francis’ June 21 & 22 Schedule Details","post":"Pope Francis is an excellent pastor, an example many should follow. He impressed Justin Welby, Archbishop of Canterbury and Primate of England, who is doing his part of the job in that country, where Catholics and Anglicans havê begin to share churches. My bet is that Francis will bring many Catholics and Evangelicals together when he goes to the US.\n\n","date":"June 2, 2015 at 6:39 am","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","id":"comment-200875","author":"Louis","site":"shroudstory"},{"title":"Pope Francis’ June 21 & 22 Schedule Details","post":"Thank you Daveb for the information and thank you Louis for your expectation of Pope Francis. \nI like Pope Francis very much. Even Francis did simmilar things before he became the Pope. Hope one day he authorise to do more research on the Shroud of Turin and I have no doubt that the outcome of this will help to bring more Catholics and Evangicals together.\n\n","date":"June 2, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","id":"comment-200920","author":"Sampath Fernando","site":"shroudstory"},{"title":"Pope Francis’ June 21 & 22 Schedule Details","post":"Hi Sampath\nPerhaps you could check this information in January 2016:\n“The Syrian Malabar Nasrani of southwestern India may have connections with the Essenes, according to the Manimekalai, one of the great Tamil epic poems, which refers to a people called “Issani.” The high presence of Cohen DNA amongst today’s Nazareans make further support to the full or part Essene origin of the Malabar Nazareans. The Essenes were often of Levite or Cohen heritage and this may further explain the frequent ‘priestly heritage’ claims of several Nazerean families of India.”\nBest.\n\n","date":"June 2, 2015 at 5:21 pm","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","id":"comment-200923","author":"Louis","site":"shroudstory"},{"title":"Pope Francis’ June 21 & 22 Schedule Details","post":"Yes I will remember this and try to get more information from Kerala as well as from my Tamil friends.\n\n","date":"June 2, 2015 at 5:31 pm","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","id":"comment-200925","author":"Sampath Fernando","site":"shroudstory"},{"title":"Pope Francis’ June 21 & 22 Schedule Details","post":"There is Jewish influence in the Nasrani church liturgy and some customs:\nhttp://en.wikipedia.org/wiki/Saint_Thomas_Christians\n\n","date":"June 2, 2015 at 5:33 pm","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","id":"comment-200926","author":"Louis","site":"shroudstory"},{"title":"Pope Francis’ June 21 & 22 Schedule Details","post":"The Holy Father before arriving in Turin should go and visit the city of Sarajevo …\n— —\nB.T.W.:\nDo you believe in the biorhythm ?\n>A biorhythm (from Greek βίος – bios, “life” and ῥυθμός – rhuthmos, “any regular recurring motion, rhythm”[2]) is an attempt to predict various aspects of a person’s life through simple mathematical cycles. Most scientists believe that the idea has no more predictive power than chance and consider the concept an example of pseudoscience. …\n>According to the theory of biorhythms, a person’s life is influenced by rhythmic biological cycles that affect his or her ability in various domains, such as mental, physical and emotional activity. These cycles begin at birth and oscillate in a steady (sine wave) fashion throughout life, and by modeling them mathematically, it is suggested that a person’s level of ability in each of these domains can be predicted from day to day. …\nLink:\nhttp://en.wikipedia.org/wiki/Biorhythm\n\n","date":"June 4, 2015 at 7:57 am","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","id":"comment-201068","author":"piero","site":"shroudstory"},{"title":"Pope Francis’ June 21 & 22 Schedule Details","post":"Yesterday I wanted to add something about the question of the Holy Father and the Eucharistic miracles (in Turin and Argentina).\nSee also: the eucharistic miracle of Turin in 1453 and that of August 18, 1996 while Pope Bergoglio was at that time bishop of Buenos Aires …\nHere the text:\n>At seven o’clock in the evening on August 18, 1996, Fr. Alejandro Pezet was saying Holy Mass at a Catholic church in the commercial center of Buenos Aires. As he was finishing distributing Holy Communion, a woman came up to tell him that she had found a discarded host on a candleholder at the back of the church. On going to the spot indicated, Fr. Alejandro saw the defiled Host. Since he was unable to consume it, he placed it in a container of water and put it away in the tabernacle of the chapel of the Blessed Sacrament.\nOn Monday, August 26, upon opening the tabernacle, he saw to his amazement that the Host had turned into a bloody substance. He informed Cardinal Jorge Bergoglio, who gave instructions that the Host be professionally photographed. The photos were taken on September 6. They clearly show that the Host, which had become a fragment of bloodied flesh, had grown significantly in size. For several years the Host remained in the tabernacle, the whole affair being kept a strict secret. Since the Host suffered no visible decomposition, Cardinal Bergoglio decided to have it scientifically analyzed.\n>On October 5, 1999, in the presence of the Cardinal’s representatives, Dr. Castanon took a sample of the bloody fragment and sent it to New York for analysis. Since he did not wish to prejudice the study, he purposely did not inform the team of scientists of its provenance. One of these scientists was Dr. Frederic Zugiba [instead of Dr. F. Zugibe!], the well-known cardiologist and forensic pathologist. He determined that the analyzed substance was real flesh and blood containing human DNA. … …\n>… ..Two Australians, journalist Mike Willesee and lawyer Ron Tesoriero, witnessed these tests. Knowing where sample had come from, they were dumbfounded by Dr. Zugiba’s testimony. Mike Willesee asked the scientist how long the white blood cells would have remained alive if they had come from a piece of human tissue, which had been kept in water. They would have ceased to exist in a matter of minutes, Dr. Zugiba [instead of Dr. F. Zugibe!], replied. The journalist then told the doctor that the source of the sample had first been kept in ordinary water for a month and then for another three years in a container of distilled water; only then had the sample been taken for analysis. Dr. Zugiba’s was at a loss to account for this fact. There was no way of explaining it scientifically, he stated. Only then did Mike Willesee inform Dr. Zugiba [instead of Dr. F. Zugibe!] that the analyzed sample came from a consecrated Host (white, unleavened bread) that had mysteriously turned into bloody human flesh. Amazed by this information, Dr. Zugiba [instead of Dr. F. Zugibe!], replied, “How and why a consecrated Host would change its character and become living human flesh and blood will remain an inexplicable mystery to science—a mystery totally beyond her competence.”\nDr. F. Zugibe was a well known sindonologist…\nLink:\nhttp://www.loamagazine.org/nr/the_main_topic/eucharistic_miracle_in_buenos.html\n>a journalist reported that miracles had been more than one. The first “signs” occurred “in May 1992, the same month and year that Bergoglio was appointed auxiliary bishop of Buenos Aires”, then “24 July 1994 while the minister of the Eucharist took the cup contained in the Tabernacle he noticed that a drop of blood was flowing on the inner wall of the same Tabernacle “and the last, that of 1996 described by Fr. M. Piotrowski, had not happened on August 18 (as erroneously reported) but on the 15th, the Feast of the Assumption Mary into heaven.\n>After the article by Antonio Socci, a journalist Maurizio Blondet, who had already reported in an article published on the website Effedieffe, he came up with the idea of ​​going personally to Buenos Aires to investigate the events in person and riportarali in a subsequent publication.\n>Exactly one year later, in March 2014, Blondet went actually in Argentina accompanied by two people, one of which, for the strange coincidences of the case, it is a friend, then a direct witness of what they learned during the ten day stay in Buenos Aires…\nSource (with rough translation):\nhttp://www.circolo-latorre.com/home.jsp?idrub=35746\n— — — —\nOther links:\nhttp://www.therealpresence.org/eucharst/mir/english_pdf/Turin1.pdf‎\nhttp://www.therealpresence.org/eucharst/mir/english_pdf/Turin2.pdf‎\nhttp://www.lamadredellachiesa.it/una-clamorosa-e-sconosciuta-serie-di-miracoli-eucaristici-a-buenos-aires-con-bergoglio-vescovo-di-antonio-socci/\n— — —\nNow Pope Francis does not go to Medjugorje …\nWhy?\nI don’t know.\nIn any case Karol Wojtyla was perhaps the most daring of the Popes exorcists.\nHe began releasing a girl without knowing the basics of exorcism, but they did not want to pull back. And he reimprovvisò exorcist in at least two other occasions.\nThe devil, as a result, sent word to Monsignor Andrea Gemma (known exorcist) who hated Pope Wojtyla (dubbed “the old man”), as well as Pius XII hated, but feared beyond measure Pope Ratzinger.\n— — —\nI have just read about a supposed prophecy about Papa Francesco:\nhe will be forced to leave the Papal See in Rome …\nSeptember 26, 2013, one of the sensitive, Angela, had a vision:\n “I saw Pope Francis, who was sitting at a desk, ahead had as a scroll, on the desk. At one point he brought his hands to his face and began to cry.”\nLinks:\nhttp://www.vitaoltrelavita.it/forum/viewtopic.php?t=1235&p=11689\nhttp://www.madonnadizaro.it/messaggi/messaggi-del-giorno-26/messaggi-del-2013/298-messaggio-del-26-settembre-2013\nSo it is assumed that something bad will happen in San Pietro (= ISIS ???)…\nBut Pope Francis will be saved!\n— —\nFor example, see what happened yesterday:\n>The Islamic State (Isis) has beheaded an alleged volunteer for the army loyal to the internationally recognised Libyan government of Tobruk in front of a group of children…\nLink:\nhttp://www.ibtimes.co.uk/libya-children-watch-isis-behead-soldier-outside-derna-mosque-1504374\n\n","date":"June 5, 2015 at 8:45 am","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","id":"comment-201130","author":"piero","site":"shroudstory"}]
