[{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"I am a bit puzzled about the exact amount of urea…\nbecause Ray Schneider wrote:\n“… the urea molecule has a large polar moment, when it diffuses\nfrom the body the end of the molecule with a complementary charge\npreferentially attaches to the molecular charge exposed on the\nouter surfaces of the dielectric cloth….”\nTitle = “Collimation: A Quasi-static Electric Field\nsub-title = An Electric Field and Polar Molecules \nSee for example what is the melting point temperature,\nfor urea = 133 to 135 °C\n(271 to 275 °F; 406 to 408 K)\nSo…\nat the cool temperature of the corpse let into the sepulchre\nthe evaporation of urea is very very low …or impossible.\nTherefore: it seems that a temperature gradient cannot explain\nthe loss of urea from the corpse toward the linen cloth.\nWhat is the exact mechanism of Entraining Polar Molecules ?\n— *** — *** —\nSee also the past ( https://shroudstory.com/2012/07/30/asking-thibault-for-more-details-concerning-rogers-hypothesis/ ) different kind of points of view :\n– “… a low flow of amines can diffuse through the cloth, a high flow of amines is blocked and flows along the cloth. This is consistent with a slow production of ammonia through hydrolysis of urea on the skin for hours …” \nthese words appeared in:\n“Asking Thibault for more details concerning Rogers hypothesis” (July 30, 2012)\n– “… a laminar flow of amines with a very low Reynolds number in small confined cells could be the only option because this would mean a quasi-vertical motion …”\n– “… In your article  (Here my note = she referred to Thibault…), you suggested ammonia through hydrolysis of urea. But is hydrolysis of urea significant at ambient temperature ? Have you thought about glutamine ? glutamine is available in plasma and sweat, and in large amounts in muscle cells …”\n— —\nI have found an old (= 1961) reference:\nSource:\n“Nitrogenous Composition of Human Epidermis”\nSam Frankel PhD, A J Reiches MA, MD\nand with the Technical Assistance of Virginia O’Toole\nThe Journal of Investigative Dermatology (1961) 36, 83–88 \n>…evidence is presented which is consistent with the concept that urea is synthesized in human epidermis …\n>… It seems reasonable to speculate that the ammonia level of post-mortem epidermis would be higher than post-surgical specimens unless it were removed. The levels in both types of specimens, however, were identical, and it is not inconceivable that the ammonia in epidermis is removed during the formation of urea. It must follow, then, that if urea is being formed, and there is no means for its elimination, the level in post-mortem epidermis would rise. …\nLink:\nhttp://www.nature.com/jid/journal/v36/n2/full/jid196117a.html\n— — —\nUrea is also mentioned (slide 10 of 75, *.pdf file: “An Enduring Mystery”)\nin the other document by Ray Schneider:\n“The First Scientific Image Theory\nVignon’s Vaporograph Theory”\n-Febrile sweat covering the unwashed body contains urea which changes to ammonia and releases an ammoniac vapor\n-A mixture of spices containing aloes\netc., etc.\nLink:\nhttp://www.shrouduniversity.com/Handouts/LLI-Shroud-Pt2-Science.pdf\n— —\nWikipedia:\n>The urea molecule is planar in the crystal structure, but the geometry around the nitrogens is pyramidal in the gas-phase minimum-energy structure.\nWell.\nBut we have to understand what was the exact attraction (to explain the travel from the corpse to the linen)\n\n","date":"March 27, 2015 at 6:24 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194590","author":"piero","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Interesting.  Thanks Dan, Russ and (mostly) Dr. Ray Schneider.  I’ll have to take a look and listen when I have some time.\n\n","date":"March 27, 2015 at 7:33 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194593","author":"Andy","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"All this talk about urea, nitrogens, polar molecules, glutamine, etc. – so what’s the point? To the lay person, what does it means?\n\n","date":"March 27, 2015 at 7:52 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194596","author":"leon ward","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Don’t stop Piero, he’s on a roll…..\n\n","date":"March 27, 2015 at 10:18 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194610","author":"Nabber","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"What was a bit unclear to me,\nwas the exact transport mechanism of urea in the areas not in direct contact\n(with the Corpse) and for that phenomenon it was indicated an electric field…\nand I confess that I still have to read carefully everything that wrote Ray Schneider and then compare with the hypothesis by Giulio Fanti = Corona Discharge hypothesis and the possible microscopic – or nanoscopic – effect of thermophoresis [= micro or nano-thermomigration, see also: micro or nano-thermodiffusion, cell walls, S1 and S2…].\nB.T.W. : Do you know Ludwig-Soret effect?\nSee also: the different responses to the force of a temperature gradient\n(and the inherent controls at micro- or nano-levels), the “hydration shell” of molecules\nand effets from irraditiations or from Corona Discharge or from VUV exposures, etc. \nI think that cadaverine and putrescine can evaporate at corpse’s cooling temperatures, instead urea cannot travel until the linen cloth until there is a “mysterious phenomenon” and linen threads are “sensitized with aloe and myrrh”.\n-*-*-*-*-\nHere some useful data.\nCadaverine:\nMelting point : 11.83 °C (53.29 °F; 284.98 K)\nBoiling point : 179.1 °C; 354.3 °F; 452.2 K\nSolubility in water : soluble \nPutrescine:\nMelting point : 27.5 °C (81.5 °F; 300.6 K)\nBoiling point : 158.6 °C; 317.4 °F; 431.7 K\nSolubility in water : Miscible \nWarning!\nWhen you want to use pure Cadaverine (in your own experiments),\ntake into account the Experimental Flash Point:\n14 °C TCI D0108\n62 °C Oxford University Chemical Safety Data (No longer updated)  \nExperimental Flash Point for putrescine :\n27 °C TCI D0239\n51 °C Oxford University Chemical Safety Data (No longer updated \nFOr example, remember the recent fact:\n“East Village explosion: Fire destroys two buildings in New York City, injuring 19”\n>An explosion in New York City has caused two 2nd Avenue buildings\nto collapse and two other buildings are on fire in\nthe city’s East Village neighbourhood… …\n>reports indicate the explosion\nwas caused by a gas leak while\nplumbing and gas work was going\non in the building at 121 2nd Avenue,\nwhich collapsed…. \nLinks:\nhttp://www.independent.co.uk/news/world/americas/new-york-city-explosion-fire-rages-after-a-building-collapses-in-the-east-village-10137253.html\nhttp://www.konfrontasi.com/content/english/new-york-east-village-explosion-buildings-collapse-2nd-avenue-manhattan\nhttp://www.dailymail.co.uk/news/article-3013437/East-Village-building-collapse-photos-fire-New-York-City-injuring-many.html\n— ***—***—***—\nRegarding the question of temperature, there is a phrase by Rogers into the paper:\n“The Shroud of Turin: An Amino-carbonyl Reaction (Maillard Reaction) may explain\nthe Image Formation”\nby\nRaymond N. Rogers and Anna Arnoldi\n>… Postmortem body temperatures can reach 41ºC (Irvine, 2001), and steep temperature gradients would exist across the cloth as a result of the low thermal diffusivity of linen and theangular dependence of radiant heat flow from a nonmetallic surface (Gubareff et al, 1960).\nThen they concluded that temperature gradients will have a large effect\non Maillard reaction rates and these combination of factors could produce\na distribution of reaction products with the appearance of the image.\nI have pointed out (but a bit in a bad way. Sorry…) the question of urea.\nIn short, I wanted to underline that the cadaveric amines\n(= putrescine and cadaverine, etc.) are the main candidates\n(if I am right in my readings) for the famous Maillard reaction\nindicated by Rogers and Arnoldi (and then we have to see what is\nthe possible role for urea).\nLink:\nin https://www.shroud.com/pdfs/rogers7.pdf.\n>Ever since the French chemist Louis-Camille Maillard studied the metabolism of urea and kidney illnesses and published his thesis on the actions of glycerin and sugar on amino acids in 1913, the Maillard reaction has been a hot research topic. A review on browning reactions in dehydrated foods, which appeared in the first volume of Journal of Agricultural and Food Chemistry, remains the most-cited paper in that journal’s history. \nLink:\nhttp://blog.khymos.org/2012/06/04/maximizing-food-flavor-by-speeding-up-the-maillard-reaction/\nHere what wrote Thibault Heimburger:\n>…Much has been made of ammonia being produced from sweat by hydrolysis of urea (H2NCONH2).\n>CO2 (and some carbamates) is the other final product. I have not been able to find any sweat analysesthat showed urea as a major component. In any case, the reaction would be over in a few hours.Ammonia would leave a fog of color on the cloth, because it diffuses quite rapidly.\n>The image was notprimarily formed by ammonia. The fog around the nose and mouth looks to me like some ammonia was involved (“I think I see”).\n— — —\nI believe you have to read the document:\nby Ray Schneider\nhttp://www.shrouduniversity.com/Handouts/LLI-Shroud-Pt4-Skeptics&Image.pdf\nHere what is explained in the document\n(at p 59 of 65) by Ray Schneider:\n“Coronal Discharge”\nProfessor Giulio Fanti believes that coronal discharge\ncould explain the shroud image.\n– Giulio has done a lot of good science\n– Coronal Discharge requires very high voltages\n-*-*-*-*-*-*-*-*-*-*-*-*-*-\nAnd, at the end, some words about the strange theories…\nSee for example:\n\nHere the words by Prof. Gonella during Villa Gualino’s Meeting (in 2000):\n“…As for the neutron bombardment, skipping any comment on the weird idea of a nuclear physics of Resurrection, as a nuclear physicist I can assure you that the exposure of cellulose to a fast neutron fluence big enough to cause the required enrichment in 14C would play such a havoc with the hydrogen atoms to cause chemical changes visible to the naked eye (and this too can be easily checked). …”\nHere the words by Prof. Luigi Gonella\n(title = “Discussant’s contribution”)\nduring the famous Meeting in Villa Gualino, Turin (in 2000):\n“…As for the neutron bombardment, skipping any comment on the weird idea of a nuclear physics of Resurrection, as a nuclear physicist I can assure you that the exposure of cellulose to a fast neutron fluence big enough to cause the required enrichment in 14C would play such a havoc with the hydrogen atoms to cause chemical changes visible to the naked eye (and this too can be easily checked). …”\nSo…\nIt’s easily understandable that my old idea (written by myself in my intervention paper for Dallas 2005) to use the AFM controls and the SSNTD witnesses during adequate experimental simulations perhaps should have had also this reference (… thinkable as an authoritative reference) in the paper (a simple thing that I didn’t do, if I well remember…)… otherwise that idea was judged a simple and useless joke (and now I write this with reference what wrote Prof. Gonella).\nUnfortunately we have seen some recent interesting or strange papers (an example: Jeffrey Skurka…) where this argument  (= AFM sperimental controls on irradiated samples with SSNTD as material witnesses regarding nuclear radiations) do not appear.\nIn any case, the Cellulose itself is a good detector (for exactness : a cellulose derivative = Cellulose nitrate).\n\n","date":"March 27, 2015 at 10:49 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194613","author":"piero","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"We can read somthing about SSNTDs, for example :\n>Polymer Solid State Nuclear Track Detectors (= SSNTDs) used\nwere: cellulose nitrates = KODAK CN 85, and CA 80-15\n(and also: poly(allyl diglycol)carbonate = CR-39)\n\n","date":"March 27, 2015 at 10:53 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194615","author":"piero","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"A couple of things.  The course was offered through the Lifelong Learning Institute of James Madison University, not Bridgewater College as Russ wrote.  \nThe polar molecule idea is quite interesting.  The entrainment would be cause by the reaction of the molecule to the ambient electric field.  It would cause the molecule to align with the field and should reduce the degree of diffusion and give a mechanism for a sharper image.  It is also an hypothesis which can be tested experimentally.  For more details the authors of the paper from which I drew the material should be consulted.  http://www.shroud.com/pdfs/stlspicerpaper.pdf\n\n","date":"March 27, 2015 at 1:43 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194626","author":"rschneider42","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"You (= Ray Schneider) wrote:\n“The polar molecule idea is quite interesting. …”\nYes.\nYou also wrote:\n“The entrainment would be cause by the reaction of the molecule to the ambient electric field…”\nSo… the electrostatic image may be formed by the presumed combined action of an electric field and urea molecules that combine with reducing sugars (that are present on the surface of the linen fibers of the cloth) and then give the Maillard products.\nThe possession of a dipole moment permits direct interaction with electric fields or interaction with the electric component of radiation.\nTherefore we can try to see what is the more probable candidate of that interaction.\nDo you agree?\n… and then, wanting to remain only within the ordinary possibilities…:\nWhich is the possible Natural Phenomenon involved?\n— — *** — —\nNow at this point,\n to me there are also some curious questions …\n For example:\nThe hypothesis of an “ancient technique of electrophotography” (although the strange stories about the use of the Ark of the Covenant abound and seem a fanciful idea of archeology!) … is it really just a rant unwrapped?\nHowever, I admit that there is only a fanciful idea.\n I do not believe in this version for the genesis of the footprint of the body of Jesus on the Shroud of Lino (= the Ark of the Covenant, or some other ancient electric generator, used as a power source for an ancient type of “Xerox copier”) …\n\n","date":"March 28, 2015 at 6:19 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194682","author":"piero","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"It is a well-written paper. There is something very difficult to agree with. It is no.6. The impression given is that Jesus was buried like Herod.\n\n","date":"March 27, 2015 at 5:40 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194646","author":"Louis","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Jesus was not buried as Herod was buried\n(By-the-way: … But what Herod? Herod the Great? Herod Antipas?).\nHow can we conclude from reading the Gospels and from the consideration of the Shroud,\n the arrangement of the body of Jesus was that of a temporary burial …\nIndeed Magdalene and women came (to the grave) and then run the other works in the tomb … but they did not find the body …\n— —- —\nHow Was Jesus’ Tomb Sealed?\nFor example, try see under the addres:\nhttp://www.biblicalarchaeology.org/daily/biblical-sites-places/jerusalem/how-was-jesus-tomb-sealed/\n— — —\nI have read that according to an ancient document Judeo-Christian St. Joseph was buried in a cave used as a family tomb.\nWhy was not used that toma for Jesus?\n… Otherwise was the tomb the same where St. Joseph was buried ?\n… and that tomb was the same tomb of Joseph of Arimathea???\n I am curious to read your answers about these mysterious questions …\n— — —\nIs the Tomb in question that of Talpiot (Jerusalem) in a Mt of Olives neighborhood ?\nI don’t believe in the Talpiot tomb.\nBut I am curious about the tomb of Saint Joseph ….\n— — —\nI have just found an image of a First century tomb with ossuaries on the Mount of Olives, near the Church of Dominus Flevit in Jerusalem…\nPerhaps you can retrieve other interesting images.\n\n","date":"March 28, 2015 at 10:43 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194703","author":"piero","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Thank you for posting this!\n\n","date":"March 28, 2015 at 7:07 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194688","author":"jenx","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"If Ray is to offer a comprehensive survey of the possible origins of the Shroud he needs to add to the ‘ masterful forgery’ hypothesis, the possibility that the Shroud was originally created for some other purpose and then adopted as a relic. This was so common an occurrence in the Middle Ages and, in fact, most so-called ‘ authentic’ relics started this way, so it should not be omitted when alternatives are discussed. The forgery  hypothesis has always faced the problem that without any mentions of images in the gospel accounts and with no images shown in the iconography of the burials of Christ, few people would have been taken in by a faked burial cloth with images. This partly explains why the single cloth at Cadouin which actually did come from the Holy Land and had no images on it was the number one burial Shroud for much of the Middle Ages.( It was eventually found to be an Islamic cloth, probably tenth century.) Interestingly, although we know that the Savoys bought the cloth from Margaret de Charny in 1453, the Savoys created their own legend to give it a history in the Holy Land (details in Beldon Scott’s book on the Shroud).\n\n","date":"March 28, 2015 at 10:54 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194705","author":"Charles Freeman","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Of course the problem of creation of the shroud in the middle ages is addressed in the lectures.  Such a creation as a minimum would appear to require actually crucifying someone which is hardly something that can be casually explained and then hidden items of fidelity would have had to be added that don’t make sense since they would not be visible such as the dirt from Jerusalem.  The early provenance of the shroud remains obscure although the many reasons for the silence are pretty obvious.  I think the Hymn of the Pearl is pretty good earth 3rd century evidence that the shroud was known.  Then the correspondences with the Sudarium of Oviedo completely destroy the C14 as well as any fabrication in the middle ages hypothesis.  To ice that of course one would need something like DNA data which would finally make the correspondences between the two cloths complete if it turns out to be feasible to do such DNA identification.\n\n","date":"March 28, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194715","author":"rschneider42","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Ray, there are alternative explanations which explain why the image of the head of Christ is of a man standing and why there is no sign of any of the contours one would expect if the Shroud had ever actually laid on a body. I am sure you can track them down and incorporate them into your lectures if you want your audiences to have a comprehensive survey of Shroud research.\n\n","date":"March 28, 2015 at 3:48 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194722","author":"Charles Freeman","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Mr. Freeman:  why there is no sign of any of the contours one would expect if the Shroud had ever actually laid on a body.\nVery good question, if people know how the image got printed on the Shroud. How can you answer if we don’t know the mechanism of printing that image on the shroud as well as what energy involved in the process of resurrection.\nRemember as Mr. Freeman think that image on the Shroud is not a painting.\n\n","date":"March 28, 2015 at 8:42 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194737","author":"Sampath Fernando","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Error: \nRemember as Mr. Freeman think that image on the Shroud is a painting.\n\n","date":"March 28, 2015 at 10:34 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194747","author":"Sampath Fernando","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"I’m quite sure that there are things I left out of my presentations.  I put the whole thing together in a couple of weeks.  It was a lot of fun catching up on some of my shroud reading.  On the electric field theory, I thought it was important because it offers a means of improving the resolution of a vaporagraph type image.  It doesn’t necessarily imply a Maillard reaction.  Any oxidation might be adequate in a surface layer.  The Rogers hypothesis just offers a mechanism for a thin impurity layer which might explain the extremely superficial nature of the image.\nIf Charles Freeman has a mechanism that is plausible or even implausible I’d be happy to include it in the future.  I have not encountered it.  In fact, when push comes to shove I’m not sure I’ve encountered a really plausible image mechanism yet.  They all seem to have substantial defects.  Some however are testable and insofar as they are tested we can get an idea of how far they fall short.\nI’m particularly uncomfortable with mechanisms that demand miraculous intervention or extreme mechanisms that are so implausible that they appear impossible short of miraculous intervention.  However, I’m inclined to cover them, especially if they have any basis.  I think Coronal Discharge for example, is pretty far out.  The degree of work that Giulio Fanti has put into makes it impossible to not say something about it.  But I have a hard time seeing how it could actually be the image process. \nAny ideas would be gratefully received.\n\n","date":"March 29, 2015 at 7:22 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194809","author":"rschneider42","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"John Klotz rightly asks in his recent book, “… if the Shroud did indeed wrap the body of Jesus and if science is deciphering its secrets what is it telling us?”. If the Shroud did indeed wrap the body of Jesus then,yes, it has something to tell us, and, it is much more than just that there is survival after death. We humans tend to be selfish, we only think about our survival. The rest is a long story that will be dealt with elsewhere, perhaps in a book.\nBut, coming to the question of image formation, Ray Rogers was a good scientist, however  he seems to have been something of a positivist, avoiding the Why lurking behind the How.\nWhat followed was oxidation, Maillard reaction and so on.\nAs in the interview below, I again ask: why should it have happened only to the body of Jesus? Was the tomb Joseph of Arimathea arranged for him very hot? Were other Jews buried in air conditioned tombs? What about those 800 Pharisees who were crucified by the (Hasmonean) Jewish king Alexander Janaeus in 86 BC? Can we be sure that their bodies were all thrown into pits or buried in trench graves? Rome had not yet dominated Palestine, so bodies were presumably not left to rot on the cross. Surely the richer Pharisees were buried in tombs, wrapped in shrouds.\n https://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"March 29, 2015 at 9:39 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194816","author":"Louis","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Louis wrote,\n“why should it have happened only to the body of Jesus?” \nThat’s like the question, “When did you stop beating your wife?” \nThere are two problems here. First the conclusion is in the question itself. Second, you are working with a sample size of one.\n\n","date":"March 30, 2015 at 8:58 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194852","author":"John Green","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"John Green says, “there are two problems here”.\nCould this be explained further?\n\n","date":"March 30, 2015 at 9:09 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194854","author":"Louis","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"I did, You ask a question that already has your conclusion in it. You have already concluded it’s the body of Jesus on it in your question.\nAssuming it is Jesus you still only have a sample size of one, unless you have other Shroud from that period to compare it with. I think we already talked about sample size here before.  \nI already posted a true case where a guy killed a lady and placed her nightgown over her face and buried her. When they found her there was an image of her face on the nightgown. Some will say it’s not the exact same image as the Shroud and that may be true, but it’s not the same conditions. The point is a dead body can leave an image.    \nI’m not saying it’s not Jesus, only that so far there is no real proof, it’s still being debated by some really smart people here.\n\n","date":"March 30, 2015 at 9:30 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194856","author":"John Green","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"I said “assuming that the Shroud did indeed wrap the body of Jesus”. I believe that the Shroud is authentic, however I don’t think anyone can be dogmatic when it comes to this. Not even the Church is. It is not an article of faith. If it was, the Pope would perhaps request the royal family to move it from Turin to Rome and place it at the High Altar at Saint Peter’s.\nRegarding other images:\nhttps://www.academia.edu/4691379/Can_the_Jospice_Mattress_imprint_be_compared_to_the_Image_on_the_Shroud\n\n","date":"March 30, 2015 at 9:41 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194857","author":"Louis","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Louis: “I believe that the Shroud is authentic, however I don’t think anyone can be dogmatic when it comes to this. Not even the Church is.”  \nI’m a little tired of this argument, Louis, which is problematic when you consider the statements of the last 7 popes, who head the Church (and they are quite clear and straightforward):\nPope Pius XI (1922-1939):  “… certainly not the work of any human hand.”\nPope Pius XII (1939-1958):  “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.”\nPope John XXIII (1958-63):  “This can only be the Lord’s own doing.”\nPope Paul VI (1963-78):  “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”\nPope John Paul II (1978-2005): “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”\nPope Benedict XVI (2005-2013):  “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.”\nPope Francis I (2013- ):  “By means of the Holy Shroud, the unique and supreme Word of God comes to us”\n\n","date":"March 30, 2015 at 4:42 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194885","author":"Nabber","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"“Why should it have happened only to the body of Jesus?” If the Shroud is authentic, this need not be a relevant question. Just like Charles Freeman’s Quem Quaeritis Shroud, the Authentic Shroud is the only one of its kind. Perhaps imagemaking was commonplace among 1st century burials, even among the richer pharisees; it’s just that not a single one remains. This could be because the Shroud is a case of ‘arrested development.’ Just as a sheet of photographic paper has to be removed from the developing liquid at just the right time before it all goes black, so a shroud could have had to be removed from its body before it simply became a mess.\n\n","date":"March 30, 2015 at 3:33 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194832","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"I don’t think that the images on the Shroud as they exist now are a painting, rather the discolouration of the linen after centuries of having been covered by pigments that have now disintegrated. Whether any of the original pigments were still there in 1978 is disputed between STURP and McCrone but all may have disappeared by then so it is not an important point . Far more important is the evidence of the images on the outer fibrils only and the ‘large’ quantities of calcium\nCarbonate used to this day to seal linen before the paint is applied to the outer fibrils ( thanks\nSTURP) There is also significant evidence from earlier depictions of a painted surface.\nThe iconography of the pattern of the bloodstains and the neat cross-cross of 372 flagellation marks on front and back, a flogging that it would have been impossible to survive or even to implement, fits well with the medieval iconography of the crucified Christ of the early fourteenth century . It all fits together well enough to satisfy my own fussy standards.\n\n","date":"March 30, 2015 at 4:02 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194835","author":"Charles Freeman","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"So Hugh believes that it is possible that image-making was commonplace among the richer Pharisees. Would these images be like the extraordinary image we see on the relic?\nIt was the group known as the Pharisees, not the Sadducees, who believed in life after death. Wouldn’t we have have dozens of “signs” proclaiming resurrection?:\n  https://www.academia.edu/10819998/Book_Review_The_Sign_by_Thomas_de_Wesselow\n\n","date":"March 30, 2015 at 9:07 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194853","author":"Louis","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Er…. no… on balance, I don’t think the Shroud image was made by a dead body at all. What I say is that if it turns out that it was made by a dead body, then it need not be due to anything special. However, who goes into a tomb after three days to check? After a week, all the images of dead pharisees were ruined, and after a year, when their bones were collected up and placed in ossuaries, their shrouds had been reduced to shreds. In the case of Jesus, for one reason or another the body and its shroud were separated before deterioration set in, and, if the Shroud is authentic, that it why it is the only one to have survived with its image intact.\n\n","date":"March 30, 2015 at 9:17 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194855","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Great, you are showing some signs of being pro-authenticity.\n\n","date":"March 30, 2015 at 10:05 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194860","author":"Louis","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"CF wrote: \n“Far more important is the evidence of the images on the outer fibrils only and the ‘large’ quantities of calcium Carbonate used to this day to seal linen before the paint is applied to the outer fibrils ( thanks STURP).\nCalcium or calcium carbonate?  This had been discussed before.\nColin Berry pointed out that he had initially raised this issue previously\nSee previous topic “An early morning google find”  A comment of mine with a direct quote is cut & pasted below.  \nIn Adler’s “orphaned manuscript”, Chemical and physical aspects of the Sindonic images, published in 2000, it says “All the types of Shroud fibers gave positive tests for only two elements, calcium and iron. However, these elements do not derive from the presence of iron oxides or calcium carbonates in the fibers…”   Doesn’t seem to agree.\n\n","date":"March 30, 2015 at 11:40 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194871","author":"Kelly Kearse","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Adler: ““All the types of Shroud fibers gave positive tests for only two elements, calcium and iron. However, these elements do not derive from the presence of iron oxides or calcium carbonates in the fibers, as positive tests are obtained without the need for prior acidic digestion and therefore these elements can be considered as being coordinately covalently bound to the linen’s cellulosic structure. Other samples of old linens show the same type of results and therefore the presence of these elements can be ascribed to chemistry arising during the manufacture of linen from flax, e.g;, the retting process carried out in naturally hard waters”.\nThis shows (if necessary..) that Adler performed his experiments very conscientiously and with control samples.\nHis results show that there is no evidence of added calcium on the shroud, therefore no evidence of gesso.\nOf course, this fact itself does not eliminate the possibility that a thin layer of gesso (Calcium carbonate+proteins) was applied on the surface of the Shroud.\nThe key is that gesso always contains a proteinaceous binder.\nAdler clearly demonstrated that there is absolutely NO protein on the Shroud (except in the blood stains).\nEven if all the pigments are now lost, we should find some traces of this proteinaceous binder at the surface of the shroud.\nThere is absolutely no cementation of the fibers, there is absolutely no evidence of any kind of proteinaceous binder (using both micro-chemistry and micro-spectroscopy) on the Shroud (except the blood stains).\nCharles: “Carbonate used to this day to seal linen before the paint is applied to the outer fibrils ( thanks STURP).”\nCharles, you can not use some STURP data (Calcium) and “forget” the analysis of these data.\nGiven all of the STURP the data, your “hypothesis” is completely ruled out.\n\n","date":"March 30, 2015 at 3:42 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194883","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"HF: “on balance, I don’t think the Shroud image was made by a dead body at all” \nI challenge Hugh to name any single known man-made.image, not a photograph of a known corpse, which has attracted anything like the same forensic interest as has the Shroud image.  Vignon, De Lage, Barbet, Willis, Bucklin, Zugibe, all experienced forensic pathologists were all persuaded that they were examining the image of a corpse, and wrote copiously on the matter, without even a hint that it might not be such.  All to the extent that other scientific.workers followed it up with their own various tests.  No single painting, brass rubbing, nor other image has ever persuaded such as these to examine the forensics of their subject matter in any detail at all.   \nIt is also clear that Charles has made a false induction by claiming that presence of calcium necessarily implies calcium carbonate, hence his gesso hypothesis.  There were also traces of strontium and iron present, consistent with the limestone in the neighbourhood of Jerusalem, and a better induction is therefore that the presence of calcium  is more likely due to a flax retting process in that neighbourhood.  \nFew artists ever began their work without creating an initial outline of their subject, and they also leave brush-strokes.  There is no evidence of either in the Shroud image.  If the image was created by a man-made process at all, then Colin Berry’s sweat imprint would be a more persuasive scenario.  \nCharles may consult his various anonymous experts if he likes, but it is unlikely that any of them have the faintest knowledge of any of the technical and scientific attributes of the Shroud.  So it can only be ignorance compounded!\n\n","date":"March 30, 2015 at 2:44 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194880","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"“When I read the voluminous literature based on Barbet’s sacrosanct speculations, I, sometimes wonder if I am not committing a sacrilege when I question them.”\nIt is true that the image on the Shroud is not sufficiently grotesque for pathologists to declare that it cannot represent a dead body, but that is a far cry from their declaring that it must derive from one. They begin their investigations by assuming that the image is of a dead body, and working from there. There would be no point in doing anything different. However their interpretations of what they observe are sufficiently different for us to recognise a certain subjectivity about their observations, and other interpretations of the size and posture of the body which might have produced the image have also been very different.\nOn calcium, R.A. Morris of the STuRP team identified the calcium by X-Ray Fluorescence. He discussed it in some detail, and was of the opinion that it was surface contamination, because the areal densities of calcium and strontium across the Shroud were very similar to the densities of the same elements found on the Holland cloth. He goes on to say: “Both calcium and strontium are relatively common elements. For instance, we might expect considerable quantities of airborne CaC03 from the rich marble and limestone regions of northern Italy. In igneous rocks strontium occurs as a substitutional element for calcium and potassium\nin plagioclase and potash feldspars respectively. These minerals are both quite susceptible to weathering and represent major sources of clay in some areas. Although other explanations are possible, the uniform calcium and strontium distributions might be explained simply as dust accumulations.” However, Morris acknowledge that there might be additional calcium deeper among the fibres, which did not register on his spectra because: “X-ray attenuation by hydrocarbons is greatest at lower energies and in these measurements would strongly suppress the calcium peak. We measured an attenuation of approximately 75% for Ca Ka X-rays through 20 mg cmS2 cellulose. If the calcium were distributed uniformly through the cloth instead of at the surface, the actual weight concentrations could be twice as large as the\nnumbers quoted.” In other words any calcium which might have accumulated as part of the retting process would be in addition to, not as a substitute for, that observed by Morris.\n\n","date":"March 30, 2015 at 5:46 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194892","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"HF: “They begin their investigations by assuming that the image is of a dead body, and working from there.”  Barbet was specific in asserting that he had come across no artistic work, in whatever garish gory depictions, that satisfied the forensic details he observed on the Shroud.  And I note that you were unable to respond to my challenge of naming any single art work which has attracted anything like the same level of forensic interest. \nYour comments on calcium:  I note that Thibault above has commented that other old linens show the similar concentrations as Adler asserted, and the reasonable induction is that it is due to the retting process indicating likely ancient manufacture.  Surface contamination of calcium might conceivably have come from Italian marble or limestone.  But a more likely proposition I think is that it originated from aragonite limestone in Jerusalem, possibly from contact with a limestone tomb. I am unaware that northern Italian limestone has the same distinctive character as aragonite.\n\n","date":"March 31, 2015 at 5:18 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194949","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"“And I note that you were unable to respond to my challenge of naming any single art work which has attracted anything like the same level of forensic interest. ”\nForensic interest concluded to a medieval object I’m afraid.\n\n","date":"March 31, 2015 at 8:05 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194960","author":"PHPL","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"That was not the conclusion of the several experienced forensic pathologists I specifically named.  Are you able to specifically identify any of the medieval participants including the medieval crucifixion victim whose injuries happen to match those of the gospel accounts?  Oh, yes. Colin Berry at one time suggested it might be Jacques Molay!!??\n\n","date":"March 31, 2015 at 2:01 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194982","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Just as one should ask forensic experts who have dealt extensively with bloodstains whether they have ever seen,in any context , in their working lives, dried blood which is red, so too one  should ask experts in linen retting whether they have ever found calcium added during retting ( although flax could also be dried in the sun so this would not be an issue in this case).\nI was intrigued by Kelly Kearse’s suggestion in another posting  that there might  be evidence of rabbit protein. It was not clear to me as a non-scientist what his point was but rabbit skin glue is, of course,the traditional component of gesso so if  rabbit protein  is there,in addition to the calcium, it might be something to do further work from ( for me at least- others might like to believe that research on the Shroud has already come to a definitive conclusion and they can sit back and moan at those of us who are still actively researching ).\n\n","date":"March 31, 2015 at 1:31 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194937","author":"Charles Freeman","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Afraid you misunderstood this one.  The statements I made refer to the fact that from the current studies it is unknown if blood from other species might be present in addition to primate (human).  That is all but one: Rabbit.\nIn certain experiments, labeled antibodies directed against rabbit immunoglobulin were used to detect primary unlabeled antibodies (made in rabbits), a common sandwich approach.  Controls using secondary labeled antibodies only would have detected any endogenous rabbit immunoglobulin present.  Was not observed.\n\n","date":"March 31, 2015 at 5:15 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194948","author":"Kelly Kearse","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Thanks, Kelly, for the clarification.\n\n","date":"March 31, 2015 at 7:48 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194958","author":"Charles Freeman","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"It must be added that Edward Hall told Ian Wilson during an interview that he saw no signs of painting.\n\n","date":"March 31, 2015 at 7:21 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194956","author":"Louis","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"“I note that you were unable to respond to my challenge.” I didn’t choose to respond to your challenge because it was meaningless. The Shroud is unique and worthy of investigation. I don’t challenge authenticists to name another shroud similarly studied, without which their conclusions must be wrong, because that would be meaningless too.\nAs for Barbet, I’m afraid I can only repeat the quotation from Fred Zugibe above my previous comment. His observations have been challenged at almost every level, from the physical perfection of the body image itself to the shape, colour and identity of the blood to his opinion on the cause of death. I have no doubt that if he were alive today he would have clarified some of his ideas and changed others in the light of more recent developments. Perhaps he would have agreed with Fred Zugibe.\nAnd “I am unaware that northern Italian limestone has the same distinctive character as aragonite.” Me too, but I can tell you that Turonian limestone, of which aragonite is a common feature, is not only the bedrock of Jerusalem, but is also responsible for the caves wherein the Troyes Speleological Society spends much of its time – about 30km from Lirey…\n\n","date":"March 31, 2015 at 8:44 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194961","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"The incidental challenges to particular claims made by Barbet, does not change the fact that all of the forensic pathologists I named, including Zugibe, were unanimous that the TSM is an image of a real crucifixion victim, whose injuries just happen to match the gospel accounts, whereas artistic portrayals of the same lack accurate forensic detail. \nBut that is a fascinating comment re the Troyes Speleological Society!\n\n","date":"March 31, 2015 at 2:13 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194985","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"My understanding is that, of the 9 aragonite-type samples from Israel offered up for examination, only the Jerusalem sample aragonite had a close match with that found on the Shroud.  Until you state some more details about French aragonite, I don’t see the relevance.  It would seem to be of the same relevance of the 8 Israel samples that did not match the Shroud very closely.\n\n","date":"March 31, 2015 at 2:52 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194986","author":"Nabber","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Perhaps if you checked the 9 locations against the geological maps at http://www.geology-israel.co.il/WEB%20PAGE/MAPS.HTML then your understanding would be improved. Let us know how you get on.\n\n","date":"March 31, 2015 at 5:37 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-195004","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Thanks, Kelly, for the clarification.\nSure, you’re welcome\n\n","date":"March 31, 2015 at 9:17 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194965","author":"Kelly Kearse","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Hugh as long as you still can think ‘your 1260-1390 CE forger’/’painter’ could have (so) easily fooled all the medical examiners/forensic pathologists who CLOSELY examined the TS bloodied body  image along with Art Historians such as De Wesselow, Kitzinger and Belting — just to name a few –, I do think you are the one indulging in wishful realities.\n\n","date":"March 31, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-194992","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"That’s OK, Max. No hard feelings.\n\n","date":"March 31, 2015 at 5:38 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-195005","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Thank you Hugh, for the map refs.  I have some little acquaintance with geol maps from my Engineering Geology days.  \nThe convention is that the surface geology only is shown, and must be superposed on a contour map, to obtain the dips and strikes, and hence the geologist determines the sequence of the strata.  The legends provided with these maps fortuitously show the stratigraphy. There are several strata with interspersed limestone, dolomite  and chalk, and of course layers of alluvia, and also some flint. The limestone is extensive on the surface geology, but is not specifically labelled as aragonite.  From a comment by Nitoswki it would seem that only a limited area can be identified as aragonite, while much of it would seem to be calcite. \nThe area immediately north of Jerusalem is labelled ‘Kub’, coloured yellow, is the Bi’na formation in the Turonian strata, and comprises limestone interspersed with dolomite.  Kub pops up all over the place, roughly in a N-S strip.\nUnderlying Kub is the Kuw,(coloured green) the Weradin formation in the Cenomanian strata, generally dolomite, and generally lies to the west.  Overlying Kub is the Kum, the Menuha formation in the Senonian strata, mainly chalk, and generally lies to the east.  It would seem then that the strata generally dip to the west, with the more recent deposits being in the east at this location. . \nThe Shroud samples from soles of the feet, nose and knee analysed by Kohlbeck, were identified as aragonite.  He obtained several Jerusalem field samples from Nitowski from about nine different sites.   Now it seems that aragonite is indeed widely present and quite common in Jerusalem.  However:\n“Dr. Nitowsky (Sr. Damian of the Cross) sampled in Israel, nine sites which included:\n1. Emmaus; 2. Jericho, at Herod’s palace; 3. Qumran ; 4. Beth Shan ; 5 Sepphoris; 6 and 7 Beth She’arim; 8 Jerusalem; 9. Mt Carmel”. The Jerusalem samples are further identified as in the École Biblique tomb complex and more particularly from the bench of the tomb.”\nShe spoke of Limestone (calcium) and not properly of Aragonite. The nine different test sites in Israel were also analysed. The limestone throughout the nine sites changes and she claims that it does not match either Jerusalem or the Shroud of Turin. Only the sample taken from the Jerusalem tomb matched the limestone on the Shroud.” \nAlso Excerpt from a letter to Father Otterbein by Dr. Nitowski\n“Limestone (calcium) samples were collected from as far south as 30 miles from Jerusalem to as far north as the Galilee and Mt. Carmel.  As previously reported, Kohlbeck and Damian had matched a heavy calcium concentration from the foot area on the Shroud of Turin to samples collected in Jerusalem. This evidence was called into question, so sampling around Israel was performed to ascertain if such a test was valid. From as close as 30 miles from Jerusalem, the limestone changes\nand does not match either Jerusalem or the Shroud of Turin. Therefore, the match between Jerusalem and the shroud is a valid one. ”  \nEssentially then, although it is stated that aragonite is fairly common in Jerusalem, only one of the nine sites submitted by Nitowski matched the Shroud sample, that is from the Jerusalem tomb complex mentioned.  Nor is it enough to assert that aragonite is present in the Turonian strata of the Troyes caves or anywhere else.  Included with the Shroud and Jerusalem aragonite were the traces of strontium and iron, but no lead.  It seems that Sr can replace Ca in aragonite.  But the percentages should be able to act as location indicators.  More work would need to be done to quantify this aspect.\n\n","date":"March 31, 2015 at 8:42 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-195013","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Typo error in para 3 of mine above:\n‘It would seem then that the strata generally dip to the EAST, with the more recent deposits being in the east at this location.”\n\n","date":"March 31, 2015 at 8:50 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-195014","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin","post":"Thank you, dave b\n\n","date":"April 1, 2015 at 9:42 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","id":"comment-195097","author":"Nabber","site":"shroudstory"}]
