[{"title":"Reservations for Viewing the Shroud of Turin in 2015","post":"From googling (my italics)\nArchdiocese announces dates for 2015 public display of Shroud of Turin\nBy Cindy Wooden\nCatholic News Service\nVATICAN CITY (CNS) — The Archdiocese of Turin, custodian of the Shroud of Turin, has announced that the shroud, venerated by many as the burial cloth of Christ, will be on public display April 19-June 24, 2015.\nThe archdiocese said the 67-day display will be the longest period of time that the 14-foot-by-4-foot linen cloth has ever been available for public viewing; providing a window of more than two months not only will allow more faithful to see it, but also will make it easier for Pope Francis to schedule the visit he has said he wants to make.\nAt the same time, the Turin announcement said, the public display will coincide with several events in Turin for young Catholics arriving to mark the 200th anniversary in 2015 of the birth of St. John Bosco, the founder of the Salesians.\nIn early March, the archdiocese also announced that it had chosen a theme for the 2015 display: “The greatest love.”\nArchbishop Cesare Nosiglia of Turin said, “The greatest love is God’s for men and women,” a love reflected in Jesus, “the son of God made man, who accepted death on the cross for the salvation of all, in every time and every situation.”\nThe image on the shroud, he said, testifies to the “suffering and death of a crucified man” and is “a sign of that love which does not end with death.”\n                        ################################\nDon’t you just love that phrase “will make it easier for Pope Francis  etc etc” or “the death of a crucified man”. \nIs anyone else thinking what I’m thinking? Clue: remind yourself of the Vatican’s (present) position re authenticity.\nMethinks tickets and reservations for us hoi polloi, “young Catholics” included, are nowhere near the top of Turin’s list of priorities. Thus the information vacuum re reservations, the tumbleweed website …\n\n","date":"July 15, 2014 at 7:40 am","url":"https://shroudstory.com/2014/07/15/reservations-for-viewing-the-shroud-of-turin-in-2015/","cat":"2015","id":"comment-138460","author":"Colin Berry","site":"shroudstory"},{"title":"Reservations for Viewing the Shroud of Turin in 2015","post":"The vacuum on reservations and tumbleweed website are par for the course with Italian/Vatican church projects.\nI read this announcement and it makes me indeed wonder if the Turin/Vatican have something up their sleeve re: authenticity. If they know the Shroud is medieval why draw attention to it in such a big way?\nSomething may be afoot. Or it may simply be much ado about nothing. We shall just have to wait and see.\n\n","date":"July 15, 2014 at 9:41 am","url":"https://shroudstory.com/2014/07/15/reservations-for-viewing-the-shroud-of-turin-in-2015/","cat":"2015","id":"comment-138484","author":"David Goulet","site":"shroudstory"},{"title":"Reservations for Viewing the Shroud of Turin in 2015","post":"“. If they know the Shroud is medieval why draw attention to it in such a big way?”\nDon’t worry.\n\n","date":"July 15, 2014 at 10:10 am","url":"https://shroudstory.com/2014/07/15/reservations-for-viewing-the-shroud-of-turin-in-2015/","cat":"2015","id":"comment-138491","author":"anoxie","site":"shroudstory"},{"title":"Reservations for Viewing the Shroud of Turin in 2015","post":"In 2010 the reservation system did not go online until around nine months before the start of the exhibition. If Turin follows the same pattern this time, we can expect the system to go online within the next few weeks. Definitely much ado about nothing.\n\n","date":"July 15, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/07/15/reservations-for-viewing-the-shroud-of-turin-in-2015/","cat":"2015","id":"comment-138540","author":"Barrie Schwortz","site":"shroudstory"}]
