[{"id":"comment-960","author":"cazab","post":"Sorry. I don’t change my opinion. About Capasso, the most important point, I find your argument odd. Capasso didn’t examine the shroud itself. OK. He didn’t examine photographs of the shroud. What for ? What can you see naked eye ? He examined and dated the handwritings peer reviewed by Marion. What is the probability that he found them coherent and dated them from 50 to 50 ? It seems to me that it is a remote probability, especially in a single blind experiment. But I agree it needs to be confirmed and peer reviewed. Furthermore, it’s incorrect to say nobody sees the inscriptions again. Thierry Castex( cf. Http://thierrycastex.blogspot.com/ ), in a article in Revue internationale du Linceul de Turin wrote he discovered the same inscriptions examinating the Barrie Schwortz photographs (1978). P.S. Forgive my english also !.","date":"2010-01-26","mins":"6:11 pm","url":"https://shroudstory.com/2010/01/26/best-comment-on-the-so-called-death-certificate-on-the-shroud-of-turin/","cat":"news_&_views","title":"Best Comment on the so-called Death Certificate on the Shroud of Turin"},{"id":"comment-11679","author":"cazab","post":"This article is interesting for New Testament studies because it can only increase our assessment of the historical reliability of the passion account in Matthew. If there was no trace at all of an earthquake between 26 36 AD (that is to say, if we had only the trace of an eathquake in 31 AD), we would have a high level of certainty that Matthew used sometimes an allegory in his Passion account. Clearly, here we have a scientific data that we could have expected to be found if the historical reliabilty of Matthew’s account was high. But the last big news in NT Studies was given in February by Daniel Wallace. Wallace annouced that a fragment of Mark’s Gospel, found in Egypt in 2011, may date to 1st century. Http://www.forbes.com/sites/johnfarrell/2012/02/27/fragments of marks gospel may date to 1st century/.","date":"2012-05-29","mins":"5:54 am","url":"https://shroudstory.com/2012/05/29/clarification-quake-did-not-reveal-day-of-jesus-crucifixion/","cat":"news_&_views","title":"Clarification: Quake DID NOT reveal day of Jesus’ crucifixion"},{"id":"comment-944","author":"cazab","post":"I’d like to know what do you think of the expert opinion of Prof. Mario Capasso when he declares the inscriptions are corresponding to an handwriting made between 50 to 50. Is this well known papyrologist wrong and how, according to you, is it possible ? According to you, what is the probability for this classic pareidolia to be well made enough that it can abuse an expert in his field ?.","date":"2010-01-22","mins":"6:37 am","url":"https://shroudstory.com/2010/01/21/death-certificate-on-the-shroud-of-turin/","cat":"news_&_views","title":"Death Certificate on the Shroud of Turin?"},{"id":"comment-2065","author":"cazab","post":"Among historians, I think it is worth mentioning french historian Emmanuel Poulle who published in 2006 and 2009 two of the most important articles on the Turin Shroud in renowned peer reviewed journals : Revue d’Histoire de l’Eglise de France and Revue d’Histoire Ecclesiastique( http://cat.inist.fr/?a Modele=affiche N&cpsidt=18512573 and http://www.rhe.eu.com/pages/rhe195.asp ) I know it is written in French but I cannot explain why he is (almost?) never mentioned by historians such as Scavone..","date":"2011-01-01","mins":"10:15 am","url":"https://shroudstory.com/2011/01/01/ignorance-or-bigotry-or-pz-myer-ism/","cat":"news_&_views","title":"Ignorance or Bigotry or PZ Myer-ism"},{"id":"comment-3613","author":"cazab","post":"In fact, it looks genuine (especially the writing). Sainte Thérèse would be of course for Teresa of Avila (many relics of Teresa are scattered across Europe) !.","date":"2011-08-16","mins":"2:01 pm","url":"https://shroudstory.com/2011/08/16/more-on-the-shroud-of-turin-relic-on-ebay/","cat":"news_&_views","title":"More on the Shroud of Turin Relic on eBay"},{"id":"comment-957","author":"cazab","post":"Dear m. Nicolotti, I’ve read your article. Unfortunately, I wasn’t convinced. I can explain it with two exemples : 1) ad hominem versus André Marion who, by the way, was agnostic and not a fan of UF Os (many experts studied the “vague belge”…); 2) false quote : “L’autrice vorrebbe farci credere che le sue scritte, databili al I secolo, hanno sopportato benissimo il trascorrere di 1300 anni, e che nel XIV secolo i Templari potevano leggerle tranquillamente (lo afferma nel suo libro[12]);” here is the exact quote : “Se qualcuno dei frati si accorse che sul telo c’erano delle scrite in ebraico, come pure e possibile, capiremmo ancora meglio perché le gerarchie del Tempio vollere mantenere sulla reliquia il puo assoluto segreto.” It’s clear it’s just a possibility, not a certitude for Barbara Frale. And after that, you mention that ” per un inspiegabile fenomeno, sono improvvisamente sparite in soli due secoli. Nel 1598 l’arcivescovo di Bologna Alfonso Paleotti ha scritto un trattato sulla sindone: le sue minuziose descrizioni del sacro lino scandagliano ogni immagine della reliquia, ma non parlano assolutamente di scritte”. You don’t take into account the possible consequences of the fire in Chambéry on the handwritings (1532). Concerning Capasso, Frale said she showed him the handwritings “discovered” by Marion and Courage in a single blind experiment. Is it a lie ?.","date":"2010-01-26","mins":"8:29 am","url":"https://shroudstory.com/2010/01/22/more-death-certificate-on-the-shroud-of-turin/","cat":"news_&_views","title":"More: Death Certificate on the Shroud of Turin?"},{"id":"comment-3614","author":"cazab","post":"However “saint suaire” could also be for the “saint suaire de Besançon” or the “saint suaire de Compiègne”.","date":"2011-08-16","mins":"2:08 pm","url":"https://shroudstory.com/2011/08/16/more-on-the-shroud-of-turin-relic-on-ebay/","cat":"news_&_views","title":"More on the Shroud of Turin Relic on eBay"},{"id":"comment-938","author":"cazab","post":"First of all, I’d like to say your blog is great. Nevertheless, I disagree with you about the validy of the “pareidolia hypothesis” in this case. In her last book, which I read, Frale writes she asked his opinion to an expert, papyrologist Mario Capasso, about a possible datation of the letters “discovered” in 1995. Capasso dated the inscriptions from 50 to 50 and found them coherent. In my opinon, clearly, this expert advice is incompatible with pareidolia. (cf. A discussion on this french forum http://www.linceul turin.com/forum/forum.html ) Concerning the 1995 peer reviewed paper, I haven’t got it, but in his book (Le linceul de Turin et la tunique d’Argenteuil, 2006) Marion wrote that during his research he worked not only with a real size Enrie photograph but also with other photographs in order to corroborate his findings. And in an article published a few months ago in the french Revue Internationale du Linceul de Turin (RILT) Thierry Castex said he could also distinguish the inscriptions Marion saw with Barrie Schwortz photography (1978)..","date":"2010-01-20","mins":"5:16 pm","url":"https://shroudstory.com/2010/01/20/really-more-evidence-that-verifies-shroud-of-turin-is-real/","cat":"news_&_views","title":"Really? More evidence that verifies Shroud of Turin is Real"},{"id":"comment-6079","author":"cazab","post":"Have you noticed that Fanti’s article for the JIST of Nov Dec is now available? It’s a good answer to Nickell’s claims. Http://jist.imaging.org/resource/1/jimte6/v55/i6/p060507 s1?is Authorized=no.","date":"2011-12-24","mins":"7:39 am","url":"https://shroudstory.com/2011/12/24/second-update-to-msnbcs-cosmic-log-posting-on-the-shroud-of-turin/","cat":"news_&_views","title":"Second Update to MSNBC’s Cosmic Log Posting on the Shroud of Turin"},{"id":"comment-941","author":"cazab","post":"Frale agrees in substance with Guscin’s critique and proposes an other interpretation of this letters..","date":"2010-01-21","mins":"5:37 am","url":"https://shroudstory.com/2010/01/20/really-more-evidence-that-verifies-shroud-of-turin-is-real/","cat":"news_&_views","title":"Really? More evidence that verifies Shroud of Turin is Real"},{"id":"comment-1241","author":"cazab","post":"Much more rational, the last peer reviewed article of Giulio Fanti : “The body image visible on the Turin Shroud (TS) has not yet been explained by science ” (published 26 February 2010) http://scitation.aip.org/getabs/servlet/Getabs Servlet?prog=normal&id=JIMTE6000054000002020508000001&idtype=cvips&gifs=yes&ref=no.","date":"2010-04-09","mins":"4:29 pm","url":"https://shroudstory.com/2010/04/09/the-not-so-rational-rationalists/","cat":"2010","title":"The not so rational rationalists"},{"id":"comment-1763","author":"cazab","post":"Gary Habermas, “The Shroud of Turin Revisited: Jesus’ Burial Garment?” Liberty University, November 17th http://www.philchristi.net/documents/2010 EPS National Meeting Schedule.pdf.","date":"2010-11-23","mins":"9:31 am","url":"https://shroudstory.com/2010/11/23/the-shroud-of-turin-discussed-at-important-evangelical-conference/","cat":"news_&_views","title":"The Shroud of Turin Discussed at Important Evangelical Conference (UPDATED)"}]
