[{"title":"A Different Point of View: Illogical nonsense on the Turin Shroud","post":"The scientists concluded that because the image on the Shroud is only “one fifth of a thousandth of a millimeter” (0.0002 mm) deep – the thickness of a flax fibril cell wall, and it would have required the equivalent of “34 thousand billion watts” delivered by “a battery of ten thousand excimer lasers” (“Translated version of 2011_14_ENEA.pdf”), the image COULD NOT HAVE BEEN CREATED BY A MEDIEVAL FORGER. \nTherefore, ALL medieval forgery theories for the creation of the Shroud image (whether painting, hot statue, primitive photography, crucified victim, etc) are WRONG. And also the 1988-89 radiocarbon date of the Shroud linen to between 1260-1360 AD is WRONG!\nBut if someone does not personally like the theory that “God did it,” i.e. the image of the crucified Jesus was imprinted on His linen Shroud by the radiation emitted as His body changed state in resurrection (1 Corinthians 15:35-52; Philippians 3:20-21), they are free to propose some other theory. Or to believe in no theory.\nBut what they cannot now rationally do is claim that the Shroud is a medieval fake and that that was proved by the 1988 radiocarbon dating. This five-year series of experiments by the Italian ENEA scientists has ruled those out.\n\n","date":"December 26, 2011 at 6:37 am","url":"https://shroudstory.com/2011/12/26/a-different-point-of-view-illogical-nonsense-on-the-turin-shroud/","cat":"other_blogs","id":"comment-6134","author":"Stephen E. Jones","site":"shroudstory"},{"title":"A Different Point of View: Illogical nonsense on the Turin Shroud","post":"WRONG.  TOTALLY WRONG !  Again, I’m not dumb enough to believe this.  Ray Rogers showed quite well that he could achieved a good coloring result with ammonia (as good as ENEA and even more when you consider that he, and not ENEA, have done his experiment on a proper linen sample prepared the old fashion way).  So, we just cannot ruled out that the Shroud images could have been formed by a natural process.  In the present state of our knowledge, we just can’t.  Pretending the contrary would demonstrate a very closed-mind.\nHere’s another scenario :  In order to produced a relic, some medieval guy could have taken a human being that look like the Jesus of the Icons, beat him, scourged him and crucified him.  Then he could have put him into a burial linen shroud and after some time, remove his body and an imprint could have been left on his Shroud in some natural way that we cannot fully explain today.\nI know this scenario is very unlikely.  I know that if this is true, we’re not even able to explain the high quality of the blood stains on the cloth (that give the impression that the body has simply disappeared).  I know that full well !  And personally, I don’t believe this scenario is the best we have.  In fact, I think this scenario have something like 0.1% of chances to be true.  BUT WE JUST CANNOT DISCARD IT COMPLETELY FOR THE MOMENT.  That’s the proper scientific way to see this question.  I think Ron once said that we deal here with probabilities.  Exactly right.\nSo, in the law of probability, what is more likely ?  The scenario I just describe or the or the Hollywood scenario that shows that the body of Jesus has emited a UV light (and nothing else) at the time of the resurrection ?\nIf we stay honest, I really don’t think one or the other reach very high on a probability scale…  And I think there’s place for some middle ground here.\nBut what I tried here to state is that the ENEA study cannot PROVED that the Shroud images were not made naturally during the Middle Ages.  In the present state of our knowledge, it just can’t.  Not until ALL the natural hypothesis of image formation will be completely ruled out.  We’re still far from this point…\n\n","date":"December 27, 2011 at 6:20 pm","url":"https://shroudstory.com/2011/12/26/a-different-point-of-view-illogical-nonsense-on-the-turin-shroud/","cat":"other_blogs","id":"comment-6193","author":"Yannick Clément","site":"shroudstory"},{"title":"A Different Point of View: Illogical nonsense on the Turin Shroud","post":"Yannick actually I think the probability of a ‘tortured’ victim being used to create the image is much lower then you speculate, more like .000001 chance, basically meaning it is as likely as a supernatural event. Many of the evidences found on the Shroud point us to this conclusion; undisturbed blood, image on non-contact areas, certain distortions etc; But in saying this I also believe Mr.Jones may be wrong in that this latest experiment proves anything against a medieval forgery, but alas we don’t need anymore proof as I think it has already been proven many times over; scientifically, artistically, and materialistically.\nR\n\n","date":"December 27, 2011 at 6:49 pm","url":"https://shroudstory.com/2011/12/26/a-different-point-of-view-illogical-nonsense-on-the-turin-shroud/","cat":"other_blogs","id":"comment-6195","author":"Ron","site":"shroudstory"},{"title":"A Different Point of View: Illogical nonsense on the Turin Shroud","post":"Ron, I agree with you.  What I tried to say is that we didn’t need Di Lazzaro’s experiment to understand that the probability that the Shroud was done by some forger in medieval time is REALLY low.  \nIn my opinion, Di Lazzaro used this idea (that the main proof that came from his experiment is the proof that the Shroud can’t be medieval) like a smoke screen to hide the real purpose of his experiment, which is to me as obvious as the nose in anyone’s face :  Trying to prove the resurrection using the Shroud (at least make believe in this concept).\nWhen I read his comment that his experiment will open a new theological and philosophical debate, I could saw the bias right there and the main purpose of his experiment jumped in my face !\nOpen a new debate on the resurrection question versus the Shroud ?  This is totally untrue, unless you do EXTRAPOLATIONS… Which is not a a good, scientifically speaking.\n\n","date":"December 27, 2011 at 7:09 pm","url":"https://shroudstory.com/2011/12/26/a-different-point-of-view-illogical-nonsense-on-the-turin-shroud/","cat":"other_blogs","id":"comment-6198","author":"Yannick Clément","site":"shroudstory"},{"title":"A Different Point of View: Illogical nonsense on the Turin Shroud","post":"I think Rob Hosking has his wires crossed actually, if he would take the time to study scripture he would realize “quite clearly” that; God gave man; “Free Will”. That basically means God will not interfere in our world, has no say in what people do to others, or to themselfs. He has shown us how to live, it is up to us to follow so, or not….pretty simple! But as to the ‘sufferers’, such as the child of abuse we have here, they will be appeased, a million fold in God’s house.\nR\n\n","date":"December 26, 2011 at 12:36 pm","url":"https://shroudstory.com/2011/12/26/a-different-point-of-view-illogical-nonsense-on-the-turin-shroud/","cat":"other_blogs","id":"comment-6142","author":"Ron","site":"shroudstory"},{"title":"A Different Point of View: Illogical nonsense on the Turin Shroud","post":"There are signs and miracles everywhere…a sunset,a flower,a childbirth etc.And as far as human beings making free will choices to do evil ,rather than choose good….(child abuse to cite your example),it is OUR duty and mandate,if you will, to help stop and prevent this evil where ever it occurs and how ever we can.\nWake up Rob H. because if anyone has their wires crossed,it’s you.\n\n","date":"December 26, 2011 at 3:36 pm","url":"https://shroudstory.com/2011/12/26/a-different-point-of-view-illogical-nonsense-on-the-turin-shroud/","cat":"other_blogs","id":"comment-6149","author":"john macgillivray","site":"shroudstory"},{"title":"A Different Point of View: Illogical nonsense on the Turin Shroud","post":"Signs of miracles everywhere ?  I agree, there are SIGNS.  But the main problem in Shroud science is that there’s a lot of people, supposedly scientists (I won’t give names) that would like to see PROOFS instead of SIGNS.  That’s the biggest problem in Shroud science and it’s true since STURP published their final report that left the image formation question open.  I know they couldn’t act differently because that was the truth.  But the outcome of this is that it opened largely the door for every possible pseudo-science, extrapolations and speculations you can think of !!!  Really, I hope a future series of direct research on the Shroud will find some answers because if it still can’t, then it will be a real free for all ! :-)\n\n","date":"December 27, 2011 at 7:23 pm","url":"https://shroudstory.com/2011/12/26/a-different-point-of-view-illogical-nonsense-on-the-turin-shroud/","cat":"other_blogs","id":"comment-6199","author":"Yannick Clément","site":"shroudstory"}]
