[{"title":"Movement of the Shroud after 1355","post":"Considering this is attempt to produce a definitive Encyclopaedia of the Shroud, a worthy cause, it is a shame that it is illustrated by a map which is admittedly misleading in at least two respects, namely the Templar route to ‘Paris 1307’, which has apparently been discarded, and the position of “Montfort 1418”, which turns out to be in the wrong place. Jones thinks that the Shroud did spend some time in the marked Montfort, but in 1358-1359, after which it moved to Anthon. However he gives no reference for this. The root of the various discussions regarding the Shroud’s movement at this time seems to be M. Bergeret’s Ohio Conference paper on ‘Linceul de Turin – Le Trou Historique’ which says that the Shroud moved to Montfort in 1360 and stayed there till 1389, and Dorothy Crispino’s ‘To know the Truth’ which says that it may have moved directly to Anthon in 1357 and stayed there till 1388. No doubt there are other variations on the theme.\nWhile the ruined Castle of Montfort is correctly illustrated, the photo of the Anthon Chateau is at Anthon, Isères, not Anthon, Haute Savoie, and is not associated with Aimon de Genève.\n\n","date":"February 17, 2015 at 8:46 am","url":"https://shroudstory.com/2015/02/17/movement-of-the-shroud-after-1355/","cat":"other_blogs","id":"comment-191269","author":"Hugh Farey","site":"shroudstory"},{"title":"Movement of the Shroud after 1355","post":"Here you can find some notes …\nSome years earlier, in that restless land, took place a process\nagainst Guichard, bishop of Troyes…\nSee also:\nThe Debate on the Trial of the Templars (1307–1314)\nJochen Burgtorf, Paul F. Crawf\nAshgate Publishing, Ltd., june 28, 2013 – 426 pages\n>Seven hundred years after the dissolution of the order, the trial of the Templars still arouses enormous controversy and speculation. In October 1307, all the brothers of the military-religious order of the Temple in France were arrested on the instructions of King Philip IV and charged with heresy and other crimes. In 1312, Pope Clement V, at the Council of Vienne, dissolved the order. …\nThe trial of Bishop Guichard was a complex case whose development can be traced from the summer of 1308 …\nFollowing the pontifical mandate of August 1308, an investigation took place\nand Guichard was suspected of “enormous crimes and sacrileges”…\nLink:\nhttp://www.sites.univ-rennes2.fr/cerhio/IMG/pdf/Dossier_Alain_Provost_-_conference_24_janvier.pdf\nSee also:\n“Domus diaboli, un évêque en procès au temps de Philippe le Bel”\nby Alain Provost\nPublished 2010 by Belin in Paris\n(written in French).\nand\n“The Templars and the Shroud of Christ”\nby Barbara Frale\n— — —\n>The charges of heresy included spitting, trampling, or urinating on the cross;\nwhile naked, being kissed obscenely by the receptor on the lips, navel, and\nbase of the spine; heresy and worship of idols; institutionalized sodomy; and\nalso accusations of contempt of the Holy Mass and denial of the sacraments.\n>Barbara Frale has suggested that these acts were intended to simulate the\nkind of humiliation and torture that a Crusader might be subjected to if captured\nby the Saracens. According to this line of reasoning, they were taught how\nto commit apostasy with the mind only and not with the heart. …\nLink:\nhttp://en.wikipedia.org/wiki/History_of_the_Knights_Templar\n— — —\nHere an interesting question:\nLe Linceul etait il à Montfort-en-Auxois (à cette époque)?\nSee also:\n“La Seigneurie de Montfort en Auxois au fil de siècles”\nMichel et Renée Paquet\nEd. Mos Forti, 2000\nat p 3 of 12 \nLinks:\nhttp://suaire-turin.fr/wp-content/uploads/2013/04/Cahier-39-3.pdf\nhttp://en.wikipedia.org/wiki/Ch%C3%A2teau_de_Montfort_(Cote-d%27Or)\nhttp://www.shroud.com/pdfs/n77part8.pdf\n          (by Hugh Duncan)\nhttp://suaire-turin.fr/wp-content/uploads/2013/01/Cahier-39.pdf\n    (= … Le Linceul était-il à Montfort en Auxois à cette époque ? Il y a\ncependant une ambigüité importante que nous ne pouvons pas résoudre formellement … ….  … … Il est vrai que la seigneurie de Montfort appartenait à la famille deCharny… )\n— — —\n… …Par mariages et successions, le château revient en dot à Jeanne de Vergy qui épouse en 1340 Geoffroy Ier de Charny. Leur petite fille Maguerite épouse en 1400 Jean de Bauffremont qui décède à la bataille d’Azincourt en 1415. C’est son neveu Pierre de Bauffremont qui hérite du château de Montfort.\nLink:\nhttp://fr.wikipedia.org/wiki/Montigny-Montfort\n\n","date":"February 17, 2015 at 8:51 am","url":"https://shroudstory.com/2015/02/17/movement-of-the-shroud-after-1355/","cat":"other_blogs","id":"comment-191270","author":"piero","site":"shroudstory"},{"title":"Movement of the Shroud after 1355","post":"Continuation of the notes:\n>Le linceul arrive à Montfort par la famille de Vergy propriétaire du château de Montfort au XVe siècle.\n>Cette famille serait entrée en possession de cette relique grâce à Othon de la Roche, croisé bourguignon de la quatrième croisade, qui l’aurait pris pendant le sac de Constantinople en 1204. L’existence de cette relique reste secrète dans cette famille jusqu’au milieu du XIVe siècle. L’arrière-petite-fille d’Othon de la Roche, Jeanne de Vergy, épouse Geoffroi de Charny en 1340.\n>Geoffroy de Charny fait le vœu d’édifier une collégiale et d’y déposer le suaire en remerciement à la Sainte-Trinité, à laquelle il attribuait la réussite de son évasion des prisons anglaises. La collégiale est achevée en 1353, Geoffroy de Charny meurt à la bataille de Poitiers (16 septembre 1356), le linceul est déposé à Lirey (Aube) en 1357 par son fils.\n>Le linceul demeure à Lirey jusqu’en 1360. À cette date, l’évêque de Troyes Henri de Poitiers interdit les ostentations, considérant que le linceul doit être faux. Jeanne de Vergy prend peur et met alors le linceul en sécurité dans son château fortifié de Montfort, il y restera 28 ans jusqu’à son décès en 1388. Son fils redonne aux chanoines de Lirey la relique en 1389. Craignant pour la conservation du linceul, pendant la guerre de Cent Ans les chanoines de Lirey, le confient en 1418 à Marguerite de Charny, petite-fille de Geoffroy de Charny qui le plaça à nouveau dans son château de Montfort. Puis il sera déplacé à Saint-Hippolyte (Doubs), un fief de son mari, Humbert de Villersexel.\nLink:\nhttp://fr.wikipedia.org/wiki/Montigny-Montfort\nI apologize to those who were familiar with these ancient stories…\n\n","date":"February 17, 2015 at 8:55 am","url":"https://shroudstory.com/2015/02/17/movement-of-the-shroud-after-1355/","cat":"other_blogs","id":"comment-191272","author":"piero","site":"shroudstory"},{"title":"Movement of the Shroud after 1355","post":"What bothers me is the lack of true connection with\nthe Forêt d’Orient (= Forest of the East) … \nHere what I have read:\n>… Quant à la forêt du Temple ( ou forêt d’Orient) , un trésor templier y serait caché… On le cherche toujours , on a envie d’y croire devant la majesté des grands arbres et la beauté de cette forêt à la biodiversité préservée\nRough translation = …As for the Forest Temple (or Orient Forest), a Templar treasure is hidden … there is always seeking, we want to believe before the majesty of the tall trees and the beauty of the forest to preserve biodiversity\nSo…\nWhere were the Templar Rites in forêt d’Orient ?…\nLink:\nhttp://nonnobisdominenonnobissednominituodagloriam.unblog.fr/page/4/\n-*-*-*-*-*-*-*-\nHere another attempt:\nNow I have found the following book:\n“Guide secret des Templiers Relié” (21 mars 2015 !!!)\nby Thierry Leroy\nLink:\nhttp://www.amazon.fr/Guide-secret-Templiers-Thierry-Leroy/dp/273736552X\nDescriptions du produit = Product Descriptions\nPrésentation de l’éditeur\n– Des sujets évocateurs : le symbolisme des Templiers, la quête du Graal, les templiers et le saint suaire, le trésor des Templiers, la forêt d Orient, le rituel secret et l admission de chevaliers, la fin des Templiers… – Des textes illustrés par une iconographie à l’ancienne et une couverture imitation cuir. \nRough Translation = presentation (Editor)\n – Evocative topics: the symbolism of the Knights Templar, the Holy Grail, the Templars and the Shroud, the treasure of the Templars, the forest of the East, the secret ritual and admission of knights, the end of the Templars … – The texts illustrated by an iconography antique and imitation leather cover\n— —\nBiographie de l’auteur\nHistorien, doctorant en histoire médiévale à l’université de Reims, Thierry Leroy consacre son travail aux Templiers depuis 30 ans. Il est l auteur de plusieurs livres et articles sur le sujet, notamment la première biographie consacrée à Hugues de Payns, fondateur de l’ordre des Templiers, ainsi que les deux romans : Les croix sanglantes, une enquête de Gondemar le Templier (Pygmalion, 2011) et le Templier et le\ngrand secret (Pygmalion, 2014). \nRough translation = About the Author\n Historian, PhD student in medieval history at the University of Reims, Thierry Leroy dedicated his work to the Knights Templar for 30 years. He is the author of several books and articles on the subject, including the first biography of Hugh of Payens, founder of the Knights Templar, as well as two novels: The bloody cross, a survey Gondemar Templar (Pygmalion, 2011) and the Templar and the great secret (Pygmalion, 2014).\n— — —\nBut now I have not more time…\n\n","date":"February 17, 2015 at 9:15 am","url":"https://shroudstory.com/2015/02/17/movement-of-the-shroud-after-1355/","cat":"other_blogs","id":"comment-191274","author":"piero","site":"shroudstory"},{"title":"Movement of the Shroud after 1355","post":"Thierry Leroy  \nLink:\nhttp://www.baglis.tv/intervenants/1999-thierry-leroy\nThierry Leroy est enseignant et historien des Templiers, Titulaire d’un Master en histoire médiévale à l’Université de Reims portant sur Hugues de Payns (le fondateur de l’Ordre des Templiers), il prépare actuellement une thèse sur l’implantation des Templiers en Champagne.\nMembre de la Société Académique de l’Aube, il est également président de la Fondation Hugues de Payns.\nIl est l’auteur de “Hugues de Payns, fondateur de l’Ordre du Temple” (éd. La Maison du Boulanger, 2001) qui a reçu le Prix des Arts et Belles lettres de la Société Académique de l’Aube en 2000 et les “Templiers : Légendes et histoire” (Imago, 2007) qui a reçu le Prix littéraire du Conseil Général en 2007.\nRough translation:\n>Thierry Leroy Thierry Leroy is a teacher and historian of the Templars, holds a Master in medieval history at the University of Reims on Hugues de Payens (the founder of the Knights Templar), he is currently writing a thesis on the implementation Templar in Champagne.\n> Member of the Academic Society of the Dawn, he is also Chairman of the Fondation Hugues de Payens.\n> He is the author of “Hugues de Payens, founder of the Order of the Temple” (ed. La Maison du Boulanger, 2001), which received the Award of Arts and Belles Lettres of the Academic Society of Dawn in 2000 and the “Templar Legends and History” (Imago, 2007) which received the Literary Award of the General Council in 2007.\n—- —-\nHere another link:\nhttp://www.huguesdepayns.fr/\n\n","date":"February 18, 2015 at 9:59 am","url":"https://shroudstory.com/2015/02/17/movement-of-the-shroud-after-1355/","cat":"other_blogs","id":"comment-191333","author":"piero","site":"shroudstory"}]
