[{"title":"No Closer to the Truth Because of Simony","post":"Sometimes scientists are too full of themselves and disparage science and the object.\n\n","date":"October 9, 2015 at 8:43 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212129","author":"Dcn Andy","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"How is this “simony”?  Please, DaveB look up a word that you don’t know before you use it.  If they are so desperate for $, why didn’t the Turin custodian and other clergy protest the C14 results?  They just accepted it and rolled over and went back to sleep.  They could have at least wondered out loud, why is a linen from 1260-1390 shown in a book from the late 1100’s?  Time travelling aliens?\n\n","date":"October 9, 2015 at 9:43 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212135","author":"Jim Giordano","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"I think insulting the Church by using the word “simony” only make matters worse. It must not be forgotten that the Oxford scholar who left the blog reminded Christians that they have duties. It must also be remembered that there are, yes, millions of Christians, Protestants, who lead good Christian lives and do not need the Shroud, not part of the deposit of faith in the Catholic Church, or any other relic as a prop for their faith.\nWe will probably all be gone by the time the Church makes a decision. It moves slowly and has its hands tied for a number of reasons.\n\n","date":"October 9, 2015 at 10:15 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212137","author":"Louis","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"I don’t think that between expositions, the Shroud is much of a money spinner. When I visited the Shroud museum in Turin I was the only person there and I was fussed over by the custodian who even unlocked the adjoining the chapel to show me the copy of the Shroud they had been given for storing it there after the fire.\nI had a local guide for my study group ( of baroque Turin) and wondered what she would say about the Shroud- nothing much other than that she thought it had come from Constantinople- certainly nothing for or against authenticity. There is a full size copy on show in the church of St.Lawrence next to the royal palace and cathedral but that, and the Museum, which is some distance from the centre, is about it.\nCompare this with the continuing hysteria about Padre Pio, particularly in the south of Italy.He is everywhere, statues, shrines,etc.\n\n","date":"October 9, 2015 at 10:56 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212140","author":"Charles Freeman","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"Yes when I visited museum There were only 4 or 5 people.\n\n","date":"October 9, 2015 at 3:38 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212154","author":"Sampath Fernando","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"“Simony:  … the practice, now usually regarded as a sin, of buying or selling spiritual or Church benefits, such as pardons, relics etc or preferments.  [C13 … Late Latin from the name of Simon Magus]”  Collins. \nSo I suppose that Jim Gordiano is strictly correct.  My use of the word was I guess metaphorical to make a point.  As others have indicated, the Church itself, and it seems even the museum there gain little financially from the presence of the Shroud in Turin.  However 2 million pilgrims attended the 67 day 2015 exposition.  They had to be accommodated, transported, fed, even entertained, and they would want souvenirs.  So I see some commercial interest in maintaining the enigma of the mystery.  Does this create a pressure on Church authorities to maintain the mystery?  Of course, I don’t know, quite probably not.  But does it create a suspicion?  I think it might.  \nThe 1978 STURP investigation, together with Ian Wilson’s first book on the Shroud soon after, created an intense interest in the Shroud throughout the English speaking world.  The 1988 radiocarbon testing then created a doubt, and possibly a fear that it was not what it seemed at all.  It would be desirable to resolve the doubt. \nThe truth about the Shroud needs to be known.  But there is obviously a reluctance on the part of the authorities to allow further testing.  What is the reason?  Dissensions among the science professionals has been cited, or else “The Church moves slowly”, or else “It is not essential to Faith”.  All seem lame excuses.  it can and ought to be professionally and competently done, and the sooner it is resolved, the better.\n\n","date":"October 9, 2015 at 2:37 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212149","author":"daveb of wellington nz","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"Do we have any direct communication or statement from Turin about future testing?   Is anyone really asking, officially to test it again, who? It always seems like it is some unnamed entity that is proposing new tests or rejecting any new tests. IMHO there is enough STRUP and circumstancial evidence (like the Hungarian prayer codex)  to convince any disinterested party that it is authentic.\n\n","date":"October 9, 2015 at 3:18 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212153","author":"Jim Giordano","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"I’ve read so many accounts about the mysterious Shroud of Turin, and the last time fibers were taken and tested, showed the Shroud to have existed since the Middle Ages. Well, that was proven to be correct, however, the fibers were taken from a patch that the Poor Clares Nuns had put on the cloth after it was in a fire in France. If fibers were taken from other areas, I’m sure they would have shown the lined cloth dates back to the time of Jesus. The other question that arises, is “How do we know it belonged to Jesus and not to another person who was also executed by crucifixion. The only answer I have is that He was mocked as “King of the Jews” and was given a cap of thorns. This shows on the shroud as the bleeding in the head area. I doubt if others were also called “King of the Jews” and crowned with thorns. When you boil it down, it’s a matter of faith. Faith, being belief in something in spite of all the nay-sayers. Am I a believer? Absolutely, without doubt, I believe the Shroud of Turin to be the burial cloth of Jesus.\n\n","date":"October 9, 2015 at 3:03 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212151","author":"rosaliegiansante","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"…the STURP results should be the starting point…\n————\nThe starting point should be the radiocarbon done in 1988, when no STURP member was involved. If new studies should be done, they should be conducted as far as possible from the STURP approach. The STURP members payed most of their campaign of research by themselves. I am not sure that someone did actually receive a salary. In this way, one does not select the best scientists, but just those who strongly believe in the “mystery”. People who finance the research should be distinct from the scientists actually operating. A committee should raise the money. Conflicts of interest should be avoided as much as possible. The committee should select scientists who can present a scientifically sound research project, possibly not anymore regarding datation (since this is one of the few sure aspect). This project should be evaluated together with the scientist CV (expertise, education, scientific achievements etc). Radiocarbon can be repeated since it will not require much material as the one in 1988, and the new analysis can restrict the data range. Actually, the idea of Rogers to perform it on the charred material is a good one. Except from C14, I believe that the analysis should be decided by the scientists, not the people raising the money.\n\n","date":"October 9, 2015 at 4:21 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212159","author":"Marco Bella","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"The STURP members payed most of their campaign of research by themselves. I am not sure that someone did actually receive a salary. In this way, one does not select the best scientists, but just those who strongly believe in the “mystery”. People who finance the research should be distinct from the scientists actually operating.\n1. Who pays Garlaschelli and you?\n2. Get out of there.\n\n","date":"October 9, 2015 at 4:38 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212163","author":"O.K.","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"Hi Marco, do you know that the results you have analysed is only from a grab sample and not a representative sample from the shroud. How do you justified your results and tell the world that you are the best scientist. Don’t bark like a mad dog.\n\n","date":"October 9, 2015 at 4:48 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212164","author":"Sampath Fernando","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"Most of the STURP team were atheists and agnostics.  Barry and Alder were Jews.  I think only John Jackson was a believer (obviously, since you can see his pectoral cross in pictures and vids of the STURP analysis). So don’t think STURP was a whitewash or Kinghts of Columbus meeting.  A totally new group is fine, of course, and preferable too, the more eyes and minds the better.  Maybe two or three separate groups (American/Canadian, British, Continental European, what the heck, how about a couple of teams from Asia too).  Anyways, before they even get a look at the Shroud they should have to read everything, EVERYTHING STURP and any other team discovered, read all the criticisims, develop their plans and publish them, to expose them to the world for further suggestions, etc., so that the final plans will make a definitive, unassailable finding – unless they uncover some other ‘mysterious’ qualities.  Well, that is what science loves the most.\nAnyways, if the C14 teams had looked at the results and suggestions of STURP, they wouldn’t have picked the worst place in the world for a sample.\n\n","date":"October 9, 2015 at 6:04 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212173","author":"Jim Giordano","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"Not that it really matters, but I understand that Gonnella made a survey of STURP team members’  religious beliefs. I think that only few were atheists. Rogers should have been listed as episcopal and some as “fundamentalist”. \nAs said before, this is not really relevant.\nScientists should be chosen only on the basis of \n1) Scientific Reputation (CV)\n2) Research Project.\nThat it is how you get reliable results. Religion an nationality should be not taken into account. This is the way science is supported all over the world and I do not see why the study of the Shroud should be an exception.\n\n","date":"October 10, 2015 at 1:40 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212204","author":"Marco Bella","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"I objected to “those who strongly believe in the “mystery” ” because it sounded like you thought STURP was the Shroud fan club.  From Barrie Schwortz:  they thought they’d get to Turin, take pictures of the brush strokes and be done in 5 minutes.  And he gave the impression that most were agnostic.  Maybe the survey of the participants beliefs was done AFTER their investigations, as I heard there was a number of conversions. (again from Schwortz or possibly the documentary Unwrapping the Shroud (?) -Rev. Kim Dreisbach was in it, great voice, thought he was Catholic priest (really protestant clergy should get their own uniforms, avoids the embarrassing “oh, no, I’m not a priest” when I come up and say “Hi Father”).  Rest in peace Rev.- especially peaceful since you know the ‘secret of the Shroud”.\n\n","date":"October 10, 2015 at 2:08 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212206","author":"Jim Giordano","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"Actually, Jim, the Rev. Albert Dreisbach is an Episcopal PRIEST. Actually, all ordained Anglican clergy (the Episcopal Church in the United States is part of the Anglican Communion) are part of the  threefold order of bishops, priests and deacons. Their vocational attire, when not in vestments, for both male and female deacons, priests and bishops is pretty much the same, a shirt or blouse with a clerical collar, either the full band collar or the tab collar. The shirt is usually black but may be other colors. Bishops frequently wear magenta or purple shirts.  It is perfectly acceptable to call an Episcopal priest father. In fact, Fr. Dreisbach, Fr. Kim, or just Father are preferred but not mandatory forms of address. Most women priest prefer to be addressed as Mother but a few prefer the title Father, which is perfectly acceptable. Deacons who wear the same attire are not addressed by Father. Bishops may be addressed as Father, Bishop (generally preferred) your Excellency, your Grace, etc. \nAccording to Wikipedia: “Today the term “priest” is used in Catholicism, Eastern Orthodoxy, Anglicanism, Oriental Orthodoxy, The Church of the East, and some branches of Lutheranism to refer to those who have been ordained to a ministerial position through receiving the sacrament of Holy Orders, although “presbyter” is also used.[16] Since the Protestant Reformation, non-sacramental denominations are more likely to use the term “elder” to refer to their pastors.”\n\n","date":"October 10, 2015 at 10:01 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212234","author":"Dan","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"“Anyways, if the C14 teams had looked at the results and suggestions of STURP, they wouldn’t have picked the worst place in the world for a sample.”\nThe C14 teams knew the STuRP investigations very well. They did not choose the sample site.\n\n","date":"October 10, 2015 at 6:02 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212219","author":"Hugh Farey","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"I would love to follow a new scientific investigation into the Shroud, and I think its very important that there is one to confirm a lot of the data we have, and to gather new data as well. \nI’m confident that if there was another in-depth investigation that it would be very positive for authenticity just like STRP was, but the church doesn’t seem to want to do it. The truth needs to be figured out no matter what it is. If it is authentic it will have a huge impact throughout academia especially New Testament scholarship.\n\n","date":"October 9, 2015 at 6:29 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212174","author":"Matthew L.","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"For anyone so-minded as to pursue a new scientific investigation of the Shroud of Turin, they need to know the formidable obstacles to be overcome.  A good starting point would be  to read the John Klotz’ book “The Coming of the Quantum Christ and the Apocalypse of Selfishness”.  John has described in considerable detail how the 1978 STURP team was set up, the planning, the recruitment, the obstacles, the importance of personal contacts, setting of the objectives, the logistics and so on.  None of it would have been possible without raising the funds, from memory, some $US 2 million (1978), and it would be much more than this now.  It requires dedication, determination, vision and a special kind of leadership, of the kind as then provided by John Jackson.  They were extremely lucky with the personal contacts provided by Fr Peter Rinaldi, who was able to smooth out many of the difficulties they encountered.  It took some two years of planning, and there was no assurance of any kind of access or success until right up to the last.  Barrie Schwortz’s photographic record on shroud.com shows a few of the difficulties that had to be overcome.    It is now nearly some 40 years later, and the situation is now quite different, which means a lot of preliminary work and investigation is required, before such a project can once again bemounted.  Hope, persistency, vision and determination are all essential ingredients.\n\n","date":"October 9, 2015 at 11:02 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212191","author":"daveb of wellington nz","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"I think you found the biggest issue stopping new tests: the lack of a sponsor with deep pockets.\n\n","date":"October 9, 2015 at 11:21 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212195","author":"Jim Giordano","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"Most of the scientists, if not all, received no payment, it was all voluntary, about 30 of them, nearly all from the USA.  I think the major costs were probably in transport, logistics,  air fares, accommodation, equipment purchase, possibly some lab tests.  In John’s chapter 7 he states that as at September 2, 1978: “Over the summer, through the efforts of D’Mulhaha and others they had acquired by gift or loan $2.5 million dollars of advanced, state of art (for 1978) analytical\nequipment and devices that would have to be shipped to Turin.”  It would seem that the project incidental costs I mentioned, would have been in addition to this.  It was done then.  It ought to be able to be done now!\n\n","date":"October 10, 2015 at 2:45 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212208","author":"daveb of wellington nz","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"Are we confident with the technology we have today, will tell us with absolute 100% certainty that the shroud is either real or not?\n\n","date":"October 10, 2015 at 8:49 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212231","author":"Donn","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"Some two non-invasive tests will do.\n\n","date":"October 10, 2015 at 1:46 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212241","author":"Louis","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"I quite agree with daveb. Highest costs in the STURP examination of 1978 should have probably been logistic and instrumentation. However, today we can get much more information with a fraction of that money. Just imagine how computers and cell phones (!!) looked in the eighties. A smartphone of today probably cost much less of the biggest computer available at that time and it is much more powerful. The same is true for scientific apparatus. \nThe mass spectrometer reported in Rogers’ papers was at that time a state-of-the-art apparatus, but today it is a technological fossil. With tiny amounts of sample a lot of questions can be answered. \nWhat is really needed is few reliable people who collect the samples and distribute to the selected laboratories. I believe that it should be relatively easy to find private sponsors and we are not looking to huge amounts.\nReal issues for new tests are not scientific, technological or financial, but human (get permission from Vatican; select trustable scientists; avoid “McCrone”-like cases, in which someone that says something “undesired” is out of the project, and so on).\n\n","date":"October 10, 2015 at 12:45 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212238","author":"Marco Bella","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"The equipment and technology are much more advanced now than they were in 1978, and it’s now much less expensive.  The human problems of access and diplomacy remain.  Anyone so minded to mount a new investigation needs to study the history of STURP, to see how it developed and the problems they encountered.  A friend at court is essential to pave the way.  There are nationalistic and guardianship issues to be overcome, all with their own perspectives.  It’s not just a matter of Science;  scientists often seem to be focused on their own particular discipline, sometimes are not street-wise, whereas more of a project type of mentality is required.  A further complicating issue is the 2002 restoration, when a lot of debris data was removed, supposedly stored and catalogued “somewhere in Turin”.  Access to this material is also required for completeness.  STURP was two years in the preliminary planning, but I seem to be repeating myself.  It will not be easy.\n\n","date":"October 10, 2015 at 1:33 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212240","author":"daveb of wellington nz","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"It is hard to believe that the authentication of the Shroud will change that many minds. It will give hope to those who want to know if there is survival after death, although it will not them if they will go to heaven or hell. As for the rest, we are led to human nature, and, as explained by Jesus:\n  Luke 16:19–31, New International Version:\n“19“There was a rich man who was dressed in purple and fine linen and lived in luxury every day. 20At his gate was laid a beggar named Lazarus, covered with sores 21and longing to eat what fell from the rich man’s table. Even the dogs came and licked his sores.\n22“The time came when the beggar died and the angels carried him to Abraham’s side. The rich man also died and was buried. 23In Hades, where he was in torment, he looked up and saw Abraham far away, with Lazarus by his side. 24So he called to him, ‘Father Abraham, have pity on me and send Lazarus to dip the tip of his finger in water and cool my tongue, because I am in agony in this fire.’\n25“But Abraham replied, ‘Son, remember that in your lifetime you received your good things, while Lazarus received bad things, but now he is comforted here and you are in agony. 26And besides all this, between us and you a great chasm has been set in place, so that those who want to go from here to you cannot, nor can anyone cross over from there to us.’\n27“He answered, ‘Then I beg you, father, send Lazarus to my family, 28for I have five brothers. Let him warn them, so that they will not also come to this place of torment.’\n29“Abraham replied, ‘They have Moses and the Prophets; let them listen to them.’\n30“‘No, father Abraham,’ he said, ‘but if someone from the dead goes to them, they will repent.’\n31“He said to him, ‘If they do not listen to Moses and the Prophets, they will not be convinced even if someone rises from the dead.’”\nPeople tend to be practical in life, sweeping under the carpet what is inconvenient, even in Christian societies:\n http://www.catholicherald.co.uk/news/2015/10/06/syrian-archbishop-criticises-us-for-siding-with-al-qaeda/\n\n","date":"October 10, 2015 at 5:53 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212247","author":"Louis","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"I continue to be mystified by Louis’ repetitions of  indifference to the question of authentication.  The question of what might be our eternal destiny, I prefer to leave in God’s hands.  \nThe parable Louis recites above demonstrates Jesus’ concern for the poor and marginalised and our misuse of wealth, and echoed in this last Sunday’s Gospel of the rich young man unable to accept the invitation to “Sell all he had, give to the poor and come, follow me.”  It is more specifically set out in Matthew 25:31-46, placing a direct obligation on us to practice the corporal works of mercy, the essence of true religion according to the epistle attributed to James, also read out in recent weeks.  \nThis is the message of true evangelisation and the message that needs to be preached, a care for the poor and marginalised.  Surely an authentication of the Shroud would create a most powerful weapon in the armory of this evangelisation.  What Jesus had to say must then be seen by many to have been a lot more important than perhaps we had appreciated, notwithstanding any alleged indifference to Moses and the prophets.  \nIf the Shroud should prove not to be his authentic burial cloth, then little is lost thereby and it reverts to a mysterious icon, an object for meditation that echoes the gospel narrative of the crucifixion, and the sufferings he bore.  Those who have relied on it as a prop for their faith will be disappointed, and they will have to find some other basis to support the rationality of their faith, which I would hope might not be too difficult for them.  \nHowever I believe the Shroud was created for a holy purpose, and its authentication would underline that purpose.  Nevertheless, despite any further scientific testing that might or might not be carried out, it would not surprise me if it still remained an enigma.  He seems to have a habit of hiding Himself in riddles and only dropping hints, perhaps an expression of His divine mercy in allowing us the freedom to choose.\n\n","date":"October 10, 2015 at 10:13 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212258","author":"daveb of wellington nz","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"I concur a 1000% with what you said, and love that you mentioned Matthew 25:31, one of the many verses that some so-called bible-believing, faith-alone types never seem to come across.\nIf it proves authentic, that only means it’s a 1st century burial cloth, probably of Jesus, as who else was treated in such a way.  But the atheists will make up something, like, a lot of political prisoners would have been treated this way, or it doesn’t matter, as it doesn’t prove He rose from the dead.  If it’s not authentic, it’s still an incredible gospel of its own, but the trolls will go into over-drive, in the media and internet, or even at the water cooler.\nWe shouldn’t get too excited about further tests.  Positive results won’t heal the splits in Christianity – imagine the evangelizing power of only one united message of Christ, instead of many competing versions, a lot of which are ‘lite’ and false, misleading versions.  It would be better, if we want tangible proof of His existence, to feel His presence, to “keep watch with [Him] for one hour” in Eucharistic Adoration for the intention of Christian unity.\nThanks for listening to my soap-box, but it was divine inspiration and hard to resist.\n\n","date":"October 11, 2015 at 12:29 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212260","author":"Jim Giordano","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"jim and daveb..I could not have said it better….best posts I’ve seen in a while\n\n","date":"October 11, 2015 at 12:14 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212300","author":"rick","site":"shroudstory"},{"title":"No Closer to the Truth Because of Simony","post":"According to Gospel of Hebrews (not in the Christian Holy Bible) “And when the Lord had given Linen cloth to the servant of the Priest, he went to James and appeared to him” \nGospel of Hebrews was written in First half of the second century. Why did the author mentioned about the Linen Cloth? Why Cannonical Gospels did not mentioned about it?\nWhy can’t we assume that the Linen Cloth mentioned in the Gospel of Hebrews as The Shroud of Turin. \nWe know that Scientised used a grab sample (from the most contaminated place) to do the Carbon Dating Test. As such we can’t accept those results.\nNo one knows how the is image was formed on Shroud of Turin. Until some one tell the world how that image was formed we have to assme that Shroud of Turin and the Linen cloth mentioned in the Gospel of Hebrews as the same one.\n\n","date":"October 11, 2015 at 9:05 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","id":"comment-212326","author":"Sampath Fernando","site":"shroudstory"}]
