[{"title":"Now we are cooking with Sciencebod","post":"As I have said previously Dan I am not at all happy with either the tone or content of some of the responses I have received on your site. I do not like being used as an Aunt Sally by true believers either here – or on other “single issue” sites which I happen upon in pursuing my SCIENTIFIC interests.\nSo I shall simply say this: using Ehrllch’s reagent (diazotised sulphanilic acid) in the Van den Bergh reaction is OK if one is using it on fresh blood, where bilirubin, if present gives a purple colour. But adding it to a highly aged and degraded sample of dried blood and reporting a positive response simply  “by eye”,  without reporting or referring to any numerical /spectral /chromatographic data to characterise the chromophore as having come from bilirubin is frankly Mickey Mouse science.\nHad I been given the sample, I would have tried dissolving ii first, and then performing a Folch- type lipid extraction with chloroform/methanol/water at approx neutral or slightly acidic pH, when I would expect bilirubin to partitiion into the lower organic phase. I would then have attempted to isolate the bilirubin, e.g. by thin layer chromatography, and then used GLC-mass spectrometry of the volatile methyl or TMS derivatives, as described in my 1972 paper against similarly derivatised authentic bilirubin standards. \nAs for the suggestion that bilirubin could contribute to an unusual red colour of dried blood, words fail me. Yes, bilirubin is orange, but its colour would be masked by haemoglobin in whole or dried blood. Yes, bilirubin levels in blood may be raised as a result of physical trauma, e.g. heel-strike injury causing mild haemolysis in runners, but the idea that an alleged elevated level of bilirubin (not proven, far  less quantified) has anything to say about crucifixion trauma is frankly laughable. More Mickey Mouse science.\nAs indicated earlier, bilirubin is prone to both bleaching and/or photooxidation on storage, exposure to light etc. There are numerous mechanisms involving photoisomerism, addition of singlet oxygen etc etc. Those who work with bilrubin on a regular basis avoid exposing it to light and oxygen. Goodness knows what gave a “positive” Ehrich’s test on Shroud blood, but I doubt strongly that it was bilirubin.\n\n","date":"January 10, 2012 at 7:04 am","url":"https://shroudstory.com/2012/01/10/now-we-are-cooking-with-sciencebod/","cat":"other_blogs","id":"comment-6763","author":"sciencebod","site":"shroudstory"},{"title":"Now we are cooking with Sciencebod","post":"The ENEA Report (translated by Google and hence the strange English style) has an explanation for the too red color of the Shroud blood:\n“The UV and VUV light colored linen that is compatible with the absence of staining in the blood stains of the Shroud (hemoglobin in thin blood absorbs UV and VUV light) and the second some scholars [46] UV light may be responsible for another very unique feature of Shroud, the red spots of blood after so much time of their deposition.” (p.22).\nThe reference is to: 46. C. Goldoni: “The Shroud of Turin and the bilirubin blood stains” Atti dell’International Conference on The Shroud of Turin: Perspectives on a Multifaceted Enigma, edito da G. Fanti (Edizioni Libreria Progetto Padova 2009) pp. 442-445. http://www.ohioshroudconference.com/papers/p04.pdf\nIn that paper, which was translated from Italian and difficult to follow, Goldoni (a Doctor of Medicine and Clinical Pathologist) states:\n“Coming back to the Shroud it is important to note that the bright-red colour of blood, visible on the cloth, is connected with an exposure to ultraviolet rays. This last result was in agreement with many previous observations. … However, the following irradiation in the UV-next showed, after exposure of only 30 minutes, a sharp change towards the bright red colour regardless the bilirubin excess in each samples (Fig. 2)” (pp.3,5).\nAs it happens, last night I re-read physicist John Jackson’s 1991, “An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image” and in it Jackson presciently (20+ years ago) attributed the Shroud’s image to ultraviolet light emitted from the body:\n“Chemical Nature of the Image. Electromagnetic radiation that is absorbed strongly in air consists of photons in the ultraviolet or soft x-ray region. It happens that these photons are also sufficiently energetic to photochemically modify cellulose. Such photons are strongly absorbed in cellulose over fibril-like distances. Experiments performed by the author have shown that subsequent aging in an oven of photosensitized (bleached) cloth by shortwave ultraviolet radiation produces a yellow-browned pattern like the Shroud body image composed of chemically altered cellulose. Thus, I posit that radiation from the body initially photosensitized the body image onto the Shroud. This pattern would have appeared, if the radiation was ultraviolet, as a white (bleached) image on a less white cloth. With time, natural aging would have reversed the relative shading of the image to its presently observed state where it appears darker than the surrounding cloth (which also aged or darkened with time, but not as fast). This mechanism is consistent with (1) the observed lack of pyrolytic products in microchemical studies of Shroud fibrils expected from high-temperature cellulose degradation (in this case image coloring occurs by natural aging at ambient temperatures over a long period of time) and (2) the absence of substances in the image areas that chemically colored the cloth (Note that image coloration is produced onto the cloth only by radiation and without any extraneous chemicals).” (Jackson, J.P., “An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image,” in Berard, A., ed., “History, Science, Theology and the Shroud,” Symposium Proceedings, St. Louis Missouri, June 22-23, 1991, The Man in the Shroud Committee of Amarillo, Texas: Amarillo TX, 1991, p.341. Emphasis original). \nAnd what’s more, Jackson had proposed that the Shroud’s blood was also photochemically modified:\n“Photochemical Modification of the Shroud Blood. Given that the assumed radiation stimulus induced a chemical change in the cellulose of the Shroud, which we refer to generically as the `body image,’ it is reasonable to ask if analogous chemical changes might also have been induced in the blood which remained attached to the Shroud during the hypothesized collapse.” (Jackson, 1991, p.343. Emphasis original).\n\n","date":"January 10, 2012 at 8:38 am","url":"https://shroudstory.com/2012/01/10/now-we-are-cooking-with-sciencebod/","cat":"other_blogs","id":"comment-6764","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Now we are cooking with Sciencebod","post":"I have now posted to my blog, with permission, John P. Jackson, “An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image” (1991) .\n\n","date":"January 18, 2012 at 11:53 am","url":"https://shroudstory.com/2012/01/10/now-we-are-cooking-with-sciencebod/","cat":"other_blogs","id":"comment-7135","author":"Stephen E. Jones","site":"shroudstory"}]
