[{"title":"Of Pro-Authenticists and Anti-Authenticists","post":"Stephen’s time would be better spent collecting evidence to support his theory than shadowboxing with you. I hope the Holy Spirit doesn’t mind me saying that.\n\n","date":"April 24, 2014 at 9:52 am","url":"https://shroudstory.com/2014/04/24/of-pro-authenticists-and-anti-authenticists/","cat":"other_blogs","id":"comment-103221","author":"David Goulet","site":"shroudstory"},{"title":"Of Pro-Authenticists and Anti-Authenticists","post":"Something is wrong here. This is an unjust accusation levelled at Dan and shroudstory. It becomes even more obvious when some Shroud websites and publications are taken into account. Yes, Shroudstory has sometimes reported some controversial papers,but it always followed by the blogmaster’s comments, he is not asking anyone to swallow anything, and that is the difference.\n\n","date":"April 24, 2014 at 10:46 am","url":"https://shroudstory.com/2014/04/24/of-pro-authenticists-and-anti-authenticists/","cat":"other_blogs","id":"comment-103239","author":"Louis","site":"shroudstory"},{"title":"Of Pro-Authenticists and Anti-Authenticists","post":"I am puzzled about the strange fact that happened in Italy.\nHere the title :\n“Man crushed by giant John Paul II crucifix in Italy.\nThe cross fell during a ceremony and killed the young man on the spot” … \nHere the details :\n>An Italian man was crushed to death on Wednesday,\nApril 23, by a giant crucifix honoring John Paul II that\ncollapsed during a ceremony ahead of the late pope’s canonization.\n>A piece of the 30-meter (98-foot) high wooden cross\nfell during the event near an Alpine village, killing the\nyoung man on the spot, Italian media reported.\n>The Jesus Christ statue on the cross is six meters\nhigh and weighs 600 kg and the crucifix was curved\nand fixed to the ground with cables, the reports said.\n>The victim’s age was given at 20 or 21 years old.\n>The cross was designed by sculptor Enrico Job\nand was created for John Paul II’s visit to Brescia\nin the Lombardy region in northern Italy in 1998.\n>It was taken down, held in storage and then\ninstalled in a picturesque spot near the village of Cevo in 2005.\n>The unusual shape of the crucifix was intended\nto represent the scars of World War II.\nLink :\nhttp://www.rappler.com/world/regions/europe/56318-man-crushed-giant-john-paul-ii-crucifix-italy?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+rappler+%28Rappler%29\n—- —-\nIn my opinion we have to improve our knowledges\nin the field of Structural Mechanics because applying the\nmethod of “AFM three-point bending test” we can obtain\nsome interesting informations (eleasticity modulus = Young’s modulus …)\nabout linen fibrils …\nand then we can change our own minds\nbased on evidence (= see also : the scientific truth\nobtained from the experiments).\nWe have a lot of work to do …\nI want to see open-minded discussion\nabout that new “mechanical dating”\n(based on AFM tests, see also : the question of indentation\n= a nano-damaging technique …).\nIs that another controversial dating ?\n\n","date":"April 24, 2014 at 12:26 pm","url":"https://shroudstory.com/2014/04/24/of-pro-authenticists-and-anti-authenticists/","cat":"other_blogs","id":"comment-103273","author":"Piero","site":"shroudstory"}]
