[{"title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin","post":"Interesting. Once again it focuses on image formation, so let’s forget 2 min about image formation.\nHas anyone reproduced blood stains pattern ?\nTake the last mediatic attempt to reproduce the shroud, namely Luigi Garlaschelli’s. What did he naively say to thibault about blood stains ?\n“I have absolutely not tackled the problem of blood stains (…)”\nHas anyone reproduced blood stains ? macroscopically ? microscopically ?\nHas anyone studied such pathological blood thanks to thromboelastography ?\nWas the strain used to remove flax fibers percisely measured ?\nIs it close to the strength of a blood clot ?\nWere flax fibers broken when the corpse was removed from the shroud ?\nWhat do we know about mechanical properties of flax fibers ?\n\n","date":"March 10, 2013 at 8:54 am","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","id":"comment-26979","author":"anoxie","site":"shroudstory"},{"title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin","post":"If you have read something … Goldoni, Lavoie\nand others worked with the blood … !\n— —\nI tried to watch under the address :\nhttp://www.practical-haemostasis.com/Miscellaneous/Miscellaneous%20Tests/teg.html\nand\nI have read the following words :\n>Thromboelastography [TE] was first described by Hartert in 1948.\n>Thromboelastography® (TEG®) and Thromboelastometry (ROTEM®) provide global information on the dynamics of clot development, stabilisation and dissolution that reflect in vivo haemostasis.\n>Although TE has not been subjected to the same evaluation processes as conventional haemostatic tests, its use as a POCT monitor in complex major surgery has been shown to significantly reduce the use of blood component therapy and overall blood loss.\nSo …\nYou have to take into account that now (on Turin Shroud) we can only\ncontrol the bloodstains (on linen) of a (presumed) deceased person.\nWhat is the meaning of that thromboelastography in a dead person ?\nIn any case …\nI want to respect the sacred blood of Jesus !\nSee also (for the blood and the cardiac muscle) : the famous Miracle of\nLanciano (and the old analyses by Dr. Linoli) !\nThe blood turned out as a true blood (of Jesus. But, until now, we have\nnot yet seen an interesting plan about the DNA analyses for the true\ncardiac muscle) !\nInstead, in my opinion, we have to control the linen fibrils using the advanced\ntools, using the SPMs (= Scanning Probe Microscopies)…\n— —\nWhy we are not yet able to  do that “very simple” operation ?\nFor example : Atomic Force Microscopy (= AFM) is a tool not only to image\nthe topography, but also provides valuable information regarding adhesion\nand surface density using force curves !\n— —\nIt is very simple to test the linen fibrils under an adequate probe in an AFM\nthree-point bending test !\nIf you have some exact knowledge in the field of Structural Mechanics you\ncan work with good gains … and you can also explore (in a non-destructive\nmanner) the biological traces.\nAm I wrong in my old ideas (= 1998) about these Secrets ?\n— —\nWhat will be the result from the controls for the Ancient Secrets of the\nBible (and then see also : the SPM controls about the papyrus of\nQumran, a more exact way to test these ancient reperts) under\nthe SPMs survey ?\n\n","date":"March 11, 2013 at 1:18 pm","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","id":"comment-27081","author":"Piero & AFM","site":"shroudstory"},{"title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin","post":"Obviously, i didn’t mean to test the blood on the shroud.\nWhat’s the point ? Quantification.\nYou must have heard about post mortem fibrinolysis, but it is still in balance with coagulation.\nPost mortem clots are weaker, but still develop.\nNow you can easily imagine that if coagulation/fibrinolysis of normal blood and pathological blood (it has been suggested the victim suffered disseminated intravascular coagulation) in vivo is different, post mortem coagulation/fibrinolysis will be different, clots properties will be different, kinetics of clots formation will be different, shape of bloodstains will be different.\n\n","date":"March 11, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","id":"comment-27096","author":"anoxie","site":"shroudstory"},{"title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin","post":"Excellent questions.\n\n","date":"March 10, 2013 at 10:23 am","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","id":"comment-26987","author":"John Klotz","site":"shroudstory"},{"title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin","post":"Lanciano Miracle: There are several discussions on the “Catholic Answers” web-site.  I get the impression that most of the investigative work was carried out by a Dr Linoli around 1970, and informed that blood was shown to be human AB, that analysis of the flesh was reported as including ventricle cells, vagus nerve etc.  Wiki has a succinct summary of the findings.  No DNA was apparently recognised.  The various discussions on the “Catholic Answers” web-site seem to be inconclusive, part of the problem apparently being that Linoli’s paper was only ever published in Italian and technical Italian is apparently notoriously difficult to translate into coherent English. The Wiki site also mentioned about five other sites in Italy, where similar miracles have said to have occurred.  Another occurrence has said to have occurred in Argentina.  I was referred to a book in our Parish library “Reason to Believe” by Ron Tesoriero (an Australian) which I can check out.  I was unable to discover if any other scientific investigation had been carried out on the Lanciano material, apart from Linoli’s work.  Does anyone know anything more, if there has been any other research into Lanciano?  \nThe comments by Anoxie & Piero contain some excellent suggestions, but are very high tech, and would probably require a highly specialised materials laboratory, probably in nano-technology to take any further.\n\n","date":"March 12, 2013 at 12:27 am","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","id":"comment-27115","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin","post":"The Miracle of Lanciano is often referenced in relation to the typing studies on the Shroud of Turin, and to a lesser extent, the Sudarium of Oviedo.  Similar to the blood types reported for the Shroud and the Sudarium, the Lanciano host is reported as being type AB.  The primary reference for the Lanciano studies is an article by Dr. Lonoli, published in Italian in Quad Sclavo Diagn. 7, n 3, 1971. (A PDF is available on the web).  It is often mentioned that subsequent studies were conducted on the Lanciano sample by the World Health Organization in 1973, although I have been unsuccessful in finding a reference or any details from these studies.  I am also unaware if any follow up studies to extend and confirm the original findings have been performed-if so, would be interested in a reference.\nIn the Lanciano typing experiments, reactivity of the sample with anti-A and anti-B antibodies is described, resulting in a designation of AB.  This situation is somewhat unique, in that unlike the Shroud, there are no “off areas”, which may be used as negative controls.  In the case of the Shroud, unstained fibers adjacent to bloodstains are suitable, built-in controls to include in the design of such experiments.  As reported for the Shroud, when unstained fibers (even those at the bed of the bloodstains) are mixed with anti-A and anti-B antibodies, no reactivity is observed.  This is important as it demonstrates that anti-A and anti-B reactivity is specific for bloodstained fibers and shows that nonspecific binding of antibodies to the cloth does not occur.  Inclusion of positive and negative controls to verify the specificity of binding is an important (essential) component of such serological studies.  \nFurther typing studies performed on Shroud fibers using monoclonal antibodies demonstrated that bloodstained fibers failed to react with anti-O specific reagents, providing a further control for antibody specificity.  This is significant as the O blood group shares the exact same core carbohydrate structure as A and B blood types.  Only the terminal sugar is different between O, A, and B blood types (see previous postings on AB typing).  Such anti-O specific reagents were not available in the past (1971) and could prove useful in the confirmation and extension of the Lanciano typing results-it would be important to demonstrate the specificity of the typing reagents that were used, i.e. does a nonspecific antibody fail to react (negative control), and do the specific antibodies (anti-A, anti-B) demonstrate selective binding (positive control).\n\n","date":"March 12, 2013 at 8:41 pm","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","id":"comment-27162","author":"Kelly Kearse","site":"shroudstory"},{"title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin","post":"First of all : the exact italian name is Linoli (Odoardo) and not Lonoli …\nMy interest is in the textile field and my old idea (1998) to control the linen fibrils\nusing the advanced the SPMs (= Scanning Probe Microscopies… and working,\nfor example :  with the three-point bending tests and also with the controls about\nthe cellulosic DP) can also be useful in the biological domain … because we\ncan study the relics in a better manner with all the adequate tools for\nSPM investigations (= Applied Structural Mechanics and Applied Nanotechnology).\nUnder the address :\nhttp://www.therealpresence.org/eucharst/mir/lanciano.html\nwe can read the following words :\n>In 1970-’71 and taken up again partly in 1981 there took place a scientific investigation by the most illustrious scientist Prof. Odoardo Linoli, eminent Professor in Anatomy and Pathological Histology and in Chemistry and Clinical Microscopy. He was assisted by Prof. Ruggero Bertelli of the University of Siena.\n>The analyses were conducted with absolute and unquestionable scientific precision and they were documented with a series of microscopic photographs.\ninstead under :\nhttp://www.zenit.org/en/articles/physician-tells-of-eucharistic-miracle-of-lanciano\nwe can read :\n>Linoli extracted parts of the relics with great care and then analyzed the remains of “miraculous flesh and blood.” He presented his findings on March 4, 1971.\n>His study confirmed that the flesh and blood were of human origin. The flesh was unequivocally cardiac tissue, and the blood was of type AB.\n>Consulted by ZENIT, Linoli explained that “as regards the flesh, I had in my hand the endocardium. Therefore, there is no doubt at all that it is cardiac tissue.”\n>In regard to the blood, the scientist emphasized that “the blood group is the same as that of the man of the holy Shroud of Turin\nIn any case the possible key to solve the enigma of Lanciano (apart the Faith)\nis the DNA analysis. But I remember that an ancient DNA can be very difficult to control …\nSo … How to see the scientific truth ?\nIn the past (in Civitavecchia, Italy) the statue of Mary was weeping tears of blood.\nPerhaps this happened because Jesus is her only Son and She wants us to follow him.\nBut (clearly) this is not a scientific explanation and we don’t know what is the scientific answer from the new intruments.\n— — —\nSorry.  I am not an expert in the field of coagulation/fibrinolysis of normal blood and pathological blood. I am only curious to know where are located the Labs interested in these particular experiments.\n— —\nI have found a vague bibliographic reference :\nS. Thalhammer, W.M. Heckl (2004) : Atomic Force Microscopy as a tool in nanobiology\nBut I don’t agree with idea to do the nano-destructions.\nSee for example the previous work :\nR. Stark, S. Thalhammer, J. Wienberg, W.M. Heckl (1998): The AFM as a tool for\nchromosomal dissection – the influence of physical parameters. Appl.Phys., A66, 579-584\n\n","date":"March 13, 2013 at 10:21 am","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","id":"comment-27199","author":"Piero & AFM","site":"shroudstory"},{"title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin","post":"Pardon for the misspelling of Linoli-appreciate the links; am familiar with the content- was hoping for a reference where the data in the follow up studies could actually be viewed, especially regarding the materials & methods-were the 1981 studies ever formally published?\n\n","date":"March 13, 2013 at 12:22 pm","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","id":"comment-27211","author":"Kelly Kearse","site":"shroudstory"},{"title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin","post":"I don’t think relics of Lanciano have anything to tell us about the shroud. Dr Linoli was so clearly influenced by pre-existing his faith in the miracle that his paper cannot be considered wholly unbiased, and the World Health Organisation report has many of the characteristics of a myth (such as its extremes of detail – 500 experiments, time – 15 months, length – 700 pages, and authority – the Chief Advisory Board, as well as the fact that no-one on the internet has actually seen it or quoted from it).\nAn English translation of Dr Linoli’s paper is extensively quoted by an (admitted sceptic) Aruman Chan, and largely appears to state that the biological remains are mouldy, dried up, shrivelled, and degraded to the extent that the cells of both flesh and blood lack nuclei. The minerals in the blood are in widely different proportions from modern human blood. But (according to Chan) Dr Linoli uses all this to conclude that this is evidence for miraculous preservation.\nThere has been no attempt to carbon date these relics, and no particular reason to suppose that they date back more than the time needed to shrivel up a piece of meat into its present state. Having done that, I dare say they might remain in that state for a very long time, but there’s no obvious evidence that they have.\nThere are five (solid) globules of blood, which are supposed to be all different sizes but exactly the same masses, according to the Miracle Rosary Mission (at http://www.miraclerosarymission.org/lanciano.html). I do not know if Dr Linoli checked that.\nBut most importantly, even if the remains are from a 1300 year old man, there is nothing about them to suggest that they derived from bread and wine.\n\n","date":"March 13, 2013 at 3:01 pm","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","id":"comment-27223","author":"Hugh Farey","site":"shroudstory"}]
