[{"title":"On Deaf Ears Here?","post":"I have read some of the highlighted article above from the Science Buzz blog.  The contents of the blog are reflective of the non-believers who have make comments in the many Shroud blogs.  It is apparent that there is one in the Universe who will do anything to dissuade people from believing that our Lord Jesus Christ was Resurrected from the dead after being physically murdered by non-believers some 2,000 years ago.  The Shroud is a scientifically provable solid piece of evidence of that Resurrection.  It is a gift from our God to us.  It is not just words written down on a parchment and recopied.  It is a part of the original fact.\n\n","date":"February 14, 2015 at 7:08 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191024","author":"ekmcmahon","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"Don’t You think that there is a certain degree of caricature in that portrait of Jesus (= the Man of the Shroud) that appears on that ancient Sheet?\nI  am referring to the anamorphisms that are present on the cloth.\nAre you able to see some degree of “anamorphic” distortion to the image?\nWhat do you think about the study (= An Artist’s Study of the Shroud Image)\nby Roger W. Basset?\nLink:\nhttp://www.shroud.com/pdfs/stlbasset1.pdf\n— — — *** — — —\nAnother question.\nHere two lines for those who believe in the C14-1988 :\nThey should at least try to do an attempt to disprove the “numismatic dating”\nby Prof. Giulio Fanti…\nAnd I want to add that this verification (about the “numismatic dating” by Fanti)\nhas nothing to do with the fact of being believers or non-believers…\n\n","date":"February 14, 2015 at 9:46 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191033","author":"piero","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"Colin’s leap of faith that the shroud is a fake – is quite a leap.  There should be an Olympic medal for the kind of leaps Colin makes.  He believes the shroud is a fake – but UFOs and All Star Wrestling is for real.\n\n","date":"February 14, 2015 at 8:26 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191030","author":"Stan Walker, MD","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"\n\n","date":"February 14, 2015 at 8:44 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191031","author":"Colin Berry","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"“… simply a feeble agenda-driven attempt to explain away the radiocarbon-dating.  No serious scholar or academic should waste a single second indulging that fantasy.” \nA serious scholar and professional scientist who accepts that an alleged scientific result cannot be gainsaid by tossing out any semblance of sampling protocols!  \n“Images imprint onto the visual cortex, a major part of the hind-brain with a minimum of pre-processing that is in any case not under conscious control. / Words on the other hand get consciously pre-processed in many subjective ways, ” \nThe evangelists wrote the gospels, Paul wrote his epistles, but it was Jesus who had the wisdom to leave an image!  \nHe’ll be back, it will continue to haunt him, he can never leave it alone, whether sweat-imprints, or scorching, or some other novel notion.\n\n","date":"February 14, 2015 at 1:52 pm","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191049","author":"daveb of wellington nz","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"\n\n","date":"February 14, 2015 at 2:09 pm","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191050","author":"Colin Berry","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"The strategy of Colin is to destroy this blog.\nSadly,\nThibault.\n\n","date":"February 14, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191060","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"\n\n","date":"February 14, 2015 at 5:20 pm","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191064","author":"Colin Berry","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"The purpose of having pictures in the comments is to support discussions about the shroud and related subjects. It is not for silly cartooning.   They will likely be deleted from now on. \n\n","date":"February 14, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191066","author":"Dan","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"One doesn’t know the difference between the photographic negative image and a painting. Other one tried to tell that the image was a scorch but he failed to prove it. Now he is using controversial Carbon Dating to support his new claim.\n\n","date":"February 15, 2015 at 4:35 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191099","author":"Sampath Fernando","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"“I’m not listening, I’m not listening” (Billy Crystal in the Princess Bride)\n\n","date":"February 15, 2015 at 8:27 pm","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191158","author":"Andy","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"In my opinion the cartooning by Colin about the attempts\n(right or wrong) to improve the knowledges about the Shroud\nhas nothing to do with the struggle of the supporters of freedom\nof speech and freedom of the press …\nAm I wrong in my boring complaint?\n— — —\nBarrie Schwortz (dismitting “Freeman’s claims”) invoked the numismatic proof\nabout the early coins (an interesting “numismatic dating” was well illustrated\nby prof. Eng. G. Fanti in her own book …) …\nSo far as I know the numismatic dating (prof. Fanti)\nhas never been denied by any paper.\nSo far so good… but some of the friends of this blog by Dan\ndo not want to hear anything about this interesting argument\nagainst the C14 1988…\n— — —\nColin,\nif You want You can play different types of bellows-blown bagpipes…\nDo you know the Angel playing bagpipes (in Edinburgh)?\nPerhaps you won The star of the Order of the Displeased,\nso I beg your pardon …\nAre we (perhaps) the poor pipers?\nI believe we can try to show something on numismatic dating\nusing examples from Roman archaeology…\nBut … Where are the numismatic experts (professional persons)\nwith an adequate set of new comparative analyses ?\n\n","date":"February 16, 2015 at 9:59 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191197","author":"Piero","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"Last week we were able to read the news about the death of Michele Ferrero:\n“Michele Ferrero dead: Nutella billionaire dies aged 89 on Valentine’s Day” \n>The world’s richest confectioner, whose Nutella spread helped raise generations and Ferrero Rocher chocolates were legendary as the choice for ambassadors, has died aged 89.\n>Michele Ferrero, who had been ill for several months, died on Valentine’s Day surrounded by his family at his home in Montecarlo. …\n>The patriarch of the Ferrero empire was said to have defined the Italian confectionary landscape. He and his family were ranked 30th on Forbes’ list of the world’s richest billionaires in 2014, said to be worth $23.4 billion.\nLink:\nhttp://www.independent.co.uk/news/people/news/michele-ferrero-dead-nutella-owner-and-italys-richest-man-dies-on-valentines-day-aged-89-10046991.html\n— —\nColin knows Nutella because he was able to do an “impactograph”. …\nI am still curious about the strange idea of “impactography”… and the\npossibility to improve the experiments about the “impactography”.\nSee also: the japanese imprint, gyotaku…\nLink:\nhttp://en.wikipedia.org/wiki/Gyotaku\nIn any case Nutella is a form of a chocolate spread.\n>Nutella is made by harvesting cocoa beans  from the cocoa tree and leaving them out  to dry for about 10 days.  They are then roasted to release the cocoa butter and  then pressed to remove all the cocoa butter. This butter is not used in the Nutella, but is taken away to be used for other chocolate products. What’s remaining  is pure cocoa, which is then crushed. Hazelnuts are then  inspected to ensure quality, and cleaned and then  roasted. Each jar of Nutella contains about 50 hazelnuts! After  they have been roasted they are added to a mixture of  the pure cocoa powder, skimmed milk, sugar.\n> This mixture is then mixed into a smooth paste that we all love  and sent for packaging\nLink:  http://www.chemistryislife.com/the-chemistry-of-nutella\n>Hazelnuts, (or Corylus avellana), are rich in Folate, an important vitamin that helps prevent megaloblastic anemia and neural tube defects in newborn babies.\n>They are also an excellent source of vitamin E, which is a powerful lipid soluble antioxidant that is required for maintaining the integrity of cell membrane and mucus membranes and skin because it protects it from harmful oxygen-free radicals.\n>Hazelnuts are also a rich source of minerals including manganese, potassium, calcium, copper, iron, magnesium, zinc, and selenium … …\nIn other words, I think Colin might well explain certain things from the perspective of medical-pharmaceutical, but he should not be so harsh towards the blog of Dan making the exchange of opinions really ridiculous … \nWith cartoons Colin could ridicule the blog by Dan,\ninstead I think that he should do the experiments,\nor improve them, and then it should show us\nthe results that he gets (and, possibly, giving us a probabilistic judgment,\nhis “probabilistic verdict”).\n\n","date":"February 16, 2015 at 10:34 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191200","author":"Piero","site":"shroudstory"},{"title":"On Deaf Ears Here?","post":"“The strategy of Colin is to destroy this blog.”\nThe only things Colin has been destroying so far, being (over)-exposed on this blog, are his own credentials.\n\n","date":"February 21, 2015 at 7:03 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","id":"comment-191475","author":"anoxie","site":"shroudstory"}]
