[{"title":"An Open Thread for Rich Savage Questions","post":"Why waste time and effort copying (badly) the questions and information here? Why not join the debate over at JREF? Where Jabba has utterly failed to show any reason why the shroud should be considered anything other than a thirteenth century fake.\n\n","date":"September 21, 2012 at 9:35 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16675","author":"Passing Stranger","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Here’s a link to Rogers’ peer reviewed paper in Thermochimica Acta – http://shroudnm.com/docs/2004-09-12-Rogers.pdf\n\n","date":"September 21, 2012 at 11:08 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16684","author":"Andy Weiss","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Thanks Andy, that’s a brilliant paper from a brilliant man.  First time I’ve seen it in full. \nBut why would anyone waste time engaging debate with close-minded cynics hiding behind a pseudonym of open-minded scepticism?  None so blind as those who will not see.  Doubtless every single contributor at JREF is capable of reproducing the Shroud image with all its properties? Hah! More likely, not a single one of them, nor anyone else for that matter! \nPassing Stranger? The devil, you mean!\n\n","date":"September 22, 2012 at 6:40 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16725","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Well said Dave!  I’ve ventured on JREF a few times and read many of the comments by these so called “open-minded” folk, and all I can say is they are FAR from being open-minded, let alone intelligent enough to attempt producing the image or even simply explaining it. They are nothing else but swelled-headed athiests. Yes they are blind, blind to the real facts, shown in thier refusing to accept any scientific results done by any of the STURP team or others, calling them biased Christians lol. Whilst at the same time they defend the science of the radiocarbon dating, as if it was irrefutable! Or use writings from the likes of Joe Nickell to defend their arguments…This just  goes to show, and quite well I would add, their total lack of intelligence, along with thier extreme bias.\nHow can you debate with that kind of mentality? Who would even bother?\nR\n\n","date":"September 22, 2012 at 7:16 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16730","author":"Ron","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Ron,\n– The ultimate goal is to get our debate in front of a neutral audience — people who haven’t made up their minds — and let them chose for themselves who is making the most sense.\n— Rich\n\n","date":"September 22, 2012 at 8:02 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16734","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Right……..\nSo why have neither Rick (who “hid behind the pseudonym” of Jabba) no any other shroudie dealt with the evidence for the medieval origin of the shroud. At JREF or elsewhere…\n\n","date":"September 27, 2012 at 10:16 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16980","author":"Passing Stranger","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"\nRichard Savage :Ron,- The ultimate goal is to get our debate in front of a neutral audience — people who haven’t made up their minds — and let them chose for themselves who is making the most sense.— Rich\nWell good luck with that.\nR\n\n","date":"September 22, 2012 at 8:29 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16736","author":"Ron","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Challenge #1:\n– Regarding the carbon dating, several claims have been made as to how the dating could be so far off if the Shroud is authentic.  I don’t think that any of those claims (explanations) “hold water.”  Let’s consider one at a time.\n– Probably the most “popular” claim is that the sample tested was actually a patch invisibly re-woven by French nuns in the 16th century.  I have several reservations to such a claim.  Let’s consider just one of those at a time…\n1.  How could such a patch get past all the experts examining the Shroud?\n– Thanks.\n— D.A. (Devil’s Advocate)\n\n","date":"September 22, 2012 at 2:14 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16752","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"– I’m leaving this reply as a reminder of a particular REASONABLE objection to Shroud authenticity raised at JREF (http://forums.randi.org/showthread.php?p=8642787#post8642787), and as a catalyst to inspire some answers.\n– Obviously, these guys don’t give any credence to the Shroud anyway — but then, they do have some reasonable objections which I hope we can answer more effectively than I have managed so far…\n— Rich\n\n","date":"September 24, 2012 at 9:39 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16854","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"There has been no chemical or physical analysis of the samples before c14 datation.\nYou can’t draw any conclusion on the nature of the samples based on Nature’s article.\nDo they have any other source ?\n\n","date":"September 24, 2012 at 10:34 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16855","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Anoxie,\n– That seems to be the only one they really depend upon.\n– Sorry that I didn’t get back to yo sooner.\n— Rich\n\nPassing Stranger :\nRight……..\nSo why have neither Rick (who “hid behind the pseudonym” of Jabba) no any other shroudie dealt with the evidence for the medieval origin of the shroud. At JREF or elsewhere…","date":"September 27, 2012 at 11:12 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16983","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Ok.\n\n","date":"September 27, 2012 at 11:58 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16987","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"¿Ha VISTO usted alguna vez el trozo de Sábana que fue cortado para la datación con el C14?\nFlury-Lemberg NO participó en la elección del trozo que fue cortado,así que DIFICILMENTE podría conocer esa zona con anterioridad.\nVea el ANTES y el DESPUES en mi blog:\nhttp://lasabanaylosescepticos.blogspot.com.es/2006/01/la-zona-de-donde-se-cort.html\n[la fotografía del ANTES es muy poco conocida, solicité a Dan que la bajara a su blog pero no lo ha hecho]\nSon fotografías de GRAN RESOLUCIÓN en las que podrá observar el GRAN DETERIORO de la parte cortada para el C14, además de constatar que fue MUCHO MAYOR que lo que indicó NATURE ( 1×7 cm).\nPuede haber REMIENDOS y cualquier cosa que a usted se le ocurra………..\nNo conocemos además que partes exactas de la muestra cortada fueron las enviadas a los laboratorios.\nCasi TODA la parte deteriorada ya no se observa DESPUÉS de cortar la muestra, y mal la pudo ver por lo tanto Flury-Lemberg.\n¡Mala elección en el corte!\nCarlos Otal\n\n","date":"September 24, 2012 at 10:51 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16857","author":"Carlos Otal","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Translated from google translate:\nHave you ever seen the piece of cloth that was cut for the C14 dating?\nFlury-Lemberg not participate in the election of the piece that was cut, so I could hardly know that area before.\nSee the before and after on my blog:\nhttp://lasabanaylosescepticos.blogspot.com.es/2006/01/la-zona-de-donde-se-cort.html\n[Photo of BEFORE is little known, I asked Dan to take it down to your blog but have not done]\nThey are high-resolution pictures you can see the dramatic deterioration in the cut for the C14, in addition to finding that was much higher than indicated NATURE (1 × 7 cm).\nThere may be patches and anything you can think of ………..\nWe know also that the exact parts cut sample were sent to laboratories.\nAlmost all the damaged part is no longer observed after cutting the sample, and badly so he could see Flury-Lemberg.\nBad choice on the court!\nCarlos Otal\n\n","date":"September 24, 2012 at 2:22 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16872","author":"ncalibey","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Carlos and ncalibey,\n– Thanks.\n– Unfortunately, the Google translation is hard to understand.  I speak a little Spanish, but not enough to help.\n– Basically, I think that Carlos is saying that the sample was a very bad choice.  I agree — but still, the experts seemed satisfied with it — and claim, or at least imply, that the sample itself was not a patch.  Certainly, there seems to be a patching involved, but the experts seem to accept that the attached patch is the real thing, and not a reweave — and, they should know.\n– Hopefully, that can be translated into Spanish well enough to make sense.\n– Below, I tried to add the images and their explanation, but could only add the explanation. Anyone wanting to see the images will have to go to Carlos’ blog at http://lasabanaylosescepticos.blogspot.com.es/2006/01/la-zona-de-donde-se-cort.html. \n— Rich\n“The top photo in b / n shows the area of the sheet before being cut strip 1cm x 7 cm and weighing 150 mg.\n“The bottom photo shows the area in color and cut.\n“The cut was much higher amount, 478.1 mg indicated the electronic balance (Mettler, model AE 166, exactness 0.1 mg) to weigh the piece Prof.Testore G.Riggi had cut from the Shroud. More than three times as agreed in the Protocol and what relates Nature, 150 mg.\n“[entire event was videotaped, except for the introduction of samples in containers made solo and Cardinal Ballestrero Dr.Tite].”\n— Rich\n\n","date":"September 25, 2012 at 11:54 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16895","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Zurich sample:\n\n¡IMPOSIBLE!\nhttp://archiv.ethlife.ethz.ch/e/articles/sciencelife/turin.html\nCarlos Otal\n\n","date":"September 25, 2012 at 3:23 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16903","author":"Carlos Otal","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Carlos,\n– Are these images from the Zurich sample?\n– Are they “official”?  That is, can we CONFIRM that they are images from the Zurich sample?  For some reason, the article doesn’t really explain what we’re looking at.\n– The different sections of the sample seem to show several different weaves — but, I don’t understand what that is supposed to indicate.  Does it just indicate that some patching had been done within the sample?  If so, shouldn’t that be enough to reject the sample, and shouldn’t the experts have noticed that problem early on?\n— Richard\nCarlos,\n– ¿Son estas imágenes de la muestra Zurich?\n– ¿Son “oficial”? Es decir, podemos CONFIMAR que se trata de imágenes de la muestra de Zurich? Por alguna razón, el artículo no explica realmente lo que estamos viendo.\n– Las distintas secciones de la muestra parecen mostrar varios tejidos diferentes – pero, no entiendo lo que se supone que indica. ¿Se acaba de indicar que algunos parches que se había hecho en la muestra? Si es así, no debe ser suficiente para que rechazar la muestra, y no se debe a los expertos han notado que problema desde el principio?\n— Ricardo\n\n","date":"September 25, 2012 at 6:31 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16910","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"You guys should really do more reading. Madam Flury-Lemburg had absolutely nothing to do with the sample location choice, two little known textile experts were brought in and it was argued over for two hours where the sample would be taken from (last minute) and not even by the experts lol. These textile experts, basically, had NO prior experience with the Shroud. Absolutely no prior technical information was actually consulted, as in STURP photographs etc. It ‘seemed’ the choice was made blind. Prof Testore/Riggi cut a much larger sample from the cloth but kept more then half for personal use/study, LOL again…..The event was video taped, but as mentioned, not all of it! Why? is the big question here. Why would you video tape most of the proceedings then go to a seperate room, with only two individuals involved, one being Mr Tite and not tape ‘extremely important’ sample packaging?…the whole thing was a FARSE!\nAs for Ms. Lemburg’s negating the patch theory; Funny how she wasn’t even aware of ‘French-Invisible-Reweaving’ methods, evidenced by her comments that all stitching would show signs on atleast one side or the other? Did she even look at the cloth through any instruments other then her own eyes? The patching or stitching was “independently observed” by atleast three independent sources, thru J.Marino and Sue Bedford’s investigations into the patching theory.\nJust to many unanswered questions, and very questionable dealings occurred during the whole C14 fiasco, if you ask me ;-)\nR\n\n","date":"September 25, 2012 at 6:34 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16911","author":"Ron","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Ron,\n– May I quote you over in the Randi forum?\n– I’d have to remove what I consider to be “inciting” words — lol, farce, fiasco.\n– I wouldn’t use your name if you didn’t want me to, but I would point out that it comes from Dan’s blog.\n— Rich\n\n","date":"September 25, 2012 at 8:32 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16915","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"No problem, but why leave out fiasco or farce? …as, it is fact ;-)\nDid you ever get around to reading those papers I mentioned a while back? Seriously Rich if your going to debate anything, you should study up extensively on the subject. These things I just mentioned, I would think would be common knowledge to anyone serious about the Shroud or Sindonology.\nRemember knowledge is power….In almost every post I read on there by your ‘opponents’, I noticed major errors. It is obvious most are not well read on the subject, but you must be, if you want to be taken seriously…and shown respect.\nR\n\n","date":"September 26, 2012 at 6:31 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16934","author":"Ron","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"I must clarify my last comment a atd, in that I meant; shown respect and taken seriously by your opponents in the debate…\nR\n\n","date":"September 26, 2012 at 8:31 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16942","author":"Ron","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"I know that a lot of people roll their eyes at the re-weave theory because of the idea of experts somehow missing it. However, Marino responded to Madame Flury-Lemburg (who claimed this herself) and explained that unless one was specifically looking for a French Invisible Re-weave they were unlikely to find it. He backed this up with multiple authorities who explained the technique and how it is difficult to spot. I can’t seem to find it on Shroud.com, but I have it on my laptop so I’ll be able to link it to you at some point.\n\n","date":"September 25, 2012 at 9:46 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16918","author":"ncalibey","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"ncalibey:\nhttp://www.shroud.com/pdfs/benfordmarino.pdf\nCarlos Otal\n\n","date":"September 25, 2012 at 10:35 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16922","author":"Carlos Otal","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Thanks, Carlos!\n\n","date":"September 26, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16957","author":"ncalibey","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Official photos do not exist.\nPero SÓLO existe tejido con ese hilado en la Sábana de Turín y en la reserva del Victoria and Albert Museum.\n-La foto de la muestra Oxford fue proporcionada por el Prof.Hedges ( Laboratorio de Oxford) a instancia de Bonnet-Eymard el 16 de noviembre de 1990. No lleva escala, fecha ni sello.\nhttp://lasabanaylosescepticos.blogspot.com.es/2006/01/oxford.html\n-La foto en color de la muestra Zurich (Z1) fue proporcionada por el Prof:.Wölffli ( Laboratorio de Zurich)  en 1988 a instancia de Bonnet-Eymard.\nhttp://lasabanaylosescepticos.blogspot.com.es/2006/01/zurich-1988-buscad-y-encontrareis.html\n-La foto en blanco/negro de la muestra Zurich (Z1) es la misma foto que la anterior en color, fue publicada en E.T.H Yearbook 4988, page 48 “Masse des Turiner Grabtuch (Zurich) 1.4 x1.8 cm. Abbildung mit mm. Masstab.”\nhttp://lasabanaylosescepticos.blogspot.com.es/2006/01/no-valen-los-milagros-para-resolverlo.html\n– El foto-montaje  http://archiv.ethlife.ethz.ch/images/turin_tuch-l.jpg publicado por E.T.H en 2005 fue realizado por el laboratorio de Zurich para la BBC. Bonnet-Eymard lo describió en 1988 viéndolo en el despacho del Prof. Wölffi.\nZ1 es la muestra  por el REVERSO (?). Se dividió en Z1.1 y Z1.2\nZ1.1 se dividió en 3 sub-muestras, Z1.1.1….Z1.1.2…..y.. Z1.1.3, sobre las que se realizó la datación por el C14.\nZ1.2 se dividió en 2 sub-muestras según “Table 1 Basic Data (individual measurements)”. Nature, Vol. 337, No. 6208, pp. 611-615, 16th February, 1989.\n( They are not in the photomontage).\n“The Zurich group first split each ultrasonically cleaned sample in half, with the treatment of the second set of samples being deferred until the radiocarbon measurements on the first set had been completed.  The first set of samples was further subdivided into three portions.  One-third received no further treatment, one-third was submitted to a weak treatment with 0.5% HCL (room temperature), 0.25% NaOH (room temperature) and again in acid, with rinsing in between.  The final third was given a strong treatment, using the same procedure except that hot (80° C) 5% HCL and 2.5% NaOH were used.” Nature, Vol. 337, No. 6208, pp. 611-615, 16th February, 1989\n– “The shroud was separated from the backing cloth along its bottom left-hand edge and a strip (~10 mm x 70 mm) was cut from just above the place where a sample was previously removed in 1973 for examination.  The strip came from a single site on the main body of the shroud away from any patches or charred areas.  Three samples, each ~50 mg in weight, were prepared from this strip.  The samples were then taken to the adjacent Sala Capitolare where they were wrapped in aluminium foil and subsequently sealed inside numbered stainless-steel containers by the Archbishop of Turin and Dr Tite.  Samples weighing 50 mg from two of the three controls were similarly packaged.  The three containers containing the shroud (to be referred to as sample 1) and two control samples (samples 2 and 3) were then handed to representatives of each of the three laboratories together with a sample of the third control (sample 4), which was in the form of threads.” Nature, Vol. 337, No. 6208, pp. 611-615, 16th February, 1989.\nHow obtains a rectangular sample of dimensions 1.8 x 1.4 cm aprox. from a rectangular strip of fabric of ~10 mm x 70 mm ?\nWithout MIRACLES!\n– LA TRAZABILIDAD ES NULA.\nCarlos Otal\n\n","date":"September 25, 2012 at 10:23 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16920","author":"Carlos Otal","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Excellent post Carlos! I’d like everyone to focus on the Zurich sample photos, but more specifically the actual ‘test’ samples and more specifically, thier weights. According to H.Gove, co-inventor of the AMS system for radiocarbon dating and also refering to the paper by Mark Oxley; ‘Evidence is not proof-A response to Prof Timothy Jull’, the minimum threshold CARBON weight of a testing sample should be 5 mg minimum and “given the conversion factor between the weight of the Turin Shroud cloth and it’s carbon weight is 24%,  the weight of the cloth to be tested must therefore be a MINIMUM of 20.83 mg…Please take note of the weights of the samples used by the Zurich labs.\nR\n\n","date":"September 26, 2012 at 7:35 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16938","author":"Ron","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Carlos,\n– May I quote you over in the Randi forum?\n— Rich\n\n","date":"September 26, 2012 at 6:03 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16960","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"¡OK, Richard!\nCarlos Otal\n\n","date":"September 27, 2012 at 2:25 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16994","author":"Carlos Otal","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"– Interesting.\n– I should have known that I’d have difficulty just keeping up — even over here, in a friendly (to me) atmosphere.  I suppose that I’m naturally slow in trying to express my responses to what anyone says, and now I have several responses to which to respond — each of my responses likely to provoke multiple more responses themselves.  Consequently, I quickly develop a quickly growing exponential tree of responses to which I need, or just want, to respond…\n– And NOW, counting the Randi forum, I’m quickly growing TWO exponential trees of responses to which I need, or just want, to respond…\n– In my proposed model for actually effective debate, each side has a single spokesperson with his/her own sub-thread where he/she directs the conversation and tells his/her opponent which response to answer next.  Both sides accept that the process will be tedious, but POTENTIALLY EFFECTIVE — which would be revolutionary…\n– What we’re having over here is not an OVERALL debate, but there are, and will be, numerous moments of needed clarification, reservation and, even, objection.\n– Anyway, I have some pressing chores to get done — but, I’ll be back to begin addressing the various responses that need addressing.\n— Rich\n\n","date":"September 26, 2012 at 10:38 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16944","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"\nRon :\nNo problem, but why leave out fiasco or farce? …as, it is fact ;-)\nDid you ever get around to reading those papers I mentioned a while back? Seriously Rich if your going to debate anything, you should study up extensively on the subject. These things I just mentioned, I would think would be common knowledge to anyone serious about the Shroud or Sindonology.\nRemember knowledge is power….In almost every post I read on there by your ‘opponents’, I noticed major errors. It is obvious most are not well read on the subject, but you must be, if you want to be taken seriously…and shown respect.\nR\n\nRon,\n– I’m not sure to which papers you’re referring. \n– I suspect that some of what I’ve said in previous posts has made it appear that I have read much less than I have.  I asked to quote you in addressing the Randi forum — even though I knew about almost all of the issues you raised, and had already pointed out many of them in the Randi forum myself — because I had failed to include some of them, and I liked the way you had put them all together.\n– In addition,\n1) I’m getting pretty old (70), and my memory simply isn’t what it used to be.\n2) I think that compared to the mean human population, my memory for specifics (which is what’s important in arguing a case) has always been in the lowest quartile — though I seem to do fine with generalities…\n3) Though I include about 60 links about the Shroud at http://messiahornot.com/Bibliography.php, and have 25 more on a separate spreadsheet, I haven’t done a good job of compiling an actually useful “bibliography” — never recording many of the links I’ve used, and poorly describing what I have recorded.  I was directed to “Evernote,” and did download it, but haven’t found the time to actually learn how to use it.  And,\n4) What makes this failure (to develop a useful bibliography) such a big problem over in the Randi forum is the exponential tree (I addressed in my last post above) of responses that I need, or want, to answer over there, leaving me overwhelmed with the need to track down old sources — as well as new sources.\n– Whatever — thanks for the help, I’ll use your post over there and will greatly appreciate any more help you can give me as we go along…\n— Rich\n\n","date":"September 26, 2012 at 5:52 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16959","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Sorry Richard, I didn’t mean to say you were lacking knowledge or ability and I can sympathize with your memeory issue, as I suffer slightly of the same. I have also had an issue with organizing all my Shroud information, links etc….So I understand where your coming from. I have just recently started to better organize myself to help with my debates, with some helpful tips from Daveb!\nAnyways as to your discussions at JREF, I think I warned you very early about ‘those’ many seperate ‘roots’ developing. It is a tactic used by others to make the task of responding daunting to you. Sometimes it helps to just take note of objections for later discussion and focus on one aspect at a time…Seriously, I would go nuts trying to keep up and respond to several different arguments at once. Try forcing the discussion to one aspect at a time. If they don’t respond in kind, ignore their posts and only post your facts, without responses to them….Thats my suggestion.\nOh as to the papers I mentioned; One is the paper by Mark Oxley mentioned above and the Remi Van Haelst papers, which can be found at shroud.com.\nThanks\nR\n\n","date":"September 27, 2012 at 6:08 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16999","author":"Ron","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"– Thanks, Ron.\n– I now remember you saying something about the “separate roots.”  I don’t really remember those specific words, but I do remember the warning in general…  You were right.\n– I’ve actually TRIED to do exactly what you suggest above, but it isn’t easy.\n– For one thing, I will forget my objective of focusing on one aspect at a time, and respond to something that seems especially provocative — and, also easy to answer — but, that provokes multiple responses from the other side…  Hard to keep my cool.\n– I also have NOTES all over the place, but not in the easily accessible list that you imply. I’ll try to gather up the last twenty or so, and make that my list.  That should help me to let them go unanswered for “now.”\n– I do think that I’m still learning a lot about human debate.  I include “human” here cause it has to do with human nature.\n– Thanks for your help — it’s probably exactly what I need.\n— Rich\n\n","date":"September 28, 2012 at 9:19 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17018","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"\nRichard Savage :\nAnoxie,\n– That seems to be the only one they really depend upon.\n– Sorry that I didn’t get back to yo sooner.\n— Rich\n\n– The above is all I meant to say in my previous post.  Sorry about the extra.\n– Hopefully, I’m doing this right…\n— Rich","date":"September 27, 2012 at 11:17 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16984","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"– Apparently, I wasn’t doing it right.  Oh well…\n– I’ll try to go back to anoxie’s early post, and answer it there.\n— Rich\n\n","date":"September 27, 2012 at 11:22 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16985","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"\nPassing Stranger :\nRight……..\nSo why have neither Rick (who “hid behind the pseudonym” of Jabba) no any other shroudie dealt with the evidence for the medieval origin of the shroud. At JREF or elsewhere…\n\nPassing Stranger,\n– I wasn’t hiding.  “Jabba” has been my preferred pseudonym “forever,” and I just figured that “everybody” used a pseudonym…\n– I’ve tried to explain my tardiness over there — regarding dealing with the different claims of evidence — numerous times, but no one has  taken my excuses seriously…\n– I will get to those claims of evidence, and my own claims of evidence, as I can find the time.\n– I think that the other “Shroudies” have preferred to avoid the REACTION to Shroudies at JREF.\n— Rich\n\n","date":"September 27, 2012 at 11:52 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-16986","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"The philosopher Socrates imagined he could improve the world by identifying the greatest good, for then once this was identified, all would then pursue it.  He failed to allow for the Athenians preference for argumentation and debate for its own sake rather than pursuing the truth.  Consequently he was condemned for corrupting the youth of Athens with such novel ideas, was sentenced to death and was required to swallow hemlock.  Even in this he imagined that as this was the sentence of the State following due process, this was the proper thing for him to do. \nThe preference for argumentation and debate for its own sake in preference to the truth survives to the present time on the web-sites of so called “open-minded sceptics” who are in reality “close-minded cynics”!  \nThe Sermon on the Mount includes these words: “give not that which is holy unto the dogs, neither cast ye your pearls before swine, lest they trample them under their feet, and turn again and rend you”  Likewise in the parable of the sower we must ask ourselves, “Why would a sower want to sow his precious seed on barren ground?”  \nIt is one matter to engage in honest and open debate about those affairs which are precious to us.  However, it is a pointless exercise when it is only too apparent that the good will of an honest response is unlikely to be forthcoming, and one should not give one’s valuable time to such futility.  \nThe advantage of debate on this particular site of Dan’s, is that although we all may have different ideas on the topic and disagree at times, the debate for the most part endeavours at least to be honest most of the time!\n\n","date":"September 29, 2012 at 6:44 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17047","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Daveb; “It is one matter to engage in honest and open debate about those affairs which are precious to us. However, it is a pointless exercise when it is only too apparent that the good will of an honest response is unlikely to be forthcoming, and one should not give one’s valuable time to such futility.” …That is precisely what I tried to impress on Richard right from the beginning of his journey.\nI have to say, you certainly have a elegant way of writing Dave, and…yet again, another excellent post comment.\nThanks.\nR\n\n","date":"September 29, 2012 at 12:22 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17056","author":"Ron","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Thanks for your kind and appreciative words, Ron.  It’s a long practised craft, first learnt at my mother’s knee – she could keep children enthralled for hours, compiling stories from her imagination, or reading the  better childhood literature to us – one of my nephews has won awards as a national playwright, first learnt the art from his grandma.  Years of writing complex corporate engineering and audit reports, religious studies seminar papers, book reviews, editing a quarterly magazine, and so on.  How to get your meaning across concisely, comprehensively, how to write densely, just a little prolix at times.  Blogging limits the amount of editing one can do – it’s writing live, but I always go back a few times and check, but occasionally miss a few errors.  I lament with an ex-English schoolteacher friend, the poor quality writing of many young people, they often write how they speak, which shows a lack of proper training. Cheers, daveb.\n\n","date":"September 30, 2012 at 6:11 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17078","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Daveb and Ron,\n– You’re both right, of course… \n– Let’s see if I can explain why I wish to continue in the Randi forum, in spite of the situation over there.  (I know that I’ll sound like some kind of nut, but I honestly believe what I’m about to say…  Or at least, I honestly believe that I believe what I’m about to say.)\n– My first general reason for wanting to continue is HOW IMPORTANT I perceive my two basic goals to be.  I think that\n1) A METHOD FOR ENSURING ACTUALLY EFFECTIVE DEBATE WOULD BE REVOLUTIONARY,\n2) AS WOULD A GENERAL SCIENTIFIC ACCEPTANCE THAT THE SHROUD IS PROBABLY GENUINE…\n– My second general reason is that I think that both are quite possible…\n– Now, even though most of the posts from my opponents over on the Randi forum are basically just insults, some of the posts include “accusations” that seem at least somewhat reasonable.  I had wanted to unearth the reasonable accusations against Shroud authenticity, and see if we could effectively refute them — and these guys are happy to spell out just what the accusations are.\n– And then, there is at least one guy over there that seems to be genuinely seeking the truth\nabout the Shroud — and others that might be close.  If I can give them some good answers to their reservations, they might actually begin to rethink.  I think that would be a giant step in the right direction.\n– Also, they are somewhat correct about my inability to present satisfactory evidence myself – just that I have a lot of excuses and these guys don’t recognize (or admit?) the validity of my excuses…\n– Probably, my Number One excuse, is the exponential growth of responses to which I need, or at least wish, to respond.  Whatever my response, it tends to trigger numerous new, often provocative, responses .  I keep thinking that if I can just stay on point — instead of being seduced off the trail, we will eventually make some progress…\n– Unfortunately, even responding to you guys takes me off point…\n– And then,\n1. The Randi forum seems to be an extremely popular and respected (by skeptics) advocate for skepticism in general.\n2. The aim of my method for debate is not to enlighten my opponents.  My aim is to attract a large audience, and enlighten THEM.\n3. I think that if we can develop just a SLIGHTLY effective debate between us and those on the Randi forum, we have the beginnings of something important.  That is,\n3.1. I can’t fully impose my method on their current forum – so, even if I’m right about the overall method, I can’t expect to directly accomplish a whole lot over there, as things stand.\n3.2. But then, if I can show just a little bit of “progress” (defined below) over there, and keep working on it, I might eventually be able to convince the administrators over there to allow for an experimental thread using my suggested method.\n3.3. Maybe, I could convince Dan, or another one of our leaders to “sponsor” such a debate in front of a large audience on whatever website.\n3.4. Whatever, I sure think that someone with some influence needs to be researching the possibility of actually effective debate.\n(“Progress” being the explicit isolation of BASIC disagreements — where the two sides don’t have anything further to add re the particular, specific, disagreement, and can thereby agree to disagree for now re that particular disagreement – thereby, allowing the audience to best judge that particular disagreement for themselves.  Progress does not require “enlightenment” of one of the opponents.)\n– I’d best get back on point.\n– Thanks.\n— Rich\n\n","date":"October 2, 2012 at 8:50 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17149","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"\nanoxie :\nThere has been no chemical or physical analysis of the samples before c14 datation.\nYou can’t draw any conclusion on the nature of the samples based on Nature’s article.\nDo they have any other source ?\n\nanoxie,\n– Do we basically know that neither Flury-Lemberg or anyone else did no chemical or physical analysis of the samples before c14 datation, or is it that they just haven’t told us specifically what they did in accepting the samples?\n– But also, what did the 78 STURP research say about that particular area?\n— Rich\n\n","date":"October 2, 2012 at 10:51 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17155","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"“Do we basically know that neither Flury-Lemberg or anyone else did no chemical or physical analysis of the samples before c14 datation, or is it that they just haven’t told us specifically what they did in accepting the samples?”\nI’m not aware of any documented chemical or physical analysis before C14-datation. Dr Fulry-Lemberg gave her expertise based on a visual analysis of the shroud. Chemical or physical data gathered by the STURP have not been taken into account before chosing the sampling area. The very question of reweaving was raised before the official results of the C14-datation were announced:\nDraft Protocol for Future Examinations of the Shroud of Turin, 8 october 1988, page 4\nApparently no overall survey of the cloth was undertaken or documented to justify the sampling location. Thus questions of waterstains, edge handling, possible 14th century reweaving, and the like remain unanswered.\n\n “what did the 78 STURP research say about that particular area?”\nThat it was the worst sampling area.\n\n","date":"October 8, 2012 at 6:00 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17326","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"anoxie,\n– Thanks a lot, again.\n– I’ll pass this on.\n– Do you know where I can get more specific info from STURP re that corner?\n— Rich\n\n","date":"October 8, 2012 at 8:17 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17329","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"\nRichard Savage :\n– Do you know where I can get more specific info from STURP re that corner?\n\nThere is no shortcut if you want to do it right, you have to study patiently STURP’s peer-reviewed articles.\nA good introduction is here : Discrepancies in the Radiocarbon Dating Area of the Turin Shroud\n\nBut let’s be clear, it was not STURP’s objective to determine a sampling location.\nThis job has not been done before the C14-datation.\n\n","date":"October 8, 2012 at 1:46 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17334","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"anoxie,\n– Thanks again.  I’ll do as you suggest.\n– Mostly, I wanted to know what STURP said about that corner.  Did they say anything that would support a patch theory, or that the area is anomalous?  Did they do any testing on that corner that should have exposed a patch?  I’ll see what I can find.  I’ll start with “Discrepancies in the Radiocarbon Dating Area of the Turin Shroud.”\n— Rich\n\n","date":"October 9, 2012 at 7:39 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17385","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"anoxie,\n– Woops.  Unfortunately, that link didn’t work.\n— Rich\n\n","date":"October 9, 2012 at 7:41 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17386","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Sorry, this should work : Discrepancies in the Radiocarbon Dating Area of the Turin Shroud.\nSTURP did not miss the reweaving, because it did not look for it. That is the sense of the warning “the question of a possible reweaving remains unanswered”.\nThis is the main limitation of the C14-datation. Its sampling protocol did not include an overall study of the cloth and a chemical/physical characterisation of the sample.\nThus the basic rule of C14-datation (the sample must be representative of the whole), has not been respected with the highest level of proof.\n\n","date":"October 10, 2012 at 5:38 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17392","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Sorry for the link.\nYou can find it easily, search for :\nChemistry Today (Vol 26, Num 4, Jul/Aug 2008), “Discrepancies in the radiocarbon dating area of the Turin Shroud,”  Benford M.S., Marino J.G.\n\n","date":"October 10, 2012 at 5:41 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17393","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"anoxie,\n– Thanks.\n– Got it.\n– Got my work cut out for me.\n— Rich\n\n","date":"October 10, 2012 at 9:17 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17408","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Your welcome.\nBut i must say you’re in a dead end. If they don’t accept Rogers’ article (and why would they since the three laboratories don’t seem to care), we have to rely on Nature’ article.\nHowever,\n1/ it seems raw data leaked out from Tucson laboratory\n2/ an independant analysis of the reserve sample may easily confirm Rogers’ findings if he was right\nBasically, it’s a matter of time.\n\n","date":"October 12, 2012 at 1:32 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17551","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"anoxie,\n– Re the “dead end.”  I don’t really expect to convince any of my opponents on the Randi forum that any of my “contrary” claims are correct…  Instead, I’m vaguely hoping to use that thread to show a somewhat neutral audience that my claims are correct.  I’m also getting some much needed on-the-job training — I have what I believe to be the “basics” of effective debate; what I’m learning through the Randi debate is some of the details.\n– Obviously, I have a lot of explaining to do — but for now, I need to go take a nap…\n– Just to keep the Randi thread handy, you can find it at http://forums.randi.org/showthread.php?t=226761&page=90.\n– Thanks, again.\n— Rich\n\n","date":"October 15, 2012 at 8:34 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17656","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"I mean the ones who should move on are Pr Ramsey, or Dr Jull. Until this happens, you’ll have a hard time to convince any skeptic on the Randi forum.\nAnd according to a paper from Dr Jull  “Investigating a Dated Piece of the Shroud of Turin”, Radiocarbon 52 no 4, 2010: 1521 -1527, this is not going to happen soon.\n\n","date":"October 17, 2012 at 3:38 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17756","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Anoxie,\n` I didn’t really understand what you said — immediately above — but, I’m about to give up on the patch theory for now anyway — unless you, or someone else knows a way around what I discovered yesterday.  I’ll explain in my next post.\n— Rich\n\n","date":"October 19, 2012 at 11:06 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17870","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"– Yesterday, I spoke to Michael Ehrlich, of http://withoutatrace.com/ — the expert to whom Marino and Pryor referred in 2008 (http://shroud.com/pdfs/chronology.pdf) about French Re-weaving.  He told me that the “invisibility” depended upon using only undamaged threads from the main cloth.\n– That being the case, the dating wouldn’t be affected…\n– Does anyone here have an answer to that?\n– I’ll write to Joe Marino, but I suspect that he’s too busy to answer all his emails…\n— Rich\n\n","date":"October 19, 2012 at 11:19 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17871","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"This is an expert’s opinion.\nThese are facts :\n1/ Rogers’ article in Thermochimica Acta\n2/ Confirmation by LANL’s work (http://www.shroud.com/pdfs/villarrealvtxt.pdf) based on :\n\n1. X-ray Photoelectron Spectroscopy\n2. Tube Excited and Radioactive Source Micro-spot Energy Dispersive X-Ray Fluorescence\n(MXRF) Spectrometry\n3. High and Low Powered Magnification with a High Resolution Photo-Microscope\n4. Fourier Transform Infra-Red Spectroscopy (FTIR) with Reflectance Mode Capability\n5. Time-of-Flight Secondary Ion Mass Spectrometer (TOF-SIMS)\n\nAnd I think the answer by Dr. Jull in Radiocarbon is not convincing. Only an independant, comprehensive and official analysis of radiocarbon yarns could settle this issue, no more, no less.\n\n","date":"October 19, 2012 at 12:04 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-17872","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Anoxie,\n– But, as far as I know, Ehrlich is the only expert who has accepted that a French re-weaving patch would be essentially invisible — and also, he is the Expert to whom Joe Marino referred in supporting his case.  And, as we look closer at what Ehrlich said, it does NOT seem to support Marino’s case.\n— Rich\n\n","date":"October 22, 2012 at 8:50 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-18032","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"This is a legitimate question. You should ask Joe Marino for more details on his investigations on French re-weaving. I have no strong views on this hypothesis.\nI think the rigourous conclusion we can draw out Rogers’ and LANL’s works is not that there has been a reweaving but that there is/was a significant amount of cotton in the C14 sample. And this fact (the sample is not representative of the whole), invalidates the dating.\n\n","date":"October 22, 2012 at 1:14 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-18043","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Anoxie,\n– I wrote to Joe a couple of days ago.  So far he hasn’t responded.  I figure that Joe only has enough time to respond to a small percentage of his incoming mail.  Writing to Joe must be something like writing to Rush Limbaugh.\n— Rich\n\n","date":"October 24, 2012 at 8:42 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-18191","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"– The following is my current best attempt at summarizing the “first level” of claims supporting the authenticity of the Shroud.  I plan to present this list to the Randi forum.  Please let me know how you think I should revise, delete or add to my list.\n– I say “first level” because each claim below is supported by other claims — which, in turn, will be supported by more claims, etc.  For instance, the Pray Codex would be introduced and discussed under claim # 10 – and, would therefore, need not be added to THIS list.  Hopefully, at some point, I’ll get around to focusing on #10, and then, the Pray Codex…\n– I will present this to the Randi forum as a lead-in to beefing up my current focus on #11 – the reliability and validity of the carbon dating.  I present this list because my attempt at actually effective debate requires a kind of “murder board” (like they show on detective TV shows) with a diagram giving structure to the overall argument.  I hope that translates.\n1.The shroud is one of the most studied artifacts in human history.  Also, it is at least 700 years old.  Even so, no modern artist or scientist has ever been able to fully reproduce or explain it.\n2.No similar ancient artifact has ever been found.  (If this was a forgery, the genius who forged it, didn’t leave any other (what would have been extremely valuable) examples, or attempts, behind.)\n3.Though, in 1981 a mattress cover did develop a similar image when it was left on a man who had just died…  (Is this some kind of rare, but totally NATURAL, phenomenon?)\n4.Science has essentially proven that the shroud\n4.1.Is not a painting.\n4.2.Is not a photograph.\n4.3.Is 3D.\n4.4.Is holographic.\n5.The image on the shroud almost has to be some sort of imprint of someone who was recently tortured and crucified.\n6.The figure on the shroud is extremely detailed and in total agreement with the Biblical account of the crucifixion.\n7.Some of the correct detail of a victim of crucifixion could not have been known by, seen by, painted by or desired to be painted by any forger 700 years ago.\n8.The historical evidence for its early existence is actually substantial and growing.\n9.There is plenty of reasonable doubt re the validity of the 1988 carbon dating.\n10.Other than the carbon dating, the evidence against the shroud’s authenticity is really quite unimpressive.\n11.Other than the scientists involved in the carbon dating, only one involved scientist has argued that the Shroud is not authentic (Walter McCrone) – whereas, there have been numerous involved scientists that have argued the opposite.  The other notable skeptics are only in the “audience.”\n12.There is real blood on the shroud (involving some of the details noted in #7, above), and in the right places.\n13.The one involved scientist (from #11) claimed that there was no blood on the shroud.\n14.There is a barely visible second image of the face on the back of the shroud – with no discoloration between the two layers.  How would an artist do that? \n15.In effect, the shroud is a negative.  How would a forger know how to do that, be able to do that and why WOULD he do that — hundreds of years before photography was invented?\n16.One very unusual aspect of the stitching on the shroud (the side strip) has also been found on a shroud in the ruins of Masada (an ancient Israeli fortress).  Masada was destroyed in 70 CE by the Romans.\n17.Evidence of pollen and flowers — specific to Palestine in the first century — has been found on the shroud.  Other pollen evidence on the shroud fits with the shrouds traditional itinerary.\n18.Evidence of appropriate Roman coins is found on the closed eyelids of the victim.\n19.If the shroud is not the burial cloth of Jesus, its most likely explanation is that of a forgery perpetrated by space aliens.\n— Rich\n\n","date":"October 24, 2012 at 9:03 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-18195","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Be carefull, there are very controversial claims in this list.\nI don’t think the shroud is holographic or bears flowers’ images.\nI don’t know much about the mattress but i think it is a different mecanism.\nSome claims are elusive.\nTalking to skeptics, I’d stick to the C14 dating and its limitations. If they don’t admit them, i’d give up, otherwise i’d try to argue.\n\n","date":"October 24, 2012 at 10:07 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-18198","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Anoxie,\n– Thanks again.\n– I think that the following is a good article on the hologram theory.  http://shroud3d.com/home-page/introduction-holographic-observations-in-the-shroud-image-holographic-theory.  As far as I know, this claim has not been discounted…\n– Note that in regard to the flowers and coins (#’s 17 & 18 of my claims), I only say that there is EVIDENCE of these things.  Have the claims about flowers, and/or coins, been disproven, or essentially disproven?\n– A couple of articles about the Hospice mattress cover:  http://shroud.com/pdfs/imprint.pdf and http://www.shroud.com/pdfs/mattress.pdf.\n– You’ve given me a lot of your time already, so I’m reluctant to ask for more – but, I’ll do it anyway…  Could you possibly outline your reasons for believing that the Shroud is probably authentic?\n— Rich\n\n","date":"October 25, 2012 at 7:55 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-18275","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"-I’ve read the article concerning the hologram theory. It is not convincing, the described properties are not specific of a hologram. Definitely, the shroud is not holographic.\n-In regard to flowers and coins, you should read Dan’s article : I Don’t See Flowers and Coins and Teeth on the Shroud of Turin.\n-Concerning the Hospice mattress, it is not the same mechanism.\n\n","date":"October 25, 2012 at 4:30 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-18299","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Anoxie,\n– OK.  I’ll leave those out.\n— Rich\n\n","date":"October 25, 2012 at 5:41 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-18303","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"– I think that I asked about this previously (somewhere on Dan’s blog) — but, if I did, I can’t find it…\n– According to Michael Ehrlich — the head of “Without a Trace,” the company to which Joe Marino refers when claiming that a really invisible patch is possible — the process for producing a really invisible patch requires the exclusive use of undamaged threads from the original cloth.  In other words, even if this process was used on the carbon dating sample from the Shroud, the patch should show the same age as the rest of the cloth…\n– Do we have a counter claim?\n– (I have a possibility, but don’t know that it really makes sense.)\n— Rich\n\n","date":"March 18, 2013 at 9:38 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-27641","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"You should ask Thibault directly. He has examined threads from the shroud and has seen different type of fibers, certainly not from the original cloth.\n\n","date":"March 18, 2013 at 10:16 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-27644","author":"anoxie","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"Anoxie,\n– Thanks — but, how do I do that?\n— Rich\n\n","date":"March 18, 2013 at 10:22 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-27645","author":"Richard Savage","site":"shroudstory"},{"title":"An Open Thread for Rich Savage Questions","post":"– Currently, I’m trying to address the claim made on the Randi forum that the involved scientists chose the sample to be taken from the Shroud.  I claimed that the scientists didn’t choose the sample — the church did, and the scientists were just forced to go along with the Church’s choice.  Here’s the argument that I eventually came up with.  I’ve probably mistated here and there, so any additions, deletions or corrections otherwise would be greatly appreciated.\n1.On 26 Aug 1974, on the urging of Ian Wilson, Walter McCrone sent a letter to Father Peter Rinaldi, S.D.B., in Turin.  In that letter, McCrone submitted a proposal to carbon date the shroud.\n2.In his book, McCrone notes that his proposal changed over the next three years, so he didn’t include the original in his book … but by 1977 at least, as you will see below, he was advocating one of the Raes samples.\n3.Harry Gove first learned of the Shroud in a letter dated 8 Jun 1977, from Reverend David Sox – the Secretary General of the British Society for the Turin Shroud (BSTS) — asking if Gove’s new carbon dating method could be applied to the Shroud.\n4.In his letter, Sox included the 1977 version of McCrone’s proposal that suggested using one of the Raes samples for dating.\n5.In July of 77, Gove responded that his new carbon dating method could be used, but that the method would require more work before it should be applied to something so “renowned” as the shroud (even though Gove hadn’t known about the shroud himself, he apparently realized that a lot of people had)…\n6.On  16 Feb 1979, Gove sent a letter to the Archbishop of Turin, Cardinal Ballestrero by way of Don Piero Coero-Borga (whoever the latter was, for whatever the reason) proposing carbon dating of the Shroud using one of the Raes samples.\n7.I can’t get the timing quite straight, or who got the idea from whom, but by 1979 Luigi Gonella, science advisor to the archbishop of Turin, was also advocating one of the Raes samples for the carbon dating.\n8.Though, Gonella may have just been following instructions from the Pontifical Academy of Sciences…\n9.At that time, STURP also accepted the suggestion.\n10.Gove’s letter (#5 above) didn’t make it to Ballestrero until years later (1984?).\n11.Somewhere in that time, Gonella changed his mind, claiming that the Raes samples had not been properly cared for and were probably too contaminated to use for the carbon dating.\n12.Gove agreed – accepting something else (what, I don’t know) instead.\n13.In 84, STURP submitted a protocol, of its own, requiring samples to be taken from 3 different areas on the Shroud.\n14.In June of 85, a summary (by David Sox) of the Trondheim protocol just indicated samples (plural).\n15.So far, I can’t find a copy of that protocol, but supposedly it specified taking samples from 3 different areas.\n16.In the fall of 86, several interested scientific groups sent representatives to Turin, and turned out the Turin Protocol, which called for 7 different tiny samples – but apparently, all adjacent to each other.\n17.This conference was organized by Harry Gove, and most of those attending the conference were associated with carbon dating labs.\n18.Together, they decided to exclude STURP and STURP’s multi-disciplinary approach.\n19.The Turin Protocol did require that the samples taken not be near any patched or charred areas.\n20.In the end (21 April 1988), Giovanni Riggi, foremost Scientific Advisor to Cardinal Ballestrero, Luigi Gonella and two linen experts, after an hour or two of debate selected one small area adjacent to the Raes sample.\n21.They made this selection even though the Raes area had appeared to involve patching, was a few inches away from an area charred by the fire of 1532, was contaminated by the water used to put out the fire, and being one of the two corners held by “volunteers” when displayed hundreds of times over the centuries had to be somewhat contaminated and not chemically representative of the greater shroud…\n22.So far, I haven’t been able to find out the limitation of their choices, nor who determined the limitations.  (I may have known at one point, but if I did, I can’t remember them now…)\n23.From William Meacham at http://shroud.wikispaces.com/CARBON.14.DATING… It is frequently reported that the original C-14 protocol drawn up at the Turin conference of 1986, jointly sponsored by the Pontifical Academy of Sciences and the Turin Archdiocese, was to have seven samples from seven different sites on the Shroud. This is incorrect. At that conference a rough compromise emerged with the protocol calling for seven samples to be taken but from only ONE sampling site. The lab directors rejected the strong resistance on the latter point from a few individuals at the conference, because in the directors’ view having two or more sampling sites increased the possibility of an outlier. They sought at all costs to have a result supported by the largest possible number of labs, primarily for public consumption.\n24.So, here’s what I think so far.\n25.At first, the scientists were thinking small – and, were trying to take advantage of the samples already tested.  They would have preferred samples from multiple areas over the shroud, but knowing the difficulty of getting approval for such samples, were happy to have SOMETHING.\n26.Most likely, they would have accepted that the results of using just the one Raes sample would be highly suspect, but under the circumstances, well worth the effort required to obtain them.\n27.Later, they realized the possibility of obtaining (slightly) more material, and began trying to advance that possibility.\n28.The Turin workshop of 86 allowed the CARBON DATING LABS to advance their own agenda/preferences – and, “the rest is history.”\n29.In other words, Scientists did first propose one of the Raes samples, but they did that because they figured that such would be easily allowed by those in charge of the decision (the Church), whereas getting anything more might be impossible.\n30.Later, when there seemed to be room for enlarging their expectations, scientists of the carbon dating mentality were in control, outvoted the remaining scientists and allowed for only a tiny sample from a highly suspect corner of the Shroud to be their target.\n\n","date":"May 21, 2013 at 8:58 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","id":"comment-34201","author":"Richard Savage","site":"shroudstory"}]
