[{"title":"Proof that art experts are not always right","post":"She can be forgiven for linking McCrone to the C-14 tests, he did call for the tests to be done. But as an art critic, the most important part of the article is the last half.  She skillfully counters McCrone’s attribution of two paintings now in Florida, one to DaVinci and the other to Raphael.  She challenges his assessment based on her intricate knowledge of both artist’s style and technique.  She is not the only one to question McCrone’s judgement in the realm of art.  This is important because in the world of chemistry he carries high credentials yet where he inserted himself into art authentication, many seriously question his methodology and expertise.  This article is just one example.\n\n","date":"October 23, 2015 at 5:54 am","url":"https://shroudstory.com/2015/10/23/proof-that-art-experts-are-not-always-right/","cat":"other_blogs","id":"comment-213411","author":"Russ Breault","site":"shroudstory"},{"title":"Proof that art experts are not always right","post":"I think Russ is quite right. Walter McCrone was a skilled microscopist, and his microscopical observations should be taken seriously, even if he is later proved mistaken. If his attributions of the disputed paintings were based on particle analysis, then they mean something, even if the style of the paintings is untypical. I think Joan Altabe misrepresents what McCrone deduced about the paintings he was given to study (and incidentally, the gist of this article first appeared in the Sarasota Herald Tribune of 12 Feb 2001, so it must be a slow news week). The reader is directed to the Sarasota Herald Tribune of 24 October 1992, where a more balanced article may be found. They can also try http://www.deringconsultants.com/portfolio/leonardos-christ-among-doctors/ which considers McCrone’s findings correct – although the site is the owner’s, so not necessarily balanced.\nAltabe does not give the title of the disputed Raphael, so it is difficult to research, but a similar dispute also arose about The Three Ages of Man by (perhaps) Giorgione, which is easier to find. Try https://archive.org/stream/stormypetrel199369113ogle/stormypetrel199369113ogle_djvu.txt\nThere is no doubt that Walter McCrone was his own worst enemy in his field. He was often overconfident and abrasive, and excited strong feelings, both favourable and unfavourable, depending on whether he supported a view or not. None of this should overwhelm his genuine, detailed, accurate, microscopy, which must be taken on its own merits, even if the conclusions one draws from it are not the same as his.\n\n","date":"October 23, 2015 at 7:35 am","url":"https://shroudstory.com/2015/10/23/proof-that-art-experts-are-not-always-right/","cat":"other_blogs","id":"comment-213415","author":"Hugh Farey","site":"shroudstory"},{"title":"Proof that art experts are not always right","post":"Is this a shocking revelation?  Forgive my incredulity, but scientists are merely human.\n\n","date":"October 23, 2015 at 7:15 am","url":"https://shroudstory.com/2015/10/23/proof-that-art-experts-are-not-always-right/","cat":"other_blogs","id":"comment-213414","author":"Dcn Andy","site":"shroudstory"},{"title":"Proof that art experts are not always right","post":"“Of course, Walter McCrone never “performed radiocarbon tests on the shroud.” Nor did Rogers date the shroud to the 1st century. So it turns out, neither are art experts always write while righting blogs posts about writing wrongs”.\nGuilds archive strongly differs from that conclusion. At first, what was believed C14 tested was the The Sudarium of Oviedo in Mons. Ricci’s possession during the infamous journey with McCrone to Dr. Raes. However, Further archives concluded that in fact in all probability, McCrone was successful obtaining The Shrouds threads and tested it in Germany. \nEither case, it’s hear say.  But on the other hand,  no one here can definitely claim that McCrone didn’t conduct a C14 test.\n\n","date":"October 23, 2015 at 8:54 am","url":"https://shroudstory.com/2015/10/23/proof-that-art-experts-are-not-always-right/","cat":"other_blogs","id":"comment-213418","author":"Giorgio HSG","site":"shroudstory"},{"title":"Proof that art experts are not always right","post":"May be…\nThen, perhaps, Art experts are not always right\n(but this can be a worrying idea…).\nBut …\nHere a simple question:\nHas Mc Crone never worked for such an\ninstitution as the Metropolitan Museum of Art of New York?\nAt least, we have to see what Marco Leona\ndirector of scientific research of\nMetropolitan Museum of Art, New York\n(and … do you remember the past message\nabout SERS?) can do with non-destructive\nand microanalytical techniques…\nHere the past international conference,\nthe meeting: “TECHNART 2015”\n(Catania, April 27 – 30, 2015)\n= Non-destructive and microanalytical techniques in art and cultural heritage\n>The aim of TECHNART 2015 is to provide a scientific\nforum to present and promote the use of analytical\nspectroscopy techniques in the field of cultural heritage.\n>The conference builds on the momentum of\nTECHNART 2013 offering an outstanding and\nunique opportunity for exchanging knowledge\non leading edge developments.\n>Cultural heritage studies are interpreted in\na broad sense, including pigments, stones,\nmetals, glass, ceramics, chemometrics on\nartwork studies, resins, fibers, forensic applications\nin art history, archaeology and conservation science.\nConference topics:\n>X-ray microanalysis (XRF, PIXE, XRD, SEM-EDX)\n>Confocal X-ray microscopy (3D Micro-XRF, 3D Micro-PIXE)\n>Synchrotron, ion beam and neutron based techniques/instrumentation\n>FT-IR and Raman microscopy\n>UV-Vis and NIR absorption/reflectance and fluorescence\n>Laser-based analytical techniques\n>Magnetic resonance techniques\n>Chromatography (GC, HPLC) and mass spectrometry\n>Optical imaging and coherence techniques\n>Mobile spectrometry and remote sensing\nLink:\nhttps://www.prospecthere.com/event/technart-2015\n…Unfortunately no mention of the SERS technique!\nOnly a generic “Raman microscopy”…\n\n","date":"October 23, 2015 at 10:17 am","url":"https://shroudstory.com/2015/10/23/proof-that-art-experts-are-not-always-right/","cat":"other_blogs","id":"comment-213424","author":"piero","site":"shroudstory"}]
