[{"title":"Quote for Today","post":"Here’s another definition off the internet, a better one I think since it recognizes the need to account for that “duplic-” root:\n The adjective DUPLICITOUS has 1 sense:\n1. marked by deliberate deceptiveness especially by pretending one set of feelings and acting under the influence of another\nOr, in common parlance, “two-faced”.\n\n","date":"November 22, 2013 at 6:15 am","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","id":"comment-52371","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today","post":"Being cautious is not being duplicitous. While I can be critical of various popes, I think this is a bad rap. If anything, the Church is too often sweeping with a broad brush in its pronouncements. \nGeorges Lemaitre was a priest-scientists who first proposed the big bang theory of the creation of the Universe. He was for many ears the subject of scorn from other scientists. The atheists-agnostics wanted a Universe that always was and was never never. Pope Pius XI wrote to Lemaitre  that he has “proven” Genesis and the creation of the Universe by God. Lemaitre demurred. He cautioned the pope to be careful. Any scientific theory that is true today may be disproved tomorrow. \nPius XI was indeed a remarkable man. As a young priest he had climbed the Alps with a young French man named Paul Vignon.  That was before Vignon had a breakdown from which emerged the man we (at least all most all of us) honor for his work on the Shroud.Pius XI also wrote an encyclical attacking the Hitler and the Nazi’s that was released in late 1938 after his death. But Lemaitre was right, the Church must be careful before declaring any work of scholarship as true or false as a matter of faith. Again, I believe that it has been too quick to reveal truth at times. What it must be is open. The case of Galileo is an excellent example. Then too, there was Joan of Arc.\nGarry Wills placed St. Peters martyrdom at the time of Nero. He may have been a flaming torch at a Nero bacchanalia. He was probably betrayed by other Christians. So too was Paul.\nI realize that there are other scholars much more knowledgeable than I who on this blog who might have differing views, But I find the Church’s attitude of cautious reverence to be quite appropriate. \nOn the other hand, the bones of St. Peter are not the singular Shroud of Turin. The Crucifixion of Christ as “King of the Jews” was a singular event. There were undoubtedly in sum thousands of martyrs. There are thousands of martyrs being suffering this day at the hands of radical Islamists (not all Moslems by any means). \nThe claims of crucifixion and the details of crucifixion are set forth in four written accounts that date to traditions which arose at the time of his death and resurrection. We may have lost the earliest written accounts but the existence of the traditions is attested to not just the Gospels but by the martyrdom of those who proclaimed the Resurrection and faced sure death as a result.\nI may be on dangerous found here, but I am  not willing to accept on as a matter of faith the opinion of one scholar as to the identity of St. Peter’s bones. That’s not duplicity. That’s caution.\n\n","date":"November 22, 2013 at 8:06 am","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","id":"comment-52379","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today","post":"Typo:\nfound = ground\n\n","date":"November 22, 2013 at 8:09 am","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","id":"comment-52380","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today","post":"The best answer the Church should give on these relics is “We don’t know.” That is the first step towards truth.\n\n","date":"November 22, 2013 at 8:36 am","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","id":"comment-52383","author":"David Goulet","site":"shroudstory"},{"title":"Quote for Today","post":"I was thinking more about this and I can see, in the case of the Shroud, why a Pope or Bishop might hesitate to allow definitive testing to be done on a relic. Jesus himself, when tempted in the desert by the Devil to call on God to prove that Jesus was the Messiah, replies “you shall not put the Lord your God to the test”.\nThis may be on the minds of Church leaders. Are we testing the Shroud to prove our faith (a motivation Jesus warns against) or is it to seek Truth for its own sake (something Jesus encouraged)? And if we refuse to do the testing, is it because we fear we will be disappointed and our faith shaken? If so, then this is all the more reason to test it.\nOr is the Shroud, like the Resurrection itself, destined to be a mystery forcing us to believe or not believe according to our ‘faith’?\n\n","date":"November 22, 2013 at 10:50 am","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","id":"comment-52388","author":"David Goulet","site":"shroudstory"},{"title":"Quote for Today","post":"Jones’ choice of word is quite harsh with an obvious bias.  How regrettable.\n\n","date":"November 22, 2013 at 2:14 pm","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","id":"comment-52420","author":"Andy Weiss","site":"shroudstory"},{"title":"Quote for Today","post":"“They probably are” the bones of St Peter, says Jones, and on the basis of this opinion considers the Vatican duplicitous for not turning his ‘probability’ into a ‘confirmed’ fact.\nAnd what is the basis of his “probability”? That the bones belong to an old man? Surely that can’t be considered too unusual.  Or is it that the site of successive incarnations of the vicar of Christ carries an inscription that might say: “Peter is here.” Personally, I side with the Vatican.\n\n","date":"November 22, 2013 at 3:05 pm","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","id":"comment-52424","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today","post":"Stephen has changed the wording. It now reads, “as per the Vatican’s policy of refusing to confirm or deny that any Catholic relic is authentic (including the Shroud of Turin)”.\nMuch better!\n\n","date":"November 22, 2013 at 5:00 pm","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","id":"comment-52436","author":"Dan","site":"shroudstory"}]
