[{"title":"Jerry Coyne Once Again","post":"Do the historical doubters ignore the Talmudic sources (2) also?  Why would the Jews proliferate the idea that a mythical figure was a real historical figure?  \nWhy would the Apostles and the key disciples accept martyrdom for an idea supposedly emanating from a mythical figure?  Are there any parallels to that?\n\n","date":"October 6, 2014 at 11:21 am","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","id":"comment-159833","author":"Nabber","site":"shroudstory"},{"title":"Jerry Coyne Once Again","post":"“People who are experts in one field are capable of appalling lapses of judgement when assessing the evidence in fields outside their own.”\nGood, basic conclusion.\n\n","date":"October 6, 2014 at 1:22 pm","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","id":"comment-159875","author":"anoxie","site":"shroudstory"},{"title":"Jerry Coyne Once Again","post":"Ancient contemporary historical documents in accessible archives are usually confined to ruling houses, conquering generals, and accounts of wars, seldom to notable religious reformers unless they formed part of the establishment.  I wonder what contemporary historical documentation there might be for the existence of Lao Tzu, Siddartha Gautama (founder of Indian Buddhism), Confucius, or for that matter Moses. Yet as with Jesus, their movements survive them.\n\n","date":"October 6, 2014 at 2:56 pm","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","id":"comment-159895","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jerry Coyne Once Again","post":"Ancient contemporary historical documents in accessible archives are usually confined to ruling houses, conquering generals, and accounts of wars, seldom to notable religious reformers unless they formed part of the establishment. I wonder what contemporary historical documentation there might be for the existence of Lao Tzu, Siddartha Gautama (founder of Indian Buddhism), Confucius, or for that matter Moses. Yet as with Jesus, their movements survive them.\nLast year, I had read an interesting book on those matters. The title was Walter Vogel Ojcowie religii (original German title was Die Religionsstifter, ‘The founders of religion’). It had biographies of following religious figures: Moses, Buddha, Muhhammad, Akhenaten, Zoroaster, Confucius, Laozi, Mani, Guru Nanak and Bahá’u’lláh. Except for the two last figures from the relatively modern period, it seems that the life of Jesus is the best documented.\n\n","date":"October 6, 2014 at 3:40 pm","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","id":"comment-159906","author":"O.K.","site":"shroudstory"},{"title":"Jerry Coyne Once Again","post":"And biography of Jesus, of course.\n\n","date":"October 6, 2014 at 4:21 pm","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","id":"comment-159914","author":"O.K.","site":"shroudstory"},{"title":"Jerry Coyne Once Again","post":"“Except for the two last figures from the relatively modern period, it seems that the life of Jesus is the best documented.”  – which was the fundamental point I had intended to convey!\n\n","date":"October 6, 2014 at 4:01 pm","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","id":"comment-159908","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jerry Coyne Once Again","post":"It’s more than a mere academic question:\n“But whoever denies Me before men, I will also deny him before My Father who is in heaven.” Matt 10:33\nJerry Coyne could be getting into some serious trouble for himself!\n\n","date":"October 6, 2014 at 5:05 pm","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","id":"comment-159923","author":"daveb of wellington nz","site":"shroudstory"}]
