[{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"Dan, you first blindly follow the Margaret of Austria hypothesis, now you seem to share Ray’s. Dan, like (late) Rogers and Di Marino, you seem to totally ignored very fine repairs were ALSO made in 1863. Too bad you cannot read French. In a 2007 paper, I did explain why the invisible French reweaving JUST CANNOT HAVE BEEN MADE BEFORE 1532. I sent you the relevant extract which completly rules out the Margaret of Austria hypothesis. Should I repeat here the 1863 is the most likely?\n\n","date":"January 9, 2012 at 3:31 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6718","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"Typo errors: read “ignore” istead of “ignred” & “Marino” instead of “Di Marino”.\n\n","date":"January 9, 2012 at 3:58 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6721","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"The most likely = AFTER more than 8 centuries (1357-1863) of both private & public bare-handed ostensions (the Shroud being each time stretched out in the same way).\n\n","date":"January 9, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6719","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"CollinB wrote: “why go to all the trouble of invisible mending, in a corner, when there is massive fire damage elsewhere.” \nThe fact is the relic not only badly needed a few repairs to be hold more safely on the 1863 ostension but those were made by… very pious christian hands.\n\n","date":"January 9, 2012 at 4:16 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6724","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"…and very skillful christian hands indeed.\n\n","date":"January 9, 2012 at 4:18 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6725","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"In response to Sciencebod making a comment on my blog about when was the repair done, I wrote that I hadn’t given it much thought, but on checking Benford & Marino’s online 2008 Chemistry Today paper, I provisionally accepted it was in the 16th century.\nThen in response to Sciencebod’s pointing out the unlikelihood of bothering to invisibly mend a small part of the Shroud after the 1532 fire, I further checked and then wrote:\n———————————————————————\nReading Shroud.com’s “Shroud History: 1500s” I would have thought between 1502 and 1509 when Marguerite of Austria took control of the Shroud and installed it at Chambéry Castle: \n“June 11, 1502: At the behest of Duchess of Savoy Marguerite of Austria, the Shroud is no longer moved around with the Savoys during their travels, but given a permanent home in the Royal Chapel of Chambéry Castle. ….\n1509: New casket/reliquary for the Shroud is created in silver by Flemish artist Lievin van Latham, having been commissioned by Marguerite of Austria at a cost of more than 12,000 gold ecus. …”\nwould be a likely time that invisble repairs were made to the Shroud. \nBut I have ordered Joe Marino’s new book, “Wrapped Up in the Shroud” and will wait and see what he says in it.\n———————————————————————\n\n","date":"January 9, 2012 at 6:36 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6737","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"OK, I’ll have to reply to you here, despite having said adieu to a site with some very pompous, patronising,  know-all contributors.  But seeing as how you mention me by name, but refused to take a second comment from me on your own site,stating that you blog “to express your own view” and “not to invite debate” then I shall  make one quick observation here, and then depart. \nLet’s suppose that Margaret of Austria commissioned repair work on the Shroud, and that it was carried out before the fire (bearing in mind she died just two years before the fire), i.e. before being extensively damaged.  What proportion of the shroud would have required highly demanding, time-consuming invisible mending? Probably not more than1 part in a 1000 at the most, would you agree-  if iit was not to take an eternity?\n Given that the shroud is 4.4 x 1.1 metres, that is 48,400 sq cm, so repairs were needed on just 48 sq cm.  Yet the sample taken was a strip 7cm x 1 cm, i.e. 7sq cm.  The chances of a strip of just 7sq cm having major repairs (especially at a corner)  sufficent to throw carbon-dating, when there are just 48sq cm of repaired areas scattered around a total area of fabric some 1000 times as great are minuscule. I shan’t try doing the probability calculation  this time of night, and in any case I am rusty in that department.  The very idea that the sample taken for C dating happened to have Margaret of Austria’s invisible repairs is so improbable, statistically speaking, as to be for all intents and purposes a non-starter.\n\n","date":"January 9, 2012 at 7:28 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6740","author":"sciencebod","site":"shroudstory"},{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"PS:  And that’s still true when one realises, belatedly, that only half the area was sampled, ie the half that covered the forward-facing, ie. ventral, aspect of the image.\n\n","date":"January 9, 2012 at 7:50 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6741","author":"sciencebod","site":"shroudstory"},{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"As I and others, especially Dan, have pointed out: 1. the Pray Codex (1192-95), 2. the Vignon markings unique to the Shroud on coins and art from the 6th century, 3. the exact match of bloodstains on the Sudarium of Oviedo (which has been in Spain since at least AD 840) and the Shroud, and now 4. the ENEA report showing that the Shroud’s image is only “one fifth of a thousandth of a millimeter” and therefore it could not possibly have been created by a medieval or earlier forger.\nBecause of any one of the above, let alone all four, lines of conclusive evdience that the Shroud is not medieval, the AD 1260-1390 medieval radiocarbon date of the Shroud simply has to be wrong. The only question now is: how did the three radiocarbon laboratories get it so wrong?\nThe ball is now in the Shroud anti-authenticist court to try to find a face-saving answer. The pro-authenticity side no longer have to provide an answer since it no longer is (if it ever was) their problem.\nThe 16th century invisible reweave theory is a possible explanation, among many, of how the radiocarbon labs got it wrong. If Sciencebod and his Shroud anti-authenticist ilk don’t like that explanation, then let him/them find another. It’s now his/their problem, not ours!\n\n","date":"January 9, 2012 at 9:04 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6746","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"Someone who considers that all four lines he cites as constituting “conclusive”\nevidence clearly has no idea about scientific as distinct from anecdotal evidence. Exact matches re blood? What, when someone claims it wastype AB, and someone else scoffs at that evidence. Or elevated levels of bilirubin, despite the fact that bilirubin is light-sensitive and prone to photoxidation? I could tell you quite a lot about the latter, having spent two years researching the phototherapy of neonatal jaundice (my first published paper in 1972 as it happens).\nAs for “three radiocarbon labs getting it wrong”, that is wilful misrepresentation of the facts. The three labs each returned a medieval date for the contiguous samples they were provided, so in what way were they wrong?  \nWhat was wrong was that the single sample site was chosen at the last minute by one\nProfessor L. Gonella (Department of Physics, Turin Polytechnic) described as the Archbishop’s scientific adviser. But while there were 21 names on the carbon-dating paper, his was not one of them. (There’s an expression about power without responsibility that springs to mind, involving a prerogative  …). Suffice it to say that no blame can be attached to the radiocarbon dating labs if they were fobbed off with a sample that was unrepresentative of the Shroud in general. If you want to ask a meaningful question, ask this one: were the labs deliberately given a sample known to be compromised, such that the carbon-dating could be rubbished if it returned the “wrong” answer.\nThe correct response of those like yourself who still believe the Shroud to be authentic is not to attack the science and the scientists, but to confront the Turin stewards of the Shroud and their so-called scientific advisor, and INSIST that the work be repeated with proper randomised sampling sites. The argument that the Shroud must not be damaged in prominent areas should be kicked into the long grass, not just because of the major damage already sustained as a result of the fire, but because of the shabby way that three scientific laboratories have been treated – simply for doing analyses on the samples provided, And shame on you too for continuing to badmouth the science when the real target for criticism should be reserved for those guardians of the Shroud, and their so-called science advisor at Turin Poly.\n\n","date":"January 10, 2012 at 4:20 am","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6755","author":"sciencebod","site":"shroudstory"},{"title":"Sciencebod, Do some homework on the Shroud of Turin","post":"Nevertheless, I will respond to Sciencebod’s comment!\n>Let’s suppose that Margaret of Austria commissioned repair work on the Shroud, and that it was carried out before the fire (bearing in mind she died just two years before the fire), i.e. before being extensively damaged. \nAgreed. Between 1502 and 1509 seems to be the most likely dates. \n>What proportion of the shroud would have required highly demanding, time-consuming invisible mending? Probably not more than 1 part in a 1000 at the most, would you agree- if iit was not to take an eternity?\nNo. Medieval invisible reweavers repaired whole tapestries, so the comparatively tiny area of the Shroud it is proposed was patched would not take long.  \n>Given that the shroud is 4.4 x 1.1 metres, that is 48,400 sq cm, so repairs were needed on just 48 sq cm. \nNo. Sciencebod’s “not more than 1 part in a 1000 at the most” is just a figure plucked out of the air.\nI have read somewhere that Margaret may have been motivated to invisibly repair only a particular patch of the Shroud that was removed since it came into the possession of her Savoy family.   \n>Yet the sample taken was a strip 7cm x 1 cm, i.e. 7sq cm. The chances of a strip of just 7sq cm having major repairs (especially at a corner) sufficent to throw carbon-dating, \nChance has nothing to do with it. The corners are the most damaged areas of the Shroud, because they are structurally the weakest, and from time immemorial the Shroud was held up during expositions by its corners.\nAlso, relic pieces were taken from the corners, no doubt on the principle that since it was already damaged, with pieces missing, a little bit more taken would be less noticed.\nIf Sciencebod had actually taken the trouble to study his topic, i.e. buying and reading books on it, not just `cruising the  web’, he would know that was in fact why it was decided that the sample cut from the Shroud and given to the three labs, would be from the same already damaged and patched bottom left-hand corner of the Shroud. So that it would cause minimal visual impact to the Shroud:\n“Nor is this the only cause for disquiet. The 1986 protocol laid stress on the care which Mme Flury-Lemberg should exercise when choosing the location from which the samples for the radiocarbon dating should be taken. Yet despite all the years of apparent planning for the taking of the carbon-dating samples it was not until the very moment itself that Gonella and Riggi chose this location – after a very public, heated and protracted argument witnessed and attested by the entire contingent of bemused radiocarbon-dating scientists. They could hardly have chosen anywhere much more unsuitable than they did … But now we come to the decision that Gonella and Riggi arrived at after their argument: to take the sample in the form of one single sliver from the frontal image bottom corner closest to the side-strip. This must be regarded as misguided in the extreme. For yet another major cause of possible contamination of a radiocarbon-dating sample arises from any excessive handling to which it may have been subjected at times distant from when it originated. And when we study the hundreds of depictions of the Shroud being held up before the crowds during past centuries, what do we see? In example after example a cleric’s hand can be seen holding up the Shroud at, yes, the frontal image bottom corner closest to the side-strip. …. Also, while their wisest decision would have been to take several tiny samples from scattered areas, by opting for just this single site they ensured that any contamination error, however large or small, would be bound to be repeated by all three laboratories.” (Wilson, I., “The Blood and the Shroud: New Evidence that the World’s Most Sacred Relic is Real,” Simon & Schuster: New York NY, 1998, pp.190-192).\n>I shan’t try doing the probability calculation this time of night, and in any case I am rusty in that department. \nI will help Sciencebod with his “probability calculation.” Probability ranges from 0 (impossible) to 1 (certain). Since the corners were the most damaged, and relics had already been taken from there, the probability is almost certain, close to 1, say 0.95, that a 6th century invisible repair to a piece that was taken for a relic, would be in the area where the radiocarbon dating sample was taken.\n>The very idea that the sample taken for C dating happened to have Margaret of Austria’s invisible repairs is so improbable, statistically speaking, as to be for all intents and purposes a non-starter.\nNo. Far from being, “so improbable” that “the sample taken for C dating happened to have Margaret of Austria’s invisible repairs” it is highly probable that it was from the same area, given that both were for the same underlying reason: 1) to repair the most badly damaged corner, from which relics had been taken; and 2) to take the sample from the most badly damaged corner, from which relics had been taken!\n\n","date":"January 10, 2012 at 12:37 am","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","id":"comment-6752","author":"Stephen E. Jones","site":"shroudstory"}]
