[{"title":"Scientific Conclusions Changing Again","post":"The only thing I will say is this (and I’ve already said this here) :  NATURE CAN BE REALLY SURPRISING !!!!!! :-)  People should NEVER forget this when it comes to speculate about what body image formation process was involved with the Shroud of Turin…\n\n","date":"September 22, 2011 at 4:56 pm","url":"https://shroudstory.com/2011/09/22/scientific-conclusions-changing-again/","cat":"science","id":"comment-4001","author":"Yannick Clément","site":"shroudstory"},{"title":"Scientific Conclusions Changing Again","post":"This news doesn’t surprise me one bit, I personally never put much strength in the theory that the speed of light was the apex in nature. The theory always reminded me of the speed of sound theory and we all know how wrong they were there. All this just goes to prove how little we ACTUALLY understand about anything.Yet those of study with thier swelled heads, would like us to believe they have the science of nature conquered…As for the formation theory being of a natural occurence; absolutely, it cannot be ruled out, but neither can something unnatural or dare I say supernatural, just because we cannot comprehend it in our present of ‘limited’ knowledge.Furthermore, with all the knowledge acquired thus far on the Shroud  imprint, it’s qualities and it’s nature, to me shows; proofs or evidence for a ‘natural-causation’ is lacking and very thin.But that is just my interpretation of things.\n\n","date":"September 23, 2011 at 6:10 pm","url":"https://shroudstory.com/2011/09/22/scientific-conclusions-changing-again/","cat":"science","id":"comment-4019","author":"Ron","site":"shroudstory"},{"title":"Scientific Conclusions Changing Again","post":"My friend Ron, I would agree with you if the image on the Shroud was made of a substence we never saw on earth or in the whole universe !  I hope you understand what I mean.  Because there are some well-known and natural chemical processes (like the Maillard reaction) that can produce a coloration on a linen cloth very similar to what is seen on the Shroud, I think there are some good chances that science will one day resolve the mystery sorrounding this body image.  \nRemember that, beside the STURP effort, there was NO other direct testing on the relic (except for the 1988 C14 dating) !!!  STURP knew so well that more researches needed to be done that they planned a Phase 2 program around 1984 (for another series of direct tests), but unfortunatelly, they were turned down by Turin (mainly because of some pressure made by the radiocarbon labs) !!!  So, I don’t want to offend you, but before crying out loud words like “supernatural” or “miracle” or “resurrection” regarding the body image that’s on the Shroud, let’s wait please for some more direct analysis on the relic.  After that, if science still look for answers, then maybe we could talk about some unkown process involved that science isn’t able to understand for the moment.  But until that day, I don’t think the STURP effort is enough to say that science have come full circle regarding the Shroud !  My feeling is that the image formation process have some chances to be something that science already understand well but that the STURP tests of the beginning of the 80s were not able to uncover completely.  I think it’s more of a “finding the correct recipe” kind of thing…  I have good hopes that a new series of direct testings (done properly and extensively) will help to answer many questions left opened by STURP.  And even the STURP team was thinking exactly that way in the 80s because they planned a Phase 2 program !!!  They knew that another series of tests could really help to find the truth about the Shroud.\nYou know my feeling right now about the body image ?  Maybe the answer to the mystery isn’t so extraordinary than most people think…  And probably that resurrection had nothing to do (directly) with it.  And don’t get me wrong, I believe in the resurrection and I believe the Shroud is the authentic burial cloth of Jesus-Christ, but because I’m a rational kind of guy,  I refuse to associate the two.  \nIf science wasn’t able to resolve the mystery until this day, maybe it’s just because there wasn’t enough experiments done regarding natural chemical processes.  Finding the exact “recipe” is not an easy task !  No doubt it takes A LOT of trials and I really don’t think there was enough trials until this day.  MORE RESEARCHES NEED TO BE DONE !  Unfortunatelly, it’s not a research subject that attract a lot of scientist.  But I think a second round of direct tests on the Shroud could help to awake the interest of some scientists, and also, a second round of direct tests will surely help to find the correct “recipe” for the image…  \nThat’s my feeling.\n\n","date":"September 24, 2011 at 8:21 pm","url":"https://shroudstory.com/2011/09/22/scientific-conclusions-changing-again/","cat":"science","id":"comment-4038","author":"Yannick Clément","site":"shroudstory"}]
