[{"title":"screw·y  1. crazy. 2. ludicrously odd, or inappropriate.","post":"Dorothy Crispino has researched a number of documents regarding Charny / Lirey affairs before 1390 or so, but none of them mention the Shroud. If it was the reason for all the correspondence, it is curious that it is not mentioned. Even in his memorandum, Bishop d’Arcis says nothing of Geoffrey I de Charny having been connected with it all, claiming that the Dean of the church was the man who had procured it. Surely de Charny knew about it, so why didn’t d’Arcis mention him? The family only come in for their share of criticism for allowing the second series of expositions to which d’Arcis took exception, and even then, he grudgingly admits that they themselves do not claim the Shroud is anything more than a representation. The two versions of the pilgrim medallion, with the switched positions of their shields, certainly suggest a dynastic change such as the death of the first de Charny, so that dating the earlier to 1355 or before seems justified, and the very presence of the shields suggests a Charny imprimatur. It does not necessarily mean that he found, was given or inherited the Shroud himself. Geoffrey II, of whom d’Arcis is critical, seems to disappear from Shroud connections very soon after d’Arcis’ complaint. The effigy of him in the Wikipedia article about his father seems to stem from Ian Wilson’s discovery of it in “Monuments français inédits pour servir à l’histoire des arts” (http://gallica.bnf.fr/ark:/12148/bpt6k1087131/f4.image), Plate 125, captioned: “Tombe de messire Geoffroy de Charny, mort l’an 1398. (ancienne abbaye de Froidmont, près Beauvais).” However, Froidmont is nowhere near Troyes, Lirey or Savoie, and, in spite of Wilson’s identification, there is no way the shields dotted about his body can be interpreted as “Gules three escutcheons argent”, the arms attributed by Froissart to Geoffroi I de Charny. In short, I don’t think this Charny is closely related at all. Dorothy Crispino (https://www.shroud.com/pdfs/ssi18part6.pdf) notes that there is a town – and associated family – called Charny in Yonne, near Thory, but decides “There was no relationship between these and the Charny of the Côte d’Or, from which Geoffroy took his cognomen.”\n\n","date":"May 31, 2015 at 6:28 am","url":"https://shroudstory.com/2015/05/31/screwy-1-crazy-2-ludicrously-odd-or-inappropriate/","cat":"other_blogs","id":"comment-200665","author":"Hugh Farey","site":"shroudstory"},{"title":"screw·y  1. crazy. 2. ludicrously odd, or inappropriate.","post":"There is so much here that is fascinating and yet seemingly peculiar.  \nFor instance, how reliable might the 1525 document be, posted in the Lirey church some 183 years after 1355, and only 134 years after D’Arcis drafted his memorandum denouncing it.  It seems that Chevalier accepted the 1525 document as valid, so what motivated Chevalier to make so much of the D’Arcis memorandum, in a deceptive way according to Markwardt?  The family connection between D’Arcis and Geoffroy I, via Alix de Joinville is intriguing, and so it would be surprising if D’Arcis did not know of King Philip’s donation of the Shroud to Geoffroy, so why did he denounce it, claiming it was painted by an artist?  Was it jealousy, or did he consider that it would be more appropriately housed in his own cathedral in Troyes, rather than an insignificant collegiate church in a small village?  The text of the bailli’s requisition of the Shroud from the De Charnay family, seemingly authored by D’Arcis, suggests that this would seem quite likely. \nJones’ 1343 dating of the king’s intention to endow Geoffroy with the Shroud certainly seems plausible, and he gives reason for this bequest, the (possible?) saving of the king’s son John II at Angiers.  The suggested involvement of the two Avignon popes Clement VI and Innocent IV, who Jones seems to imply knew of the plan to house the Shroud there, may explain the later Clement VII’s (another family connection) command of silence to D’Arcis. \nHugh’s comments concerning the alleged effigy of Geoffroy II in Froidment is apt, and it may be that this effigy is not Geoffroy II at all, but conceivably another knight of the same name, I think I can now count up to four separate Geoffroy’s de Charnay, including the templar burnt at the stake in 1314.  Why was this name so popular at this period of history, surely not the French equivalent of ‘John Smith’ ?\n\n","date":"May 31, 2015 at 4:21 pm","url":"https://shroudstory.com/2015/05/31/screwy-1-crazy-2-ludicrously-odd-or-inappropriate/","cat":"other_blogs","id":"comment-200695","author":"daveb of wellington nz","site":"shroudstory"},{"title":"screw·y  1. crazy. 2. ludicrously odd, or inappropriate.","post":"Please google my many blogs on my families associations w/ the Shroud of Turin in this manner…I am directly descended from the Troyes Fraternity Families who had the Shroud thus…..GOOGLE : EUGENE RAY / VERGY ( by marriage to my de Gruy(ere) ancestors\nGOOGLE : EUGENE RAY / SAVOY-BRESSE ( by DNA to my Ray ancestors ) study these\nThe Shroud was moved from the deRay Castle to Le Ray Chapel by Ray descended Vergy\n\n","date":"June 3, 2015 at 1:36 pm","url":"https://shroudstory.com/2015/05/31/screwy-1-crazy-2-ludicrously-odd-or-inappropriate/","cat":"other_blogs","id":"comment-200998","author":"Eugene Ray","site":"shroudstory"},{"title":"screw·y  1. crazy. 2. ludicrously odd, or inappropriate.","post":"As I replied in another post, I have tried. I find your website very difficult to follow. If you have any evidence for any of your claims, why not post it here?\n\n","date":"June 3, 2015 at 5:11 pm","url":"https://shroudstory.com/2015/05/31/screwy-1-crazy-2-ludicrously-odd-or-inappropriate/","cat":"other_blogs","id":"comment-201015","author":"Hugh Farey","site":"shroudstory"},{"title":"screw·y  1. crazy. 2. ludicrously odd, or inappropriate.","post":"Giving some little traction to Stephen Jones’ KGB conspiracy theory on computer hacking of the 1988 radiocarbon tests: \nCheck out recent news items on KGB network of spreading false terror reports, using students and others enlisted as “Kremlin trolls”.  \nGoogle on “Lyudmila Savchuk”, an activist who deliberately enrolled as a troll to expose these activities.\nSample Spiegel interview: http://www.spiegel.de/international/world/interview-with-ex-russian-internet-troll-lyudmila-savchuk-a-1036539.html  \nThere are several other reports on Savchuk’s expose.  She was dismissed in March after giving a local journalist an interview about these activities.  She is now suing her former bosses, seeking damages and demanding closure of the company as employees did not have proper employment contracts.  The group’s activities used various social media outlets  to create panic in the United States including: a non-existent explosion at a chemical plant in Louisana; an ebola outbreak in Atlanta; a false video where Islamic State claimed credit for the attack on the chemical plant; a false report that an unarmed black woman had been shot in Atlanta: etc, etc.\n\n","date":"June 3, 2015 at 9:54 pm","url":"https://shroudstory.com/2015/05/31/screwy-1-crazy-2-ludicrously-odd-or-inappropriate/","cat":"other_blogs","id":"comment-201031","author":"daveb of wellington nz","site":"shroudstory"}]
