[{"title":"And now you have something to do this weekend","post":"I have a terrible idea that may help to resolve two problems.  Problem #1 is the Shroud of Turin the actual burial cloth of Jesus Christ, Problem #2 How did the artist of the Prince of Peace (Akiane Kramarik) know how Jesus Christ looked.\nI have read that folks who have examined the photo image of the Shroud and weighed it against the image of the Prince of Peace  have that it is about 85% accurate on all the comparable points.  How can that be ?  Get a few Federal criminologists, preferably non-Christian or Atheists and give them a series a questions to ask Akiane about her knowledge of the actual appearance of or  what Jesus really looks like. I had read that she denies  ever seeing the Shroud image before her so-called dream(s).\n  In other words a series of Polygraph tests,  Of course you will have to pay her. Then we have the problem with how the 12th century forgers knew ahead of time what Akiane’s painting would look like.  Maybe Akiane is one of the old forgers reincarnated.  That would have to be one of the questions to ask her.\nThis has to be one of the dumbest things I have ever written.\n\n","date":"October 24, 2015 at 2:29 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213483","author":"Emmett McMahon","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"Dan —I must admit I feel a little sceptical, not based on the evidence, but from\nan innate doubt that God would work in this way…\nIf you are a true Christian (Catholic or non Catholic) or a follower of only Jesus (like me) we don’t want any sort of evidence like Shroud of Turin as a true burial cloth of Jesus.\nBut for agnostics or atheists require some sort of evidence to accept the Shroud of Turin as a true burial cloth of Jesus. This may be the reason Jesus left his battered image on this burial cloth that he really lived on this earth and resurrected from the death.\n\n","date":"October 24, 2015 at 4:08 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213485","author":"Sampath Fernando","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"Hatfield:  “after all, Jesus refused to use spectacular signs to authenticate himself.”\nDoes this guy really read the New Testament?  Or is he just unbelievably selective in doing so?\nJohn 14:11. Believe me when I say that I am in the Father and the Father is in me; or at least believe on the evidence of the miracles themselves.  \nActs 1:3 — “after His suffering, He presented Himself to them and gave many convincing proofs that  He was alive.”\nSpectacular signs?  How about raising people from the dead?\n\n","date":"October 24, 2015 at 10:14 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213500","author":"Nabber","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"Add this to the arsenal as well, from Hebrews 2:3-4  “This salvation, which was first announced by the Lord, was confirmed to us by those who heard him. God also testified to it by signs, wonders and various miracles, and by gifts of the Holy Spirit distributed according to his will.”\n\n","date":"October 24, 2015 at 12:42 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213507","author":"Russ Breault","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"Thanks again Joe!!\n    What? Jesus didn’t perform spectacular signs?  The Shroud (the sign of Jonah) is the sign He promised a wicked and adulterous generation.  The current generation qualifies. And the Burial Cloth of Jesus is far more spectacular than walking on water, raising Lazarus, or feeding 5000 with a sack lunch.\n\n","date":"October 24, 2015 at 11:08 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213503","author":"Chuck Hampton","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"Primary sources, primary sources. It is often claimed that ancient linen was bleached in hanks before it was woven into cloth, while medieval linen was bleached after it was woven. The alleged ‘banding’ on the Shroud would thus suggest the ancient method. Well, I’ve been scouring Pliny the Elder and find no reference to this at all. Quite the reverse. Ancient accounts are full of mentions of bleaching cloth, not hanks. Can anybody provide any sources for an ancient bleaching system involving hanks, not whole cloth?\n\n","date":"October 24, 2015 at 12:03 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213505","author":"Hugh Farey","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"Primary sources, primary sources, Hugh.  Where are the sources for your assertion that ancient sources mention bleaching cloth not hanks?  There is a problem.  We now know that we don’t know the origin of the cloth.  The practices might have been anything.  I do recall seeing an elaborate Egyptian depiction of weaving and spinning, can’t remember if it included the bleaching process or not.  What’s needed is an identification of source of the original flax.  Can the flax DNA be extracted from processed linen, or is that not possible?\n\n","date":"October 24, 2015 at 1:32 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213512","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"Responding to one question with another is an evasion, not an answer. Entering “ancient linen bleaching techniques” in Google throws up a number of books, such as “Prehistoric, Ancient Near Eastern & Aegean Textiles and Dress”, ed. Marie-Louise Nosch, or R.J. Forbes, “Studies in Ancient Technology”, which describe, with sources, cloth preparation including bleaching. Cuneiform tablets, tomb paintings and archaeological remains of cloth preparation vats such as the fullonica of Pompeii seem the primary sources, although there are some mentions in papyri (such as the Papyrus Lancing in the British Museum), and Pliny himself mentions a plant used in bleaching cloth, not thread or hanks.\nNow, can anybody provide any sources for an ancient bleaching system involving hanks, not whole cloth?\n\n","date":"October 24, 2015 at 5:07 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213520","author":"Hugh Farey","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"Not an evasion!  Merely noted your objection, but your assertion did not comply.  What were your sources? You have now supplied them, Thank you!  \nAs you have indicated, the banding has sometimes been attributed to use of differently bleached yarns, it seemed a plausible explanation, and I’m one of many who have accepted this at face value.  It still seems a plausible explanation.  Possibly it may indicate that the cloth might not have come from the Aegean, the Near East, Babylonia, nor Pompeii.\n\n","date":"October 24, 2015 at 9:23 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213535","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"“Responding to one question with another is an evasion, not an answer”\nTry telling that to Jesus, Hugh. He did just that all the time.\n\n","date":"October 24, 2015 at 11:10 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213537","author":"Matthew L.","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"Fair enough.\nNow, can anybody provide any sources for an ancient bleaching system involving hanks, not whole cloth?\n\n","date":"October 25, 2015 at 3:23 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213548","author":"Hugh Farey","site":"shroudstory"},{"title":"And now you have something to do this weekend","post":"Glad to see Sovik’s articles posted here…Those articles are in my opinion very good, and fair.\n\n","date":"October 24, 2015 at 1:12 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","id":"comment-213510","author":"Matthew L.","site":"shroudstory"}]
