[{"title":"Shroud of Turin Relationship to NDE and OBE?","post":"I have a deep interest in NDEs. I had a short piece published in the recent edition of the Journal of Near Death Studies and am working on another piece for that journal. This article was surprisingly well done, in my view, and I’m glad to know about the book it came from.\nIs there a relationship between the Shroud and NDEs? I think that is certainly possible. It’s what I have intuitively felt. There is a fascinating case of a woman named Anita Moorjani (her book, Dying to Be Me, was released last month and is doing very well on Amazon). After a long battle, she “died” from stage 4 lymphoma, her body riddled with tumors the size of lemons. While on the other side (her description), she was shown that she had been living in fear, while she was meant to live in love. She was told that, now that she had realized that, if she chose to go back, her body would adjust to her new love-based way of being, and would heal quite quickly. This, miraculously, turned out to be true.\nWhat is particularly interesting from the standpoint of the Shroud is that she was also told that, depending on her choice to return to her body or not, test results would yield different verdicts. If she chose to stay, the results would show she died from her cancer. If she returned to her body, the results would show a cancer on the retreat.\nThe really mind-bending thing is that this test had already been done; however, the results were not yet in. When she did return to her body, it happened exactly as she was told it would.\nTaken at face value, her story is one in which some kind of spiritual influence came from (through?) her disembodied mind to her “dead” body, transforming that body and, what’s more, leaving an (apparently back-dated) imprint on a medical test.\nThe obvious implication is that the Shroud could have been the result of a similar kind of phenomenon (though without the “back-dating” element); only, in the Shroud’s case, this phenomenon would have been taken to a much greater extreme, so that, rather than the body being healed, over weeks, of what killed it, the body would have been instantly transformed into some other order of being. So maybe the Shroud was produced by the same sort of thing as we see with Anita Moorjani, only in this case, the spiritual influx would have been far greater.\n\n","date":"April 24, 2012 at 4:19 am","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","id":"comment-10804","author":"Robert","site":"shroudstory"},{"title":"Shroud of Turin Relationship to NDE and OBE?","post":"Of course, everyone is free to express himself but, honestly, I think that there are not scientific grounds to support all the logical sequence mentioned here. Call it speculations and possibilities about quantum level physics conciousness, NDE and the Shroud. But please, don´t call it science when at the current stage of currently admitted science, there are no grounds to support such a connection. Unfortunately, every now and then, someone tries to build unexisting links between the 2nd principle of thermodynamic, modern physics…………..and the Shroud. In my view, this only helps to keep serious analysis and researchers belonging to science mainstream, far from the Shroud. Please, ask yourselves the following question: are you contributing to convince Shroud owners to do open and independent research, attract high-level scientists and so move forward in current knowledege?\n\n","date":"April 24, 2012 at 8:03 am","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","id":"comment-10809","author":"Gabriel","site":"shroudstory"},{"title":"Shroud of Turin Relationship to NDE and OBE?","post":"“There are more things in Heaven and Earth, Horatio, than are dreamt of in your philosophy.” Hamlet I v. \nOr if you prefer: “Man does not live by bread alone … ” Matt 4:4, Deut 8:3. \nI doubt if any scientific discipline ever had a single fundamental idea that had not appeared in the genre of Science Fiction first.  Speculation is the food of Science.  It would be a very boring existence and a rather boring Blog site, if there were only room for rigorous science, and none for other aspects of human experience. \nEven scientists such as John Klotz and even Gabriel are entitled to their speculations.\n\n","date":"April 25, 2012 at 8:11 am","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","id":"comment-10832","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Shroud of Turin Relationship to NDE and OBE?","post":"Your absolutely right in your scientific dicipline statement, in actuality if people had not delved further with thier speculations, where would we be today? No planes maybe, no cell phones, etc; People should watch some Michio Kaku videos, he’s an enlightened physicist.\nYou tube; Mikio Kaku: SCI FI or SCI FACT, Part 1 is a good one. ;-)\nRon\n\n","date":"April 25, 2012 at 5:01 pm","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","id":"comment-10845","author":"Ron","site":"shroudstory"},{"title":"Shroud of Turin Relationship to NDE and OBE?","post":"He’s quite funny too!\n\n","date":"April 25, 2012 at 5:01 pm","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","id":"comment-10846","author":"Ron","site":"shroudstory"},{"title":"Shroud of Turin Relationship to NDE and OBE?","post":"I enjoyed Michio Kaku’s book on Parallel Universes, and ended up writing an article on Goldilock Zones for my parish magazine – I later discovered that the article had influenced  a recreant reader to redeem his spiritual outlook.  \nWe can’t know yet whether Parallel Universes have any sort of reality or not, but it helped me as a stepping stone to my own insight on the omni-present Godhead and the reality of the communion of saints. \nErnst Mach was a physicist of the old school was successful and influential but had no time for speculation.  As late as 1895 he was denying the existence of atoms, despite chemists using them on an empirical basis for 100 years.  His influence with the establishment led the visionary Ludwig Boltzmann to commit suicide.  Within 10 years Einstein had proved the existence of atoms from Brownian movement calculations.  Mach is now merely a cipher in the history of science, but Boltzmann is seen as an early pioneer in quantum mechanics.  [Check “Boltzmann’s Atom” by David Lindley, ‘Free Press’ – Simon & Schuster 2001]\n\n","date":"April 25, 2012 at 5:56 pm","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","id":"comment-10849","author":"daveb of wellington nz","site":"shroudstory"}]
