[{"title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus","post":"Plain rubbish. One does not need to be a biblical scholar to understand what family relations meant to Jesus. Did he change his mind after the Resurrection? It does not seem so. He appointed Peter as the head of the Church. James, his cousin, to whom he appeared, later became the first bishop of Jerusalem and Judah bar Kyriakos, the last of the twelve Jewish-Christian bishops of Jerusalem was a descendant of Jude, also related to Jesus.\nWhat we read in the New Testament is the Word being preached, no talk about any burial shroud being carried around as “proof” of the Easter event.\n\n","date":"November 25, 2014 at 6:53 am","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","id":"comment-172921","author":"Louis","site":"shroudstory"},{"title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus","post":"I think the KGB hacked the Gospel of the Hebrews.\n\n","date":"November 25, 2014 at 7:07 am","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","id":"comment-172923","author":"Paulette","site":"shroudstory"},{"title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus","post":"John is often thought of as the “beloved disciple”. Is that relevant?\n\n","date":"November 25, 2014 at 7:52 am","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","id":"comment-172927","author":"Hugh Farey","site":"shroudstory"},{"title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus","post":"Methinks Stephen got Yeshua’s (extended) family links all mixed up. Mary the step-mother of James is Mary the mother of Jesus/Yeshu’a. On the cross, the latter gave John (Mark), his beloved disciple, as a new son to his own mother, Mary. Besides there are more than one John. Hence Stephen’s confusion.\n\n","date":"November 25, 2014 at 7:52 am","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","id":"comment-172928","author":"Max patrick Hamon","site":"shroudstory"},{"title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus","post":"Addendum: John (Mark) lived in Jerusalem at the time of Yeshua’s death and resurrection while John of Salome was the son of Zebedee, a Galilean fisherman.\n\n","date":"November 25, 2014 at 8:10 am","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","id":"comment-172932","author":"Max patrick Hamon","site":"shroudstory"},{"title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus","post":"It is sad to see people in the realm of Shroud studies clutching at straws in order to authenticate the relic. Are they being different from people in other fields who have other points of view and who also employ similar methods?\nWe have an attempt to find what remained of Jesus (and Mary Magdalene) in Talpiot:\n https://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nBefore that attempt began, there was another, much bigger one, where Jesus was taken not to Talpiot but to Kashmir:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nThe first attempt has been debunked. As for the second one, it is better to excavate the Kashmir tomb and show the world that who is buried there is the Sufi mystic Yuz Asaf.\nPlease, “Shroudies” should show better research.\n\n","date":"November 25, 2014 at 8:14 am","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","id":"comment-172933","author":"Louis","site":"shroudstory"},{"title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus","post":"Considering John was the youngest member, he most certainly wasn’t a priest since there was a minimum age limit for that.  It is likely that he had connections, probably by birth.  There is no evidence from historical documentation or Scripture that Jesus and John were related.\n\n","date":"November 25, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","id":"comment-172995","author":"Andy","site":"shroudstory"},{"title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus","post":"The number of different Jewish names in NT Palestine was very limited.  From the Rahmani statistics of 286 names on 231 inscribed ossuaries, only 16 names account for 75% of all names appearing in that sample.  Some significant names including their variants are:  Salome ~9.1%, Simon ~9.1%, Mary ~7.0%, Joseph ~6.6%, John ~4.2%, Yeshua ~3.5%, James ~1.8%.  The Witherington statistics reflect a similar kind of pattern. \nThe apostle John of Zebedee was a Galilean fisherman, one would think an unlikely candidate for a Jewish priest.  There seems to be no good cause for asserting that he was closely related to Jesus, other than both being Galileans and possibly living in the same town.  Luke records that Jesus and John the Baptist were cousins through their mothers, Mary & Elizabeth. Luke also claims that John the Baptist’s father was the priest Zechariah. Both John Mark and Mary his mother are recorded in Acts 12 as living in Jerusalem.  Adrie vd Hoeven has asserted that John Mark had a temple function as secretary to the High Priest, and has made a case for the Shroud being his temple garment.  John Mark has been credited with writing the second gospel based on his close association with Peter in Rome.  I am unable at present to accept the argument that he is also the writer of the fourth gospel.  \nBecause of the limited number of names used in NT times, I believe great caution is required when attempting to identify persons with the same name as the same person.\n\n","date":"November 25, 2014 at 9:42 pm","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","id":"comment-173008","author":"daveb of wellington nz","site":"shroudstory"}]
