[{"title":"The End if Near","post":"The typography of this piece shows (a) it was created early in the morning and (b) edited inartfully. I will try to correct it so that it is more uniform.\nJCK\n\n","date":"August 20, 2015 at 6:43 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208606","author":"John Klotz","site":"shroudstory"},{"title":"The End if Near","post":"The end of argumentative Shroud Researchers?\n\n","date":"August 20, 2015 at 7:16 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208607","author":"Dcn Andy","site":"shroudstory"},{"title":"The End if Near","post":"Here are UAH satellite temperatures:\n\nhttp://nsstc.uah.edu/climate/2015/june2015/june2015GTR.pdf\nGlobal climate trend since 1978 (=start of satellite measurements): .11°C/decade.\nSeems the end of the nonsense is not near at all.\n\n","date":"August 20, 2015 at 7:41 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208608","author":"Jos Verhulst","site":"shroudstory"},{"title":"The End if Near","post":"The Pope says, “God -whom we know as Allah…” ?  Insanity.  The “Allah” of the Koran is nothing like God.  If Allah exists, it is some other entity.\n\n","date":"August 20, 2015 at 7:57 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208609","author":"Nabber","site":"shroudstory"},{"title":"The End if Near","post":"The name ‘Allah’ (refering to God) was actually used by early Arab Christians and was appropriated by Muslims. They adamantly deny this but most scholars concur.\n\n","date":"August 20, 2015 at 8:14 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208612","author":"David Goulet","site":"shroudstory"},{"title":"The End if Near","post":"That is pure horse-puckey.  “Most scholars concur”?  “Most ‘scholars’ named David Goulet”.  Prove it.  \nAnd, that’s NOT to what the Pope refers, anyway.  Stay with the subject.\n\n","date":"August 21, 2015 at 7:34 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208670","author":"Nabber","site":"shroudstory"},{"title":"The End if Near","post":"I was simply adding an observation. Louis corroborated this below. True, this is not what Pope Francis was speaking of. I suspect (because unlike you I can’t read minds) Francis was speaking in terms of the God of the Universe. In this sense he is correct. I do agree with you that it can be confusing to align Allah with Yahweh , the Triune God. \nBut we know our pontiff likes to speak off the cuff and from the heart. This sounds like something he said in an effort at bridge-building. He’s trying to establish common ground first, then work from there into deeper understanding. It’s called evangelization via inculturation. It’s not ‘insanity’.\n\n","date":"August 21, 2015 at 8:26 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208673","author":"David Goulet","site":"shroudstory"},{"title":"The End if Near","post":"One of the messages of the Old Testament I believe is that God is essentially unknowable. Certainly that is a part of Christian theology. I have noted before, one the first lessons in catechism class (if not the very first) when I was seven was that becasue God exists beyond time and space we can never really understand and know him. He is a mystery. Having taught me that at seven, the Church has not spent seven decades teaching me all about God. I sense a conflict there.\n“In my Father’s house are many mansions: if it were not so, I would have told you.” John 14.2\nThe aberrant form of Islam practiced by ISIS does not  represent the entirety of Islamic thought. Like Al Qaeda, they may kill more Muslims than Christians. In Appalachia, there are Christians who handle poisonous snakes thinking that faith in Christ will protect them. Every so often He doesn’t. Than there are Christian sects that turn their backs on modern medicine and refuse vaccinations and blood transfusions.\nHenry the VIII’s  bloody tyranny in the name of Protestantism was matched by bloody Mary Stuart in the name of Catholicism. Queen Elizabeth’s reign was no walk on the beach either.\nISIS is a plague on the face of the Earth for both Muslim’s and Christians. There are Islamic sects that are stuck in medieval times. Yet Islamic scholars in the Middle Ages were far advanced of Christian scholars in many areas including mathematics.\nDo not judge anyone by the label you hastily attach to him or her. “cast out first the beam out of thine own eye; and then shalt thou see clearly to cast out the mote out of thy brother’s eye.”\n\n","date":"August 20, 2015 at 10:46 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208627","author":"John Klotz","site":"shroudstory"},{"title":"The End if Near","post":"typo alert\n“not spent seven decades” = “now spent seven decades”\n\n","date":"August 20, 2015 at 10:48 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208628","author":"John Klotz","site":"shroudstory"},{"title":"The End if Near","post":"Hi Nabber and David\nBoth of you are correct, but it is time that we go deeper into the topic and I am working on it now, going further than what was written earlier:\nSee paragraph 3 in:\n https://www.academia.edu/14260892/Why_Harnack_and_Loisy_clashed_over_the_Church\nand how the question reached literature:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\nMore will be written as some fine tuning is being done by scholars in Germany and England.\n\n","date":"August 20, 2015 at 10:30 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208625","author":"Louis","site":"shroudstory"},{"title":"The End if Near","post":"Allah is supposed to have been a genéric name for the deity before the rise of Islam, therefore Indonesian Christians use it and are having problems. It is extremely important to remember that Jesus had his own views on God, Moses and Scripture and that is where the difference lies.\nI think John has not understood that there is no Christ, just Jesus, in Islam. What exactly did Jesus mean by Father’s house? He also used it with reference to the Temple, when the moneychangers were chased away. Whatever the interpretation is, it will have to be in agreement with the rest of Jesus’ sayings. Needless to say, it hás nothing to do with Islam because there is no room for any Divine Father of Jesus in this religion.\n\n","date":"August 21, 2015 at 7:55 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208671","author":"Louis","site":"shroudstory"},{"title":"The End if Near","post":"From Wright, Robert (2009-05-20). The Evolution of God (p. 335). Hachette Book Group. Kindle Edition: \n“Such parallels between the Bible and the Koran shouldn’t surprise us. Muhammad’s basic claim was that he was a prophet sent by the god who had first revealed himself to Abraham and later had spoken through Moses and Jesus. (One slightly ambiguous Koranic verse seems to say that he is the last in this lineage—the “seal of the prophets.”) The Koran is full of stories from the Bible and allusions to the Bible, including a monotheistic declaration that seems to come right out of Isaiah: “There is no God beside me.” 17\nI once had an Iranian immigrant client who was Pharsi. He introduce to me the concept of “The people of the book.” That meant Muslims, Christian and Jews whose religions were all due respect. I suppose 1,000 years of religious strife including the Crusades and Muslim conquest of the Holy Land and invasions of Europe put a damper on “People of the Book” but a 2008 novel at that name tells a fictionalized story of the Sarajevo Haggadah.\nIronically, one of the characters in the novel was a fictionalized Max Frei who found botanical artifacts on the Shroud of Turin in 1973 & 1978.\n\n","date":"August 21, 2015 at 9:55 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208679","author":"John Klotz","site":"shroudstory"},{"title":"The End if Near","post":"The discussion on this thread could go on and on, but I will add something in a few lines. David Goulet hás correctly noted that it is not possible to align Allah and Yahveh. The Indonesian govt. does not want the Christian version of God to be aligned with Allah, for theological reasons. The Turks, on the other hand, kind of forced Benedict XVI to pray at Hagia Sophia to the “same God” for polítical reasons as they want to enter the EU, while silently approving the IS today. The Orthodox Church hás hardly any rights in Turkey, and Christians are safer with Kurds, who helped the Armenians when they were being massacred by the Turks during the genocide.\nThere is something rethinking going on among highly qualified European scholars today. They are working on a more deep version of Christology, going beyond the topic as raised in the book (link “Jesus and Jahveh” above, on this thread).Note that the author says”Jesus did not tell us who he was”.\n\n","date":"August 21, 2015 at 10:47 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208685","author":"Louis","site":"shroudstory"},{"title":"The End if Near","post":"http://www.catholicherald.co.uk/news/2015/08/21/isis-destroys-ancient-syrian-monastery/\n\n","date":"August 21, 2015 at 5:38 pm","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208700","author":"Louis","site":"shroudstory"},{"title":"The End if Near","post":"Oh…Destruction. Yes it is a sad thing.\nBut Jesus message to everyone “don’t build any buildings on this world”.\nJesus message “New Commandment of Love” That is Love is permanent building. All the other things are temporarily.\n\n","date":"August 23, 2015 at 12:41 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","id":"comment-208747","author":"Sampath Fernando","site":"shroudstory"}]
