[{"title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes","post":"As I was saying yesterday, I’m no expert in probability and statistics, but here’s my hunch for what it’s worth.\nThe probability calculation would only be valid if the claimed design and apparent lettering had been clear enough to report before any numismatists were consulted. Once you say “Ah, this is the image of a coin” and then go looking, firstly for museum coins of the period, and then for their known markings by image tweaking, then it ceases to be an objective exercise suited to probability calculations.\nIf one cannot be absolutely certain from the markings per se  that the image is unequivocally that of a coin, lepton or otherwise,  then one is into the kind of minefield territory where any arrangement of 52 cards in a pack can be claimed by a statistical amateur to represent “impossible odds”.  But those impossible odds, calculated as 52 factorial, i.e. 1 in 52 x 51 x  50 …..  x 3 x 2 x1 are of course only relevant and valid  if one has forecast the particular order in advance…   It has to be a “genuine” prediction, based  purely on the laws of chance. One is not allowed to import extra information that shortens the odds, i.e. “loads the dice” in common parlance!\nThe key word is “tweaking”. Once you go looking for particular letters, and tweaking your way to “success”, then it’s no longer objective, and no longer science (merely confirming one’s preconceptions).\n\n","date":"May 11, 2013 at 8:04 am","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","id":"comment-33498","author":"colinsberry","site":"shroudstory"},{"title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes","post":"PS:  As regards the passage quoted re the ginormous odds, i.e. \n“…the probability that there is a lituus and one letter in the correct position over one of the eyes of the man on the Shroud is 1 in 1.827 x 106 x 6.1389 x 108[122] = 1.1216 x 1015, i.e. 121 with 13 zeroes after it. Therefore the evidence is very strong that there is an image of a Pontius Pilate dilepton minted between AD 29-32 over the right eye of the Shroud.”\npresumably what the author meant to say was that the probability of the coin image, or rather its billions(?) of constituent pixels, arising purely by chance was 1 in that very large number, i.e. essentially zero. (For that to be true, it would have had to be a sharp  and unmistakeable image, perfect in every respect, with every pixel in exactly the right place, and, as mentioned above, a straight photograph arrived at without any trial and error tweaking, but that’s by the way, and was certainly not the case).\nYesterday it was statistical number-crunching overkill. Today it’s probability number-crunching overkill. The expression is ‘over-egging the pudding’\n\n","date":"May 11, 2013 at 1:25 pm","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","id":"comment-33506","author":"colinsberry","site":"shroudstory"},{"title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes","post":"I asked earlier: “Is a lepton heavy enough to keep an eyelid closed?”\n\n","date":"May 11, 2013 at 9:31 am","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","id":"comment-33499","author":"Hugh Farey","site":"shroudstory"},{"title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes","post":"Has Father Filas’ work ever been examined by “outside the circle” of Sindologist?\nwouldn’t it have been more logical to hand off Fr. Filas’  prints and negatives to an impartial film manufacture that already has countless of film data and specs for each films Father Filas used?\n\n","date":"May 11, 2013 at 10:29 am","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","id":"comment-33502","author":"Giorgio","site":"shroudstory"},{"title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes","post":"Did Jones say 1 chance in a saganillion and think that was strong evidence?\n\n","date":"May 11, 2013 at 10:35 am","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","id":"comment-33503","author":"Frank Ly","site":"shroudstory"},{"title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes","post":"\nHugh Farey :\nI asked earlier: “Is a lepton heavy enough to keep an eyelid closed?”\n\nThese coins were made by first producing a long, thin strip of metal between two dies. The end of the strip was placed between two striking dies, and hit with a hammer. Then the strip was pulled quickly, about the length of one coin, hit again, and the process is repeated until the end of the strip is reached. After all the impressions had been made onto the metal, the coins were individually cut out. The two striking dies were not fixed in place very well, so many of the coins have the pattern on one or both sides off-center. The coins are from about 11mm to 17mm in diameter (about half an inch), and weigh from .8g to 3.5g. \n2-3 g for the coin is going to be totally enough to keep the eyelid closed. The eyelids do not open in every corpse and if closed tightly may not need any coins\n\n","date":"May 11, 2013 at 1:36 pm","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","id":"comment-33507","author":"jesterof","site":"shroudstory"},{"title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes","post":"http://www.romancoins.net/newsletter/v2n2.htm\n\n","date":"May 11, 2013 at 1:37 pm","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","id":"comment-33508","author":"jesterof","site":"shroudstory"},{"title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes","post":"I’d agree that the 3-D imagery gives the impression that there’s something like buttons over the eyes. If the Shroud’s authentic and they are coins, then they’re probably Pontius Pilate leptons, smallest coin in 1st c. Palestine. As for a lituus and lettering, I don’t see them, and am inclined to think they’re probably pareidolia.  Maybe I haven’t looked for them as well as I might. Some say they see them, others say they don’t. For me that’s not strong evidence that they’re there. I’m inclined to think that the weave is too coarse for such a detailed image to be visible. I’d concede that the first investigators may have seen them clearly, since when the image over the eye may have been damaged by someone’s sticky tape or other cause. Barrie stopped Max Frei taking such a tape, but there may have been another occasion when such damage was done. \nI’m inclined to agree with Colin’s idea at #2 of what the calculated probability is meant to convey. But it’s only valid if the image is clearly visible, and I don’t believe it is.\n\n","date":"May 11, 2013 at 4:28 pm","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","id":"comment-33512","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes","post":"URL provided by jesterof shows leptons with a wheel motif, said to represent an 8-pointed star in a diadem, earliest minting under Alexander Jannaeus around 175 BC. To see leptons with lituus motif, said to be produced during governorship of Pontius Pilate go to:\nhttp://www.ancientresource.com/lots/holyland_artifacts/holy-land-biblical-coins/pontius-pilate-coins.html\n\n","date":"May 12, 2013 at 12:51 am","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","id":"comment-33539","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes","post":"The main problem with this theory is the use of Enrie’s pushed contrast image for the simple reason that the image is not truly itself when one uses enhancement techniques, but is rather modified (changed within limits) to provide a sharper image.  When this is done, one cannot legitimately use the image for these kinds of exercises where “I think I see” can reflect reality because the image has been modified to make it clearer for contrast purposes.  There’s nothing wrong with doing this for contrast, but that is it’s limited purpose.\n\n","date":"May 13, 2013 at 9:56 pm","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","id":"comment-33624","author":"Andy Weiss","site":"shroudstory"}]
