[{"title":"The Length and Width of It","post":"Circumstantial evidence is a collection of coincidences that eventually can not be refuted by speculative surmise.  If I roll two dice once and get two sixes (12) ,  it tells me little about the dice. But if I roll the dice ten times and get 12 each time, than the conclusion that the dice are skew becomes quite reasonable. If the dice never roll anything but 12s, then it’s pretty conclusive.\nIt’s an application of the law of probabilities. \nIt’s the accumulation of circumstances involving the Shroud that lead to the conclusion that it is authentic. Can there be doubt? Of course. Is it reasonable? Weigh the probabilities.\n\n","date":"September 8, 2014 at 6:11 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149415","author":"John Klotz","site":"shroudstory"},{"title":"The Length and Width of It","post":"Has it been proven that it’s a, “first century fine linen shroud”.\n\n","date":"September 8, 2014 at 7:55 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149426","author":"John Green","site":"shroudstory"},{"title":"The Length and Width of It","post":"Not yet.\n\n","date":"September 8, 2014 at 9:37 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149441","author":"Louis","site":"shroudstory"},{"title":"The Length and Width of It","post":"And once again Jones has reproduced the misleading Wilson doublings. The second doubling is not a doubling of the first doubling, the third one is in effect the second doubling as you will see if if you take a slip of paper, double it and put it alongside the illustration. Wilson’s theory only works if you have three doublings and this cannot fit with any plausible definition of  tetradiplon. But we have been here before- it is a pity Stephen Jones won’t read this blog ( but perhaps he does peek at it from time to time without telling us!)\n\n","date":"September 8, 2014 at 8:37 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149432","author":"Charles Freeman","site":"shroudstory"},{"title":"The Length and Width of It","post":"Did Flury-Lemburg carry out the measurements on the Shroud before or after she used her steam iron on it?\n\n","date":"September 8, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149485","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"As far as I know, she never used steam iron -that was deliberately disseminated nonsense.\n\n","date":"September 8, 2014 at 4:01 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149489","author":"O.K.","site":"shroudstory"},{"title":"The Length and Width of It","post":"I don’t think anybody disputes that the Shroud is roughly four times as long as it is wide, and that that proportion is probably not accidental. Beyond that, I think it is dangerous to be too prescriptive. Looms all over the world are often just over a metre wide and always have been, that being a convenient distance to throw a shuttle from one side to the other. Being under a certain amount of tension while being woven, cloth tends to shrink from its loom-size, but can of course, easily be stretched. A glance at the Shroud shows that it now has quite deeply embowed ends, so where its precise ‘length’ is measured ought to be stated. The long period when the Shroud was stored rolled up resulted in its being quite badly creased (and so shortened), and it has now been stretched out again. Jones does not seem to have noticed more recent estimates of its length. Between 435 and 443 cm seems a fair estimate of its length, give or take a couple of centimetres, and 110 to 114 cm for its width. Stephen Jones’s usual dogmatism must, as usual, be treated with caution.\nThe thickness was measured with a micrometre by John Jackson and Ray Rogers in three places, giving between 323 and 367 micrometres, which Jones refers to accurately, but the weight (“about 2.45 kg”) is much more speculative. As it has never been weighed, estimates have been based on the known areal density of other linen cloths, or calculated by Morris, Schwalbe and London using some questionable assumptions from the Compton scatter of their X-Ray experiments, or extrapolated from the weight of tiny fragments given to Raes or the radiocarbon laboratories. Something between 20 and 30mg/cm2 seems roughly right, or a maximum of about 1.5 kg for the Shroud. Jones’s 2.45 kg comes from Iannone, but I have no access to his book – does anyone know where he gets his figure from?\nWith all this uncertainty, it may be thought that any attempt to equate the Shroud’s measurements to any supposed antique ‘standard’ such as the Assyrian cubit is futile, but on this site we never let a little thing like that prevent exhaustive inquiry. This cubit business was well explored in “The Shroud is 8 x 2 Assyrian Whatchamacallits” (November 18, 2013). Briefly, there is no evidence of an international standard cubit in use in the 1st century Jerusalem market place, and only wishful thinking to suggest there might have been. Measurements by various eminent archaeologists of various buildings, divided by appropriate numbers that seem likely, have given a range of possible cubits in use at different places and times, and a very few actual rulers have been found, and sure enough, some of the cubits have been found to be about half the width of the Shroud. However, Jones’s conclusion: “So even the dimensions of the Shroud of Turin are among the many proofs beyond reasonable doubt that it is authentic,” is wholly unjustified.\nFinally, the whole doubled in four thing is such peculiar special pleading as hardly to merit comment. I think it may just be etymologically possible to use tetradiplon as a description for a cloth folded to leave only the face (one eighth) exposed, but the bizarre attempt to achieve it by zig-zag folding the rest of the cloth behind the face in the manner illustrated is unconvincing.\n\n","date":"September 8, 2014 at 4:10 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149490","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"Farey: “but the weight (“about 2.45 kg) is much more speculative.” The weight was estimated by Piero Vercelli (Turin symposium 2000) as 1140 gr.\n\n","date":"September 8, 2014 at 4:27 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149492","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"The Length and Width of It","post":"Thanks, Gian Marco, that fits in well with my own calculations. Have you any idea where John Iannone got his value from?\n\n","date":"September 8, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149507","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"For the previous values of over 2 kg, possibly somebody added the weight of the Holland cloth and of the borders. For the Holland cloth, Vercelli presumes 910 gr. (Pietro Vercelli: The cloth of the Holy Shroud: A technical product analysis of the cloth and its reproduction with similar characteristics. Pp. 169-175 in Sindon, n. 13, June 2000. Also printed as a volume: The Turin Shroud: past, present and future. International Scientific Symposium. Torino, 2-5 March 2000. S. Scannerini and P. Savarino, eds. Effatà Editrice. The values for the weights are on p. 174.)\n\n","date":"September 8, 2014 at 6:50 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149515","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"The Length and Width of It","post":"Another thought that has occurred, which should be borne in mind if anybody is trying to pin the dimensions down to finer than a couple of centimetres either way, is that all the edges of the Shroud are turned over and hemmed (making the original width/length a couple of centimetres longer), and of course there is the side-strip seam, whether or not the strip is separate or only folded over, adding even more to the width. Then there’s Flury-Lemberg’s bizarre suggestion that an unspecidfied width of cloth may have been extracted from the insde of the entire length, and the outer pieces sewn back together in order to preserve the selvedges on both sides. That would knock the whole proportion completely out of kilter.\n\n","date":"September 9, 2014 at 2:35 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149577","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"Moreover it is possible that in the course of time strips of cloth had been cut out at the extremities (under the feet) and originally the Shroud was longer.\n\n","date":"September 9, 2014 at 3:34 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149585","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"The Length and Width of It","post":"It’s an old theory, which now seems to be discredited, for several reasons. One of them is that it is hard to imagine that  had some pieces been cut from the ends of the Shroud, the lenght/width ratio would be so close to 4:1.\n\n","date":"September 9, 2014 at 4:40 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149596","author":"O.K.","site":"shroudstory"},{"title":"The Length and Width of It","post":"Hugh: “all the edges of the Shroud are turned over and hemmed”. The most recent and possibly most accurate measurements were done soon after the 2002 restoration. The results are shown on p. 121 in the book (in Italian, English and German) by M. Flury-Lemberg, Sindone 2000, L’intervento conservativo, Editrice ODPF, 2003. It is not there specified that at the time of the measurements the edges were turned over and I presume they were not. (Before the restoration, the short edges were turned over, while the long edges had a selvedge.) In 2002 Barberis and Zaccone took several measurements at various places. For the lenght the values are 4425, 4404, 4399, 4395, 4415 mm. For the width 1137, 1123, 1110, 1111, 1112, 1130 mm.\n\n","date":"September 9, 2014 at 4:35 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149594","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"The Length and Width of It","post":"So the shorter the actual width (being turned and hemmed), the longer the measurement (being stretched). It simply shows how over-precision should be carefully avoided.\n\n","date":"September 9, 2014 at 6:14 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149619","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"Hugh F at Sep 8, 4:10 pm: “Looms all over the world are often just over a metre wide and always have been, that being a convenient distance to throw a shuttle from one side to the other.”  Often perhaps, but not necessarily always.  \nCheck: http://www.reshafim.org.il/ad/egypt/timelines/topics/flax.htm  several illustrations, \nPicture of Egyptian weaver, working on loom clearly much larger than full arm span;\n“In a Demotic bill of sales from the Roman period a loom, 3½ cubits wide, is described as follows (etc)”.  3.5 egyptian cubits = 1.6 metres. \nAlso see Fig 9 of a very large loom needing two operators at:\nhttp://www.gutenberg.org/files/25731/25731-h/25731-h.htm  (Although shown as a vertical loom, it is probably only drawn as such to show details, author speculates that artist would not have skill to draw perspective)\n\n","date":"September 9, 2014 at 5:55 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149612","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"Oh, indeed, looms could be much larger and also presumably smaller. They were often about 44 inches, which is still a common width of bolts of cloth now. Perhaps they were sometimes assembled to some kind of industry standard, even in 1st Century Judaea. However to claim proof that the Shroud is two industry standard Assyrian cubits wide, and could not be anything else, is absurd.\n\n","date":"September 9, 2014 at 6:18 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149620","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"HF: “However to claim proof that the Shroud is two industry standard Assyrian cubits wide, and could not be anything else, is absurd.” \nWe have been here before.  Is not absurd.  It just so happens that the width of the cloth is pretty well exactly two Assyrian cubits wide, like it or not! The ratio of almost exactly 4:1 is persuasive, regardless that professional skeptics don’t want to swallow it!\n\n","date":"September 9, 2014 at 6:41 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149621","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"Re-read the previous two comments (mine and yours). It is not absurd to suppose that the Shroud could have been made on a loom, or cut to a width, of a standard size. It is not absurd to speculate that that width may have been this or that particular cubit, Assyrian, Roman, Egyptian, Temple or whatever. What is absurd is to claim any kind of ‘proof of authenticity’ based on these speculations. Unless your, and Stephen’s, concept of ‘proof’ is very different from mine…\n\n","date":"September 9, 2014 at 7:41 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149629","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"HF: “What is absurd is to claim any kind of ‘proof of authenticity’ based on these speculations.”  They are not speculations.  You should know that a measurement is a measurement is a measurement.  It is one more link in a chain of corroborative evidence adding to a comprehensive persuasive case.  I should appreciate your not associating my concepts of proof with whatever Stephen Jones’ quaint and dogmatic ideas might be about a proper formal discipline of critical thinking.\n\n","date":"September 9, 2014 at 3:42 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149709","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"1) The width of the Shroud is between 110 and 114 cm, most accurately towards the longer measurement.\n2) Half this figure is between 55 and 57 cm.\n3) Flinders Petrie determined the Assyrian cubit to be 54.86cm.\n4) The Shroud, even ignoring the overlapping side-seam, is wider than two Assyrian cubits. Including the overlap, it is unrealistically so.\n5) The measurements of the Assyrian cubit are based on buildings from hundreds of years BC.\n6) The cubit used for the construction of Herod’s Jewish temple (by archaeological reconstruction) was 52.5 cm.\n7) There is no evidence whatever of any standard cubit in use in 1st century Jewish textile manufacture, or any other commodity.\n8) Various other cubits, and various widths of cloth, are found around the world from the earliest times until today.\nIf any of these statements is wrong, I would be most happy to be corrected.\nTo claim that this is, without reference to any other evidence, in itself a proof that the Shroud is of 1st century manufacture, is absurd. This is what Stephen Jones claims. His claim is absurd.\n…links in chains of corroborative evidence…\nWell, that’s a different matter altogether….\n\n","date":"September 9, 2014 at 4:22 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149720","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"We can only speculate about the width.\n\n","date":"September 9, 2014 at 8:02 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149633","author":"Louis","site":"shroudstory"},{"title":"The Length and Width of It","post":"A measurement is a measurement is a measurement!\n\n","date":"September 9, 2014 at 3:43 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149710","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"Agreed, but it is not proof. The weave is more important.\n\n","date":"September 9, 2014 at 4:05 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149716","author":"Louis","site":"shroudstory"},{"title":"The Length and Width of It","post":"HF: “Then there’s Flury-Lemberg’s bizarre suggestion that an unspecified width of cloth may have been extracted from the inside of the entire length, and the outer pieces sewn back together in order to preserve the selvedges on both sides.”  \nThe side-strip has the same weave as the main cloth.  Clearly there would be no need to sew a side-strip if the main cloth already had a selvedge.  What do you imagine was the origin of the side-strip if not from a larger bolt of cloth?  And why would there be no weaver’s selvedge if the main cloth had been left intact and not cut? Or do you yet subscribe to the Wilson theory that it was deliberately manufactured and provided merely to centralise the facial image to present a landscape mandylion type appearance?\n\n","date":"September 9, 2014 at 9:15 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149761","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"It’s a good question, I agree. My own guess is that for at least most of its length the side-strip seam is merely a tuck along the length of the cloth, possibly for strengthening. I know that Raes’s little bit fell apart into two pieces, but the absolute integrity of the continuity of most of the weft threads looks too good for the rematching of two pieces of cloth to me. As for Flury-Lemberg’s idea, I can’t get any practical sense out of it. Why start with the wrong width? Cloth was made in all sorts of widths, and there was no need for a Shroud to have an exact width anyway. Did Joesph of Arimathea decide his cloth was too wide and hurriedly cut it up and resew, just to get the selvedges right? Or did cloth merchants regularly buy cloth of a single width and cut it to size? If they did, why cut a strip out of the middle and end up with four cut edges, two of which would have to be sewn together (to make the shroud) and the other two (of the detached strip) hemmed. Or did they throw the middle strip away? Surely not. Why not simply cut it to the correct width and hem the two cut edges, giving you two strips of cloth? I would have to be taken through the logic of Flury-Lemberg’s suggestion before I thought it less bizarre, I’m afraid.\n\n","date":"September 10, 2014 at 2:52 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149813","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"Just now, taking measurements from Shroud Scope, it occurred to me that Wilson’s idea might be inversely correct (!). Instead of the side-strip being added to increase the width and centralise the image, it could have been that the tuck was added to decrease the width and centralise the image. I don’t know what width of cloth is hidden, folded over, in the seam, but it could be as much as 5cm.\n\n","date":"September 10, 2014 at 3:02 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149815","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"A discovery!  Paper “What the Shroud is and (it) is not” presented at Valencia 2012 conference discusses this and several other related and unrelated issues.  PDF does not identify author, but from shroud.com reference it is probably Cesar Barta:\nhttp://www.shroud.com/pdfs/bartaveng.pdf  \nPages 12-14 ‘It is not a single piece’;  Refers to a primitive near central longitudinal fold identified by Flury-Lemburg, parallel and adjacent to known 1532 central fold;  Claims that this was first-ever fold when cloth first removed from loom.  Distance from this proto-central fold to selvage is 58.6 cm without crossing a seam, and asserts that this was original half-width of cloth.  So that original width was 117.2 cm, that is original cloth was “6.2 cm” wider than present width (but compare with G M Rinaldi’s quoted figures above).  On opposite side there is a seam running along the entire length.  Author claims that a long strip has been removed and the main cloth sewn to the original selvage along this seam deliberately to centralise the image.  Asserts this is an argument supporting authenticity as an artisan would ensure that image was placed centrally in his setting out.      \nAuthor also claims a parallel quarter-fold corroborating his version of original dimensions. \nAuthor’s claim may be valid, but I would have been happier with his conclusions if I had seen a diagram with specific dimensions which presented his argument more convincingly.  I feel he has left some details hanging and uncertain, but this may be merely an error in presentation, and not in factual matter.  \nIf original width was in fact 117.2 cm as he claims, we can say goodbye to any further discussion about Assyrian cubits.  A pity.   \nThere are several other topics covered in this paper which are worth reading, but a critical and informed perspective is required, as some assertions made may unintentionally be in error.\n\n","date":"September 10, 2014 at 7:14 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149865","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"A discovery! Paper “What the Shroud is and (it) is not” presented at Valencia 2012 conference discusses this and several other related and unrelated issues. \nThis is not a new discovery for me.\nOn November 18, 2013 at 1:41 pm, I wrote:\nIan Dickinson, The Shroud And The Cubit Measure, British Society for the Turin Shroud Newsletter No 24 http://www.shroud.com/pdfs/n24part6.pdf\nThe lower limit of Assyrian cubit: 54.3 cm\nThe average of Assyrian cubit: 54.6 cm\nThe higher limit of Assyrian cubit: 54.9 cm\nDimensions of the Shroud 437×111 cm\nThe lower limit of Assyrian cubit: 8.05×2.04\nThe average of Assyrian cubit: 8.00×2.03\nThe higher limit of Assyrian cubit: 7.96×2.02\nThere is some minor problem here, according to César Barta, What the Shroud is and it is not (point : it IS NOT a single piece), I Congreso Internacional de la Sábana Santa, Valencia 2012-01-28 http://www.shroud.com/pdfs/bartaveng.pdf\nthe investigations of the distance between the primitive fold and the selvage corresponds to one half of the original width of the fabric: 58.6 cm. And if this was the half of the shroud at the end of weaving, the total width would be double: 117.2 cm more or less. But in that case, the Shroud was 6.2 cm wider when leaving the loom than currently.\nIf we take this into account, than:\nThe lower limit of Assyrian cubit: 8.05×2.16\nThe average of Assyrian cubit: 8.00×2.15\nThe higher limit of Assyrian cubit: 7.96×2.13.\nCuriously, it is today that the Shroud is 8×2 Assyrian cubits, with margin of error no greater than 3 %. It is possible (though I am not in favor of this) that side strip was deliberately cut and sewn again to obtain a perfect Assyrian 8×2 cubit measure\nThe compromise is average of the two: 56.6 cm. Then the Shroud is 7.72×2.07 cubits.\nIf we take approximate Shroud dimensions as 440×110 cm, and a cubit measure of 55 cm, then we have exactly 8×2 cubit proportion. I hardly believe this is accidental, no matter what Barta’s “primeval fold” analysis suggest. \nI think better explanation is that when first folded after removing from the loom, the Shroud was simply not folded precisely in its half, for some reasons,\n\n","date":"September 10, 2014 at 7:39 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149866","author":"O.K.","site":"shroudstory"},{"title":"The Length and Width of It","post":"It is worthwile also to look at Ada Grossi’s paper Jewish Shrouds and Funerary Customs: a Comparison with the Shroud of Turin\nhttps://www.academia.edu/2427474/Jewish_Shrouds_and_Funerary_Customs_a_Comparison_with_the_Shroud_of_Turin_in_1st_International_Congress_on_the_Holy_Shroud_in_Spain_-_Valencia_April_28-30_2012_ed._Centro_Espanol_de_Sindonologia_CES_\nOn pages 6-7 she has very interesting section 1.3 “The Shroud’s dimenison”. Although she is sceptical about the significance of the “cubit argument” in fact her own arguments point to the exactly opposite conclusion!\nOn November 19, 2013 at 7:55 am, I wrote: \nYes, there are some uncertainities, but regularity of Shroud dimenisons expressed in integers is striking! It suggests that the original TS dimensions hasn’t changed much through centuries. The units that were used to measure the size of the TS were either cubits circa 55 cm long, or ell measuring 110 cm, that is 2×55 cm. Or, according to Ada Grosii:\n“Thus, the Shroud’s length would be 56 tefachim (436.8 cm) and its width 14 tefachim (13+1, that is 109.2 cm = 101.4 + 7.8 cm); on the other hand, always keeping in mind that these measurements are approximate, we could also evaluate the Shroud’s dimensions by the tefach sochek (9.33 cm), and we would obtain even more interesting numbers: 47 tefachim (438,52 cm) by 12 tefachim (11+1, i.e. 111.96 cm = 102.63 + 9.33 cm).”\n7 tefachim = 6 sochek =1 ammah (cubit).\n7 *7.8 cm=54.6 cm =1 Assyrian cubit!\n6*9.33 cm =55.98 cm.\nThus the opinion of Grossi:\n“This line of reasoning certainly suggests great caution: playing with numbers, any result can be achieved”\nis unjustified, if we only keep some rules, only the results that Shroud dimensions allow can be obtained.\nSo the Shroud measures 14×56 tefachim, or 48×12 sochek (the number 47 is “almost” 48, the measure sochek is probably slightly overestimated), or 8×2 cubits.\n7 tefachim = 6 sochek =1 ammah (cubit). Very simple and useful conversion factor.\n\n","date":"September 10, 2014 at 7:58 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149871","author":"O.K.","site":"shroudstory"},{"title":"The Length and Width of It","post":"It is also worthwhile to check dimensions of the Sudarium of Oviedo.\nhttp://www.sindonology.org/sudarium/sudariumMeasurement.shtml\nThey are stated as 84×53 cm. My measurements gives closer to 84×54 cm. \nWhat’s interesting, this may also relate to the cubit measure, although not so precisely as in the case of the Shroud. The proportion is close to 3:2 (actually between 1.55 to 1.6). A napkin approximately one cubit long, and one-and-a-half cubits wide.\n\n","date":"September 10, 2014 at 8:21 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149876","author":"O.K.","site":"shroudstory"},{"title":"The Length and Width of It","post":"The ‘Bartaveng’ paper is interesting too. If the original centre line crease really exists, and if it does define the original width of the shroud as 117cm, and if the width of the shroud really is 114cm (and do note the if..if..if..) then it would be almost impossible to cut a strip out of it, and resew the edges together. The idea that the seam is no more than a tuck would be much more sensible.\n\n","date":"September 10, 2014 at 8:56 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149882","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"Charles: ” Wilson’s theory only works if you have three doublings and this cannot fit with any plausible definition of tetradiplon.”\nHow disingenuous.  Charles’ main role is as a “grenade thrower” on this blog, because his world-view is threatened at its core by the idea of an authentic Shroud.  \nHere’s “plausible” mister:  Looking at the full-length of the Shroud “back in the day”, one would see enough evidence of folds to realize that the Shroud as folded for display in Edessa would have appeared as eight rectangles.  Rectangles 1 and 2, with a fold between them, can easily be thought of as a “doublet”, and so on down with Rectangles 3 and 4, 5 and 6, 7 and 8.  Four doublets.  To hang on to “Tetradiplon” as the “act of physically making four folds in half” is disingenuous — Tetradiplon would have been used to describe an appearance, not an act.\n\n","date":"September 10, 2014 at 11:02 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149910","author":"Nabber","site":"shroudstory"},{"title":"The Length and Width of It","post":"Can we desist with presuming to know what a commenter’s motivations may be. It’s not helpful. The rest of your rebuttal is much more so.\n\n","date":"September 10, 2014 at 11:18 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149913","author":"David Goulet","site":"shroudstory"},{"title":"The Length and Width of It","post":"No, in this case, “we cannot desist”.  To paraphrase Daveb, a grenade-thrower is a grenade-thrower is a grenade-thrower.  Or, as the kids say, “it is what it is”.\nHugh, on the other hand, just plants land-mines…..\n\n","date":"September 10, 2014 at 11:34 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149915","author":"Nabber","site":"shroudstory"},{"title":"The Length and Width of It","post":"It supports my view that sceptics are not able to challenge the Shroud’s authenticity in open fight, and may at most engage in partisan activity.\nNabber, if may I ask, if Charles is throwing grenades, while Hugh is planting mines, then what are the tactics of other major sceptics, Collin Berry, Gian Marco Rinaldi, Andrea Nicolotti, David Mo etc.\nWhat is their weapon of choice?\n\n","date":"September 10, 2014 at 1:20 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149945","author":"O.K.","site":"shroudstory"},{"title":"The Length and Width of It","post":"Hi, Nabber: i’m not sure I understand your  metaphor. If there is something wrong wth my evidence, please point it out. My conclusions, of course, you are free to disagree with.\n\n","date":"September 10, 2014 at 1:40 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149949","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"Hugh, you are a frequent contributor to the message board of the James Randi Educational Foundation (JREF), who abhors the Shroud and who is the world’s leading skeptic on everything (congratulations, BTW, on your finding of a messiah), and also of the message board of GodandScience.org, where you represent well the Darwinists.  There is no way that you have a smidgin of neutrality about you on the subject of the Shroud. In this case, guilt-by-association actually works quite well. There is plenty wrong with your evidence, and there are many on this board who have pointed out the problems, no need for me to start now.\n\n","date":"September 10, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149965","author":"Nabber","site":"shroudstory"},{"title":"The Length and Width of It","post":"I thinks ‘tetradiplon’ is irrelevant as the text makes clear that this was how the cloth was folded BEFORE Jesus wiped his face on it and the text does not mention that it was refolded as such. Wilson is misleading as he suggests that the word refers to the cloth after Jesus wiped his face on it.. This is not grenade throwing – it is simply commenting on a misleading statement that too many people have relied on without going back to the original text ( that also mentioned burial cloths separate from the tetradiplon cloth- again Wilson does not mention this)..\nI believe that Jesus existed and that he was buried. Therefore there was originally a burial shroud or wrappings/ facecloth. I just don’t think that the Shroud was it. If a more plausible set of burial clothes from first century Jerusalem comes up it would not shake my world view at all. After all in Jerusalem there exist a number of large stones that originally blocked tombs ( the practice was to unroll them three days after to check that the deceased really was dead or to anoint the body as in the case of the Jesus tomb.). It is highly likely that the stone from the tomb is still there and if the right one was indeed found then it would not destroy my world view either. Why should it?\n\n","date":"September 10, 2014 at 12:06 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149923","author":"Charles Freeman","site":"shroudstory"},{"title":"The Length and Width of It","post":"That’s one of the most convoluted flows of logic seen on this blog.  You didn’t come close to answering why Tetradiplon wouldn’t logically represent the state of the Shroud in Edessa (and maybe before); further, why the mythic face-cloth-that-Jesus-wiped-his-face-on is ever discussed seriously here, I don’t get it.  Objections to “tetradiplon” and “oh-that-pattern on the Codex does not represent herringbone”  are laughable on their face and does not represent serious skepticism.  Perhaps doubting of coins and flowers is somewhat serious skepticism.\nNaturally “Jesus’ Shroud” doesn’t threaten your world view, just the Shroud of a Divine Messiah (think: undisturbed blood clots).  I’m pretty sure from your books, that wouldn’t fit in your world view.  Like Hugh, you’re not really “anti-Shroud”, you’re anti-supernatural, anti-Divine.  Not neutral, ever; in fact your agenda demands that you check it before commenting here.\n\n","date":"September 10, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149951","author":"Nabber","site":"shroudstory"},{"title":"The Length and Width of It","post":"Hi Nabber.\nYou have read Charles’ books? Are they really so bad, as suggested by this short passage in the Wiki article?\nhttp://en.wikipedia.org/wiki/Stolen_body_hypothesis#Removal_by_Jewish_leadership\n\n","date":"September 10, 2014 at 2:14 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149955","author":"O.K.","site":"shroudstory"},{"title":"The Length and Width of It","post":"Footnote 11 (quoting Charles) in the wiki is asinine.  When you start maintaining that Jesus’ disciples would be fooled by Temple Priests outside the Tomb posing as angels, you have lost all credibility.  I think the disciples knew Temple Priests, don’t you?\n\n","date":"September 10, 2014 at 2:28 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149957","author":"Nabber","site":"shroudstory"},{"title":"The Length and Width of It","post":"About the empty tomb:\nhttps://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/\nWhen you try to argue, you’ll eventually find these kind of footnotes, dead-end of reason.\n\n","date":"September 10, 2014 at 3:16 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149967","author":"anoxie","site":"shroudstory"},{"title":"The Length and Width of It","post":"I think this review of Holy Bones, Holy Dust says it all:  \n“I would not, however, recommend this book to my university students of medieval history because it is full of too many conclusions lightly arrived at and ill-defended, provocative teasers with little substance to back them up… Freeman’s claim that Gothic architecture was a child of the relic business needs a lot more proof than he is willing to furnish.” \n“Provocative teasers”  :  has this reviewer been reading this blog?\nPerhaps Charles’ Amazon book ranking of #323,413 was way too high.  A retired military friend of mine, not a writer, who wrote a book (really a pamphlet) on how to transition into military retirement, had a higher Amazon book ranking than that….\n\n","date":"September 10, 2014 at 2:40 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149961","author":"Nabber","site":"shroudstory"},{"title":"The Length and Width of It","post":"That review does not say it ALL because I have had many other reviews and you should start by looking at some of these on the Yale University Press USA website under Holy Bones. Many of the most supportive are from Catholic journals. Actually I have never seen the one quoted so would be interested where it is to be found.\nIf you have been writing so long as I have, first book out in 1980, you learn not to worry about Amazon or other ratings. I don’t write for the popular market so ratings are irrelevant. I am more than happy with the reviews I get and the fact that I am mainly published by university presses who have to get my work assessed by academic assessors before they accept or publish it.\n\n","date":"September 10, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149994","author":"Charles Freeman","site":"shroudstory"},{"title":"The Length and Width of It","post":"For your interest, a proposal to a university press goes first to two or three academic advisors. If given preliminary acceptance it then has to be approved by an academic board before the press signs you up. Then the finished book is read by at least two anonymous and different academics who make their own comments that are fed back to the author (sometimes they agree to let their names be released or even provide endorsements).\nNo academic commented on my discussion of the historical issues behind the resurrection accounts as they could see that it was a serious discussion of some possible interpretations of the evidence in what is a history book not a theological one.\n\n","date":"September 10, 2014 at 4:37 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149998","author":"Charles Freeman","site":"shroudstory"},{"title":"The Length and Width of It","post":"Calm down, Nabber. \nPlaying with guys like Charles has always required a lot of patience. \nI think it is not because the Shroud or any pro-Christian arguments challenge their views, various atheists, agnostics, “secular-humanists”, “rationalists” etc. try to discredit Christianity. In their view it is simply some outdated superstition, no matter what apologists say. No argument would challenge their (atheists) view, simply because they “know better”. \nThe true reason why some guys try any cynical tricks to discredit Christianity is different. It is not because they feel their worldview is challenged. Contrary, they simply want to challenge Christian worldview. To show that they are “wiser” and better” then simple, “naive” believers. Pride, that drives their action. And the fact that they cannot refute Christianity? No matter. Attacking those “naive” Church-followers is simply addictive.\nThe best way is usually to ignore those provokers. Or ridicule them once and for all. Never get irritated.\nI have recently read one of the most foolish book on the Shroud that have been written in a few recent years. It adds absolutely nothing to our knowledge of the Shroud. I plan to make a review of it in a free-time. \nThe title is “The Sign: The Shroud of Turin and the Secret of Resurrection” by Thomas de Wesselow.\n\n","date":"September 10, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149963","author":"O.K.","site":"shroudstory"},{"title":"The Length and Width of It","post":"History is one thing, speculation another. There would be no shrine for a defeated,crucified master after all the promises he made, which had turned out to be illusions,nor would there be unrest in the peaceful budding Jesus movement. The movement would cease to exist and the disciples would return to their professions.\n\n","date":"September 10, 2014 at 3:34 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149972","author":"Louis","site":"shroudstory"},{"title":"The Length and Width of It","post":"Interesting, Hugh and Charles’ views and articles can be found online, open to criticism and scrutiny. They do not hide behind pseudonyms. Agree with them or not, they are willing to stand by their beliefs and accept the challenge of defending those beliefs. Such transparency is admirable, no? But because they challenge your worldview, Nabber, you attempt to sully their reputations with innuendo and ridicule.\nPerhaps you could provide links to your own published work and some of the reviews.\n\n","date":"September 10, 2014 at 3:51 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149977","author":"David Goulet","site":"shroudstory"},{"title":"The Length and Width of It","post":"David, nothing about these discussions challenges my worldview.  I am quite serene about the Resurrection, the “proof” for which consists mainly in the sacrifice of the Apostles of their fortunes and their lives to spread the Word, something they (nor anyone) never would have done for a lie.   And of course, faith is key, so the eventual truth about the Shroud, one way or the other, has no effect on my worldview.  The same cannot be said of the skeptics, who, although they deny it every time, live in dread fear that the Shroud will be proven true and in addition, the Resurrection.  This does challenge their worldview, which is why so many of them spend so much time here.\n\n","date":"September 11, 2014 at 5:07 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150280","author":"Nabber","site":"shroudstory"},{"title":"The Length and Width of It","post":"Thomas Wesselow was well intentioned when he wrote the book. Being an agnostic he does not accept resurrection and as a Courtauld-trained art scholar he did not find the TS image to be a painting.\nhttps://www.academia.edu/4691390/Book_review_The_Sign_by_Thomas_de_Wesselow\nMost Christians and some Jews believe in Jesus’ resurrection. The Israeli scholar and Jewish theologian Pinchas Lapide believed that only an extraordinary event could explain the rise of the Jesus movement.\n\n","date":"September 10, 2014 at 3:51 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149978","author":"Louis","site":"shroudstory"},{"title":"The Length and Width of It","post":"Back to topic “Length & Width of it”, without the ad homs.\nHF – Sep 10, 8:56 am: “The ‘Bartaveng’ paper is interesting too. If the original centre line crease really exists, and if it does define the original width of the shroud as 117cm, and if the width of the shroud really is 114cm (and do note the if..if..if..) then it would be almost impossible to cut a strip out of it, and resew the edges together. The idea that the seam is no more than a tuck would be much more sensible.” \nNo investigator has yet reported a tuck, which if it corresponds to original width of 117.2 cm would be plainly visible, having a width of half of the 6.2 cm reported in the ‘Barta’ paper, if a Z type single fold, or else a thick strip of material if folded more.  The longitudinal seam attaching the strip is visible and has been reported.    Clearly there must have been a longitudinal cut, otherwise a selvage would be visible at the seam.  It has been sewed according to Mme F-L by a Masada like cross-stitch. \nThere appear to be a number of possible options.\na)  The M-L hypothesis that the cloth was from a larger bolt of cloth, and cut into suitable widths to give a commercial product, perhaps of two cubits width; \nb) The original cloth was perhaps 117.2 cm wide, which was wider than the standard commercial width and was therefore deliberately reduced in width to make it standard, corresponding to two cubits. \nc)  The strip was made at some time after the image was formed, so that it would be more centrally placed for display purposes, and so appear symmetrical when mounted.  In that case the two cubits width would seem coincidental, but then we would have to accept that the 4:1 ratio is also coincidental, which makes two concurrent coincidences!  \nIt would seem that the strip came from the original bolt of cloth, regardless of how wide that bolt may have been.   A satisfactory explanation seems to remain elusive.\n\n","date":"September 10, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-149995","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"If it’s option c), then what makes it interesting is that whoever sewed on the strip had to be aware of the image.  Barta seems ambiguous about his views on the Mandylion = Shroud theory, and raises the possibility that inventories which listed both objects, may well have merely referred to an otherwise empty casket, which was only opened rarely, and that the various depictions of the Mandylion, may well have only been copied from an engraving on the casket, rather than the mandylion cloth itself.     \nIf the side-strip was sewn during Byzantine times, and a strip removed to centralise the image, this may explain the dispersal of various relics purporting to come from the burial cloth, although I am unaware of how many of these purported relics show the herring-bone twill pattern, if they still exist.\n\n","date":"September 10, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150013","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"If the side-strip was sewn during Byzantine times, and a strip removed to centralise the image, this may explain the dispersal of various relics purporting to come from the burial cloth, although I am unaware of how many of these purported relics show the herring-bone twill pattern, if they still exist.\nI recommend reading section It IS NOT the burial linens of Constantinople of Barta’s paper.\nAnd also mine: https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/\n\n","date":"September 10, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150020","author":"O.K.","site":"shroudstory"},{"title":"The Length and Width of It","post":"I had already read the section in the Barta paper on the Constantinople burial linens, and I note your own paper includes similar material.  Few if any of these cloths or fragments have come from the TS.  However it seems that at some unknown time, a long strip was removed from the parent cloth, either soon after its manufacture, or else after the image was noted to be off-centre.  What happened to this strip?  Because of the present centrality of the image, I think I would tend to favour the latter explanation, and this was almost certainly done before the cloth ever left Constantinople, and may well have been done much earlier, perhaps even by Syrians.  Was this strip cut up for purposes of dispersing prized relics to various favoured churches or royal personages and then lost from history.  We do not know.  Do any other relics alleged to have come from the burial cloths have a herring-bone twill?  I suspect not.\n\n","date":"September 10, 2014 at 8:36 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150046","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"Textiles are preserved at V&A, London. Some have the herring-bone twill pattern, however they are Turkish and Mediaeval.\n\n","date":"September 10, 2014 at 6:21 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150022","author":"Louis","site":"shroudstory"},{"title":"The Length and Width of It","post":"It is doubtful if academics always write gospel truth. In an article entitled “Jesus is ill-served by this literary device”, published in the “Daily Telegraph”, well-known author A.N. Wilson wrote that he was seduced by Professor Geza Vermes’ book “Jesus the Jew” and became ashamed of the book about Jesus he wrote “under the influence.” He changed direction.\nI had occasion to interview Professor Vermes, of Oxford, for a leading daily, in connection with the launching of his book on the Dead Sea Scrolls. He was a good man, with a good sense of humour, accused of being “obsessed with Jesus” by a journalist in Israel. I think he was indeed “obsessed with Jesus”, but mixed feelings were involved. He never attended synagogue and preferred to listen to that “small voice” while walking in his garden. It influenced his writings.\nA good interview, with a now retired academic and Catholic priest, where there is no mixing of Bible studies with theology, where theology and scripture are in different compartments:\n  https://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\n\n","date":"September 10, 2014 at 6:01 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150016","author":"Louis","site":"shroudstory"},{"title":"The Length and Width of It","post":"Looking at the seam on Shroud 2.0, and going along for a moment with my tuck hypothesis. It does not look like, and I think Flury-Lemberg has said this too, a simple z-fold. Take a pinch of material, fold it over against itself, and then lay it flat, and you have four layers of cloth to stitch down to the base. If you pinched together the edges of two pieces of cloth and folded them over and then flat you would also have something very similar.\n\n","date":"September 11, 2014 at 5:11 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150135","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"Hugh, If you want to persist with your tuck theory, which for all I know may be the correct explanation, then you need to support it with the strength of evidence which you seem to insist that others do with their hypotheses.  I suggest that it is not enough to refer to web-photos such as Shroud 2.0.  Flury-Lemburg is reported as having examined the stitching and making her comment that it seems similar to that found at Masada, notwithstanding Charles F’s objections.  You may find something there, but she often seems to give partial and inadequate explanations only.  For what it’s worth, Wilson showed a diagram in his 2010 book, in his ch. 6, ‘The cloth’s on tale’ (p.74 in my soft cover copy).  He shows the two pieces as clearly separate.  How reliable that might be, I can only guess.\n\n","date":"September 11, 2014 at 4:10 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150267","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"Wilson’s diagram on p. 74 is the very same as given by Flury-Lemberg who has copied it from the volume Masada IV where it is given among several examples from the Masada finds. I cannot tell if this is the seam of the Shroud, but surely is a common type of stitching and by no means exclusive of Masada.\n\n","date":"September 11, 2014 at 4:27 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150270","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"The Length and Width of It","post":"Yes, we established that seamstresses today recognise this as a basic stitch, useful for stitching two cloths together and still used today. It does not help us one bit in dating the Shroud .  I never objected to the. idea that the stitch on the wool at Masada many have been similar to the stitch on the Shroud, it is just that that does not move us on in any way if the stitch has been used throughout stitching history as appears to be the case.\n\n","date":"September 11, 2014 at 5:33 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150284","author":"Charles Freeman","site":"shroudstory"},{"title":"The Length and Width of It","post":"If the diagram is an uplift from Masada IV, then it’s only a weak inference that Flury-Lemburg considered the Shroud to be two separate pieces.  I merely stated what Flury-Lemburg is reported as saying, regardless of whether the stitching is unique or not.  She would surely know if the seam was merely a tuck or a sewing together of two pieces.  Possibly she may be prepared to give Hugh as editor of BSTS a direct answer to such a query.  But the chummies are not usually so forthcoming in giving replies to queries.  Nevertheless it might be worth a try.\n\n","date":"September 11, 2014 at 4:41 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150274","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"It is the chummies who have caused the most damage to Shroud studies.\n\n","date":"September 11, 2014 at 9:54 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150331","author":"Louis","site":"shroudstory"},{"title":"The Length and Width of It","post":"I’m not sure I would dignify my tuck suggestion as a theory just yet, it’s just that the idea of cutting a thin sliver out of a cloth just to centre the image seems so impractical. Why not just fold over the edge and hem it? Would it look less elegant than having the seam? Not to my mind. The relic would not lose it’s integrity and the selvedges would be preserved. I speculated that the seam had four layers of cloth folded down onto the visible surface; Wilson’s diagram shows three layers, perhaps 2cm. If (remember all those ‘ifs’) the original width was 117cm and the new width is 114cm, then a sliver only 1cm wide was removed. Even if the new width is 111cm, then the sliver would only be 4cm wide. This seems to me wholly impractical. On the other hand chopping out a much wider length from a much wider original also seems bizarre (as I have discussed above), and the various reasons suggested for simply cutting the cloth in two and rejoining it again also lack real substance. It’s a real poser. What fun.\n\n","date":"September 12, 2014 at 2:54 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150386","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"The Wilson/Masada diagram has four layers. The reason for the two folds is because each of the borders of the two pieces of cloth is closed and hidden within a fold so as it does not fray out.\n\n","date":"September 12, 2014 at 7:39 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150441","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"The Length and Width of It","post":"Three layers of “not included in the width mesurement” fabric, above a layer of “included in the width meaurement” fabric.\n\n","date":"September 12, 2014 at 8:01 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150446","author":"Hugh Farey","site":"shroudstory"},{"title":"The Length and Width of It","post":"Hugh, I don’t follow your arithmetic at all.  I don’t see your figure of 114 cm in Rinaldi’s quoted figures from Barberis and Zaccone, and I can’t see how your subtractions can be correct.  The Barta paper asserts that the cloth was 6.2 cm wider than at present, not merely 1 cm, not even 4 cm.  Gian’s figures are between min of 1110 mm and max of 1137 mm.  Have you been at the sauce again? \nIt’s either a cut or a tuck, and there’s one person who would definitely know one way or another.  The thin sliver cutting approach only works if Barta’s assertion about the significance of the ‘proto-fold’ is accepted.  There are other alternatives, as I noted above, it may have been from a much wider bolt of cloth than the mere 117 cm asserted by Barta.    \nI read Wilson’s diagram (presumably ex Masada IV) as showing two separate pieces of cloth stitched together, not a tuck.\n\n","date":"September 12, 2014 at 6:28 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150427","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Length and Width of It","post":"Apparently this is how the stitch recorded from the Masada excavations is designed to do- stitch together two different pieces of cloth. However, this does not necessarily mean that it was used in the same way for the Shroud. We are only talking of ‘similarities’ not exact fits.\n\n","date":"September 12, 2014 at 7:46 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150443","author":"Charles Freeman","site":"shroudstory"},{"title":"The Length and Width of It","post":"Sorry not to make myself clearer. Suppose I wanted to make a cloth thinner by cutting out a strip. I would subtract the required width from the original width, but in actual cutting I would need to take into account the amount needed for the re-attachment seam.\nMy figure of 114cm was a rounding up of Gian’s 113.7cm, and my figure of 117cm a rounding down of Barta’s 117.2. The exact difference is 3.5cm. If three layers of seam were envisaged, then a minimum of 1.5 cm should be deducted from the width of the extracted sliver, leaving 2cm to be removed. This seems unresonable to me. If the difference was 6.2cm, then leaving 1.5cm for the seam gives a cut-strip width of 4.7 cm. This does not seem to me much more resonable. If you actually cut off a strip 6.2 cm, and then used 1.5 cm of the remaining pieces for the re-join, the result would be a narrowing of 7.7 cm.\nYou’re right about Wilson’s diagram. It is about joining two pieces together, but all I wanted to illustrate was that any of the tucking or cutting procedures uses up an appreciable width of cloth in the process.\n\n","date":"September 12, 2014 at 8:00 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","id":"comment-150445","author":"Hugh Farey","site":"shroudstory"}]
