[{"title":"The Meaning of Solid","post":"David Mo is right in saying that the Shroud is not considered seriously by historians and art historians, largely I suspect because none of them have seen anything to convince them that it is authentic. The failure of the Shroudies to convince any specialist outside their own circles is all too obvious but  they don’t really seem to worry about it.\nWhy at all these conferences is no space given to how to persuade specialists in the relevant areas? Part of the problem is that the Fantis and Carpinteris get flashes of international publicity but their findings are quickly discredited and the Shroud is not seen as a serious object of research.\nWhenever I do get into  conversation  with an ancient textile specialist, the Shroud is just assumed to be the typical product of a medieval treadle loom ( the length and width are the give aways), so, I am told,  why bother to go further? The late Caroline Villiers, one of the foremost experts on painted linens, simply referred to the Shroud as ‘one of the best-known surviving medieval images on a textile support’. It was not an issue with her and she turned her attention, before her early death, to the painted linens that really interested her.\nI am learning to live with the fact that the real painted linen experts are tied up with the linens whose paintings do survive and they are less interested in ones where the paint has disintegrated, even when they accept that this is what has happened.\n\n","date":"July 12, 2015 at 4:35 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205356","author":"Charles Freeman","site":"shroudstory"},{"title":"The Meaning of Solid","post":"Yawn\n\n","date":"July 12, 2015 at 4:41 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205357","author":"Thomas","site":"shroudstory"},{"title":"The Meaning of Solid","post":"‘Yawn’ :exactly what I mean about Shroudies not caring about whether they convince anyone outside their own circle! Sleep on, Thomas!\n\n","date":"July 12, 2015 at 1:54 pm","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205401","author":"Charles Freeman","site":"shroudstory"},{"title":"The Meaning of Solid","post":"The reason I said yawn is you are a broken record. You have a serious case of confirmation bias and continue to ignore all the scientific evidence that argues against any notion of a painting.\nDespite what you think, some of us here who on balance think the Shroud is authentic still keep an open mind – unlike you, wedded as you are stubbornly to one and only one (flawed) theory. As I’ve said, the image is clearly an imprint and I’m still open to theories as to an artistic imprint creation. Colin B is trying. At least he gets all the science that prohibits any notion of a painting.\n\n","date":"July 12, 2015 at 6:55 pm","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205423","author":"Thomas","site":"shroudstory"},{"title":"The Meaning of Solid","post":"Thomas- your comment does not reflect the feedback I get from my History Today article which you may or may not have read. Lots of others have and find it interesting and convincing.\nWe all want new research. The BBC had an interesting programme on a disputed Renoir last night. The latest technology has produced a scanner which can instantly show what pigments make up the paint on any surface so they were able instantly to show whether the painter had used vermillion or not (plus other pigments- but vermillion is the key one for the Shroud as it was the normal pigment used to depict blood). The scanner is so rare that there are long queues to use it ( in Berlin) but no doubt in a few years time it will be standard and would quickly resolve the issue of whether the Shroud was once a painted surface or not.\nAlas, the Church seems to be going quiet on the Shroud and will hide it away until 2025. A lot of progressive Catholics are somewhat embarrassed about it.I don’t know whether this was deliberate editorial policy or not but I could not find the exposition even mentioned in the Tablet (British Catholic journal) for the week that it opened.\n\n","date":"July 13, 2015 at 3:07 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205459","author":"Charles Freeman","site":"shroudstory"},{"title":"The Meaning of Solid","post":"So if the scanner didn’t show traces of vermilion on the Shroud, you wouldn’t then say that it must have flaked off??\n\n","date":"July 13, 2015 at 3:38 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205460","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Meaning of Solid","post":"I would place  whatever the scanner showed alongside the other evidence of the Shroud. If there are any traces of  original paint  a scanner of this sophistication would be able to pick them up but, unlike most objects  of this type, we can’t get access at the moment so this is all hypothetical.\nObviously if the scanner did pick up traces of the vermillion from the blood areas it would be pretty conclusive- well, nothing would ever be conclusive to some…… but I was pleased to see that Thomas still has an open mind.\n\n","date":"July 13, 2015 at 6:17 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205476","author":"Charles Freeman","site":"shroudstory"},{"title":"The Meaning of Solid","post":"why do you even bother?\n\n","date":"July 12, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205399","author":"Nabber","site":"shroudstory"},{"title":"The Meaning of Solid","post":"De wesselow is a credibly credentialed art historian. No?\nIn his book he cites two well known art historians – Hans Belting and Ernst Kitzinger – as arguing that the shroud was in Constantinople around 1200\n\n","date":"July 12, 2015 at 5:00 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205360","author":"Thomas","site":"shroudstory"},{"title":"The Meaning of Solid","post":"The Google translation is awful. I don’t recognise myself in it. I will tray to do better if I have a little time to do it. (I am really busy now with the end of courses and the burocratic paperwork).\n\n","date":"July 12, 2015 at 5:12 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205363","author":"David Mo","site":"shroudstory"},{"title":"The Meaning of Solid","post":"Thank you. \n\n","date":"July 12, 2015 at 5:26 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205367","author":"Dan","site":"shroudstory"},{"title":"The Meaning of Solid","post":"So when David Mo says he thinks the above skeptics are “solid thinkers” and then defines solid as “this is what I think” surely he means only of others and not himself.\n\n","date":"July 12, 2015 at 8:59 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205383","author":"AONU","site":"shroudstory"},{"title":"The Meaning of Solid","post":"It does seem that a lot of what was published in Shroud newsletters, infighting, favouritism, personal attacks and so on did not make the realm of Shroud studies interesting to many historians of religion and scientists. There is still time (for this generation of “Shroudies”) to make things more attractive to scholars and scientists.\nI really do not see the need to bring J.D. Crossan into the picture; as I commented a few days ago, if we are to believe what he thinks,there would be no New Testament for him to misinterpret.\nI received his book on the “historical Jesus” for review more than a decade ago. We learn more about Mediteranean culture than about Jesus. How could a sophisticated and learned Jesus be a “Mediterranean peasant”, as he wants us to believe? It is known from archaeological research that Jews migrated from Judaea to Lower Galilee after the Hasmoneans took over and they owned the land. Some became tenant farmers. Further, as Father Joseph A. Fitzmyer tell us, we have no access to the ” historical Jesus”, only to the “Jesus of history” and Msgr. J.P. Meier makes it clear that even the “real Jesus” is not accessible to us. No wonder that even the liberal Protestant scholar Helmut Koester felt that Jesus research should be laid to rest for another hundred years.\nJ.D.Crossan was in Jerusalem after the so-called Jesus family tomb documentary and accompanying book was launched. Perhaps he went there thinking that he might have been wrong in writing about what happened to Jesus’ body after the crucifixion. Only, he went to the wrong tomb! That was his second mistake. Why?\nNo serious archaeologist or historian, both in and out of Israel, believes that Jesus was not buried in a tomb.\nhttps://www.academia.edu/7471287/Book_Review_The_Tomb_of_Jesus_and_His_Family_Exploring_Ancient_Jewish_Tombs_Near_Jerusalems_Walls\n\n","date":"July 12, 2015 at 10:43 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205389","author":"Louis","site":"shroudstory"},{"title":"The Meaning of Solid","post":"Given my English level, it will be better if I don’t translate anything. I will try to explain my position.\n1. I am not scientist. I can not to check out the scientific reliability of some sindonist statements, by Adler or Rogers, for example. I let this matter to more qualified persons here as Colin, Hugh and others.\n2. But I can see some scientific features from the perspective of the sociology and the philosophy of science. Both not too much sophisticated, of course.\n3. From this outlook I consider that a concept becomes scientific when is widely used by the scientific community. More specially, when it is integrated in a theoretical corpus with practical implications. This is the unique way to contrast its evidence.\n4. Some sindonists claim that they have successfully used some innovative technics in certain areas with huge implications. Adler and Heller on detecting ancient blood, Rogers or Fanti on some methods to date ancient textile (vaniline and mechanical), and so on.\n5. If they were truly scientific these methods and its theoretical basis, they would be widely discussed and used by the scientific community in specialised books, congresses and papers. If it would be so, we had a wide series of experiments on their bases. This would allow us, the non-specialist people, to asses if these theories would be scientific or not.\n6. The sindonists’ revolutionary methods are absolutely overlooked by the scientific community. Their theories had a marginal presence in a handful of peer reviewed journals and no more. Despite of its potential importance they hadn’t had any effect on the Archaeometry of the last fifty years.\n7. This is why they cannot be considered as “scientific” from  my point of view. (“Pseudoscientific” needs an ulterior explanation).\n8. I have applied this scheme to the historical field that I know better.\n9. If scientifically confirmed, the existence of a more or less miraculous shroud of Jesus would be the radical importance to the problem of the “historical Jesus”. It would be expected that some of the believer historians mentioned it in the context of their debate against the mythicists.\n10. This is not the case. I don’t know any reference in the work of the most relevant historians or exegetes, neither contemporary nor in the past. And I have read enough on the subject: Meier, Brown, Sanders, Dunn, Ehrman, Crossan, Bultmann, Vermes, Winter, Renan, Hurtado, etc., apart from Spanish authors as Piñero, Puente Ojea, Montserrat, Bermejo, etc.\n11. I have provided in my blog two explanatory hypothesis, but I can not explain them now. (Time, time!) I will try to continue tomorrow.\n\n","date":"July 13, 2015 at 9:14 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205491","author":"David Mo","site":"shroudstory"},{"title":"The Meaning of Solid","post":"I can answer for myself and my studies and can say nothing about why scientists in general have not taken up the methodology employed by Shroud scientists. All I can say is that Shroud scientists did their job with seriousness and this should pave the way for others to make their own tests.\nAfter two decades of writing on biblical archaeology and studies I have noted that controversy is still raging and will not come to an end soon. If Jesus’ resurrection is dismissed as myth or as an event that is beyond the purview of the historian in these circles one can really not expect any interest in a relic that has not yet been authenticated.\nYou will read about the reaction to what we have learnt so far from one historian I had occasion to interview:\n https://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\nIn this controversy about what is fact or myth there also appears to be no lack of manufactured evidence, apparently coming from mythicists. The link below is an old article that was published as soon as the James ossuary reached the front pages, around three months before the IAA said that the second part of the inscription was forged:\n https://www.academia.edu/13960422/The_James_Ossuary_Much_Ado_About_Nothing\n\n","date":"July 13, 2015 at 2:22 pm","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205519","author":"Louis","site":"shroudstory"},{"title":"The Meaning of Solid","post":"Trying to do something in order to improve\nthe precision of measurements in the field\nof Textile Archaeometry (using AFM, CFM,\nAFM three-point bending tests, AFM-Raman, SNOM, etc.)\nis an extremely important question…\nWhere is our Science?\nOnly improvements for NASA’s explorations?\nAnyway, now I want to change the discourse, because\nI see nothing of new in your minds (for example:\nI didn’t see any true discussion about ATR-FTIR, the inherent\ndepth of penetration on linen fibrils, etc.!) about this basic argument…\n— —\nToday I have a further look at a fine book by an Italian mathematician:\nOdifreddi. In the book we can see the photography of the Face of the\nShroud compared to the photography of the funeral mask of Agamemnon.\nBut, unfortunately, this issue has been (“devilish”, but maybe\nI should write: diabolically, without even use quotes …) reversed\ninto the idea that the Shroud is a fake (…because of\n“too much verisimilitude “…)!\nI admit, however, that Geometry is a very important matter\n[see also: PCA (Principal Component Analysis) and differences\nfrom spectral data…] and that Piergiorgio Odifreddi is a strange\nkind of professor, often funny or original in his scientific speeches\n…but completely wrong with the idea about the Shroud…\nThe idea of Odifreddi seems to be the following:\n> Only a bas-relief of little depth can leave an imprint similar.\nBut we know that some researchers (and among them …\nnow I want to point out a name: Don Gaetano Intrigillo)\nwere able to perform some tests demonstrating\nthe possibility of obtaining interesting images from\na body (especially the Face), or from something\nthat reproduces it…\n\n","date":"July 13, 2015 at 11:24 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205508","author":"piero","site":"shroudstory"},{"title":"The Meaning of Solid","post":"Analytical Archaeometry can describe linen fibrils of the Holy Shroud\n(involved in B.I.F. or simply being part of that ancient linen cloth)\nin a new and gently manner and this interesting and challenging\nfield of research is (or will be) the winning space for new\nShroud studies (IMHO).\nHave you nothing to reproach to me,\nabout the previous words?\nPerhaps I have to study in a better manner\n“Multivariate data analysis methods”, such as\nPrincipal Component Analysis (=PCA), that are commonly\nused in the qualitative and quantitative analysis of\nspectral data… and other interesting things.\nSo, nothing to do with: “sindonists’ revolutionary methods …”\nonly Applied Science!\n\n","date":"July 13, 2015 at 11:52 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","id":"comment-205510","author":"piero","site":"shroudstory"}]
