[{"title":"The Night of the Shroud premiered in Spain by RAI in Valencia","post":"One can only hope this documentary/ film eventually becomes a world wide release. I for one would really like to see it….Alot of funky stuff happened back then that is not well understood or even known. This film, I hope, opens people’s eyes to the travesty of the radiocarbon dating which occurred or as William Meacham as declared it;  ‘The Rape of the Turin Shroud’….quite literally ;-)\nR\n\n","date":"May 4, 2012 at 6:26 am","url":"https://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/","cat":"other_blogs","id":"comment-11108","author":"Ron","site":"shroudstory"},{"title":"The Night of the Shroud premiered in Spain by RAI in Valencia","post":"I’ve been at Valencia attending the Congress with my husband an we’re privileged to watch the documentary «The night of the Shroud» which is very interesting and surely no biased on the matter of 1988 radiocarbon dating and their rebuttal by Benford, Marino and Professors Raymond Rogers and Robert Villareal.\nAt the end my husband asked producer Francesca Sarracino when would the DVD be available to the public, and she said maybe next September\n                                          best regards\n                                        Maria da Glória\n                                Centro Português de Sindonologia\n\n","date":"May 4, 2012 at 7:45 am","url":"https://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/","cat":"other_blogs","id":"comment-11111","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"The Night of the Shroud premiered in Spain by RAI in Valencia","post":"Hi Maria, what would you say was the best point brought across by the film? …If you don’t mind me asking.\nThanks,\nRon\n\n","date":"May 4, 2012 at 1:22 pm","url":"https://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/","cat":"other_blogs","id":"comment-11127","author":"Ron","site":"shroudstory"},{"title":"The Night of the Shroud premiered in Spain by RAI in Valencia","post":"Hi Ron\nI don´t mind answering your question nonetheless the best is to wait for having the opportunity to watch this interesting documentary and then draw our own conclusions.\nWe’ll do it for the second time and with grat pleasure.\nTHe documentary deals with several Shroud issues but it focusses mainly on 1988 radiocarbon tests and the aftermath of their daing results, hence the name of the documentary.\nI’ll highlight the following aspects\nThe hidden agenda behind planning radiocarbon dating tests involving the labs, Professor Harry Gove and the Vatican is thoroughly analyzed.\nAn updated information about Sue Benford and Joe Marino’s invisible reweaving repair theory, and unbiased information on Professor Raymond Rogers and Robert Villareal’s investigations on residual material from 1988 radiocarbon samples.\nAt the end, people watching the documentary become aware that «the night of the Shroud» has come to an end and the truth will prevail\nI strongly recommend watching this documentary.\nbest regards\n                          Maria da Glória\n                     Centro Português de Sindonologia\n\n","date":"May 7, 2012 at 5:30 am","url":"https://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/","cat":"other_blogs","id":"comment-11189","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"}]
