[{"title":"The Science of Logical Forensics","post":"Abrasions on the shoulders of the man of the Shroud, particularly on the dorsal image of the right shoulder, indicate that he carried a heavy object, such as the transverse beam of a cross.\nThe man on the Shroud has cuts to both knees, especially to his left knee, indicating an unprotected fall onto a hard surface. A Roman crucifixion victim was made to carry the horizontal crossbeam tied to his outstretched arms and placed across the back of his neck\nThis is outdated info. New studies suggest the whole cross was actually carried, not just transverse beam, see http://www.acheiropoietos.info/proceedings/GloriWeb.pdf\nBut if the crossbeam had been in direct contact with his scourged shoulders, the lacerations would have widened, but on the Shroud, they have kept their shape. This is consistent with the man on the Shroud carrying his cross under which was a garment protecting his scourge-wounded shoulders\nAnd this garment is the current Tunic of Argenteuil, of which Jones is still not aware. The Andrè Marion’s comparison of the blood marks on the Tunic and the Shroud, suggest not only the two objects belongedto the same person, but also that this person carried the whole cross.\n\n","date":"December 3, 2013 at 7:20 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-55589","author":"O.K.","site":"shroudstory"},{"title":"The Science of Logical Forensics","post":"I read somewhere (how’s that for a reference?!) that Roman law dictated a criminal’s heart be pierced before the body could be removed from the cross to ensure he was dead. Normally the corpse was left up both as a punishment and a warning. However, given the urgency of that particular Sabbath as recorded by John, the bodies had to come down. This would explain both the unbroken legs and the pierced heart. How ironic if the laws of the very empire which demanded Jesus’ death now aided in identifying the shroud and the person once contained therein.\n\n","date":"December 3, 2013 at 8:27 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-55626","author":"frbae","site":"shroudstory"},{"title":"The Science of Logical Forensics","post":"Is it fortuitous that this post follows directly after the Wikipedia one, and its comment by Jeffrey Liss on the importance of primary sources? Stephen Jones blogs are always well laid out and admirably clear, and his references full, but I could quite understand Wikipedia rejecting them wholesale. I know I will be accused of nit-picking as usual (because I am), but unless one is only attempting to preach to the converted, these things must be looked at.\nTaking the first few references as an illustration of the whole:\n“The man on the Shroud was crucified as the New Testament records that Jesus was[1].” Surely the reference should be to the New Testament, but no, it is to Stevenson & Habermas’s book concluding what Jones is setting out to demonstrate.\n“The first century BC Roman orator Cicero called crucifixion “the most cruel and atrocious of punishments” and the first century Jewish historian Josephus, described it as “the most pitiable of deaths”[2]. Cicero. In Verrem. 2.5.169. Josephus. De Bello Judaico. 7.203. Not, as Jones has it, Wilson & Schwortz.\nSo far, perhaps, so trivial, but it lulls you into a false sense of security…\n“Historical sources indicate that it was not the full cross that was carried, as depicted in Christian art, but rather the crossbeam only, called in Latin the patibulum[6].” This reference is to Fr Wuenschel’s book, “Self-Portrait of Christ: The Holy Shroud of Turin.” Fr Wuenschel’s “historical source” is the work of Giulio Ricci, whose suggestion was made on the basis of what he observed on the shroud of Turin! In other words there are no historical sources regarding the carrying of the patibulum at all. What’s more, C.M. Glori, at http://www.acheiropoietos.info/proceedings/GloriWeb.pdf, rather elegantly demonstrates that the alleged bruise marks on the shoulder blades of the shroud could not have been made by carrying the patibulum after all. They could, perhaps, have been made by dragging a heavy beam along, held over the shoulder, and switching from one to the other for relief.\n“It was also part of Roman crucifixion that the victim was made to carry his cross naked through the streets to the site of his execution[8], but as a concession to Jewish morality, Jesus was given back his clothes after being scourged (Mt 27:31; Mk 15:20)[9].” The reference here is to Fr Werner Bulst’s “On the Shroud of Turin.” Alas, I do not have this book. Can anybody refer me to Fr Bulst’s source of information about this? Or in fact any quote from Roman times suggesting that the victim usually carried his cross naked through the streets? Josephus? Quintillian?\nAnd so it goes…\n\n","date":"December 3, 2013 at 8:56 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-55647","author":"Hugh Farey","site":"shroudstory"},{"title":"The Science of Logical Forensics","post":"Hugh, straight from the shoulder: if someone claims that he/she knows how the Roman crucifixion exactly looked like, he/she is either mistaken, or  blatantly lying. The most detailed descriptions of Roman crucufixion are in the Gospels, especially Gospel of John. We have besides the bones of Jehohanan, and that’s almost all. What we know is almost nothing -it is the Shroud that teaches us how the Roman crucifixion looked like. That the TSM was crucified is undisputable. The only thing is to reconstruct in what manner exactly.\n\n","date":"December 3, 2013 at 10:08 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-55672","author":"O.K.","site":"shroudstory"},{"title":"The Science of Logical Forensics","post":"and that’s almost all\nThere is still something, we have at least two graffiti from the Roman era, showing crucifixion:\n\nOn the left, the grafitti from Puozzola near Naples, on the right, the infamous Alexamenos graffito from Palatine Hill, Rome, anti-Christian caricature from between 60-220 AD.\n\n","date":"December 3, 2013 at 10:33 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-55690","author":"O.K.","site":"shroudstory"},{"title":"The Science of Logical Forensics","post":"Dan: There is a lot to question here; for instance how can we really know that his legs were not broken. My take is that we can only, at best, state that there is no obvious evidence that the legs were broken.\nIt is very hard to break the legs of the TSM in the way so it would be invisible on the image. The displacement is higly likely, especially after use of heavy hammer, and complex operation of  taking down the corpse from the cross. The legs are more or less bent, do you think it would be possible had they been broken?\n\n","date":"December 3, 2013 at 10:21 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-55678","author":"O.K.","site":"shroudstory"},{"title":"The Science of Logical Forensics","post":"“That the TSM was crucified is undisputable.” Hardly. It is, as any skim through the internet will show you, hotly disputed.\nNevertheless, you are correct that it is an interesting exercise to take as an axiom that the image is an accurate depiction of a crucifixion victim, and from it, to attempt to reconstruct the events that resulted in it. However, without independent qualification, we cannot be sure that we are not reconstructing a medieval version of crucifixion, and not a Roman one at all.\nWalked naked throught the street? – No evidence for that, I believe.\nCrucified naked? – Well, I can’t find evidence for that either, much to my surprise.\nCarried the patibulum? – I’ve found “patibulum ferat per urbem, deinde offigatur cruci,” which seems to be one of only three lines preserved from a lost play of Plautus, and recorded by the 10th century linguist Nonnius Marcellus. Indicative rather than definitive, I would say.\nNails through wrists? – The only victim found has some disputed scratches on an armbone, some way from the wrists. There would be no danger of tearing if the victim sat on a sedile or stood on a suppedaneum (as in one of the grafitti).\nNails through feet? – The only victim found has them through the sides of the feet, as does one of the grafitti. The other has the two feet side by side not on top of each other.\nBroken legs? – The crurifragium features relatively often in classical literature, but was clearly not invariable, especially if a plolonged death was required.\nSpear? – Quintilian is often quoted here, in his Declamationes Maiores, where he has a character claiming that cruxifixion victims who have been pierced may be buried. Not that others may not be. Again, indicative rather than definitive, I would say.\nNow, go back to those confident statements claiming that the shroud conforms exactly to a first century Roman crucifixion. Well it may, but the evidence is meagre at best. What the shroud does conform to is a 19th century reconstruction of a typical Roman crucifixion based on… the shroud itself. What a surprise.\n\n","date":"December 3, 2013 at 2:35 pm","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-55815","author":"Hugh Farey","site":"shroudstory"},{"title":"The Science of Logical Forensics","post":"However, without independent qualification, we cannot be sure that we are not reconstructing a medieval version of crucifixion, and not a Roman one at all.\nNow, go back to those confident statements claiming that the shroud conforms exactly to a first century Roman crucifixion.\nOne can crucify a man in thousand ways, you know:\n\n( http://upload.wikimedia.org/wikipedia/commons/3/3b/Japanese_Crucifixion.jpg – WARNING: DRASTIC)\n\nand so on. We hardly know anything about Roman crucifixion -and even whether there was a single model of Roman crucifixion (probably not).\nNails through feet? – The only victim found has them through the sides of the feet, as does one of the grafitti. The other has the two feet side by side not on top of each other.\nIt is possible that four nails, not three, were used to crucify Jesus/TSM -and I am in favor of the four-nail scenario, for some reasons. \nWhat the shroud does conform to is a 19th century reconstruction of a typical Roman crucifixion based on… the shroud itself. What a surprise.\nAnd that’s the most funny thing -what have you expected, do you know what the Western crucifixes are modelled on? ;-)\n\n","date":"December 3, 2013 at 3:10 pm","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-55836","author":"O.K.","site":"shroudstory"},{"title":"The Science of Logical Forensics","post":"Why do I feel like I am eating a dinner that someone else picked out for me from the most tempting tidbits in Golden Corral buffet line. [Video removed by Dan]\n\n","date":"December 4, 2013 at 6:50 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-56292","author":"Paulette","site":"shroudstory"},{"title":"The Science of Logical Forensics","post":"I get the buffet line analogy. And I agree with you. I think this is a major weakness in the way Jones looks at authenticity. However, I don’t get the YouTube significance. It seems a bit insulting to Jones without any real basis. What do you think?\n\n","date":"December 4, 2013 at 10:32 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-56316","author":"Dan","site":"shroudstory"},{"title":"The Science of Logical Forensics","post":"I agree. I can’t see how to remove it.\n\n","date":"December 4, 2013 at 11:07 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","id":"comment-56320","author":"Paulette","site":"shroudstory"}]
