[{"title":"The Shroud of Turin and C14:  Case closed. Or, perhaps, not.","post":"Thomas de Wesellow labeled the carbon dating of the Shroud a “fiasco.” But it’s still there and the skeptics’ incantations awaken it every so often to haunt us again. It remains an easy out for those who can’t deal with the reality of Jesus Christ and the possibility the Resurrection is real. In my manuscript in progress, I have just finished Chapter 10 which deals with it and I am contemplating whether to release in some way which will not hurt the whole project which is “rounding the far turn and heading for the finish line.”\nUnfortunately, I have a jury to pick tomorrow in a difficult case that dragged along for more than seven years while the defendants slowed things down, hoping my client and I would just go away. We haven’t and as difficult as the case may be I have a duty to finally get it to trial.\nIn the meantime if you haven’t read it yet I touch in a cursory fashion on the issue in my Quantum Christ blog. See “The Shroud of Turin: Henrietta Lacks and ASM Carbon Dating.” http://quantumchrist-jck.blogspot.com/2013/05/the-sgroud-of-turin-henrietta-lacks-and.html There’s a typo in the URL but it works.\nBut “Oh, to be torn twixt love and duty.” Anyone know where that comes from? Not to worry, I will not forsake the Shroud.\n\n","date":"July 29, 2013 at 3:05 pm","url":"https://shroudstory.com/2013/07/29/the-shroud-of-turin-and-c14-case-closed-or-perhaps-not/","cat":"other_blogs","id":"comment-40053","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud of Turin and C14:  Case closed. Or, perhaps, not.","post":"HIGH NOON! Stanza 3:\n“O to be torn ‘twixt love and duty!\n S’posin’ I lose my fair-haired beauty!\n Look at that big hand move along\n Nearin’ high noon.”\n\n","date":"July 31, 2013 at 4:09 pm","url":"https://shroudstory.com/2013/07/29/the-shroud-of-turin-and-c14-case-closed-or-perhaps-not/","cat":"other_blogs","id":"comment-40209","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin and C14:  Case closed. Or, perhaps, not.","post":"Dave,\nYou are a true Renaissance man. You never cease to amaze me with your vast trove of knowledge.\nOn the other hand:  Did you have to “google” it?\n\n","date":"July 31, 2013 at 4:19 pm","url":"https://shroudstory.com/2013/07/29/the-shroud-of-turin-and-c14-case-closed-or-perhaps-not/","cat":"other_blogs","id":"comment-40210","author":"JOHN kLOTZ","site":"shroudstory"},{"title":"The Shroud of Turin and C14:  Case closed. Or, perhaps, not.","post":"Dan,\nJust a note of thanks for posting my Shroud blog article on your wonderful site. I am immensely flattered that you did so.\n– Steve Bastasch –\nrennyo01\n\n","date":"July 29, 2013 at 3:52 pm","url":"https://shroudstory.com/2013/07/29/the-shroud-of-turin-and-c14-case-closed-or-perhaps-not/","cat":"other_blogs","id":"comment-40058","author":"rennyo01","site":"shroudstory"}]
