[{"title":"The State of Skepticism: Ridicule works. Right?","post":"Well, unicorns could be easily produced through genetic manipulation over a dozen or less years. Therefore, its existence is theoretically possible!\n\n","date":"January 19, 2012 at 10:14 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7169","author":"Tersio Gorrasi","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"I always see the sin of pride at work in these types of essays which tells me who’s really at work in them. As part of our baptismal rite we are asked if we reject the glamor of evil. Something like this with all it’s implications would fall into that category in my mind.\n\n","date":"January 19, 2012 at 10:42 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7171","author":"Chris","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"The Bible does not mention unicorns. The King James Version of 1611 English Translation of the Bible incorrectly translated the Hebrew word re’em a “wild bull,” as “unicorn” in Num 23:22; 24:8; Dt 33:17; Job 39:9,10; Ps 22:21; 29:6; 92:10 & Isa 34:7. Modern English translations such as the ASV, NIV and ESV correctly translate re’em as “wild ox”.\nAs for the Shroud being “painted” KnightErrant is either ignorant or being deliberately provocative (i.e. a troll). Even the `Secular Bible’ Wikipedia effectively admits that the Shroud image is not a painting: \n“Painting  The technique used for producing the image is, according to W. McCrone, already described in a book about medieval painting published in 1847 by Charles Lock Eastlake (“Methods and Materials of Painting of the Great Schools and Masters”). Eastlake describes in the chapter “Practice of Painting Generally During the XIVth Century” a special technique of painting on linen using tempera paint, which produces images with unusual transparent features—which McCrone compares to the image on the shroud. This hypothesis was declared to be unsound as the X-ray fluorescence examination, as well as infrared thermography, did not point out any pigment. It was also found that 25 different solvents, among them water, do not reduce or sponge out the image.The non-paint origin has been further claimed by Fourier transform of the image: common paintings show a directionality that is absent from the Turin Shroud.” (“Shroud of Turin: Hypotheses on image origin-Painting and pigmentation,” Wikipedia, 15 January 2012).\nKnightErrant’s, “There is no more reason to believe in God than to believe in unicorns,” reminds me of an atheist I debated years ago on an Internet forum who claimed that God was nonexistent like Santa Claus. So I asked him: 1) why does he bother debating the existence of God then? 2) On what other forums was he debating the non-existence of Santa Claus?\nInternet atheists’ `body language’ (i.e. they waste a lot of time and emotion on someone they claim is non-existent) shows that they are “the sort of atheist who does not so much disbelieve in God as personally dislike Him”:\n“Hopping around their web world, one quickly gets the impression that there are two basic types of atheist. The first is the sincere, scholarly atheist, the type who walked away from the Unitarians when they got too evangelical. The Maine Atheists Union typifies this bunch. They want to `think freely’ and `live free,’ and one of their main precepts reads: `Nobody has all of the answers and nobody ever will. Take the time to get as close as possible to the truth.’ The other group is like Orwell’s embittered specimen from `Down and Out in Paris and London,’ `the sort of atheist who does not so much disbelieve in God as personally dislike Him.’ These shrill types can be found in places like MSN’s God is a Lie! chat community and, of all places, high school. … What do they all have in common? For one thing, a preoccupation with Christianity. Look around the precincts of atheism and you’ll see lots of slogans like `The Religious Right is neither,’ but you’ll never see `Taoism is for dummies.’ Or, for that matter, much anti-Judaism or anti-Islam sentiment …” (Last, J.V. “You Gotta (Dis)Believe,” Weekly Standard, 30 July 2002).\n\n","date":"January 19, 2012 at 10:44 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7172","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"In times past, a skeptic was a person who didn’t know if something was true, but they were willing to keep an open mind. Today’s atheists are not skeptics, they don’t even attempt to be skeptics. They are totally closed. They claim to subscribe to science, but true science does not jump to conclusions. \nThere is such outrageous dishonesty and hypocrisy among the “new atheists” that I don’t even attempt to engage them on their terms. Most of them don’t want to know the truth, they just want to batter down believers with their endless doubts for which there are no answers. They are like the Pharisees who tried to trick Jesus with complicated questions. His response was to point out their error rather than to engage in their ridiculous debate. \nJesus said that His sheep hear His voice. And the Bible says that we will hear a voice behind us saying, “This is the way, walk ye in it.” And, without faith it is impossible to please God. And, those who come to God must believe that HE IS, and that He rewards those who diligently seek Him.  \n(Those of you who know your Bible are familiar with all those verses.)  According to the Bible we can’t even get started with God unless we drop the blasphemy and approach Him with a willingness to do this on His terms. \nI’m very glad this blog is here to hold down the Fort, defending the integrity of the Shroud: because obviously it is being used to reach some of these hardheads. And that’s a great thing, it is amazing and astounding that God shows mercy even to those who blaspheme Him, by perserving the Shroud as a sign for a faithless generation.\n\n","date":"January 19, 2012 at 1:52 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7181","author":"AnnieCee","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"Stephen E. Jones, I suppose you’re right about the unicorns but a wild bull is not nearly as romantic. Women LOVE the dainty, sensitive creature known as the unicorn… \nAnd I think you are right about the Troll.\n\n","date":"January 19, 2012 at 3:03 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7187","author":"AnnieCee","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"Meanwhile, after Turin 2010, the Church keeps on hosting, organizing and promoting very high level exhibitions of the Shroud http://www.diocesismalaga.es/index.php?mod=content&secc=view&id=2012011706\nWhy not with other relics?  Is it only propaganda? Or are they basically convinced it is authentic? After all, they have had plenty of time since the C14 test to carry out their own experiments privately…..\n\n","date":"January 19, 2012 at 4:09 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7191","author":"Gabriel","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"Gabriel, we already talk about that and personally, I think the answer is pretty simple :  It’s mainly due to the nature of the relic and the fact that it is consider as the authentic burial Shroud of Christ, which would have been the last object to touch his body before resurrection.  I think that can explain pretty well why the Church is doing more exhibitions about the Shroud than about other relics.  I don’t think it is a statement of the Church about the authenticity (because the authorities know full well that, whatever the relic is true or false, it has the power to make people meditate on the life, passion, death and resurrection of Christ), and I don’t think we can call this propaganda either because, if they would like to do a real propaganda with this relic, they would show it much more than they have done in the past century.  We can even supposed that the Vatican would have organised a kind of world tour for the Shroud or something like that if the intention of the Church would be to used this Shroud for religious propaganda…  That’s my perception as a Catholic who’s not attract at all by any “conspiracy” theories regarding the Shroud or anything else.\n\n","date":"January 19, 2012 at 4:34 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7194","author":"Yannick Clément","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"Yannick, I agree but only partially because if it only was that the image helps Christians evocate and meditate on the Passion that would also work with the thousands of other relics or even with the many copies of the Shroud. However, it seems as though in this case,  they were saying something like: “ok, we admit it..in the past we have in many occasions promoted the devotion of false relics in the past, but believe us….. this time it is the good one!”.\nSomething that has also to be taken into account, as some comments regarding a previous skeptic post pointed out, is the very close connection of the Catholic Churh with science and in general, the Academia (scientists, Universities…)\n\n","date":"January 19, 2012 at 4:59 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7195","author":"Gabriel","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"I think your point can be true to a certain extend in the sense that I think there’s more people in the Church who believe the Shroud is authentic than there are people who believe any other relic could be authentic.  In that sense, the Shroud stand by himself in comparison with other relics and that’s maybe a reason why the Church seem to use it more.  The other reason I see is simply because the media have taken this relic into the World public scene like no other relics.  The Shroud “popularity” is much more important than any other Christian relics and it’s another important aspect to consider when you analyse the acting of the Church versus this relic.\n\n","date":"January 19, 2012 at 6:08 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7199","author":"Yannick Clément","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"Typo error. It should read “very high level exhibitions about the Shroud”\n\n","date":"January 19, 2012 at 4:10 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7192","author":"Gabriel","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"\nGabriel :Yannick, I agree but only partially because if it only was that the image helps Christians evocate and meditate on the Passion that would also work with the thousands of other relics or even with the many copies of the Shroud. However, it seems as though in this case, they were saying something like: “ok, we admit it..in the past we have in many occasions promoted the devotion of false relics in the past, but believe us….. this time it is the good one!”.Something that has also to be taken into account, as some comments regarding a previous skeptic post pointed out, is the very close connection of the Catholic Churh with science and in general, the Academia (scientists, Universities…)\nThe Church is always the last to believe in such things, so it is not surprising that in the past they showed the relic only sparingly. As I assume you have probably noticed though Gabriel, owing to your first post, they have been “showing” the Shroud at a drastically increasing interval. Practically every 10 years in the last 40. I wonder the same as you and I believe there is something to this, something we will never know and can only speculate too.\nR\n\n","date":"January 22, 2012 at 11:46 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7342","author":"Ron","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"Regarding there being “something to this” I recall there was a paper or pdf I read over at Barrie’s site, I think, that said that there was an unauthorized carbon dating of a tiny sample of the shroud at some point (I may be completely misremembering details here so take it with a grain of salt) that came back with a date of around 200 AD for the shroud. I think that the sample was too small to really date all that accurately and had a very wide margin of error. I also remember the article stating that the lab involved vigorously denied that this dating ever happened. I vaguely remember reading this blurb and being stunned that anyone would even mention this since the lab denied it. But I always wondered if it was actually true and the lab was just CYA. I don’t think the main thrust of the paper was about this though but I can’t recall what it was about and I wish I could.\nWeren’t remnant pieces of the shroud retained for future study? I suppose it’s possible someone may have done some unpublished work on them however, I would not put stock in it until it’s published and vigorously reviewed. Still it’s tantalizing for those of us that would like to see actual work move forward on this.\n\n","date":"January 22, 2012 at 3:18 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7373","author":"Chris","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"I have a vague memory of reading the same. I believe the original c14 was ‘unauthorized’ and of the dating being ‘possibly’ early 2nd century…I think the testing occurred in the early 70s, maybe ’73?. By the way what does CYA mean? Also maybe if Dan reads this, Dan can help us out here if he’s read or heard anything on this early c14 dating.\nR\n\n","date":"January 23, 2012 at 12:09 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7419","author":"Ron","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"Ron/Dan, I found it. \nhttp://www.shroud.com/pdfs/textevid.pdf\nIt mentions Rossman’s unauthorized dating of a single thread of the Raes sample in 1982. Half the thread dated to 1200 AD and the other half to 200 AD. It says that Rossman personally confirmed this in a personal conversation with the author. It does not mention margins of error though as far as I can tell. Given the protocol for testing samples during the 1988 official testing one has to wonder what the MOE would be for a single thread. It also doesn’t address any potential contamination of the half which dated to the 2nd century. I could imagine if this were really true why some folks would seriously be knocked over by the 1988 findings.\nThere is also another paper and this one is probably the original paper I read:\nhttp://www.shroud.com/pdfs/oxley.pdf\nIt mentions the above paper and adds that Rossman vigorously denies any such testing took place in 1982 and even states that the equipment was not available at the time. So we have to take the original claim with a grain of salt. \nCYA means to “Cover Your (A) Derrier”. Meaning Rossman may be trying to avoid a legal situation or other liability created by admitting to an unauthorized CD. The first link mentions that there was an agreement STURP was obliged to follow. \nIn the end it’s tantalizing at best.\n\n","date":"January 23, 2012 at 1:42 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7424","author":"Chris","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"Another interesting tidbit from Barrie’s site: \nhttp://www.shroud.com/late02.htm\nScroll down to see Caltech’s response to Benford and Marino’s claims that Rossman did the unauthorized radiocarbon dating on the Raes thread in 1982. THEN immediately afterward read Benford and Marino’s response to Caltech denial. \nAbsolutely tantalizing.\n\n","date":"January 24, 2012 at 10:57 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7478","author":"Chris","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"Awesome find Chris, thanks.\nR\n\n","date":"January 23, 2012 at 3:08 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7431","author":"Ron","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"In 1982,  actually and most unofficially,  Rossamn radiocrabondated a spliced thread from the Raes corner.\n\n","date":"January 24, 2012 at 8:14 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7466","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The State of Skepticism: Ridicule works. Right?","post":"In 2006, in a paper enttitled “LINCEUL DE TURIN :\nFAUSSE RELIQUE OU FAUSSE DATATION Carbone 14 ?” subtitle “Contre-enquête sur un fiasco scientifique”, I wrote: \n“Comme beaucoup de gens encore aujourd’hui, ils (Tite & Hall) ignoraient qu’en 1982, un minéralogiste de renommée mondiale, le Pr George R. Rossman du laboratoire de l’Institut Technologique de la Californie (« Caltech ») à Pasadena, avait déjà procédé d’une façon non officielle, à un test radiocarbone sur la relique. Le micro-échantillon daté en secret avait consisté en un seul et unique fil d’environ 8 cm tiré à partir de la zone de l’échantillon semi triangulaire prélevé, en 1973, par le Pr Gilbert Raës ; zone jouxtant celle précisément où avait été extrait l’échantillon C14 officiel. \nLe fil dont une partie était apparue enduite d’une couche superficielle plus sombre avait été coupé en deux. On avait alors abouti, pour le même fil, à une datation à deux extrémités encore plus hétérogènes que celle obtenue en 1988 par les trois autres laboratoires : le  IIe siècle pour la partie apparemment non contaminée et le XIIe  siècle pour l’autre partie pourtant décontaminée (soit un différentiel de mille années !). Rossman ne publia jamais son\nrésultat.”\n\n","date":"January 24, 2012 at 8:33 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","id":"comment-7469","author":"Max Patrick Hamon","site":"shroudstory"}]
