[{"title":"Time will tell.","post":"I think that for the sake of clarity, you should not have splitted the post on banding, into one, two, three, four posts… A confusing pdf… And i don’t know what’s going to pop up.\nI’ve answered.\nThibault has paraphrased.\nBanding is real.\nWhat you see here is just what i’ve predicted at the end of “banding? Is it real?” \n“this spoonfeeding will trigger another version in CB far fetched theories.”\nThere is no more science in this one than in the ludicrious first post of Colin about banding.\nI won’t put a resume next to my name, maybe, Thibault will wake up, repeat what i say, and be listened to, that’s the Thibault’s effect.\nIf on such a basic issue one is misunderstood, there is no need to argue any longer.\n\n","date":"August 31, 2014 at 3:41 am","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147493","author":"anoxie","site":"shroudstory"},{"title":"Time will tell.","post":"As I wrote around a week ago, Dan, Time will tell.\n\n","date":"August 31, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147592","author":"Louis","site":"shroudstory"},{"title":"Time will tell.","post":"Where do you think I stole the wording?  From Colin Berry?\n\n","date":"September 1, 2014 at 6:43 am","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147724","author":"Dan","site":"shroudstory"},{"title":"Time will tell.","post":"Good to see you agreed with my wording, Dan. The discussion on the image is becoming a game of ping pong. It could be OK if it was only that, but it isn’t. The same things are being repeated over and over again. One day or the other someone may find an undeniable link between the TS and the Image of Edessa, fresh carbon dating may tell us something, Shroud conferences may produce new and convincing theories, or some scientist may feel he has made an exact copy of the TS. Time will tell.\n\n","date":"September 1, 2014 at 8:51 am","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147749","author":"Louis","site":"shroudstory"},{"title":"Time will tell.","post":"Time will tell… about what?\nSo far, i’ve restrained myself to tackle each issue one by one. The latest being the banding.\nThe banding effect is not an illusion, and time has nothing to do with it.\nEven a game of ping pong has rules, and a score.\n\n","date":"September 1, 2014 at 11:35 am","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147785","author":"anoxie","site":"shroudstory"},{"title":"Time will tell.","post":"Time will tell: it will give us the last word about the TS.\n\n","date":"September 1, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147793","author":"Louis","site":"shroudstory"},{"title":"Time will tell.","post":"And in the meantime we can say what it is not. Data have been collected, and if you want to build a theory you’ve to deal with it.\nHere, we’ve been merely talking about high definition pictures of the Shroud.\n\n","date":"September 1, 2014 at 12:25 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147797","author":"anoxie","site":"shroudstory"},{"title":"Time will tell.","post":"I have noticed that those who have examined the relic ignore what is being said by others who are working on high definition pictures. They seem decided about what it is and what it is not. This is not to say that discussion about high definition pictures should be ruled out, it is necessary, as long as things are not repeated over and over again.\nSince the relic is no longer available, at least for the time being, for fresh hand-on examination, Turin could at least release the almost 2000 microphotographs taken during the restoration it has in its possession. Time will tell,but the sooner the better.\n\n","date":"September 1, 2014 at 12:46 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147805","author":"Louis","site":"shroudstory"},{"title":"Time will tell.","post":"We’re talking about banding here, not playing ping pong. Who has ignored what claimed by whom on which basis?\n\n","date":"September 1, 2014 at 12:56 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147808","author":"anoxie","site":"shroudstory"},{"title":"Time will tell.","post":"Sorry, have a look at what people who have seen the relic have published. I am not saying they are 100% correct, but then it is apparent that they find most of the discussion to be speculation.\n\n","date":"September 1, 2014 at 1:09 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147812","author":"Louis","site":"shroudstory"},{"title":"Time will tell.","post":"Sorry, i don’t get your point.\n\n","date":"September 1, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147813","author":"anoxie","site":"shroudstory"},{"title":"Time will tell.","post":"What I am trying to say is that the discussion going on in the blog is ignored by many of the Shroud scientists, whether they have examined the relic or not. Dan pointed this out in a thread around two weeks ago. Now, why is this happening? Is it because the discussion is considered to be nothing more than mere speculation?\n\n","date":"September 1, 2014 at 1:20 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147814","author":"Louis","site":"shroudstory"},{"title":"Time will tell.","post":"Ok. I don’t really care.\nBest recent contributions to the study of the Shroud have been made by… Thibault Heimburger and Kelly Kearse.\nI’ve already given my opinion on PDL, Fanti, Jackson… the Valencia consensus…\n\n","date":"September 1, 2014 at 1:35 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147816","author":"anoxie","site":"shroudstory"},{"title":"Time will tell.","post":"Dear researchers,\nI have found an interesting idea to apply:\nLocal Nano-Thermal Analysis with an AFM = Nano heating probes allow for rapid heating and cooling and precise temperature control…. !\n— —\nIn this manner we can see what happens on linen fibrils (at nanolevel),\nperhaps with a great precision (… and on different kind of preatement for fibrils…).\nShroud conferences have to take into account that analytical problem.\nDo you agree ?\n— —\nRegards\nPI\n\n","date":"September 1, 2014 at 12:48 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-147806","author":"piero","site":"shroudstory"},{"title":"Time will tell.","post":"First of all …  Errata corrige :\npreatement for fibrils = wrong\npretreatments for fibrils = right\n— — — — —\nYou indicated the argument : a contact scorch…\nSo …\nIf we want to control in a careful manner our linen samples\n(coming from the experiments with materials treated as in ancient times\nand not from modern treatments !), then we have to observe what happens\nat nanolevel !\nSee also :\nPre-Heating Scan\nand\nPost-Heating Scan\n— —\nNano-TA is a local thermal analysis technique which combines the high spatial resolution imaging capabilities of atomic force microscopy with the ability to obtain understanding of the thermal behaviour of materials with a spatial resolution of sub-100nm.\nThe conventional AFM tip is replaced by a special nano-TA probe that has an embedded miniature heater and is controlled by the specially designed nano-TA hardware and software.\nThe user can select the spatial locations at which they would like\nto investigate the thermal properties of the surface\nThen the user obtains interesting informations by applying heat locally\nvia the probe tip and measuring the thermomechanical response.\n— —\nIs that argument (= Nano Thernal Analysis) a speculation ?\nNano TA is an useful technique to identify the behavior of the material\nsubjected to heat.\nIs my intervention only another confusing and discordant note ?\nI do not think so …\nThen … I hope in your comments.\n\n","date":"September 2, 2014 at 8:37 am","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","id":"comment-148058","author":"Piero","site":"shroudstory"}]
