[{"title":"To be lost in a sea of trolls and spam","post":"“Unfortunately, the Huffington Post site asked him to log in to his Facebook account or create an account with Huffington Post before posting.”\n(My italics).\nHad there been an option to create an account with the Huff, I’d have used it. But that’s my entire point. That option was not on offer. One HAD to sign up with Facebook if one wanted one’s comment to appear.\nIt’s precisely that kind of behaviour on the part of Facebook, attempting to hoover up anyone who wishes to venture a view on the Huff (and other octopus-like FB-proxy sites), that resolves me never to be baited into signing up against my better judgement.\nOne sees the same control freakery with Google and its search engine.  When I try to retrieve something I’ve written in the distant past by adding “sciencebod” to the end of the string I first get back a list of irrelevancies headed with “We are showing results for science bob. Did you mean sciencebod?”.\n It’s the same with other infrequently used terms, often technical, that have been carefully entered. Google assumes one has been careless and offers no facility (that I’m aware of) for disabling its irritant presumption of  superior knowledge. How long before California starts telling one what color tie to wear on Mondays?\n\n","date":"September 26, 2014 at 4:59 am","url":"https://shroudstory.com/2014/09/26/to-be-lost-in-a-sea-of-trolls-and-spam/","cat":"other_blogs","id":"comment-156532","author":"Colin Berry","site":"shroudstory"},{"title":"To be lost in a sea of trolls and spam","post":"I guess I didn’t see how pervasive Facebook was because like most people in the world I’m logged in all the time to keep up with my children and grandchildren.\n\n","date":"September 26, 2014 at 5:58 am","url":"https://shroudstory.com/2014/09/26/to-be-lost-in-a-sea-of-trolls-and-spam/","cat":"other_blogs","id":"comment-156595","author":"Dan","site":"shroudstory"},{"title":"To be lost in a sea of trolls and spam","post":"I think Colin as identified himself as troll when it comes to this site. It is one think to argue against authenticity, it is another to paint with a broad brush those who disagree with you as ignorant or superstitious. \nThat really is unacceptable and it provides no room for debate. If there is one thing the members of the STURP team were not it was “ignorant or superstitious.” The late John Heller when he was a Yale undergraduate was chosen in a special program to be advised by Einstein in Princeton 150 miles or so south of Yale. He began his work on the Shroud convinced that the Shroud was a fake. He changed his mind. It was not ignorance or superstition that changed his mind but the blood analysis that he and Al Adler did.\nThey were fanatic about checking their observations with other colleagues for critiques. (So was Ray Rogers.)\nIn my book, I quote from his memoir a moment when they reached out to other colleagues to check on their results:\n“Heller decided to check the results with at least two other top\nhemoglobin experts and see if they would be a sure as he and Adler were.\n“Adler got on the phone immediately and read the coordinates to his\nchosen specialist. The answer – old acid methemoglobin. Then they called\nBruce Cameron on a speaker – phone. His double doctorate was dedicated to\nhemoglobin in all its many forms. After they had given him the numbers and\nplotted them, Cameron was a little sharp. ‘You both should know what it is.\nIt’s old acid methemoglobin. I don’t know why you wanted to bother me with\nsomething you know as well as I do . . . Hey, wait a minute. Are you two\nidiots working on the Shroud of Turn?’\n“Indeed they were.”\nQuantum Christ, p, 138 Copyright John Klotz 2014\nThe book will hopefully be available on line before October 9, 2014.\n\n","date":"September 26, 2014 at 9:05 am","url":"https://shroudstory.com/2014/09/26/to-be-lost-in-a-sea-of-trolls-and-spam/","cat":"other_blogs","id":"comment-156777","author":"John Klotz","site":"shroudstory"},{"title":"To be lost in a sea of trolls and spam","post":"I’m ignoring this kind of provocation from John Klotz, For a start he seems unable or unwilling to distinguish between what one has said and not said.\n“it is another to paint with a broad brush those who disagree with you as ignorant or superstitious. ”\nIf he re-reads what I wrote, it was to say that belief in the authenticity of  the TS was NOT primarily a matter of ignorance and superstition. I said it was being fuelled by incessant media-promotion of pseudo-science – something entirely different.\nOh, and where did I ever say that Adler and Heller’s claims re ‘old acid methemoglobin’ was pseudo-science.  While I’ve commented adversely on their failure physically to isolate the iron-free porphyrin of human  blood and confirm its identity as protoporphyrin IX, e.g. by chromatography and mass spectrometry, my chief ire is directed to their naff “bilirubin story”. Not a shred of direct evidence was presented for the alleged presence of biliriubin,  which  incidentally is light-sensitive and prone to rapid photodegradation, again through failure to isolate and characterize by chromatography and mass spec. \nThe so-called “bilirubin story” which Barrie Schwortz continues to proselytize to this day as being for him the “clinching evidence” of authenticity, coming he said from Alan Adler, a “world expert on blood” (he wasn’t, he was a porphyrin chemist) is about as good a textbook example of pseudo-science as you are likely to meet. Repeat: it’s narrative-driven, authenticity-promoting pseudo-science based on fanciful narrative-friendly suppositions about why uv/visible absorbance and other spectra were atypical – NOT as one would expect from STURP supremos, i.e. on rigorous clinical biochemistry.\nI’ve said all this many times before, only to be greeted by silence, stunned or otherwise. That’s why (apart from the trolling) I can’t be bothered placing comments on this site anymore. There are folk here who know next to nothing about science, yet see scientists as fair game for their paranoia about “agnostics and atheists”. No thanks – am not  staying here merely to feed the real trolls that pop in and out of this site to sling mud at the sceptics.\n\n","date":"September 26, 2014 at 9:32 am","url":"https://shroudstory.com/2014/09/26/to-be-lost-in-a-sea-of-trolls-and-spam/","cat":"other_blogs","id":"comment-156809","author":"Colin Berry","site":"shroudstory"}]
