[{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"Coming again to the C14 issue, in the literature gathered by Dan in this post, there are two different groups of reasons that converge in the same idea that the validity of the test is questionable. One, is the possibility that the sample is not representative of the whole Shroud and the other one -and to me much more interesting- is the lack of homogeneity among subsamples according to some statistical tests. In one of these papers (Riani et al., 2010) the authors even identify a trend from the outer to the inner part of the Shroud. The reason why to me is much more interesting this second group of statistical reasons is that even if original linen were sampled, it could also be expected a lack of homogeneity and also, most probably, due to the lack of conclusive results a new cycle of useless discussions could start.\nThis is because nobody exactly knows what the impact of the very specific chain of historical events the Shroud has gone through (millions of people rubbing it for centuries, fires, humidity changes…..) could have on the C14 test. For this reason, even in the case that the Shroud were authentic, I would not be too confident that a new test, although correctly carried out by standards valid for other type of samples, would yield a 1st century datation. I guess that a new C14 test would not be helpful at all because all these papers sort of indicate what we can expect.\n\n","date":"January 31, 2012 at 2:15 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7775","author":"Gabriel","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"The essential component that is being analysed for C-14 is cellulose – which is easily contaminated I grant you – but cellulose is also chemically-resistant to harsh reagents – ask any chemist who uses it as filter paper. Exploiting its physical and chemical resistance, the 3 labs that determined C-14 each took elementary precautions to clean up samples with lipid solvents, acid, alkali etc, all with a view to removing the kind of carbon-based contaminants that might have been picked up through handling – skin oils, proteins, microorganisms etc.\n  clean up routines \n\n","date":"January 31, 2012 at 4:08 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7784","author":"sciencebod","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"Significance level (%) 5\n4.99 and the article is non conclusive… as said Dan, even Pr Ramsey admitted one should have a second look on the 1988 C14 datation.\nWhat is needed is a multinational, multidisciplinary team of reknowned experts, proposing a protocole to study the shroud physically, chemically, historically… \nOne can say the Vatican is reluctant, but creating such a team and protocole may be the hard bit.\nbest regards,\n\n","date":"February 2, 2012 at 2:17 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7867","author":"anoxie","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"A estas fechas, 2012, no tenemos certeza de qué es lo que se “quemó” en la prueba del C14.\nComo usted creo conoce, sciencebod, el Prof.Hull ( laboratorio de Arizona) nos sorprendió recientemente publicando en su revista, Radiocarbon, que estaba en posesión de uno de los fragmentos de la Sábana que TODOS creíamos, porque así lo contaba Nature, que había sido “quemado”……….\n\n","date":"January 31, 2012 at 4:51 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7790","author":"co","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"Google Translation of co’s comment:\nBy now, 2012, we are not certain what they are “burned” in the test of C14.\n  As you know I think, sciencebod the Prof.Hull (laboratory of Arizona) recently surprised us by posting in your journal Radiocarbon, who was in possession of one of the pieces of the shroud that everyone thought, because they had Nature, which had been “burned” … … ….\n\n","date":"January 31, 2012 at 5:29 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7794","author":"episcopalian","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"There has been a lot of suspicion about Arizona: outliers concealed, material set aside? It may not be significant but it sure raises questions about their adherence to protocol.\n\n","date":"January 31, 2012 at 5:32 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7795","author":"episcopalian","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"“The green picture of Einstein (copied over from BA) is supposed to explain what? Any picture will plot something even indented eyebrows.”\nThere is a simple explanation for the inverted eyebrows: when that iconic picture of the tongue-extended Einstein was taken he had silver hair and black eyebrows.\n counterpoint hair and eyebrows\n Any dumb computerised imaging system that says light is elevated and dark is recessed would produce that result.\nThe Shroud image was scanned by that same dumb system – and tweaked to get the best result. It’s hardly surprising that the “gold standard” original now produces sub-optimised images when you ask it to look at modern photographs  etc- or why the 1532 burn marks also show up in glorious 3D – having a gradation of scorch intensity that the computer “sees” as 3D relief. GIGO…\n\n","date":"January 31, 2012 at 4:53 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7791","author":"sciencebod","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"Sciencebod, are you seriously this dense? *Obviously* any photograph or painting will give you *some* result or other if you map brightness to elevation. But, like that Einstein photo (which came out mostly flat and with lines and inverted eyebrows), the result will not be anything like the actual elevation of a real human face. That’s the whole point. Actual photographs and paintings produce garbage when you run that sort of algorithm on them, whereas the Shroud produces an accurate elevation of a real human face.\nHence, either some super-skilled artisan deliberately encoded 3D information by “painting” the image in such a way that elevation would correspond with brightness, or the image was somehow produced by a real human body (or model of a human body) such that elevation would correspond to brightness. Showing us examples of how photos and paintings produce garbage results merely illustrates our point for us that the Shroud is not a painting or a photo, but an elevation map.\n\n","date":"January 31, 2012 at 8:21 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7808","author":"The Deuce","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"Your first sentence disqualifies you from the courtesy of a reply. Learn some courtesy first and I may try (again) to explain.\n\n","date":"January 31, 2012 at 8:50 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7811","author":"sciencebod","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"And your willful, obstinate, invincible ignorance of the most basic data disqualifies you from courtesy.\n\n","date":"February 1, 2012 at 1:06 am","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7820","author":"The Deuce","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"Exactly. Sciencebod you have no idea what you are talking about.\n\n","date":"January 31, 2012 at 5:34 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7796","author":"episcopalian","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"And you do I suppose. Perhaps you would care to explain why…\n\n","date":"January 31, 2012 at 6:00 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7800","author":"sciencebod","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"Es DIFÍCIL entender como alguien que se titula con formación científica no comprende algo tan SIMPLE.\nLa propiedad 3D de la sábana que demostró el VP-8, NO consiste en que proporcione una imagen  con VOLÚMENES, alturas y bajuras, del Hombre de la Sábana, sino en que esos volúmenes sean COHERENTES con la imagen de un hombre REAL.\nLas imagen 3D de las quemaduras de la Sábana, con sus volúmenes, NO son coherentes con las quemaduras reales, pues las quemaduras reales SON PLANAS, es una FALSA 3D\nCualquier foto o pintura NORMAL que usted someta a un programa 3D tipo VP-8, proporcionará siempre imágenes con VOLÚMENES que serán NO COHERENTES, falsa 3D, con el objeto o persona que represente la foto o pintura.\nEl VP-8, se ha repetido hasta la saciedad, NO estaba programado para ver las fotos NORMALES porque siempre proporcionaría resultados ABERRANTES, no coherentes con la realidad.\n“The isometric display was never intended to produce a “real-three-dimensional” display. A snow-covered peak would look like a high, flat surface, while a rock sitting on top of the snow would look like a deep hole in the high surface. Light reflecting from a stream at the bottom of a valley would appear to be a high elevation, perhaps even higher than the snow on the peak of the mountains. Dull rocks and dark vegetation would appear to be lower than the water of the stream. In other words, objects are not as tall or short, high or low, as their reflectance of light might indicate. There is no correlation between\nreflectance and altitude.\nThe purpose of the isometric display was to make it easier to follow patterns of changes in shades of gray within an image. Particularly, the light pattern changes in reflection of light from soils and vegetation near a fault line were of interest. Following patterns of soil types and vegetation types was also of interest. But in no case was there ever any indication on the isometric display of how high or low, how tall or short something was.”.Schumacher, el ingeniero que programó el VP-8.\n¿ENTIENDE?\n\n","date":"January 31, 2012 at 8:26 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7809","author":"co","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"Seems to me someone thinks computer programs are written on tablets of stone. Have you never heard of a gain control?\n gain control \n\n","date":"January 31, 2012 at 9:09 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7813","author":"sciencebod","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"CO, he doesn’t want to understand because he’s not interested. Notice he keeps supplying irrelevant answers. I think his sole purpose here is to agitate and drive traffic to his site because it’s nowhere near as popular as Dan’s site. \nIf he’s truly interested let him put his money where his mouth is and make a copy of the shroud with all the same properties and submit it for analysis. He’ll probably need a blood donation as well since he’ll need to include real blood to make a copy. Think of the fame and fortune that will follow now that a real scientist has solved the shroud mystery! \nAs icing on the cake he can find the shroud’s contemporary from the 14th century as well and mock all the other mickey mouse scientists and art historians in the process for not picking up on it sooner. It will all be quite the dream come true!\nBut until all this comes to pass it’s probably best not to countenance his posts.\n\n","date":"January 31, 2012 at 9:38 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7814","author":"Chris","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"CO, he doesn’t want to understand because he’s not interested.\nThat’s not quite right. He’s actually extremely interested in not understanding. Between sciencebod, Bad Archeology, and the reader Dan mentioned who denied there was any image at all, I’m reminded of that story about Galileo’s scientific contemporaries who refused to look in the telescope, or did look and claimed to have seen nothing but smudges. When someone wants badly enough to not know something, their will can overcome their very senses.\nIf he’s truly interested let him put his money where his mouth is and make a copy of the shroud with all the same properties and submit it for analysis.\nActually, to make it relevant to what he’s claiming, he needs to create an image (photograph or painting) that creates a realistic 3D shape of a human face and body when the brightness of the image is translated into elevation, but without doing it on purpose.\n\n","date":"February 1, 2012 at 1:19 am","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7821","author":"The Deuce","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"The popularity or otherwise of a site depends as much on the comments as the posts (no disrespect to Dan for whom I have the highest regard as a site manager). But you and some others – that dreaded species known as the ‘squatting site regular’- seem to be trying your level best to drive away this relativel newcomer to the site, which is hardly calculated to enamour you with Dan. At least he recognizes that someone with a lifetime of scientific research and teaching experience has something to offer – which you for your part seem unable to appreciate. I shall resist the temptation to speculate on reasons why, having better things to do.\nI shall now withdraw for at least another week. and patiently await reaction here to my ‘sandpit theory’ as to how the Shroud was created, word of which will have to find its way here haphazardly via the blogospheric bush telegraph, seeing as how links to external sites are denounced uncharitably as attempts to “draw custom away”.\n\n","date":"February 1, 2012 at 3:11 am","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7826","author":"sciencebod","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"Sciencebod, regarding your comment #2 I would like to suggest you read this paper (*). I think Dan should have added it to his list in this post. In this work, important errors on datation of ancient Egypt linens using C14 are described. In all cases, the protocols were followed but datations yielded notorious errors. Something similar might well have happened with the Shroud and the 1988 C14  test.\n(*)H.E. Gove a, S.J. Mattingly b, A.R. David ‘, L.A. Garza-Valdes.A problematic source of organic contamination of linen.Nuclear Instruments and Methods in Physics Research B 123 (1997) 504-507\nThis journal belongs to the JCR, has got an impact factor of 1.042 ans is ranked in position 31st out of 61 in the field of INSTRUMENTS &INSTRUMENTATIONS\n\n","date":"February 1, 2012 at 4:54 am","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7829","author":"Gabriel","site":"shroudstory"},{"title":"Badder Still: Bad Archaeology at Bad Archaeology","post":"I shall not be responding to any more comments on this site for a while (see my previous comment).\n\n","date":"February 1, 2012 at 5:04 am","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","id":"comment-7830","author":"sciencebod","site":"shroudstory"}]
