[{"title":"Which Came First, the Gospels or the Shroud?","post":"I would hesitate to say that the Bible must be consistent with the Shroud because if something goes wrong those who base their faith on the relic may find themselves lost and become atheists overnight. The reaction could be something like what was described by me in a comment about fundamentalists around a month ago: They seem to say “Everything is true or nothing is true”, kind of believing that the Bible was dropped from heaven in King James English. The instant they find they are wrong the sense of frustration is so strong that they become not only atheists but also anti-Christian, as though saying that Marx was right about religion after all. The more famous of these are former fundamentalist pastors. An example? Price, author of the book “Jesus is dead”.\nThere is an interesting document entitled “The Biblical Commission’s Instruction on the Historical Truth of the Gospels”, Woodstock College Theological Studies, 1964, by Father Joseph A. Fitzmyer, SJ who needs no introduction given that he is known as the “scholar’s scholar” in the US. He co-authored the “Jerome Biblical Commentary” together with Fathers Raymond Brown and Roland Murphy, was a member of the Pontifical Biblical Commission, finished his doctorate under William F. Albright (Johns Hopkins), taught Aramaic and Hebrew at Chicago Univ., Biblical Studies at Oxford, worked with Qumran excavator Father Roland de Vaux while sorting out the Dead Sea Scrolls in 1956, was awarded a gold medal by the British Academy….    \nFitzmyer has said that Jesus of Nazareth walked the roads of Palestine, he only became Christ after the Resurrection. The centrality of the event for Christian faith need hardly be mentioned, but to hook that on to what is seen on the Shroud would not seem advisable.\n\n","date":"June 16, 2013 at 9:53 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37150","author":"Louis","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"Further to the above, Pope Francis I has announced that he will be issuing what he called a ‘strong document’, the encyclical on faith begun by Benedict XVI and finished by him. Most of the writing was done by Benedict. The Bavarian pontiff has always been known as a scholar who spent his whole lifetime working on theology based on biblical studies and as someone who speaks his mind. In the view of Peter Seewald, former editor of ‘Der Spiegel’, his countryman is a ‘spiritual master who can give answers’. Seewald gave up being a communist and atheist and returned to Catholicism after interviewing Benedict, putting forth forthright questions and after being told by the pontiff not to show the questions in advance.\n\n","date":"June 16, 2013 at 11:56 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37153","author":"Louis","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"Stephen mistakenly confines Shroud authenticity to Biblical Inerrancy. Or was it only a wording mistake. Getting things upside down by mistake may come from living down under. :) :) :)\n\n","date":"June 16, 2013 at 1:19 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37157","author":"Fr. M.","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"I’ve seen Anglophonophobia recently on this site. Now I’ve seen Antipodeanophobia. Certainly, Pope Francis from Buenos Aires seems to be doing his best to turn the Vatican upside-down, which may be no bad thing. But it would be too much to hope that he will reform our Southern liturgical calendar out of sync with the natural seasons. We are currently in the midst of winter; some families here will soon celebrate with a Winter Solstice meal; most prefer a ham or salmon salad at Christmas, or an outdoor barbie. Lent and Easter are real problems, There’s an irony in the text “Rejoice as men rejoice at harvest time” when you’re in the middle of Lent, and celebrating New Life as winter approaches. A Festival of Light in mid-summer is something else! \nStill, the future of Christianity no longer lies with a Moslem Europe, while the Northern Americans seem preoccupied with materialism. The future of the Church is in Africa, South America and South-East Asia. \nMr Jones getting matters upside down has less to do with his geographical location, and more I think to do with his evangelical biblical literalism, in which he’s not alone. Did I mention that Ian Wilson is now resident in Queensland?\n\n","date":"June 16, 2013 at 4:25 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37164","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"I would say they are independent sources of confirmation to each other\n\n","date":"June 16, 2013 at 4:20 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37162","author":"jesterof","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"sufficient but not necessary\n\n","date":"June 16, 2013 at 4:24 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37163","author":"jesterof","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"\nBut nowhere on the shroud is there clear evidence that his legs were NOT broken. There is no evidence that his legs were broken, either. But from that it doesn’t therefore follow . . . .\n\nif the fracture of the long bone is not an open fracture then it is impossible to see the fracture at all, especially if there is no dislocation. Since the tissue swelling and hematomas around the fracture appear in couple of hours and thee legs of the crucified men were usually broken prior to their death mostly – there would not be enough time for the swelling to develop. If the fracture is not open hematmas are confined to the soft tissue ( muscles, fat, skin) surrounding the long bone and is not going to leave marks on anything, if the skin is not broken\nQuestion for those familiar with the Roman method of crucifixion – breaking the legs was customary, but was it done in a manner to achieve any end-point to actually verify they were broken?\n\n","date":"June 16, 2013 at 4:45 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37166","author":"jesterof","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"I’m not sure that breaking of the legs was in fact quite so customary, unless there was some reason to hssten death. Indeed if a sedile was used, the victim might survive even for one or two days, or if the victim was tied to the cross instead of being nailed. However on p.84 in his “Doctor at Calvary” Pierre Barbet mentions the crucifragium as a Roman custom in passing. He cites Seneca, Ammienis Marcellinus, Origen and Plautus who all refer to it. It was a certain way of bringing about death. The reason being a natural instinct was for the victim to relieve oncoming asphyxia by using his legs to relieve the arm tension, and this resulted in a kind of see-saw motion, as the victim attempted to maintain breathing. In order for the crucifragium to be effective therefore, it would seem fairly likely that the femur was broken, as breaking the tibia would probably require a much greater leverage, being more resistant, and would probably result in only breaking the fibula first. The victim would then be no longer able to breathe and would quickly expire. The reason why it was carried out on the two thieves was that the Jews asked Pilate for it so that the bodies would not remain on their crosses during the sabbath which that year also happened to be Pesach [John 19:31]. \nBarbet also comments on the reasons for the more rapid death of Jesus as being the various pre-crucifixion trauma including scourging, buffeting, his Agony in Gethsemane etc. \nThe piercing with a lance was carried out as a legal requirement to ensure death had occurred whenever relatives asked for the body. \nAs a physician interested in these matters, Jesterof really needs to study Barbet’s text closely if he has not already done so, as he may be able to comment usefully upon it.\nAnother useful briefer reference is a paper “Crucifixion in Antiquity, the Anthropological Evidence”, By Joe Zias found at:\nhttp://www.joezias.com/CrucifixionAntiquity.html .  There is some variation from Barbet in the Zias’ reference, specifically the actual “cause of death” from crucifixion. However evidence from the remains of actual crucifixions is sparse.\n\n","date":"June 16, 2013 at 7:29 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37177","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"One must add that Zias is a good archaeologist and anthropologist  — and judged the Shroud to be a “bad forgery”.\n\n","date":"June 16, 2013 at 7:35 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37178","author":"Louis","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"Thank you, Daveb of wellington nz,\nthat description and reasoning was exactly what I was referring to – braking the legs was speeding the death by ceasing the movements which helped inspiration.\nHowever, my question was about proof of this fractures – you can break the bone and it won’t be visible from outside, unless it is an open fracture ( which means the broken bone is sticking out through the skin) – because in the original article there is a statement about “missing proof” on the Shroud either for breaking the legs or to the contrary – for not breaking them.\nTherefore my remark – if breaking was done, HOW was it proved, since the broken bones, if they do not stick out through the skin, are not visible to the naked eye.\n\n","date":"June 16, 2013 at 8:20 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37180","author":"jesterof","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"I think the proof to the soldiery would be the snap of the break or the sudden release of the required leverage on completing the break, the victim would be unable to continue his see-saw movement, and death would soon ensue, which was the sole objective. In any execution squad there would always be a few soldiers already familiar with the process, and they would be seeking a complete break as a partial break might be ineffective. If a complete fracture resulted in out-of-line displacement of the bone ends, then conceivably the thigh would contract because of normal muscle tension, possibly even exposing the bone. As far as the Shroud image is concerned, I think we can only say that there is no APPARENT or EVIDENT sign of leg breakage. Jones’ assertion is possibly based on there being no such sign as thigh contraction, bone displacement or bone exposure. Although I expect that partial breaks may be fairly common in normal clinical experience such as accident cases, one has to allow for the ruthless efficiency of experienced Roman soldiery, when given such a task.\n\n","date":"June 16, 2013 at 10:42 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37186","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"Dan’s question in the title seems elementary, presuming the Shroud is the burial cloth of Jesus.  Since the earliest letter is most likely from St. Paul in about 49AD (1 Thessalonians) and Jesus was crucified about 29-33AD, I would say it’s quite obvious the Shroud came first.  Of course the gospel message is not contingent upon the Shroud, rather the Shroud is a supplement and perhaps evidence for the events themselves which are borne witness by many eye witnesses.\nAs to Stephen’s first posting as revealed by Dan here, the evidence on the Shroud would be consistent with the information in the New Testament if the Shroud were to be considered authentic.  I am unaware of any inconsistency between the eye-witness accounts and the information on the Shroud.  This kind of statement does not necessarily imply any biblical literalism not does it endanger Christian belief is the Shroud were to be proven a hoax.\n\n","date":"June 16, 2013 at 10:46 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37187","author":"Andy Weiss","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"This discussion is grisly. But it does drive home just how cold-blooded and brutal the Romans were — Pax Romana indeed.\n\n","date":"June 16, 2013 at 10:51 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37188","author":"David Goulet","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"Pax Romana is a fair description of the time. Under Octavian, Caesar Augustus, there was an unprecedented peace, stability and prosperity throughout the Empire, and this continued under Tiberius. Likewise under Herod the Great and Herod Antipas the Jews also enjoyed greater peace and prosperity than hitherto. Despite the Matthean Gospel infancy narrtive, Antipas was a benevolent monarch, often intervening with Rome on their behalf and sympathetic to their religious sensibilities, despite the decadence we read about. He had purloined much of his own silver to stave off a famine, and had recommended against an image of Caesar being set up in the Temple. But the Jews didn’t like him, simply because he was Idumean (Edomite), yet they would have fared far worse under the Jewish Hasmoneans. The Herods, particularly Herod the Great, had the most remarkable political and diplomatic skill, and survived the several pre-Augustan turmoils. Jesus describes Antipas as “That fox” i.e. cunning, for a good reason. It is unreasonable to judge the violence and ruthlessness of the military by modern Western standards. They only sought to be effective!\n\n","date":"June 17, 2013 at 12:31 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37189","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"Thanks for the history lesson Dave. I was certainly not judging the Romans by today’s standards – we have soldiers capable of equal brutality (Abu Ghraib). I was observing more the juxtaposition of Pax Romana with that offered by Pax Christus.\n\n","date":"June 17, 2013 at 7:19 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37204","author":"David Goulet","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"Jones’ problem is that when you say the Turin Shroud ***must be*** consistent with the Bible you strip it of all scientific and objective historical legitimacy. Jones should fix this to say it is nice to know it is consistent, which it is.\n\n","date":"June 17, 2013 at 5:27 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37197","author":"Deacon Ray","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"BTW, I for one like John Dominic Crossan. He is an ex-priest, still a Catholic and retired professor of biblical studies at DePaul, a Catholic university.He is also the founder of the Jesus Seminar.\n\n","date":"June 17, 2013 at 5:33 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37198","author":"Deacon Ray","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"It is difficult to see how an ex-priest like Crossan who believes that Jesus’ dead body was eaten by wild dogs can be a Catholic.\n\n","date":"June 17, 2013 at 10:27 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37209","author":"Louis","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"The true fact is it works both ways: the Turin Shroud supports the 4 Gospels as narratives + the Book of Revelation visions in terms of the Pareidolia, Apophenia and Hierogany triad while the Bible (OT) is cryptoliterally AND cryptosymbolically consistent with the TS.\nE.g. in Leveticus 9: 2 “He (G.od) said to AHARON, « Take thee a BULL CALF (Heb. ha-egel;) for A SIN OFFERING » ” and, in Jeremiah 34: 18-19: “ « And I will give the men that have transgressed my COVENANT, which have not performed the words of the COVENANT that they had made before me, when they CUT THE BULL CALF IN TWO, and passed between the parts thereof » ”. \nNow the animal’s scientific name TAURINUS is Latin for “like a bull” > modern TURIN < ancient Castra/Julia Augusta TAURINOrum, TORINO and the TS man’s body appears to be CUT IN TWO lengthwise. Besides, mimetically speaking, the four geometrical series of blackened-rimmed burn-holes can be respectively read as the letters Aleph א, Reish (a Greek Gamma Γ mirrored top to bottom), Vav I (a simple upstroke ) and Second Temple period square Hebrew final Nun (an 'L' mirrored right to left) to ‘hieroganically’ spell the Hebrew word ARON, “ARK (of [the new] COVENANT)”.\n\n","date":"June 17, 2013 at 2:34 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37222","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"Typo: Reish (a Greek Gamma Γ mirrored right to left)\n\n","date":"June 17, 2013 at 2:44 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37223","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"Dominic Crossan Catholic?…..maybe his own brand of Catholicism……\n\n","date":"June 17, 2013 at 7:37 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37242","author":"rick","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"He left the priesthood to get married. He taught Biblical criticism, NT and church history for 25 years at the largest Catholic univeristy in America. His many books can be found in the bookstores of every Catholic college.It all comes down to how much the Christ of Faith is the Jesus of History for you. Crossan is probably about 25%, I’m 75% which is about right for most Catholics.Jones is probably about 95%, thinks he is 100%. I like Crossan without agreeing with him. Crossan makes me think. I like Jones, too, in the same way.\n\n","date":"June 18, 2013 at 7:09 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37295","author":"Deacon Ray","site":"shroudstory"},{"title":"Which Came First, the Gospels or the Shroud?","post":"well just because he teaches at a catholic university and sells some books there does not mean his opinions are consistant with the magisterium of the church…a great example of this is what the american\nbishops did to jean paul when he had an “open dialogue” with them….\nto me fatima pretty much confirms the magisterium of the catholic church…\n\n","date":"June 24, 2013 at 5:19 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","id":"comment-37982","author":"rick","site":"shroudstory"}]
