[{"title":"Why you should not trust what you read in blogs","post":"Screwtape the Father of Lies is at it again.  He’s a professional.  He works under camouflage.  The tactic is to tell a HALF-TRUTH.  The gulllible imagine they recognise the true part, it rings a bell, and then they imagine that the rest, the lie part, is additional information, and then Screwtape has succeeded in his purpose of getting his victims to believe a lie – so much more successful than merely telling overt lies which can too easily be discovered.  And that, my friends, is today’s lesson in Diabolism 101.\n\n","date":"July 29, 2012 at 5:59 am","url":"https://shroudstory.com/2012/07/29/why-you-should-not-trust-what-you-read-in-blogs/","cat":"other_blogs","id":"comment-14292","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Why you should not trust what you read in blogs","post":"I suppose if you cannot trust anything in a blog, you might want to consider closing down and doing something different.\nWhat interests me most about this is to know the background of the one(s) who wrote it.  But let me think about what is written and what it might indicate.\nClaiming it is a 33 year-old man gives away the traditional belief that Jesus was about 33 when crucified.  If that is the writer’s belief, then most likely this is a Christian or one who accepts this idea.\nSince the Vatican has never made the claim, obviously this is not written by a Catholic, or at least not a Catholic who knows anything about the Catholic Church.  It could be a misunderstanding what what the Church has said.\nI am unsure the weave of the cloth proves or indicates anything of the sort.  Unless I am mistaken, herringbone weave was not used exclusively in the first century AD.\nThe signs of blood does offer proof that this man was crucified.  This is a certainty of which Yannick has shown to be irrefutable.  \nI really like the final question.  If this isn’t the burial cloth of Christ, what happened to it?  I think there is much wisdom in this question for if Jesus was the Messiah, then wouldn’t the burial cloth be kept with reverence and not just discarded?\nDue to this little evaluation of the questions and what could be behind them, with all due respect for him as a person, I would have to disagree with daveb’s assessment of the snippet.\n\n","date":"July 29, 2012 at 10:47 am","url":"https://shroudstory.com/2012/07/29/why-you-should-not-trust-what-you-read-in-blogs/","cat":"other_blogs","id":"comment-14296","author":"Andy Weiss","site":"shroudstory"},{"title":"Why you should not trust what you read in blogs","post":"I agree with Daveb’s assessment…the father of lies is a “master” of his craft… the art of deception.\nI had first become aware of the shroud about 40 years ago when I read about a doctor who had done partcular experiments and tests,and explained the nail hole markings on the wrist and the absense of the thumb marks.So much more information is available now which would have been impossible to gather back then.\nBut I must admit that I was not seeking to strengthen or confirm my faith or convictions because they were already pretty deep at the time.It has been sorely tested since,but like a spike,the harder it was hit,the deeper it went.\nThe shroud of Turin,I am totally convinced,is real.It has survived all of these years by the will and providence of God for future generations…it is the next best thing for those who would not be present when he said”Blessed are those who have not seen…yet still believe”.\nI wrote several months ago on this site explaining how I came to believe so strongly in Christ.I was on what I considered at the time my deathbed…I literally thought I ws going to die and was so sapped of strength that it should not have been surprising if I did.But instead,as I lay there crying out for a second chance or go at it (life)my heart first instantly vibrated and I was immediately drawn into a half sitting up position as a light not unlike that of St. Paul’s experience radiated and blasted upon me.It lasted for the time it took me to say “My God it’s true…your really there…you really care…it’s really true”It went out and I fell back onto my bed and pillow as the door opened.\nTherefore I have absolutely no difficulty visualizing what happened in the tomb 3 days after his death…what I experienced was a spark…but for the image of Christ to have been left on both sides of the shroud as it had been,I can see a light brighter than the sun and whiter than lightening bursting and radiating from within His body and outwards.Unlike Paul on his way to Damascus or myself on my deathbed…when the light flahed upon and around us.(I had not known of St. Paul or his experience prior to my own)\nTo date I feel I have not done enough to “witness” to my faith over the years…I’ve lived it yes,and suffered to keep it in tact yes,but I’ve never been in a position where I could actually share on a regular basis that awesome miracle ,on that awesome day.I do believe though,that up to this time I have been made even more ready to do so.Therefore I would ask my brothers and sisters in the Christ to keep me in their prayers,so that His purpose be more fully realized in my life …before that great day of accountability when He will ask me “Where are the others” ? GOD BLESS.\n\n","date":"July 29, 2012 at 12:14 pm","url":"https://shroudstory.com/2012/07/29/why-you-should-not-trust-what-you-read-in-blogs/","cat":"other_blogs","id":"comment-14298","author":"John K. M.","site":"shroudstory"}]
