[{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"Yannick’s paper’s paper was, and remains, a master piece,\n\n","date":"May 10, 2015 at 5:22 am","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198758","author":"John Klotz","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"Yannick, we’ve discussed about Rogers’ legacy back in 2012, It was clear that no definite answer had been given concerning chemical reactants at stake,Thibault said he was working on it.\nI guess the problem is complex when you’re dealing with a biological coating and he still doesn’t have a serious track, no more no less than our latecomer in the chemical field, CB, who thought he had it all figured out but is totally off the track.\n\n","date":"May 10, 2015 at 6:04 am","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198762","author":"anoxie","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"Any paper which begins with an unequivocal statement of incontrovertible facts that are actually nothing of the kind (“Firstly, to avoid any possible confusion, we must clearly state that it is a proven and confirmed fact that the blood on the Shroud is real human blood. Scientifically, there’s absolutely no room for doubting this conclusion”) invariably rouses suspicion in the mind of the more objective reader. Suffice it to say that in spite of the word ‘fact’ occurring fifty or so times (to say nothing of eleven “!!!”, three “???” and a “?!?”), almost nothing of Yannick’s paper is undisputed by quite sensible people, who, as usual, far from forgetting, neglecting and denying the evidence, are the ones who consider it most deeply on its merits. Colin has nothing to worry about from this quarter.\n\n","date":"May 10, 2015 at 7:57 am","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198771","author":"Hugh Farey","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"Meanwhile, life goes on in the world of empirical, experimental research.  The new model accommodates the blood-under-body image conclusion from the Adler/Heller protease test quite neatly. How?\nPaint the subject with imprinting medium, then apply blood while the medium is still moist, then imprint. Blood attaches to linen ahead of the overlying medium, so ends up underneath. But how long does one have in which to carefully apply the blood in all the biblically-correct locations? If somebody had asked me that a half hour ago, I’d have said 15 -20 minutes. Oops,  not so, at least with simple flour/water imprinting medium. Paint it onto one’s fingers, and it’s well on the way to becoming bone dry (and thus useless for imprinting) within 5 minutes. \nThere’s nothing like an experiment to destroy one’s preconceptions. Body temperature with accelerated evaporation of water are presumably the explanation. Of course, a cold corpse or even effigy could have been used as subject, in which case the evaporation would have been slower, but it’s nicer to think that a willing volunteer (live) had been used.\nSo while flour/water is OK in principle as an imprinting medium if all one wants is a body image, it’s not suitable if intending to add the bloodstains as well carefully and precisely over, let’s say, a 15 to 30 minute time scale at least. \nConclusion: something else needs to be added to the flour/water to prevent it drying out too quickly, to keep it moist and transferable to linen. \nRefinement of the model continues, with no deadline to meet.\n\n","date":"May 10, 2015 at 12:26 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198781","author":"Colin Berry","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"Perhaps your refinement could include an example of the technique you are refining was actually used in medieval times.\n\n","date":"May 10, 2015 at 12:32 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198782","author":"John Klotz","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"If the TS was to succeed, it had to be a one-off, with the technology (probably alchemy) kept a closely guarded secret. That makes it virtually impossible to prove conclusively that the TS-specific technology now proposed was used in medieval times (but then that’s true of non-TS technology too, given that science rarely works by proof, but of an accumulating weight of evidence).\nHowever, there is documentary evidence that a key step in the image-making process – chemical development with nitric acid ( HNO3) – WAS available in order to convert a near-invisible flour imprint to a sepia-coloured image, one with the appearance of a photographic negative, as per TS.\n The three common mineral acids that one finds in all chemical laboratories – hydrochloric, sulphuric and nitric – were all known in the 13th/14th century, thanks to the activities of alchemists in search of the philosopher’s stone, universal solvents, means of transmuting base metals to gold etc etc. \nAgain, demonstrable proof is difficult, if not impossible, because modern day chemists shy away from the medieval alchemical literature, it being abstruse and coded, indeed “gibberish” (after the celebrated alchemists Geber or Pseudo-Geber who knew nothing about elements v mixtures v compounds, or of atoms and molecules).\n\n","date":"May 10, 2015 at 1:12 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198786","author":"Colin Berry","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"If I am correct, you now admit can never offer any proof that your current hypothesis (one of several) that you are now working on could never be proven becasue it was an “one-off” procedure and a hidden secret never to be revealed. \nSeriously? What a waste of time your efforts have been. Who do you seek to convince that your hypothesis has any historical reality?\nIt looks to me you are simply trying to justify your skepticism.\n\n","date":"May 10, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198790","author":"John Klotz","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"As I say, don’t ask for proof. In science, it’s the weight of evidence (from experimentation) that matters, and the quality of the ideas that prompted that experimentation.\n\n","date":"May 10, 2015 at 3:33 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198795","author":"Colin Berry","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"Yesterday I told Colin to consider Dr. Paolo Di Lazzaro’s inteview because all characteristics would have to be taken into account. He had said that he was “quietly confident” that he would be successful, but I have my doubts.\nAs for the post above, it puts forward some rubbish:\n “We also have to assume that this forger took the dead body out of the shroud before it started to corrupt in such a way that this extraction did not disturb the bloodstains, never broke the linen fibrils under them and did not disturb the body image.”\nIt does not seem that people reading what is posted here are fools.\nThen we are led to to the Rogers mantra, where:\n” to produce a Shroud-like image with the use of biological products that could have been released inside the Shroud shortly after death by a highly-traumatized human corpse”\nFirst it was the Maillard effect, now it is “biological products”.\nI have said it before and say it again: Flogging was a legal preliminary to every Roman crucifixion and thousands of Jews were crucified like Jesus. Assuming that the relic is authentic, why should it only have happened to his body?\n\n","date":"May 10, 2015 at 12:58 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198785","author":"Louis","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"Louis: why should it only have happened to his body?\nYes many people can’t comprehend that fact. One and only image. There is no any other image like that. \nWhy forger did not make at least two or three of that image. He may not have enough chemicals to do that or it is not an man made image?\n\n","date":"May 10, 2015 at 4:33 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198798","author":"Sampath Fernando","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"Sampath,\nKaisa hai, hamara dost? – I think you will understand.\nRogers was a good scientist, however he has almost been deified, the result being a cult-like devotion to his views. It leads to a world of make believe, with irrational conclusions.\nIt is nice to see that you at least understood. You may remember that I mentioned the Maillard hypothesis in question no. 11:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\nNow we must ask what were the “biological products”.\nBest.\n\n","date":"May 10, 2015 at 5:23 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198802","author":"Louis","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"Alchemy was succeeded by Chemistry, just as Spiritualism was succeeded by Parapsychology.\n\n","date":"May 10, 2015 at 2:17 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-198791","author":"Louis","site":"shroudstory"},{"title":"Yannick Clément on Colin Berry’s Latest Hypothesis","post":"Louis, if an artist from the Middle Ages produced the Shroud image on linen, according to Colin’s Nitric Acid fumigation method, then he/she would had to have used Cypress Vitriol, Salt Peter and Alum, since Nitric Acid (Glauber’s Salt) was not  in existence in the 1500s (Glauber was born 1604 AD)\nA brief history follows:\nAqua Regina (Royal Water) discovered by a Persian, Jabir ibn Hayyan (born in Persia c. 721).  He distilled  Cyprus vitriol, a pound and a half of Saltpetre, and a quarter of a pound of alum.  He was the first to write about the synthesis of Nitric Acid.\nInteresting that Hayyan states, if this mixture is reacted with sal ammoniac, it will dissolve gold, silver and sulphur.”\nDutch Chemist, Johann Rudolf Glauber (1604-1670) distilled sulfuric acid and salt peter to make Nitric Acid and he called it “Glaubers Salt.”\nVitriol is one of or a combination of three chemicals: copper, iron or zinc sulfate …  http://nitricacidlc.weebly.com/history.html\nYet, the fact Vitriol contains iron would certainly have produced a sepia or reddish color on linen.\nInteresting Vitriol is used for etching as well.  \nCheck out Rembrandt’s self-portrait, 1620 AD.   :)\nEtching\nThe Intaglio Printing Process\nhttp://www.csun.edu/~lmp99402/Chemistry_Art/Etching/Etching.html\nBest,\n\n","date":"May 17, 2015 at 2:34 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","id":"comment-199361","author":"Angel","site":"shroudstory"}]
