[{"title":"Penn & Teller’s Hateful Bullshit","post":"Really disgusting. Nothing else to say.\n\n","date":"July 27, 2014 at 11:14 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140698","author":"Chesterbelloc","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"Penn and Teller fancy themselves disciples of James Randi. Pity they inherited none of his class. I used to like these guys. Not so much now.\n\n","date":"July 27, 2014 at 11:29 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140699","author":"David Goulet","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"Dan’s Title says it all.\n\n","date":"July 27, 2014 at 11:53 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140705","author":"Mike M","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"Her approach is amusing and reveals that there are many doubts that have to be cleared, we cannot be hasty in reaching conclusions. There are things that cannot be “seen”, they are just “felt”.\nFreud himself did a lot of rethinking towards the end of his life, but by then he was a victim of the Jewish holocaust, which made him bitter about the Bible,and he resigned himself to his fate. He had taken a certain direction and that was it. As Frankl said, he confined himself to the basement.\nYet, he did write about the occult, “If I were at the beginning rather than at the end of a scientific career I might possibly choose this field of research in spite of all difficulties.”\nHe knew that his work would be judged to be unscientific if he were to take a different direction. The dilemma haunted him throughout his life. As Ernest Jones wrote regarding his position, “An exquisite oscillation between scepticism and credulity so striking that it is possible to question just as many pieces of evidence in support of his doubt concerning occult beliefs as of his adherence to them”.\nhttps://www.academia.edu/5565370/Historians_put_Freud_on_the_couch\nIt seems that, deep inside, he did suspect that Jung could be correct.\nNow, this is no justification to dabble in occult, séances, voodoo and the rest. Not even Jung would say this. It is only to say that plagued with doubts as we are, not even the authenticity of the TS will take them away.\n\n","date":"July 27, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140741","author":"Louis","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"It’s a shame that ignorance rules in matters of faith.  It is even more shameful that in the pursuit of Truth, even more ignorance abounds.\n\n","date":"July 27, 2014 at 5:33 pm","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140750","author":"clublu22014","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"After reading the blog page, I can relate to writer. Through my experience at University, Christianity itself has become a dummy stamp by many professors and grad students… and the TS- eye rolling, Big Foot-ish. These opinions influences young adults. It’s “hip” and “progressive” to be an atheist today. Penn and Teller are grabbing at a hot ticket since they’ve passed their peak. A popular marketing strategy in Hollywood.\nBut, regardless of opinion, the TS deserves equal research.\n\n","date":"July 27, 2014 at 10:49 pm","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140793","author":"jenx","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"Speaking from the Antipodes, it seems that the face of Christianity in USA is essentially fundamentalist evangelical literalism.  This can never satisfy anyone with any intellectual aspirations, and it’s no surprise that University people throw out both baby and bathwater.  The new green fields are in Asia and Africa, but they have to contend with radical Islam, and established indigenous religions (e.g. Hinduism in India, ingrained animistic superstitions elsewhere).  It was never going to be easy, and He never promised us a rose-garden, except maybe the thorns!  The evangelical wing of Christianity has a lot to answer for!\n\n","date":"July 28, 2014 at 1:13 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140812","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"Dave I basically agree with your view. But the problem moderate Catholics like you and I face is that  just as a literal view of Christianity is fair game….so is a moderate view. For the atheist our views are almost as silly as the fundamentalist’s.\nNot that we should care.\nIn my view Borg is close to the truth – the Bible is a mix of “history remembered” and “history metaphorised”.\n\n","date":"July 28, 2014 at 3:46 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140835","author":"Thomas","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"Marcus Borg – A Fellow of the Jesus Seminar, way too liberal and way too reductionist.  You’re better to try NT Wright, heavy going, but at least he’s orthodox.\n\n","date":"July 28, 2014 at 6:00 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140854","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"I’ve got an excellent book “the meaning of Jesus” which is a great dialogue between these great theologians. Borg is much more towards the moderate end of the Jesus Seminar spectrum, nowhere near as extreme as Spong or Crossan.\nI think he is excellent value although he is sometimes too reductionist as you say.\nNT Wright is quite brilliant.\n\n","date":"July 28, 2014 at 6:15 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140858","author":"Thomas","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"N.T. Wright is good, but can be biased, Marcus Borg is indeed moderate, Spong cannot be considered a Christian in the correct sense of the term and Crossan is said to “have faith”.\nOthers have taken different approaches. See:\n  https://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nFather Fitzmyer has been said to be “liberal”, however that is not true. He is extremely careful when assessing the evidence when it comes to the NT.\n\n","date":"July 28, 2014 at 8:42 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-140885","author":"Louis","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"Does anyone know the opinions of Wright, Fitzmyer, Crossan, Borg, on the Shroud?\n\n","date":"July 29, 2014 at 10:16 pm","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-141154","author":"clublu22014","site":"shroudstory"},{"title":"Penn & Teller’s Hateful Bullshit","post":"Funny how “debunkers” of the Shroud take the 1% (questionable radio carbon dating from 1988) as fact and leave out the other 99% of scientific testing that shows the Shroud is authentic. Where is the logic in that? Guess it didn’t make interesting enough T.V.\n\n","date":"August 8, 2014 at 4:32 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","id":"comment-142941","author":"Linda","site":"shroudstory"}]
