[{"title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall","post":"I get a strong impression that it was John Jackson who provided the initial impetus and leadership that eventually led to the development of the STURP team.  Jackson had first been made aware of the Shroud at age 14, and later while studying for his masters in physics had proposed to his puzzled faculty advisor that his thesis be based on the Shroud.  He was intrigued by the alleged 3-D properties which had first been mentioned by Paul Vignon. The contacts with Eric Jumper and Bill Mottern then naturally followed with the discovery of the remarkable properties yielded by the VP8 analyser.  The results of Frei’s pollen sampling were also coming to light at this time. It would be natural to expect that the two discoveries, the VP8 images and the pollens, linked with the earlier pioneer forensic studies, might have had a profound effect on the attitude of Jackson and his early cohorts on how they might then perceive the authenticity of the Shroud. \nHowever the final STURP team expanded to some 30+ scientists of various backgrounds and specialties.  Not all of them were particularly religious.  The interest the topic generated in most of them seems to have come from the enigmatic properties of the object of their study, and its largely unknown aspects, rather than from any particular religious viewpoint. A few were known to be agnostic, there were dissenters, but for the most part they seemed to have pursued their investigations in as professional a manner as could be achieved under the constraints they had to work within. The initial attitude of many seems to have been downright skepticism, and it was only through the application of their various scientific inputs, that they came to a greater respect towards the object of their enquiry. \nThe one bad apple in the whole bunch seems to have been the close-minded Walter McCrone, who seems to have betrayed the trust placed in him, as the main recipient of the blood-stained tapes.\nIt is perhaps also unfortunate that the STURP team lacked some desirable expertise in a knowledge of textiles, and in artistic iconography. However, it did its job as well as it could under the circumstances, and its conclusions can hardly be said to be tainted by any kind of religious bias.\n\n","date":"November 27, 2013 at 4:53 am","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","id":"comment-52906","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall","post":"Agreed. I believe the majority of the team (whether they were religious or not) expected to find evidence fairly quickly that the Shroud was not authentic. The fact that they did not find conclusive evidence is telling. And I’ll bet all of them, at some point in the ensuing years, thought “I wish we’d thought to check for (insert preferred test here).” \nI found it interesting in Barry’s EWTN interview that he mentioned the Tilma of Guadalupe and how, based on the existing evidence, he thinks further testing would “disappoint” people. He’s implying of course that from what he’s seen it is fairly clear the Tilma is man-made (but no less a holy icon). He knows what to look for. If he’s still convinced the Shroud is authentic then that carries some weight with me.\n\n","date":"November 27, 2013 at 3:37 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","id":"comment-52968","author":"David Goulet","site":"shroudstory"},{"title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall","post":"Don’t forget that Jackson and Jumper’s access to scientists was based on who was readily available to them at Los Alamos and Sandia labs, along with other government facilities like the Air Force Weapons Lab, Air Force Academy and the Jet Propulsion Lab. Consequently, textile experts and iconographers were just not part of the mix.  My own involvement came about because I worked as a photographic consultant on a project for Los Alamos with Don Devan (imaging scientist), who ultimately brought me onto the STURP team based on our working together for 7 months. In the end, I am sure every STURP member would agree that experts in those disciplines would have been very useful. Unfortunately, it just didn’t happen that way. \nRay Rogers told me personally how disappointed (and angry) he was in McCrone, who betrayed Rogers’ trust with his actions. I personally believe McCrone had his own agenda, based on conversations I had with him before his death. Maybe I’ll include the details of those conversations in the book I hope to write someday.  Happy Thanksgiving!\n\n","date":"November 27, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","id":"comment-52985","author":"Barrie Schwortz","site":"shroudstory"},{"title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall","post":"Hello, Barrie, sorry that I post here, but I am interested in obtaining those STURP papers listed here: http://www.shroud.com/78papers.htm\nIs there any fromal procedure, required, some reference or credentials needed?\n\n","date":"November 27, 2013 at 6:30 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","id":"comment-52988","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall","post":"Quote: “The fact that they did not find conclusive evidence is telling.”\nTHIS IS SO TRUE, ESPECIALLY FOR THE BLOODSTAINS…  This fact alone is enough to understand the genuineness of the Shroud as a real burial who enveloped for a short time the dead and crucified body of a man who looked like Jesus of the Gospel.\nQuote : “I found it interesting in Barry’s EWTN interview that he mentioned the Tilma of Guadalupe and how, based on the existing evidence, he thinks further testing would “disappoint” people.”\nI was very surprise myself to hear Barrie said those words and I talked with him about that, thinking like you do David, that this was a statement that was meaning the Tilma was not authentic (on the contrary to what I was thinking up until now).  Here’s what Barrie wrote to me about that (I don’t think he’ll be mad,if I post this here): “It is simply that I am only interested in one relic (which I have studied for more than 35 years) and it keeps me busy 12 hours a day, seven days a week! I will leave the study of the Tilma to others and be happy to read their conclusions.”\nIt’s interesting to note that this personal answer of Barrie to me was somewhat different (at least at first sight) versus what he said in the EWTN program.  Effectively, it was easy for anyone who heard him talk about the Tilma in this program to extrapolate his words as meaning the there were strong evidences to support the conclusion that this relic was false, but when I read his personal answer, I understood that it was probably not what Barrie meant in the EWTN program…\n\n","date":"November 27, 2013 at 4:44 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","id":"comment-52975","author":"Anonymous","site":"shroudstory"},{"title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall","post":"Judging the Tilma’s authenticity on what little I know about it would be very similar to many Shroud skeptics who dismiss the Shroud based on their own limited knowledge! Frankly, there has been very little scientific testing done on the Tilma so there is no database of verified information that one can access as there is with the Shroud.  We still don’t know for sure what material the Tilma is made of!  However, as there is with the Shroud, much misinformation floods the internet about it that perpetuates a Tilma “mythology.” Some of that mythological “evidence” will not withstand scientific scrutiny. Of course, I could not go into that kind of detail in the EWTN interview. The Jerusalem meeting I attended this past July (see http://www.shroud.com/latebrak.htm#3rd3) was my first exposure to any information about the Tilma, so I am truly not qualified to have any opinion. As I said to Anonymous, “I will leave the study of the Tilma to others and be happy to read their conclusions.”\n\n","date":"November 27, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","id":"comment-52989","author":"Barrie Schwortz","site":"shroudstory"},{"title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall","post":"Thanks for clarifying, Barrie.\n\n","date":"November 27, 2013 at 10:04 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","id":"comment-53006","author":"David Goulet","site":"shroudstory"},{"title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall","post":"\nO.K. :\nHello, Barrie, sorry that I post here, but I am interested in obtaining those STURP papers listed here: http://www.shroud.com/78papers.htm\nIs there any fromal procedure, required, some reference or credentials needed?\n\nHi O.K. – Send me an e-mail for details.\n\n","date":"November 27, 2013 at 6:54 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","id":"comment-52990","author":"Barrie Schwortz","site":"shroudstory"},{"title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall","post":"I have sent the message.\n\n","date":"November 27, 2013 at 7:10 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","id":"comment-52993","author":"O.K.","site":"shroudstory"}]
