[{"title":"Beg Your Pardon (Comment Promoted)","post":"What was the purpose of the  Lirey/Turin body-imprinted envelope then ?\n\n","date":"July 13, 2015 at 5:05 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205468","author":"ekmcmahon","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Answer: a bigger-and-better pilgrim-attracting rival to the Veil of Veronica, both promoted no doubt as images captured as a result of direct contact-imprinting between cloth and skin.\n\n","date":"July 13, 2015 at 5:19 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205471","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"” I have never accepted the idea that the shroud image was formed by radiation.”. \nPlease don’t take it personally, Dan. I never said you did, knowing you are not in the least bit persuaded by any proposed image-forming mechanisms to date (you said so a short while ago, leaving this blogger bitterly disappointed).\n But what about the Accettas (A not J), the Antonaccis, the Carpinteris, the Di Lazzaros, the Jacksons etc (sorry if I’ve left anyone off)…? Radiation mechanisms can hardly be said to be confined to a lunatic fringe.,..\n\n","date":"July 13, 2015 at 5:14 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205469","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Thought experiment:  “Show me a miracle,” the 14th century alchemist prayed. There was a flash of light and an image appeared on the cloth. “What good is that. No one will believe it. If you could turn it into real gold thread, that they would believe.”\n\n","date":"July 13, 2015 at 5:16 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205470","author":"Paulette","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"I’m sorry that the thread prompting Colin’s promoted comment above has been broken as I have no wish to go to the trouble of repeating myself in response to it.  \nIn the original posting, Colin had asserted that, based on the synoptic gospels, the fine linen brought by Joseph of Arimathaea was not the same as the burial cloth used to wrap the body, but in fact was merely used for transport.  I believe I successfully refuted that, Colin seemed to have no answer to it, and all he could do in reply was to make the comment posted above, essentially reverting to his argument that the Shroud was the result of a medieval thought experiment. and accusing me of a pro-authenticity argument.  That is not the case as he very well should know, as my comments were specifically directed at his faulty interpretation of the synoptic accounts.  \nI had made no comment whatsoever concerning miraculous flashes of radiation, a scenario I do not subscribe to, and it is egregious of him to include it in his argument. \nIt is reasonable to claim that the image of a corpse on a cloth of fine linen may very well have been a burial shroud of a kind, and his pleading that this is no more than a pro-authenticity argument, is in fact no more than an anti-authenticity argument.  Touche! \nHis continuing insistence that authenticists ought to see it as no more than being used for transport, when there is no scriptural evidence that any cloth, let alone one of fine linen, was ever used as such, itself begs the question, a complaint he makes of others.  \nEssentially the synoptics say that Joseph brought a Shroud, took the body down, wrapped it in fine linen, and laid it in the tomb, no mention of using it for transport at all. \nNow if he wants to concentrate on a medieval thought experiment, he should talk about that, and not introduce faulty extraneous material diverting discussion away from the subject.  \nThere are adequate reasons to call the cloth a burial Shroud, as that what it seems to be, many who have examined it in detail were so convinced, and have offered their evidence in support of their contention.  However there is no record whatsoever of anyone having come up with any kind of medieval thought experiment to create it, nor of repeating his endeavours, nor do we yet know how he might have gone about it, nor can we guess who it might have been.  It is purely a speculative induction based on a reluctance to acknowledge that it might in fact actually be Christ’s burial cloth.  \nBut I congratulate Colin for his industry in venturing into his experimental approach.  Either one way or another, we might learn from his efforts how the image was formed or not, as the case may prove to be.\n\n","date":"July 13, 2015 at 5:41 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205472","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"No, I did not try to respond point by point, for the simple reason that I no longer understand your points daveb. Here’s just onme example, culled from your current comment:\n“Essentially the synoptics say that Joseph brought a Shroud, took the body down, wrapped it in fine linen, and laid it in the tomb, no mention of using it for transport at all.”\nIf one takes a body down from a cross, wraps it in linen so as to shield from public gaze, and then takes the wrapped corpse to a nearby garden with rock tomb, then what is that if not “transport”?\n Maybe you are unhappy with the idea that good quality linen might be strong enough to act as a makeshift stretcher. Maybe you envisage some other means of transferring an enveloped corpse from cross to tomb that does not place stress on the linen. But it’s still TRANSPORT. The use of an up-and-over length of linen allows for discreet and dignified transport of a crucified man, bloodied, probably naked. That surely has to be seen as the primary role of Joseph of Arimathea’s linen which the synoptic gospels make clear was taken first to the CROSS ,not the tomb. It’s then asking rather a lot that transport linen that becomes soiled with blood and other body fluid should then serve a dual role as final burial shroud. The account of John does indeed suggest strongly that Nicodemus provided a customized replacement that was designed for “winding” in accordance with Jewish burial custom. As I said earlier, the Pray Codex actually shows what appears to be both types of linen in the same picture, so it’s not as if I am pushing a novel or fanciful line,. I’m simply noting that Joseph’s linen served an immediate role for TRANSPORT, and was not intended as the final burial shroud, that being presumably narrow and bandage-like if wound repeatedly around the limbs and torso of a corpse to sequester and incorporate spices etc at all main points of the body, with a separate “napkin” for the face which is NOT a feature of the Turin so-called Shroud.\nPS: I’m at a time of life when I accept there are those whose interpretation of the written word can differ radically from my own. It’s not just semantics: it’s about underlying agendas.  I no longer try to seek common ground when it’s clear there is no common ground.  So don’t be surprised if this is my last comment addressed to you daveb.\n\n","date":"July 13, 2015 at 6:16 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205475","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"I think that Colin has thought further into the actual functions of the various cloths associated with the burial of Jesus than either the Gospel writers or most medieval artists ever bothered with. Transporting a dead body from cloth to tomb, even if the tomb was so extraordinarily close to the execution site as the Church of the Holy Sepulchre would have us believe, must surely have involved some kind of covering, if just to protect the carriers from the blood and grime, and such a cloth may or may not have been used as a shroud, or just left in the tomb with the shroud. I don’t think the painters who showed a cloth being used to lower the body from the cross, or to carry it to the tomb, gave any thought to whether it was the same one as ended up covering the body. Whenever the burial cloths are shown in medieval iconography there are nearly always two, one big and one small, as suggested by the Gospel.\nIf the Turin Shroud is a medieval fabrication, it is relevant to ask ourselves if it was meant to be a ‘realistic’ representation of what the holy women found on Easter morning, or an image ‘miraculously’ appearing on a cloth. If miraculous, then it should be brightly (if ‘cunningly’) painted to show the power as well as the majesty of the miracle-worker, but if quasi-realistic it should be fainter and look as if it might be made out of sweat and blood. It is also relevant to ask ourselves how the Shroud was meant to be displayed. If it were to form either a reredos above an altar (as in the recent ostentations), or an altar frontal, then its long thin shape could be explained that way, without consideration of whether it was ‘meant’ to be thought of as either a transport cloth or the burial shroud itself.\nIt is not until the 18th century, I think, that some kind of rationalisation of the various different (all genuine) shrouds was needed, whereupon the Turin Shroud was usually thought of as the transport cloth and the Besançon one was the actual body-covering. Even today, sudariumchristi.com goes to elaborate lengths to incorporate as many cloths as possible.\nI do not know how precise the word ‘shroud’ needs to be. I think even Colin accepts that the cloth is meant to represent a cloth wrapped around a dead body, and I think that any such cloth can legitimately be referred to as a shroud even if it was only used for transport.\n\n","date":"July 13, 2015 at 6:44 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205477","author":"Hugh Farey","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"“I think that Colin has thought further into the actual functions of the various cloths associated with the burial of Jesus than either the Gospel writers or most medieval artists ever bothered with.”\nThere’s a third category, Hugh, which you’ve omitted to mention: someone who was envious of mid-14th century Rome’s premier relic (icon?) namely the Veil of Veronica, and who sought a niche within the biblical story into which a similar concept of body-imprinting could be accommodated. One was found: the time interval between Joseph of Arimathea arriving at the cross with his linen, and when the newly- enveloped body then arriving at the tomb for removal and discarding of the ‘transport’ linen, to be replaced by Nicodemus’s winding strips.\nDuring that transport interval, our medieval entrepreneur could imagine as his ‘model’ an imprinting of a whole body, back and front, onto the up-and-over length of linen, essentially reproducing post mortem the imaging process that medieval folk seemed willing to have occurred on a smaller scale to produce the Veil of Veronica. \nSorry, the term “shroud” is now associated entirely with funeral garments. I’ve never heard of the modern ‘body bag’ as being described as a shroud, even if quickly replaced by one when a cadaver is turned over to a funeral director by a hospital mortuary.\nMay we expect BSTS Newsletter No.81 soon?\n\n","date":"July 13, 2015 at 7:10 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205480","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Hugh raises an important point that you refer to as ‘a niche in the biblical story’. The problem with this niche is that the artisan appears to be the only one who was aware of it. He failed to do a very strong marketing campaign as the concept of ‘full body Veronica’ did not enter the medieval culture. Did he attempt to promote the icon as the ‘full body Veronica’ only to be disappointed to have it interpreted as the actual burial linen?\nI can understand you mining this niche as it explains why a medieval artisan would make an image of a dead Jesus (rather than a more potent fake relic of a Jesus in the process of being resurrected which would have really played to medieval sensibilities). And certainly if you found the niche, it’s possible a medieval person may have too. If this was the case it would appear he was too clever for his own good though. We have the Shroud not because of Shroudies, but because that is what people instantly recognized the icon for – the burial linens.\nHe really could have used the services of Don Draper.\n\n","date":"July 13, 2015 at 8:26 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205487","author":"David Goulet","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"“The problem with this niche is that the artisan appears to be the only one who was aware of it. He failed to do a very strong marketing campaign as the concept of ‘full body Veronica’ did not enter the medieval culture. Did he attempt to promote the icon as the ‘full body Veronica’ only to be disappointed to have it interpreted as the actual burial linen?”\nYes David, but there’s a crucial difference. The Veronica was seen as a proto-photograph of Jesus while still alive, albeit scourged, weighed down with cross etc. It did not have the same funereal qualities as one “taken” with the same tactile image-capturing process AFTER death. Let’s not forget either that artists felt free to enhance the Veronica image – the vast majority possibly all being  attractive ‘positives’ – because it was considered that a miraculous process had allowed even the initial imprinting. Not so with the TS – the image there is uncompromisingly a negative, and not one that artists felt should be enhanced, perhaps because of its stark, unenhanced post mortem nature.\nAs for how the TS was marketed, surely the d’Arcis memorandum makes clear that the ‘new’ relic caught on immediately. The fact that it beget its own commemorative medal, possible two (thinking of the Machy mould) must count for something. Which reminds me (Machy mould) – that inset face of Jesus above the word SUAIRE was surely a marketing ploy – inviting the pilgrim to make a connection with the Veronica, to see the image as a whole body IMPRINT, albeit more sombre, more ghostly, more haunting.\nA face, even in extremis, is always more viewer friendly than a whole body take, especially one that needs strategically-placed hands etc… The link with the Veronica is more about technical precedent – tactile imprinting – than artistic genre.\n\n","date":"July 13, 2015 at 10:10 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205498","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"The fifteenth/ sixteenth century sources  always refer to the Shroud as the cloth in which Jesus was taken down from the Cross.e.g. De Sanguine Christi(1464), Antonio De Beatis (1517). This let them off the hook with the gospel sources, and remember too the description of the burial cloths of Lazarus, that talk of wrappings.\nIf the Shroud was originally created for the Quem Queritis ceremony, it would have been one of many such and so not particularly miraculous as a creation.In these ceremonies, the images simply symbolised the tomb where the body had lain before the Resurrection. For a large congregation, in the early morning light of an Easter dawn,  the most important thing would have been visual impact and this may explain why the images are larger than life size and why the blood is described ‘as if it were recent’ (one of the reasons why Herbert Thurston did not believe that the Shroud was authentic) .\n\n","date":"July 13, 2015 at 9:17 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205494","author":"Charles Freeman","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"If you are correct in your ‘always refer’ then you would seem to substantiate Colin’s premise. After the icon is unveiled as a full body Veronica the subsequent sources all refer to it as the removal linen. You two should compare notes more often.\n\n","date":"July 13, 2015 at 10:41 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205505","author":"David Goulet","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"The Image of Edessa. the Veil of Veronica and the face of Christ on the Turin Shroud, and thousands of other representations of Christ, all draw on an image of Christ that the authority on Roman art Paul Zanker traces back to AD 300 Rome (see his The Mask of Socrates).\nI have never supported Colin’s thesis that the Shroud of Turin was a deliberate attempt to cash in on the Veronica- it would have been presented as a representation of Christ while he was alive, not dead,  if it had been.\nA full body Veronica would not make any sense as the legend always said that ti was just the face that was wiped and left an impression.\nThe Lirey pilgrims do not appear to be the elite- unlike somewhere like Mantua where popes and emperors came to venerate the blood of Christ. They seem typical of the masses of dislocated peasantry who are said to have flocked backwards and forwards to new shrines in the unsettled years after the Black Death.\n\n","date":"July 13, 2015 at 1:43 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205515","author":"Charles Freeman","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"The capture of a living man’s image as the entirely legendary Veil of Veronica lacked any biblical authority. That did not prevent the exercise of artistic licence – and highly successful it was too in pilgrim-pulling power, sale of indulgences etc. Neil MacGregor, until recently Director of the BM, described it as the “central icon” of the 14th century Roman Church.\nThe genius of the TS instigator, probably also a 14th century entrepreneur, was to spot a pretext for a second bigger-and-better imprinting of the entire body, one that DID have a credible basis in scripture (after a fashion) – namely imprinting of the post-mortem body onto Joseph of Arimathea’s linen while en route from cross to tomb.(Don’t tell a sindonologist I told you so – blood imprinting needed to be from a completely stationary corpse for correct stereo-register with body image)\nThe affinity with the Veronica need only have been hinted at, and not overplayed. All that needed to be said to sceptics was that the founder of Christianity’s body was capable of leaving permaent imprints on linen, partly natural, maybe partly supernatural.\n\n","date":"July 13, 2015 at 2:26 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205520","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Colin isn’t saying the Shroud is the full body Veronica – that’s my way of describing his more far reaching theory which is that the icon is meant to portray the linen used to carry Jesus to the tomb after his death — that the image formation mechanism would be understood to be sweat as with the Veronica -not the Veronica itself.\nHis claim is that this is a unique image created by a artisan looking to create a relic that fills the niche between the Veronica (Jesus still alive) and the linens post Easter. He’s basically saying that the Shroud was not meant to be a shroud at all, but an imprint (like the Veronica) of the deceased Jesus prior to entombment.\nYou said the sources of the 15th and 16th century refer to the Shroud as the linen Jesus is taken from the cross with — which is Colin’s theory re: the Shroud. Thus there is a dovetailing that fits his theory, that after the Shroud debuts, people begin to connect the Shroud with the linen — which I will henceforth refer to as The Nicodemus linen, as per Colin’s theory.\nI just want to clarify all this as I apparently misrepresented what Colin was proposing vis a vie the Veronica.\n\n","date":"July 13, 2015 at 2:10 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205518","author":"David Goulet","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Thanks David – couldn’t have put it better myself  ;-)\n\n","date":"July 13, 2015 at 2:31 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205521","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Mr. Berry: please tell us. How do you suppose the Medieval forger had the presence of mind to secure pollen from plants that only grow in and around Jerusalem?\n\n","date":"July 13, 2015 at 7:44 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205482","author":"leon ward","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Have you been following Hugh Farey’s series of comments on pollen? There are some odd discrepancies – like some TS pollen coming from plants that rely on insects instead of wind for dispersion. Why should nectar and/or pollen-seeking interests be attracted to the Shroud of Turin?\nMax Frei’s record keeping also left much to be desired.\nPollen-analysis for me is a no-go area unless or until it is out-sourced to forensics laboratories – but only those willing to work on a double-blind basis. They wouldn’t know which were TS samples or non-TS controls. Neither would the commissioning body know which tabulated data referred to TS or non-TS groups until statistically significant differences (if any) were established..Only then would the coding be revealed – under video surveillance.\n\n","date":"July 13, 2015 at 8:09 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205484","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Also the professional palynologist Marzia Boi’s recent scathing attack on Frei’s methods: ‘It was research that was full of inaccurate ideas and preconceptions which, instead of checking and confirming if the relic was original, has even led to speculation today on whether there was actually any presence at all of these pollen types on the Shroud’.\n\n","date":"July 13, 2015 at 9:20 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205495","author":"Charles Freeman","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Yes; I’m sorry, Leon, but I fear Max Frei’s attempts to characterise the pollen he found on the Shroud as Middle Eastern have not withstood scrutiny. It is unfortunate that he died before fully disclosing his findings, and perhaps indicative of his unreliability that they have not been published by those who inherited them. No subsequent investigations attempting to verify them, especially those of more experienced and qualified palynologists or botanists, are still defended even by the investigators themselves.\n\n","date":"July 13, 2015 at 3:46 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205528","author":"Hugh Farey","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Hugh, Frei’s list was published in Ian Wilson’s book “The Shroud:The 2000-year-old mystery solved” and was given to him by Father Heinrich Pfeiffer.\nWhat we need now is to compare this list with what remains of the Swiss criminologist’s collection in the US and the pollen grains found during the restoration.\n\n","date":"July 13, 2015 at 4:09 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205532","author":"Louis","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"I respectfully disagree.\n\n","date":"July 13, 2015 at 8:09 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205485","author":"Dcn Andy","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Am I the only one to think that a better title for this sourpuss posting woud have been “Beg Your Pardon (Comment Demoted)”?\nSince when has it been the role of bloggers, regardless of age or standing, to make an Aunt Sally out of bona fide comments ?\nYou are getting seriously tedious Dan Porter with your repeated cold douches. If it’s about my return to your site, saying again and again that I’ve had a bellyful, it’s because you made a posting of my comments on a third party site. Once again your tribe has chosen to post its comments here, instead of the site in question.\nYour site is basically a black hole for Shroud related comment, sucking in others’ content, giving nothing back to the blogosphere in return.\n\n","date":"July 13, 2015 at 11:19 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205506","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"If we are to consider the Shroud as an ingenious medieval creation, then we should also consider the historical context, which may explain its creation (but also does not dismiss the notion that the Shroud was authentic and “brought out of the cupboard”).\nThat is, France was a shambles in the mid 14th century.\nIt was poor, heavily diseased, and defeated.\nDisplay of the Shroud might have served 2 purposes – lifting spirits, and earning money. It’s display may well have been cynically opportunistic, too ie. the masses are suffering big time, they need hope, what better hope than seeing Christ’s real burial shroud (with image and blood wounds to boot), and by the way we’ll get a few coins from every visitor.\nThen, if it was a mid 14th century creation, within that historical context would its faint image “make sense”? As Hugh states, a stronger image would have given more hope in a hellish time. Yet, a faint image with wounds could allow the masses to better empathise with Christ’s sufferings.Remember the Black Death had been rampant killing millions in France alone.Also, note the German art of the time showed Christ heavily wounded, so there was historic parallel.       \nAs Colin says, the Shroud could be seen competitively in this way ” OK you’ve got the veil, but he we’ve got the full burial shroud, with both frontal and dorsal images of Christs, AND with blood wounds”\nBut as I say above, there’s nothing to dispel the idea that an authentic Shroud was opportunistically taken out of the cupboard.\nThe Jury is out.\n\n","date":"July 13, 2015 at 5:36 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205540","author":"Thomas","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"The main challenge to the theory are the bloodstains which are claimed to have prevented body image. If the blood did come first (some here maintain this has to be truly proven yet) then the likelihood of it being a fake is extremely remote. \nThe next challenge would be the image formation mechanism itself. No one has been able to duplicate that process – at least not to the point where the majority of objective viewers would agree ‘okay that’s very likely how it was done’. Colin, and others, have come up with several formation methods of varying degrees of complexity that indeed give us a close approximation of the Shroud, using materials available to a medieval artist. These experimental images would have been sufficient to ‘fool’ a medieval audience which did not have any type of expertise to discern otherwise (nor did they have direct access to the relic for study). \nThis then is problematic for the theory as one would expect the medieval artist himself to have employed one of these methods. Had he, we would be able to duplicate the method rather easily today. And yet here we are discussing Maillard reactions, scorches, paint, lemon juice, flour, etc. Even if the materials were easily accessible in the period, the technology employed would appear to have been known to only a handful of conspirators who took that knowledge to their graves.\nAnother challenge, and this applies to most contact theories that rely on an actual human model, is the hair. Exposed skin makes for a nice contact surface but hair not so much. And even if accomplished, did no pilgrim ever wonder – “how does hair leave an image in a sweat imprint without a little divine help”? And if the divine can be easily brought into the explanation, why did the forger go to such length on the image formation mechanism?\nThere are some other challenges that Daveb has outlined as well.\nAll grist for the mill. Whether one agrees with Colin’s Shake n Bake theory – he’s come up with a rationale motivation and plot line for the forger. Kudos to him for that because here isn’t much wiggle room left to find fresh theories related to the icon.\n\n","date":"July 14, 2015 at 9:29 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205651","author":"David Goulet","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Balanced, as always, David G.\nThe incredible difficulty that skeptics and non skeptics alike have today in explaining a “fake it and flog it” theory really does seem problematic. Not necessarily fatal, but close to.\nI still maintain there are a lot of other difficulties too. I maintain the lack of loin cloth is still an issue if this was an artistic creation. Yes I know I know there is the odd nude Christ in the 1300s / 1400s. But it’s pretty rare statistically. And as far as I can recall where it does occur it’s in pretty discrete artistic circumstances (as opposed to a possible creation with full and frequent public viewing in mind) \nTo what extent, too, would a medieval faker go to the sort of ultra realistic lengths we see on the Shroud? No loin cloth? Blood trickles / smudges OFF the soles of the feet? Side wound that is neither a tidy little slit or an incredibly runny stream down the abdomen (these were the two artistic conventions of the time) Trickles of blood across the lower back that have absolutely no historic artistic precedent…\nIt’s the cumulative difficulty of all these different factors, amongst others, that means the medieval faker theory seems to me problematic\n\n","date":"July 14, 2015 at 11:09 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205662","author":"Thomas","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Interestingly, Lirey is not far from Picardy, where Robert de Clari hailed from. Speculation, I know, but the promoters of the Lirey exhibition may have tied the Shroud back to de Clari’s account from Constantinople.\n\n","date":"July 13, 2015 at 5:50 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205542","author":"Thomas","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"The gospel accounts of the burial are plain enough and mutually consistent.  Mark’s is the basic original narrative, and the other evangelists have built on it either adding material known to them, or else omitting material by way of refinement.  The basic events are that Joseph took him down, wrapped him in the linen cloth, and placed him in the tomb. \nIndividual additions are:  ‘laid in a tomb hewn out of the rock’; ‘rolled a stone against the entrance’; ‘no-one had yet been buried there’;  ‘it was Joseph’s tomb and he had hewn it’; ‘Nicodemus brought myrrh and aloes’;  ‘bound the body with burial cloths along with the spices’; ‘there was a garden and the tomb was close by’.  \nConcerning transport, Barbet notes that the Shroud image blood-stains indicate a minimum of handling, that the tomb was close by, and the body would have been completely stiff in a state of rigor mortis.  He creates the scenario whereby the nail is removed from the feet, the cross-piece is lifted off the upright, two men carry the cross-piece, two men support the mid-section using something like a twisted sheet, and one man supports the feet.  \nHe notes that this explains the dorsal blood-stain at the waist, and that there is a small smudge mark on the foot.  Very likely the head-wrap placed during crucifixion still covered the face, and is only removed during the laying out.  Under this scenario, no cloth is required to protect the carriers from gore, and the lack of smudging even suggests that not even a modesty cloth was used.  \nIt would not be possible to place the body in a transport stretcher without removing the nails from the hands and the cross-piece, breaking the rigor at the shoulders, and then forcing the arms down to the sides.  As the tomb was close by, there was no need for this.  Even transporting the body on a stretcher a very short distance would have resulted in smudging;  there is none.  We can forget the stretcher scenario.   \nSeveral forensic pathologists who have examined either the Shroud or its photographs or both, have been convinced that the image was that of a real corpse, not merely a picture of one, that the man was a victim of scourging and crucifixion, and they have given their various forensic analyses.  Various explanations have been offered for the colour of the blood-stains. \nWhatever the shortcomings of Max Frei’s work, he had been trained in botany, was a noted criminologist , head of the Zurich Police Scientific Laboratory 1948-72, had analysed several important crimes and accidents including the air crash of UN Secretary-General Dag Hammarskjold, and even in retirement was still consulted by the police forces of many nations.  His work on Shroud pollens has been supplemented by Israeli botanists Danin and Baruch and also by palynologist Thomas Litt.  \nHugh Farey to my knowledge has not been trained in palynology,  His objection to the identification of insect-borne pollens is irrelevant.  The gospels make the point of a garden at the burial site, it was spring and the flowers would have been in full bloom.  Whether the pollens arrived on the cloth by insects or by mourners placing flowers there, is beside the point.  Palynology is a difficult science and there are ambiguities, but there remains sufficient indication of a Middle East provenance. \nThe image shows travertine arogonite limestone, consistent with Jerusalem limestone, not only on the soles of the feet (road-dust) but also on the nose and the knee.  The arch-fraudulists might have us believe that their model coated with flour paste or whatever else, suffered a fall on his way to the artist’s studio, and accumulated this debris from the caves of Troyes.  \nWe know that Geoffrey I de Charnay was a virtuous knight of distinction, a devout Christian, and unlikely to be party to any kind of fraud.   Further there is sufficient evidence that the Byzantine imperial relic collection boasted of having a tradition of image imprinted burial cloths of the Saviour, and gave them various names, and that following the Frankish Crusader spoliation of Constantinople in 1204, they were never seen there again. \nThere is absolutely no record of any medieval artisan creating the Shroud image, his imagined success remains inexplicable, and he only ever did it once, not even leaving a relic of his attempts to do so.  As an Easter liturgical prop for the faithful, the Shroud lacks the artistry expected of such a rubric.  As evidence of an historic crucified Christ, it is compelling.\n\n","date":"July 13, 2015 at 7:28 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205545","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"“There is absolutely no record of any medieval artisan creating the Shroud image, his imagined success remains inexplicable, and he only ever did it once, not even leaving a relic of his attempts to do so”.\nHow ,much more of this do we have to endure from daveb?\nThere IS a written historical document, as he knows full well, one which semi-professional apologists for TS authenticity like our daveB try to dismiss and/or debunk. It’s called the d’Arcis memorandum (1389). It sets out the belief of a Troyes bishop, shared by his predecessor Henri de Poitiers, that the Shroud was a ‘cunningly painted’ fake, a “sleight of hand”. So to suggest there is no historical record of the Shroud being a fake, given the existence of that memorandum, written in medieval Latin, shows an utter contempt for the facts. Daveb went down hugely in this blogger’s estimation when he began pushing that line, citing a certain legalistic hatchet job as further evidence, which I read and quickly discounted, given its clearly agenda-driven lack of objectivity.\nHow can he claim with a straight face that the “imagined success” of the Lirey shroud “remains inexplicable” when one reads the d’Arcis account of what was being claimed, namely that it  was the genuine burial shroud of Jesus,  and that there were hired mercenaries  among the pilgrims declaring that the Shroud had cured them of their maladies?\nIt should be self-evident that the success of the venture depended on maintaining absolute secrecy, only partly breached by d’Arcis, in that he omitted to name the artisan or describe the precise means of producing the image, except to say it was no ordinary “painting”. Had it been just any bog-standard painting, as tediously maintained by Charles Freeman in the face of a mountain of contrary evidence,  there would have been no commemorative medallion, now in the Cluny Museum. (Nobody would go to the trouble and expense of  producing a  medallion – the Lirey Pilgrim’s badge – merely to celebrate a painting, least of all one with the double imprint of a naked man – in passing, NO liturgical loin cloth, NO liturgical crown of thorns –  and shown dramatically as semi-3D bas relief).\nNobody would leave duplicate versions of his handiwork either, given that would have totally defeated the aim of the venture, namely to produce a credible one-off relic, one that trumped all other other relics.\nI shall now take another long holiday from this vexatious site (and its vexatious blow-hot-and-cold owner). I shall be on the look out for new forums on which to share my thinking re the medieval origins of the Lirey/Turin body-imprinted envelope. i.e. as an intended magnet for the faithful, rivalling or eclipsing the then fabled Veil of Veronica. Shame that thread on  Fort Wayne’s News-Sentinel site did not attract more comments. Kevin Kilbane – who penned the article – reckons (in his email to me yesterday) that it’s due to discussions occurring off-site on FB and other social media. He’s probably correct.\nThank you DavidG for your support. It was greatly appreciated.\n\n","date":"July 14, 2015 at 1:24 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205586","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Dr Berry may consider the “D’Arcis memorandum” as evidence, despite its author being unable or unwilling to cite a single tangible fact supporting his allegations.  His predecessor Bishop Henri de Poitiers is on record as being a great admirer of Geoffrey I de Charney, and the only indication that he had any objection to the Lirey ostentations is the hearsay report of Bishop D’Arcis, whose cathedral was in such a state of disrepair that it collapsed.  His intentions concerning the Lirey cloth are manifest in the bailli’s unsuccessful warrant for its confiscation, obviously penned by D’Arcis.  As for “clearly agenda-driven lack of objectivity”, that is plain enough in the intentions of Ulysse de Chevalier and Herbert Thurston, in their significant omissions from the D’Arcis source documents that they transcribed.  \nWe know well enough that the likeness was not “cunningly painted” as alleged by D’Arcis, and this elusive alleged artist remains utterly unknown, despite his being such a clever fellow that he has fooled centuries of investigators. \nI regret that Dr Berry feels that our differences in perceptions concerning the significance of the D’Arcis memorandum seem to have disrupted what I could never have called a cordial relationship,  But I do not see this as a problem within my ability to resolve.  However I hope that it remains within my power to represent a point of view on this blog-site in the face of outrageous claims made by those seeking to discredit this sacred object.\n\n","date":"July 14, 2015 at 3:14 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205607","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"You continue to miss the point entirely. It matters not whether those bishops would or would not have been able to substantiate their charge of forgery in a court of law. We are discussing history, not legalities. All that matters is that they made a charge of forgery in what is now a crucial historical source. Prior to the Lirey displays, they were totally unaware of the existence of the TS with its double imprint. Nor is there evidence for that distinctive and eye-catching double-imprint in the earlier artistic record.  Why not? Answer: because the TS appeared as if from nowhere, with no accompanying explanation as to its recent history or origins, arousing entirely rational suspicions of forgery, and quite rightly so. The d’Arcis memorandum is precisely what one would have expected from a bishop seeing hundreds or thousands of pilgrims converging on a tiny humble timber-constructed church of recent foundation, not under his jurisdiction, having been founded with ‘collegiate’ status only (now there’s a surprise).There are no serious grounds whatsoever to doubt the historical validity of the d’Arcis memorandum in principle, lacking though it may be in precise detail. \nContrast that with the failure of pro-authenticists to produce a single written document  making reference to the Lirey Shroud prior to 1350, and the absurd and near total reliance on minute and inconsistent ink-drawn features scattered among different sketches in a Hungarian Codex, with no corroboration WHATSOEVER from the accompanying WRITTEN text. What’s that if not a  desperate and pitiful scraping-of-the-art world-barrel tactic designed to fend off the claim that there’s not a single shred of documentary evidence on which to base a claim for the TS existing prior to 1350?\n\n","date":"July 14, 2015 at 3:56 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205612","author":"Colin Berry","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"A real pity that the bloke who created this image died centuries ago. He would have been so happy and proud of himself to surf on this blog. Well done sonny !\n\n","date":"July 14, 2015 at 3:34 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205608","author":"PHPL","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"It was virtually impossible to launch a new relic cult without papal authorisation. This was the result of the mass of fake relics that poured into or were created within Europe after the sacking of Constantinople in 1204. \nPope Innocent III tightened things up  in a decree of the Fourth Lateran Council of 1215: ‘Some people try to sell saintly relics and show them around everywhere. This belittles the Christian religion. To prevent this for the future, we declare by this decree that old relics may not be exhibited outside of a container or exposed for sale. And let no one presume publicly to venerate new ones unless they have been approved by the Roman pontiff.’ \nThis is why Clement VII made his announcement that he was not authorising the Shroud as genuine in 1390 (but did allow veneration).Of course, people took their chances but, as with the Shroud, the local bishop soon suppressed them. It is interesting that when Margaret de Charny tried to exhibit the Shroud as genuine in 1449 in Liege she was asked for the papal authorisation for what she was doing.She could only produce the papers from Clement and so was forbidden to go on exhibiting.\nAnyone would have known that if they tried to set up a new relic they would be under immediate scrutiny. And so it proved to be. The original shrine seems only to have survived a year or two before it was closed down and the Shroud hidden away.The 1390 proclamation was a typical compromise ( as those of us who live in the EU are very used to). There would have been only one -or two- genuine Shrouds and most of the others had long standing pilgrim income which they would have protected against any pronouncement of yet another ‘authentic’ Shroud.The popes knew better- allowing veneration but not disturbing the old established ‘authentic Shroud’ sites – was the sensible way. No one would have had any means of knowing which of the competing shrouds, if any of them, was genuine anyway.  On what grounds were you able to compete with the Shroud of Compiegne that had five hundred years of veneration behind it? \nWhen Antonio de Beatis saw the Shroud in 1517 at Chambery- he was told that it had been taken by a Lord of the House of Savoy from a Muslim prisoner during the First Crusade! We know better but at least the Savoys were realising that they needed some kind of back story!\n\n","date":"July 14, 2015 at 5:23 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205620","author":"Charles Freeman","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"It does seem that the House of Savoy knew about the letter Pope Innocent III sent to the “crusaders” who took part in the Fourth Crusade:\n https://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\n\n","date":"July 14, 2015 at 9:45 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205654","author":"Louis","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Louis, she says:\n“Around AD 390 a long linen cloth with the image of a man like Jesus Christ was seen near Jerusalem” \nAnyone know what the source for this claim is?\n\n","date":"July 14, 2015 at 11:13 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205665","author":"Thomas","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Thomas, I think she was referring to what is in a book by the expert Ernst Kitzinger, which I have not read. It is known that Bishop Epiphanius opposed the use of some kind of images in churches.\n\n","date":"July 14, 2015 at 12:00 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205676","author":"Louis","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"I’d like to know more about this. It’s interesting but unsubstantiated\n\n","date":"July 14, 2015 at 10:50 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205743","author":"Thomas","site":"shroudstory"},{"title":"Beg Your Pardon (Comment Promoted)","post":"Thomas, I will do some research and get back to you.\n\n","date":"July 15, 2015 at 5:36 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","id":"comment-205825","author":"Louis","site":"shroudstory"}]
