[{"title":"Best Shroud of Turin Comment of the Day and it’s on Another Blog","post":"That’s a good point, but science won’t tell why a totally unllikely naturalistic phenomenon has occured. It depends on the witness to name it.\n\n","date":"January 9, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/01/09/best-shroud-of-turin-comment-of-the-day-and-its-on-another-blog/","cat":"other_blogs","id":"comment-72766","author":"anoxie","site":"shroudstory"},{"title":"Best Shroud of Turin Comment of the Day and it’s on Another Blog","post":"“the truth claims of Christianity neither rise nor fall on the authenticity of the Shroud of Turin”.  Christianity survived for some 1,868 years before Secondo Pia revealed for the very first time the strange photographic negative properties of the Shroud image in  1898. Despite the inherent truth of the quote, I’ve often felt that the Shroud was a powerful evangelising weapon reserved for our current skeptical era. There is a record of former unbelievers who have found Christ through the specific agency of the Shroud image.  \nIncidentally, it’s not just atheists, agnostics and hard-line Protestants who reject the posssible authenticity of the Shroud. I recently discovered the New Advent site entry on the Shroud. New Advent was an enterprise during the 1990s to copy the full text of the 1913 Catholic Encyclopaedia onto the web. It seems that the 1913 Cath Encyc wouldn’t have a bar of it and rejected it outright as a medieval forgery. The ghosts of Herbert Thurston and Ulysse Chevalier still persist! Just Google ‘New Advent Shroud’ and you’ll see the entry!\n\n","date":"January 9, 2014 at 3:24 pm","url":"https://shroudstory.com/2014/01/09/best-shroud-of-turin-comment-of-the-day-and-its-on-another-blog/","cat":"other_blogs","id":"comment-72777","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Best Shroud of Turin Comment of the Day and it’s on Another Blog","post":"The 1967 Catholic Encyclopedia, though inferior to the 1913 in various ways, was more optimistic about the Shroud’s authenticity. I remember reading both editions entries on the Shroud when I was in high school, and was amazed that the usually more modernistic new encyclopedia was more favorable to the relic than the older edition. I believe that Herbert Thurston himself wrote the article for the 1913 edition.\n\n","date":"January 9, 2014 at 3:38 pm","url":"https://shroudstory.com/2014/01/09/best-shroud-of-turin-comment-of-the-day-and-its-on-another-blog/","cat":"other_blogs","id":"comment-72779","author":"Chesterbelloc","site":"shroudstory"}]
