[{"title":"Blogger: Please don’t get upset if you are Catholic","post":"One has to ask, if the writer is venting, why is venting and why he singling out catholics?  What is the point?  There has to be much more behind this than the writer has admitted.\nTo write it with a small ‘c’ means ‘universal’ as in Christian, so this would be directed at all Christians, not just Catholics with a capital ‘C’ as in Roman (Latin) or Eastern Catholic, for example.  While this might be a technical distinction, it is not without meaning.  Catholic in this sense means a Christian who is in communion with the Bishop of Rome as the earthy head of the Church Jesus invested in Peter.  So with great respect for you, my friend and brother, Dan, I would have to disagree with your application of the capital ‘C’ to yourself if you are not in communion with the the earthly head established by Christ.  You are no doubt catholic.\nAs to the dating to which he refers, this dating was proven to be falsely attributed to the Shroud itself, but only to a small repair area proven through textile expert studies by Sue Benford and her husband Joe Marino and chemically by Ray Rogers and others.  I recommend a little study by Iceangel71.\n\n","date":"September 29, 2012 at 10:36 am","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17050","author":"Andy Weiss","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"One is left bewildered by the lack of intelligence shown by anyone who could accertain from a single cloth found in a tomb and from it’s simple construction, that all burial cloths of the era must have been of the same construction??? Moreover, because this discovered burial cloth is not as complex or as fine a linen as we view in the Shroud, that the Shroud could not possibly have been used in 1st century Jerusalem???…Is it just me, or is this logic just simply RETARDED?\nI agree with Andy that Iceangel71 requires much more study on the subject.\nR\n\n","date":"September 29, 2012 at 11:57 am","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17053","author":"Ron","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Oh and I’m not upset, just bewildered ;-)\nR\n\n","date":"September 29, 2012 at 12:00 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17054","author":"Ron","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"And be aware the statement Ice Angel made concerning the sandals, \n    “[I]t’s like somebody finding a pair of shoes or sandal that date back as far as 1260AD and  1390AD, and taking long trips to see these sacred shoes and praying over them ! I have nothing but respect for all religions but this cloth thing is way too much!\nis a subliminal message referring to the date ascribed to the Shroud by Tite and others, claiming it to be a fake (1260 to 1390 AD). \nDoesn’t IceAngel comprehend the linen cloth belonged to Joseph of Arimathea, a wealthy man who purchased it for his own burial?  More than likely Joseph traveled to Egypt to obtain this particularly expensive 3:1 herringbone weave.\nJust look at an image of the Caiphas ossuary.  Notice how detailed this box is compared to others of the same time period.  \nBoth Joseph of Armathea and Caiphas were wealthy and bought what was equivalent to today’s “Designer” labels.\n\n","date":"September 29, 2012 at 1:17 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17060","author":"Angel","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"PS.  The Caiphas ossuary is the family ossuary, so Caiphas himself, more than likely, did not purchase the box, but rather his family did.\nThis ossuary has been authenticated, as well.\n\n","date":"September 29, 2012 at 2:37 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17061","author":"Angel","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Iceangel71 makes the same error as those carbon dating the Shroud.  She imagines that a single sample of a 1st C plain weave palestinian shroud necessarily represents all shrouds of the same time and place.  Granted that it is the only other sample available, there is a good reason for this in that it was the custom at the time to revisit the tombs after one year and to place the bones in an ossuary.  The only way that a proper induction can be made is for REPRESENTATIVE samples to be taken in accordance with standard scientific protocols, and to calculate the statistical significance of the results.  If one is to be scientific about it, the 95% Confidence Limits ascribed to the Carbon dating can only be ascribed to the single sample, and by no stretch of the imagination to the complete cloth.  The proper protocols in the case of the carbon dating were cavalierly set aside, consequently the said dating is worthless – even more so as it turns out the sample was very likely an invisible reweave patch, and not part of the original cloh at all. \nThere is a quaint irony in the Caiaphas family ossuary, in that Caiaphas was a Saducee who did not believe in the general resurrection of the body.  The ossuary custom arose in late Judaism because of the development of a resurrection doctrine among the Pharasaic sect from about 200 BC.  Did Caiaphas come to believe that there might be something in the doctrine after all?  There are apocryphal writings suggesting that he may have done.  Or was his family merely following the current social custom?  The ossuaries of Simon of Cyrene and his two sons have also been found.  The ossuary custom abruptly terminated in 70 AD folowing the Roman destruction of Jerusalem.\n\n","date":"September 29, 2012 at 3:44 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17062","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Daveb wrote:\n“There is a quaint irony in the Caiaphas family ossuary, in that Caiaphas was a Saducee who did not believe in the general resurrection of the body. The ossuary custom arose in late Judaism because of the development of a resurrection doctrine among the Pharasaic sect from about 200 BC. Did Caiaphas come to believe that there might be something in the doctrine after all? There are apocryphal writings suggesting that he may have done. Or was his family merely following the current social custom? The ossuaries of Simon of Cyrene and his two sons have also been found. The ossuary custom abruptly terminated in 70 AD folowing the Roman destruction of Jerusalem.”\n***I am not current on the beliefs of Caiaphas, but the ossuary is certainly an original and the etchings, as compared to other ossuaries of the time, make it appear to be a very costly item.\nI’ve not seen the Simon of Cyrene ossuary, and will check it\n out on google images.  Thanks for the information. \nHave you figured out what these strange “V” shaped markings, found in the City of David, represent?\nI had a dream with all types of Hebrew, Greek or Latin symbols, similar to those on the link.  Two symbols I can recall from the dream were an upside down V and an upside down V with a line under it, similar to the Hebrew Patach.\nhttp://www.biblicalarchaeology.org/daily/biblical-sites-places/jerusalem/what-are-these-strange-markings-found-near-jerusalem%E2%80%99s-gihon-spring/\nBest,\n\n","date":"September 29, 2012 at 8:51 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17068","author":"Angel","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"The coin found in the mouth of Miriam — as archaeologist Zvi Greenhut said, to pay the god Charon in order to be ferried accross the Styx — in the Caiaphas tomb is evidence that the Sadducees were heavily influenced by the Greeks. There is even earlier evidence that there were cults held around -+ 500 BC Jewish tombs. The AD 42-43 coin proves that at least some Sadducees believed in an after-life but not in bodily resurrection.\n\n","date":"September 29, 2012 at 4:39 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17064","author":"Louis","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Louis, the belief system of the time, concerning some Sadducees, is not surprising.  More than likely many of the Jews held such beliefs.  \nWeren’t Judaism and Christianity influenced originally by Zoroastrianism and Mithraism?  \nAnd later in time, Paulian doctrine appears to incorporate a certain amount of Gnosticism. Doesn’t Gnosticism predate Christianity?  I recall one of Paul’s statements, “I will give you a mystery.”  To my mind, this sounds as though Paul had some Gnostic beliefs, as well.\n\n","date":"September 29, 2012 at 9:25 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17070","author":"Angel","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Hullo Angel. Yes, no religion is born in a vacuum, but this raises the question: Who influenced whom? The question of Zoroastrianism and Judaism is an old story and it could have been the other way round. The Essenes had their dualism (which could be traced to Zurvan), but it was subordinate to monotheism.\nThere were bits of gnosticism before Christianity, however it was not full-blown gnosticism. Paul is very difficult to interpret because he is very subtle and he understood the Christ-event very well. It looks like a great deal of study is needed, given that there is no agreement about his letters, his point of view and so on.\n\n","date":"September 30, 2012 at 2:34 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17084","author":"Louis","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Louis, with current archaeology digs in the Middle East, additional “original” parchments may eventually be unearthed.  The Isaiah scroll, found in the Dead Sea Caves is an example, not to mention The Nag Hammadi Library.\nI would venture to guess Syria and Saudi Arabia hold many archaeological treasures, yet the turmoil in that area prevents any type of exploration.\nThe photo of Jabal al-Lawz, the real Mt. Sinai found by Ron Wyatt in Saudi Arabia, certainly looks authentic, with respect to being the mountain on which God descended to give Moses the Ten Commandments.  \nThe scorched, blackened area on the top of the mountain  appears to verify biblical history and Moses. \nRon Wyatt was arrested and held captive by the Saudis for crossing over into their land to take photos.  This story appeared on American TV.  Have you seen the images on google?\nBest,\n\n","date":"October 1, 2012 at 12:43 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17127","author":"Angel","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Thanks for the tip, Angel. I will have a look at the images you mention. Yes, there may be still a lot to find and it is important that whatever is found has provenance and context and is rightly interpreted.\nAll the best.\n\n","date":"October 1, 2012 at 11:17 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17143","author":"Louis","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"\nAngel :Louis, with current archaeology digs in the Middle East, additional “original” parchments may eventually be unearthed. The Isaiah scroll, found in the Dead Sea Caves is an example, not to mention The Nag Hammadi Library.\nI would venture to guess Syria and Saudi Arabia hold many archaeological treasures, yet the turmoil in that area prevents any type of exploration.\nThe photo of Jabal al-Lawz, the real Mt. Sinai found by Ron Wyatt in Saudi Arabia, certainly looks authentic, with respect to being the mountain on which God descended to give Moses the Ten Commandments.\nThe scorched, blackened area on the top of the mountain appears to verify biblical history and Moses.\nRon Wyatt was arrested and held captive by the Saudis for crossing over into their land to take photos. This story appeared on American TV. Have you seen the images on google?\nBest,\nAngel, you may be interested in this;\nOn Youtube, key in;  Mountain of God- Jim and Penny Caldwell Interview\nIt is an 8 part interview which follows their 8 years of explorations into Saudi Arabia and their fascinating discoveries in and around the suggested, true Mt Sinai, plus some interesting finds throughout the whole of Saudi Arabia….Pretty interesting finds to say the least.\nR\n\n","date":"October 2, 2012 at 4:39 am","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17146","author":"Ron","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Thank you, Ron. \nSounds extremely interesting and informative; yet,  I hope it’s not a video.  I’m unable to watch them on my computer.\nBest,\n\n","date":"October 2, 2012 at 7:17 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17171","author":"Angel","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Unfortunately, the interview is in video, sorry. But they have put a book out titled; ‘The God of the Mountain’ by Penny Cox Caldwell available on Amazon. Apparently it’s chock full of photos. They also have a website newly formed called; http://splitrockresearch.org if your interested.\nR\n\n","date":"October 3, 2012 at 6:49 am","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17183","author":"Ron","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Comments on origins of religious beliefs & practices:\nBelieve me, these are extremely complex.  Much of early religious beliefs which still survive originated in Iran, which were in turn influenced by Hinduism.  Whereas much or our early science originated in Iraq – the Babylonians for instance developed an extremely sophisticated numbering system with a base 60 and it included a zero place holder, and this survived well into the 13th century and was even used by early European mathematicians. \nWhen we come to Saint Paul, his home city of Tarsus was a renown centre of Stoicism, so we can expect that Paul had been exposed to some Greco-Roman philosophy.  Extract from Encyc Brit:. “Once the basis of Paul’s thought in the context of Jewish concepts of his time is understood in the light of modern scholarship, uncompromising predestinarian views of some of Calvin’s followers can be seen to be an overly rigid interpretation of Paul’s meaning. Attempts to derive Paul’s ideas from Greek or Gnostic influences have been largely abandoned. Paul stands out more clearly as a Christian Jew, whose conversion experience convinced him that Christ was the universal Lord under God, the agent and leader of God’s kingdom. Paul thus maintained that through Christ every barrier is broken down: “There is neither Jew nor Greek, there is neither slave nor free, there is neither male nor female; for you are all one in Christ Jesus” (Gal. 3:28)” \nHowever Paul had been trained as a Pharisee, and as the word indicates, this in turn had developed from the Persian Parsees,  \nThe pagan Iranian god Mithra, derives from the Hindu Mitra.  He was seen as the god of contract and agreement, was associated with the creation through the sacrifice of a bull, and this ritual survived even into the later Roman version of Mithraism.  With the development of Zorastrianism,in Persia (6th C BC), the Mithraic cult slowly went into decline, but with some residues surviving.  Zoroastrianism was essentially dualistic, and might be creditied with such development as angels, devils, ideas on the soul, and other aspects we can see in the later Wisdom literature.  The Greeks never accepted Mithraism because it was associated with their old Persian enemies.  However about 100 AD, it took some hold in Roman military circles, and became associated with emperor worship. \nThe Jewish exiles in Babylon from the 6th C BC, were exposed to much of their thought, and it influenced redactions of the scriptures.  For example Ch 1 of Genesis was written as a consequence of exposure to Babylonian science, and supplemented the anthromorphic Jawhisitic account which was relegated to chapter 2, and they also took the Babylonian flood stories and gave them a divine meaning through adding to their earlier stories of Noah. \nFrom about 200 BC, many of the released exiles settled in Alexandria, a major centre of scholarship with their massive library, whence we have the Septuagint additions.  Jews here were no doubt influenced by Egyptian funerary rites, and also by Greek Platonism,  The origins of a resurrection theology, and the concepts of the soul were likely influenced by these.    \nWhat can we make of this syncretic approach to religion?  My own personal view of such matters is that not only did man pursue God in the distant past, but God also pursues man according to his divine plan.  I am much minded of Francis Thompson’s epic poem “The Hound of Heaven” in this pursuit.  \nMuch more could be written than what I have briefly sketched above, and a good text on Man’s Religions might elucidate more, but there is also much out there that is quite erroneous.  One needs to search out the more reputable accounts.\n\n","date":"October 4, 2012 at 7:46 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17230","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Hullo Angel. I have seen the images you mentioned but have to tell you that unfortunately they are not at all convincing. Why, for instance, is the mountain with the “blackened top” photographed behind another mountain? Real archaeology is rigourous and this seems to be the work of amateurs. They have seen a “tree” between two rocks on top of a mountain. Why is there no close up? No tree is visible and the image seems to have been photoshopped.\nThere is a bush inside the compound of Saint Catherine’s Monastery in Sinai and visitors are obliged to go the area barefoot. Such things, aslo, seem to be folklore and do not help if one is looking for something to maintain faith.\nBest.\n\n","date":"October 7, 2012 at 8:39 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17318","author":"Louis","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Louis, if you go to the Caldwell interview I mentioned above, which can be found on Youtube and view the whole 8 parts, you will get some answers to your questions. For instance the picture of the mountain with the blackened top, is in actuality not the top of that mountain, there is a higher peak as you’ll see in the videos shown in the interviews. Also the Caldwells found some very interesting archaeological and non-archeaological evidence that relates directly to the bible descriptions of the area. For instance, a large gravesite with upright stone markers, stone markers in the thousands! An almond tree, I believe, approx drunk dimension ten feet in diameter, apparently allowing the age of the tree to possibly be in the thousands of years. A huge split rock, approx 4 stories high, split right down the middle with very evident signs of intense water flows from such rock into the valley below, in an area that sees less then an inch of water a year!…Those are just a start to all the things found there. It is also important to mention that the Saudis have the whole area cordoned off by high barbed wire fence and guarded 24/7 by desert patrols. No one is allowed access! The Caldwells do not claim to be archeaologists or claim anything to be authentic, but have done an extremely good job of filming, photographing and notation of much of what they found there, at the peril of imprisonment or even death.\nR\n\n","date":"October 8, 2012 at 2:23 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17337","author":"Ron","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Correction; It was a Cedar tree with an 8ft wide trunk, but it should be noted a almond tree was also found on the mountain.\n\n","date":"October 8, 2012 at 3:22 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17339","author":"Ron","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"Hullo Ron.Many thanks for the tip. So much has been filmed or written about OT archaeology that is nothing but wishful thinking, if not wild imagination. Since the lead has come from you I will take it seriously and see the video the soonest possible. L.\n\n","date":"October 8, 2012 at 8:54 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17346","author":"Louis","site":"shroudstory"},{"title":"Blogger: Please don’t get upset if you are Catholic","post":"\nAngel :\nWeren’t Judaism and Christianity influenced originally by Zoroastrianism and Mithraism?\n\nFrom my reading and study, it was the other way around Angel.\nRegards.\n\n","date":"October 8, 2012 at 1:36 am","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","id":"comment-17323","author":"Andy Weiss","site":"shroudstory"}]
