[{"title":"Revisiting Shroud of Turin and physics of resurrection","post":"Actually, as “The New York Times” observed, Benedict XVI referred to the Shroud as an “icon of Holy Saturday”. Why was that so? Did he see no signs of the Resurrection in the relic or was it due to his pessimism?\nBenedict is a truth seeker, not one to mince words. He goes straight to the point, which is something anyone will notice in his responses to the German journalist Peter Seewald, former editor of “Der Spiegel” and former communist, during the interview that led to the book, published by Ignatius Press in the US.\nThe emeritus pope refused to see any questions in advance and replied to Seewald without hestitation, making the tough journalist abandon communism and atheism and return to the Catholic faith.\n\n","date":"December 6, 2014 at 9:03 am","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","id":"comment-174917","author":"Louis","site":"shroudstory"},{"title":"Revisiting Shroud of Turin and physics of resurrection","post":"“Icon of Holy Saturday” is a perfect description by Benedict. The Shroud lies between where human understanding ends – Good Friday — and where mystery begins – Easter Sunday.\n\n","date":"December 6, 2014 at 10:13 am","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","id":"comment-174935","author":"David Goulet","site":"shroudstory"},{"title":"Revisiting Shroud of Turin and physics of resurrection","post":"Louis’ paper, and the Fanti exposition which follows it, is admirable. There is much to quibble at, but in general I think Giulio has expressed his case clearly. As he admits, however, it will hold no water until he can suggest how a body wrapped in a cloth can produce the kind of discharge implied. He agrees that earthquakes and radon are unlikely to be the cause, and stops short of “therefore it must be a miracle” for which I applaud him, although he needs now to demonstrate that ball lightning (his favoured explanation) can have the appropriate effect.\nThe other paper, however “The Physics of Resurrection” is gibberish. The risen body of Jesus certainly does not conforms to the physical laws of ‘something’ traveling beyond the speed of light. The risen body of Jesus was not infinitely massive, for a start (or consider the effect on the gravity of the earth!). Nor does the vague “very intense burst of energy” even begin to describe the energy required to accelerate a 60kg mass from rest to the speed of light, which would have annihilated most of Israel, let alone Jerusalem. And what was that nonsense about “just such images were burned onto walls by atomic bombs at Hiroshima and Nagasaki? No images were burned onto walls. Those shapes are demonstrably shadows, and show places where radiation did not reach the walls, not places where it did. The author is making the trival error of assuming that because a Fire Engine and my pencil are both red, my pencil is obviously a Fire Engine.\n(Reviewing what I wrote when Dan first referenced this article, I see I was much milder in my comments, merely referring to it as non-sense. Well, I’ve changed my mind; it’s gibberish.)\n\n","date":"December 6, 2014 at 10:05 am","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","id":"comment-174932","author":"Hugh Farey","site":"shroudstory"},{"title":"Revisiting Shroud of Turin and physics of resurrection","post":"Thank you, Hugh. God willing, there is more to come from other quarters in January, after which your comments will be welcome. Whether it is gibberish or not……\n\n","date":"December 6, 2014 at 10:30 am","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","id":"comment-174941","author":"Louis","site":"shroudstory"},{"title":"Revisiting Shroud of Turin and physics of resurrection","post":"“Good Friday – where human understanding ends, Easter where mystery begins”.\nPope Emeritus Benedict XVI was the object of an article by Roland Hill in the weekly “The Tablet”, published in England many years ago. He was then Cardinal Joseph Ratzinger, Prefect of the Congregation for the Doctrine of the Faith. The top German intellectual, who taught in universities in his native country for forty years, is, as I wrote, a truth seeker. He did not expect to be Pope, in fact he had asked John Paul II, the pope-philosopher, to be released of his duties as prefect to work in the Vatican library. His request was turned down.\nThe “Tablet” article portrayed Benedict as someone who was perplexed by the fact that Jesus was crucified. In other words, Why did God allow that to happen? When he went to Auschwitz, the pontiff asked, “Where was God?”.\nWhether we want to face it or not, most people in the world suffer, there is both moral AND physical evil, it is part of the “mysterious iniquitatis”, not even Alvan Plantinga has been able to tackle that. C.G. Jung and his closest friend, the American Dominican Father Victor White, based at Blackfriars, Oxford, reached no conclusion. The friendship almost came to an end. There was a thin but very strong thread that linked them and it was not broken. It was extremely strong. What was it? A spiritual bond. The Swiss psychiatrist told the priest, who lay dying, that he was now wearing Job’s shoes.\nAfter Father White’s untimely death, Jung thanked a Mother Superior of a Contemplative Order in England for the “spiritual help” she gave him:\nhttps://www.academia.edu/7344691/C._G._Jung_Father_Victor_White_and_privatio_boni\nHe understood the problem in the deepest sense. More about this in a review of a book about Jesus that should hopefully be published by February. Easter is no mystery. It was a logical effect. \nJesus said, “Heaven and earth shall pass away but my words shall not pass away.” Get the message?\n\n","date":"December 6, 2014 at 11:07 am","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","id":"comment-174945","author":"Louis","site":"shroudstory"},{"title":"Revisiting Shroud of Turin and physics of resurrection","post":"Dan wisely deleted the thread on the Turin Shroud as proof of the existence of God. It was going in the wrong direction with some strange comments. So I will post here some comments about two intellectual giants, one of whom knew about the existence of the relic, and their belief in God.\nC.G. Jung kept a copy of the Shroud face in his study, possibly given to him by his closest friend, the American Dominican scholar Father Victor White, based at Blackfriars, Oxford.\nHe did not keep it there because it was what led to his belief in God. On the contrary, he seems to have viewed it as a kind of consequence of the existence of God in some way.\nWhen asked whether he believed in God, he replied that he did not have to believe, he knew.\nhttps://www.academia.edu/6823292/What_did_Jung_see_in_the_Shroud\nLudwig Wittgenstein may not have have known anything about the Shroud, although he did spend some years meditating in a monastery, Klosterneuberg, in Austria. The Austrian-British philosopher was in the words of Bertrand Russell, the most perfect example he had ever known “of genius as traditionally conceived; passionate,intense and dominating.”\nWittgenstein felt that his philosophy was leading him nowhere, something was missing. “I cannot help seeing everything from a religious point of view”, he wrote. Was it intuition? Was it something like what Jung sensed? Could be.\nPsychology (Jung) raises questions that have to be tackled by philosophy (Wittgenstein). How far can philosophy get? Pope John Paul II answered the question in his encyclical “Fides et Ratio” (Faith and Reason”).\nHeidegger had no room for God in his philosophy, but made arrangements for a Catholic burial before he died. C.G. Jung was given a Protestant burial and Wittgenstein asked his Catholic friends to pray for him before he died:\nhttps://www.academia.edu/6085481/Why_was_Wittgensteins_burial_attended_by_a_religious_ceremony\n\n","date":"December 7, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","id":"comment-175121","author":"Louis","site":"shroudstory"}]
