[{"title":"Samuel Johnson Meets His Match","post":"Do I detect an new openness on CB’s part? Could this be the greatest conversion since John Newman. Oops. Sorry Dan.\n\n","date":"September 22, 2014 at 4:31 am","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153482","author":"John Klotz","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"New openness? I wasn’t aware I had shifted position since homing in on ‘shroudology’ back in December 2011. The target then, as now, was not religious belief or even relic/icon adulation. It was and still is a certain type of heavily media-promoted, internet-proselytized jargon-laden pseudo-science that serves merely to push an agenda.\nNope, this biochemist’s beef is not with those who believe that the TS image was produced as a miraculous by product of Resurrection, not if they add the rider that scientists can never hope to reproduce or indeed explain it, even with recourse to counter-intuitive quantum physics (where the distinction between physics and metaphysics becomes hopelessly blurred). If one believes in the Resurrection it is entirely reasonable that one sees the remarkable and indeed unique TS image as a side-product, even a gift to mankind. Fanciful, romantic even,  but all part of life’s rich tapestry.\nMy beef is with those who employ (or as often as not, cynically deploy) the language of science, often with a token attempt at mimicking the methods of science (model building and testing). It’s an agenda-driven exercise that has as its aim the promotion of some kind of belief system – political, ideological, theological etc – under the guise of rational objective science. It’s called pseudo-science.\nThere’s a simple test one can do to separate science from pseudo-science. Look closely to see whether the investigators  have acknowledged  ALL the current scientific hypotheses and./or working models that are TESTABLE IN PRINCIPLE, and by that criterion alone can be considered legitimate subjects for inclusion in experimental design or interpretations. Or do they begin by immediately ruling out of contention certain scientific and entirely legitimate models for consideration, focusing their attention entirely on their own pet model. If so, one then looks closely at the latter. Is it really testable in principle, or so exceedingly difficult to test in practice as to make it virtually untestable in anyone’s present lifetime, at least with currently available technology. In short, is there real underlying science, or is it mere eye-catching window-dressing, designed to glaze the eyes, to lull folk into dropping their defences, and finally to abandon altogether their critical faculties, placing their trust in others who “seem to be so much better informed”?\nFolk who resort to pseudo-science to push an agenda, especially those who like to bask in media limelight, are not just displaying one of the darker sides of human nature – a desire to influence others by deceit and trickery. They are damaging the image and reputation of science.  In  proper trustworthy hands, science offers a unique and powerful approach to addressing pressing problems that face us all, ranging from air pollution and climate change, to defence against bacterial and viral diseases to  increasing obesity and premature death to  ????? (others will have their own priorities)  But good research risks being instantly discounted on the grounds that “those scientists just push their wild theories, wrapping it up in their incomprehensible jargon simply to fool us all”.\nWith the possible exception of fad diets and nutrition, there is arguably a greater concentration of pseudoscience in shroudology than in any other topic that one meets in the mass media.  Put “shroud of turin” into your search engine and check the first 100-200 listings.  See which ‘stories’ show the greatest staying power. Yes, shroudology is just the tip of the pseudo-science iceberg, but that strikes me as good a reason as any  for targeting it mercilessly. Expose its tricky little methods for all to see – making it harder for those who may be thinking of deploying the same dark arts to promote new agendas, disguised yet again as enlightened scientific opinion. \nSorry to go on like this. We all have our bêtes noires. Mine as you will have gathered is pseudo-science.\n\n","date":"September 22, 2014 at 5:22 am","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153507","author":"Colin Berry","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"“simple, uncomplicated man-made contact one I favour” Simple? Uncomplicated? C’mon Colin really. lol\n\n","date":"September 22, 2014 at 10:12 am","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153603","author":"Don","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"It’s those agenda-pushing pseudo-scientists, good Catholics for the most part,  who want us to believe there are unique features to the TS image, Don. \nShame they have not bothered to model contact scorches at the limit of visibility (and thus superficiality). Had they done so, they might have found  the latter to be equally, er, unique. lol\nOne suspects that the Pontifical Academy of Science views the entire east of Genoa circus with polite amusement, possibly with a hint of disdain (one hopes so).\n\n","date":"September 22, 2014 at 11:43 am","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153639","author":"Colin Berry","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"“If there’s the slightest air gap, then there’s essentially no scorching, though a slight yellowing might just be possible from hot convected gases.”\nPHPL, this “excellent answer” is pure tosh. But CB should stick to his basic ideas, the more he writes, the more he makes a fool of himself.\n\n","date":"September 22, 2014 at 2:08 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153692","author":"anoxie","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"OK, troll anoxie. You keep up your steady stream of insults if you wish. In the meantime I’ll be posting further comments to my own site while shroudstory.com reviews its moderation policies.\n\n","date":"September 22, 2014 at 2:15 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153694","author":"Colin Berry","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"Having nothing better to do one afternoon, I upended an electric hotplate (hot enough to melt lead but not zinc) and suspended in front of it a sheet of linen at a distance of about 1cm. By arranging the hotplate on its side I hoped to avoid any degradation effect due to convection. It was apparent after several hours that no visible degradation had occurred. To that extent, I find that Colin’s statement: “If there’s the slightest air gap, then there’s essentially no scorching,” is correct. Has anoxie found something different?\n\n","date":"September 22, 2014 at 2:23 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153699","author":"Hugh Farey","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"The quote was:\n“If there’s the slightest air gap, then there’s essentially no scorching, though a slight yellowing might just be possible from hot convected gases.”\nnot:\n“If there’s the slightest air gap, then there’s essentially no scorching”\nBut my answer may be:\n“there’s […] no scorching”\nHugh, if you’ve found something, write a helpful pdf, and i’ll comment.\n\n","date":"September 22, 2014 at 2:49 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153713","author":"anoxie","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"I was quite surprised, on looking up “chemical scorch” on Google, to find fewer than a thousand references. It’s an expression I use quite often. I suppose that if we start with the results of a thermal decomposition of a cloth, defining them as a ‘scorch,’ then the results of any other process which produces exactly the same result could also be termed scorches, whether they be by sulphuric acid (chemical scorch), laser beams (radiation scorch), or a process wholly outside science (miracle scorch). The point would be that it would be impossible to tell, just by looking at the chemical changes to the cloth, which of these processes had resulted in the scorch. We must then look at the physical aspects of the ‘scorch’ to attempt to understand it. It appears only on the outer crowns of the threads, it appears to be of all-or-nothing intensity, and it appears to be only a few nanometres thick. There are good reasons for supposing that both vapour and radiation would discolour more than just the outer crowns of the threads (although the threshold intensity stochastic theory attempts to get round this) and some evidence to suggest that any thermal treatment sufficient to discolour the outer surfaces of the linen fibres would also darken the surface of the lumen as well. I’m increasingly pondering on sulphuric acid myself…\n\n","date":"September 22, 2014 at 2:17 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153696","author":"Hugh Farey","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"Sulphuric acid? I could assist you on that Hugh (or rather, cite some observations and insights from Luigi Garlaschelli, originally from Joe Nickell as I recall). But I shan’t, not while this site tolerates trolls. \nGoodnight (I’m off to read Adrie van der Hoeven’s latest paper, published today, packed with detail).\n\n","date":"September 22, 2014 at 2:32 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153705","author":"Colin Berry","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"To say that something can be forged is not evidence that it was forged. It’s merely speculation.\nI repeat my previous challenge to all those busy pseudo-skeptics. Before you claim you have an answer, show me an example of the application of your answer circa 1530 or before.\nAnd don’t forget the variations in intensity that can be used to create a 3d representation of the image data.\nWithout being able to illustrate your argument with a reasonable historical precedent your speculations are so much blather. They really are.\n\n","date":"September 22, 2014 at 3:30 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153732","author":"John Klotz","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"“To say that something can be forged is not evidence that it was forged. It’s merely speculation.” Quite so, but the inverse is equally true:\n“To say that something can be produced naturally is not evidence that it was produced naturally. It’s merely speculation.”\nActually, of course, any convincing explanation of the image, natural or manufactured, would help sway the ‘general consensus’ one way or the other. We just don’t have one yet.\n\n","date":"September 22, 2014 at 3:53 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153739","author":"Hugh Farey","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"While Colin Berry’s investigations into scorching by templates may assist in illuminating the possible process by which the TS image might have been formed, the physiological and anatomical detail of the image is sufficient to dispose of the idea that the image was formed by any other model than a crucified male human. \nSome basic knowledge of anatomy was achieved by the ancient Egyptians and Greeks, but further investigations came to a halt after Galen in the second century.  Galen’s studies in 22 volumes became the last word on anatomy until the sixteenth century.  Some dissections were carried out by Mondino de Luzzi (1275-1326) in Bologna.  In 1489 Leonardo da Vinci began a series of dissections on 30 cadavers until he was ordered to stop by Pope Leo X.  In the sixteenth century, the printing press enabled Galen’s work to be widely disseminated, and was criticised, drawing by drawing by Vesalius, who had permission to dissect the corpses from gallows.  But it took another hundred years for Galen’s influence to fade. \nThe inadequate understanding of the anatomical consequences of crucifixion, and indeed of the details of flagellation, are apparent in the various depictions in the many art works showing the crucifixion and burial of Christ, until well after the sixteenth century.  In particular the human circulatory system was not understood until the 16th – 17th centuries. \nIn contrast, the anatomical effects of crucifixion are depicted accurately on the Shroud image, in a way which was completely unavailable to any purveyor of religious artifacts preceding 1350, when the image first became known in Europe.\n\n","date":"September 22, 2014 at 4:16 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-153750","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"“While Colin Berry’s investigations into scorching by templates may assist in illuminating the possible process by which the TS image might have been formed,”\nDaveb I agree and what Colin is doing is important, but it tells us nothing about if it’s  authentic or non-authentic. \nLet’s assume that it’s a scorch done by heat. Does that mean that someone in the 13 hundreds used a hot rod like a soldering iron create the image? \nHow about a hot metal figure? Well if you heat this figure and drape a linen over it you would have to heat that figure to the same even temperature all over. How would someone using technology in the 13 hundred do that?\nAll those questions and many more have to be answered before you can claim it was produced by someone in the 13 hundreds.\n\n","date":"September 23, 2014 at 4:15 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-154430","author":"John Green","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"This is not a new objection, but I’ll raise it again:  How many 14 by 4 ft pieces of linen (let’s assume they’re fairly valuable, and time-consuming to make) would you have to ruin before you “scorched” it just right (the image being a whole body-length, front and back)?  50?  ???\n\n","date":"September 24, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-155228","author":"Nabber","site":"shroudstory"},{"title":"Samuel Johnson Meets His Match","post":"Besides it is not a thermal scorch but a thermal PRE-scorch (resulting in a fairly transluscent volumetric/3D ventral and dorsal body image) much akin to a very slight mordanting of limestone-dust, sweat and blood implying the linen fabric was first in-soaked with an alkali solution and the body compressed front and back and then thetightly wrapped up body subjected to an external (and internal?) heating source in order to dry out (purification ritual.\n\n","date":"September 23, 2014 at 7:09 am","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","id":"comment-154163","author":"Max Patrick Hamon","site":"shroudstory"}]
