[{"title":"Collimated Sweat Acting at a Distance","post":"Lisa Oppenheim was born in New York City and she is\n>the winner of …\n>third biennial Shpilman International Prize for Excellence in Photography as American photographer and experimental filmmaker \n>… Chosen from a pool of 160 applicants spanning 28 countries, Oppenheim will receive $45,000 to continue her prospective project, “Imprint (Shroud of Turin).” Prize jurors included Quentin Bajac, MoMA’s chief photography curator; Monika Faber, founder and director of the Vienna’s Photoinstitut Bonartes; and Galit Eilat, co-curator of the 2014 São Paulo Biennial, among others.\nLink:\nhttp://blogs.artinfo.com/artintheair/2014/12/17/lisa-oppenheim-wins-israel-museum-photography-prize/\n– Quentin Bajac is the Chief Curator of Photography at the Museum of Modern Art in New York\n– Monika Faber is the Founder and Director of the Photoinstitut Bonartes in Vienna.\n– Ruth E. Iskin is an art historian…\n– Galit Eilat is an independent curator, a writer and the founding director of The Israeli Center for Digital Art in Holon (2001 – 2010).\n– Noam Gal is the Horace and Grace Goldsmith Curator and the Head of the Noel and Harriette Levine Photography Department at the Israel Museum in Jerusalem.\n— — —\nIt would be interesting to know exactly what the project on which she wants to work.\nAn interesting image obtained on lilion (Polyamide 6,  link = http://en.wikipedia.org/wiki/Nylon_6 ) should not be too difficult to achieve, but to work on linen is another matter, more complicated if I’m not mistaken …\n\n","date":"December 18, 2014 at 8:10 am","url":"https://shroudstory.com/2014/12/18/collimated-sweat-acting-at-a-distance/","cat":"other_blogs","id":"comment-177519","author":"piero","site":"shroudstory"},{"title":"Collimated Sweat Acting at a Distance","post":"Errata corrige:\nI wrote:\n>It would be interesting to know exactly what the project \nInstead of:\n>It would be interesting to know exactly what is the project\n— —\nie: what exactly is the project on which Oppenheim is working or she want to work …\nand, unfortunately, I have not yet found any information on the Web about this project.\n\n","date":"December 18, 2014 at 8:17 am","url":"https://shroudstory.com/2014/12/18/collimated-sweat-acting-at-a-distance/","cat":"other_blogs","id":"comment-177522","author":"piero","site":"shroudstory"},{"title":"Collimated Sweat Acting at a Distance","post":"Perhaps a project “optimal” (and difficult to implement) would be to create\nthe impression of hot smoking on linen (image first obtained with a geometric\nfigure [realized thanks to a particular spatial confinement] and then with the human form…). So the smoke of incense on linen cloth is a strange substance…\nBut it is not said that the idea of incense smoke is really what gave rise to the famous footprint on linen.\nIn short, Art is something rather more complex than scientific research, however, the two fields can intersect each other.\nEven the images of thermal footprints on linen (eg: handprints photographed\nor filmed in the IR field) can be interesting.\nIn a nutshell:\nhere can seem to us to fall in a really fun space…\nSo here we arrive at the border between poetry and photography.\nBut …\nDo you can realize the “scientific poetry” by the sweat of a dead man?\nI have several doubts about these vague ideas.\nPerhaps we will come to think of being able to work with a\n“Modern Ark of the Covenant” (ie: with appropriate capacitors …). \nLinks:\nhttp://en.wikipedia.org/wiki/Atmospheric_electricity\n>Experiments have shown that the intensity of this electric field is greater in the middle of the day than at morning or night and is also greater in winter than in summer. In ‘fine weather’, the potential, aka ‘voltage’, increases with altitude at about 30 volts per foot (100 V/m), when climbing against the gradient of the electric field.\nhttp://en.wikipedia.org/wiki/Global_atmospheric_electrical_circuit\nhttp://en.wikipedia.org/wiki/Electric_field\n\nhttp://en.wikipedia.org/wiki/Atmosphere_ground_layer\n— — —\nMaybe we should analyze well (with the SPM techniques) the old experiments on linen obtained in the past by Judica Cordiglia …\nWhat do you say?\n\n","date":"December 18, 2014 at 8:57 am","url":"https://shroudstory.com/2014/12/18/collimated-sweat-acting-at-a-distance/","cat":"other_blogs","id":"comment-177527","author":"piero","site":"shroudstory"},{"title":"Collimated Sweat Acting at a Distance","post":"I have found the news about “The Feynman Lectures on Physics”.\nThe Feynman Lectures on Physics is perhaps the most popular physics book ever written.\nLinks:\nhttp://en.wikipedia.org/wiki/The_Feynman_Lectures_on_Physics\nhttp://feynmanlectures.caltech.edu/\nSpicer indicated us the question of polar molecules\nthat typically have dipole moments\nthat are 3-4 orders of magnitude larger\nthan non-polar molecules\n(See: Richard Feymann, Robert B. Leighton, and Matthew Sands.\nThe Feynman Lectures on Physics Volume II.\nAddison-Wesley, Reading, Massachusetts, 1965)\nand\nthe magnitude between 100 and 300 volts per meter in the vertical, downward direction… \nhttp://feynmanlectures.caltech.edu/II_toc.html\n— — —\nThe words by Feynman (= “What is Science?”)\nHere are the last words of his speech:\n“… … It is necessary to teach both to accept and to reject the past with a kind of balance that takes considerable skill. Science alone of all the subjects contains within itself the lesson of the danger of belief in the infallibility of the greatest teachers of the preceding generation.\nSo carry on. Thank you.”\nhttp://www.fotuva.org/feynman/what_is_science.html\nObviously it is not necessary that we take everything at face value,\neven that which comes from a Nobel.\n\n","date":"December 18, 2014 at 9:18 am","url":"https://shroudstory.com/2014/12/18/collimated-sweat-acting-at-a-distance/","cat":"other_blogs","id":"comment-177530","author":"piero","site":"shroudstory"}]
