[{"title":"Comment of the Week by Thibault Heimburger","post":"This is a fascinating discussion.Thanks Yannick and the rest for putting all this together.\nIf I understand well, whether it is originated at the impurities layer or at the outermost fibers the image is basically the result of natural chemical reaction.\nIf so, why -according to Ray Schneider in a recent post here and perhaps many others too- the image formation mechanism is NOT ISOTROPIC, as expected from a natural process and at the same time, the image itself shows no preferent directionality and in this sense is ISOTROPIC (one argument largely used -among others- to rule out.the hypothesis of being a painting)?\nPerhaps, I am missing something, I don`t know….\n\n","date":"May 12, 2012 at 6:19 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11303","author":"Gabriel","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"I’m not an expert on isotropic images, but I think that it could be caused by the phenomenon of the evaporation-concentration describe by Rogers, along with the fact that the cloth was bleached according to the antique technique of bleaching the cloths by batch of yarns before the weaving.   All this would most probably leave a different quantity of impurities all over the cloth (this could be also one of the main reason that we see a banding effect on the cloth).  It’s impossible to think that a natural phenomenon like the one of evaporation-concentration and that a bleaching done differently from one batch of yarn to another could leave the same amount of impurities on every single yarn of the cloth !  And if it is those impurities that were colored, that would explain (maybe) that the image formation was non isotropic.  As I say, I’m not an expert about isotropic images, but I think the hypothesis of Rogers concerning the chromophore can explain it because it seems to fit very well with what we know about the Shroud and I think it is another good reason to favor this hypothesis of Ray Rogers…  I would really like to know the point of view of M. Schneider about that.\nAnd about the other thing you said : “whether it is originated at the impurities layer or at the outermost fibers the image is basically the result of natural chemical reaction.”  This is not what the fans of supernatural hypothesis seem to think (many of those defend the primary cell wall hypothesis by the way).  Effectively, in Rogers opinion, if the color come from a dehydration-oxydation process concerning a thin layer of impurities on top of the fibers, then it would be VERY HARD to defend any hypothesis involving any kind of radiation (whether it’s the UV lasers of Di Lazzaro, the Corona discharge of Fanti or the protons of Rinaudo).  Why ?  Simply because each one of these mechanism MUST penetrate the linen fiber (even if it’s just superficially) to cause an image !  This principle don’t fit very well with the idea that it was a thin layer of impurities on top of the fibers that was colored !  For me, that can explain easily why Fanti and others favored the hypothesis of the primary cell wall.  It’s simply because if this hypothesis is true, then their supernatural hypotheses would be much more easy to defend !  Do you understand now what is at the heart of the debate ???  That’s why this question of the chromophore is so important.  If Rogers hypothesis is right (and personally, I really believe it is), then that mean all the supernatural hypothesis involving some kind of energetic radiation are much less credible and defendable, scientifically speaking…  That where the heart of this debate reside.\n\n","date":"May 12, 2012 at 6:23 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11309","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"I agree with Thibault on the fact that, for now, science cannot clearly state for sure which one of the 2 hypothesis is the correct one. But I disagree with him about what he said here : “ALL the facts are consistent with both possibilities.” For the moment, I don’t think this is true. Rogers as showed with good scientific arguments that his hypothesis CAN be correct regarding ALL the observations and facts concerning the body image on the Shroud. But I don’t think we can say the same thing concerning the other hypothesis involving the primary cell wall.  In fact, I’ve NEVER seen one single scientific paper published by a real Shroud expert (who is also an expert in chemistry and microscopy) that do the same than Rogers did with his papers, i.e. to DEMONSTRATE that the hypothesis he defend CAN be applied to what we know about the body image on the Shroud. I still wait for a paper like that to be published in order to properly defend the hypothesis of the primary cell wall being the true chromophore of the image. I’ve never seen one so far. For the moment, I consider this hypothesis of the primary cell wall more like a personal opinion of some researchers than a real hypothesis that have been correctly DEMONSTRATE with solid scientific arguments, like it was done by Rogers for his own hypothesis.\nSorry Thibault for having a different opinion that yours on the subject !!! ;-) In fact, we both agree that there is no way to be scientifically certain about the correct chromophore of the image but, where I defer from him, is because I favor Rogers hypothesis well before the one about the primary cell wall. But that just my opinion, based on a long reflection…\nAlso, you have to know that Thibault Heimburger, a friend of mine, is one of the co-author of the paper published in 2010 with Fanti, Di Lazzaro and some other members of the Shroud Science Group that pushed the issue of the primary cell wall. That’s why I’m not really surprised by the fact he put the hypothesis of the primary cell wall on the same level of credibility than the one of Rogers. As I said, that’s where I defer from him. On the general principle, I agree with him but I don’t think it is scientifically correct to think those 2 hypotheses have the same degree of credibility, because the hypothesis of the primary cell wall has never been studied (in regard of what we know about the body image on the Shroud) to the SAME in-deep level as the hypothesis of Rogers…\nFor example, can someone give me a solid and credible scientific explanation for the FACT that the ghost and the diimide leave a clean uncolored and undamaged fiber behind ? At first sight, that doesn’t seem to really fit with the idea that the primary cell wall would have been colored instead of a thin layer of impurities on top of the fibers !!! If the color would be in the primary cell wall, then the ghosts would be composed mainly of a dehydrated and oxidized primary cell wall that surely would have left a DAMAGED fiber behind. You understand what I mean ? This is PURE LOGIC thinking ! If you take away the colored primary cell wall of a fiber, how in the world the resulting linen fiber can be considered undamaged ??? It just doesn’t seem to fit.\nAnd the reduction of the color with diimide, leaving an undamaged linen fiber behind, is also one of the main argument of Rogers (among many other) to show that the whole linen fiber (including the primary cell wall) WAS NOT colored at all during the image formation process, because the resulting fiber seem to be undamaged. Don’t you think that chemist experts like Rogers and Adler (also expert on the Shroud) would not have noticed the absence of the primary cell wall of the fibers after the use of diimide ? I just can’t imagine that ! For me, it’s pretty evident that experts like them would have note a significant change in the physical aspect of the resulting fibers. That’s just my opinion of course but I don’t think it’s idiot to think that way…\n\n","date":"May 12, 2012 at 7:45 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11315","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"I think that some explanations regarding the pcw hypothesis are necessary.\nThe pcw (primary cell wall) is the surface layer of  flax fibers.\nThickness : about 0.2-0.3 micrometer (typical thickness of flax fibers : 10-20 micrometer). Rogers found that the thickness of the carrier of the color was about 0.2-0.6 micrometer\nComposition : mainly hemicellulose. Traces of pectin and lignin. The energy necessary to change the chemical properties of hemicellulose (and to color it) is much lower than that of cellulose, the main component of the secondary cell wall (more than 90 % of the thickness of a flax fiber).\nI repeat : all the facts are consistent with both possibilities.\nYannick wrote :    For example, can someone give me a solid and credible scientific explanation for the FACT that the ghost and the diimide leave a clean uncolored and undamaged fiber behind ? At first sight, that doesn’t seem to really fit with the idea that the primary cell wall would have been colored instead of a thin layer of impurities on top of the fibers !!! If the color would be in the primary cell wall, then the ghosts would be composed mainly of a dehydrated and oxidized primary cell wall that surely would have left a DAMAGED fiber behind. You understand what I mean ?”\nFirst Yannick, the ghosts could not live a clear uncolored and undamaged fiber behind because the “ghosts”, by definition, were not attached to any fiber.\nSecond, I don’t understand your sentence “the ghost and the diimide leave a clean uncolored fiber behind”.\nDiimide was in fact used by Adler on colored fibers among 21 solvents employed in dye extraction tests. Only hydrazine (very slowly) and diimide (a strong powerful reducing agent) could bleach the yellow color of image fibers.\nThis test only show that the color is not a dye and that the color is only at the surface of the fiber. Rogers wrote clearly :” Up until this time, we had assumed that the image color was a result of chemical changes IN the cellulose of the linen; The most likely change would involve the dehydration of the cellulose to produce conjugated double bonds system. Adler’s observations strongly suggested that the cellulose was not involved in image formation”.\nIf the color is only in the pcw, you’ll find exactly the same result because the pcw is a thin surface layer. The cellulose is not involved. The fact that diimide leaves undamaged fibers behind shows only that it can not destroy or modify the strong cellulosic structure of the secondary cell wall. It is not surprising. But, because diimide is able to bleach the colored fibers,  the chromophore carrier is likely a non-cellulosic structure at the very surface of the fiber. No more no less.\nIt is the same for all the other properties found by the STURP, Rogers etc..regarding the chemistry of the image. To my knowledge there is no known fact able to distinguish between the 2 possibilities.\nHowever the fact is that Rogers never wrote the world primary cell wall. Why ?\nHere we must remember that he was fascinated by the ( true ) fact that the image appears to be more dense in the dark bands than in the light bands. He thought that the bands seen on the Shroud could be explained if there were more impurities left after washing and bleaching in the dark bands than in the light bands.\nTherefore everything makes sense : dark bands = thick impurity layer = dense image.\nALL the impurity layer hypothesis is based on this hypothesis.\nBut the fact is that this hypothesis is very controversial.\nFor example, many textile experts think that the bands can be explained by the heterogeneity of the density of the threads (something which is often observed in ancient fabrics).\nDark bands = more threads = more fibers = more “pcw” = dense image and vice versa.\nIn my opinion, Rogers did not even think about the pcw as a possible color carrier because he found very early a complete reliable hypothesis able to explain all the observed facts. This is human.\nBut recently, on the basis of the description of the pcw by some experts, we found (in SSG) that all the known microscopic, macroscopic and chemical properties could be explained if the image were the result of some kind of dehydration-oxydation of the hemicellulose found in the pcw.\nBoth hypotheses are possible but the pcw hypothesis does not necessarily imply the complex process required to explain the impurity layer.\n\n","date":"May 13, 2012 at 4:11 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11328","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"This message from Thibault is not surprising.  We have to remember that he was the co-author with Fanti and Di Lazzaro of the infamous (that’s my opinion) paper of 2010 that is clearly anti-Rogers and pro-Fanti (i.e., it is a paper Fanti wrote mainly to self-promote his own image formation hypothesis).  In this context, it’s normal that Thibault wants to put the primary cell wall hypothesis on the same level than the hypothesis of Rogers !  He is stuck with that hypothesis, since he signed this paper that clearly did a great promotion of this hypothesis …  Once you take a position like that by co-writing a paper, it’s very hard to admit : I’ve made a mistake and I must change my mind…  \nAs I said, this paper did also a great self-promotion of Fanti’s ideas !  It’s important to note that because the public is generally unaware of this apparent conflict of interest.  When you understand that the corona discharge can only affect the primary cell wall of a linen fiber, it’s easy then to understand why Fanti push this issue so hard and why he don’t want to hear about Rogers hypothesis no more !  \nAt least, Thibault is not like Fanti and some others who would like to only consider the primary cell wall hypothesis and completely forget about Rogers work and conclusions.  One good point for Thibault !  \nThe fact is this : The ghosts and the diimide leave a clean fiber behind.  This can be found in Rogers papers and this observation was the main reason why he conclude that the cellulose (read : the whole fiber) was not affected by the image formation process.  Thibault has a different understanding of Rogers work and it is his right.  But I think he’s wrong !  Here’s the quotes from Rogers about this :\n1-“Heller and Adler found that the image fibers could be decolorized with diimide.   Reduction left COLORLESS, UNDAMAGED CELLULOSE FIBERS BEHIND.”  Personal note :  I think it’s pretty clear !  For Rogers, what diimide could do was only to reduce the carbohydrates impurities on top of the fibers, while leaving the whole fiber intact.  In Rogers language, as I said, when he used the word “cellulose”, he meant “the whole fiber” because, no matter what Thibault think, it’s not true that the primary cell wall is only composed of hemicellulose and pectin !  See this : http://www.encyclopedia.com/doc/1G2-3408000066.html  The expert who wrote this paper is clear :  The primary cell wall is composed of CELLULOSE, along with hemicelluloses and pectin !  Here’s the quote : “The primary cell wall contains three major classes of polysaccharides: cellulose, hemicellulose, and pectin.”  So, when Rogers talk about “cellulose”, he was most probably referring to the whole fiber, including the primary cell wall.  Thibault can twist this in his head all he want, Rogers knew well about the primary cell wall and the observation concerning the diimide was clear for him :  the fiber WAS NOT AFFECTED at all during the image formation process because it leaves a colorless undamaged fiber behind.\n2-We can read in page 29 of the paper “Scientific method applied to the Shroud of Turin” :  “The color of image fibers was often stripped off of their surfaces, leaving COLORLESS CELLULOSE FIBERS.  The color reside ONLY ON THE SURFACE OF THE FIBERS.” In his answer to question #12 of his paper “Shroud of Turin FAQ”, Rogers said that those “ghosts” of coloration were a CONFIRMATION of the FACT that the CELLULOSE WAS NOT INVOLVED IN IMAGE FORMATION.  Personal note : Again, here, we have to understand Rogers expression “cellulose” as “the whole fiber” here.  For Rogers, this fact first came from the observation that the diimide would reduce the color on the fibers, leaving undammaged fibers behind.    In addition to that, the presence of ghosts of coloration in the sticky tapes, along with the COLORLESS linen fiber that was left behind, was an independent confirmation that the linen fibers themselves were NOT INVOLVED IN IMAGE FORMATION.\nFor Rogers, those 2 observations, along with the banding effect (consistent with the ancient method of making linen cloth as described by Pliny the Elder) and along with the fact that the image is only superficial (consistent with the evaporation-concentration phenomenon) was well enough to make him realized that the image did not affect the linen fiber directly but instead, it was only found ON TOP OF THE FIBER IN A THIN LAYER OF CARBOHYDRATES IMPURITIES.\nThibault clearly have a different interpretation than mine, but since he’s no more expert than me on the question (the same is also true concerning Fanti, Di Lazzaro and the other co-authors of the 2010 paper), I don’t see why his opinion should have more value than mine…  Don’t get me wrong here, I don’t say I’m surely right, but I say that Thibault don’t have no more credibility than me on this subject.  It’s not because you’re a member of the Shroud Science Group that your opinion become suddenly perfect !  He he !\nAnd here, I’ll leave you with a reflection :  Rogers was a true expert in microscopy and chemistry and saw the Shroud with his own eyes during 5 days and night in 1978.  None of the co-authors of the 2010 paper can say the same.  None are experts in chemistry and microscopy and none made extensive direct research on the Shroud.  Rogers claim that the whole linen fiber was not affected by the image formation process and claim that it was only a thin layer of carbohydrates impurities found on top of the linen fibers that was colored.  Fanti and al. proclaim in their 2010 paper (to my knowledge, for the first time) that Rogers was probably wrong and that, instead, the coloration reside in the primary cell wall of the linen fiber (a part of the fiber that contain cellulose).\nThe question is :  who we can trust ?  \nImagine you had to understand a complex subject and you have to choose between 2 persons to get information about this subject.  The first is a clear expert on the subject and the other is not consider at all to be an expert on that matter, which one will you choose as the best reliable source of information ?  I think the answer is pretty evident !  Of course, the first person, even if he’s an expert, is not immune from doing a mistake or giving you an information that is somewhat false, but the odds that this person can give you a better overall understanding is much higher, don’t you think ?  That’s why I prefer to trust the judgment of Ray Rogers on that particularly complex question and that’s why I favored his own hypothesis, even if I’m honest enough, like Thibault, to understand that, in the present state of our knowledge, it is impossible to be 100% sure which one of the 2 hypothesis is correct regarding the Shroud.  \nBut, I’ll say it again and this is very important to note :  Rogers as showed with good scientific arguments that his hypothesis CAN be correct regarding ALL the observations and facts concerning the body image on the Shroud. But I don’t think we can say the same thing concerning the other hypothesis involving the primary cell wall. In fact, I’ve NEVER seen one single scientific paper published by a real Shroud expert (who is also an expert in chemistry and microscopy) that do the same than Rogers did with his papers, i.e. to DEMONSTRATE that the hypothesis he defend CAN be applied to what we know about the body image on the Shroud. I still wait for a paper like that to be published in order to properly defend the hypothesis of the primary cell wall being the true chromophore of the image. I’ve never seen one so far. For the moment, I consider this hypothesis of the primary cell wall more like a personal opinion of some researchers than a real hypothesis that have been correctly DEMONSTRATE with solid scientific arguments, like it was done by Rogers for his own hypothesis.\nAnd if I’m wrong here, please show me the paper where I can find a real scientific demonstration that the primary cell wall can answer properly to all the known facts and observations we know about the Shroud, particularly concerning the ghosts, the diimide, the banding effect and the extreme superficiality of the image.  SHOW ME JUST ONE SCIENTIFIC PAPER WHO HAVE ACCOMPLISH THAT FEAT !!!  I dare anyone to find me just one !  And please, don’t talk to me about the 2010 paper because I’ll laugh at you !\n\n","date":"May 13, 2012 at 6:27 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11330","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Thanks a lot for your extensive and rigourous answer, Yannick.\nHowever, the issue of the isotropy -if true- could give important clues regarding the image formation mechanism. I mean, Ray Schneider not only states that the image formation process was not isotropic, but he thinks it is proven that a clear vertical directionality was involved.\nI don’t know the degree of credibility that this point of directionality may hold, but IF TRUE -we have to very cautious here- it can more easily be explained in the frame of an energy field or even an ancient photograph system, than in the frame of a chemical reaction, regardless the imprint was formed on the impurity layer or on the outermost part of the fibres.\n\n","date":"May 12, 2012 at 8:24 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11316","author":"Gabriel","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"This question of the vertical projection is very complex !  But for Rogers, this conclusion reached by STURP is not in total contradiction, theoretically speaking, with his Maillard reaction hypothesis.  Rogers speak about that in his book and for him, if there was some very particular conditions inside the tomb and around the body, in theory, it is possible to think that a gaseous diffusion process could have produced a body image like we see on the Shroud.  So, I don’t think that this fact concerning the vertical projection of the image from the body to the cloth can permit to completely reject the hypothesis of Rogers about the image formation.  Of course, that doesn’t mean Rogers hypothesis is the correct one.  That simply mean that Rogers was fully aware of this problematic (the vertical projection) and, nevertheless, for him, in some very particular conditions, it was possible to think that the body image could really have been formed by a gaseous diffusion.  In other words, this problematic was not enough to push his hypothesis in another direction than a gaseous diffusion involving ammoniac and other kind of amines coming from inside the corpse…\nIf you never read his great book, you SHOULD !  Here’s the link to buy the PDF version of the book (it’s cheaper) :  http://www.lulu.com/shop/raymond-n-rogers/a-chemists-perspective-on-the-shroud-of-turin/ebook/product-17416203.html\nAlong with the book of Barbet (A doctor at calvary), it’s by far the best book about the Shroud that I ever read.  It’s a must for anyone interested in Shroud science.\n\n","date":"May 12, 2012 at 9:27 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11318","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Aceptar la autenticidad de la Sábana implica forzosamente, por un principio de COHERENCIA, aceptar el carácter sobrenatural de la impresión de la imagen, porque ninguna explicación natural puede darse al DESPLAZAMIENTO de la Sábana preciso para esa impresión.\nBarbet y Rogers NO son demasiado compatibles…..\nBarbet creía en el carácter sobrenatural de la Sábana, que demostraba la Resurrección de Jesús.\nLas manchas de sangre son REALES y han precisado del contacto íntimo con el cuerpo para poder “calcarse”.\nLos “regueros” o “calcos” de sangre sobre el cabello en la imagen frontal son IMPOSIBLES.\nDe ser posibles la Sábana sería una falsificación, y NO es así.\nMidamos la distancia horizontal entre cualesquiera puntos, a uno y otro lado del rostro, de los “regueros” de sangre que corren por los cabellos del Hombre de la Sábana utilizando la magnífica herramienta que nos brinda Mario Latendresse en su Shroud Scope:\nhttp://www.sindonology.org/shroudScope/shroudScope.shtml\nYo he utilizado la fotografía de Durante del 2002. Entre los 2 puntos medidos ( se pueden utilizar los que el lector quiera) obtengo una distancia de 15,47 cm, casi quince centímetros y medio.\nEsa distancia es IMPOSIBLE que medie entre “esos” puntos del cabello a uno y otro lado de la cara. Sobre mi cabeza, con estatura cercana al 1,80, utilizado una cinta métrica flexible ni siquiera alcanzan esos 15,47 cm desde el cabello a la punta de la nariz…..\nEsas manchas de sangre que aparecen en el cabello estaban cuando se produjeron sobre LAS MEJILLAS y la Sábana ENVOLVÍA el rostro de Jesús.\nEn el evento de la Resurrección la Sábana se ha DESPLEGADO y las manchas de sangre que estaban sobre las mejillas, al imprimirse la imagen, han quedado desplazadas a la zona en que se ha impreso la imagen del cabello.\n¿Alguna otra explicación posible?\n[He abierto un post en mi blog para mostrar fotografías de una medición, por aquello de que “más vale una imagen que cién palabras”\nhttp://lasabanaylosescepticos.blogspot.com.es/2012/05/natural-o-sobrenatural.html ]\nCarlos Otal.\n\n","date":"May 13, 2012 at 6:03 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11321","author":"corneliotel","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Aceptar la autenticidad de la Sábana implica forzosamente, por un principio de COHERENCIA, aceptar el carácter sobrenatural de la impresión de la imagen, porque ninguna explicación natural puede darse al DESPLAZAMIENTO de la Sábana preciso para esa impresión.\nBarbet y Rogers NO son demasiado compatibles…..\nBarbet creía en el carácter sobrenatural de la Sábana, que demostraba la Resurrección de Jesús.\nLas manchas de sangre son REALES y han precisado del contacto íntimo con el cuerpo para poder “calcarse”.\nLos “regueros” o “calcos” de sangre sobre el cabello en la imagen frontal son IMPOSIBLES.\nDe ser posibles la Sábana sería una falsificación, y NO es así.\nMidamos la distancia horizontal entre cualesquiera puntos, a uno y otro lado del rostro, de los “regueros” de sangre que corren por los cabellos del Hombre de la Sábana utilizando la magnífica herramienta que nos brinda Mario Latendresse en su Shroud Scope:\nhttp://www.sindonology.org/shroudScope/shroudScope.shtml\nYo he utilizado la fotografía de Durante del 2002. Entre los 2 puntos medidos ( se pueden utilizar los que el lector quiera) obtengo una distancia de 15,47 cm, casi quince centímetros y medio.\nEsa distancia es IMPOSIBLE que medie entre “esos” puntos del cabello a uno y otro lado de la cara. Sobre mi cabeza, con estatura cercana al 1,80, utilizado una cinta métrica flexible ni siquiera alcanzan esos 15,47 cm desde el cabello a la punta de la nariz…..\nEsas manchas de sangre que aparecen en el cabello estaban cuando se produjeron sobre LAS MEJILLAS y la Sábana ENVOLVÍA el rostro de Jesús.\nEn el evento de la Resurrección la Sábana se ha DESPLEGADO y las manchas de sangre que estaban sobre las mejillas, al imprimirse la imagen, han quedado desplazadas a la zona en que se ha impreso la imagen del cabello.\n¿Alguna otra explicación posible?\n[He abierto un post en mi blog para mostrar fotografías de una medición, por aquello de que “más vale una imagen que cién palabras”\nhttp://lasabanaylosescepticos.blogspot.com.es/2012/05/natural-o-sobrenatural.html ]\nCarlos Otal.\n\n","date":"May 13, 2012 at 6:08 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11322","author":"corneliotel","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Hello Carlos, I don’t think Barbet’s hypotheses versus the Shroud are necessarily in contradiction with Rogers hypotheses.  Both favours natural explanations : Barbet for the blood transfer and Rogers for the image formation.\nHave you ever consider the possibility that there was one configuration of the Shroud over the body at the moment he was put in the Shroud (hallowing some blood transfer), then another configuration during the short transfer of the body from the central room of the tomb to the burial tablet (hallowing some more blood transfer), then, when the body was lying on the tablet, the configuration of the Shroud changed one last time and this final configuration was pretty loose over the body, without any linen strips used to tied it, and then, only then, the body image formation took place ? \nI think this very possible scenario that I just described can explain pretty welll the majority of the blood and body images on the Shroud (with their particular configuration).  No miracle is needed here.  We have to remember that the idea that there would be traces of tearing in the bloodstains is only good in the context of completely dried bloodstains…\n\n","date":"May 14, 2012 at 10:48 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11344","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Yesterday, I forgot to respond to Thibault Heimburger request.  In his comment, he asked me to find him one proof to support Rogers claim that the color on the Shroud reside on a thin layer of carbohydrates impurities on top of the linen fibers.\nI think Thibault should remember one important evidence mentioned by Rogers in his writings, and you can find it at point #17 in the paper I wrote about the quotes of Ray Rogers concerning the chromophore of the image.  Here it is again :\n17- A search for carbohydrate impurities on the Shroud CONFIRMED McCrone’s detection of some starch fractions.  Starch and low-molecular weight carbohydrates from crude startch would color MUCH MORE EASILY than would cellulose as a result of either thermal dehydration or chemical reactions.  The hypothesis on carbohydrates impurities is SUPPORTED by observations of TRACES OF SOME STARCH FRACTIONS ON IMAGE FIBERS.\nI think this is a very strong evidence that there really is some carbohydrates impurities on top of the linen fibers of the Shroud !!!  Note that those starch fractions were first discovered by Walter McCrone and then INDEPENDENTLY confirmed by Ray Rogers !  So, I don’t think anyone can really argue against this evidence !\nOf course, that doesn’t necessarily mean that it was those starch fractions (along with maybe other sorts of carbohydrates impurities) that were colored by the image formation process.  But we have to say that this finding STRONGLY suggest it !  One things for sure, this finding PROVE that there really is some carbohydrates impurities on top of the fibers.  \nThe question that still wait to be fully proven is this :  Did it really was those carbohydrates impurities that were colored during the image formation process ?  I think the odds are strong in favor of a “yes” !  Remember what Rogers said in point #17 : “Starch and low-molecular weight carbohydrates from crude startch would color MUCH MORE EASILY than would cellulose as a result of either thermal dehydration or chemical reactions.”  \nAnd here, we have to think that Rogers had the whole fiber in mind (including the primary cell wall) when he said “would color much more easily than would cellulose.”  Remember what I said in my paper on this subject ?  I think it’s pretty evident that when Rogers was using the term “cellulose” in his writing, what he really meant was “the whole fiber”, including the primary cell wall.  Since this primary cell wall is only PARTIALLY composed of carbohydrates that would color more easily than cellulose itself (like hemicellulose and pection), I think Rogers conclusion his correct :  a thin layer TOTALLY composed of reactive carbohydrates can be colored MUCH MORE EASILY than a linen fiber, including his most external layer (i.e. the primary cell wall).  That’s the way I understand Ray Rogers reflection on this subject.  \nSo, when you consider my own interpretation of Ray Rogers words (I can be wrong but I really don’t think so), I think it’s easy to conclude that if there is a thin layer of carbohydrates impurities on top of the fibers (and we can say now that it’s a FACT), then it’s pretty sure that this layer was colored during the image formation process !!!  \nBut, even if my interpretation is correct about that, I think it’s fair to say that there still a question that his left open :\nDid those carbohydrates impurities were the only elements colored during the image formation process or did this process also affect the primary cell wall of the linen fibers ?\nThe more I reflect on the question of the image chromophore, the more I realise that this is THE QUESTION that still wait to be scientifically answered !  I think the odds that there were absolutely no carbohydrates impurities on top of the fibers that were colored during the image formation process are EXTREMELY LOW, in regard of all the facts and observations we have concerning the Shroud.  Of course, there’s still the question of the exact composition of this thin layer of impurities that is still left open (because there can be more than some starch fractions there), but that’s secondary in my mind.  What is the most important question is this :  Along with a thin layer of carbohydrates impurities on top of the fibers, did the primary cell wall of the fibers (partially composed of other carbohydrates) was also colored during the image formation process ?  \nTHAT’S THE IMPORTANT QUESTION !  Finding the correct answer to this question could be a very big step in order to finally resolve the mystery of the image formation that took place on the Shroud…  If it’s just a thin layer of impurities that was colored without affecting the primary cell wall itself, like Rogers thought, then it would be very hard for those who proposed any energetic radition hypothesis to defend properly their hypothesis.  But if the primary cell wall was colored also during the image formation process, that would open the door much wider for those defenders of a supernatural phenomenon.  \nYou can easily see the importance of finding the correct answer to this question !  Unfortunately, in the present state of our knowledge about the Shroud, I think it’s fair to say that this question is still left open…  MORE DIRECT CHEMICAL ANALYSIS NEED TO BE DONE IN THE FUTURE (along with a close examination of the high resolution images that were taken during the 2002 restoration) !!!  Without those new analyses, it will always be impossible to answer this important question properly (with a correct degree of scientific certainty).\nNevertheless, Rogers arguments concerning the diimide, the ghosts, the banding effect and the extreme superficiality are strong enough to suggest that it was just a thin layer of carbohydrates impurities (residing on top of the fibers) that were colored on the Shroud and nothing else.  That’s why I still think Rogers hypothesis is the best we have right now in order to explain the body image on the Shroud.  I think this hypothesis just wait to be scientificaly confirmed completely…  That’s were I defer with Thibault’s opinion !  At least, he’s honest enough to not reject the hypothesis of Rogers concerning the image chromophore and, for this reason, I truly respect his judgement.  I don’t think I can say the same concerning those who have signed the list of M. Rolfe !\nP.S. :  Isn’t ironic ?  If it can be proved one day that what was colored on the Shroud is really a thin layer of carbohydrates impurities, then that would mean that the first researcher that will have contribute to this great discovery is man by the name of WALTER McCRONE !!!  Effectively, he’s the first one ever to have reported the presence of some starch on image fibers from the Shroud !!!  It was only later that Ray Rogers confirmed his finding.  HOW ABOUT THAT ?  That would be what I call “another big irony of the history”… :-)\n\n","date":"May 13, 2012 at 5:32 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11329","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Yannick, your very exhaustive reflections are most interesting!\nI see a difficulty with the impurities layer and it is the 3D effect. In this blog we have largely commented that the 3D effect of the image is obtained because the number of coloured fibers per unit area is different. The observed varying intensity of the coloured areas is due to the different fractions of coloured fibers affected and not to the different intensity in each fiber. In this sense, a fiber may be coloured and its neighbour not.\nThis is the explanation so far of the 3D effect. Now, if you locate the colourizing effect not in the fibers but on an impurity layer above the whole cloth, it is much more difficult to individualize the colourizing effect and describe it as a proportion of affected fibers since in my opinion, the impurities layer must have a continuity covering more than one single fiber and one would expect a more continuous pattern in the colour. I don`t know if Rogers ever addressed this issue….\nRegarding, the isotropy issue, I have been thinking about it,….. and yes, you might have a point….because the laws of fluid mechanics theoretically at least, could allow a vertical flow of gases from the body in a very slow laminar regime so that in a quiet and confined atmosphere, like the one between the shroud and a body there is a chance for that type of flow.\nThis could be easily simulated with any CFD code (Fluent, StarCCM+…..)\n\n","date":"May 13, 2012 at 6:59 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11331","author":"Gabriel","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"I think you describe pretty well the 3D effect.  But I don’t understand why the hypothesis of Rogers concerning the layer of impurities can be harder to explain this 3D effect than the primary cell wall.  It’s true that there is a discontinuity in the colored fibers on the Shroud and that one colored fiber can be next to an uncolored fiber.  But that discontinuity is as much hard to understand in the case the primary cell wall would be the chromophore of the image !  In fact, I even have a tendency to think that it would be even more “natural” to have a discontinuity of the impurities on top of each thread.  I’m not an expert like Rogers on this question and I don’t remember if he talked specifically about that…  But, in my mind, since the impurities would have been put on top of the fibers by 2 natural mechanisms, i.e. the bleaching and the evaporation-concentration process after the final washing of the cloth, I don’t think those natural processes would have affected each one of the fibers the same way.  In other word, I think it would be normal to expect that some natural processes like that would leave impurities on top of a fiber and none or almost none on top of the next fiber, creating a non homogeneous layer of impurities on top of the fibers.  In this context, I think we can expect that it was ONLY the fibers with enough impurities on top of them that COULD HAVE BEEN COLORED.  In other words, there was a minimum quantity of impurities that was needed in order to create a coloration that we could see.  If the next fiber didn’t have this minimum quantity, no coloration would have been formed.  I think this idea is pretty interesting and I hope you understand my thinking.  I would like to hear the opinion of an expert about that particular question.     \nOn the other hand, if we think that every fiber must contain roughly the same amount of carbohydrates in their primary cell wall, I think it would be VERY HARD to explain why a fiber would have react to form a coloration, while the next one would not !  You understand what I mean ?  The hypothesis of Rogers seem to fit more nicely with the discontinuity of the coloration since it is pretty evident in my mind that an impurity layer COULD NOT have been homogeneous on top of the fibers, since this layer was formed NATURALLY.  I think it’s safe to think that there was more impurities on some fibers and less on some other, while it is highly unlikely that there was a noticeable difference in the quantity of carbohydrates present in each primary cell wall of the linen fibers.\nIn that context, if we think the primary cell wall is the answer, then why there is a discontinuity in the coloration on the Shroud ?  Can a bleaching of the fiber can extract more or less carbohydrates from the primary cell wall and have the effect that the amount of carbohydrates would then be different from one fiber to the next one ?  I don’t think this idea is really credible, but, since I’m no expert, I’ll leave this question open.\nOne thing’s for sure : the discontinuity of the coloration on the Shroud, no matter the color reside on a thin layer of impurities or in the primary cell wall, is one of the most difficult aspect of the Shroud to understand.  But, because of what I said earlier in this message, I don’t think the impurity layer hypothesis is harder to defend versus that particularity of the coloration.  In fact, I think it’s the opposite !  What do you think ?\n\n","date":"May 13, 2012 at 8:08 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11332","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Yannick, honestly I don`t know but if I have to hypothesize, I would expect the impurities layer to have originated at the linen preparation stage, and in this sense to have approximarely the same density all over the cloth. If bleaching and dying is the origin of this impurity layer, to me it seems very difficult that changes of its density at a fiber level, as needed to explain the 3D EFFECT, may possibly occur. However, whatever the good solution is, I think that the impurities layer or the fiber theory should provide an explanation for the 3D effect and both facts are connected.\n\n","date":"May 14, 2012 at 2:48 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11335","author":"Gabriel","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"The impurities originate not from a dyng of the cloth but from the retting process and the way it was made (with starch) and also maybe the way it was washed.  I think all those things could have made that the impurities were not found on each single fiber of a thread in the same exact quantity.  But, like you, I’m not expert on this question.  But Rogers was and he was also fully aware of this discontinuity property and, nevertheless, he stayed with his hypothesis.  That should mean something !  But, like I said, nevermind the hypothesis you propose, it is one of the thoughest property of the shroud to explain.\n\n","date":"May 14, 2012 at 8:29 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11339","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Ok\n\n","date":"May 14, 2012 at 8:52 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11342","author":"Gabriel","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Oh Gabriel, I forget to comment another good point of your message.  You said : “because the laws of fluid mechanics theoretically at least, could allow a vertical flow of gases from the body in a very slow laminar regime so that in a quiet and confined atmosphere, like the one between the shroud and a body there is a chance for that type of flow.” \nI just want to let you know that, in his book, Ray Rogers talk specifically about that aspect of the problem and he reach a conclusion similar than you.  Of course, as you said, all this is theoretically for the moment…  I personally think that, to achieve naturally the precision of the image on the Shroud, it must have needed a very particular and favorable condition inside the tomb and around the body.  It seems almost impossible for a lot of people but not for me.  As I often say :  NATURE CAN REALLY BE SURPRISING FROM TIME TO TIME !!!  What I suspect about the Shroud is that the image was created because all the necessary conditions were reunite inside the tomb and inside the shroud.  That’s why I don’t think this kind of perfect image can be achieve with any dead body and any burial shroud.  No, on the contrary, I think it can only be achieve if very particular and favorable conditions (some of which still wait to be discovered, understood and described) can take place in one single place, at the same time…  That’s my feeling and I think one of those conditions is that it take a body that suffered a lot before dying in order to produce all the biological elements needed for the correct image creation.  That’s my feeling and, of course, I can be completely wrong about that.\n\n","date":"May 13, 2012 at 8:22 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11333","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Here there is an example of what further research on the shroud might be.  Simulating this with a CFD code is in 2012 straightforward.\n\n","date":"May 14, 2012 at 2:51 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11336","author":"Gabriel","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"I just want to add a little comment in order to clarify what I said here about the 2010 paper that Thibault co-wrote with Fanti, Di Lazzaro and some other members of the SSG, i.e. that it is, in my mind, an infamous paper and that it has all the appearance of a conflict of interest because of the hypothesis of the corona discharge defended by Fanti.\nI just want you people to read again the comments that Thibault wrote here.  What is the heart of his comment ?  That it is presently scientifically impossible to fully confirmed one hypothesis about the chromophore of the image, whether it is the one who state that the color is found in the primary cell wall or the other who state that it is only a thin layer of carbohydrates impurities that was colored on top of the fibers.  In fact, what Thibault said is this :  In the present state of our knowledge about the Shroud, we MUST considered those 2 hypotheses on the same level.  In other words, for him, those 2 hypotheses represent 2 interesting options to explain the chromophore of the image and that those 2 options possessed roughly the same level of credibility because both COULD explain all the observations and facts we know about the body image.\nIf the paper of 2010 would had said something like that, I would have absolutely no problem at all with it !!!  BUT…  It’s not the case !  When you read this paper, you can easily see that it push forward the first hypothesis (the one concerning the primary cell wall), while, at the same time, trying very hard to put the doubt over the hypothesis of Rogers (the one concerning the impurities).  That’s not at all the same thing than Thibault said here !!!  And, because this paper is clearly an attempt to push the primary cell wall hypothesis and almost tried, at the same time, to discredit Rogers hypothesis, than I consider it as infamous.  The term is maybe hard but what I really mean is that what is found in this paper concerning the chromophore of the image is NOT honest, scientifically speaking.  Thibault’s comments here are honest, but I’m sorry, not his 2010 paper.  And because this paper pushed so hard the issue in favor of the primary cell wall hypothesis, it is clearly an attempt to comfort the hypothesis of Fanti about the image formation process, i.e. the corona discharge (because an electric discharge like that can color just the primary cell wall of a fiber, just like UV light also can).\nThat’s why I wanted to denunciate this paper with a loud voice.  That’s all.  I hope you understand better my comments about this paper now.  It’s just not fair to favours more an hypothesis while putting great doubts over the other.  In the present state of our knowledge, we cannot do that and Thibault’s comments here just prove that it’s true !  In other words, this 2010 paper should have considered the 2 hypothesis on the same level of credibility.  But sadly, that’s not the case.\n\n","date":"May 14, 2012 at 8:31 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11340","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"-La existencia de la “pared celular primaria” es un hecho CIERTO.\n-La existencia de una capa de impurezas es una HIPÓTESIS.\n¿Pueden tener la misma credibilidad las hipótesis que se sustenten en ello?\n\n","date":"May 14, 2012 at 12:49 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11346","author":"corneliotel","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Rogers knew full well the existence of the primary cell wall and, when he analysed all the data concerning the body image, he never consider it as a valid option.  That doesn’t tell you something ?  And, by the way, the impurities are not an hypotheses !  McCrone found traces of starch on image fibers of the Shroud and later, Rogers confirmed that !!!  It’s a fact that there is some impurities on the fibers…\n\n","date":"May 14, 2012 at 1:03 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11347","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"As I said yesterday, in a previous comment posted here, if we start with this finding by McCrone concerning the presence of starch fractions on fibers from the Shroud (confirmed by Rogers later on), we have the right to ask ourselves 4 important questions :\n1- Did it was those starch impurities that were colored during the image formation process ?\n2- Did there was some other types of carbohydrates impurities on the fibers of the Shroud ?\n3- If the answer to question #2 is yes, then :  Did these other types of impurities were colored during the image formation process ?\n4- If the answer to questions #1 and/or #3 is yes, then : Did it was ONLY those carbohydrates impurities that were colored during the image formation process or did the primary cell wall was also colored during the same image formation process ?\nIn the present state of our knowledge about the Shroud, it is impossible to give a 100% sure answer to each one of these questions…  More direct researches need to be done !  \nBut personally, I found it very hard to convince myself that the starch fractions found on the Shroud were not colored at all during the image formation process, because, like Rogers said : “Starch and low-molecular weight carbohydrates from crude startch would color MUCH MORE EASILY than would cellulose (read : the whole linen fiber) as a result of either thermal dehydration or chemical reactions.”\n\n","date":"May 14, 2012 at 2:47 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11351","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Here is another question; Did Rogers find starch fractions/ carbohydrate impurities on the ‘actual image fibrels’ or non-image fibrels? …> Has this been clarified? … Because if they were not found on actual image fibrels, it is quite possible the image formation mechanism eliminated the (impurity layer) and also managed to colour the primary cell walls.\nRon\n\n","date":"May 14, 2012 at 5:13 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11352","author":"Ron","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Yes.  Rogers clearly state that the starch fraction was found on image fibers.\nBut your question Ron is good, nevertheless, on one point and that is the question to know if there was just impurities that were colored during the image formation process or also the primary cell wall, along with those impurities.  I think this is THE question that still need further investigations to be clarified.\n\n","date":"May 15, 2012 at 8:29 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11363","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"In my (updated) article I give a number of (new) reasons why a Maillard reaction would not have colored the starch-dye impurity layer:\n1. absence of (evidence of) reducing saccharides\n2. transformed alizarin of Madder explains the fluorescence peak shift in image areas, but alizarin can not be transformed by a Maillard reaction\n3. diffusion of gaseous reactants into the cloth would have produced a color gradient (Rogers and Arnoldi, Scientific Method, p. 5)\nAs to the presence of starch on image fibers: Rogers found traces, but Heller and Adler found none. This can be explained by the variation of color along long image fibers.\nSee “Internal selvedge in starched and dyed temple mantle – No invisible repair in Turin Shroud – No Maillard reaction”, http://jesusking.info/Internal%20selvedge.pdf , paragraph 2.2.1. and 4.2., respectively.\n\n","date":"May 15, 2012 at 9:52 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11367","author":"Adrie","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"This is your opinion Adrie (base on a speculative argument against the independently confirmed fact that there really his starch fractions on the image fibers).  \nRogers was truly an expert on those questions (much more than many other who pretend to be also “experts”).  So I personally choose to believe his conclusions regarding the chromophore of the image, until someone can scientifically prove that he was wrong.  We’re very far from being there !!!  And also, please don’t change the subject…  We’re talking about the possible image chromophore here and Rogers hypothesis concern a thin layer of carbohydrates impurities on top of the fibers.  We’re not talking about the hypothesis of the image formation.  It’s 2 different things !  Even if Rogers hypothesis concerning the Maillard reaction would be false (I don’t think we can completely discard it yet), that has nothing to do with the high probability that what was colored on the Shroud is simply a thin layer of carbohydrates impurities and nothing else !  There’s 2 important questions about the body image : 1- the question of the chromophore and 2- the question of the body image formation.  It’s evident that both questions are linked together but please, don’t try to discard the hypothesis of Rogers concerning the chromophore by saying that his Maillard reaction hypothesis is incorrect !  Those are 2 different things that should not be mixed up here because we only talk about the question of the chromophore…\n\n","date":"May 15, 2012 at 10:51 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11368","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Where image color is present on a fiber, it is uniform all around the circular surface of the fiber, but it needn’t be present all along the length of a fiber (Evidences, fact B15 http://www.shroud.com/pdfs/doclist.pdf ).\n     1. Heller and Adler deliberately tested image-type fibers – i.e. completely colored fibers – for starch, and didn’t detect it (A Chemical Investigation, p. 37, 43, 50). This is not speculative.\n     2. Rogers incidentally found traces of starch fractions when “testing for sulfoproteins in blood areas” (Comments on, p. 13-14 http://www.shroud.com/pdfs/rogers.pdf). Here, the tested fiber was possibly from a blood/image area, but it was not necessarily a completely image-colored fiber. The detected starch fractions may have been present on a not-colored length of it, perhaps even under the blood. Rogers added: “we should have tested for starch”, so he didn’t do any specific tests for starch on specific fibers then. His later remark in Scientific Method (p. 30 http://www.shroud.com/pdfs/rogers2.pdf ) “The hypothesis on carbohydrate impurities is supported by observations of traces of some starch fractions on image fibers” gives no specification or reference. This is not scientific.\n     3. Rogers’ book (p. 44) says McCrone “had found wheat starch on the Shroud”, but also here there’s no reference.\n     4. Kohlbeck found starch on sample 6-BF from the lance wound area, i.e. a blood/image area (http://holyshroudguild.org/dr-raes-problematic-threads_3.html , and Mapping of research test-points http://www.shroud.com/maptap2v.htm F=Front=Ventral).\nThese observations prove that, where starch was present on a fiber, and if this starch was colored, it was completely transformed by the image formation process. A Maillard reaction can not do this: it can not transform starch. It can not color the primary cell wall either. VUV-irradiation can color the primary cell wall (Di Lazzaro et al.,  http://www.acheiropoietos.info/proceedings/DiLazzaroWeb.pdf), and probably also starch if it is less stable.\nI added this to my article “Internal selvedge … – No Maillard reaction” http://jesusking.info/Internal%20selvedge.pdf (new 4.2.4). Thank you, Ron.\n\n","date":"May 18, 2012 at 6:42 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11415","author":"Adrie","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Concerning the question I asked, I have to say that, for me, the probability that the primary cell wall was also colored during the image formation process seem highly unlikely.  I say that on the basis of all the solid arguments that were put forward by Rogers, especially concerning the reduction of the color with diimide, the ghosts of coloration, the banding effect and the extreme superficiality of the image.  In the present state of our knowledge, those strong arguments from Rogers, suggesting that it was uniquely a thin layer of carbohydrates impurities that was colored, are VERY HARD to reject !  That’s why I say that the idea that the primary cell wall was also colored seem highly unlikely.  We have to constantly remember that Rogers knew very well this external part of the fiber and never consider it as a possible chromophore for the image.  That speak very loud to me.\n\n","date":"May 15, 2012 at 9:39 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11365","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"My friends, while I was searching in Ray Rogers book for some quotes he could have made about the discontinuity of the image, I found 2 quotes that I never noticed before and who can really PROVE that my interpretation of the word « cellulose » in Rogers writings was completely CORRECT !!!  In other words, my intuition was most probably right !\nI’m so glad I found those little quotes from Rogers because, now, the defenders of the primary cell wall hypothesis (who are often, at the same time, detractors of Rogers) will have much more difficulty to make believe that Rogers never thought about the primary cell wall as a potential chromophore for the image.\nFirst, I will give you one more time my personal interpretation :  As I said in my recent paper, for me, when Rogers was using the word “cellulose” (like in the phrase “The cellulose WAS NOT INVOLVED in color production”), he was thinking about the whole linen fiber, including his primary cell wall.  I made this interpretation without any clear reference to back it up, but nevertheless, I was almost sure of what I was saying.  Now, I’m completely sure !\nHere’s the first quote of Rogers that PROVE that I was right :  “The image is not simply a result of changes in the CELLULOSE (LINEN).”  You see ?  For Rogers the two words “cellulose” and “linen” were synonymous !  So, when I said that we can change the word “cellulose” in Rogers writings for the word “the whole linen fiber”, I don’t think I’m wrong !  Again, this little quote from Rogers, found in page 31 of his book, is a proof of that.\nAfter having said that, Rogers goes on and say : “Pure cellulose is relatively hard to color by CHEMICAL MEANS, but many common impurities on cloth can be colored much more easily.”\nHere, I know the sceptics will emit one objection, saying that the term “pure cellulose” mean that Rogers wasn’t thinking about the primary cell wall but just the internal part of the fiber.  But this interpretation is most probably false, simply because we know (see the 4 quotes I report in the last part of my recent paper) that Rogers knew full well the existence of this primary cell wall, along with his chemical structure and the way his components could react chemically.  And more than this, I even found one quote in the book of Rogers (in page 18) where he clearly made a direct connexion between the words “pure cellulose” and “linen” (exact quote is :  “pure cellulose (linen)”) !     \nSo, in this context, the fact that Rogers associate directly the words “cellulose” and “linen” in this quote from page 31 of his book make it clear that when he was talking about “cellulose” in his writings, he was refeerring to “the whole linen fiber” in reality.  And all the other quotes I’ve found concerning the term “pure cellulose” made it clear that, in Rogers writings, when he talked about it, he was meaning “pure linen fiber” in reality.  \nThe sceptics pretend that we would absolutely need a quote like “The primary cell wall was not involved in the image formation process” in order to be sure that Rogers had thought about the option of the primary cell wall in regard of the body image of the Shroud, but in reality, the quote I just discovered, when you link it with all the other quotes of Rogers concerning the chemical structure of the primary cell wall, make it very clear that this part of the linen fiber was never an option for him, even if he knew well about his components.  And I also found another quote to back up this interpretation !  Here’s what you can read in page 109 of Rogers book : “The image can be chemically reduced with diimide leaving colorless CELLULOSE FIBERS.  The color reside only on the surface of the fibers, and it is the result of conjugated double bounds.  The underlying CELLULOSE (LINEN) FIBERS are not colored.”  With this second quote that makes a direct link between “cellulose” and “linen fiber”, I don’t think we need further proof in order to realise that, for Rogers, the whole linen fiber (including the primary cell wall) was NEVER a valid option regarding the chromophore of the image !  I really think that those who have doubt that Rogers never knew or considered the primary cell wall as a possible chromophore of the image should really rethink the whole thing…  \nIn summary, those 2 particular quotes where Rogers clearly associate “cellulose” with “linen” or “linen fiber”, along with the FACT that he knew very well the existence of the primary cell wall, along with his chemical structure and the way his components could react chemically, is well enough to show that when he was using the term “cellulose”, in fact, he was refeering to the whole linen fiber (including the primary cell wall).  This finding is VERY IMPORTANT because, for Rogers, this primary cell wall, even if he knew well his chemical structure and his properties, NEVER represented a viable option to explain the chromophore of the image on the Shroud.\nSo, in order to understand better what Ray Rogers really had in mind, I give you again all the quotes that I’ve put in my recent paper where we found the word “cellulose” and I’ve changed it to “linen fiber” instead (in capital letters).  You’ll see, everything become much more clear !!!  \nHere’s the quotes (I’ve also add the 2 quotes I just discovered) :\n1-The image is not simply a result of changes in the CELLULOSE (LINEN).  Pure cellulose is relatively hard to color by chemical means, but many common impurities on cloth can be colored much more easily.\n2-The medullas of colored image fibers are not colored.  The LINEN FIBER was not involved in color production.  The LINEN FIBER of the image had not changed as a result of image formation.\n3-Heller and Adler found that the image fibers could be decolorized with diimide.   Reduction left colorless, undamaged LINEN FIBERS behind.\n4-The color reside only on the surface of the fibers, and it is the result of conjugated double bounds.  The underlying CELLULOSE (LINEN) FIBERS are not colored.\n5-Because chemical rates are exponential with temperature, the LINEN FIBER would react much more slowly than other carbohydrates.\n6-The color is only on the outer surfaces of the image fibers.  This suggest that the impurities were the result of cloth-production methods and they should appear on all parts of the cloth.  Until this time, we had assumed that the image color was a result of chemical changes in the LINEN FIBER.\n7-The evidence is strong that the image is not a result of dehydration of the LINEN FIBER by any mechanism.\n8-Since the LINEN FIBER was not colored, the impurities had to be significantly less stable.\n9-The image spectra were essentialy identical to those of aged linen and light scorches.  The structures of all forms of dehydrated carbohydrates would be very similar, containing complex systems of conjugated double carbon bonds.  LINEN FIBER is not unique.  Sugars and starches give the same types of dehydration/conjugation chemical structures.  Identical colored structures are produced by low-temperature reactions between reducing carbohydrates and amines, i.e., Maillard reactions.\n10-A search for carbohydrate impurities on the Shroud confirmed McCrone’s detection of some starch fractions.  Starch and low-molecular weight carbohydrates from crude startch would color much more easily than would A LINEN FIBER as a result of either thermal dehydration or chemical reactions.  The hypothesis on carbohydrates impurities is supported by observations of traces of some starch fractions on image fibers.\n11-Any radiation that is energetic enough or suffisciently intense to to heat the cloth enough to cause the initial dehydration reactions of THE LINEN FIBER would penetrate into a fiber to a distance determined by its energy.  \nI think, I demonstate here, quite clearly, that, IN RAY ROGERS OPINION, the whole linen fiber, including the primary cell wall that he knew very well, WAS NOT colored during the image formation process.  If he never used specifically the words “primary cell wall” in his writings, it is because he never thought that this was necessary, since, up until that time, no one ever proposed this external part of the linen as the chromophore.  Here, we also have to remember one VERY IMPORTANT FACT : the cellulose is one of the 3 principal components of the primary cell wall.  In that context, isn’t that normal that Rogers used the general term “cellulose” in his writings, in order to include every part of the linen fiber, including the primary cell wall, in one single word ?  I really think so !  Now, with those new quotes I just gave you, I think it is very clear that, in Rogers writings, the word “cellulose” was used as a synonymous of “whole linen fiber”, including the primary cell wall.\nOf course, that doesn’t mean his hypothesis was correct.  But that means that Thibault Heimburger’s supposition that Rogers never thought about the option of the primary cell wall is most probably false… completely false !  On the contrary, the reality is this : Rogers knew this part of the linen fiber very well and all the observations and facts he knew about the image on the Shroud NEVER suggested him that the linen fiber (including the primary cell wall) had been colored.  Instead, what the corpus of data suggested him is that it was UNIQUELY a thin layer of carbohydrates residing ON TOP of the linen fibers that was colored, and nothing else.\nIn the same sense that the under the bloodstains, we found a clear undamaged linen fiber, for Rogers, it is the same exact thing regarding the body image !  For him, under the colored impurities, we also found a clear undamaged linen fiber !!!  In other words, for Rogers, the bloodstains AND the body images on the Shroud are both ADDITIONAL SUBSTANCES THAT ARE ONLY FOUND ON TOP OF THE LINEN FIBERS !  Isn’t that interesting ???  So, we can say that, if Rogers is right, all the images on the Shroud, whether it is the blood images or the body images, have NOT AFFECTED DIRECTLY THE LINEN FIBERS, including the primary cell wall !!!\nNow, after all the evidence I’ve found in the last days, if you’re still not convinced, then what do you think of this quote from Rogers : “The Shroud is nearly pure linen, but linen IS NOT PURE CELLULOSE like cotton.”  Personal note :  This new quote that I found this morning in page 54 of his book makes it very clear that he knew very well the exact chemical composition of a linen fiber (including the primary cell wall) !  Effectively, Rogers knew that a linen fiber, especially his primary cell wall, is not composed uniquely of cellulose.  As we already seen, the primary cell wall is mainly composed of 3 different elements, i.e. cellulose, hemicellulose and pectin.  On the other hand, the internal part of the linen fiber is mostly composed of cellulose.  So, we can see the importance of this last quote because it’s another very good indicator that Rogers knew very well the exact chemical composition of a linen fiber, including the primary cell wall, but nevertheless, he NEVER CONSIDERED this external part of the fiber as being the real chromophore of the body image on the Shroud.\nBefore I can conclude this long comment, I just want to say that I found the idea emit by Thibault Heimburger the other day, concerning the possibility that Rogers, even if he knew the existence of the primary cell wall, never thought about it as a possible chromophore of the image, highly unlikely.  One of Rogers quotes that you can find in my recent paper clearly show that, not only, he knew well about the existence and the chemical structure of this part of the fiber, but also, he knew well about the fact that some elements of it are more reactive than the cellulose.  So, I ask everybody  the question :  Keeping in mind the fact that Rogers knew all that was needed to be known about the primary cell wall in the context of the body image on the Shroud, do you really think for 2 seconds that he never considered the possibility that this primary cell wall could have been colored during the image formation process ???  After my exhaustive research in Rogers writings, I found this idea to be completely ludicrous, especially when you know how professional and perfectionist Rogers was when he did an investigation.  Thinking that he could have neglected an evident possibility like that is ridiculous, really.  It’s evident that he thought about it (how could he do otherwise ?), but nevertheless, he did not conclude that this part of the linen fiber, just like the rest of the fiber, was colored at all during the image formation process.  Again, this fact don’t necessarily mean that Rogers hypothesis concerning the impurities is correct.  But nevertheless, the fact that he never considered the primary cell wall as a valid option for the chromophore speak very loud, don’t you think ?\nTo finish, I also want to get back on something important that was said by Thibault in his last comment.  He said : “primary cell wall can explain…”\nHere, I have a very great doubt about that assertion !  In order to demonstrate that, I want to report one more time one important quote from Rogers : “Dehydration causes shrinkage; therefore, any coating of carbohydrate impurities would “CRAZE” during dehydration.  Such a crazed coating would be easy to pull off with adhesive, explaining the EASY REMOVAL of tapes from image areas.”  And elsewhere, Rogers also said : “…the surfaces (of the image fibers) appeared to be “CORRODED”.  That observation suggests that a VERY THIN COATING OF CARBOHYDRATE had been significantly dehydrated on the OUTER SURFACES of the fibers.”\nThose are important facts and observations the body image, reported by Rogers.  For him, those characteristics (i.e. the shrinkage, the crazing and the corroded aspect of the coloration) are all important aspects of the body image of the Shroud.\nNow, as I know, I’ve never seen ONE SCIENTIFIC PAPER published in a peer-reviewed journal that can demonstrate that the primary cell wall of a linen fiber that would be submit to a dehydration-oxydation process would produce those same characteristics and that the result would be that the colored fibers obtained that way could be removed much more easily with a sticky tape than non colored fibers.  Also, I’ve never seen ONE SCIENTIFIC PAPER published in a peer-reviewed journal that can demonstrate that if the primary cell wall of a linen fiber was colored with a dehydraton-oxydation process, part of the colored material could be left in the sticky tape while the rest of the linen fiber would be taken out, creating ghosts of coloration like we see on the Shroud…  I still wait to get some scientific confirmations of that.  If that could be achieved under good laboratory control, then we could start to think that the primary cell wall hypothesis offer some good matches with what we know about the body image on the Shroud.  But not before…  A good example of that is the fact that I really don’t think M. Di Lazzaro did any test on his colored samples with sticky tapes, in order to see if he could find ghosts of colored material still stuck in the tapes, like it was seen in almost every sticky tape samples coming from the Shroud.  I would really like it if M. Di Lazzaro could do some test in order to check out if his samples can really match this specific aspect of the body image of the Shroud !!!\n\n","date":"May 15, 2012 at 10:52 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11369","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Rogers’ (and Schwortz’) book A Chemist’s Perspective (p. 109) reads\n“A summary of observations …\n5) The color of image fibers was often stripped off of their surfaces. …\n6) …\n8) Image color can be chemically reduced with diimide, leaving colorless cellulose fibers. The color resides only on the surface of the fibers, and it is the result of conjugated double bonds. The underlying cellulose (linen) fibers are not colored.\n9) …” \nNow (I repeat), chemically reducing means ‘replenishing with electrons’, not ‘diminishing the size’. So, if diimide left colorless “cellulose”, this would mean that the top of the colored layer was cellulose, and there wouldn’t have been impurities at all. That is not what the author(s) had in mind (cf. their #11), and that is why it reads “cellulose fibers”, meaning linen fibers plus any impurities. In the last sentence – saying that “cellulose (linen) fibers” are under the colored layer –, the addition of “(linen)” excludes the impurities again and tacitly includes the primary cell wall, as being under the colored layer. This inclusion isn’t based on the diimide- or Ghost- or any other published observation.\n\n","date":"May 18, 2012 at 6:16 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11414","author":"Adrie","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"The link to my next comment of today has disappeared from the “Recent Comments” list (column on the right). It is https://shroudofturin.wordpress.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/#comment-11415\n\n","date":"May 18, 2012 at 7:08 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11416","author":"Adrie","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"For Ray Rogers, all those observations and facts (namely the diimide, the ghosts, the banding effects and the ultra superficiality of the image) were all clues in favor of the hypothesis that what was colored on the Shroud was UNIQUELY a thin layer of impurities.  Now, you can have a different interpretation and that’s your liberty.  But don’t say that, for Rogers, all those observations could mean something else than what he report in his writings, i.e. that it was most probably a thin layer of impurities that was colored on the Shroud and that the whole linen fiber (including the pcw) was most probably not affected by the image formation process.  That’s exactly what Rogers thought and I think his hypothesis is the best we have for the moment, even if it would need some confirmations…\n\n","date":"May 18, 2012 at 10:47 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11424","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"In the very last part of my previous comment, I realized I’ve forget to give you the complete reference of what Thibault really said.  To make things more clear, here’s his complete quote : “But recently, on the basis of the description of the primary cell wall by some experts, we found (in SSG) that all the known microscopic, macroscopic and chemical properties could be explained if the image were the result of some kind of dehydration-oxydation of the hemicellulose found in the pcw.”\nSorry for this little mistake of mine…  Have a nice reading and reflection !\n\n","date":"May 15, 2012 at 1:30 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11370","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Rogers’ starch/Saponaria/putrefaction amine hypothesis  – conveniently providing all the ingredients for a scarcely credible Maillard browning reaction – may have been a feat of human imagination – but it was emphatically NOT science. Why anyone should give it the time of day, far less write thousands of words in support, doth truly defy comprehension.\n\n","date":"May 15, 2012 at 1:57 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11371","author":"colinsberry","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"And why not?\n\n","date":"May 15, 2012 at 2:06 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11372","author":"Dan","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Why people are constently mixing things up around here ?  Hey my friend !  Wake up !  WE ARE TALKING ABOUT THE HYPOTHESIS CONCERNING THE CHROMOPHORE OF THE IMAGE HERE !!!  We’re not talking about the hypothesis of Rogers regarding the image formation process.\nThe fact that there are most probably impurities on top of the linen fibers and that it was those impurities that were colored doesn’t mean necessarily that Rogers hypothesis concerning the Maillard reaction is correct !!!  \nSo, please, can we concentrate on talks around the chromophore and forget the Maillard reaction for some time ???  \nAlso, maybe I should remind people that all my researches on the subject were done BECAUSE of the infamous pseudo-fact #1 contained in the list of M. Rolfe (signed during the Valencia conference) and who was considering for a fact that the “body image is created by molecular change of linen fibres”.  So, don’t blame me for all the talks on this subject these days.  Blame Rolfe and his gang of pseudo-scientists instead !!!\n\n","date":"May 15, 2012 at 3:41 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11375","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"I am not the moderator of this blog.\nBut Yannick did use words like “pseudo-scientists” , “gang” or …”infamous”.\nRegarding the JIST (PEER REVIEWED) “infamous” paper (the co-authors are Fanti, Botella, Di Lazzaro, Schneider, Svensson and myself), Yannick is completely wrong.\nHe wrote : ” because this paper is clearly an attempt to push the primary cell wall hypothesis and almost tried, at the same time, to discredit Rogers hypothesis, than I consider it as infamous.” and “And because this paper pushed so hard the issue in favor of the primary cell wall hypothesis, it is clearly an attempt to comfort the hypothesis of Fanti about the image formation process, i.e. the corona discharge (because an electric discharge like that can color just the primary cell wall of a fiber, just like UV light also can).\nThis is not true.\nThe only sentence regarding Fanti’s corona discharge is found ( in the discussion part of the paper ) in the sentence:  :”Fanti proposed an alternate image formation mechanism based on Corona Discharge that may be able to theoretically explain all the characteristics detected on the TS image, but is not able to reproduce all of them in a laboratory because the intensity of the required energy source is too high”.\nNo more.\nI would like to participate in this discussions but not on this basis\n\n","date":"May 15, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11378","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"I’m on it. Thanks, Thibault.\n\n","date":"May 16, 2012 at 6:35 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11381","author":"Dan","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"Further thoughts from this retired biochemist are unprintable – so best not to ask…\nHowever, you have contacts in the world of science, Dan. Show them the following key passage from a  Rogers’ publication .  Ask them if they think it is pukka science… (Try to ensure there are some chemists in your focus group. Explain that Rogers is suggesting, nay, specifying,  the provenance of reducing sugars for a Maillard reaction with gaseous putrefaction amines which according to him created the sepia Shroud image). Tell them that the Rogers’ hypothesis has almost acquired the status of holy writ in some impressionable quarters (like Adler’s bilirubin brainwave to account for that permanently red “blood”). \n“Observations of weave density and lignin content of the shroud fibres (Rogers, 2001)\nindicate a very mild bleaching technique in agreement with the methods described by Pliny the Elder (77). The same technology was in use, with some minor differences, until after the last crusade in 1291 (Hochberg, 1980). Linen was spun by hand on a spindle whorl. When the spindle was full, the spinner made a hank of thread. Each hank of thread was bleached separately, and each was a little different. Different parts of the same thread in the shroud’s weave show slightly different colours, like a variegated yarn. The warp thread was protected with starch during the weaving process, making the cloth stiff. The final cloth was washed in a solution made from Saponaria officinalis. Saponaria produces four glycosidic saponins, and all hydrolyse to produce sugar chains. (Ya Chirva et al., 1969) The following carbohydrates were identified in those chains: galactose, glucose, arabinose, xylose, fucose, rhamnose, and glucuronic acid. The presence of starch, in particular amilose (sic) , on the shroud was confirmed by the fact that during testing for sulfoproteins in blood areas with an iodine-azide reagent (which bubbles  vigorously when sulfur is present), a reddish background was formed.”  \nThat’s all I want to say…\n\n","date":"May 15, 2012 at 3:08 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11374","author":"colinsberry","site":"shroudstory"},{"title":"Comment of the Week by Thibault Heimburger","post":"The REALITY is this :  The heart of Thibault’s message here on the blog was that the 2 main hypotheses concerning the chromophore (Rogers hypothesis concerning the impurities and THEIR hypothesis concerning the pcw) are both of equal valor, and in the present state of our knowledge, it is impossible to know which one is the most probable.  This was the heart of Thibault’s message, even if his commentary about Rogers human nature can easily being decode like he has more confidence in the pcw hypothesis.  Note :  When I say “THEIR hypothesis”, I talk about the few people from the SSG (Thibault being one of them) who signed the 2010 paper and who is the first paper (to my knowledge) to ever proposed the pcw as a possible chromophore for the image. \nI want to say that I don’t have a big problem with the heart of Thibault’s message (the one I just report here), even if, as I said, I consider Rogers hypothesis to have been much more explained and to have been scientifically demonstrate in a more convincing way than the other.  But, in reality, the problem is elsewhere.  THE REAL PROBLEM IS THIS :  When you consider the heart of Thibault’s message here on the blog versus their 2010 paper, that’s NOT AT ALL the same thing !  Exactly !  The heart of Thibault’s message here is not at all what comes up in their 2010 paper !!!  THAT’S THE MAIN PROBLEM AND I THINK I HAVE THE RIGHT TO CRITICIZE THIBAULT AND AL. FOR THIS PARTICULAR REASON.  I’ll say it again, if this 2010 paper would have put the 2 hypotheses concerning the chromophore on the same exact level of credibility, I would have be okay with it.  BUT THAT’S NOT THE CASE !  This paper of 2010 clearly support the pcw hypothesis OVER the hypothesis of Rogers !  That’s why I gave a tough critic to Thibault the other day.  There’s a real gap between what he said here and what is the conclusion of their 2010 paper… \nAnd concerning the real appearance of a conflict of interest on the part of, at least, some persons who signed this 2010 paper, can I still emit some doubts ?  When you know that both Fanti and Di Lazzaro were promoting supernatural hypothesis concerning energetic radiations (corona discharge and UV light) LONG BEFORE writing this 2010 paper, and that both hypothesis fits much better with the chromophore being the pcw instead of a thin layer of impurities, I think it is quite legitimate that I have some serious doubts about the impartiality of their 2010 paper !!!  I think at least some questions should be raised concerning the appearance of a conflict of interest on the part of some people who signed this 2010 paper…  And I’m not talking about Thibault here.\nTo conclude my comment, here’s a message for Thibault :  When you put your name on top of a published paper like that, I hope you’re ready to get some critics and questions over it…  If you’re not, I think you should consider not signing any paper at all.  When someone go publicly on a delicate subject like the chromophore of the image on the Shroud of Turin, I hope this person is ready to take some shots…\nSo, I hope that will help to set the record straight…  \nI am not angry over anyone (even if sometimes my tone can be interpreted that way), but I feel I have to right and even the duty to ask tough questions and emit tough critics about a paper when I feel that it is legitimate for me to do so.  And in the case of this 2010 paper, I think there’s plenty of good reason for me to do so.  I’m just someone passionate about the subject who seeks the truth and nothing else.  And when I have some doubt over a paper and have a sense that this one have some appearance of a conflict of interest or have some bad approach, I don’t see why I should shut my mouth and don’t say a word !  We live in democracy no ?  If my hard critic of the other day has offended Thibault, I’m sorry and I apologize to him.  But I will not withdraw my words concerning their 2010 paper.  Sorry.  I just feel I have the democratic right to do so.  Now, if it’s not the case, I just want Dan to tell me and you’ll never see me again around here…\n\n","date":"May 18, 2012 at 3:40 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","id":"comment-11428","author":"Yannick Clément","site":"shroudstory"}]
