[{"title":"Sandcastles in Sciencebod’s sandbox","post":"Pope Benedict in his recent visit to the UK, made the point that “Faith without reason is fanaticism; Reason without faith is fascism!”  I recall that Albert Einstein made a somewhat similar observation.  Sciencebod is clearly a fanatic!  He puts his faith in kitchen puddling; makes a “leap in the dark”, throws in a few gratuitous insults and ad hominem arguments, and announces his predictable judgment of skepticism.  His is a sad case. We can only pray for him!  Perhaps reason may prevail with him one day, but I shouldn’t hold my breath!\n\n","date":"February 5, 2012 at 6:15 am","url":"https://shroudstory.com/2012/02/05/sandcastles-in-sciencebods-sandbox/","cat":"other_blogs","id":"comment-7951","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Sandcastles in Sciencebod’s sandbox","post":"I am curious to know why Paulette should consider me to be “out of my league” or “naive” in the interpretation of my own findings. What does this lady know about me or my cv to be so dismissive?\nI have to say her own recent performance on this site has been less than impressive. First she takes me to task for allegedly misaligning two pictures of the Shroud, ventral and dorsal, when in fact the result gave exactly the same outcome as can be seen over and over again in Google image files (search # turin shroud #). \nExample:   ventral v dorsal size disparity \nShe then tells me to consult what she considers a real authoritative paper on the subject, but which turns out to be a pdf submission to a Shroud conference in Richmond, Virginia 1999  which as far as I can establish has never been published in any refereed scientific journal (and I can’t say as I am surprised).\nFor her information, I am a PhD biochemist who has trained and examined other PhDs. I have a sizeable number of published papers, one of which – single author-  is still frequently cited (a “citation classic” in fact, several times over) in what was a new and exciting  research area, and arguably still is. I have also been called upon to referee numerous papers submitted to Biochemical Journal and to other reputable publications.\nMaybe Paulette and others feel I should hang up my experimentalist’s hat, and content myself with evaluating other’s data only. They are of course entitled to their opinion, but I will not be prevented from ‘doing my own thing’ by the putdown comments they post here or elsewhere. If they don’t like my blog, then there’s a simple remedy: don’t read it…\n\n","date":"February 5, 2012 at 11:32 am","url":"https://shroudstory.com/2012/02/05/sandcastles-in-sciencebods-sandbox/","cat":"other_blogs","id":"comment-7955","author":"sciencebod","site":"shroudstory"},{"title":"Sandcastles in Sciencebod’s sandbox","post":"Dear Sciencebod,\n                               Everyone who has studied The Shroud has been introduced to humility or humiliation – I hope you make the joyful choice. The great part of the human race has no degree but can still discover logic & wisdom (for which there are no degrees).\n   Paulette was pointing out that you should have aligned the back and front images by the shoulder line – quite easy – because when the cloth was pulled over the front of the body it didn’t quite cover the feet.\n  I’m new to this blog, so I may be saying nothing original. Tell me!\n\n","date":"February 5, 2012 at 6:50 pm","url":"https://shroudstory.com/2012/02/05/sandcastles-in-sciencebods-sandbox/","cat":"other_blogs","id":"comment-7961","author":"Brendan","site":"shroudstory"},{"title":"Sandcastles in Sciencebod’s sandbox","post":"Very nice comment Brendan! …and yes sciencebod has had that explained to him several times, (about aligning the image properly) I mean, but it never hurts to say it again ;-)\n\n","date":"February 6, 2012 at 12:02 am","url":"https://shroudstory.com/2012/02/05/sandcastles-in-sciencebods-sandbox/","cat":"other_blogs","id":"comment-7966","author":"Ron","site":"shroudstory"}]
