[{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"So what do you make of the totally conflicting accounts re herring-bone (1-over-3) weaves, Matthias, with some saying it was commonplace in  1st century Palestine, Syria etc and unknown in Europe, and others saying it did not appear until medieval Europeans began looking for variety (at a price)?  When was the earliest herring-bone weave shown in works of art, say from the Byzantine period, or did it make a late arrival, consistent with a late discovery?\nIrrespective, that weave must have been a boon to medieval artists wishing to distinguish between shroud and other patterned or unpatterned surfaces in a 1st century cave tomb, especially as they had the quaint(?) idea that Joseph of Arimathea purchased not only a probably anachronistic variety of linen, but a sarcophagus as well, requiring its (patterned?)lid to be propped up at an angle to see an “empty tomb”. Interestingly the Lirey badge shows both herring-bone weave and what Ian Wilson interprets as the “empty tomb”, the latter again oddly sarcophagus-like. Whether it has a lid on top or something else (grid? grill?) is another matter. The Lirey badge is arguably the key for unlocking the mystery of the Shroud if you ask me, made all the more interesting by the recent discovery of the Machy mould – showing there were at least two or perhaps more pilgrims’ badges commissioned, and that the “message” was being subtly altered with time. Fine-tuning of the artwork? To what end? Grooming each new cohort of arrivals to view the Shroud in a new increasingly more ‘pro-authenticity’ way, while having to tread very warily (and as it turned out, unsuccessfully) to keep the Bishop of Troyes and other first-generation sceptics off one’s back.\n","date":"March 6, 2013 at 8:58 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1971","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Hugh, personally I wouldn’t read much into that. The epitaphios, if based on the shroud, could merely be a more finely detailed ‘fleshing out’ (pun unintended) of the vague image on the shroud.\nBut in a broad sense there are many similarities between the shroud image and the epitaphios – long, lean figure, hair similarities, small goatee beard, bloodied body (noting a bloodied Jesus in art circa 1300 AD was rare – it became more common through the 1300s most notably in Germany), and perhaps most signficantly a herringbone weave on some epitaphios\n","date":"March 6, 2013 at 7:58 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1970","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Well I agree, of course. However, there are those who claim that the “water stain” on the chest is reflected in the way the lower curvature of the ribs is drawn, as if every mark on the shroud has a representation on the picture, with the corollary that every distinctive feature of the picture (big eyes, forked beard, caved in abdomen) is derived from marks on the shroud. Thus the absence of prominent pecs on the shroud, compared to their prominence on the pictures, gives me pause for thought. Strange that one would want to “flesh out” the chest, while leaving the abdomen so scrawny?\n","date":"March 6, 2013 at 1:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1975","author":"Hugh Farey","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Something that’s been growing on me. Google “epitaphios” and you get dozens of pictures all looking in one way or another a bit like the image on the shroud. However, among the most prominent markings is invariably a deep line defining the bottom edge of the pectoral muscles. There are lots of other markings which may or may not be related to markings on the shroud, but the pectoral muscles are almost always very well defined on these images, and not at all on the shroud as we have it today. As we are frequently told that every tiny blemish on the shroud is faithfully reflected in all these early paintings, it seems to me odd that one of their most prominent features isn’t, in fact, there at all. Were they copying from a different shroud, one asks oneself…\n","date":"March 5, 2013 at 11:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1966","author":"Hugh Farey","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Re: Colin at 10.23\nDespite the limited artistry of the codex artist, he is quite good with some perspectives, especially hands. You will note that when the thumb is hidden in hands it is usually for a good perspective reasons.\n","date":"March 18, 2013 at 11:40 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2030","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"I thought hidden thumbs were supposed to be terribly symbolic – a spy clue to the illustrator having seen the Shroud before its first attested display in 1357 approx. So the relevant search has surely to be for any picture in the Codex where thumbs do appear, whether for perspective or other reasons. \nAnd as we know, thumbs DO appear – Plate 1(probably) and Plate 4 (certainly).  Ipso facto there can be no grounds for thinking that any significance can be attached to plates where thumbs are not visible – especially when, as you say, one would not expect to see them on account or perspective, or being obscured by the rest of the hand.\nIrrelevant aside: Yesterday I wrote the introductory post on my new ‘Dear Royal Society” blog and hit the Post now button.  It’s not been picked up as yet by the search engines, which is not a bad thing, since I’m having trouble getting the ‘voice’ right, to say nothing of the organization, so will shamelessly edit. It is being posted under http://www.shroudsummary.wordpress.com. I have John Klotz on TOS for putting some fire in my belly. I’d describe him as the kind of person we all hope we never turn into…   😉\n","date":"March 19, 2013 at 8:48 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2037","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Shroud “not widely seen or known”? Yet it was sufficiently well-known enough to appear hundreds of miles away in Hungary on the Pray Codex – or so we are told.\nWhat about the fig leaf convention in art? If plant anatomy can be used to avoid giving offence then why not human anatomy too – like crossed hands with unusually long fingers? \nBut this is missing the main point. The Shroud was not designed to reflect the then current conventions in art. I say it was  designed initially to serve some completely different purpose, probably black humour in an all-male ‘clubbish’ setting, probably as a visual metaphor of someone burnt at the stake. Adding clothes, even a loin cloth – would have made a nonsense of the metaphor (thanks btw for the appreciative words earlier re the barbecued human interpretation, an arresting way of showing how a barbecued Templar might leave a scorch on both sides of an up-and-over burial shroud,  which may or may not have been my idea originally). (Edited). \n","date":"March 5, 2013 at 12:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1963","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Actually the pray codex theory is not so far fetched. There were very strong familial ties between Hungary and Constantinople at the time the codex was created around 1200 AD.\nAlthough far from convinced by the codex – shroud  connection theory, I find it hard to dispel as well for a number of reasons\n","date":"March 6, 2013 at 10:26 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1972","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"To those reading this, not familiar with the Hungarian Pray Codex,the important thing  is to be wary about any claim until you have looked at all 4 plates in the series, and cross-checked for internal consistency.\nhttp://greatshroudofturinfaq.com/History/Greek-Byzantine/Pray-Codex/\nIgnore Plate V in the above sequence (script only) and beware siren voices that would have others believe one that one is deliberately avoiding Plate V, the one they claim which best makes their point (nail wound in wrist, bla bla). \nBeware also a particular website whose blogmeister  must, or should know that it is being used to disseminate mis-or disinformation on a daily systematic basis, and who opts to turn a blind eye. More generally, beware so-called blogs that are nothing more than PR shop windows, with links to satellite sites where the true purpose of the Mother (Brother?) Ship becomes abundantly clear.\n","date":"March 6, 2013 at 11:05 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1973","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"I think the ‘nail in the wrist’ bla bla is garbage!!!! BUT….I can’t ignore the following:\n– the image on the top of Plate 3 is quite ‘Shroud-like’ and certainly is a VERY rare example of Christ nude in artistic tradition\n– As mentioned previously there were VERY close ties between Constantinople and Hungary at the time, and there are teasing references to a shroud like object in Constantinople around this time\nNone of this means the pray codex pictures MUST have been based on the shroud, but to my mind it is a possibility that should not be dismissed.\n","date":"March 6, 2013 at 11:31 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1974","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"David Rolfe advised me to check out the recent TV documentary he did for the BBC, narrated by Rageh Omaar. It was ostensibly to see John Jackson doing his darnedest to whittle down, sorry up, the age of the Shroud, and making Oxford’s Prof Chris Ramsay feel obliged to check out Jackson’s wacky CO hypothesis (negative results, needless to say, which was entirely predictable from recalling undergraduate physics and chemistry). But in passing, we saw Ms. Mechthild Flury-Lemberg, the textile restorer, telling us that some inconspicuous little circles among the “herring bone weave” in one of the 4 Pray Codex illustrations were a “perfect match” for the L-shaped poker holes on the Shroud (they weren’t!). Shame it was neither shroud nor fabric of any description hosting those hugely diagnostic pen-drawn circles (looking more unmistakeably hole-like than any other tiny pen-drawn circles I have ever seen previously in my entire life 😉 but, sad to relate, merely the lid of a sarcophagus, which was patterned certainly, though not with a herring-bone weave. Towering oaks of mis- and dis-information from little acorns of mistaken sightings grow.\n","date":"March 6, 2013 at 3:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1978","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Re: your 6.02pm comment Colin.\nI interpret the cloth in the top image of Plate 3 as being a wide cloth. So not fully consistent with the shroud, which is a long narrow cloth.\nSo points are deduced in favour of the theory that the image may have been based on an eye witness viewing of the shroud. But it is still quite possible that the artist drew it based on an eye witness’s account, or a step further removed, and details about the precise nature of the shroud got lost in “Chinese whispers”. The fact is it does show a shroud that would wrap around the whole figure of Christ.\n","date":"March 18, 2013 at 8:57 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2024","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"whilst we are on this topic, it is also interesting that Christ’s image shows his hands with 4 fingers showing on each hand, like the shroud\n","date":"March 18, 2013 at 9:02 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2025","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"You need to divest yourself of that Shroud Center-approved tunnel-vision eye-glass Matthias. (You know, the one you received in the post from Dr.& Mrs.John Jackson).  Look at picture 4 (Christianity). Not only will you see the risen Christ still with a winding sheet (oh so 1st century), but he is now (miraculously?) back to a full complement of digits. Could this have been the first representation in Western art of the  ‘thumbs up’ gesture (“everything’s OK again, nice happy ending”)?\n","date":"March 18, 2013 at 9:37 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2027","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Enough of your Hungarian wraps-oddie, Matthias (ouch). Show me a pre-14th century*  up-and-over Shroud in the kind of prestige art you might expect to see in a national gallery – not some obscure manuscript illustrated with cartoon-like visual aids intended for those with a weak grasp of early Hungarian script….\n*  You get extra points for finding a herring-bone weave and nail wounds in at least one wrist\n","date":"March 18, 2013 at 9:18 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2026","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"don’t think the lack of artistic quality in the pray codex is that relevant. The fact is it has some characteristics, well depicted or not, that are shared with the shroud\n","date":"March 18, 2013 at 9:38 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2028","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Yes, but as I say, one has to look for internal consistency in the 4 pictures, so if one has no thumbs, and another does, then one can hardly cite “lack of thumbs” on one’s never-ending Jones’-style laundry  list of “correspondences”.\nI see there’s a discussion on TOS about that letter “a”, apparently New Age Latin script for that period of Hungarian history. I’m in the mood this morning for some more out-of-the-box thinking. Merged into the dress of the Holy Mother(?) with the flask of oil, there’s that head of an elderly man. I seem to recall that has been interpreted by some as indicating the presence of God the Father. In view of the direction that head is pointing, ie. toward the (just?) vacated shroud, I wonder if he’s not there to represent a miraculous life-restoring breath from On High, and that “a” is some kind of letter that alerts the viewer to that idea of Paternal Assistance (PA for short). Just a thought.\nPS. Note the way the angel’s finger points straight at that “a”.\nAnd I have just found this, merely by inputting “latin word for life”, so was intrigued to see the bolded phrase:\nanima : “life” , “breath of life” , “the vital principle”\nMight that be “a” for anima?\n","date":"March 18, 2013 at 10:23 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2029","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"The blood?\nWhere the wrist is concerned, there is one possibility I mooted many moons ago. The metacarpal bones that are in the palm of the hand seem remarkably well-imaged on the Shroud (thus the wacky “X-ray story”, the ghost image of a hidden retracted thumb etc,  with wacky medics going to Shroudie congresses after swallowing radioactive technetium to show fuzzy pictures of their internal organs). Regardless of why that should be so, i.e.the X-ray look, it’s possible that the monk or whoever given the task of adding blood in all the right places mistook those metacarpals for finger bones (an easy enough thing  to do). He then decided to play safe, and place the blood well below the metacarpals, thinking that would be the location of the palm. \nBefore moving on to that second site – the back – perhaps I might ask you a question: if the Shroud image influenced early pre-medieval art to the extent that so many claim, then why didn’t the wrist become quickly adopted as the standard site for showing the nail wound?\n“Illogical” trickle of blood? Take a look at the Lirey badge, and see how that trickle is represented as something that looks nothing like blood, unless highly stylized (with little if any evidence elsewhere ot any attempt to stylize). If it were meant to represent stylized blood, from the lance wound as Ian Wilson blithely assumes, then why does it extend from BOTH sides of the sheet, rather than just the side with the wound? What’s more that same configuration may have appeared on the frontal image too if the Forgeais drawing of 1865 is a reliable indication of how the badge appeared shortly after recovery from the Seine. \nThere’s another entirely different explanation for the “blood belt” as Wilson describes it, one I’ve mooted before. It was originally the imprint of a chain, the latter being needed to secure someone to a stake before burning, as per Templars in 1314. It would have appeared on the Shroud as an image that was indistinguishable from body, if thermal imprinting (scorching) were the mechanism. Our medieval monk with his “blood” might have chosen to dab blood, or blood substitute, right on top of that “chain” motif, link by link, trying, not terribly successfully, to make it look even more like a complex blood trail. The rest as they say is history, or rather Ian Wilson’s rose-tinted version thereof! (I was much intrigued by your suggestion on TOS that the loops represent two entirely different flows from the nail wounds in the hands, NOT the side wound. Whether right or wrong it at least shows you too have doubts that so complex a trail could have come from a side wound, although I see that Fanti et al tried to do so at an Ohio conference – shame about their highlighting of the side wound which they can see, but at least one other person cannot).\n","date":"March 5, 2013 at 11:22 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1960","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"‘then why didn’t the wrist become quickly adopted as the standard site for showing the nail wound?’\nPerhaps because the Shroud was not widely seen or known. Perhaps because the biblical account of the wounds to the hands was dominant. One can also say that the nudity of the Shroud image was not adopted either, again probably because of dominant artistic tradition and modesty\n","date":"March 5, 2013 at 11:47 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1961","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Colin\nI struggle to see how that very thin / fine trickle of blood across the lower back might be ‘covering up’ a previous impression of a chain. On the Lirey Badge, the “chain” appears quite prominent.\n","date":"March 17, 2013 at 9:07 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2019","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"You may be surprised, or there again not, Matthias,  to know that I too have pondered  on the discrepancy between what we see on the Shroud, what we seem on the Lirey badge, and what we see on the “improved” drawing of the latter that Arthur Forgeais made in 1865. I don’t have any immediate answers – but it’s still near the top of my ‘To be pondered further’ list. The first priority in my view is to get independent corroboration of that ‘blood before image’ dogma. I’m 90% certain the image arrived before the blood, and it should be possible to find ways of scanning the Shroud to get at the answer (thinking of the techniques used to detect art forgery etc).\nWhat i find somewhat dispiritng Matthias is that in reading your comments above re that Pray Codex, it’s as if we have never had those previous discussions. I watched that BBC Rolfe documentary the other day, with M.Fleury-Lemberg talkign so categorically about the “L-shaped holes” on what she took to be the patterned Shroud, complete with herring bone weave. But for once it is I who has artistic convention on my side. That is not the Shroud with poker holes and herringbone weave. It is a (poorly executed) representation of the propped-up lid of a sarcophagus. It is not a herring-bone pattern, but squared-off zig-zag, . possibly representing a mosaic. I say it is not the face cloth in a heap on that lid – but a token representation of a biblical shroud ,  with no attempt to represent a 4 metres length of up-and-over material, because the illustrator had not seen the Shroud, and was making no attempt to incorporate coded symbols. Had the latter been the case we would have seen some consistency in the 4 pictures – but there is none relating to  the Shroud, certainly no attempt to flag it up as a cryptic influence in the design. But then who am I to comment on artistic convention?  I just look for a degree of internal consistency when confronted with artefacts, and try not to look for hidden meanings – that being a road that leads to insanity unless there are independent reference points (shame there’s only one surviving Shroud!)\nThat the Pray Codex is part  of the authenticity-promoting agenda – given credence by David Rolfe/BBC  in that agenda-driven commercial for Jackson’s Shroud Center –  Rolfe’s and Jackson’s – is something that really gets me down. How can people be willing to scrape the barrel using some tiny, badly executed line drawings in an otherwise obscure and instantly forgettable manuscript? i have had to abandon many ‘brilliant insights’ in my scientific career, knowing that it is highly improbable that controversy would or could ever translate into established fact. That’s why my narrative has been so consistent and unchanging over the months – not because I am unwilling to change my views, but because my ideas have already gone through a long process of critical reflection before they ever appear on this site, and even the ‘wackier’ ones like leech blood can account for several otherwise explained oddities re Shroud blood (lack of potassium, atypical porphyrin, no sign of blood clots, presence of a marker for connective tissue (leech?), ability to be applied as a non-coagulating paint, possible the “permanent red colour” due to exotic haem species generated from having spent weeks or months exposed to digestive juices, bacteria etc.\n","date":"March 17, 2013 at 10:30 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2020","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Colin\nI’m not interested in a debate on the lower image on the pray codex. You might be right that what some proponents claim to be the shroud is actually a sarcophagus lid, although the L shaped pattern of holes IS rather curious, in my view. I’m not interested in debate of a minute nature, whether it is the farcical so called “nails in the wrists” of the later images in the pray codex or whatever.\nThe fact remains that the upper image does show a naked Christ with hands folded over pubic area, seemingly being anointed and about to be wrapped in a double length shroud. As I’ve said before there were very strong connections between Hungary and Constantinople circa 1200AD, so it is not fanciful in the slightest that the pray codex artist may have based the image on the shroud located in Constantinople, whether he had seen it with the naked eye, or heard of its characteristics from a witness.\n","date":"March 17, 2013 at 11:04 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2022","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"A double length of Shroud? Well, i raise my hat to you Matthias for being able to make sense of the picture to which I think your refer. I see two quite separate lengths of fabric. There is one under the body that I would not have described as double length. It is single length, albeit with some detail at the mid point that might be interpreted as a some kind of fold over point, but lacking the prerequisite of length. Then there’s the long narrow strip of what I presume is a ‘winding cloth’ that intertwines around the arms etc of the people in attendance. I really can’t see how anything in that picture can be construed as a representation of the Shroud, not even an approximate one. But as I say, I look for more substantial evidence, one way or the other, for authenticity. Hunting for clues in particular illustrations is simply not  a valid exercise, at least in a statistical sense. You would presumably reject the radiocarbon dating on the grounds that one strip from a corner is perhaps not representative of the whole, so why imagine that one particular picture’s features are proof that at least one person had really laid eyes on the Shroud, and had wished the world to know that by incorporating “tell tale ” clues that are in fact given far too much over-interpretation through modern eyes, given there are probably hundreds of similar depictions in manuscripts etc of the period. \nMy focus is now mainly on what came first – blood or image. If the image arrived first, the Shroud’s bloodstains could not have been acquired via a narrative based on the New Testament. The blood would have been painted on – by a medieval forger intent on turning a fairly simple image of a naked man into that of a crucified man, made to fit  the highly detailed, indeed unique Biblical description of Jesus of Nazareth (crown of thorns etc).\n","date":"March 17, 2013 at 6:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2023","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"apologise for my poor typing above!\nThe epitaphios of Salonika, of King Milutin, and of Thessaloniki are all credibly dated to 1300-1320AD\n","date":"March 5, 2013 at 11:21 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1959","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"OK\nI don’t have epitaphios evdience to hand, the university libary has Schiller’s a classic text on Christian art, I’ll check in on that when I’m next in at the Uni.\nYou are right many epitaphios date from about 1400, but there are at least 2 examples I have seen that are circa 1300 or sligtty earlier.\nBTW tthoughts on my blood comments?\n","date":"March 5, 2013 at 10:56 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1958","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Got in to the university today and viewed Schiller’s authoritative “Iconography of Christian Art”. It showed the epitaphios housed in Venice, dated 1200 AD.\nThe epitaphios is kept in the museum of St Mark at the Basilica of St Mark in Venice.\nyou can view a very small image of it here at the museum website:\nhttp://www.museosanmarco.it/tesoro_tessile/eng/ricami.bsm#\nclick on ‘see the images’\nThe museum dates it to late 1100s / early 1200s, so generally consistent with Schiller’s dating. \nOn the epitaphios which I viewed in Schiller’s volume, Christ’s body is covered in bloody wounds over most of the body , very unusual for the time. His hands are crossed over the pubic area. He wears a loin cloth, but this does not mean the epitaphios was not based on the shroud (you will of course know of at least 2 artistic ‘copies’ of the shroud from the 1500s onwards where the shroud image is shown with a modesty protecting loin cloth)\nIt’s impossible to say categorically that this epitaphios is based on the shroud, however there are certain congruences with the historical records of a similar time mentioning a full length image of Christ, plus the Hungarian pray codex of a similar time.\nIs it mere coincidence that this tradition of a bloodied Christ with hands crossed developed at this time, from 1200- 1300 AD? Is it irrelevant? Is there a historical / theological explanation beyond the possible influence of the shroud that could explain this development, which occurred outside the general Christian artistic tradition? (beyond these byzantine images a tradition of a bloodied / heavily wounded Christ did not really arrive until the 1300s in Germany)      \nOr was in fact the Shroud in Constantinople circa 1200AD, and then taken back to France? And this and other epitaphios were based on the Shroud?\n","date":"March 16, 2013 at 2:55 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2011","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"The ones I have seen in the same genre (in my case countable on the non-elongated fingers of one hand) show the wrists crossed, not hands, like the one on your ‘lament’ picture. So  the backs of the  palms are visible on both hands.  If the artist had wanted to include nail exit wounds, then both bloodstains would be visible. But I don’t need to tell you that the Shroud has a palm over palm config’ – and while hesitant to say it (again) I suspect there was an element of mischief in the (pyrographic) artist’s intentions, wishing to portray a hint of the man while still alive, standing or kneeling over glowing hot charcoal, protecting himself as best he could.\nDid you see my before and after result with the clone tool, taking away the bloodstains (“Last Post”)? See what one is left with – not a single indication that the man had been crucified? Yet that is how STURP described the TS man in its executive press summary, while admitting it did not have a clue as to how the image had been formed (fail to seek hard enough and ye shall not find?) and having reported atypical blood with no red cells or even red cell debris, no potassium and an atypical porphyrin spectrum, with resort to highly tendentious hypothesizing re “extraordinary amounts of bilirubin”. Shame no numbers were given, shame that bilirubin was not quantified at all as far as I can tell (we would surely have been given some actual numbers, had that been the case).\n","date":"March 16, 2013 at 7:49 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2013","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"There’s also a chicken and egg question to be raised. If many these epitaphioses (epitaphioi?) were known to a medieval forger, then presumably he might have liked to copy their figures onto his sheet, selecting the bits he thought most realistic. The pre-1300 iconography of the shroud might have led to the shroud being the way it is, not the other way round. That does leave us with the interesting question of where the previous shroud pictures acquired their ‘standard form.’ The face, perhaps, from the statue of Zeus, the blood from the accounts in the bible, but the very long cloth (end to end as opposed to side by side), the double image and the hands crossed at the groin presumably started somewhere.\n","date":"March 16, 2013 at 10:30 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2014","author":"Hugh Farey","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Yes, we keep hearing how the burial interment conformed in every detail with 1st century Jewish ritual  – there is John Jackson’s wife – co-founder of the Shroud Center- stating as much on that  authencity-promoting BBC/Rolfe/Rageh Omaar video – shame about the bias- without specifying which of the Lost Tribes she belongs to. But has anyone in the Shroudoscopic blogospere ever made a sighting of an end-to-end  doubled-over shroud in a work of art – or figured out how that fits with the idea of a winding cloth? (Yup, I know about the selvedge theory, but can’t get terribly excited about one or two better-safe-than-sorry cross-ties).\nThere’s that scorch theory – you know, the one that is eclipsed neatly by most Shroudie  blind spots –  giving  an immediate explanation for the up-and-over shroud. It was intended as a visual metaphor for a ‘hot body’ leaving a scorch top and bottom.  That’s why the Shroud image is a one-off, stubbornly refusing to reflect the rest of medieval “art” (being more evening school craft than art). That would explain the herring bone weave too (which I refuse to believe was a 1st century Syrian fad that just suddenly died out, such that it was “unknown” 13 centuries later in relatively prosperous France). The herring bone 1-over-3  weave  makes for a much better ‘tapestry’ on which to imprint a scorched image, given that the tops of the weave are then flat hyphen-like crowns, as distinct from the bitty hair pin ends one would have with a simple 1-over-1 weave.\n","date":"March 16, 2013 at 11:14 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2015","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"mmm, maybe Hugh.\nIt would be good to get an art historian’s view on this. I wonder what De Wesslow says about epitaphioi, if anything.\nI find it curious that Byzantine epitaphioi circa 1200-1300 suddenly show a heavily wounded Christ, with hands folded, seemingly out of nowhere in an art history sense.\nAs I said earlier, maybe there were theological / historical reasons behind this sudden artistic ‘revolution’, or maybe  they had seen or had heard accounts of the shroud.\nI keep an open mind on the answer.\n","date":"March 16, 2013 at 9:54 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2017","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"what do you both make of Robert de Clari’s account:\n‘But among the rest [of the churches in Constantinople], there was also another of the minsters [churches], which was called the Church of my Lady Saint Mary of Blachernae, within which was the shroud [or syndoine or syndoines: singular or plural] wherein Our Lord was wrapped. And on every Friday that shroud did raise itself upright [or stood up straight], so that the form [or features] of Our Lord could clearly be seen. And none knows – neither Greek nor Frank – what became of that shroud when the city was taken.’\nThis account was circa 1200AD I understand.\nGiven the development of a Byzantine epitaphios tradition from the same / similar time, with some quite Shroud-like features (ie. long, leanish Jesus, heavily wounded, hands crossed over public area, hair and beard characteristics similar to shroud) plus the Hungarian Pray manuscript (showing Christ being anointed on a roughly double length shroud, hands crossed etc) at the same time from Hungary which had a very direct family connection with the Emperor in Constantinople, I consider a degree of weight should be given to the notion that the shroud was in existence in Constantinople circa 1200AD, and that through either direct witness or second hand account generated both the epitaphios tradition and the depiction in the pray manuscript.    \n(Note – I keep an open mind! I still think your theory has potential Colin, but I also believe some of this historical information is quite interesting.)\n","date":"March 16, 2013 at 10:54 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2018","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"I think if I were compelled to appear as an ‘expert witness’ against authenticity i would say something like this.\n1) Early descriptions and paintings of Jesus were fairly inconsistent but were generally beardless.\n2) Round about 350AD some particular images gained popularity and authority, and were justified by being referred to acheiropoieta. Although there were fewer of these, they still lacked consistency. Some being bearded and some not.\n3) Round about 450AD the Statue of Zeus at Olympia was moved to Constantinople.\n4) After its destruction in 475AD, images of Jesus increasingly began to resemble it, in spite of at least one bishop claiming it was heresy to make Jesus resemble Zeus.\n5) Nevertheless, the Byzantine influence won, and beardless acheiropoieta went out of fashion.\n6) Several hundred years later, a ‘resurrection event’ was staged in Constantinople, consisting of a long cloth that emerged vertically from a mock-up tomb. The cloth was painted to resemble an image left on a shroud, following the conventions of the Passion Story, that Jesus was Flogged, Crowned, Stripped, Crucified, Speared and Entombed. All these elements were included, with the hands modestly covering the image’s nakedness. The face, of course, resembled the Zeus face that had already become standard.\n7) This new, full-length, image became so famous that it too became a standard form, and was immediately copied by Hungarians and whoever, sometimes adapting the image to suit local conditions.\n8) Either this image, or the nearest that could be found to a replica, became the Shroud of Turin.\nI don’t think this account is necessarily true, but it would act as a counterbalance to the Agbar-Edessa-Mandylion-Shroud account, and I think I could make it difficult for a balanced jury to decide on their verdict, even if they did come down on one side or the other in the end!\n","date":"March 17, 2013 at 10:46 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-2021","author":"Hugh Farey","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"Well, I’m fascinated to hear about those Greek images, Matthias, even if they have been dated almost to the 14th century.  Any chance you could provide a link? As for scorching, take another look at my banner, showing how thermal imprints, aka scorches, can be processed to give semi-3D images within seconds. Then take a look at the disingenuous pseudoscientific twaddle that Daniel R. Porter has in the margin of his Home Page, viz.  “But no one has created images that match the chemistry, peculiar superficiality and profoundly mysterious three-dimensional information content of the images on the Shroud”.(My italics)\nWhat’s better: experimental data from one blogger, freely available online, accompanied by ample photographs, showing how simple contact scorches can be processed to give Shroud-like images, OR totally false statements such as the one above claiming they cannot?\nAt the moment, I am in the business of counter-propaganda. I state that as my credo on my sciencebuzz site – and it’s made clear at the top of this one too. \nIf you want to see an egregious example of pseudoscience from one of the supposedly top men of Shroudology, published as an attack on me and scorching last March, then ask and I will publish here, under Comments, with a more complete answer than my first. Anyone else who wishes to see “pseudoscience” in overdrive can also ask to see my reply. I’d add it on to the post, but that is long enough as it is, and in any case I prefer to have a better balance between postings and comments (Thanks for your dropping by).\nOne final word: interesting though your comments and observations are, it’s time to draw a line under objections to scorching based on ” a wealth of other evidence”. That’s why I’m now determined to cut to the chase by placing the spotlight on one very simple question testable in principle: “Which came first – blood or image?”.  I don’t have the resources to provide answers, and I doubt whether any one particular lab does. It needs to be tackled using state-of-the-art instrumentation for probing fine details of surface structure (like some of those the Spanish commentator – Carlos Otal?- mentions on TOS from time to time). This is where the Royal Society could assist – or equivalent elite scientific bodies elsewhere.\n","date":"March 5, 2013 at 9:52 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1957","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"I will add that I think you present the best anti-authenticity theory to date. It offers a plausible explanation why the image is of a naked man (ie. in your theory the templar, having been burnt naked at the stake). Other anti-authenticity arguments fall down on this point – a forger trying to make an image of Jesus from the outset (as opposed to a tribute to a templar that was later fabricated into an image of Christ) would have certainly made a bas relief or whatever with a cloth around the mid region as the vast majority of artistic representations do\n","date":"March 5, 2013 at 9:39 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1956","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"There are a number of albeit circumstantial factors that make the theory that the Shroud image was created by scorching after 1314 difficult, most particularly existence of Greek epitaphios from circa 1280 – 1300AD with similar depictions of the shroud ie. a bloodied Jesus with hands folded over pelvic region on a herring-bone weave shroud.\nAlso, there are artistic / historic difficulties with the theory that blood was ‘added’. Why would blood be placed on wrist rather than hand? Why the illogical trickle of blood across the lower back (makes no art history sense at all). These are important questions which to my mind have not been satisfactorily answered by ANY authenticity skeptic.\nYour scorch theory may be right, and your historical explanation is certainly interesting. But there are still valid questions that can be applied.\nAlso what is the ‘abundant evidence’ for the scorch theory? Your own experiments? I want to see peer reviewed studies. Then “abundant evidence” can be claimed.\n","date":"March 5, 2013 at 9:04 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1955","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"I shan’t lose a minute’s sleep over the failure to “prove” it’s a contact scorch, Matthias, given that science works not on proof but on the weight of evidence. There is abundant evidence that the image IS essentially some kind of contact scorch. What’s more, it’s not too difficult to imagine why someone might have wanted  to produce a one-off image of a man scorched into linen, given the period of history (with Templars, probably stripped of their clothing, being roasted at the stake on an industrial scale, 1314 being the key date, just a few decades before the first public exhibition of the Shroud in an out-of-the-way  French village (Lirey). The herrring-bone weave, while expensive, was needed to ensure good imprinting of image, with its ‘1-over-3’ weave creating plenty of flat threads at the surface for image reception and adhesion.\nI personally would be losing sleep if I were a proponent of radiation being the source of energy, being unable to specify what kind of radiation can not only discolour the linen but produce an image too. Those issues do not seem to bother the Jacksons or the Fantis. At least Di Lazzaro recognized it would take highly energetic uv radiation to discolour cloth, but he has failed abysmally to produce an image, and has acknowledged that an impossibly large amount of uv radiation would be needed to produce one as large as the TS. (And it’s hard to see how a magical corpse radiating in the uv could produce an image of hair as well as skin – or is the hair of magical corpses especially resistant to being singed).\n","date":"March 4, 2013 at 11:52 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1954","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"I agree that the blood is important to the authenticity argument, but it is not necessarily critical.\nDon’t worry you are not disillusioning me. I don’t hang on every Shroud argument with my dear life.I have a passing interest in it.\nBut the fact remains that even if the blood was added – which is far from proven, and there are indeed a number of strong arguments for the blood’s ‘authenticity’ – the image could still be authentic. It would take sheer unscientific arrogance to dismiss that possibility, unless a bullet proof theory for the image was produced. In that respect, whilst you have an interesting theory, the evidence is far from robust enough to prove beyond reasonable doubt that scorching created the image.\nBut I am always happy to be convinced by a very strong, well supported case.\n","date":"March 4, 2013 at 10:54 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1953","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"How many true-believer Shroudies would settle for that Matthias? It would be like asking a teenager to be content with a meat-free hamburger…\nSeriously:if the blood was added later, how can you be so certain the figure had been crucified? You see, there’s something that is conveniently overlooked in mystery-seeking Shroudland: take away the blood and there are no images of wounds on the Shroud, like, you know – broken skin, lacerations, puncture marks, open wounds etc etc. You’ll see plenty of references to “wounds” as if they are a separate entity, distinguishable from blood. For what it’s worth, I personally have been unable to spot a single “wound” on the Shroud. That’s despite months of looking at close-up images (e.g. Durante 2002 etc) whose resolution is good enough to show clearly the herring-bone weave – so why not wounds as well? Answer: there are no wound images as such – just strategically-applied blood, or a more manageable blood substitute… \nThe Shroudie narrative depends entirely on those bloodstains to link the faint image on the linen with the crucified man in the gospels. His being crucified with nails is implied from blood, his wearing a crown of thorns – implied from blood – having first received 372 (!)skin-breaking scourge marks – implied from blood – and finally despatched with a lance in the side – implied from blood.  Sorry to disillusion you, but the base image, stripped of its blood, is simply that of a naked man, presumably dead, whose hands have been positioned to avoid looking like a page from Gray’s Anatomy.\n","date":"March 3, 2013 at 8:55 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1950","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"image first, blood second wouldn’t destroy the possibility of authenticity. The image might still be authentic, and the blood stains could be “add ons”\n","date":"March 3, 2013 at 8:17 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1949","author":"Matthias","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"We’ll worry about that when it happens, Chris   😉   Welcome to the site, btw. Apols if you’ve posted previous comments here.\nThe important thing right now is to recognize that the blood-first narrative-cum-dogma is absolutely essential for those who argue for authenticity. If blood came second, after the image, then authenticity is dead in the water, as I’m sure you must be aware.. Getting nervous, are we?\nDisproving the blood-first dogma is the ‘acid test’ of authenticity.  Acid tests are usually few and far between, and should not be deflected into the long grass. \nNow let’s turn the quest for yes/no answers on its head:  can you think of an acid test for medieval forgery?  Like, er, you know, shhh, that radiocarbon dating, that has already been nudged into a carefully-cultivated overgrown meadow?  If so, please let me know.\n","date":"March 2, 2013 at 11:45 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1944","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…","post":"And if it is established finally that blood came first?\n","date":"March 2, 2013 at 11:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","id":"comment-1943","author":"ChrisB","site":"colinberry"}]
