[{"title":"David Roemer will maybe present the Shroud of Turin at the Princeton Club in New York","post":"The benefit of attending my lecture about the Shroud of Turin is that I will explain the connection between the Holy Shroud, intelligent design, and the Big Bang. I don’t want to schedule a time at the Princeton Club in New York City for my own lecture because I am afraid no one would come.\n\n","date":"November 28, 2012 at 10:08 am","url":"https://shroudstory.com/2012/11/28/david-roemer-will-maybe-present-the-shroud-of-turin-at-the-princeton-club-in-new-york/","cat":"other_blogs","id":"comment-19589","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer will maybe present the Shroud of Turin at the Princeton Club in New York","post":"I have had a look at David’s blog and to say the least, I haven’t found very scientific opinions on evolution and the second law of thermodynamics. I don’t know his scientific credentials to support such “creative” approaches to for example, the second law, but  I bet that he also denies that a climate change is going on at this moment. It usually goes in the same pack….In my view, if he denies the authenticity of the Shroud, in view of the rest of things he supports, paradoxically, his denial truly becomes a strong argument in favour of the authenticity.\n\n","date":"November 28, 2012 at 2:30 pm","url":"https://shroudstory.com/2012/11/28/david-roemer-will-maybe-present-the-shroud-of-turin-at-the-princeton-club-in-new-york/","cat":"other_blogs","id":"comment-19604","author":"Gabriel","site":"shroudstory"},{"title":"David Roemer will maybe present the Shroud of Turin at the Princeton Club in New York","post":"I have a Ph.D. in physics from N.Y.U (1971) and have been trying to persuade the American Journal of Physics to retract an article titled “Entropy and evolution.” The editor of the AJP is using trickery to avoid taking responsibility for the absurd article, which contains a fake equation. My article explaining why the article is absurd was published in the Catholic Truth of Scotland. I assure you that even if you never heard of entropy or the second law of thermodynamics, you can understand why the article is a disgrace. My correspondence with physicists about the article is at \nhttp://newevangelist.me/2012/02/22/physics-department-of-new-york-university/\nhttp://newevangelist.me/2012/02/02/american-journal-of-physics/\nhttp://newevangelist.me/2012/02/23/american-association-of-physics-teachers/\nhttp://newevangelist.me/2012/05/06/american-institute-of-physics/\nhttp://newevangelist.me/2011/12/07/american-scientific-affiliation-2/\nhttp://newevangelist.me/2012/08/02/first-things/\nMy YouTube video titled “The Truth About Evolution and Religion” (http://www.youtube.com/watch?v=qKaF8vX6HXQ) also sheds light on this issue.\nThe following is a link to the article itself (Am. J. Phys., Vol. 76, No. 11, November 2008):\nhttps://docs.google.com/open?id=0Bw0xQqr5YbtJQ09ybDR0ejd2TTA\n\n","date":"November 28, 2012 at 6:24 pm","url":"https://shroudstory.com/2012/11/28/david-roemer-will-maybe-present-the-shroud-of-turin-at-the-princeton-club-in-new-york/","cat":"other_blogs","id":"comment-19608","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer will maybe present the Shroud of Turin at the Princeton Club in New York","post":"On number 12, the following appears: Face, negative image – That the blood marks are not smeared and the image is so detailed means that the Holy Shroud is a work of human ingenuity, rather than a naturally occurring imprint of a crucifixion victim.\nComments: I don’t think this statement, that it is the work of human ingenuity because of the detail, can stand under rational scrutiny.  No one in our advanced technological age can even come close to recreating most, much less all of the features of the Shroud.\nOn image 13 the following appears: 3-D – This is a computer recreation of the face image. The computer assumed that the image was determined by the distance between the body and a parallel plane. \nComments: This is not a computer recreation.  Rather, it is the VP8 Image Analyzer processing the image and producing a brightness map of the face which is an accurate 3D representation despite the fact that the VP8 does not make 3D images.  In a brightness map, everything that’s lighter appears higher in elevation, dark appears lower and middle range appears in between in depth based on the gradation of brightness.  This is the only image in the world that, when processed with the VP8, creates this effect.  All other image processing results in a distorted image, not a 3D image.  This means the image has corresponding height and depth based on brightness.\n\n","date":"November 28, 2012 at 10:19 pm","url":"https://shroudstory.com/2012/11/28/david-roemer-will-maybe-present-the-shroud-of-turin-at-the-princeton-club-in-new-york/","cat":"other_blogs","id":"comment-19614","author":"Andy Weiss","site":"shroudstory"},{"title":"David Roemer will maybe present the Shroud of Turin at the Princeton Club in New York","post":"Andy Weiss:\nPeople admit they have bad memories and are not extremely intelligent, but no one admits they have bad judgment. In my judgment, the not-smeared blood marks means it is highly probable that humans created the image using methods that have been lost to history. You should keep your judgment that the Holy Shroud is authentic to yourself because it is like speculating about how many angels can dance on the head of a pin.\n\n","date":"November 29, 2012 at 8:35 am","url":"https://shroudstory.com/2012/11/28/david-roemer-will-maybe-present-the-shroud-of-turin-at-the-princeton-club-in-new-york/","cat":"other_blogs","id":"comment-19631","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer will maybe present the Shroud of Turin at the Princeton Club in New York","post":"David R, I gather that you won’t admit to bad judgment on this. This comment makes no sense whatsoever, in my judgment, of course.\n\n","date":"November 30, 2012 at 10:40 am","url":"https://shroudstory.com/2012/11/28/david-roemer-will-maybe-present-the-shroud-of-turin-at-the-princeton-club-in-new-york/","cat":"other_blogs","id":"comment-19681","author":"Dan","site":"shroudstory"},{"title":"David Roemer will maybe present the Shroud of Turin at the Princeton Club in New York","post":"Dan: You are confusing intelligence with judgment. Intelligence is a measure of how much time it takes someone to grasp a theory and how well they can explain a theory. Judgment is needed when marshaling the evidence and deciding whether a theory is true or just probable. If my comments make no sense to you that means one of us is failing at the level of intelligence. Either you don’t understand what I am saying, or I am not expressing myself clearly or have an unintelligible theory.\n\n","date":"November 30, 2012 at 4:14 pm","url":"https://shroudstory.com/2012/11/28/david-roemer-will-maybe-present-the-shroud-of-turin-at-the-princeton-club-in-new-york/","cat":"other_blogs","id":"comment-19690","author":"David Roemer","site":"shroudstory"}]
