[{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Nine good questions…..but the sixth one is wrong.\n\n","date":"April 2, 2013 at 5:51 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29103","author":"Gabriel","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"I would say that the sixth question is not wrong, but the evidence for it has merely not been proven beyond all shadow of doubt.  Three scientists believed they had independently identified Jerusalem limestone.  Although they have not been proven correct, nor, as far as I am aware, have they been proven wrong.  \nThe main thing that struck me about Fr Longnecker’s site was the appalling degree of ignorance evident in many of the comments.  The myth about C14 tests proving a medieval age continues to dominate their thinking.  Only one comment set the record straight with a reference to the patch sample, but was totally ignored, and there was no mention of the lack of representative sampling, or failure to follow scientific sampling protocols.  These bloggers are following an uninformative site.\n\n","date":"April 2, 2013 at 6:10 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29106","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Oh, pur-lease!\nHear at Shroudstory we (even I, who only snuck in a little while ago) have gone a long way beyond the “if it’s not a fake, it must be real,” and “if you can’t do it your way, it must have been done my way” syllogisms typified by Fr Longenecker’s questions. Still, here we go.\n1. If it’s a fake why hasn’t anyone–even with modern technology–been able to reproduce it? — This question is identical to “If it’s real why hasn’t anyone–even with modern technology–been able to reproduce it?” Ignorance is not dispelled by an appeal to the supernatural.\n2. How did the forger not only know about photography in the Middle Ages, but manage to produce what is, in effect, a photographic negative? — The photographic negative effect would be an inevitable consequence of any kind of image formation, 1st, 13th or any other century, which depended on a chemical, radiation, or plain painting technique in which parts of a body closer to a supposed surface were rendered darker than those further away. \n3. The image is not painted, but “singed” or burnt on to the fabric. How did they do that?\n— “They” or possibly “God” did it by degrading the linen fibres. I don’t know how, but Ignorance is not dispelled by an appeal to the supernatural.\n4. The “burned” image doesn’t penetrate more than the surface level of the cloth. Paint would soak in wouldn’t it? — Not if it was very thick, or powdered on, or if the image is not a painting but formed by degradation of an existing substrate. (Incidentally, if you assert in Question 3 that the image is not painted, why do you raise the irrelevance of what would happen if it was?)\n5. When paintings are put into a 3-D replicator they don’t produce successful 3-D images. This does. How did the forger do that? — Any painting or photograph taken full-face, with front lighting and a dark background, reproduces the 3-D effect as least as well as the shroud, and sometimes better.\n6.  They found pollen and traces of soil from the area of Jerusalem. Did a medieval forger in Europe think of that and travel out there to get samples? — Even if your overconfident assertion is true, a forger might have had access to a cloth stolen during the crusades from Jerusalem, Constantinople and all points between, or the pollen could have arrived subsequently from reverent pilgrims pressing their own relics against the shroud.\n7. Are carbon 14 dating tests ever wrong? We’re assuming someone in the Middle Ages was a fraud. What if the modern scientists cheated? Its possible isn’t it? — Carbon 14 dating tests are always wrong, and have to be carefully calibrated to produce results which conform to other factors relevant to the date of an artifact. Yes, it’s possible that modern scientists cheated; even in the 13th century the world was full of clever people trying to fool others in one way or another.\n8. The man in the shroud was nailed through the wrists. Medieval artists showed Christ’s nails through his hands. How did the medieval forger know that the Romans nailed through the wrist and not the hand as people thought back in the Middle Ages? — No Roman skeleton, image or literature has ever been found that shows clearly where nails were targeted, and, although some pathologists (notably Barbet) demonstrated that nails through the palms would tear out, others (notably Zugibe) disagreed. If the victim were sitting or standing on some kind of rest the anatomical relevance disappears. Still others think the nails may have gone in through the palm of the hand and come out through the wrist. Although mediaeval painters were not necessarily anatomists, there are several examples which do show wrist wounds.\n9. The forger even got the details of the wounds correct because the flagellation wounds correspond not only to Roman flagella, but to the direction from which the two men would have whipped the victim according to Roman torture techniques. How did the forger know that? — Whips through the ages don’t seem to have changed much, and it does not take much imagination to guess that there might have been two scourgers, in which case one on either side is a rather obvious configuration. Specific details of “Roman torture techniques,” although much guessed at, are not archaeologically or paleographically verifiable.\n10. The pigtail at the back? It links up with the hair style of Jewish men who had taken the “Nazarite vow” in the time of Christ. This was some fantastic forger no? — The details of the Nazirite lifestyle are in the Bible. Apart from not cutting his hair, the Nazirite took a vow of abstaining from anything derived from grapes, including juice, wine, vinegar, raisins and the grapes themselves. It is fairly obvious that Jesus was not a Nazirite. Whether long hair was normal among non-Nazirites is often discussed, as St Paul seems to dislike it. I believe the idea that Jesus may have been a Nazirite started because of the lack of archaeological evidence for anywhere called Nazareth, although recently I think even this has been modified somewhat. Whether there is any semantic connection between the words Nazirite and Nazareth (and Nazarene, for that matter) is also discussed, but I think has been largely rejected.\n\n","date":"April 2, 2013 at 6:34 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29110","author":"Hugh Farey","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"I’ve never bothered to correct a typo before, but this one is just too embarrassing to let stand! “HERE at Shroudstory…” !!\n\n","date":"April 2, 2013 at 6:41 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29112","author":"Hugh Farey","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Father Longenecker seems to have got the idea that Jesus was a Nazarite because of the hairstyle. It is doubtful that Jesus would take a vow and even more doubtful that he would take pigeons to the Temple for blood sacrifice.\n\n","date":"April 2, 2013 at 9:03 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29126","author":"Louis","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Just a note to say ,re. Qu.6, that a significant proportion of medieval relics came from the Holy Land. One of the effects of so many people following Ian Wilson is that they have ignored the considerable amount of evidence for the import of relics directly into Europe from the Holy Land. It began, of course, with the transfer of relics from Jerusalem to Constantinople in the fourth and fifth centuries. Then, soon after the Arab Conquests, trade in relics from the Holy Land to Europe began. It is well covered in Chapter Ten of Michael McCormick’s Origins of the European Economy where he looks at a number of french collections from this period.\n Then vast numbers of relics, both from Constantinople ( 1204) and from the Crusades poured into Europe in the Middle Ages.  Some of these were of Islamic cloth which also traded as an item in itself. Clearly if you were presented with a new relic, evidence that it came from the Holy Land was a selling point which simply encouraged more imports. So far not a single of these traded relics has been shown to be authentic but, whether you believe the Shroud to be authentic or not ,if you are a serious researcher into it, you need to examine the large amount of documentation and evidence of the relics themselves that deal with relics coming from the Holy Land. I am amazed that no one seems to be working on this but I suppose that until  Wilson is dumped no one will start looking at all this mass of material that is much more relevant to Shroud research than anything Wilson drags up.\n\n","date":"April 2, 2013 at 9:17 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29130","author":"Charles Freeman","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Charles, you mentioned these cloths some months ago. The problem is that it is easier for someone interested in Shroud research, living in Europe, and with time and money, to follow your lead.\n\n","date":"April 2, 2013 at 9:58 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29134","author":"Louis","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"I agree, Louis , but I would have thought that someone might have done SOME research. Although I wasn’t working on the Shroud when I wrote my book on relics, I had no difficulty in pinning down a lot of sources, many of them online, about the relics trade . You can start with the very informative chapter cited above. Some Shroud researchers seem to spend so much time going over old ground that it would be good to see new avenues being explored instead.\n\n","date":"April 2, 2013 at 1:29 pm","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29143","author":"Charles Freeman","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"While, in my view, there is more in favour of the Shroud’s authenticity than against it, the lack of “proof” is what leads one to not express opinions in a dogmatic way. As you know,  the C-14 test has not been successfully challenged so far and Wilson, whom you mention, was the first one to recognise this in his last Shroud book, which contains a lot of useful information. The Church therefore is not in a position to say anything about authenticity with 100% certainty, as the recent statements by Turin’s archbishop made it clear. That also appears to be the reason why it seems there are people appointed by the Church to trace the provenance of the relic, to “fill the gaps” one could say, so I presume the new avenues you suggested above have not been ignored.\n\n","date":"April 2, 2013 at 2:47 pm","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29149","author":"Louis","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Interesting.\n\n","date":"April 2, 2013 at 9:39 pm","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29174","author":"Andy Weiss","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"IS THE SHROUD A HIMATION?\nRefer to this website, a himation is noted as being 4-5m long, and 1.2 to 1.5 wide\nhttp://members.ozemail.com.au/~chrisandpeter/radical_romans/snorri/greek_clothing.htm\n\n","date":"April 3, 2013 at 3:57 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29189","author":"Matthias","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Possibly. Adrie’s done a good job on this. Google “The Seam and Missing Corners of the Turin Shroud” for his latest version.The trouble with clothes, tablecloths and other material is that we have to be quite selective biblically. Mark specifically says Joseph of Arimathea “bought a shroud”  for instance.\n\n","date":"April 3, 2013 at 5:22 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29195","author":"Hugh Farey","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Thanks, had a quick read of the Adrie.\nMy hypothesis is different – Joseph bought a Greek himation, that was perhaps available from a Greek gentile district when most places were closed.\n\n","date":"April 3, 2013 at 7:49 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29205","author":"Matthias","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"any thoughts on this, theory that the shroud is a Jewish tallit:\nhttp://www.reginacaelipress.com/\nas far as I know there aren’t slits in the shroud though, so I’m not sure about this one\n\n","date":"April 4, 2013 at 3:33 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29267","author":"Matthias","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Not a chance. There’s a good old ding-dong about it here at https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/, which only just ends shorts of fisticuffs. Sadly, a publication “destined to be one of the most exciting books you will ever have read in Shroud literature” has already vanished into the ether and is no longer obtainable, but I think the ReginaCaeli blurb probably tells you all you need about it.\nThe only real point of interest is that Lupin, Adrie and one or two others do address the question of why a burial shroud should be long and thin rather than squarish.\n\n","date":"April 4, 2013 at 4:43 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29271","author":"Hugh Farey","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Response to Hugh at #3: \nI can agree that Fr L’s blog questions are somewhat simplistic, but judging from the comments there, he seems to be catering to the more simple-minded types and the superficial. But: \n(1) It’s not necessary to appeal to the supernatural to claim that the TS is authentic. \n(2) Your response does not deal with the question as to why any forger would want to produce a negative image.  Are there any other icons represented in the negative? I don’t think so! \n(3) Again it is not necessary to appeal to the supernatural for the TS to be authentic.\n(4) Powdered paint is a novel speculation. There are no paint chemicals present, except by minor contamination from contact by other copies (emulating contagious magic). \n(5) Emulating of 3-D from front lighting. I’m unaware of any corroboration of this assertion. \n(6) Pollen & limestone traces. You assign an insight to your medieval forger centuries ahead of his time. \n(7) The original blog appears to fail to identify the true reason for the faulty C14 results – a medieval patch and failure to take representative samples.\n(8) I disagree that there are several examples of painted wrist nails. The only ones I’m aware of can generally be attributed to being modelled on the Shroud (possibly Pray manuscript). On the examples you claim, can you say if the thumb is visible or not? Jerome translated the Greek word chiras as manus (hand), resulting in centuries of artists showing palm-nailing. A foot-rest or seat prolongs the dying trauma. Gospels recount that Jesus died in 3 hours, which surprised Pilate. A seat or foot-rest was therefore unlikely in Jesus’ case.\n(9) Scourging: The scourge wounds have clearly been inflicted by the flagrum unique to the Romans, of which various examples have been found. Scourge whips of other cultures seldom have dumb-bell pellets at the ends of a double-thong.\n(10) Long hair, pig-tail: Check Google for “Images Jewish rabbis”. All of them have long hair, except for the occasional liberal. \nPurpose of my comments above is merely to demonstrate that there is a reasonable limit beyond which professional scientific scepticism can no longer provide useful or sensible conclusions or rebuttals.\n\n","date":"April 3, 2013 at 5:25 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29196","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"‘not a chance’ -gee that is pretty decisive! I read that dialogue, and really it is a good heated debate between Jones and John. To me there is nothing in that debate that really discredits John’s theory. Maybe there is elsewhere.\nI quite like the idea that the shroud is a Greek himation. If Joseph ‘bought’ the linen, when Jewish stores were closed, then maybe it was from a Greek merchant who was still ‘open for business’.\n\n","date":"April 4, 2013 at 7:11 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29277","author":"Matthias","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"\nHugh Farey :\nAny painting or photograph taken full-face, with front lighting and a dark background, reproduces the 3-D effect as least as well as the shroud, and sometimes better.\n\nHugh, you have to be more specific, at least give an example of one single painting which contains 3-D information.\n\n","date":"April 3, 2013 at 10:08 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29214","author":"anoxie","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"I have found the thermographic image\n(http://en.wikipedia.org/wiki/Thermographic_camera)\nof some lizards under :\n\nBut the image of these animals [the scale is from 29.2 C to 42.4 C]  is\na bit defocused …\nPerhaps You have to check (or to glance at …) the works\nobtained by Giovanna De Liso in the past …\nTry under :\nhttp://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\nLook at the key and observe the snake …\nWhat is your opinion ?\nFor example, Thibault Heimburger (August 12, 2012 at 6:31 pm)\nwrote  :\n>The only persuasive set of images I have seen so far are those produced by Giovanna de Liso in her 12 years of experimenting and modelling in relation to seismic activity near Piedmont. They seem to satisfy most of the requirements of the Shroud image.\n>Her paper “Shroud-like image formation during seismic activity”; Giovanna de Liso; ENEA Frascati Conference May 2010″, can be found at: http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\nSorry … this is the same address that I have previously indicated.\n— —\nIn any case the idea (= … the 3-D effect as least as well as the shroud,\nand sometimes better) by Hugh Farey seems to be wrong …\n— —\nBut …\nI want to remember that in Italy there is an interesting example\n(about the space and the artistic representation) in Milan :\nSanta Maria presso San Satiro Milano (it’s a church with an illusory\nsystemation made by Bramante) :\nhttp://en.wikipedia.org/wiki/Santa_Maria_presso_San_Satiro\n>The choir, which had to be truncated a depth of only 90 cm (3.0 ft)\ndue to the presence of a main road, was replaced by Bramante\nwith a painted perspective, realizing in this way one of first\nexamples of trompe l’oeil in history of art …\nSo …\nTry to look under the two different perspectives :\n\nand","date":"April 3, 2013 at 12:15 pm","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29227","author":"Piero","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Piero, I’m pleased that someone else on this site recognises Giovanna De Liso’s work.  The gospels record that an earthquake occurred at the time of the crucifixion, and there also seem to have been some ongoing after-shocks.  I wonder if this was the cause of displacing the stone from the tomb entrance? Thank you for the reference to Thibault Heimburger’s supporting comments which I had not read previously.  No-one else has succeeded in producing such convincing images for all their chemistry and attachment to vapour-graph type theories.  Apparently they do not have earthquakes in Quebec!  All avenues need to be considered as possibilities. \nThe 3-D properties of the TS image go well beyond what can be achieved by perspective or other artistic tricks (trompe l’oeil).\n\n","date":"April 3, 2013 at 3:37 pm","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29240","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Dear daveb,\nI am curious about your opinion, because I have read the following words (pseudo-science ?):\n>Drbal explained the results of his razor-blade research by asserting, “That such an action on the dipole-molecules of water is possible in a resonant cavity, fed with appropriate microwave energy, was proved by the scientists Born and Lertes (see: Archiv. der elektrischen Uebertragung, 1950, Heft 1, s.33-35. ‘Der Born-Lertessche Drehfeldeffekt in Dipolfluessigkeiten im Gebiet der Zentimeterwellen’). It was found that the microwaves of centimetre-wavelengths and their harmonics can produce an accelerated rotation of the water dipole-molecules, and this effect can have as a result the dehydration process – the ‘driving out’ of water dipole-molecules from the smallest cavities and projecting them in the open air. This is exactly the process of electromagnetic dehydration.”4 Similarly, dehydrated cellulose of the Shroud fibrils is the cause of the image according to STURP, not paint, pigments, or other substances5.\n>Although not fully understood or accepted by mainstream science, some physicists do believe that the pyramid is, not only an accumulator of energies, but also a modifier of these same energies. It is recognized that any object in which energy vibrates is capable of acting as a resonating cavity. It is further speculated that this energy would affect the molecules, or crystals, of any object in the path of the beam of focused energy. Some even equate it to an invisible laser beam, having a different frequency and intensity …\n— —\nI beg pardon about the long passages.\nSource : http://www.gizapyramid.com/benford.htm\nI want to add that I read some strange words about the Bosnian Pyramid (= Visoko Piramida) See for example under the address :\nhttp://www.sbresearchgroup.eu/index.php/en/notizie-in-inglese/104-conclusion-of-the-conference-hidden-history-2012-in-visoko\n–> the presentation of Dr. Slobodan Mizdrak on the results of the experiment carried out in April 2012 on the apex of the Bosnian Pyramid of the Sun, for the evaluation of electro-magnetic and ultrasound phenomena (in English).\nand\nthen I am puzzled … about the true possibility of interaction with the linen sheet.\nBut we have to find the truth and then we cannot waste the time with all the puzzle-headed persons…  Do you agree with me ?\nWhat is your idea ?\nThere are no experiments on linen … !\n\n","date":"April 4, 2013 at 8:57 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29301","author":"Piero","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"As usual daveb adds the voice of impeccable reason to my histrionics. I think my overall point remains valid though. So many people begin with “If it’s a fake why hasn’t anyone reproduced it?” as if that was per se an argument for authenticity. The fact that it hasn’t been explained, whether its a fake or not, is not an argument for anything, unless one has recourse to the supernatural (and therefore by definition inexplicable naturally). There are plenty of good reasons for opting for authenticity, but not being able to explain how the image arose is not one of them.\nI agree that the concept of the negative image was probably beyond people in the 13th century, although some paintings age to produce an interesting solarised effect with which some people might have been familiar. But that’s not the point. If someone aimed at a “the closer the darker” effect, which is an easy concept to imagine, then a negative effect would be an inevitable consequence, whether the image maker knew about it or not.\nThe powder thing. Wasn’t that Joe Nicholls’s idea? I don’t think it’s new. Again, my point is that the answer to the bald question “paint would soak in, wouldn’t it?” argument (expecting the answer yes) is actually, no.\nThe 3D effect (response to anoxie too). I’ll email Dan some screen grabs from ImageJ. They’re not brilliant – but then neither is the shroud, and they certainly show the effect.\nThe sheet pre-sown with pollen and powder. Again, the forger didn’t have to know anything about it; if he used a sheet ransacked from the crusades, the pollen and powder might be there already. Actually, if Frie and friends are correct about the pollen coming from several very specific places around the middle east then that would be a very lucky choice of sheet indeed but then, as I say, pilgrims pressing their souvenirs against the shroud could also be a source.\nI don’t subscribe to the “dishonest 20th century scientists” hypothesis. I simply agree that it’s possible. Like the “dishonest 13th century forger” hypothesis.\nThe nails. Well I surrender completely here. The two examples I was thinking of (one in a Tres Riches Heures) and another in Assisi) turn out to be 14th century and conceivably based on the shroud. Both have no thumbs, and only three fingers on one hand!\nWell, it’s been an interesting search. Are you familiar with artbible.net? Hundreds of artworks on the life of Christ, and bless my soul, not a whip-thong in sight until 1280. Not necessarily based on the shroud, but it’s certainly interesting that up until that time pictures usually show bundles of sticks rather than whips.\nAnd finally the Nazirite. Fr Longenecke thinks depicting long hair is a sure sign of authenticity, but it’s not, as you so ably demonstrate.\n\n","date":"April 3, 2013 at 3:58 pm","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29245","author":"Hugh Farey","site":"shroudstory"},{"title":"Ten Questions for Shroud Skeptics from Fr. Longenecker","post":"Postscript: Pollen – Dead Sea halophytes & Anatolia, & Europe, (three different geographics) only an outside chance it could be pilgrims. But the dirt, (whether Jerusalem limestone as alleged, or otherwise) was under the foot (i.e. walking barefoot) and on the nose and a knee-cap as if from a fall as per gospel account. The dirt has been transferred from the body, an improbable coincidence that it was on the cloth in these specific locations beforehand. Point about the long hair and beard is that it is consistent with the usual religious practice of Jewish rabbis, as Jesus was often addressed as such.  It’s his!\n\n","date":"April 4, 2013 at 2:35 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","id":"comment-29266","author":"daveb of wellington nz","site":"shroudstory"}]
