[{"title":"Extreme Blogging","post":"Question-would flour have been detected on the shroud? I know that Colin’s flour imprint theory would not hold water because there are too many other questions he would need to answer especially the blood.\n\n","date":"June 28, 2015 at 7:59 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-203953","author":"don","site":"shroudstory"},{"title":"Extreme Blogging","post":"The blood is irrelevant here. Heller and Adler looked for but detected no starch on the Shroud. Rogers looked for it and found it. Either make up your mind before looking at their evidence and deride one or the other as an incompetent fool, or try to understand what was going on in all their minds and in all their laboratories to make them come to such different conclusions.\n\n","date":"June 28, 2015 at 9:41 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-203961","author":"Hugh Farey","site":"shroudstory"},{"title":"Extreme Blogging","post":"Anyone who looks at Colin Berry’s flour prints and think they bear any resemblance to the actual shroud image should see an optometrist for some new glasses.\n\n","date":"June 28, 2015 at 1:09 pm","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-203980","author":"Jim Carney","site":"shroudstory"},{"title":"Extreme Blogging","post":"There is a yardstick by which to judge other experiments being made. It is the experiments that were made by Dr. Paolo Di Lazzaro, described in:\n https://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\nNot long after this was published his work was highlighted in “National Geographic”.\nAs for the blood, Drs. Heller and Adler were serious scientists and published their findings in peer-reviewed papers.\n\n","date":"June 28, 2015 at 1:36 pm","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-203982","author":"Louis","site":"shroudstory"},{"title":"Extreme Blogging","post":"And now?\nNow we have another proof that the TS image has not been yet reproduced and remains a challenge.\nCB: ” Note the relative absence of lateral distortion.” Are you serious ? Lateral distortion is obvious.\nCB: “Do my imprints respond to 3D enhancement in ImageJ?Judge for yourself, dear reader:” I judge: not at all. How is it possible to compare the so-called 3D properties of Colin’s hands with the 3D properties of the hands of the man of the Shroud?\nAfter several years of researches and experiments, Colin, like many others, is unable to create an image similar to the TS image. It is a fact.\nYes, the TS image is an imprint, not a paint. But this imprint is very special. A direct imprint (no contact, no color) seems to be unable to explain the entire TS image. Some kind of “action at a distance” seems necessary.\nNickell, Allen, McCrone, Pesce,Garlascelli and many others and now Colin: all of them failed to reproduce the properties of the TS image.\nNo: the mystery has not been solved (even in principle)..\n\n","date":"June 28, 2015 at 3:35 pm","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-203990","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Extreme Blogging","post":"Now we also need some lines about why there really is blood on the Shroud.\n\n","date":"June 28, 2015 at 4:16 pm","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-203996","author":"Louis","site":"shroudstory"},{"title":"Extreme Blogging","post":"Thibault wrote: “this imprint is very special. A direct imprint (no contact, no color) SEEMS (upper cases mine) to be unable to explain the entire TS image. SOME KIND (upper cases mine) of “action at a distance” SEEMS (upper cases mine) necessary.”\nI believe more in plain common sense than alleged “big science” in terms of “archmiraculism” or “archfraudulism” as far as the Turin Shroud double bloodied body imprint is concerned. To claim there was “no contact” and the TS image image results from an “action-at-a-distance” force is misleading per se to say the least and totally biase the whole enigmatic image formation process issue. \nPlain common sense (or is it the Infinite Intelligence of LIfe?) tells me the TS bloodied body imprint most likely results from a contact-and-gradual-loss-of-contact formation process in conjunction with an external thermal source (with or without body hyperthermia). \nMost likely the sindon/himation used as an inner burial linen cloth was in-soaked with an alkaline water solution and thus providentially sort of “prepared” through halakha (Judean religious law here in terms of funerary customs, rites and practices) for transferring the dorsal and ventral imprint of the Jerusalem-limestone & Judean-desert-dust & lactate-residue-covered bloodied body to the inner surface of the fabric on taharah (the latter in terms of wrapping in ritually clean shrouds –an alkaline water solution in-soaked inner burial winding sheet and smaller dry outer shrouds + a much larger dry “all-enveloping shroud” or sovev in Hebrew, sudara in Aramaic–  and subjection to aloetic fumigation to make up for the anointing procedure and dry out the body) . \nMethinks a change of paradigm is much needed indeed to get out of the alleged “scientific” dead-end that tends to misleadingling promote “archmiraculism” and “archfraudulism” at the expense of plain common sense as far as funerary and forensic archaeologies are concerned.\n\n","date":"June 29, 2015 at 1:18 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204023","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Extreme Blogging","post":"Typo: as far as funerary and forensic archaeologies + archaeological bloodstain analysis are concerned\n\n","date":"June 29, 2015 at 1:21 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204024","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Extreme Blogging","post":"More typo: blodstain pattern analysis\n\n","date":"June 29, 2015 at 1:24 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204025","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Extreme Blogging","post":"Reminder: On June 9, 2015 at 10:24 am, I wrote in the hypothesis the TS man is Yeshu’a:\n“As a victim of a violent death, Yeshua’s body should be buried with his shed innocent blood and his POST-MORTEM blood could not be DIRECTLY cleansed. The use of alkaline solution along with (myrrhic-)aloetic fumigation) could account for potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal. Now these two signals precisely tend to prove the body could have been purified in accordance with an ancient (Judean) burial custom/practice. The true archaeological fact is there is more than one way by which blood could have become depleted of key ingredients if one considers the bloody body purifying & drying ritual scenario, which Adler clearly did not (crucifixion being an implicit assumption in all his discussion at the expense of specific burial practices, rites and customs). It is light-years’ far from proven yet the burial cloth was just draped about or loosely bound the TS man’s body and the image recording implies JUST ONE body-to-cloth configuration.”\n\n","date":"June 29, 2015 at 1:48 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204027","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Extreme Blogging","post":"Additional reminder: still on June\n“Most likely, the neat haematic cartography resulted from a sticking-gradual-unsticking transfer mechanism implying first the clean long inner burial sheet soaked in an aqueous alkali solution (made of living or rainwater + ashes and/or limestone dust) and tautly drawn lenthgwise back and front from head to toes, was compressed widthwise with shorter dry clean shrouds (othonia) as ALL PARTS of the body should be wrapped up (see Naḥmanides, Torat ha-Adam; Inyan ha-hoẓa’ah) and then, most likely, the tightly wrapped up bloody corpse was subjected to fumigation (see see 2 Chronicles 16:14 – 21:19 Targum) and the long inner burial sheet somehow got taut again back and front through drying out and shrinking .To his likley five-six buriers and (secret) disciples Yeshua was no am ha-arets (“average citizen) but a prophet (and even the Messiah) whose freshly dried innocent blood had been shed, and should be kept with his body and purify. \nIn the case here under study, Second Temple period speedy tahara in terms of wrapping in shrouds, purifying & drying out was an act of ultimate kindness to honor the deceased who died a violent death. It shall not be mistaken with careful physical cleansing Jewish/Judean ritual of a NON-bloody body.The (myrrhic?) aloetic fumigation rite temporarily made up too for the anointing procedure that could not have been performed on burial since grinding spices was not allowed on shabbat to prepare spicy oils. Actually the women came back to Yeshua’s tomb after shabbath JUST TO ANOINT/apply the spicy oil perfumes to his wrapping shrouds (NOT TO WASH, ANOINT AND tightly WRAP up his naked body in shrouds as it is currently misthought).\nIn the koine Greek Gospels, do you really read Yeshua’s shroud was just draped over or loosely bound? And, besides anointing, do you really read the women were to wash and tightly wrap up Yeshua’s body in shrouds/linens clothes on Sunday morning? Why the wrapping in shrouds/linen clothes SHOULD be read as ONLY metaphoric in the Gospels while the anointing procedure the women were about to perform on Sunday Morning SHOULD be read as referring not only to FACTUAL anointing to be but also to FACTUAL washing and wrapping to be (had Yeshua’s body be still in the tomb)? This implicit interpretative line makes no sense at all.”\n\n","date":"June 29, 2015 at 1:55 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204028","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Extreme Blogging","post":"How long will both archmiraculists and archfraudulists totally overlook  the true possibility of a shortened taharah in terms of wrapping in shrouds (more than two and most likely six), purifying & drying (via alkaline solution and fumigation) to account for the lightly mordanted blood looking red in natural daylight as if it had been shed the day before?\nHow long will they both totally overlook the long inner burial winding could have been wet/alkaline water based solution in-soaked and first firmly drawn taut lengthwise and widthwise over the head to the toes before being compressed widthwise?\nHow long will they be unfamiliar with Second Temple period funerary archaeology, Judean burial core procedures and archaeological bloodstain pattern analysis and totally overlook  the man’s volumetric bloodied imprint recorded on the inner side of his long inner burial winding sheet implies both an initial and final body-to-cloth configuration to account for the image formation process?\n\n","date":"June 29, 2015 at 3:21 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204033","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Extreme Blogging","post":"Typo: implies both an initial and final body-to-cloth configurationS to account for the image formation process?\n\n","date":"June 29, 2015 at 3:23 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204035","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Extreme Blogging","post":"Methinks “I’m a voice crying out in the desert” of archaeological plain common sense as far as the TS is concerned.\n\n","date":"June 29, 2015 at 3:34 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204036","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Extreme Blogging","post":"Re my theory solving the bloodied body imrpint formation process mystery in principle: \nOn June June 10, 2015 at 1:30 pm, I wrote: \n“Compression and gradual decompression induced collimation along with cloth-to-body sticking and gradual unsticking. The TS bloodied body image is the result of a self-collimated light mordancing extended to the back and front of the stiff rigid corpse of the crucifixion victim.\nAnd on April 30, 2015 at 10:56 am I also wrote:\n“(…) methinks the crucifixion victim’s ‘smooth wet and dust-covered textile skin’ (or ‘second skin’ aka his aqueous alkali solution in-soaked inner winding burial sheet now known as the Turin Shroud), tightly moulded over his dust-lactic-acid residue-freshly-dried-blood covered body, acted as an image enhancing membrane for accurately aligning (collimating) compressible and decompressible vapour flow and orthogonally moved in terms of body-to-cloth gradual drying/shrinking and unsticking front and back by means of the said flow as a thermal actuator.”\nReminder: Whether it be 3D printing of a crucifixion victim body between two sheets of an ancient linen cloth, small sprigs of fresh herbs, the fresh individual flowers and/or freshly caught fishes between two sheets of (blotting) paper, such a process requires moulding by either manually rubbing, pressing or compressing crests and valleys between the said sheets, moistening or remoistening (through a moisturizing ingredient as liquid medium) AND drying (in terms of external and/or internal thermal source). Note: Ammonia and/or lactic acid is present in eccrine sweat and urine and lactic acid is also produced through fermentation of plant derived carbohydrates and is an excellent moisturizing ingredient. \nEven in the case of the Jospice matteress cover image case, besides prolonged  exposure to moisture from sweat, urine + gradual drying through pre- and/or post-mortem hyperthermia and/or well heated hospital room, compression is involved (see Zubige: “a significant amount of weight was exerted on the hand from the weight of the body on the hand and in the shoulder area, the weight of the head on the lower part of the face area and on the shoulders”).\nBesides to claim the TS man’s stiff rigid blodied body was not FIRST compressed (in shrouds) and had no contact and acted at a distance (up to 4 cm) to yield a 3D imprint with minor distortions, is not only contrary to the Gospel accounts (Yeshu’s was wound, compressed fastened in his shrouds), to Judean funerary customs, pratices and rites but to facts of experience as well (the Volckringer patterns, Gyotaku images and Jospice matteress cover irrespective of the Antinoë Veil).”\n\n","date":"June 29, 2015 at 5:27 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204039","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Extreme Blogging","post":"Well my latest curiosity is the interesting imaging just to the side of the nose. It’s as if a cheek has been swollen and has come up into closer proximity to the cloth than the other cheek. I’ve just been on Shroudscope and it’s quite noticeable.\n\n","date":"June 29, 2015 at 5:44 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204041","author":"Thomas","site":"shroudstory"},{"title":"Extreme Blogging","post":"Methinks it is not so much body-to-cloth proximity than body-to-cloth duration of contact time due to the gradual sticking-unsticking process that shoud be taken into account in terms of bloodied body imprint volumetric recording on the inner side of the alkaline water based solution in-soaked sindon/himation used as a purifying long inner burial winding sheet.\n\n","date":"June 29, 2015 at 9:42 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204054","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Extreme Blogging","post":"Typo: sticking-and-gradual-unsticking process\n\n","date":"June 29, 2015 at 10:18 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","id":"comment-204058","author":"Max patrick Hamon","site":"shroudstory"}]
