[{"title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!","post":"We are at a real defining moment for the Catholic Church with the elevation of Pope Francis. He has already let be known that Catholics aren’t the only ones in Heaven (Whatever Heaven is. The eye has not seen etc.) \nAnd it was Pope Paul VI, not a loose canon reformer like the soon to be Saint John XXIII or this Francis guy (Thank God for loose canon popes!) who decreed that Jews could go to Heaven, too.\nAnyway, I can’t resist an old joke and I will make the principal of this story a female Episcopalian priest. Let’s call her Martha. Martha dies and goes to heaven and because of her work with the poor she is honored to be given a guided tour of the Celestial Realm by St, Peter. He points out to her the various rooms reserved in heaven. “In this room we have the Methodists. And in this room the Baptists and in this room, shh be quiet.” She obeys but as they have passed on she asks, “Why did we have to be quiet?”   “Well that’s the Catholics’ room and they think they are the only one here.”\nMy apologies for those demented Episcopalians who actually think that they are Catholics.  There are some.  Actually, anyone who lives a life of love is a Catholic, including not just Episcopalians, but Muslims, Jews,  Buddhists, Taoists, secular humanists etc.\nAt least that’s my opinion and I believe that’s Pope Francis’s also.\n\n","date":"December 15, 2013 at 9:03 am","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","id":"comment-59837","author":"John Klotz","site":"shroudstory"},{"title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!","post":"A small additional note. There was an American President named Abraham Lincoln (and his successors) who played a role in Mexican independence. That America’s later record in Latin America is somewhat reprehensible is of no doubt. But one of JFK’s principal accomplishments was the Alliance for Progress and one of the little reported stories was the ferocious internal struggle with those who regarded all Latin American reformers as Communists. Later on it was “Christian soldiers” of the CIA who put Pinochet in power in Chile. Sometimes I think that not only does Christ weep, he sobs.\n\n","date":"December 15, 2013 at 9:11 am","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","id":"comment-59840","author":"John Klotz","site":"shroudstory"},{"title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!","post":"John, since you have written about the mystery in JFK’s assassination this might interest you:\nhttp://www.irishcentral.com/news/Did-Irish-born-William-Greer-cause-JFKs-death-107915254.html\n\n","date":"December 15, 2013 at 11:20 am","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","id":"comment-59875","author":"Louis","site":"shroudstory"},{"title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!","post":"Louis,\nThat’s an interesting story.  There were some razy claims a few decades back that a picture actually showed Greer shooting at Kennedy. That was pure nuts. But the article you posted makes an interesting point.\n(1) Was Greer a conspirator,(2) just badly trained, or (3) did his slowing down have nothing to  do with Kennedy’s wounds. \nI end to (2) and (3) because there has to be a limit to the size of the conspiracy and I don’t know whther he car was solwed down at the time of the third (and possibly simultaneous fourth) shot. that ripped his skull open.\nThat might make some sense but it contemplates a conspiracy so vast that it would boggle  even my mind.\nIf I live long enough maybe I’ll tackle JFK again. However, my decision two years ago was to tackle the Shroud not JFK. The primary reason being that I think any contribution I may make will be longer lasting if not “eternal.” (How’s that for Holy Hubris).\nIn any event for anyone interested, my JFK piece which some long time JFK students have called the “best short summary of our position” ever printed. http://www.johnklotz.com/new-jfk.htm\nThe best piece I ever did was about Candoleeza Rice two weeks before GWB was inaugurated in 2001. It more or less warned that the lack of Internet savvy and the concentration on unilateral rather than bilateral solutions to foreign policy underestimated the power of the Internet and was arguable prophetic of 9/11\n“In some cases, superpowered individuals have the capability to wreak havoc on a scale unimagined before: witness terrorist leader Osama Bin Laden. In other cases, humanitarian goals have been advanced by coalitions of nongovernmental groups that national states, even the United States, ignore at their peril. Witness Jody Williams, who organized agitation for the land mine treaty, or the coalition of environmentalists, human rights activists and organized labor that stopped big power negotiations at the World Trade Organization dead in its tracks in both Paris and Seattle.” http://www.johnklotz.com/nlj10108.htm\n\n","date":"December 15, 2013 at 11:44 am","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","id":"comment-59883","author":"John Klotz","site":"shroudstory"},{"title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!","post":"John, I have downloaded your piece on the JFK assassination to read later. Something seems to say that there were “right people at the right time”, which is what goes to show that there was a conspiracy.\nKennedy came from a Boston Brahmin family, his father Joseph was ambassador to the Court of Saint James, he won a medal for bravery (as ensign,PT109), won a Pulitzer Prize for his book. But he was also Catholic, and that, as you know, was a problem for him, as it was for Al Smith. The fact that he was a statesman, not an ordinary politician, must have irritated many. People can take it for a while, hiding prejudices,but when power is involved and there is prejudice the scene changes.\nLook at Abraham Lincoln,who was a realist and wanted to free the slaves and keep the nation intact. He knew about prejudices but was not influenced by them. His best General, Ulysses Grant, was. Grant was worried that both Generals Sheridan and Sherman were Catholic…\n\n","date":"December 15, 2013 at 12:38 pm","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","id":"comment-59898","author":"Louis","site":"shroudstory"},{"title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!","post":"I managed to stir up a tiny firestorm on another thread of this blog by stating that Teilhard de Chardin was and is a heretic.  (Let’s amend that to mind-bendingly ‘heterodox’ since there are technical quibbles about what level of condemnation it takes to be a heretic.)  I certainly do not want to revisit that discussion, such as it was, but I do find it enlightening given comments about “Catholic wingnuts” and “Beavis and Butthead” monasteries.  Apparently Catholic conservatism is not in vogue here.  As I am not Catholic, I can hardly take that personally.  On the other hand, since Catholicism stands at the epicenter of our civilization, we’re all Catholic in a significant sense and all have a stake in its vicissitudes.\nAre there Catholic wingnuts?  In fairness, yes.  I’ve met some.  I’ve also met liberal wingnuts.  To say the least, many–to put it charitably–questionable claims have been made about certain objects in Mexico, and it does the cause of truth no good to associate them with studies on the Shroud.  Fair enough.\nThe case of the brothers Dimond seems to me to be somewhat different.  Say what you will, and agree with them or not, they have done a good deal of real homework on the issues they discuss.  They only seem radical because the post Vatican II Church has taken such a radically leftward turn.  In fact, a lot of what they do is quote pre Vatican II Popes.  And Councils.  And catechisms.\nBefore being so hard on them it is salutary to read in some detail about the infamous prayer meeting at Assisi, or to gaze upon the photograph of a post Vatican II Pope (“pope”?) kissing a copy of the Koran, in light of the settled doctrines and practices of the Church in centuries past.  Examples, non-trivial examples, could be multiplied into the hundreds, as the brothers Dimond do.  That they, and the pre Vatican II Church run counter to the spirit of the age is obvious.  That liberal Catholicism these days is trying to dance as fast as it can to the tune being piped for it by an all too questionable culture can hardly be in serious doubt.  (And yes I realize it can always point to certain social teachings on abortion, marriage, and so on–all to the good, but subject to serious erosion by the forces of political correctness within.  Indeed a philosophical analysis of its basis for attacking abortion can, and in my opinion does, serve to exemplify Nietzsche’s remark that the best way to attack a position is to defend it with weak arguments.  There are whole book length studies by legitimate scholars on how a liberal agenda tends to lurk within the Trojan Horse of conservative phraseology.  It is at least an issue.)\nGranted the Counter-Reformation Church, by the nineteenth century, could be seen as becoming a bit sclerotic and self-absorbed, there is nonetheless a question of whether the cure has been worse than the disease.  One post Vatican II Pope referred to it as the “smoke of Satan”.  As characterizations go, things can hardly get much worse.\nAs for the teaching of “outside the Church there is no salvation”, that was never intended or interpreted as excluding any non-Catholic specifically, granting that God could work as He will with respect to whomever He will.  Indeed, my own experience with the pre Vatican II Church was of tolerance, generosity of spirit, and great spirituality.  It was sublime.\nSo while you are, of course, free to disagree with the brothers Dimond, I think it is profoundly misguided to ridicule them, and by implication the deep pain felt by those who do not share what can legitimately be regarded as destructively liberal sentiments.  There are real concerns here of great import and they at least deserve respect.  A blog devoted to the Shroud should be able to manage that much.\n\n","date":"December 15, 2013 at 2:30 pm","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","id":"comment-59917","author":"R. H. Cahall","site":"shroudstory"},{"title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!","post":"The human psyche will always go its own way, and generate ideas that at first appear Beavis and Butthead outlandish. But yesterday’s heresy has a way of becoming tomorrow’s orthodoxy. The founders of the Jesuits, Dominicans and Franciscans were men well ahead of their time, but are now an integral part of the Catholic establishment.  \nI think the secret is the authoritative structure that an episcopal organisation provides, and which provides a moderating influence on extremes, in ways that cannot be provided in the more extreme versions of Protestantism. Think inerrant biblical literacy, Creationism, Rapture, and the poetic Book of Revelations as a literalistic game-plan for the end-time.\nHowever the Catholic episcopal structure sure screwed up, when it came to the likes of Savonarola and Martin Luther.  They failed there, and yet some good might well have come out of it otherwise.\n\n","date":"December 15, 2013 at 3:47 pm","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","id":"comment-59936","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!","post":"Reblogged this on Best of Shroud Story.\n\n","date":"September 19, 2014 at 6:04 am","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","id":"comment-152448","author":"Dan","site":"shroudstory"}]
