[{"title":"When it comes to the Shroud I am right and you are wrong","post":"Recently Pastor David Jeremiah gave a message on how Christ is being increasingly diminished and denied in our society AND even among Christian religious people. The more we conform to the demands (and doubts) of secular viewpoints, the more diminished Christ is:  and not only in society, but in our own personal lives as well. \nRecently you posted a bit by a Reverend who stated that it took courage to believe in the afterlife.  My goodness, has Christ been so diminished in this man’s life that he has a hard time believing even THAT?  This is a classic example of the erosion I’m concerned about. \nWe watched a new TV show last night.  They had blatant swearing: taking God’s name in vain. Characters used the name of Jesus as an angry expletive, and more than once. It was many times throughout the movie. \nThe Muslims do not allow their religion to be mocked or diminished. In some ways I can appreciate and even admire this.  At the same time, I’m glad that Christians are not so violent about defending their faith. (Most of the time anyway, I know there are exceptions which are not flattering.) \nJesus allowed himself to be mocked and diminished, tortured, slandered, humiliated. He let them do it. \nI’ve been collecting Jesus pictures: old illustrations. The pictures of Christ’s passion have really affected me, but not in the same way as Mel Gibson’s violent, brutal movie. Through the pictures I’ve seen how Christ was humiliated, and endured it. How he dreaded what was coming, so that in Gethsemane an angel had to come strengthen him.  I’ve seen more of the Lord’s inner struggle. It was excruciatingly difficult for the Lord Jesus to endure what he did. I wish Mel’s movie had been more subtle and showed us more of the Lord’s inner struggle, because that’s where the biggest battle (and the greatest triumph) took place. Jesus was not a victim: he endured it all and he did it deliberately so he could finish what the Father wanted for mankind. \nAs I’ve seen a small measure of this inner struggle, I realize with renewed clarity what an awful thing it is to diminish what Christ did for us. Considering what it cost Him, we as believers must not deny or downplay any part of what Christ accomplished. Rather, we need to speak it more clearly, more fervently and with more determination. \nThe real TRUTH behind the Shroud is NOT whether it is real or not: but that Christ really did die an awful death and was then miraculously raised to life again. It is an empty Shroud. There is suffering in what happened to Jesus Christ, but there is also certain Victory. Whether or not the Shroud is confirmed is not nearly as important as whether Jesus Christ is affirmed and confirmed within us. \nJohn the Baptist was a great prophet whose life and ministry had been long predicted.  But, when Jesus appeared on the scene, John the Baptist said, “He must increase and I must decrease.”  So it is with the Shroud: if it points the way to a greater Truth than itself, then the Shroud has been affirmed and confirmed by it’s fruit — and it doesn’t really matter if it’s real or not. The greater Truth is the one that must not be diminished.\n\n","date":"November 7, 2011 at 10:26 am","url":"https://shroudstory.com/2011/11/07/when-it-comes-to-the-shroud-i-am-right-and-you-are-wrong/","cat":"other_blogs","id":"comment-4639","author":"AnnieCee","site":"shroudstory"},{"title":"When it comes to the Shroud I am right and you are wrong","post":"Beautiful comment Annie! Seriously you should consider writing a book on your thoughts.\nR.\n\n","date":"November 7, 2011 at 1:30 pm","url":"https://shroudstory.com/2011/11/07/when-it-comes-to-the-shroud-i-am-right-and-you-are-wrong/","cat":"other_blogs","id":"comment-4644","author":"Ron","site":"shroudstory"}]
