[{"title":"Faith (and Challenge) in Our Age of Enlightenment","post":"“Age of Enlightenment.” Barf. Has anyone bothered to analyze how we became so “enlightened”?  As far as I can tell, it started with pure rebellion. The rebellion of the 60’s flared into a rejection of everything traditional, whether cultural or religious or even political. \nAnd now, for those of us whose lives span the 1950’s to the year 2011, we honestly don’t see any improvements in our world: cultural, religious and political affairs are much worse off since this experimental age of Enlightenment began. If they had actually accomplished something I might be impressed but I’m afraid that along with so-called enlightenment came greed and corruption which has nearly brought our country to ruin in the past 60 years. We were affluent due to the labors of that stuffy and traditional culture that the hippies despised. Now, analysts tell us we are facing a time of great austerity. We have ruined ourselves through the folly of our enlightenment.  \nYes, I agree that it’s time for mankind to get off the high-horse of their own wisdom and ask God for some of His. In James chapter 1, God says He will give wisdom liberally to those who ask for it.  We really need to start asking, IMO.\n\n","date":"July 14, 2011 at 2:20 pm","url":"https://shroudstory.com/2011/07/14/faith-and-challenge-in-our-age-of-enlightenment/","cat":"other_blogs","id":"comment-3342","author":"AnnieCee","site":"shroudstory"},{"title":"Faith (and Challenge) in Our Age of Enlightenment","post":"By the way, I do think that the human rights advances are worth noting as tremendous improvements. But I don’t think of the hippies as having done that. Human rights victories were won earlier by other soldiers and martyrs; and although there have been many victories since, the foundations were already laid for the most part.\n\n","date":"July 14, 2011 at 2:26 pm","url":"https://shroudstory.com/2011/07/14/faith-and-challenge-in-our-age-of-enlightenment/","cat":"other_blogs","id":"comment-3343","author":"AnnieCee","site":"shroudstory"},{"title":"Faith (and Challenge) in Our Age of Enlightenment","post":"Your comments are so on the mark, Annie, but sad at the same time.I personally have observed the same decent in the past decades and sadly I also see our societies, or whole world for that matter, going to shite…Problem is people need to believe before they will ask.\nRon\n\n","date":"July 26, 2011 at 8:54 am","url":"https://shroudstory.com/2011/07/14/faith-and-challenge-in-our-age-of-enlightenment/","cat":"other_blogs","id":"comment-3421","author":"Ron","site":"shroudstory"}]
