[{"title":"Who says science can’t explain the Shroud of Turin?","post":"Typo: “I AND my oven”.\n","date":"January 9, 2016 at 12:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6706","author":"Colin Berry","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"Update Saturday midday\nRighty Ho, Mutant Buzz. I am my oven have just developed thermographically  the image your requested, i,e, two fold, frontal v  dorsal aligned on the long axis head-to-head.\nI used LOTTO for the frontal side, and LUWU for the dorsal, the result bearing some interesting resemblance with the TS especially re “missed bits”  – what John Jackson called “discontinuities” notably as regards  the buttocks.\nThe present post is already too long, so I’ll be putting up a new one later this afternoon under the title: “Here’s how using white flour and  olive oil, one can quickly model the Turin Shroud”\nYup, sounds like kitchen chemistry I know, and indeed it is. That’s science bizz for you – the answer can often turn out to be a lot a simpler than one dared imagine (like 4 years ago, almost to the day).\n","date":"January 9, 2016 at 12:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6705","author":"Colin Berry","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"OK. I think I’ve figured it out, Mutant B. First I took another look at Shroud Scope, and traced what I believe to be a ‘baked-in’ midline crease from one end to the other, noting which half of the image – frontal or dorsal – had the more prominent crease.\nI then took a sheet of A4 paper, folded in half down the long axis, the fold to act as a guideline, and then decided how to imprint each surface, frontal v dorsal,  LUWU v LOTTO, so as to get best alignment of the two images along that midline fold, the latter  having conveniently left its signature on Shroud Scope.\nI could describe it in words now, or, if you’re prepared to wait a while, could try modelling the predicted result using linen and flour. I expect to get two well-aligned images, with one more completely imprinted than the other…\n","date":"January 8, 2016 at 8:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6700","author":"Colin Berry","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"Ah, you’ve flagged up the problem of keeping both images, frontal and dorsal, perfectly aligned relative to each other with regard to the long axis, MB. Any deviation, read wonkiness,  left or right would have immediately signalled “forgery”, so our medieval entrepreneurs had to get it right.\nWhile aware of the problem, it’s not one to which I’ve given a great deal of thought so far, mainly because I’m still uncertain as to whether the two images were obtained in the same presentation mode – template to linen, i.e. LOTTO or LUWU, or one in LOTTO, one in LUWU. \n LOTTO = Linen On Top, Then Overlay; LUWU = Linen Underneath With Underlay\nLUWU probably makes it easier to get the alignment right, but has downsides, like lacking manual control over precisely what relief is imprinted, especially hollows, and what is deliberately omitted. It also depends on the nature of the full-size template – whether a real bendy person or a rigid effigy that can be hoisted with ropes and pulleys etc.\nNow you’ve posted the challenge, I shall give some thought to the problem in the coming days (maybe weeks), and then try imprinting a two-fold imprint, head-to-head, as near perfectly aligned as possible. It could make the subject of a new posting, so here’s thanking you in advance, MB, for adding further grist to the mill.\nSorry I cannot give an immediate answer.\n","date":"January 8, 2016 at 4:54 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6698","author":"Colin Berry","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"Well done berry, can you do one that shows both sides, front & back, on the same cloth like the SoT does?\nfeet at the end head in the middle with the “fold” as the dividing line\n","date":"January 8, 2016 at 4:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6694","author":"Mutant Buzzard","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"From TH: “It is possible that this is due to the small size of your models.\nWhy not use a large model?”\nAre you aware of this image I published back in August of last year TH? It’s not only a negative image of my hand, but an actual semi-3D (bas relief) replica obtained purely by chance using wet flour slurry onto dry linen (a technique you criticized as giving imprints that weren’t fuzzy enough, , to which I responded with the dry flour/wet linen variant).\n\nI’ve added a postscript to this posting with that same amazing image. A hand is admittedly not an entire person, but I see myself as concerned less with life-size modelling, where the results tend to be judged on subjective/aesthetic criteria, as you yourself are doing, and more with establishing the scientific principles.\n","date":"January 8, 2016 at 7:01 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6686","author":"Colin Berry","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"Correction: It was dry COTTON,  not linen, as the in situ pen-written  label shows. How I wish WordPress would allow me to edit-out my own typos.\n","date":"January 8, 2016 at 7:06 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6687","author":"Colin Berry","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"Colin,\nI think you have to compare your image with\nthe hands of the Holy Shroud!\nIn other words: show us what is the result from\na comparison with the hand of the Holy Shroud.\nIn this manner we can understand what is the\nlevel you have reached with your attempt.\nIf you want to be honest with us, you have\nto show us what is this result.\nOtherwise your science can only be\nat level of a feeble “fairy tale”…\n","date":"January 8, 2016 at 4:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6696","author":"piero","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"I think your science can only be at level of a feeble “fairy tale”…\n","date":"January 8, 2016 at 4:25 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6697","author":"piero","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"PS. Sorry about the obvious typos above – WordPress still has not Edit facility on one’s own comments.\nHere’s something I did quickly in May of 2012, using charcoal to do a crude sketch of the TS (VERY crude).  When it was uploaded into ImageJ, then tone-reversed and 3D-enhanced,  it arguably began to acquire that TS-like luminosity and serenity, not necessarily more human-like, just more appealing in an aesthetic sense (while recognizing that aesthetics are highly subjective and as such outside the realms of objective measurable science.\nhttps://shroudofturinwithoutallthehype.files.wordpress.com/2012/05/before-and-after-cropped2.png?w=640&h=332\n","date":"January 7, 2016 at 10:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6682","author":"Colin Berry","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"Google Translate, French to English:\nPhotography (positive) of the Shroud image at face level is easily recognized as that of a face (at a distance) DESPITE the obvious contradictions with our daily experience of a human face. This is how our brain works: trying at all costs to make sense of what we see.\nOn the contrary, the negative of the photograph of the Shroud picture naturally restores an image that is completely consistent with our everyday experience of a real human face. Our brain does not need to make sense of what we see: the meaning is immediate.\nIt is a shame that I can not post pictures on your blog to show that.\nFor now, I do not see that in the different images from your experiences.\nIn other words, I do not see any negativity (in the sense of the image of the Shroud).\nIt is possible that this is due to the small size of your models.\nWhy not use a large model?\nWell, there’s one very obvious difference between the Shroud image, whether viewed the as-is negative, or the Secondo Pia tone-reversed positive.  Both of them lack the ‘directionality’ of conventional photographic images. That’s easily explained, of course, by the fact that we usually see real things and people by the light they reflect, i.e. their albedo, with the highest relief reflecting the most light, and, importantly, that the incident light that falls on the subject is invariably at a more or less oblique angle that creates shadows and thus the tonal contrast that allows us to perceive ‘3D-ness’. That is not the case where the TS image is concerned, so I’m at a bit of a loss to understand why you say that we perceive the as-is image as that of a real person. I certainly don’t, but I don’t worry unduly about that, for the simple reason that I see that image in scientific terms as a contact imprint where’s there’s no possibility of tonal contrast. So why one may ask the remarkably human-like look of the tone-reversed image, where we would seem to concur?\nWhile it looks human-like, everyone comments on a distinctive quality – the luminous soft-focus serenity of the image (“Christ-like” some might think). I would suggest there are two reasons for that. One is the removal of harshness when the tones are reversed, since the major topography of the initial topography is changed from predominantly dark to light, with the final denser tones having been promoted from what initially was white space.\nHowever, there’s another factor at work that moves us from the realms of science to psychology. If one takes an imprint by the method described here, one is getting a highly symmetrical capture of the topography around the vertical long axis of the subject, since the technique cannot discriminate between left and right as is the case with unilateral illumination in photography. I suspect it’s that bilateral symmetry that makes the TS image, the tone-reversed one especially, so unusual, dare one say subtly captivating.\n","date":"January 7, 2016 at 10:21 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6681","author":"Colin Berry","site":"colinberry"},{"title":"Who says science can’t explain the Shroud of Turin?","post":"Colin,\nAbout negativity.\nIt seems to me that we do not have the same definition.\nJe suis désolé mais je dois m’exprimer en français car les choses sont subtiles.\nLa photographie (positif) de l’image du Linceul au niveau du visage est facilement reconnue comme celle d’un visage (à une certaine distance) MALGRE les contradictions évidentes avec notre expérience quotidienne d’un visage humain. C’est ainsi que travaille notre cerveau: tenter à tout prix de donner du sens à ce que nous voyons.\nAu contraire, le négatif de la photographie de  l’image du Linceul restitue naturellement une image qui est totalement en accord avec notre expérience quotidienne d’un visage humain véritable. Notre cerveau n’a pas besoin de donner du sens à ce que nous voyons: le sens est immédiat.\nIl est vraiment dommage que je ne puisse pas poster des images sur votre blog pour montrer celà.\nPour l’instant, je ne vois pas celà dans les différentes images de vos expériences.\nEn d’autres termes, je n’y vois pas la négativité (au sens de l’image du Linceul).\nIl est possible que celà soit du à la petite taille de vos modèles.\nPourquoi ne pas utiliser un modèle de grande taille ?\n","date":"January 7, 2016 at 9:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","id":"comment-6680","author":"HEIMBURGER","site":"colinberry"}]
