[{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"Interesting take on the subject.  Growing up, I used to hear a similar argument regarding the creation of dinosaur bones and fossils by Satan to lure others toward belief in evolution.\n\n","date":"May 26, 2013 at 5:05 am","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-34858","author":"Kelly Kearse","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"Being a catholic myself, it seems like this pastor is very ignorant about not only bible history and church history but of also early Christian history. I’m sure glad that we have the writings of the apostolic fathers as well as the early church fathers. They were what kept me catholic when I was exploring tye different non denominational churches in my late twenties.\nMaybe this pastor should read about them before making typical anti catholic posts.\nOn the positive note its good that he has actually looked into the shroud of turin.\n\n","date":"May 26, 2013 at 6:29 am","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-34863","author":"Bippy123","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"He is a subtle beast, the father of all lies! He will mislead so that true relics will be believed false, and enable false relics so as to mislead the gullible and superstitious. He will hide the poetry of the holy scripture so as to persuade good people towards biblical literalism, so they will not then beieve the evidence of their own eyes, whether its dinosaur bones or fossil shells on the mountain top. He seeks to devour who he will. But he will be defeated. In Wellington, there is an officially appointed Anglican exorcist, but surprisingly he personally has no belief in the satanic powers he is responsible for exorcising. The Catholic bishop believes in satanic powers, but has not appointed a diocesan exorcist. Meantime, so long as we muddle along, Screwtape can continue to have his way!\n\n","date":"May 26, 2013 at 8:15 am","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-34869","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"Pastor Parker was one of the few who finally opened his eyes in the Bible belt region and took the right approach. The fundamentalists are not only reared with virulent anti-Catholicism, they also want to take everything in the Bible literally, as though it was dropped from heaven in King James English. The reasoning goes like this: Catholics are not guided by the Bible, but we are, and everything is true or nothing is true. When they realise that they were wrong the sense of frustration is so great that they become atheists and anti-Christian. Look at what Loftus, Price and Lüdemann are doing.\n\n","date":"May 26, 2013 at 11:15 am","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-34880","author":"Louis","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"Louis, a curious case is Bart Ehrman. He is credited with being one of America’s leadinig New Testament scholars, and is currently Professor of Religious Studies at North Carolina University at Chapel Hill. Youthful enthusiasm took him into fundamentalist Evangelicalism, convinced in biblical literalism. His desire to understand the Bible more fully took him into textual criticism and ancient languages. He was unable to reconcile “contradictions” in biblical manuscripts but remained a liberal Christian. His inability to reconcile philosophical problems of evil and suffering resulted in his eventually turning to agnosticism. Nevertheless he remains a dedicated New Testament scholar. His book “Did Jesus Exist?” I found to be quite excellent and illuminating, with several cogent arguments for the historical reality of Jesus, and demonstrating a widespread academic conspiracy to deny this.  I found a few errors in the work, but otherwise, I can certainly recommend it as a good read. He has a quite active blog site. His case I think demonstrates the point you make above.\n\n","date":"May 26, 2013 at 4:25 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-34901","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"Ehrman blog is not free, you have to pay to be a member and if you are not, you basically can not read anything.\n\n","date":"May 26, 2013 at 5:18 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-34905","author":"jesterof","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"You see, Jesterof, how Ehrman is contributing to the suffering he is complaining about. Not many have the money he made selling those books, undermining the faith of Christians, contributing to evil.\n\n","date":"May 26, 2013 at 6:01 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-34912","author":"Louis","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"David,I have read something by Ehrman and agree with you about his arguments for the historical reality of Jesus, but I have found the rest mostly unconvincing. The Irish ex-priest John Dominic Crossan —whose book on the historical Jesus I had occasion to review many years ago  — says that Jesus’ dead body was eaten by wild dogs and yet is is counted among the top Catholic scholars. Have you read Professor Luke Timothy Johnson’s “The Real Jesus”? It is a popular book, very easy to understand and he demolishes Crossan, Spong, Thiering (your neighbour!) easily. The three men cited in #4 are all ex-(fundamentalist) pastors.\nThe problem of evil and suffering is indeed a great problem, and most of those who believe in the Bible tend to sweep these topics under the carpet as it seems to be a more practical approach to them. We don’t appear to have any theological solution and this was exactly what caused the rift between two very close friends, C.G.Jung and the (Oxford Blackfriars Dominican) Father Victor White. It is known that Jung was strongly attracted to the Catholic Church — he hung a copy of the Shroud face behind a small curtain in his study — and needed White, was in fact thinking of him as his successor, but in the end the friendship sort of ended because of a misunderstanding. Jung wanted to visit White as he lay dying as a result of injuries sustained in a motorcycle accident in England, but his age and health prevented him from travelling and he asked the local Catholic priest to say a mass for White after his death. It is one of those great tragedies in the history of ideas.\nRegarding that statement by the Rev. Shafer Parker, he sounds a bit like Pope Francis I, and this,too, is a problem because it sound like a kind of dualism, more to do with Zoroastrian belief. The Lord’s Prayer has “.. but deliver us from evil..”, so that is evidently what every believing Christian should hope for every day, the ultimate omnipotence of God, rather than entertain the idea that Satan is laying down all the rules here.\n\n","date":"May 26, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-34908","author":"Louis","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"Thanks for your comments, Louis. I surmise that the only reason why Crossan postulates that Jesus was scavenged by wild dogs, is that it was the common fate of many crucifixion victims. However, I recall that Barbet was able to cite sources that families could request the bodies, and that permission would be granted as a matter of routine, except for the worst offences such as piracy, rebellion and treason. The taking of bribes to allow the release of bodies was considered a severe moral offence. The four gospel accounts are more or less corroborative, so that Crossan’s grounds for dismissing them seem somewhat flimsy. \nI had not encountered Barbara Thiering previously, but she seems to out-Pagels Pagels. Jesus scholar Geza Vermes commented on her work:\n“Professor Barbara Thiering’s reinterpretation of the New Testament, in which the married, divorced, and remarried Jesus, father of four, becomes the “Wicked Priest” of the Dead Sea Scrolls, has made no impact on learned opinion. Scroll scholars and New Testament experts alike have found the basis of the new theory, Thiering’s use of the so-called “pesher technique”, without substance.”\nN T Wright has written:\n“It is safe to say that no serious scholar has given this elaborate and fantastic theory any credence whatsoever. It is nearly ten years since it was published; the scholarly world has been able to take a good look at it: and the results are totally negative.” \nThe author of Revelations of course allows that Satan will be allowed to roam but will ultimately be defeated Rev 20:10.\nI have often thought that the Book of Job was the closest that anyone ever came to resolving the problem of evil, why bad things happen to good people. However its ending comes as something of an anticlimax, and I think there seems to be little subsequent development and resolution in a satisfactory way. Perhaps that is why it still looms large as an unresolved problem.\n\n","date":"May 26, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-34976","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"David, since Crossan was looking for a way to reject the physical resurrection of Jesus the wild dogs were handy for him and he could perhaps thus devote more time to looking for more background like Greco-Roman influence in Palestine or  the Mediterranean region on the whole.\nYou are also right about Thiering, who makes Pagels look like a devout Christian, and it was kind of obvious that in her case it was wild imagination.\nAn editor gave me Wright’s 850-page book on the Resurrection to read last year but there was a lot of writing to do and piles of other books on other topics to read so he had to be kept aside.\nIn my view Professor Vermes was never the best Jesus scholar, that honour has to be reserved for Msgr. J.P.Meier, although Fr. Anthony Kelly (your neighbour again!) has aimed at him. Vermes was sort of obsessed with Jesus and gave his approach a different slant, questioning the rationale behind the birth of Christianity and dismissing important NT accounts like the parable of the Wicked Tenants as an invention of the primitive Church. It was written all over the walls that his writing were mostly agenda-driven. Hopefully more about this and much more important viewpoints, all of it original, should be posted on the Internet shortly.\nAs you said, Job is still an unresolved problem. Leibniz never convinced many and the  efforts being made today to tackle the problem do not seem to be very promising. We will have to continue to live with these kind of things, using faith as a prop.\n\n","date":"May 27, 2013 at 6:56 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-35061","author":"Louis","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"Speaking of Dave’s neighbours how bout Lloyd Geering? Now I find this theologian odd, once a long time ago a minister, he’s now 90 something and apparently he still goes to church even though he is clearly an atheist. Geering makes Spong look like a fundamentalist (I have actually got quite a lot of time for Spong)\n\n","date":"May 28, 2013 at 8:01 am","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-35106","author":"matthias","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"I’m not at all surprised that Lloyd’s renown has spread well beyond these shores. He was born in 1918 and is now 95, and as far as I know aspires to be as reasonably active as any person can be at that age. He is widely regarded in NZ as the Grand Old Man of extremely radical Religious Studies.  Just Google on “Lloyd Geering” – the Wiki article is reasonably accurate, and you can see there that he enjoys several civil honours, including the Order of New Zealand and a knighthood.  He has been a remarkably prolific writer, the ‘Fishpond’ site listing several of his works. His radicalism outdistances the likes of Cupitt, Spong, Crossan et al by several miles. He has been a leading participant in the Jesus Seminar movement. Up until quite recently he was the principal pastor of ‘St Matthew’s on the Terrace’ in the central city, Wellington, a church formerly Presbyterian, but now given over to a ‘catch-all’ congregation. \nHe first came to public prominence in 1967, when as a Presbyterian minister, a conservative group in New Plymouth city charged him with heresy for denying the reality of the Resurrection, accusations of heresy being a not infrequent occurence in NZ Presbyterianism. The proceedings were extensively reported in the daily newspapers throughout NZ at the time, rather surprising in the officially secular state that NZ claims to be. He was eventually acquitted, but the extensive publicity had served him and his purposes well. It gave some impetus to the study of Religions in NZ universities. Unfortunately, part of his legacy will be to take NZ further down the road towards a national atheism, and a somewhat anti-religious bias, denying the founding missionary culture that has in fact formed much of our ethos.  \nI have attended a few of Lloyd Geering’s lectures, and spoken with him, as he has been in much demand as a speaker and ‘authority’ on religious matters generally.  The dichotomy in his professed atheism but continuing participation in religious affairs I find difficult to comprehend.  A now-deceased acquaintance close to the heresy trial had commented to me that he seemed to cut a somewhat pathetic figure. However such a personal view belies the extensive albeit negative influence he has had on the perception of religious matters in this country. Perhaps he is yet another example of how a negative reaction against a fundamentalist evangelical upbringing with its biblical literalism can swing to its opposite extreme.\n\n","date":"May 28, 2013 at 5:55 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-35139","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"David, your last sentence confirms what I noticed and commented earlier. Also have to agree with you regarding Geering, certainly not worth attention.\n\n","date":"May 28, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-35147","author":"Louis","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"Louis, I think you are mistaken in saying that Geering is not worth attention. His baleful influence has been extensive throughout academic circles and also in the general public domain, not only in NZ but also globally, and will continue to be so for very many years to come, unfortunately! Check out the small sample of his prolific writings on the ‘Fishpond’ site, there is much more besides.\n\n","date":"May 28, 2013 at 7:27 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-35153","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"David, many thanks for your opinion. Around two years ago I did read an article written by him and noticed that he was dodging some issue here and there and anyone who did not understand biblical studies in depth, at least to some extent, could swallow what he was saying. The same thing was also noticed when it came to Lüdemann. To me this is not honest but agenda-driven scholarship. Well, that trick by Geering prompted me to dismiss him but as you say he is influential it is worthwhile having a look at what he has said recently and this will be done shortly. Renewed thanks for this lead.\n\n","date":"May 28, 2013 at 8:09 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-35155","author":"Louis","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"Well as I said before I find Geering’s position very odd. I much more respect militant atheists who are repelled by the church than Geering’s weird religion without god. At least Spong believes in God! (If not in a traditional theistic sense)\n\n","date":"May 29, 2013 at 7:31 am","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-35192","author":"matthias","site":"shroudstory"},{"title":"Forced by the evidence to jettison long-held assumptions about Catholic relics","post":"It is likely that Geering’s position is based on what physicists say about the universe, but one is led to wonder whether he has thought about cognition, that is, religion as naturally cognitive and science as unnaturally cognitive. So he may have taken what is unnaturally cognitive as something naturally cognitive. That could explain why his position is odd.\n\n","date":"May 30, 2013 at 3:49 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","id":"comment-35378","author":"Louis","site":"shroudstory"}]
