[{"title":"A Point of View","post":"“There is no lab test for Christ-ness” – Dr. Alan Adler\n\n","date":"November 29, 2013 at 8:47 am","url":"https://shroudstory.com/2013/11/29/a-point-of-view/","cat":"other_blogs","id":"comment-53860","author":"Louis","site":"shroudstory"},{"title":"A Point of View","post":"Short version: I don’t agree with Stephen Jones; ‘icon’ here is an intentionally ambiguous term.\nParsing statements that emanate from the Vatican is an art form in itself.  I certainly don’t have the insight or experience to interpret papal statements generally, but I think what we have here is an example of Francis employing a generalized term to avoid making a pronouncement on authenticity.  A philosophical definition of ‘icon’ would seem to support this, at least according to the OED: https://dl.dropboxusercontent.com/u/78391/icon_OED.png \nI suspect Francis is using the word ‘icon’ because it encompasses both artifacts and acheiropoieta.  Again, I suggest consulting someone with more experience at this; Fr. John Zuhlsdorf comes immediately to mind: http://wdtprs.com/blog/ .  I can say, though, that popes often employ this type of semantic legerdemain as a foil against their every utterance being immediately taken as interpretations of Catholic dogma.\n\n","date":"November 29, 2013 at 10:32 am","url":"https://shroudstory.com/2013/11/29/a-point-of-view/","cat":"other_blogs","id":"comment-53871","author":"Jeffrey Liss","site":"shroudstory"},{"title":"A Point of View","post":"The last sentence is absolutely correct.\n\n","date":"November 29, 2013 at 2:14 pm","url":"https://shroudstory.com/2013/11/29/a-point-of-view/","cat":"other_blogs","id":"comment-53914","author":"Louis","site":"shroudstory"},{"title":"A Point of View","post":"I write this as, to say the least, no great fan of any post-conciliar Pope.  Nevertheless, a Pope has a certain responsibility to his office, the exercise of which includes making statements that go well beyond what can be established by scientific evidence.  It would be more than a technical mistake, more than overreach with regard to technical competence, for a Pope to subordinate his level of discourse to that of purely evidentiary debates.\nThe problem, of course, is that Christianity as such is based on evidentiary claims.  So now we have at least two levels of evidence: the Shroud itself, which might be evidence of the fundamental claims, and the evidence concerning the Shroud’s authenticity.  The Pope does well to avoid even the appearance of confusing these, especially since the fundamental claims should never be made to seem subject to a secondary discussion.\n\n","date":"November 30, 2013 at 10:11 am","url":"https://shroudstory.com/2013/11/29/a-point-of-view/","cat":"other_blogs","id":"comment-54170","author":"R. H. Cahall","site":"shroudstory"},{"title":"A Point of View","post":"In my idea it’s impossible to destroy the Catholicism\nwith few words about the presumed Vatican’s duplicity\naround the authenticity …\n— —\nAs you have seen the next exhibition will be held in a period of about 45 days\nbetween the Easter season (from mid-April 2015) and the closing\ncelebrations of the bicentenary (August 16th, 2015) and then\nthere are other (… better ?) occasions to interpret papal statements …\nDo you agree ?\n>… The opening of the exhibition in the Easter refers to the death and\nresurrection of the Lord, and with it the beginning of the Church’s mission.\n>The Shroud, Veil of death, for believers becomes a proof which recalls,\nwith a great evocative effectiveness, the victory of the Lord of life. …\n>Cesare Nosiglia\n>Archbishop of Turin\n>Papal Custodian of the Shroud\nSource :\nhttp://www.sindone.org/the_holy_shroud__english_/news_and_info/00045909_Message_from_the_Custodian_of_the_Shroud.html\n— — —\nSee also, in the blog :\n“More on the 2015 Rumors”\nunder the address :\nhttps://shroudstory.com/2013/10/09/more-on-the-2015-rumors/\n— —\nIn Wikipedia\n( = http://en.wikipedia.org/wiki/Roman_Catholic_devotions_to_Jesus_Christ )\nyou can read the following words :\n>On the first Friday in Lent 1936, Sister Maria Pierina de Micheli, a nun born near Milan in Italy, reported a vision in which Jesus told her: “I will that My Face, which reflects the intimate pains of My Spirit, the suffering and the love of My Heart, be more honored. He who meditates upon Me, consoles Me”. Further visions reportedly urged her to make a medal with the Holy Face based on the image from Secondo Pia’s photograph of the Shroud of Turin.\n>In 1958, Pope Pius XII approved of the devotion and the Holy Face medal and confirmed the Feast of the Holy Face of Jesus as Shrove Tuesday (the Tuesday before Ash Wednesday) for all Roman Catholics … …\n— —\nHere another point to consider :\n>The International Institute for Research on\nthe Face of Christ was formed in 1997 by\nCardinal Fiorenzo Angelini and the Benedictine Sisters\nof the Reparation of the Holy Face in Rome …\nSource :\nhttp://en.wikipedia.org/wiki/Holy_Face_of_Jesus\nand\ntry also to read the words under the address :\nhttp://www.thereseoflisieux.org/the-holy-face-of-jesus/\n= St. Therese of Lisieux and the Holy Face of Jesus …\n>The Holy Shroud of Turin\n>Discusses the history of the devotion to the Holy Face and\nSt. Therese’s participation in it. Note that Therese never saw the Shroud of Turin,\nbut after Therese’s death her sister Celine painted a famous picture\nof the Holy Face based on the Shroud.\n— —\nSo …\nWhat is your comment ?\n\n","date":"December 4, 2013 at 10:43 am","url":"https://shroudstory.com/2013/11/29/a-point-of-view/","cat":"other_blogs","id":"comment-56318","author":"Piero","site":"shroudstory"}]
