[{"title":"God in his lab","post":"I am not one who could even imagine how anyone could argues against that point unless they are a a true die hard atheist.  And I have to assume that when an atheist dies – immediately after their death it will be a hard awakening that they will experience.- the body is dead but the soul is alive wondering “What the heck do I do now?”\n\n","date":"November 14, 2014 at 5:48 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171184","author":"Emmett McMahon","site":"shroudstory"},{"title":"God in his lab","post":"Recreating. I was talking to someone who recreates medieval illuminated manuscripts. She told me that there are certain techniques that no one knows how to do anymore  so now  it would be impossible to recreate certain illuminations.\nThen there is the Sutton Hoo purse, seventh century. Despite intensive study at the British Museum no one know how they got the garnet inlay there.\nAnd when I was creating an engagement ring for my wife, we chose a Minoan ring of c 1700 BC for a model. The jeweller said they would not be able to reproduce the original as it was too intricate unless I was prepared to pay one of the world’s top jewellers to have a go. Sadly the cash did not go that far! (Still, she loves what we did end up with!)\nAnd what is one trying to recreate?: something old but  as it is now with the patina of age on it, or something as it was originally made  as in the three examples I have given? Very difficult indeed to do the former as one would not be able to recreate the effects of the conditions in which it had been kept, perhaps for hundreds of years.\n\n","date":"November 14, 2014 at 6:14 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171185","author":"Charles Freeman","site":"shroudstory"},{"title":"God in his lab","post":"Girolamo Segato (1792 – 1836) developed a method for turning cadavers to stone (petrification). No one has been able to duplicate his work.\n\n","date":"November 15, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171459","author":"aljones909","site":"shroudstory"},{"title":"God in his lab","post":"P/S. I have never understood why anyone would want to reproduce the Shroud as it is today after all these years of existence. Perhaps it is the time I spent as an archaeologist- if one dug something up  you wanted to know what it had originally looked like – if it were gold, of course, cleaned up, there would be hardly any difference between then and now, likewise with objects kept in an undisturbed Egyptian tomb, but other materials we would have expected to change through time- so the challenge remains what were they once like when they were made? Perhaps I am too old to get out of the conditioning of my youth!\n.\n\n","date":"November 14, 2014 at 6:36 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171187","author":"Charles Freeman","site":"shroudstory"},{"title":"God in his lab","post":"Charles,\nWe do not order our life by proof beyond a reasonable doubt (Quantum Christ, Introduction). In fact, particularly with ancient objects, we must rely on circumstantial evidence (See Dawkins, Richard). When there is a body of circumstantial evidence pointing in one direction, then that body of evidence may allow us to, and in law may force us, to reach a conclusion in that direction. \nIt is an issue of probability, but at the quantum level of existence, everything is an issue of probability.\nThere are well over a scores, it not more than a hundred, of hard facts from which a inference of authenticity. Maybe someone can do the math, I have to make a trip to the law library this morning, but what are the odds that a coin when flipped will come up heads or tails? For one flip it’s 50%. What are the odds that a coin when flipped will come of heads 80 times in a row. I believe the odds are in the line of one in the millions.\nYour speculations or theories are not facts. A hard fact might be the production of an existing similar object but even that would not be determinant.\nThe only hard fact arguing against authenticity, is the carbon dating. However, that process was so deeply flawed as to become a non-fact. As an analogy, in a trial, after extensive examination and testimony, it would probably be excluded from evidence. Seriously.\nI hate to sound/write like a lawyer, but proving facts by evidence is what I do for a living and have done for more than 50 years. \nI will confess though that when i graduated from high school I won four gold medals. History, Oratory, Religion and Science. That doesn’t make me a scientists obviously. In fact I chose a career in which history and oratory predominate. Maybe that was a mistake. maybe a big one.\nBut one of the saving graces of living and working in New York City is that my “hometown” paper is the New York Times. Their coverage of science is outstanding. And I have a library card for one of the world’s finest library systems. And there is the Internet.\nLet me ask you a question: what do you think of the concept of Boltzman Brains? It’s a little crazy, but it’s not totally irrelevant to the Shroud because it deals with the hypothetical existence of disembodied consciousness. I read about it in several places but you can read about in NY Times, if you wish. “Big Brain Theory: Have Cosmologists Lost Theirs?” N.Y. Times, January 15, 2008.\nI am not advocating for Boltzman Brains, but hey, as they say in the Lottery ads, “You never know.” [Irony intended]\n\n","date":"November 14, 2014 at 8:07 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171196","author":"John Klotz","site":"shroudstory"},{"title":"God in his lab","post":"You endlessly keep on saying that the Carbon Dating was deeply flawed.  Do the vast  majority of scientists agree with you ? Or is it just a small minority of them who say that the Carbon Dating was flawed ?\n\n","date":"November 14, 2014 at 8:58 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171200","author":"PHPL","site":"shroudstory"},{"title":"God in his lab","post":"The issue for any scientific opinion is whether they have done the work. There is a tendency of the agonostic/atheist scientific community (not all scientists) to accept the carbon dating at face value because it comports with their world view and they can not deal with an authentic relic of Christ. \nIn my manuscript I give as an example the late Carl Sagan writing in his posthumously published book “Billions and Billions.”\n“ ‘If we can measure the amount of radioactive parent material and the amount of daughter decay product in a sample, we can determine how long the sample has been around. In this way we find that the so-called Shroud of Turin is not the burial shroud of Jesus, but a pious hoax from the fourteenth century (when it was denounced by Church authorities)…'(Emphasis added) \n“The basis of Sagan’s curt brush-off of the Shroud was the D’Arcis memorandum discussed in Chapter 4. As noted, it is doubtful that the memorandum was ever delivered to Pope Clement and it was entirely based upon a hearsay statement uttered years before. D’Arcis claimed that his predecessor as bishop was told by an artist that he had painted the Shroud. Yet, the Shroud is not a painting. If there is a hoax at work, it is the claim that the Shroud is a painting. That hoax has been thoroughly debunked.\n“The scientific evidence that the Shroud is not a painting is overwhelming. It is obvious that those who still claim it is such have not taken the time to review the evidence with an unbiased eye. ” \nQuantum Christ, Chapter 18: The challenge of the Shroud.\n“\n\n","date":"November 14, 2014 at 9:34 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171203","author":"John Klotz","site":"shroudstory"},{"title":"God in his lab","post":"That discussion is going nowhere . The only thing that I can tell you Mr Klotz is that I completely disagree with everything that you say and I do  really ask myself why you actually write these things … but if you tell me that your Labrador is lovely, I’ll wholeheartedly agree.\n\n","date":"November 14, 2014 at 10:37 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171211","author":"PHPL","site":"shroudstory"},{"title":"God in his lab","post":"Hi John (John Klotz):\nSomething you will be very interested to read:\n http://thinkprogress.org/climate/2014/11/22/3596041/poll-religion-climate-end-times-evangelicals\n\n","date":"November 22, 2014 at 3:10 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-172573","author":"Louis","site":"shroudstory"},{"title":"God in his lab","post":"Brother Guy Consalmagno on cosmology:\nhttps://search.yahoo.com/search;_ylt=A0LEV1FWjWZUf.8A_SxXNyoA?ei=UTF-8&fr=yfp-t-250&fp=1&p=guy+consolmagno+consciousness+universe&SpellState=&fr2=sp-qrw-corr-top\n\n","date":"November 14, 2014 at 6:23 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171260","author":"Louis","site":"shroudstory"},{"title":"God in his lab","post":"The radiocarbon dating has yet to be shown to be flawed at all, let alone deeply. I wish it was. Some contradictory evidence about cotton and some unconfirmed suggestions about vanillin are possible contra-indications, but are neither sufficiently established to be classed as flaws. Nothing else comes close.\n\n","date":"November 14, 2014 at 9:32 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171202","author":"Hugh Farey","site":"shroudstory"},{"title":"God in his lab","post":"The carbon dating wasn’t flawed at all. The sampling however…\n\n","date":"November 14, 2014 at 9:40 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171204","author":"David Goulet","site":"shroudstory"},{"title":"God in his lab","post":"Hugh,\nYour statement is seriously false. Do you know Pam Moon? Have your read Rogers’ book? What about Carlos Evarista’s?\nThe sample site contained anomalous material. The line in the site was dramatically different from the linen in the rest of the Shroud. Don’t rebut me rebut Ray Rogers’ meticulous book: A Chemist’s Perspective.\n\n","date":"November 14, 2014 at 9:40 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171205","author":"John Klotz","site":"shroudstory"},{"title":"God in his lab","post":"Yes. Yes. No.\nThere is little to no evidence that the linen is sufficiently different from the rest of the Shroud to significantly disrupt the carbon dating. Rogers’s book is excellent in many ways, but leaves open too many questions to be considered definitive. Such evidence as there is (see my comment above) may offer hope, but has a long way to go.\nI do not know many atheists, and none who care about the Shroud, so I do not know if their opinions are coloured by their world-view. I do know a number of good Christians who do not accept its authenticity (I count myself one) and their Christianity is not lessened by their belief.\nAs I understand it, the Bolzmann Brain hypothesis is that consciousness is an emergent property derived from the random organisation of material. Given a sufficiently large universe, and sufficient time, such organisations may be quite numerous, but having no means of expression, would drift in and out of existence without a trace. Theological philosophers can speculate that such organisation, and the consciousness that it engenders, could as well occur at cosmological scales as they might at biological or microscopic scales, in which case we might all be part of some vast organisation occupying a substantial chunk of the universe, or possibly all of it. It’s an entertaining idea, but the original premise, that consciousness can, even in principle, arise from random organisation, is yet to be substantiated.\nThis could be wrong. If anybody knows better, do let us know.\n\n","date":"November 14, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171226","author":"Hugh Farey","site":"shroudstory"},{"title":"God in his lab","post":"Have you ever heard about Grab sampling and Composite sampling. As an Environmental Engineer I always go for Composite sampling, rather than Grab sampling, when I design water or wastewater treatment plants. Yes method of analysis is same for both type of samples but they give different results. Grab samples never give a true picture of the quality of water.\nSame way, as I believe, the results of Carbon test is not accurate, Scientists took a sample  from only one corner of the shroud. They did not take a representative sample of the Shroud.\nI never think the results of that Carbon test as accurate. The sample they took may be a contaminated one. Why these intelligent scientists did not think, before publishing their results that their sample is a contaminated one. There is a high probability that their results are wrong.\nTheir results are a very good tool for non believers to discard the authenticity of the Shroud. \nThose who have ears may hear.\n\n","date":"November 14, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171245","author":"Sampath Fernando","site":"shroudstory"},{"title":"God in his lab","post":"If the water you test is uniform, then grab sampling is be as good as any other, cheaper, quicker and uses less water. In an environment, I guess the water is never uniform, and composite sampling is essential. The material of a sheet is much more uniform than environmental water, so grab sampling is less prone to error. It is not impossible that the Shroud is variable in composition, but unless this is demonstrated, there is no reason why a grab sample should not give a true result. The crux of your argument is: “They did not take a representative sample of the Shroud”, and “There is a high probability that their results are wrong”, two arbitrary statements without evidencial justification.\nThose who have eyes may see.\n\n","date":"November 14, 2014 at 4:23 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171251","author":"Hugh Farey","site":"shroudstory"},{"title":"God in his lab","post":"The sampling was flawed. It was counter intuitive to choose a sample from that corner alone on an artifact of such unique provenance. The fact we are even having this conversation is proof that the sampling was flawed. Some will judge that flaw as negligible, others judge it fatal. Time will tell, hopefully, who judged correctly.\n\n","date":"November 14, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171266","author":"David Goulet","site":"shroudstory"},{"title":"God in his lab","post":"Hi Mr. Farey – Do you think corners of Shroud have not contaminated by manual handling?\n\n","date":"November 14, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171265","author":"Sampath Fernando","site":"shroudstory"},{"title":"God in his lab","post":"Of course. The Shroud is at least 600 years old and has been contaminated by handling, smoke, wax, insects, mould and bacteria. The point is, as I mentioned, that there is no evidence that there is sufficient contamination at any one point to skew a radiocarbon test. I think even authenticists have generally abandoned the idea that surface contamination even before pre-treatment consisted of more than half the measured weight of the samples (necessary for it to hae an effect), and the pre-treatment reduced it to a minimum. Two other possibilites are that the linen itself is not original, for which, in spite of some serious investigation, evidence is currently insufficient, or that the original linen has had C14 atoms either created (via neutron radiation) or added (via carbon monoxide), for which evidence is even less.\ndaveb (below) is correct that this is a perennial topic, but I don’t think we should tire of investigating it. He is also correct that “there are several reasons for coming to the conclusion that it is indeed the burial cost of Christ and dates from that time” and that “belief that the Shroud is authentic is not at all irrational.” However, as anybody who has followed this site for any length of time knows, both the historical and scientific evidence for authenticity is hotly disputed even among authenticists. If there were conclusive evidence that a double-imaged sheet was ever in Constantinople, or that the Mandylion was the folded Shroud, or even that the Gospel of the Hebrews was a historical source, then authenticists would be on stronger ground, but there isn’t.\n\n","date":"November 15, 2014 at 3:08 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171340","author":"Hugh Farey","site":"shroudstory"},{"title":"God in his lab","post":"Eventually we will know if the carbon dating was flawed or not (I believe it is flawed) because it was done by man but we will not know how the image was created because it was done by God. John 9:5 ‘As long as I am in the world, I am the light of the world.’  The image was created by supernatural light! Scientist Di Lazarro so far have the best hypothesis.\n\n","date":"November 14, 2014 at 8:26 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171283","author":"Don","site":"shroudstory"},{"title":"God in his lab","post":"We have had this debate several times previously.  No authenticist can accept the C14 results as representing the true age of the Shroud, and there are several reasons for coming to the conclusion that it is indeed the burial cost of Christ and dates from that time.\n History attests that such an object did indeed exist, even well into Byzantine times, but it disappeared from Constantinople following Venetian and Frankish crusaders sacking the city of its gold and relics,  Several forensic pathologists have studied the present relic and have come to the conclusion that the image is that of a real crucified man who in addition suffered the gratuitous mockery punishment of a crown of thorns.  The stains on it are anthropoid blood and likely that of the victim.  There is only one known person who was capable of vacating his burial apparel leaving it intact.  There is much additional corroborative evidence.  So that the belief that the Shroud is authentic is not at all irrational. \nDavid Goulet makes the point “The fact we are even having this conversation is proof that the sampling was flawed” and that is a valid point.  As Sampath states, the sampling was not composite and breached the original sampling protocols designed by Chagas, himself a skeptic as to authenticity, but which would satisfy correct scientific sampling criteria.  In the face of this breach, it is not incumbent upon authenticists to demonstrate heterogeneity of the Shroud to make their case, but it is incumbent upon the C-14 protagonists to demonstrate their case that it is homogeneous.  This can only done by composite sampling, and to date that assertion  rests only on unaided visual inspection, while many questions persist casting doubt on the sample taken, notwithstanding Hugh Farey’s uncritical and unscientific protests of the validity of these highly dubious results.  \nThe alternative that the authentic burial cloth of Christ should somehow miraculously appear as originating in the 14th century by some strange supernatural agency, is I suppose barely possible, but seems to be the stuff of fairyland (oral pun is unintentional).\n\n","date":"November 14, 2014 at 9:01 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171293","author":"daveb of wellington nz","site":"shroudstory"},{"title":"God in his lab","post":"erratum, para 1, “… burial ‘cloth’ of Christ …”\n\n","date":"November 14, 2014 at 9:03 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171294","author":"daveb of wellington nz","site":"shroudstory"},{"title":"God in his lab","post":"HF: “However, as anybody who has followed this site for any length of time knows, both the historical and scientific evidence for authenticity is hotly disputed even among authenticists.” \nAnd ‘as anybody who has followed this site for any length of time knows,’ the only historical and scientific evidence that is hotly disputed among authenticists, are matters of finer detail.  Zugbibe disputed the finer details of Barbet’s analysis, but despite this he displayed no illusions that the cloth was that of a real crucified male, nor did he debate whether or not the evidence of the crown of thorns was faulty.  Other forensic pathologists took a similar line.  Even though he is not a professional palinologist, Hugh himself vigorously attacked the question of pollens, despite the fact that professional palinologists had asserted that there were pollen residues exclusive to Palestine, and even so, Hugh himself was unable to exclude them completely. \nDaniel Scavone has provided not merely one historical reference for evidence that the burial cloth was in Constantinople, but several references.  It is true that some authenticist historians dispute whether all such references refer to the Shroud, but some at least seem to be clearly specific, particularly if those that might refer to the Mandylion are excluded.  The cumulative effect of the record makes a strong case that it was indeed there. \nHugh’s response does not deal adequately with the question concerning homogeneity, which at present can only be based on unaided visual inspection, and he continues to imply fallaciously that it is the authenticists’ responsibility to demonstrate heterogeneity despite the opportunity for composite sampling to prove his case being abandoned, because of an unproven inference.  \nFurthermore, no one yet can explain how the image of a real crucified male that persuades pathologists of its organic origin, came to be expressed on the cloth.  I cannot recall a single case of where any pathologist was ever fooled into imagining that any painting of a person or an image of a metallic template was the impression of a real human being, whether in life or in death.  But that is the common consensus among those of them who have closely studied the Shroud image.\n\n","date":"November 15, 2014 at 4:57 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171355","author":"daveb of wellington nz","site":"shroudstory"},{"title":"God in his lab","post":"“matters of finer detail.” Such as whether the Shroud and the Mandylion are one and the same, or whether the Shroud was wrapped around the body or laid on top, or whether the image was formed by vapour or by radiation. Matters of fine detail these may be to daveb, but I would have thought they were fairly basic to the authenticist case; they have certainly caused much vituperation.\n“he continues to imply fallaciously that it is the authenticists’ responsibility to demonstrate heterogeneity.” Not fallaciously at all. If anybody puts forward any hypothesis, they have some responsibility to defend it when challenged. My hypothesis is that the Shroud is homogeneous; my evidence is Shroud 2.0, Barrie Schwortz’s transmission light photographs and Mottern’s X-rays. The alternative hypothesis is that the radiocarbon corner is not representative of the whole; the evidence for this is some reports about variable cotton content, Rogers’s vanillin experiments, his observations of a surface layer of gum and madder, and unjustified accusations of grubby fingeredness among medieval episcopacy.\nAnd no, not again! “You can’t explain how it was done, so I must be right and you must be wrong.” This is indeed the common consensus among authenticists, but not, thank goodness, among non-authenticists, who recognise it for the specious argument it is.\n\n","date":"November 15, 2014 at 1:05 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171427","author":"Hugh Farey","site":"shroudstory"},{"title":"God in his lab","post":"Hi, I read most all the mail ,in this site and the various sides  .A lot of the comments seem to blow me away ??   Sometime back – not sure of the month, day or even the year.  I had read about the Shroud and my remembrance is that on the 3rd day after Christ was placed into the tomb, Mary Magdalene went to the tomb to try and anoint the body of Jesus with spices.   Instead of finding Roman guards at a sealed tomb, she found the guards gone and the tomb opening was open as the large rock had been rolled to the side of the opening.  She entered the tomb and found that the area where the body of Christ was supposed to be was empty of the body. She was confounded and ran back to the room(s) where the Apostles were and reported the fact of the missing body too them.  A couple of the Apostles and the Disciple Mary Magdalene returned to the grave and observed the fact that there was no body.  My problem is that I don’t recall whether Mary took the Burial Shroud with her from her 1st visit or it was picked up by one of the Apostles upon their entrance of the tomb to investigate. \nThe Apostles and close Disciples kept tight control of the Shroud and it was passed on to their followers for many centuries. The Shroud has the remnants of the blood, sweat and dirt that was left on it from the burial and also the metaphysical image of the body that was created and remains from the exact time that the physical body was energized by the spiritual soul of our Lord at the time of his resurrection.\n\n","date":"November 15, 2014 at 6:57 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171466","author":"Emmett McMahon","site":"shroudstory"},{"title":"God in his lab","post":"Emmett you can very quickly bring up the biblical text you want to check, if you have some idea of whereabouts the text is.  Even inserting a rough version of the text in Google will often bring up the text reference.  From there, you can access the US Conference of Catholic Bishops biblical text, together with their annotations and cross-references.\nhttp://www.usccb.org/bible/books-of-the-bible/\nThis brings up the links to each book, clicking on any book gives you access to any chapter you want.  It is still accessible in IE9 if you still have it on your PC.  One trick is to switch between IE9 and Google Chrome to copy any text to wherever you want.\nCheers, daveb.\n\n","date":"November 15, 2014 at 8:22 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171475","author":"daveb of wellington nz","site":"shroudstory"},{"title":"God in his lab","post":"Hi, this is not what I had read but it is close enough as far as my memory can tell. http://www.netbiblestudy.com/00_cartimages/Miracle%20of%20the%20Undisturbed%20Grave%20Clothes%20oif%20Jesus.pdf\nI know that from a TV program I had watched that the Vatican does not want any more testing done of the actual Shroud but it would answer most questions if a few square inches could be removed from a couple of areas of the Shroud near to the image but not cutting into the image itself – well maybe some of the “soul emplaced image” but not the part of the direct body image area. ??  Unlike you I am a poor researcher and at 73 with bad eyes etc – it isn’t very easy. I have to live in a long term care facility as directed by the Drs. of Kaiser Permanente.  I have been here for 7 1/2 years and will probably be here until.\n\n","date":"November 16, 2014 at 5:51 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171539","author":"Emmett McMahon","site":"shroudstory"},{"title":"God in his lab","post":"Thank you, especially for the site of the USCCB.\n\n","date":"November 15, 2014 at 9:12 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171481","author":"Emmett McMahon","site":"shroudstory"},{"title":"God in his lab","post":"An approach to sampling: \nI first graduated in 1962, having then acquired more mathematics than any one person should be expected to know, even for a career in engineering my chosen vocation. And although a grounding in statistics and probability theory had been part of the course I was still not satisfied.  I obtained my first formal qualification in Statistics and Probability the following year in 1963, the two set text books being by A H Mood of the RAND Corporation, and P G Hoel of the University of California, both classics of their type.  That a great-uncle had founded the Statistics department at the University of Melbourne and authored text books on the subject some decades earlier is purely incidental. \nIn the ensuing years I built on this foundation, developing skills in quality control, inspection systems, queuing theory, accident analysis, flood predictions, earthquake engineering, hazards analysis, projects evaluation, along with many others.  In all of them, statistics and probability theory were often a significant part of the analysis.  I learnt about Operations Research, Game Theory, Monte Carlo Simulation, Reliability Theory, Markov Chains, Probability Generating Functions, and various other arcane techniques.  Towards the end of my career, I had been designing sampling systems for various Audit groups, and providing the needed assurances on various capital projects with inherently uncertain outcomes.  I had meantime added to my statistics library including advanced works by William Feller of Princeton, and Sheldon M Ross of Berkeley, among various others.  \nIt is now nearly 15 years since I retired from all that, and with advancing years, I have probably now forgotten some of the more esoteric techniques.  I can still manage a Monte Carlo simulation, but a Markov Chain might be more of a challenge.  It remains a rapidly advancing discipline and doubtless new techniques have also since come to light.  I can however still remember the fundamental principles.  \nA quote from my first text book by P G Hoel, in his Chapter 12 on Statistical Design in Experiments seems apposite: \n“It is a common experience for experimenters who are unacquainted with statistical principles to seek statistical assistance when their experiments fail to produce the results anticipated by them.  In some experiments the data were obtained in such a manner as to exclude any valid conclusions of the type desired; in others there is little that can be done to extract further information from the data because the experiment was not designed with a statistical analysis in mind.  Only rarely are the experiments that give valid conclusions as sensitive as they would have been if a standard statistical design had been employed.  Too many experimenters do not seem to appreciate the obvious injunction that the time to design an experiment is before the experiment is begun.” \nHoel goes on to give a few simple elementary illustrations including the design of a simple agricultural experiment.  Mood makes much the same observations in his Chapter 7 on Sampling, only in different words.  It is evident that homogeneity cannot be assumed in any experiment, but that heterogeneity is to be expected, and is indeed the normal situation. \nNothing statistically significant can be said about the results from a single sample.  Certainly the record shows that contrary to Hoel’s injunction, the participants in the 1988 radiocarbon C14 sampling of the Shroud had not appreciated that the time to design an experiment was before it had begun.  The foreplay had been acrimonious, the debates as to the sampling site prolonged, and the concern for conservation overplayed.  It is ironic that even when this single sample had been divided among the three laboratories, there were variations such that a statistical trend across the sample became evident, suggesting the likelihood of heterogeneity.  \nIt remains a blight on the history of science that such eminent laboratories agreed to such an approach.  Why did they do it?  Answer, Because they had so much to gain in reputation by demonstrating their new technique, and contrariwise so much to lose if they had abdicated. \nThe 1988 C14 result is statistically meaningless.\n\n","date":"November 16, 2014 at 4:46 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171530","author":"daveb of wellington nz","site":"shroudstory"},{"title":"God in his lab","post":"“The 1988 C14 result is statistically meaningless.” If only Messrs Damon, Donahue, Gore, Hatheway, Jull, Linick, Sercel, Toolin, Bronk, Hall, Hedges, Housley, Law, Perry, Bonani, Trumbore, Woelfli, Ambers, Bowman, Leese and Tite, not to mention the statistical peer reviewers of Nature, had had daveb’s education, erudition and insight, we might have been saved all this bother. Silly Professors, silly Doctors, silly Non-authenticists – it’s a wonder the British Museum hasn’t been turned into a Bingo Hall, the Oxford Radiocarbon Accelerator Unit into a Skate Park and the Arizona AMS Lab into a Cinema. Now we can all move on and look for UFO landing grounds on Mexican pyramids.\n\n","date":"November 16, 2014 at 5:04 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171532","author":"Hugh Farey","site":"shroudstory"},{"title":"God in his lab","post":"Tell it to Paul G Hoel & Alexander McFarlane Mood!\n\n","date":"November 16, 2014 at 5:29 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171536","author":"daveb of wellington nz","site":"shroudstory"},{"title":"God in his lab","post":"Hugh, the really stunning thing is that Messrs Damon, Donahue, Gore, Hatheway, Jull, Linick, Sercel, Toolin, Bronk, Hall, Hedges, Housley, Law, Perry, Bonani, Trumbore, Woelfli, Ambers, Bowman, Leese and Tite signed this Nature papers without any questions, and neither reviewers from Nature had any second thoughts, moreover, several other educated people, specialists in natural nad physical science, and even carbon dating specialists raised no objections, while the Nature paper itself (the infamous X^2 valueof 6.4) shows there is something odd here.\nhttp://www.shroud.com/nature.htm\nMoreover, I once  heard a radio (an internal station of one Catholic University) interview with one specialist in carbon dating (who also published an interesting textbook on carbon dating, easliy available online), the interview was published on his private website (which makes clear that the author is atheist). The topic of the interview was of course the Shroud of Turin and scientific examination of it.\nWhat can I say about this roughly 15 minutes interview? As far as I study the topic of the Shroud I have never heard such insolence, such arrogance, such pride, such overconfidence in 1988 carbon datings (called by the intervied “the only true scientific examination” ), such contempt for other scientific examinations of the Shroud (he once mentioned 3D examination of the Shroud questioning “what’s that a kind of study?”)., Even the interviewer, it was apparent from her voice, that she began to lost patience. \nIn the latter part of the interview, when our proffesor reminded himself what audience would listen to that, mentioned that as (according to him) it would be miracle had the results be skewed from the 1st to 14th century -so the only hope for all authenticist is miracle, that maybe something happened during Resurrection that changed the results -but no other way. But it was obvious, even if not voiced, that he didn’t intend to believe that, and this suggestion was brought forward more to ridicule proponents of authenticity (some of whom, as we know, adhere to this theory, absurd for atheists and not only), than as serious hypothesis.\nThat’s it, the attitude of some people, particularly radiocarbonists to the Shroud. And even despite I don’t believe the 1988 results were duped (like Stephen E. Jones claims), yet there seems to be conspiracy, even if unorganized (call it conspiracy of silence or something similar). Simply, the Shroud, the most controversial object on Earth, is inconvenient for some circles, who would like to discredit it at all cost!\n\n","date":"November 16, 2014 at 8:02 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171562","author":"O.K.","site":"shroudstory"},{"title":"God in his lab","post":"I will give you an advice. Just claim as from now on that the horrendous 14th Century date was obtained through the devil intervention and that for unknown reasons , God didn’t want to interfere (He wanted to test our faith ?).\n\n","date":"November 16, 2014 at 8:28 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171565","author":"PHPL","site":"shroudstory"},{"title":"God in his lab","post":"No, I can’t accept that. All those people signed the Nature papers without any questions! Really? Have you any evidence for that? And the reviewers from Natures had no second thoughts? Really? Have you any evidence for that? Even carbon dating specialists raised no objections? Did they not? Maybe they looked for some but couldn’t find any.\nThis is heading for conspiracy on a scale Stephen Jones can only dream of. I think it possible that some people would sign anything in a fanatical attempt to declare the shroud a fake, just as there are those on this site who accept anything in a fanatical attempt to “prove” its authenticity, but to suggest that all of them cheerfully allowed their name to be attached to something they considered “statistically meaningless”, and that the reviewers in fact failed to review the paper at all is very far-fetched, in my opinion.\n\n","date":"November 16, 2014 at 9:48 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171573","author":"Hugh Farey","site":"shroudstory"},{"title":"God in his lab","post":"No, I can’t accept that. All those people signed the Nature papers without any questions! Really? Have you any evidence for that? And the reviewers from Natures had no second thoughts? Really? Have you any evidence for that? Even carbon dating specialists raised no objections? Did they not? Maybe they looked for some but couldn’t find any.\nYes I have evidence -their names listed in the headline: http://www.shroud.com/nature.htm\nNo one voiced any questions, at least in public. Because if you voice an objection, then it means you believe in flat Earth, that’s why! Carbon dating is inerrant! Triumph of the science over superstitions! And we, who still believe the Shroud is authentic, are just poor, gullible, uneducacted, unenlightened, bigoted people \nThis is heading for conspiracy on a scale Stephen Jones can only dream of.\nHugh, wake up, that’s the world we live in. Do you think there are no “forbidden topics” here? The open-secret conspiracies, of which you cannot speak, because it is politically incorrect? The dark forces trying to shade their wicked deeds?\nNo Hugh, I am not conspiracy theorists. I don’t believe that free-masonry rules the entire world or any nonsense of this kind. Yet there are things for saying which you can be ostracised. And funniest thing is that those who believe in conspiracy theories (UFO, Moon landing-hoax, Bilderberg group) are so absorbed by them, that they cannot notice real conspiracies.\n\n","date":"November 16, 2014 at 10:52 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171578","author":"O.K.","site":"shroudstory"},{"title":"God in his lab","post":"I couldn’t disagree more. These scientists, many of whom are still alive and some of whom I have corresponded with, think that the sample tested was sufficiently representative to give a reasonably accurate date for the Shroud, and was sufficiently well prepared to remove a substantial proportion of any surface contamination. If any of them had thought that the result was ‘statistically meaningless’ they would have said so, and if that was so of a majority, the report would have reflected that. They had no reason to hide their objections to the sampling on purely statistical grounds. I dare say some of them were as familiar with the work of Hoel and McFarlane Mood as daveb. I do not know who actually wrote the paper, but am certain that it was carefully reviewed both by its co-authors and by its reviewers. The idea that they signed it “without any questions” “with no second thoughts”, or frightened that they would be classed as flat-earthers is not tenable.\nBut that does not mean that ye “who still believe the Shroud is authentic, are just poor, gullible, uneducated, unenlightened, bigoted people.” That is the language of authenticists, not of non-authenticists, as has been amply demonstrated in this very blog.\n\n","date":"November 16, 2014 at 5:00 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171603","author":"Hugh Farey","site":"shroudstory"},{"title":"God in his lab","post":"It doesn’t matter a great deal if the experiment is the performance of a fertiliser on a plot of land, the evaluation of a new drug, the frequency history of flood flows in a rainfall catchment, the geographic distribution of earthquake intensities, the derailment frequency of railway wagons, or the radiocarbon dating of a 4 metre long linen Shroud.  As I’ve quoted above: \n“In some experiments the data were obtained in such a manner as to exclude any valid conclusions of the type desired; in others there is little that can be done to extract further information from the data because the experiment was not designed with a statistical analysis in mind. Only rarely are the experiments that give valid conclusions as sensitive as they would have been if a standard statistical design had been employed. Too many experimenters do not seem to appreciate the obvious injunction that the time to design an experiment is before the experiment is begun.” \nThat is the crunch!  And the 1988 C14 testing was notably deficient in all those respects. \n“Introduction to Mathematical Statistics”  Paul G Hoel, Professor of Mathematics, University of California, Los Angeles, Third Edition 1962, John Wiley & Sons, Chapter 12 ‘Statistical Design in Experiments’ p. 297.  \nExperimenters too often become infatuated with the Holy Grail of their technologies, but ignore and overlook the basic fundamentals of experimental design.\n\n","date":"November 16, 2014 at 1:56 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171596","author":"daveb of wellington nz","site":"shroudstory"},{"title":"God in his lab","post":"Hugh:\nThese scientists, many of whom are still alive and some of whom I have corresponded with, think that the sample tested was sufficiently representative to give a reasonably accurate date for the Shroud\nYeah, but the fact remains that Nature data fail several statistical significance tests -and strangely, they don’t care,  don’t see a problem in it. Why should they, as those were measures made by themselves, why bother them that they did something wrong in their job?\nIf any of them had thought that the result was ‘statistically meaningless’ they would have said so, and if that was so of a majority, the report would have reflected that. They had no reason to hide their objections to the sampling on purely statistical grounds\nReally, for what purpose? It was their work, their paper, another addition to the list of publications which determines their careers. Why should they raise any objections? It was against their interest.\nThe idea that they signed it “without any questions” “with no second thoughts”, or frightened that they would be classed as flat-earthers is not tenable.\nIn fact, the whole matter was engineered in the way, that nobody had any interest in disputing the results.\nThe scientists -remember they were not freelance, idealist explorers of the Nature (I mean the Universe, not the journal). They were part of scientific teams. And like in every team, there is a leader, and the subordinates -and there is also “team spirit”. To raise objections against the leaders, to break the team in the matter of principles? No way. And that of course means putting your career at risk.\nThe Nature. As you remember, the results were first announced on the press conference on 13th October 1988. The paper was sent to the Nature only by 5th December, published 16th February. Now rhetorical question: do you really think that Nature could afford rejection of that paper? Do you?\nThe radiocarbonists. They certainly have no interest in disputing the 1988 results, and thus the reliabilty of their method as a whole, by admiting that there may be errors. No matter their personal believes.\nThe other scientists? Who would dare to question 1988 carbon datings, risking his or her reputation as the scientist? The carbon dating is a well established scientific method, questioning it is like, I don’t know, questioning special relativity, or human evolution, or something. You need really good arguments to do that, and withstand fierce opposition.\nSo, in that way Tite & co.  silenced everyone -except for a few fringe “shroudies” who can be ridiculed as pseudoscientific maniacs/fanatics -and in fact the whole conspiracy theories (Stephen E. Jones’ alike) are very on hand for them -serving as a proof of their point, that the “shroudies” are just a bunch of pseudoscientific maniacs. This is the position favored by hard anti-Shroud propaganda, and I had to deal with that stance not once.\n\n","date":"November 16, 2014 at 6:22 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171608","author":"O.K.","site":"shroudstory"},{"title":"God in his lab","post":"HF:  “They had no reason to hide their objections to the sampling on purely statistical grounds. I dare say some of them were as familiar with the work of Hoel and McFarlane Mood as daveb.” \nI should doubt very much that any of them were so familiar, for it is a common enough omission in the training of young scientists as their first priority is always to concentrate on their particular specialty until they attain their doctorate level.  Their statistical training is typically only ever superficial.  It is manifest in the laboratories claiming of a 95% confidence limit in their test results which is clearly incorrect and could only apply to the individual sample piece.  The claim that it applies to the entire cloth rests on an unsupported supposition that the sample was representative. \nI regret to say that it is also apparent enough in the responses given here by a trained scientist.  It was also apparent in the uncomprehending responses of scientist Professor Luigi Gonella to the searching queries raised by archaeologist William Meacham who exceptionally seems to have been fully aware of the need for properly representative sampling.   \nI make few additional claims to my own competence in these matters that are not also shared by any other professional properly trained in the disciplines of statistical mathematics and probability theory.  I became passionate about the subject and made the effort to attain that competence.  There may be other engineers or scientists who have made similar efforts.  I may even have met one or two but not many. \nThe paper “Chronological History of the Evidence for the Anomalous Nature of the C-14 Sample Area of the Shroud of Turin” by Joseph G. Marino and Edwin J. Prior 2008, is enlightening.  The first 45 points of evidence in that paper give the reasons why the authors consider the sample to have been anomalous, which happens to by own view of the matter.  However, not all will agree with that opinion and for the present we may set those aside.\nIn an Appendix they provide a further 32 points of evidence.  These were to address important points of the C-14 process, specifically: “a) the need to exercise caution in giving too much importance to it as an individual test; b) the method’s limitations; and c) the need to place the test in a multi-disciplinary context. The C-14 aspects also give important historical background information leading up to the 1988 testing.”   \nIn an editorial footnote, they refer to a subsequent Addendum to the paper, which lists yet a further 26 points of evidence.  Much of the Addendum is taken up with Meacham’s objections from his book passionately entitled, “The Rape of the Turin Shroud: How Christianity’s most precious relic was wrongly condemned and violated.”  \nThe Marino – Prior paper and its Addendum can be read at:\nhttp://www.shroud.com/pdfs/chronology.pdf\nhttp://www.shroud.com/pdfs/addendum.pdf   \nIf correspondents read nothing else about this matter, then they should at least read the Addendum, so they may be adequately informed about these issues.\n\n","date":"November 16, 2014 at 10:11 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171628","author":"daveb of wellington nz","site":"shroudstory"},{"title":"God in his lab","post":"Who are we to believe, Marino (B.A. in Theological Studies) or distinguished scientists ?\n\n","date":"November 16, 2014 at 11:56 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171639","author":"PHPL","site":"shroudstory"},{"title":"God in his lab","post":"If you are unable to come to your own decisions, you have the option of weighing the arguments as such or putting your faith in a person.  If you put your faith in a person, you need to ask to what extent might their self-interest affect their response, regardless of their expertise.  William Meacham was a distinguished archaeologist, closely associated with much of the lead-up to the C-14 dating project, and to my mind clearly understood the sampling issues I’ve mentioned.  I suggest you might commence with reading the Addendum in the second URL ref I gave above, much of which deals with Meacham’s perspective on the whole matter.  You may find that Meacham’s record of the lead-up and the commentary on it enlightening.\n\n","date":"November 17, 2014 at 2:13 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171654","author":"daveb of wellington nz","site":"shroudstory"},{"title":"God in his lab","post":"Thank you Mr. Davab, for pdf documents. Most probably, as I stated previously,  600years or 2000 years of manual handling of the shroud should have contaminated the corners of the shroud. So definitely it is not a place to take a sample for C dating. How these people mislead believers and non believers.\n\n","date":"November 18, 2014 at 2:06 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171816","author":"Sampath Fernando","site":"shroudstory"},{"title":"God in his lab","post":"I think it is always dangerous to have faith in a person for historical issues- it is the evidence that counts. It is not always easy to accumulate but one can often built up evidence from different sources that correlate with each other. Then when you have a hypothesis you must see if there is evidence that contradicts it.\nWithout the primary research on the looms that might have woven the Shroud and an analysis of all the descriptions and depictions ( from a data base so that these sources are open to all), Shroud studies remain limited with large areas still to research before conclusions can be made. It is not good enough to rely just on the Shroud today without making any assessment as to the ways in which it may have different in the past. If you believe that , unusually, the Shroud is the same now as it was six hundred or even two thousand years ago, the onus is on you to show why it remained impervious to change despite the colourful history, documented from 1350, imagined from before that, that we can recreate. This is why I am trying to involve experts who traditionally have refused to get involved with the Shroud.\nIt is hard to know what expertise Benford and Marino bring to the subject. They attempted to make a case for the reweaving of the Shroud but  neither has/had any background in textiles or  examined the Shroud close-up. If you google ‘Benford pyramids’, you will see that her main interest lay in assessing the specific properties of pyramid shapes and I am not sure how this was relevant to the Shroud.\n\n","date":"November 17, 2014 at 4:39 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171676","author":"Charles Freeman","site":"shroudstory"},{"title":"God in his lab","post":"Despite what must seem to be my persistent contributions on a wide variety of topics on this site, I am fully aware that like most persons I do not happen to know everything and I frequently need to be obliged to others’ for their expertise.  Like most, I choose these based on the evidence they can produce and which is in accord with my own life experience, and this I call a matter of trust or faith.  Life would be quite unbearable without it.  \nAs to the origins of the Shroud as a textile, the Silk Road was an active trade route to the East, and there were Roman garrisons in Britain and Gaul.  Weaving of linen was practised everywhere, some were more innovative than others, and much evidence has disappeared into the dustbin of history and will never be known.  Unless the parent flax of the linen can be botanically identified as exclusive to a geographic area, then the Shroud textile might have originated anywhere from China, Afghanistan, Gaul or Britain, and all points in-between.  Searching for a suitable loom in that expanse, is exclusively a job for a dedicated textile historian.  In the meantime there is plenty to research about this precious object without distracting excursions elsewhere.\n\n","date":"November 18, 2014 at 2:43 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171822","author":"daveb of wellington nz","site":"shroudstory"},{"title":"God in his lab","post":".’ Exclusively a job for a dedicated textile historian’ . Yes, I can tell you that there is one working on the loom issue at the moment. However as they are working for someone else researching the Shroud their findings will not come to me ( unless I can persuade them to be passed on to me) and I have no idea what they will come up with, other than knowing that the weaver concerned is one of the top textile historians/ weavers in the field.\n\n","date":"November 19, 2014 at 5:30 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-172115","author":"Charles Freeman","site":"shroudstory"},{"title":"God in his lab","post":"All very true. However, give time, I think it possible that the origin of the parent flax could indeed by identified, either by DNA comparison or by isotopic analysis. I imagine it’s only a matter of time. I also imagine that, having caught more popular interest, the textiles of ancient Egypt have already been subject to this kind of investigation, so the technology is already in place.\n\n","date":"November 18, 2014 at 2:49 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","id":"comment-171824","author":"Hugh Farey","site":"shroudstory"}]
