[{"title":"Guest Posting by Yannick Clément","post":"Bonjour Yannick !\nI think that your “semi natural hypothesis”, semi because it leaves the door open for Jesus’ resurrection, is interesting but contrived. It is strongly ad hoc (“who knows if”…). \nMoreover, one possibility offered by your semi natural hypothesis (“manual extraction”) doesn’t take into account an uncontroversial fact: the empty tomb.\nBest,\nTristan.\n\n","date":"June 8, 2015 at 6:19 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201310","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Thanks for your comment.  Semi-natural hypothesis is quite a good term to define my point of view…  \nThe “who knows if…” of my 2 questions indicates that there haven’t been a lot of serious researches (including lab experiments) to verify the real possibility of a strong impact of the highly traumatic state of the Shroud man’s body on the image formation process and me leaving the door open to the possibility of a manual extraction of the corpse out of the Shroud was just a way to remain intellectually honest, because it’s impossible to discard completely this hypothesis, even if the way the bloodstains looks (i.e. undisturbed) really seems to cast some serious doubts over this idea.  \nBut having said that, I would really love to see someone making some test with real exudates of blood clots present on someone’s skin and some linen samples to see what kind of damages can be inflicted to the bloodstains when the skin is separated from the linen sample.  Would be interesting to make this kind of test on various timing (i.e. right after the contact, one hour after the contact, two hours after the contact, etc.).  \nPresently, the way the bloodstains looks seems to indicates that if there ever was a manual extraction of the corpse, this should have been done very gently and before the moistened blood clots that were responsible for the bloodstains had time to dry or else, some evident missing parts would be seen in many bloodstains.  But this idea doesn’t seem credible at all because of the body image, which most probably needed a contact of many hours (if not days) to get formed on the cloth’s surface.\n\n","date":"June 9, 2015 at 9:55 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201402","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Tristan wrote:\n>… …one possibility offered by your semi natural hypothesis (“manual extraction”) doesn’t take into account an uncontroversial fact: the empty tomb.  \nInstead Yannick wrote:\n>Effectively, the door would still be left open for the idea of a manual extraction of the body out of the Shroud by some people before the start of active decay. \nOne thing that has always been underlined by many is that\nthere was no rupture of blood clots on the cloth …\nSee, for example, what wrote Habermas:\n>The cloth contacted the body and the blood was transmitted directly to it, becoming somewhat attached. Separation in such conditions would involve dislodging a number of dried blood clots and disrupting the dried borders of the stains. However, the blood clots on the shroud are not only intact, being visible in almost every wound, but the borders of the wounds are also uninterrupted. … …\n>… Yet the body was not removed or unwrapped because, among other reasons, the blood clots and borders of the stains are intact. And as a grand climax, there is a probable burst of radiation from the dead body. … etc. …   (Originally published in the Journal of the Evangelical Theological Society 24:1 (1981): 47-54. )\nLink:\nhttp://www.garyhabermas.com/articles/J_Evangelical_Theological_Soc/Habermas_JETS_Shroud-of-Turin-and-significance.htm\nSo…\nDo you also agree on this alleged fact (= no rupture of blood clots on the cloth …)?\nI think it is difficult to accurately demonstrate this alleged fact, after centuries of bendings, rollings and unrollings for the cloth.\nHowever, a survey with the use of microscopy can highlight\nwhat is the effective state of the material.\nIs it perhaps already enough what was seen under the microscope in the past?\nI have read that surface topography of blood clots can be evaluated\nby interferometric profilometry.\nDo you know this specific analytical way ?\n— — —\nIn “in vivo” :\nPlatelets interact with fibrin polymers to form blood clots\nat sites of vascular injury… (= at sites of vascular injury,\nplatelets and fibrin polymers interact to form blood clots\nthat prevent haemorrhage…).\nBut we know that:\n>Bleeding is caused by the generation of fibrinogen degradation products which interfere with regular fibrin polymerization and inhibit platelet aggregation. \nThen…\nWhat is the post-mortem behaviour?\nI remember to have heard (and read) the term\n“post-mortem fibrinolysis”…\n— — — — — —\nHere is a possible reference to the old dried blood :\n>…During the Mass, when he said the Words of Consecration\n(“This is my body. This is my blood”), with doubt in his soul,\nthe priest is said to have seen the bread change into living flesh\nand the wine change into blood which coagulated into five globules,\nirregular and differing in shape and size (the number supposed\nto be correspondent to the number of wounds Christ suffered\non the cross: one in each hand and foot from the nails, and\nthe wound from the centurion’s spear). …\nLink:\nhttp://en.wikipedia.org/wiki/Miracle_of_Lanciano\n\n","date":"June 8, 2015 at 8:57 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201326","author":"piero","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"The fact that we don’t have a lot of burial cloth from antiquity seems immaterial. There is no reason to restrict observations to antiquity. Every single day, there are tons of new cases of death human bodies having been in contact with textiles of all possible kinds, under widely different conditions of humidity, temperature, ventilation, duration etc. No image forming ever seems to occur. IF (note the conditional) the shroud image is genuine and IF it has been produced when the linen was in contact with the dead body, then it would be an extremely exceptional object indeed. And it would be extremely unlikely that this unique & supposedly fortuituous image formation would have occurred in connection, not with some random  person, but with Christ himself.\nThere is still a second exceptional aspect: the image of the body, both front-side and backside, is *complete*. A natural and accidental process is expected to produce many partial and incomplete images for every single complete image. That the only image known is at the same time also a complete image is exceptional as such.\n\n","date":"June 8, 2015 at 10:22 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201333","author":"Jos Verhulst","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"“A natural and accidental process is expected to produce many partial and incomplete images for every single complete image. ”\nWhat do you think of the blood stains: is the blood imprint partial, incomplete and not homogeneous compared to the image?\n\n","date":"June 8, 2015 at 2:01 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201346","author":"anoxie","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"“A natural and accidental process is expected to produce many partial and incomplete images for every single complete image.”\nMay I recommand you to read the scientific papers published by STURP?  Even if I used the term “complete” in my guest post, the reality is that the image on the Shroud IS NOT 100%COMPLETE!  Effectively, this is a FACT that there are some missing parts (like in the feet area and the region behind the knees), which is, to me, a strong indicator of the natural nature of the image formation process.\nAlso, you must consider the FACT (aslo coming from STURP) that there are some slight distortion in the image, which is another fact that, to me, is another strong indicator of the natural nature of the image formation process.\nAnd when you add the FACT that this undetermined image formation process was so mild that it wasn’t able to produce any coloration beyond 4 cm of distance and that it never penetrated the cloth beyond the thickness of a human hair (while probably affecting only a thin and uneven layer of carbohydrate impurities on the cloth’s surface and leaving the linen fibers uncolored), I think we got some very strong indicators that this still undetermined image formation process was completely natural.\n\n","date":"June 9, 2015 at 10:51 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201405","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Yannick, as to the “manual extraction”, what about the blood clots?    Dr. Pierre Barbet, Chief Surgeon at St. Joseph Hospital in Paris, stated in his book, A Doctor at Calvary (1956):  “The undisturbed aspect of the blood clots cannot be explained scientifically.”\nA blood clot must be moist to transfer to linen.  On Friday evening, if the linen had been lifted off of the body, moist clots would have smeared the linen. \nBy early Saturday, any blood clots would have dried up and been attached firmly to both skin and cloth.   At that point, lifting the linen off of the body would have broken up many, if not all, of the dry blood clots.\nHowever, blood clots on the Shroud show up perfectly intact, not smeared or broken.\nThe Gospels record that the Body was gone by Sunday morning, and that undisturbed linens were left behind.  Therefore, the BLOOD EVIDENCE shows that NO ONE lifted the Shroud off of the Body.\n\n","date":"June 8, 2015 at 10:58 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201335","author":"Nabber","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"The sindon/himation was in-soaked with an alkaline solution prior to be used as inner burial winding sheet. It was not loosely laid, but, most likely, first drawn quite taut from the feet up the back of the stiff rigid body (as stiff and rigid as a wooden board) and over the head and down the front to the feet and then compressed widthwise in smaller shrouds prior to fumigation in extra height (i.e. placed in extra heights either on two piles of granulized myrrh bags or two stones).\n\n","date":"June 8, 2015 at 11:33 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201337","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Max’s scenario of a tightly wrapped cloth cannot have produced the orthogonal image we see on the Shroud without a miracle having occurred.  His hypothetical explanation of a wetted cloth that stretches and then shrinks back to its original shape won’t do the job without distortion occurring,  Even if the particulates that formed the image were somehow constrained to act solely in the vertical direction, there would still be distortion, and the sides of the body would also be imaged, but they are not.  The Latendresse model is the cloth disposition that would allow orthogonality of the image. \nI am sympathetic to Yannick’s hypothesis that the image may have formed by some unknown natural means, because of some exceptional circumstances concerning the burial, such as its environment in the tomb, and the use of myrrh, aloes and other herbs and flora.  David Hines experiments in this field seem intriguing, and possibly promising.  The occurrence of an earthquake with its after-shocks, release of radon gas, and the concurrent variations in the geo-electro-magnetic fields might also have been a necessary factor, for all we know. \nAs other correspondents have mentioned, the integrity of the blood clots seem to exclude the deliberate removal of the body by persons unknown.  Although very few other cases of imaging of corpses are known, it would be unusual to inspect shroud wrappings of a corpse after three days to see if any imaging had in fact occurred.  Any subsequent unwrapping after three days, then any imaging may have been blotted by putrefaction effects.  I suggest it would be pointless to examine the modern wrappings of corpses, as the circumstances of Jesus’ burial would not be fully replicated.  Some time ago, Hugh F had proposed carrying out experiments on frozen mice to see if imaging occurred, but I’m unaware that he’s made any progress with this intention, apart from gathering the necessary materials.\n\n","date":"June 8, 2015 at 4:41 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201352","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"We know that Dr. Romanese was able to obtain images from the faces of the dead persons with sprinkling based on a mixture of aloe and myrrh.\nLater also Dr. Sebastiano Rodante used that technique adding sweat blood (probably = 10% sweat and 1% of blood) with aqueous solution of aloe and myrrh.\nThen it is certainly not true that you can not get images pulling away a linen cloth from the body of a deceased person …\nand\n>In 1980 also father Gaetano Intrigillo obtained experimental impressions by using cloths soaked in a watery aloe and myrrh solution, put on a clay face with human hair, beard and moustache, squirted with sweat and blood, blood trickled and surrounded by a chinrest … …\n[And, in any case, Dr. Pierre Barbet, Chief Surgeon at St. Joseph Hospital in Paris was a research that wrote before Habermas… Meanwhile, the technology progressed! So, I believe Nabber has to be more careful. Perhaps also because in an experiment by De Liso there was “the blood trace of a reptile, that left a 3D image” (Link: http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf   = at p. 4 of 8.\nBut I do not think it has been performed the advanced control [using AFM or SEM tecniques] for this experiment.)…]\nWhere are the researches about “the integrity of the blood clots” that seem to exclude the deliberate removal of the body?\nI see nothing of exact about that problem, then I think that this question seem to be rejected/discarded by researchers…\nThen I do not think is that difficult to do the appropriate experiments using\nblood and linen suitable for this purpose (and then check them with\nadvanced microscopies!).\nHowever, saying this, I do not advocate that, therefore,\nis thus possible to reproduce all the features of the Holy Shroud!…\n\n","date":"June 9, 2015 at 8:16 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201395","author":"piero","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Daveb, most likely the Turin Shroud image contained both orthogonal and non-orthogonal images and consequently the Latendresse model  re the cloth disposition that would allow orthogonality of the image is partially biased.\nRe the alleged “absence of distortions” in conjunction with the cloth as flat surface: the true fact is the Sindon image is affected by several distortions: to the sole exception of the bony areas of the eye-sockets and nasal septum, all the rest of the face shows irregular features and displacements; two squared ‘U’ shaped boxes frame up the Shroud face; absence of a neck image along with presence of chin lower area (vertical panoramicity); unusually long adducted-abducted arms (of which rigor statuaries, “statuar rigidity”, was counter-acted) and seemingly long fingers on the right hand (implying both dislocation and uneven stretching at the arm level). Along with head slightly bent forward, curved back and legs bent with raised knees, non flattened buttocks and calves all these distortions ordeparture fromthe geometrical norm do point in one direction: a volumetric recording of a moulded stiff rigid bloodied body with at least two slightly different body-to-cloth configurations (initial and final).\nI repost what I posted on another thread:\nDaveb,\nIn the hypothesis the TS man is Yeshua’s, the latter was buried according to the JUDEAN burial custom, which implies to abide by a series of specific procedures. In the Second\nTemple period any corpse should be purified, dried out, dressed up/wrapped up in clean shrouds/burial cloths and speedily buried to abide by the halakha. Those were the core procedures. If some may fall in your most curious ‘take-and-leave’ interpretative line, here are a few additional reminders and questions for you:\nReminder one: The actual maximum time-frame (between Yeshua’s death on the cross and the apparition of the 3rd star heralding Shabbath) for Rabbi Yeshua’s burial was 4h04. If we now take off 30-45mn to Pilate’s and back + 30-45mn to take down Yeshua’s body from the cross and carry it to the garden tomb near-by, we are left with a minimum time-frame of about 2h30. It totally rules out the pseudo “0h30” left for Yeshua’s burial time-frame burial as the very notions of ‘evening’, ‘sunset’ ‘twilight dusk’ and ‘night’ as time markers, do not philologically cover the same realities for a Judean as they do for a 20th-21st reader relatively or totally unfamiliar with the Judean ethnic milieu of the Second Temple period. His burial was NOT dispatched in less than half an hour as it is currently yet wrongly claimed. Yossef Ha-Ramathayim (both a member of the Sanhedrin/Judean Supreme Court and a secret disciple of Rabbi Yeshua), DID NOT wait until shqiya/sunset (18:08/18:38 p.m.) that is a minimum of 3 hours AFTER his master’s violent death on the Golgotha (at 15:04/15:34 p.m.) BEFORE he actually went to Pilate’s and ask him for Yeshua’s body and then bought a linen shroud to bury him at the risk of not abiding by the halakha and dishonouring his master’s memory! Just bear in mind too Yeshua was buried in the memorial tomb of Yosseph, a rich man, and not just thrown into a pit as a criminal. The rich man and secret disciple used the sindon/hemation he HAD bought for his own burial and used his newly hewn own garden-tomb near-by to bury his master executed as a criminal and thus both did abide by Sanhedrin 6: 46b and spare some precious time to proceed to the burial and honour his master’s memory. Speedy burials’ is the norm as far as Jewish/Judean funerary customs, practice and rites are concerned NOT the other.\nReminder two: The 3 different conjugated koine Greek verbs used by the 4 evangelists meaning bind/fasten – compress/wrap up – wind/encircle and the koine Greek word for ‘shorter shrouds/pieces of linen’ (othonia) do imply Yeshua’s body was tightly wrapped up in shrouds not just draped over or loosely bound for the women to wash, anoint and tightly wrap up his naked body in shrouds at the first morning hour of the first day of the Hebrew week, that is just after the Shabbat, on the third day of Yeshua’s death. Most likely the stiff rigid body tightly wrapped up in shrouds (along with flower heads, ferocious thorns –used as stitches to hold the shrouds together– and even objects and tokens?) was encircled widthwise in a much larger “all-enveloping shroud” or sovev in Hebrew, sudara in Aramaic (the Korneilmünster Shroud = the Johannine “soudarion”?).\nReminder three: Most likely, the neat haematic cartography resulted from a sticking-gradual-unsticking transfer mechanism implying first the clean long inner burial sheet soaked in an aqueous alkali solution (made of living or rainwater + ashes and/or limestone dust) and tautly drawn lenthgwise back and front from head to toes, was compressed widthwise with shorter dry clean shrouds (othonia) as ALL PARTS of the body should be wrapped up (see Naḥmanides, Torat ha-Adam; Inyan ha-hoẓa’ah) and then, most likely, the tightly wrapped up bloody corpse was subjected to fumigation (see see 2 Chronicles 16:14 – 21:19 Targum) and the long inner burial sheet somehow got taut again back and front through shrinking up.To his likley five-six buriers and (secret) disciples Yeshua was no am ha-arets (“average citizen) but a prophet (and even the Messiah) whose freshly dried innocent blood had been shed, and should be kept with his body and purify. In the case here under study, Second Temple period speedy tahara in terms of wrapping in shrouds, purifying & drying out was an act of ultimate kindness to honor the deceased who died a violent death. It shall not be mistaken with careful physical cleansing Jewish/Judean ritual of a NON-bloody body.The (myrrhic?) aloetic fumigation rite temporarily made up too for the anointing procedure that could not have been performed on burial since grinding spices was not allowed on shabbat to prepare spicy oils. Actually the women came back to Yeshua’s tomb after shabbath JUST TO ANOINT/apply the spicy oil perfumes to his wrapping shrouds (NOT TO WASH, ANOINT AND tightly WRAP up his naked body in shrouds as it is currently misthought).\nIn the koine Greek Gospels, do you really read Yeshua’s shroud was just draped over or loosely bound? And, besides anointing, do you really read the women were to wash and tightly wrap up Yeshua’s body in shrouds/linens clothes on Sunday morning? Why the wrapping in shrouds/linen clothes SHOULD be read as ONLY metaphoric in the Gospels while the anointing procedure the women were about to perform on Sunday Morning SHOULD be read as referring not only to FACTUAL anointing to be but also to FACTUAL washing and wrapping to be (had Yeshua’s body be still in the tomb)? This implicit interpretative line makes no sense a tall.\nReminder four: As a victim of a violent death, Yeshua’s body should be buried with his shed innocent blood and his post-mortem blood could not be DIRECTLY cleansed. The use of alkaline solution along with (myrrhic-)aloetic fumigation) could account for potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal. Now these two signals precisely tend to prove the body could have been purified in accordance with an ancient (Judean) burial custom/practice. The true archaeological fact is there is more than one way by which blood could have become depleted of key ingredients if one considers the bloody body purifying & drying ritual scenario, which Adler clearly did not (crucifixion being an implicit assumption in all his discussion at the expense of specific burial practices, rites and customs).\nIt is light-years’ far from proven yet the burial cloth was just draped about or loosely bound the TS man’s body and the image recording implies JUST ONE body-to-cloth configuration.\nYOUR interpretation is plain conjecture not mine.\nMine is substantiated as far as forensic archaeological textile imprint and bloodstain pattern analyses, Judean/ancient Jewish burial practices and Biblical and Gospel accounts are concerned.\nNow you’re totally in denial the TS bloodied body front and back image recording calls for at least TWO DIFFERENT cloth-to-body CONFIGURATIONS (one resulting from tightly moulding/compressing the relief of the corresponding area with the linen cloth –in-soaked most likely with a watery solution– and another resulting from the gradual shrinking of the cloth while getting somewhat taut again front and back and unsticking –through a drying procedure and a resulting pressure release front and back), how then could you account for only one body-to-cloth configuration or in other words how could you account for:\n1/- the correlation of image intensity on the Turin Shroud with the 3-D structure of a human body?\n2/- the discrepancy between the apparent location of some bloodstains on the cloth versus the body image and their real location on the corpse, e.g. the oozing APPEARING to be in the hair image when actually it was first recorded at cheek level?\n3/- the fact that, to the sole exception of the bony areas of the eye-sockets and nasal septum, all the rest of the face shows irregular features and displacements.\nReminder here:\n– most likely the TS man’s face was compressed by a sindon, sweat veil and skull cap (not to mention the possible use of a smal “jaw-box” made of three wooden pieces to keep the mouth closed, see my reconstruction). Now a forensic examination of the nose area reveals that in this operation the cartilaginous or fleshy rounded part of the nose would have been squashed. Actually the Sindon face tells us this area is not only squashed but also turned to the left with the TS man’s face right profile appearing as if embedded in his facial image.\n3/- the very fact the small of the back is recorded (despite lordosis) while the image at buttock level (upper thigh area) is not, which is not consistent at all with Mario’s explanation?\n4/- the left thigh image being LARGER than expected compared to the right thigh one?\n5/- neither the backside image nor the calve images (of the anatomical left leg bent a little more than the right leg) appearing flattened but round AS IF these areas were ‘elevated’ AWAY FROM underlying shroud? Do you really advocate levitation? \nReminder here: The very fact the buriers took great care not to disturb the blood is totally consistent with an ancient Judean/Jewish burial custom in terms of corpse-covered-in-blood tahara (purification ritual). It has nothing to do with a supernatural event. Re the backside gap, the latter JUST CANNOT be explained “by either the distance of the cloth from the body, […] or possibly by packing with flora or spices.” There is a visual body image discontinuity most likely due to a “S ease fold”.\n6/- the presence of some scourge marks at popliteal fossae (back of the knees) level while there is no back-of-the (partially flexed)-knee images?\nReminder here: Miller and Pellicori UV photos do show that there are scourge marks and yet no (or next to no) body image (this in conjunction with an air gap). The eye-brain coordination system has somehow “to fill the anatomical/air gap” (see Fanti’s most circumlocutive prose misleadingly describing the scourge marks “in correspondence to lower luminance levels of the body image”, A69 in Evidences for Testing Hypotheses about the Body … )\nIn the light of the general economy of the TS man HD bloody body image, such paradoxical visual evidence is consistent with:\na/a blood comes first-body image second scenario\nb/creation of an air gap as the (watery solution in-soaked) long inner burial sheet (TS) first stuck to the body (hence the mirror image of blood transfer by direct contact) and then somehow got taut (too rapidly for the popliteal fossae to be correctly\nrecorded and 3D encoded).\n7/- the unusually long arms and seemingly long fingers on the right hand image imply both dislocation ( and uneven sindon stretching at arm level? During the image formation process, the tightly pulled and compressed in-soaked long inner burial sheet didn’t quite return to its natural size and shape as it got sort of taut again lengthwise through shrinking (through drying out). The uneven recording of the two arms imprint on the inner side of the burial cloth is due to the fact the deceased’s arms had been forced in rigor mortis from adduction to abduction thus creating sort of a stiff rigid arm counter-pressure to shrouds’ wrapping-up pressure. Through drying out and slight cloth-to-body pressure release as the Shroud got somewhat taut again through shrinking, the arms mechanically tended to slightly raised again above body. It resulted in a specific image distortion not to be extended to the whole body imprint.\nYes indeed, in the light of the TS bloodied dorsal and ventral body imprints and the three other Gospel accounts, John 19: 40 can read: “Then they took the body of Yeshua, and wound and compressed and fastened it in linen shrouds with the spices, as the manner of the Judeans is to bury”.\n\n","date":"June 9, 2015 at 10:24 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201404","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Daveb, my TS image formation theory can account for the integrity of the blood clots. Can your theory?\n\n","date":"June 9, 2015 at 11:02 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201407","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Daveb, BTW, moons ago I asked you:\n“geometrically speaking what is your explanation to account for the following distortions:\n1/ blood rivulets FIRST appearing on the face and THEN as if on the hair\n2/ some bloodstains appearing in the area of the back of the knees BUT no image while the very fact the small of the back is recorded (despite lordosis)?\n3/ and how do you account for the extra inches around the buttocks with no body image and no blood imprint detected in the said area?”\nSTILL waiting for your answer as advocate of the orthogonality as far as the TS bloodied image is concerned.\n\n","date":"June 9, 2015 at 11:14 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201409","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Moons ago = on May 29, 2014 at 8:52 am i.e. more than one year ago!\n\n","date":"June 9, 2015 at 11:35 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201410","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Typo:  Could you account for the small of the back image appearing (despite lordosis) along with a blood flow from side to side AND a few scourge marks appearing at the back of the knees level with no back of the knee images?\n\n","date":"June 9, 2015 at 1:40 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201419","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Max, you have gone to a lot of quite unnecessary trouble in your detailed write-up, and I have no intention of a point-by-point rebuttal, which I know would be a waste of time.  However which way the TSM may have been wrapped or not at the time of his burial, the cloth was not tightly wrapped around the body at the time of image formation.  To think otherwise is to deny basic fundamentals of the principles of Projective Geometry, which after having studied the subject for some three years during a three stage Technical Drawing & Design qualification is a discipline that I consider I achieved some basic competence.   \nYou mention a number of minor distortions but these cannot be attributed to a tightly wrapped burial cloth.  They are more likely due to the cloth not being in a perfect flat plane at the time of image formation, but more likely somewhat loosely draped, more or less as proposed by Mario Latendresse in his model studies.  Some minor distortions would also occur because of the naturally skewed angles between parts of the body and the cloth at their imaged points.  We do not know the process of how the image was formed, and other minor distortions may well be due to some unknown random variations in this process.\n\n","date":"June 9, 2015 at 3:57 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201430","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Daveb,\nThe fact  you just cannot substantiate your opinion speaks volume against it (you cannot even account for most of the TS image gaps!). I myself studied projective geometry in high school (Technical Drawing & Design lessons) for two years and was a stone cutter and carver (soft and hard stone) for one year at the CFC des Compagnons du Tour de France, Nantes, France. I can think 3-dimensionally all right, thank you. The TS man’s body was compressed in his shrouds (first configuration), that’s a fact you cannot deny unless you believe in a supernatural image formation process and you are in denial of optical facts as far as archaeological bloodstain patterns are concerned.  How can you deny for instance the TS man’s face or torso or legs was/were compressed front and back is just beyond me! How do you account e.g. for the very faint back PARTIAL blood image found of the face (maybe the hands) ONLY?” I remember you also believing in a miracle as far as the Jospice matteress man’s image was concerned. This is not serious at all!\nUnfortunately, several of Mario’s major & minor assumptions are biased i.e. non-archaeological e.g. model’s head tilted backward not forward, non-curved back, no folding at buttock level, one single shroud when actually several shrouds were used etc). Mario himself recognized the TS image is a projection, ALMOST (upper cases mine) orthogonal (that is not totally orthogonal). Besides state-of-the-art experimental archaeology has nothing to do with Mario’s reconstruction on which you almost blindingly rely: Mario totally keeps overlooking many a parameters: e.g. the collimation issue (and the role of “opaques” present in Jerusalem malky stone + judean desert storm dusts to account for the TS image fuzziness). Besides, he totally ignores the case of a shortened taharah in terms of wrapping in shrouds (more than two), purifying & drying (via alkaline solution and fumigation) to account for the lightly mordanted blood looking red in natural daylight as if it had been shed the day before. He also totally missed the long burial sheet could have been wet and first firmly drawn taut lengthwise over the head to the toes etc before being compressed widthwise. Methinks when Mario wrote his paper he was not familiar neither with Second Temple period funerary archaeology nor Judean burial core procedures or archaeological bloodstain patterns analysis. The latter is a must to reconstructing the TS man’s body wrapping in shrouds.\nOn June 9, 2013 at 5:47 pm, I wrote:\n“(…) there are more than mere orthogonal properties involved in theTS image. There are also slight shifts and displacements recorded:\n– at face level (most likely due to the presence of an impromptu small ‘jawbox’ consisting in two wooden pieces placed underneath on each side of the head and a shorter one on top under the chin and used in conjunction with a small face cloth (now kept in Manppello) and a skull cap (now kept in Cahors) on top of the TS so as to tightly shut the long burial sheet at head level). Most likely the three wooden pieces were sawn off the titulus damnationis).\nReminder: As early as the 4th centry, the TD is described as a relic divided into three pieces (one in Rome, one in Jerusalem and one in Constantinople) (…).” Most likely the two smaller shrouds (face cloth aka Veil of Manoppello + skull cap aka Headdress of Cahors) were (respectively) placed and fastened over the main burial sheet to shut it at head level and keep fastened the improvised head apparatus to keep the TS man’s mouth shut. This I deduced both from a close examination of the front and back head images, from the three shrouds and from my two attempts (!n 1994 and 1997 CE) at reconstructing the wrapping in shrouds of the TS man’s body.”\n“The TS man’s face does show many an image deficit implying air gaps and/or presence of screening objects. 3D images can give you a fairly good idea of the way prominent crease marks at headtop and chin level did fit the TS man’s head and imply the latter was bound and compressed as the (then watery solution in-soaked) shroud, literally do appear moulded around his head, front (and back). Partial/uneven extreme compression of the face could account for the very faint partial “second blood image of the head” found by Fanti at the back of the cloth.”\n“The blood marks seen on the hair of the frontal image of the Shroud of Turin were originally on his face (temples, cheeks and beard) not in his hair as they now appear to be in the image. Most likely in the process the long inner body shroud (aka the TS) got sort of taut again through shrinking, which account for some of the resulting blood marks (resulting from thorn punctures of the temple and forehead) seen on the face and hair to have been originally on the cheek (geometric distortion most likely due to shrinking up while getting sort of taut at one and the same time at face level). This tends to prove the blood decals came first, the body image second.”\nMy two attempts (!n 1994 and 1997 CE) at reconstructing the wrapping in shrouds of the TS man’s body, I repeat, had me understand at least TWO (slightly) different configurations of the long burial cloth in close conjunction with the corpse (from beginning to end via cloth-to-body sticking-gradually-unsticking process) were a must, not just one, to account for the integrity of the blood clots. Because a loosely draped/bound burial cloth just means NO collimation, it JUST CANNOT WORK to conclusively account for the TS bloodied body HD image. Cloth-to-body no air gap or almost no air gap front and back for a while (first configuration) is also a must here that does seem to totally eludes Mario and you.\n\n","date":"June 9, 2015 at 7:09 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201439","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"“I am sympathetic to Yannick’s hypothesis that the image may have formed by some unknown natural means, because of some exceptional circumstances concerning the burial, such as its environment in the tomb, and the use of myrrh, aloes and other herbs and flora.”\nPersonally, I think the exceptional circumstances that could have lead to the natural formation of the image have more chances to be found in the highly-traumatic state of the Shroud man’s body (and the influence such a traumatic state could had on the production of reactive post-mortem gases) and also in the very unusual short period during which the Shroud man’s body was present inside the Shroud…\nBy the way, here’s a suggestion of reading for Daveb (as well as for anyone else interested by the question of the potential authenticity of the Shroud): http://shroudnm.com/docs/2015-03-07-Eval-of-Anonymous-Person-Image.pdf\nThis is a long paper of mine that can be seen as a follow-up to the one I published in 2012 about the evidence of the bloodstains.  In this one, I tried to analysed in deep the question of whether or not the Shroud can be the one of an anonymous crucified man other than Jesus.  I think this could be an interesting reading for some of you (even if the paper is quite long).\n\n","date":"June 10, 2015 at 9:43 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201480","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I have never heard a printing an image on a linen cloth due to following occasions:\n1.By a Dead body before or after 3 days (or 72 hours)\n2. By a living body before or after 3 days\n3. By a traumatised dead body before or after 3 days\n4. By a traumatised living body before or after 3 days\nHope scientists can do more research based on the above conditions\nHowever we know that Shroud Image was created by a person who was dead and crucified, wore a crown of thorn, chest pierced and nailed at wrists and ankels.\n\n","date":"June 8, 2015 at 10:15 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201369","author":"Sampath Fernando","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Along with these conditions, I think it would be crucial to not forget the high probability of the presence of a thin and uneven layer of carbohydrate impurities on the cloth’s surface…  To me, that kind of chromophore is the most probable that we got in the light of all the most solid data coming from the study done by STURP and the follow-up studies done by Adler and Rogers.  I say the most probable because this could rationally explain the toughest characteristic of the image, which is its extreme superficiality, along with its more or less even density everywhere, no matter if we talks about the dorsal or the frontal part of the image.\n\n","date":"June 10, 2015 at 9:48 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201481","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Sampath there have been a few unusual cases.  Check posting “Any good reasons for associating anything supernatural with the shroud?”, July 20, 2013, and the ensuing thread.  Last time I mentioned the image on the Veil of Antinoe, and the Jospice Mattress image, I was greeted with howls of jeering & sneering, and I’m not going to repeat that again.  One correspondent mentioned images left on plastic by feverish children who had been medicated.  Volkringer patterns are another example.  De Liso’s seismic experiments in Piedmont produced images.  So images can occur in some surprising ways, but as most correspondents point out, there’s nothing quite like the Shroud image.\n\n","date":"June 8, 2015 at 11:08 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201372","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Actually, on September 19, 2012 at 7:16 pm, I wrote:\n“Father Dubarle wrote an article about the “Veil of Antinoë” (“a face veil excavated early in the 20th c. CE from a Coptic cemetery at Antinoë in Upper Egypt by French Egyptologist Albert Gayet. Apparently this veil, folded four times over the face, featured at least three imprints of the face it once covered”).”\n… and daveb of wellington nz\n(on September 20, 2012 at 4:06 am) replied:\n“I could only find two or three refs on the web to Veil of Antinoe, SHROUD SPECTRUM INTERNATIONAL, quarterly publication of the Indiana Center for Shroud Studies, issue no. 26, quote:\n“… Also of considerable interest is an article by Père Dubarle on the subject of the “Veil of Antinoë”, a face veil excavated early this century from a Coptic cemetery at Antinoë in Upper Egypt by French Egyptologist Albert Gayet. Apparently this veil, folded four times over the face, featured at least three imprints of the face it once covered.”\n“Unfortunately, although the Gayet collection still exists, and is now kept in the Louvre, the\nveil in question is either no longer extant, or its imprints have disappeared. As noted by Père\nDubarle, the pioneering French Shroud scholar Paul Vignon must have known of the Antinoë\nveil, but appears to have taken no interest in it.” (Looks like 19th C French Egyptology)\nI was unable to follow up any other reference.”\nMax Patrick Hamon\nSeptember 20, 2012 at 6:09 am\nDave see too DAL MANDYLION ALLA VERONICA Relazione di Massimo Centini:\n“il velo proveniente dal cimitero di Antinoe, in Alto Egitto: si tratta di un velo del 500 d.C., posto sul volto del cadavere di un cristiano. Oggi il reperto è scomparso ed è un vero peccato: il velo era ripiegato in quattro e su ogni lato riportava l’impronta del volto del cadavere; tre lati erano particolarmente visibili, mentre il quarto presentava un’immagine piuttosto frammentaria. Secondo il parere degli archeologi, la formazione dell’immagine sarebbe dovuta all’azione degli aromi usati per la sepoltura”.\ndaveb of wellington nz\nSeptember 20, 2012 at 6:52 am\nGoogle translate from Italian: “The veil from the cemetery Antinoe, in Upper Egypt: it is a veil of AD 500, placed on the face of the corpse of a Christian. Today the piece and disappeared and it is a real shame: the veil was folded in four and on each side carried an imprint of the face of the corpse, three sides were particularly visible, while the fourth had a rather fragmented. In the opinion of archaeologists, the image formation would be due to the action of spices used for burial”\nThat looks very significant indeed. Cloth of 500 AD (doesn’t say if linen, cotton or other material) spices (possibly speculation from hearing about Rogers or Maillard?), Possibly some doubt as to whether the veil has disappeared, or whether the image disappeared so the veil now can’t be identified?? I think it may have been deposited in the Louvre museum.”\nNOTE: “In the opinion of archaeologists, the image formation would be due to the action of SPICES used for burial” (here applied distilled spicy oil compared to spicy resin fumigation of watery solution in-soaked linen cloth)\n\n","date":"June 9, 2015 at 10:56 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201406","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"HughF carried out a number of tests in the hope of getting at least some blurry results from the decompostion of mice. Various treatments of cloth were tried, and the mice kept in a warm  incubator. Sadly, although putrescine and cadaverine were very much in evidence after a few days, none of the cloths or their coatings discoloured at all. Putting them in an oven for a few hours produced irregular discolouraton, but not sufficient to relate the discolouration to the shape of the mice. All rather a damp squib, I’m afraid!\nNabber, I understand that the bloodstains are not smeared, but “intact” is pushing things. Hardly any blood remains as it has mostly been abraded away, anyway, so if intact means that it’s all there, well it’s not. If the blood represents a contact layer – body on one side, cloth on the other, then the stains had no independent ‘surface’ at all, and the removal of the body inevitably exposed the inside, and pulled the adhering edges away.\n\n","date":"June 9, 2015 at 11:36 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201411","author":"Hugh Farey","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"“Sadly, although putrescine and cadaverine were very much in evidence after a few days, none of the cloths or their coatings discoloured at all.”\nIf there wasn’t a layer of carbohydrate impurities on the top-surface of your cloths, it’s quite normal you didn’t get much color!\nHave you tried the same experiment with a linen sample on which you would get the kind of carbohydrate coating described by Rogers?\n\n","date":"June 9, 2015 at 12:01 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201413","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"In other words, it’s not enough to get a good released of heavy amines near the cloth, it’s also crucial that this cloth get a thin layer of carbohydrate impurities on it.  And if we believe an chemist expert like Rogers, if these 2 conditions are reunited, EACH TIME, you WILL get a coloration on your sample!  More of course if you use the baking technique to reproduced the ageing of the cloth.  Remember that the image on the Shroud, if it was naturally produced, was probably latent for some time (maybe years or décades), before it could get visible to the naked eye.\n\n","date":"June 9, 2015 at 12:04 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201414","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"“HughF carried out a number of tests in the hope of getting at least some blurry results from the decompostion of mice. Various treatments of cloth were tried, and the mice kept in a warm incubator. Sadly, although putrescine and cadaverine were very much in evidence after a few days, none of the cloths or their coatings discoloured at all. Putting them in an oven for a few hours produced irregular discolouraton, but not sufficient to relate the discolouration to the shape of the mice. All rather a damp squib, I’m afraid!”\nHugh, where can we find a report of your experiments?\n\n","date":"June 9, 2015 at 3:08 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201426","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I didn’t write one. I’m having a rethink. I think the atmosphere was too dry, and am thinking of repeating the experiment in a more humid environment.\n\n","date":"June 9, 2015 at 4:07 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201431","author":"Hugh Farey","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Congratulations, Hugh, I hadn’t known you’d made a start.  As I recall you were intending to use Edgerton linen, which I presume has a coating of sugars.  Respectfully suggest you make some comparisons with De Liso’s work, to see if you can match her conditions, she experimented for 12 years, before publishing her paper.  You may have to move to California or find a colleague there to work with to get the seismic effects.  We usually manage two or three Force 5 EQs a year here in NZ, but one never knows where or when they’re likely to occur.  Seddon near the north of the South Island seems particularly active.  \nhttp://www.geonet.org.nz/quakes/felt\n\n","date":"June 10, 2015 at 3:43 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201513","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I used ordinary unbleached undyed linen, and treated it with various things including dextrose, singly and in combination.\n\n","date":"June 10, 2015 at 3:49 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201516","author":"Hugh Farey","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Message for Thibault: I have found a scientific study done on poultry carcasses that proves that putrescine and cadaverine molécules are normally produced within the first day following death and the level increase just before the start of active decay.  Of course, the study wasn’t done on a human corpse, but nevertheless, this is very interesting.  Two questions about that:\n1- who knows the amount of these molécules that would be needed to produce the kind of image we see on the Shroud?  Maybe the amount is far less than many people thinks!\n2- who knows if the highly traumatized nature of the Shroud man’s body could not have lead to the production of much more of these molécules than normal during the first 36 hours following death? \nWHO KNOWS?  I don’t think there’s someone right now who can answer these questions with any level of confidence.  More researches are truly needed!\nThat’s why we have no right, for the moment, to discard Rogers’ hypothesis for image formation in the form he described it!  No right…  We have to remain prudent here and not throwing it to the garbage because this would be a wrong move done way too fast.\n\n","date":"June 10, 2015 at 7:34 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201462","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Hugh: “Message for Thibault: I have found a scientific study done on poultry carcasses that proves that putrescine and cadaverine molécules are normally produced within the first day following death and the level increase just before the start of active decay. Of course, the study wasn’t done on a human corpse, but nevertheless, this is very interesting.”\nCan you give me the references ?\nThanks.\n\n","date":"June 10, 2015 at 3:15 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201510","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"This info came from me and not from Hugh.  And no, I can’t provide the reference for the moment.  Sorry.  I am currently writing an article with Fazio and I want to use this reference in it. If this reference make it through the peer-reviewed process, then you will be able to find it in our paper. If we don’t keep it in the final version, don’t worry, I will give it to you directly via email…\n\n","date":"June 10, 2015 at 3:35 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201511","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"It wasn’t me, Thibault, it was Yannick, but try “http://japr.oxfordjournals.org/content/5/2/161.full.pdf”\n\n","date":"June 10, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201514","author":"Hugh Farey","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"That’s not the study I was talking about but thanks for the link.  I will surely read this…\n\n","date":"June 10, 2015 at 3:48 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201515","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"“That’s why we have no right, for the moment, to discard Rogers’ hypothesis for image formation in the form he described it!”\nCould you be more specific?\nWhat image formation hypothesis are you supporting?\n\n","date":"June 11, 2015 at 12:24 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201560","author":"anoxie","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"You will see with the new paper I am currently writing with Fazio!  Just wait and you’ll see…  One thing’s for sure: On the contrary to some folks involved in the Shroud world, I am not dumb enough to discard Rogers’ hypothesis (in the form he described it) simply because the possibility is still there for him to have been right.  We simply don’t have enough information and experimental results right now to discard it.  But having said that, I tend to favored what I consider to be an alternative hypothesis to Rogers’ hypothesis.  I hope this alternative will remain in the new paper I am currently writing and that it will make it through the peer-reviewed process…  Just be patient.\n\n","date":"June 11, 2015 at 7:32 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201614","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"To complete my previous comment, I would like to say that we must always remember one crucial point about the image : It is VERY FAINT and there are no much color that has been produced by the image formation process!  In that context, who knows if the few heavy amines that can normally be produced by a dead body within the first 36 hours following death would not be enough to produce that kind of very faint image that do not show a lot of colored fibers?\nAnd if the highly-traumatized nature of the Shroud man’s body can really have accelerated the production of these amines within the body before active decay started (again, who know?), then I think the chances are even greater that this kind of « accelerated » production could have been well enough to produced a body image like the one on the Shroud…  Note : I don’t say that this is what happened, but I think we cannot, at the moment, discard completely this kind of scenario that is directly related to the highly-traumatic state of the Shroud man’s body.\n\n","date":"June 10, 2015 at 7:50 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201464","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I believe that a very sensible thing would be to set up a statistical work about cadaveric emissions (such work, however, must also take into account the environmental conditions = temperature, humidity, etc.) and thus : we have  to use the data obtained from controls with an electronic nose.\n Where we have the data?\nDo you know Arpad Vass?\nLink:\nhttp://en.wikipedia.org/wiki/Arpad_Vass\n[Dr. Ray Rogers indicated that name in the book:\n“A Chemist’s Perspective On The Shroud of Turin”…]\nAt present I do not see anything useful around the world.\nHave you found something of new?\nI seem to notice a lull in this kind of research.\nAm I mistaken?\n\n","date":"June 10, 2015 at 8:59 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201469","author":"piero","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I know a bit about Vass and his researches. I am currently writing what I consider to be a quite interesting article about image formation with Giovanni Fazio from Italy.  We hope to publish it in a peer-reviewed journal this year.  In it, we talk about this aspect of the question.  I have found some interesting scientific studies that seems to indicates that there can be a low amount of heavy amines produced by the corpse during the first day following death and that such a production increase dramatically after 24 or 36 hours, which is near the start of active decay.  I think this is enough to at the very least still keep Rogers’ Maillard reaction hypothesis (in the form he described it) as being a real possible solution for the image formation…  As you said, much more researches would be needed in that field to learn more about what kind and which amount of post-mortem gases can be produced and released by a dead body before active decay begins and also to learn if the highly-traumatic state of the Shroud man’s body could have contributed to accelerate the production of these heavy amines before the start of active decay.\n\n","date":"June 10, 2015 at 9:36 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201476","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Marcel Alonso (a french Engineer)\nwrote “Le Linceul de Turin est-il surnaturel ?”                                                           (Conférence de Marcel Alonso)\n= Is the Shroud of Turin supernatural? (Marcel Alonso Conference, march 2008):\n>Nous avons obtenu ainsi des “photographies” d’œufs, projetées (quasiment avec des lois d’optique), à plusieurs dizaines de mm. Ces “photographies” ont les mêmes propriétés que celles de Volckringer.\nRough translation =  We got so “photographs” of eggs, projected (almost with optical laws), tens of mm. These “pictures” have the same properties as those of Volckringer.\n>Les Japonais pratiquent un art national depuis le moyen âge: il font des GYOTAKU (empreintes de poissons). Elles sont toutes “tridimensionnelles”. Cette apparence de tridimensionnalité est une caractéristique commune à toutes les empreintes que nous avons analysées\nHere another rough translation:\n>The Japanese practice a national art since the Middle Ages: it make Gyotaku (fish prints). They are all “three-dimensional”. This appearance of three-dimensionality is a common feature of all the fingerprints that we analyzed\nLink:\nhttp://archeothonia.com/conferencemntv2008.htm\n— — —\nGyotaku.\nLinks:\n\nhttp://en.wikipedia.org/wiki/Gyotaku\n— — —\nIt’s already been several years since 2008 … but I do not see major innovations in this area.\nSo… I ask:\nIs it too difficult to do a gyotaku print with the human blood presence?\nI believe that our old friend Colin Berry, so imaginative in its experimental attempts, should be able to do something with a Gyotaku…\n>Gyotaku (gyo = fish, taku = rubbing) was invented in the early 1800s in Japan by fishermen who wanted to record their catch. Japanese fishermen took newsprint, ink and brush out to sea with them. Prints were brought back and displayed in the homes of the fishermen either on walls or in journals to be used as conversation pieces and to relate proud and heroic stories of the catch. \nLink:\nhttps://artsedge.kennedy-center.org/educators/lessons/grade-5/Gyotaku_Japanese_Fish_Printing#Preparation\n— —\nHowever I would be curious to see what is the real effect achievable with the use of a special facial shape,\nstarting from the use of ‘eggs by Marcel Alonso “…\n\n","date":"June 10, 2015 at 9:39 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201479","author":"piero","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"What I really like about DeSalvo’s hypothesis for image formation is the fact that he’s one of the very few Shroud researchers to have seriously taken into account the highly-traumatized nature of the Shroud man’s body and the potentially great influence it could have had on the image formation process…  Alan Mills in England is another one who considered this important aspect of the “puzzle”.\n\n","date":"June 10, 2015 at 11:01 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201489","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"This Gyotaku gives you a positive image and not a negative image. The image on the Shroud of Turin is a negative image.\nI don’t think if we wrap a live body or dead body (whether traumatised or not) with a linen cloth we won’t get a negative image through any biological process or chemical process similar to the image on the Shroud of Turin.\nTo get a negative image like on the Shroud of Turin, some sort of light, X-ray or some sort of radiation type waves have to be involved and also the surface of the linen cloth has to act like photographic or X-ray paper.\nAccording to Gospels only Jesus knew when he is going to die and resurrect. As such no one prepare a special linen cloth to wrap the body of Jesus. However Joseph of Arimathia found a brand new linen cloth to wrap the dead body of Jesus in hurry.\nHowever as a result of that we now got a miraculously printed image which was not painted as well as scorched.\n\n","date":"June 10, 2015 at 6:28 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201526","author":"Sampath Fernando","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"No. One must not get carried away by the photographic similarities of the Shroud. The intensity/distance relationship (if some kind of action at a distance is involved) or the intensity/pressure relationship (if there is only contact imprinting) is the same for the Gyotaku as for the Shroud. The Shroud image certainly gives the illusion of a photographic negative, as, in this particular case the intensity/distance and the intensity/pressure hypotheses are comparable to an intensity/luminosity relationship, which is what a photographic negative has.\nThat the comparison is illusory is easily understood by considering the beard, and eyebrows of the image of the Shroud. These may be assumed to have been darker in colour, in life, than other parts of the skin. Any bruises the man might have developed would also be darker than the surrounding skin, and perhaps the nose and lips also. However these all appear as lighter on the ‘positive’ than the surrounding skin.\nOf course the luminosity of a normal photo is related to the reflectivity of the surface, while the luminosity of a luminous body is related to the emission intensity of the radiation. However, the negative image of the Shroud does not look like a body glowing from within, it looks like a normal reflected light photograph. If we claim that in this case actual emitted luminosity can be related to supposed reflected luminosity, then we still have the curious paradox of why the hair should emit stronger radiation than the skin. Attempts to explain that for this unique occasion, the entire surface of the body was equally emissive, that the emission was entirely vertical, and that the emission was strongly attenuated (to zero over 4 cm) entirely by distance and nothing else, are not characteristic of any known radiative body.\nSo, no. “Some sort of light, X-ray or some sort of radiation type waves” do not “have to be involved” and “the surface of the linen cloth” does not have “to act like photographic or X-ray paper.”\n\n","date":"June 10, 2015 at 9:29 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201534","author":"Hugh Farey","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Hugh – That the comparison is illusory is easily understood by considering the beard, and eyebrows of the image of the Shroud. These may be assumed to have been darker in colour,\nNo Mr. Farey – Fine things like hair is acting like a lightening arrester when radiating.\n\n","date":"June 10, 2015 at 9:43 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201535","author":"Sampath Fernando","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Another very interesting aspect about the hair and static electricity.\nWatch this video\n\nWe don’t know anything about the resurrection process.\n\n","date":"June 10, 2015 at 11:43 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201554","author":"Sampath Fernando","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"If the Shroud is miraculous, then it doesn’t need Physics to account for it. If it isn’t, then comparing Jesus’s hair to that of the child above is not very helpful.\n\n","date":"June 11, 2015 at 1:00 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201567","author":"Hugh Farey","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I am not comparing the hair of Jesus to that child Mr Farey. But I am using it show the effect of radiation to the Shroud image.\nNo biological or chemical processes print the hair on a piece of linen.\n\n","date":"June 11, 2015 at 4:27 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201647","author":"Sampath Fernando","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"“But I am using it show the effect of radiation to the Shroud image.” But it doesn’t show the effect of radiation on the Shroud image. It doesn’t show anything relevant at all, does it?\n\n","date":"June 11, 2015 at 4:37 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201649","author":"Hugh Farey","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Shroud image is not a painting. Also image including hair couldn’t be be created by either biological or chemical processes.\nAs I mentioned a negative image could only be created by some sort of radiation (most probably came from the body)\nAlso Dr. Acceta’s experiement (using radio active elements) give clues to the emission of radiation to create an image.\n\n","date":"June 11, 2015 at 5:14 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201651","author":"Sampath Fernando","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Interesting…  You can also read this great paper: https://www.shroud.com/pdfs/ssi06part4.pdf\nIt is simply not true to affirm that the Shroud image is the only one with 3D characteristics incoded in it.  Nature can produce similar images.  That’s a fact.\nInstead of a transfer of heavy amines molecules as proposed by Rogers, DeSalvo proposed a molecular transfer from the lactic acid that could have been left all over the skin and hair of the Shroud man after the drying of his sweat.  This could be another great proposal to test under good lab control.  The reality is this : very few lab testing have been done to verify these natural proposals…\n\n","date":"June 10, 2015 at 10:29 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201486","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"The fact that nature can produce images on things that possess 3D characteristics is one piece of evidence that support my claim that there is not one single data coming from the Shroud that could lead me to think that some sort of supernatural event was at the origin of the image formation.\n\n","date":"June 10, 2015 at 10:39 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201488","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Hugh, reference yr comment on “intact” blood stains.  I admit that the meaning of  “intact” may be in the eye of the beholder; however,  consider the Shroud blood clots in the area off of the left elbow and the blood clot on the wrist:  most people who have pulled band-aids off of “scabs” probably remember that the pattern left on the fabric and that left on the skin show a number of internal “holes” that is formed completely randomly.   Even with the passage of time, you do not see that on those two Shroud blood clots.\n\n","date":"June 10, 2015 at 9:04 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201470","author":"Nabber","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"For Doctor Barbet, the expression “intact” concerning the bloodstains simply mean that, to his eyes, there is no obvious missing parts that would normally be evident to see for a trained eye if there would have been a manual extraction of the corpse after the complete drying of the blood clots and this is particularly true when it comes to all the bloodstains that represents “mirror images” of wounds  . Of course, over the centuries, there has been some abrasion of the surface of the bloodstains (Adler was clear about that), but nothing more than this.\n\n","date":"June 10, 2015 at 9:25 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201475","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I would like to make one more comment:\nPersonally, I strongly suspect that the key to unsolved the mystery of the Shroud image must be found in the very unusual combination of these elements: 1- A highly-traumatized corpse that has been scourged and crucified prior to his death.  2- The presence of a thin and uneven layer of carbohydrate impurities that was coating the topmost fibers of the cloth. And 3- The short period of time during which the corpse was present inside the cloth.\nTo my knowledge, no scientist has ever tried to reproduce these very particular and unusual conditions in order to see what kind of body image we can get on a linen cloth that would be manufactured with a method that would leave the kind of thin layer of impurities described by Ray Rogers.  Of course, being able to find a highly-traumatized body for this kind of experiment is almost out of range, but I think it would be possible for a biochemist to determine with some precision the exact nature of the post-mortem gases that could be released by that kind of tortured body (note that the possible presence of an abundant sweat all over the skin and hair that would be full of urea, lactic acid, etc., would be important to consider here, because of the possible release of some gases such a thing could produce) and then, to submit some linen samples that would get a thin layer of impurities on their surface to that kind of mix of gases for various length of time that could got from a few minutes to several hours. For that kind of experiment, the use of an easily defined object (why not using a freshly amputated limb from an animal or a human being on which you could put some “highly-traumatic” sweat?) from which these gases could be released would be a must in order to see if a clear image of that object can be produced on the linen sample.\nSeriously, I wouldn’t be surprised at all if that kind of experiment could produce some images or, at the very least, some yellow stains.  That should be a very interesting avenue of research to consider…  Of course, it’s not the kind of experiment that could be done by an amateur!  The best would be a biochemist who would be specialized in human corpses (a sort of CSI person).\n\n","date":"June 9, 2015 at 11:59 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201412","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I have several doubts about the presumed ethical use\n“of a freshly amputated limb” (!) coming from the human being (!)…\nI believe that now we could try to use the “artificial skin”,\nthis seems to me a more ethical choice.\nArtificial skin can be made in large quantities and frozen\nfor storage and shipping, making it available as needed…\nWhat do you think?\n\n","date":"June 10, 2015 at 8:45 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201467","author":"piero","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I think that would be a good choice.  As you can see, I’m no expert in those things…  But I think I came up with a good proposal of research.\nConcerning the limbs, don’t forget that Barbet was able to do so experiments with human limbs, so it is possible. But as you said, artificial limbs would be a more ethical choice…\n\n","date":"June 10, 2015 at 9:21 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201474","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Someone should study why de common sense is the worst respected of all senses.\nJos Verhulst had said a very common sense thing (June 8, 2015 at 10:2am) that has gone unnoticed by almost everybody: If the formation of the image of the Shroud were a natural process, we would have a lot of similar images.\nSo we have two possibilities only:\nThe image was produced by a process common in the Antiquity or Middle Ages that is not possible in the present days. That is the hypothesis of painting (or similar imprinting) with time degradation added. \nOr it is a miracle. \nBoth processes are difficult if not impossible to test. Time and resurrection are variable that we can not reproduce. Perhaps a more accurate testing of the cloth by an independent and interdisciplinary team of experts could find evidences about pigments or similar, but resurrecting a man is out of our possibilities… for the moment. \nOnly an answer is possible for the moment: we don’t know. \nI know that this methodical scepticism is not welcome by those that need confirmatory evidences for their faith or think that science can solve every problem in the universe. May be these are good reasons to refuse to hear the common sense arguments of the prudent man.\n\n","date":"June 10, 2015 at 1:48 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201453","author":"David Mo","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"“Jos Verhulst had said a very common sense thing (June 8, 2015 at 10:2am) that has gone unnoticed by almost everybody: If the formation of the image of the Shroud were a natural process, we would have a lot of similar images.”\nYes and no. It is possible the process was natural, but that the pre-conditions needed for the image formation are so complex that the odds of it happening twice are unlikely. This same kind of reasoning is often used when we talk about intelligent life outside our own planet. Yes, we see planets in the galaxies that are Earth-like — but is there intelligent life there? SETI would seem to have proven that if there is life out there, it is not intelligent enough to communicate with us. Is humanity like the Shroud, a one-off occurrence brought about by a series of coincidental causes? Are we a miracle?\n\n","date":"June 10, 2015 at 8:12 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201466","author":"David Goulet","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I am not a biologist but I think the hypothesis of the origin of life does not treat of the formation of a single organic molecule. Biologists make theories about the natural conditions able to produce organic molecules (in plural). The Shroud is singular. That is to say, the only one that has been produced in similar natural conditions.\n\n","date":"June 11, 2015 at 1:41 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201571","author":"David Mo","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I’ve already posted about a guy who kills this lady and puts her nightgrown over her face and when they found the body and looked at the nightgrown there was an image of her face on it. Louis posted about this guy who died and left a outline of part of his body on the bed. So it appears that a dead body can leave an image. \nAnd when I heard people write that it’s not the same as the Shroud I’m reminded of what Heraclitus wrote, “No man ever steps in the same river twice, for it’s not the same river and he’s not the same man.” \nSince we really don’t the exact conditions of the event I don’t think we can rule out a natural event no matter how very, very rare it happens. \nIf we don’t consider it may have be a natural event we have to deal with Louis’s question. I believe it was someone like, why this Shroud was saved.\n\n","date":"June 11, 2015 at 9:54 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201630","author":"John Green","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"“Is humanity like the Shroud, a one-off occurrence brought about by a series of coincidental causes? Are we a miracle?”\nGreat questions.\n\n","date":"June 10, 2015 at 9:13 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201472","author":"anoxie","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I suspect that, in both cases, this is possibly true…\n\n","date":"June 10, 2015 at 9:19 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201473","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I just want to add that if this is true, it would be the accomplishment of God’s Will in a way that is hard to fully understand for a human brain…\n\n","date":"June 10, 2015 at 9:38 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201478","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Re ‘3D fishprinting’ compared to ‘3D crucifixion-victimprinting’: in both cases a liquid medium mixed with uric acid and drying process are most needed\nWe can obtain the same result (i.e. a 3D double image/print) by replacing paper & ink mixed with uric acid by linen cloth & gelatinized starch mixed with uric acid. Low temperature (55°-85° C) alkali gelatinisation of starch residuals present in ancient linen cloths and mixed with uric acid is the key that could account for potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal (it is well known gelatine is a breakdown product of collagen). Indeed gelatinized starch mixed with uric acid as printing medium could have been a possible imaging factor in terms of ultra fine thermal printing paste as far as 3D image formation process is concerned.\nReminder: most likely (if we rely on the Biblical and Gospel accounts, Christolipsology (studies and research on Christ’s contact relics), the archaeological bloodstain pattern analysis and the burial core procedures as described in the Talmudic literature, the clean sindon/himation (used as a long narrow inner winding burial sheet in-soaked with an aqueous alkali solution) was first tautly wrapped lengthwise around the stiff rigid bloodied body from head to toe and then manually compressed widthwise in shorter dry clean outer shrouds to be subjected to a (myrrhic?) aloetic fumigation.\nRe the jospice mattress cover image as early as August 18, 2012, I wrote:\n“We also can create a very good fake with a tortured corpse covered in urine (BTW prolonged exposure to moisture from sweat, urine + pre- or post-mortem hyperthermia might well be the key factors to account for the Jospice mattress cover image).\nNote: Les’s corpse lying in supine position, its back was COMPRESSED against the mattress cover.”\n\n","date":"June 10, 2015 at 12:43 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201495","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Note: Manual COMPRESSION/rubbing of the crests and valleys of the corpse is another key\n\n","date":"June 10, 2015 at 12:46 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201496","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Typo: lactic and uric acids\nReminder: to obtain Volckringer patterns of small sprigs of herb or the individual flowers, you have to PRESS them between 2  sheets of blotting paper.\nMost likely the TS man’s blodied body was COMPRESSED in his shrouds (first configuration) and the drying and shrinking processes induced a slight cloth-to-body gradual COMPRESSION RELEASE mechanism (hence a second configuration).\n\n","date":"June 10, 2015 at 1:04 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201499","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Compression and gradual decompression induced collimation along with cloth-to-body sticking and gradual unsticking. The TS bloodied body image is the result of a self-collimated light mordancing extended to the back and front of the stiff rigid corpse of the crucifixion victim.\nOn April 30, 2015 at 10:56 am I wrote:\n“(…) methinks the crucifixion victim’s ‘smooth wet and dust-covered textile skin’ (or ‘second skin’ aka his aqueous alkali solution in-soaked inner winding burial sheet now known as the Turin Shroud), tightly moulded over his dust-sweat-blood covered body, acted as an image enhancing membrane for accurately aligning (collimating) incompressible vapour flow and orthogonally moved in terms of body-to-cloth gradual shrinking and unsticking front and back by means of the said flow as a thermal actuator.”\n\n","date":"June 10, 2015 at 1:30 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201503","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Typo: acted as an image enhancing membrane for accurately aligning (collimating) COMPRESSIBLE AND DECOMPRESSIBLE vapour flow\n\n","date":"June 10, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201505","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Gyotaku images are essentially bas reliefs (the fish) smeared with paint and imprinted onto paper. The same process would not work with people, who look less like bas reliefs than fish.\nAs an experimenter with cadaverine and putrescine, I can say that they diffuse all around the room in which they are created and sometimes into the corridor outside. If these gases reacted with anything clothlike, I feel sure we would know about it. However I very much doubt any collimated accuracy could be achieved with them.\n\n","date":"June 10, 2015 at 12:55 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201497","author":"Hugh Farey","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Did your cloths had a thin layer of carbohydrate impurities on their surface?  If not, it’s normal that the heavy amines did not produced much color…\n\n","date":"June 10, 2015 at 1:01 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201498","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Cadaverine and putrescine are a red herring.\n\n","date":"June 10, 2015 at 1:11 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201501","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Cadaverine and putrescine are a red herring.\n\n","date":"June 10, 2015 at 1:09 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201500","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Reminder: On September 13, 2012 at 12:45 pm, I wrote:\n“In the hypothesis the TSM is Yeshua’s, my reconstruction of his burial implies that between about two hours and a half and three hours after his death, 3.00-5.30/6.00p.m. or 3.30-6.00/6.30p.m., the reaction of Maillard was interrupted via his corpse fumigation. This is totally consitent with the evidence that supports a low-temperature image-colour-formation process.\nOr to put it in other words, the appearance of the decompostion amines (that would otherwise slowly appear at the surface of the skin under normal circumstances during the time in the tomb) was temporarily delayed. In this scenario, the Maillard reaction has nothing to do with the TSM’s image formation process.”\n\n","date":"June 10, 2015 at 1:48 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201506","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"If the image is naturalistic, it is evident that it can only occur under certain very specific conditions, otherwise more examples would be known.  Much of the above discussion is of the Either – Or variety.  I suggest that it may be so complex, that we do not really know what can be excluded, and that it requires some combination of causes.  They may include chemical, physical, internal, external, particulate or radiation or various combinations. \nIf amines are involved, there may be a clue in the imaging cut-off distance of about 4 cm.  Hugh has made the point that cadaverine and putrescine will rapidly permeate over a large area even beyond his laboratory doors.  If they were directly involved in the process, we would expect there to be a much larger cut-off distance in the imaging process, so perhaps as Max says, they are a red herring.  Perhaps it is in a short-lived precursor, such as lysine, or some other amine-like chemical.  Bodily chemicals which may become available at time of death are several, complex, and they interact.  Until an effort of concentrated study is made by those competent in this field of chemistry, to set out what the credible options might be, I feel so much of any discussion on the topic will remain as useless speculation. \nIf Colin Berry had had a less agenda-driven experimental programme, than attempting to demonstrate how an entirely fictitious artisan could forge the image, than in discovering how  such an image might have occurred by a naturalistic means, then all his work might have had results rather more intriguing than otherwise.  He now claims to have left the building!\n\n","date":"June 11, 2015 at 3:01 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201581","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Whether it be 3D printing of a crucifixion victim body between two sheets of linen cloth or small sprigs of fresh herbs, the fresh individual flowers and/or freshly caught fishes between two sheets of (blotting) paper, such a process requires moulding by either manually rubbing, pressing or compressing crests and valleys between the said sheets. Re the TS man’s bloodied body imprint, most likely gelatinized starch as printing paste mixed with lactic and uric acids execrated in his sweat was the printing medium.\nTo assert the TS man’s stiff rigid blodied body was not compressed in shrouds to yield a 3D imprint with minor distortions, is not only contrary to the Gospel accounts (and to Judean funerary customs, pratices and rites) but to facts of expericence (Volckringer patterns, Gyotaku images) as well.\nBesides compression/decompression in shrouds, remoistening and thermal drying processes are key processes too to account for the TS dorsal and ventral image formation overall process. It is no miracle at all either that the corpse of a deceased patient (Les who died on March 9, 1981 at 5:55 A.M.) left a 3D partial imprint on its matteress cover: his own dying/dead body caused the needed compression of the matteress cover and its exposure to moisture from sweat, urine + gradual drying through pre- and/or post-mortem hyperthermia and/or well heated hospital room did the rest.\n\n","date":"June 11, 2015 at 5:50 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201597","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Typo: its PROLONGED exposure to moisture from sweat, urine + gradual drying through pre- and/or post-mortem hyperthermia and/or well heated hospital room did the rest.\n\n","date":"June 11, 2015 at 5:54 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201598","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Note: Les died very early on a Monday morning on night-shift.\n\n","date":"June 11, 2015 at 6:06 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201600","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Reminder:  ammonia and/or lactic acid is present in eccrine sweat and urine and lactic acid is also produced through fermentation of plant derived carbohydrates and is an excellent moisturizing ingredient.\n\n","date":"June 11, 2015 at 7:10 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201608","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Re the Jospice matteress cover image and compression, here is a quote from Zubige: “a significant amount of weight was exerted on the hand from the weight of the body on the hand and in the shoulder area, the weight of the head on the lower part of the face area and on the shoulders.”\n\n","date":"June 11, 2015 at 7:43 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201616","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"After three years reading this blog I have come to believe that of all the hypotheses ever proposed for how the image came to be Charles Freeman’s comes closest to the mark even as his arrow misses the target by a country mile.\n\n","date":"June 11, 2015 at 7:06 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201606","author":"Paulette","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"To Paulette, it is easy to criticize but hard to act and substantiate your belief. BTW what is your opinion? Are you just another archmiraculist relying on biased observations?\n\n","date":"June 11, 2015 at 7:18 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201611","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"…half truths and exegetical mistakes?\n\n","date":"June 11, 2015 at 7:21 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201613","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"…and what is “your” sindonological ‘target’ all about?\n\n","date":"June 11, 2015 at 7:47 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201617","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"But keep an open mind, Paulette. There’s always a possibility that a naturalistic mechanism will turn up.\n\n","date":"June 11, 2015 at 7:20 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201612","author":"Hugh Farey","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Reminder for Paulette: Red Heifer ashes and/or Jerusalem limestone dust –mixed with water with or without lactic and/or uric acid– can gelatinized starch. In the hypothesis the TS is Yeshua’s, low temperature alkali gelatinisation of starch residuals present in ancient linen cloth could account for the bloodied body imprint recording in terms of ultra fine printing paste/medium and be right on the sindonological target center.\n\n","date":"June 11, 2015 at 8:45 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201622","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Typo: mixed with warm/hot (55°-85° Celsius) water\n\n","date":"June 11, 2015 at 8:53 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201624","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Paulettte, just too bad (after three years reading this blog) you still cannot hear the vibration of my arrows as they move down range and hit the target centre ;-)!\n\n","date":"June 11, 2015 at 9:03 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201626","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"In a way I’m glad that my intervention\n(with the figure of a fish reproduced in a Gyotaku)\nhas raised discussions. Obviously the Gyotaku is not my theory.\nIn fact it was a french Eng. (Marcel Alonso) that has indicated this way\n(as one possible example), the Gyotaku.\nIn fact I only believe what I see, in short, what I can observe carefully…\nAn easy experiment on the phenomenon of diffusion is to use rotten eggs\non silver plate and then observe the gradient for the gas action …\nSee:\n“Silver to Black – and Back”\nJ. Chem. Educ., 2000, 77 (3), p 328A\nPublication Date (Web): March 1, 2000\n>… In air, a silver object can tarnish owing to the reaction of silver with hydrogen sulfide (H2S). This is a gas found in the air as a result of some industrial processes and the decomposition of dead plants and animals. …\nLink:\nhttp://pubs.acs.org/doi/abs/10.1021/ed077p328A?journalCode=jceda8\n— —\nWhere are the results obtained from the careful controls (for example:\nbased on SPMs techniques) for linen fibrils involved in BIF?\nUntil now we have nothing (= no controls on experiments) to discuss.\n— —\nI believe we have to improve our own knowledges about\nArpad Vass and his researches…\nLinks:\nhttp://en.wikipedia.org/wiki/Arpad_Vass\nhttp://en.wikipedia.org/wiki/Forensic_entomological_decomposition\nhttp://en.wikipedia.org/wiki/Environmental_effects_on_forensic_entomology#Factors\n>Dr. Arpad Vass, Ph.D. Research Scientist.\n>Research interests:\nDeveloping technology to determine the post-mortem interval, locate clandestine graves and evaluate chemical markers associated with human decomposition…\nLinks:\nhttp://fac.utk.edu/\nhttp://fac.utk.edu/donation.html\nhttp://fac.utk.edu/faculty.html\n>ORNL’s Arpad Vass found that a dead body lying on the surface or in a shallow grave emits more than 400 different chemical vapors, some of which attract cadaver dogs.\nLink:\nhttp://web.ornl.gov/info/ornlreview/v37_1_04/article_18.shtml\n— — —-\nIs like a Gyotaku the footprint of the poor Les?\nMaybe … I’d like to read what is your exact idea,\nwhat is your definition (for example: “Pa-6 Gyotaku”?) for\nthat curious impression (on polyamide) on matteress cover of Liverpool.\nI think that, starting from the accurate study of this footprint, you can achieve\n(= … using “Reverse Engineering Technique”?) artworks on polyamide.\nThis may be an interesting fact for the Art market.\n… But I don’t like the idea to even arrive to joke with the fires of hell…\nI have no idea if the fumigation proposed by Max Patrick Hamon\nmay be feasible as a credible solution for the Enigma. For example: Where are the inherent experiments?\nHere is the other side of the problem: where is the evidence (on linen material) for X-rays?\n— — —\nIn my opinion a key factor to succeed in solving the Enigma\n(which is a “two faces Enigma” = 1. true epoch and 2. true origin\nfor the Imprint of the Body) is the use of advanced microscopies\non linen fibrils involved in B.I.F. (… first of all: during preliminar\nexperiments and after: on samples coming from the Holy Shroud).\nI wish to Yannick good luck\n… and I wish him to be able to do something of interest\nwith the help by Fazio.\n\n","date":"June 11, 2015 at 7:59 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201618","author":"piero","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Thanks for your wish.  I appreciate it.  I see the paper I’m currently writing with Fazio as a sort of preliminary analysis of the Maillard reaction hypothesis of Rogers and its potential to solve the Shroud image “mystery”, as well as an opportunity to propose a sort of alternative hypothesis for image formation that would still involved a Maillard reaction inside a thin and uneven layer of carbohydrate impurities on the cloth’s surface.  And near the end of the paper, if it remain that way, I decided to add some interesting proposal for future lab experiments that would surely help to know if Rogers’ hypothesis (in the form he described it) or my alternative hypothesis (which is not totally new but which would probably be published for the first time in a peer-reviewed scientific journal) could really have some chances to totally explain (or at least, partially explain) the image formation that happened on the surface of the Shroud.  I really hope this new paper will get published in the journal we have in mind.\n\n","date":"June 11, 2015 at 8:34 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201621","author":"Yannick Clément","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"This hypothesis is untenable by all that we know about te Shroud. Even the minimal contact of the resurrected body with the cloth would produce distortions on the image, which don’t agree with we observe on it. Those image features are compatiible too, with the cloth being rectified both up and below of the body, rather than involving it\n\n","date":"June 12, 2015 at 2:19 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201728","author":"Tersio Gorrasi","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"Tersio Gorrasi:  I presume from your comment that you reject a naturalistic formation of the TS image from a body to the cloth for geometric reasons.  You do not indicate whether the option you favour is a miraculous occurrence, or that by the hand of an artisan. \nThe orthogonal presentation of the image is I believe a particular problem for some assumptions for the arrangements of the cloth.  I have difficulty with a tightly wrapped body, which I would expect to show images of the sides, as well as a distorted widening of the image.  \nFor orthogonality to occur with no images of the sides, I think we would have to expect that at the time of image formation, both the ventral and dorsal aspects of the cloth would need to be fairly close to being planar, such as might occur with a photographic plate.    \nI see at least two possible ways that this might occur.  John’s gospel asserts that Nicodemus brought some 100 pounds (Roman) of myrrh and aloes (a lot).  In addition the burial occurred in a garden during the spring, when there would be ample foliage and flora at hand.  If the sides of the body were packed with the myrrh, aloes, foliage etc before being tightly wrapped, then both the front and back of the cloth might be just sufficiently planar to present an orthogonal image, and also conceal the sides of the body.  Such packing of the body might also allow later family visits to be relatively free from the stench of putrefaction.\nAlternatively, as the time was getting close to evening when a Great Sabbath would commence at about 6:00 pm, then the work of burial may have been cursory only, with the intention to complete it after the Sabbath.  In that case the cloth may have been loosely draped under and over the body, which may have allowed orthogonality.  Clearly also, the burial party would have disposed in some way of Nicodemus’ package, it is interesting that it is deliberately mentioned by John. \nFinally I suggest you refer to Mario Latendresse’s paper where he endeavours to demonstrate how the image might be satisfactorily explained using a live model:\n“The Turin Shroud Was Not Flattened Before the Images Formed and no Major Image Distortions Necessarily Occur from a Real Body” Mario Latendresse, Ph.D\nThe full paper can be read at: http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.160.656\nYou may prefer merely to check his slide show, which is self-explanatory:\nhttp://www.sindonology.org/papers/latendresse2005aSlides.pdf   \nI am not entirely happy with a miraculous explanation, as in that case I would expect a greater degree of perfection and total absence of any distortion, and even greater clarity.  Whatever caused the image, I believe could only occur under a remarkable and rare combination of physical, biological and environmental circumstances.\n\n","date":"June 13, 2015 at 7:19 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201820","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Guest Posting by Yannick Clément","post":"I would like to add something quite philosophical to my guest post:\nMy actual conclusion about the Shroud image (which could change along the road if new solid data forces me to do so) makes me consider it as not only an image related to Good Friday, but also to Holy Saturday and finally, to Easter, all together, in the sense that the Passion and death of Christ (Good Friday) would have contributed to start the image formation (through a natural process directly related to the presence of Jesus’ dead body inside the Shroud) and then, this image formation would have needed some time to “operate” during probably at least all the entire Sabbath day of the Jews (Holy Saturday) and finally, the process would have been stop “at the right time” (i.e. before the start of active decay, which would have damage the image and the cloth) when Christ’s body would have disappeared from inside the Shroud (Resurrection). I found this kind of viewpoint is quite interesting and I think anyone here (especially those who believe in Jésus-Christ) should meditate on it for at least some time (with an open-mind of course)!\n\n","date":"June 13, 2015 at 4:42 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","id":"comment-201812","author":"Yannick Clément","site":"shroudstory"}]
