[{"title":"Hello all you media reporters, whether mainstream (MSM), minor tributary (MTM)  or obscure backwater media (OBWM). Isn’t it time you released some air from the tyres of that truth-bending Shroud of Turin juggernaut?","post":"Errata corrige : “referred” and “In any case” instead of rerferred and “I any case” !… Sorry.\n","date":"November 21, 2017 at 4:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/11/16/hello-all-you-media-reporters-whether-mainstream-msm-minor-tributary-mtm-or-obscure-backwater-media-obwm-isnt-it-time-you-released-some-air-from-the-tyres-of-that-truth-bending-shroud-of-t/","cat":"agenda-driven_narratives","id":"comment-10247","author":"Piero","site":"colinberry"},{"title":"Hello all you media reporters, whether mainstream (MSM), minor tributary (MTM)  or obscure backwater media (OBWM). Isn’t it time you released some air from the tyres of that truth-bending Shroud of Turin juggernaut?","post":"I think that “Anonymous” (indirectly) rerferred to Lucotte and Thomasset (“An Osseous Remain on the Face of the Turin Shroud” [June 2017], an interesting new research [although they did use optical microscopy and SEM-EDX analyses …and not the non-destructive SPMs techniques …] on little particles and a discovery of the bone fragment coming from the broken nose…) when he indicated us the forensic examination of the nose area …\nHowever, the problem of Image Formation remains open …\nI any case (in my opinion) the concept “contact-and-progressive-loss-of-contact imprint” seems to be very interesting. But we have to know [from “Anonymous”] what are the exact inherent details/implications …\n","date":"November 21, 2017 at 4:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/11/16/hello-all-you-media-reporters-whether-mainstream-msm-minor-tributary-mtm-or-obscure-backwater-media-obwm-isnt-it-time-you-released-some-air-from-the-tyres-of-that-truth-bending-shroud-of-t/","cat":"agenda-driven_narratives","id":"comment-10246","author":"Piero","site":"colinberry"},{"title":"Hello all you media reporters, whether mainstream (MSM), minor tributary (MTM)  or obscure backwater media (OBWM). Isn’t it time you released some air from the tyres of that truth-bending Shroud of Turin juggernaut?","post":"Hullo Colin! The unequivocal motto for archmiraculists in Latin shall read: Video quid velo videre (“I see what I want to see).  As the one for archfraudulists, it should be: Non video quid non velo videre (“I don’t see what I don’t want to see”)\nTHE TURIN SHROUD MAN BODY’S NEGATIVE IMAGE DEFINITELY IS A CONTACT-AND-PROGRESSIVE-LOSS-OF-CONTACT IMPRINT (it is not a mere contact imprint as you contend; you are half wrong yet you are right and have some merit in debunking an allegedly “miraculous image” (it is a providential one DUE TO A SECOND TEMPLE PERIOD/SPECIFICALLY JUDEAN BURIAL RITE consisting in purifying the shed innocent blood of a Thorah Master and religious school Leader unfairly sentenced to death and executed in he Holy Land; his shed innocent blood being considered as a pollutant of the Holy Land then)\n","date":"November 21, 2017 at 1:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/11/16/hello-all-you-media-reporters-whether-mainstream-msm-minor-tributary-mtm-or-obscure-backwater-media-obwm-isnt-it-time-you-released-some-air-from-the-tyres-of-that-truth-bending-shroud-of-t/","cat":"agenda-driven_narratives","id":"comment-10245","author":"Anonymous","site":"colinberry"},{"title":"Hello all you media reporters, whether mainstream (MSM), minor tributary (MTM)  or obscure backwater media (OBWM). Isn’t it time you released some air from the tyres of that truth-bending Shroud of Turin juggernaut?","post":"I suspect this comment to be from someone previously banned from this site. Irrespective, this is maybe an opportunity to say that while I’ll allow comments and observations (if civil)  from non-journalists (the site now being targeted at media folk only) I shall rarely if ever respond personally, and instead wait till a fact-seeking journalist comes along to seek clarity. \nWhy the change of modus operandi?  It’s been well over 2 years, probably nearer 3 since my flour-imprinting Model 10 was published, here and on Dan Porter’s site, together with its unique  mobile chromophore feature, but I do not recall a single link to the idea or even this site being made in all that time. I strongly suspect that to be no accident…\nI have given up on the ‘blogosphere’ as a medium for communication/exchange of ideas. Sindonology operates essentially as a secret garden from which I and other sceptics are –  and have been – rigorously excluded.  All we get are dismissive putdowns, with no response to anything we then offer by way of information or explanation.\nSindonology has turned in entirely on itself. It’s abandoned any pretence of being answerable and accountable to the online world of ideas.\n","date":"November 20, 2017 at 2:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/11/16/hello-all-you-media-reporters-whether-mainstream-msm-minor-tributary-mtm-or-obscure-backwater-media-obwm-isnt-it-time-you-released-some-air-from-the-tyres-of-that-truth-bending-shroud-of-t/","cat":"agenda-driven_narratives","id":"comment-10242","author":"Colin Berry","site":"colinberry"},{"title":"Hello all you media reporters, whether mainstream (MSM), minor tributary (MTM)  or obscure backwater media (OBWM). Isn’t it time you released some air from the tyres of that truth-bending Shroud of Turin juggernaut?","post":"Re your comments “what none of them (Shroud researchers) seems to say – unlike Hugh Farey – is that the nose is FLATTENED!\nOn Dan Porter’s blog Max Patrick Hamon wrote: \n(as early as October 24, 2012 at 3:04 pm)\n– “Reminder: In the mortuary/morgue, corpses with “a skewed nose” are a well known fact. It is mainly due to having a corpse fin in in a zipped up body bag that was originally too small and cause excessive pressure on the defuncted’s face.”\n(and  on October 25, 2012 at 7:27 am); Max Patrick Hamon also wrote:\n– “The visual fact is, anyone observing the TS man’s face will (at first and maybe even second and third sight) see an ‘almost’ normal nose.\nHowever a very close examination of the face in terms of geometrical projection made from a life-size photograph tells us ‘a quite different story’:\nTo the sole exception of the bony areas of the eye-sockets and nasal septum, all the rest of the face shows irregular features and displacements.\nReminder here:\n– the TS man’s face was compressed by a sindon, sweat veil and skull cap (not to mention the possible recurr to a smal “jaw-box” made of three wooden pieces to keep the mouth closed, see my reconstruction).\nNow a forensic examination of the nose area reveals that in this operation the cartilaginous or fleshy rounded part of the nose would have been squashed.\nNow a forensic examination of the Sindon face tells us this area is not only squashed but also turned to the left with the TS man’s face right profile appearing as if embedded in his facial image..In the mortuary/morgue, corpses with “a skewed nose tip” are a well known fact. It is mainly due to having a corpse fin in a zipped up body bag that was originally too small and has caused excessive pressure on the defuncted’s face.”\n.\n","date":"November 20, 2017 at 1:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/11/16/hello-all-you-media-reporters-whether-mainstream-msm-minor-tributary-mtm-or-obscure-backwater-media-obwm-isnt-it-time-you-released-some-air-from-the-tyres-of-that-truth-bending-shroud-of-t/","cat":"agenda-driven_narratives","id":"comment-10241","author":"Anonymous","site":"colinberry"}]
