[{"title":"He’s back and it’s a doozy","post":"I read it. Snark and mockery – the mark of a true scientist. Talk is cheap, he should make a copy that matches the Turin shroud and put it to bed already. Or can’t he deliver?\n\n","date":"January 24, 2012 at 8:17 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7492","author":"Chris","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"He should read also the book of Pierre Barbet.  He would understand that there was a real dead man who spend no more than 36-40 hours in the Shroud.  After that time, the body was taken out of the cloth (or disappeared) and, before that event, he was able to leave a mirror image of his body and also a mirror image of many blood clots that were on his skin.  This is not a simple hypothesis or a possibility, this is a FACT.  Now, taking this FACT into account, the possibility for a forgery (using a dead body) is extremely low and the possibility that this is a simple artwork is absolute zero.  Period.  This is how I would summarize the most basic scientific facts we know about the Shroud of Turin.  But, when someone has made up his mind about this object, no way he will change it…\n\n","date":"January 25, 2012 at 11:32 am","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7518","author":"Yannick Clément","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"I just made a little mistake :  you should read “before that time, the body was taken out of the cloth”.  Sorry…\n\n","date":"January 25, 2012 at 11:33 am","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7519","author":"Yannick Clément","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"I must admit that this is completely news for me but, Yannick, after your recent posts on the work by Pierre Barbet, the implications of not detecting on the blood stains a process of unwrapping the cloth from a body, are obvious and go very far. I have got a few questions: Has his conclusions been confirmed by someone else? Was Barbet granted direct access to the Shroud? Why his work is not so widely known ?\n\n","date":"January 25, 2012 at 2:38 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7526","author":"Gabriel","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"1- I think other Shroud researchers agreed with Barbet on this point.  He was truly an expert in blood clotting.  He knew what he talked about.  Unfortunatelly, I can’t give you the name of another expert who agree with Barbet, but I know there is.  I’m pretty sure that during his days, Vignon, Volckringer and others agreed with him on this particular topic.  And I know doctor Gilbert Lavoie wrote about the fact that, for him, the quality of the blood stains on the Shroud was a sign of Jewishness because those people are particularly maniac (maybe even more during Christ time) regarding the fact that all the blood of a victim should not be disturbed during the burial rite and all the blood should be buried with him (even the blood that failed to the ground) in preparation of the general resurrection at the end of time (jewish belief).  But I don’t know if Lavoie agreed with Barbet on the sign of the resurrection we could see in the blood stains…\n2- No, because it was in the 30s and 40s he made his researches.  He had only access to good resolution photos of Enrie.  But, in 1933, he was outside in Turin on the big plaza in front of the St John the Baptist and they showed the Shroud in open air and with a good sunlight.  And he was pretty close to the Shroud at that time.  He said in his book that when he saw the Shroud in sunlight, without any glass protection, he immediately recongnize the particular signs of decals from humid blood clots.  And, with STURP later work (Adler particularly), they prove him right about that.  I wonder if there’s some STURP members (Adler in particular) who agreed with him on the subject of the undisturbed blood stains.  I don’t know the answer.  But for having read Adler’s book, I know he fully agreed with Barbet on the fact that the blood on the Shroud is not complete blood because it came mostly from still humid blood clots.  Most of the stains don’t come from blood in liquid phase, except some post-mortem blood from the holes in the feet (and maybe the blood that came from the side wound, but even this blood stain, for Barbet, came from a blood that has just started to clot).\n3- He’s not American or British !  And also, he made his experiments during the 30s and 40s.  Many people have a bad tendency to think old hypotheses regarding the Shroud must be wrong because there are some modern people who have proposed newer hypotheses.  I disagree completely with this kind of thinking, especially regarding the Shroud.  Just take Ray Rogers and his Maillard reaction hypothesis !  The genesis of this hypothesis came from one of the very first scientific hypothesis proposed by Paul Vignon (another frenchmen) at the very beginning of the 20th century (the vaporographic theory) !!!  Rogers at first didn’t thought this hypothesis could be true at all !  And then, he came back to it and realised that many elements from this hypothesis could be interesting after all…  The moral of this story :  old stuff not necessarily mean crap !!!\nLast comment :\n\n","date":"January 25, 2012 at 4:50 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7532","author":"Yannick Clément","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"Yannick: Thanks for your quick and very complete answer.\n\n","date":"January 25, 2012 at 5:09 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7533","author":"Gabriel","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"Thanks !  I just noticed that I completely forget to write my last comment !  Here it is :  It’s sad for the American or British ego but the French are the true pionneers of Sindonology !  They were the first to study in deep the photos of Secondo Pia around 1900 and the first to note that, from a scientific point of view, the Shroud was most probably not a painting of any other artwork but was most probably a real burial cloth that must have contained a real dead body.  As I said, they were the first also to proposed scientific hypothesis for the images.  Barbet was the first to do real crucifixion experiments on fresh body part and dead bodies, etc. etc.\nAnd I don’t say that because I speak french.  Here in Quebec, we’re not particularly proud of how the French droped us at the hand of the British army !!! ;-)  So, for us, the French are like a distant cousin…  No more than that.  Many english speaking people don’t know this but a quebecer and a french, it’s really not the same thing !!!\n\n","date":"January 25, 2012 at 5:45 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7534","author":"Yannick Clément","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"I just read it, too. The tone says it all. Actually, I was just going to say what Chris has: If he’s so confident, he should go ahead and make one. But maybe after he’s read a bit more about the Shroud.\n\n","date":"January 25, 2012 at 5:42 am","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7497","author":"Robert","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"The author of science buzz tells us that his blog is primarily about his “scepticism re media-hyped gee-whizz science, especially ‘pseudo-science’, as previous postings will demonstrate, NOT religion…”\nWell it certainly isn’t about science, either. Consider his 5th item in which he tells us, “Dorsal and ventral imprints may have been obtained from two different templates. Some claim dorsal and ventral images are not consistent. A quick play around with my laptop would suggest as much.”\nHe is out of his league. Look at the picture of the dorsal and ventral images that he put together in his blog. This isn’t scientific thinking. As a science teacher I would have given one of my 9th graders a failing grade if he turned in something like this. He has lined up the rightmost and leftmost edge of the cloth as though the feet were aligned to those edges. The best he can do is write, “some claim.” Who? What documentation? Forget the fact that hundreds of scientists spent thousands of hours studying the images on the shroud. Compare his “quick play around with my laptop” with the fifteen page paper, “Computerized Anthropometric Analysis of the Man of the Turin Shroud” detailing the real scientific work of Giulio Fanti, Emanuela Marinelli and Alessandro Cagnazzo of the Interdepartmental Center for Space Studies and Activities at the University of Padua. They are consistent. \nAlmost all of his 37 points are like point 5, not researched, not carefully thought out. Joe Nickell move over. You have competition.\n\n","date":"January 25, 2012 at 12:20 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7520","author":"Paulette","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"Very well said Paulette. I basically tried to say the same several weeks back, but alas it didn’t come out as eloquently.  ;-)\nR\n\n","date":"January 25, 2012 at 3:34 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7529","author":"Ron","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"I have responded to your point on my own site, Paulette …  I do not propose to go into detail here, given the amount of ad hom that passes for debate on this site…\n\n","date":"January 25, 2012 at 4:01 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7530","author":"sciencebod","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"Yannick, para completar su comentario, un muy buen trabajo sobre sangre de Carlo Brillante, Universidad de Bologna y también interesante la bibliografía que aporta en el mismo\n“Bloodstains characteristics to be considered in laboratory reconstruction of the Turin Shroud”\nhttp://xoomer.virgilio.it/bachm/BRILLAN2.PDF\n\n","date":"January 25, 2012 at 8:12 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7541","author":"co","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"Yet more Mickey Mouse science, co, in that Italian paper you cite. Like the idea that externalblood clots undergo fibrinolysis (in “moist air” natch).  When did you last see a blood clot reliquefy hours or days after an injury, instead of forming a sealing protective scab? \nFibrinolsis is about the dissolving of internal, as distinct from external blood clots, needless to say, the ones that might otherwise detach, migrate and lodge in the coronary or pulmonary venous blood vessels to cause infarcts and interruption of blood flow.\n But some here, notably Paulette, might care to take a glance at the paper’s introduction. Note the claimed 7cm difference in length of the front and rear images (see her earlier comment and the scorn she heaps on me for pointing out how obvious it is, even in the images avaliable on the internet). But first she will have to get down off that school ma’am’s high horse of hers ;-)\n\n","date":"January 26, 2012 at 3:23 am","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7549","author":"sciencebod","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"I’ve read the paper long ago and I agree with Sciencebod on the topic of the blood stains.  First, I want to say that I know there’s a lot of medical expert debates on this topic.  Co, I think you should read again Barbet.  Fibrinolysis had NOTHING to do with the blood stains on the Shroud.  If it would, then no way the blood stains would have borders so perfect like we see on the Shroud.  Fibrinolysis normally come with the first liquid of putrefaction !  Baima Bollone talks in his book about some experiments made by an Italian doctor Sebastiano Rodante about that and he show that the fibrinolysis of dried blood clot starts around 36 to 40 hours after the death.  In fact, the post-mortem fibrinolysis seemed to be a good indicator of the liquid stage of putrefaction.  Jesus body didn’t experiment this stage while he was in the Shroud because if it did, the images would have been messed up !\nBarbet thought that the blood clots were completely dried when the body was put in the Shroud and then, because of the aqueous atmosphere, the surface of the clots became humid enough to stain the cloth.  I think it’s possible, but my personal reflection (a very long one !!!) about this is a little different than his own reflection (proof that I don’t consider Barbet like God).  Effectively, after having check out the images lengthily, I firmly think that the surface of the blood clots  SHOULD HAVE BEEN humid enough (at different stages of the drying process) when the body was put in the cloth in order to stain the Shroud the way we see it.  And this is true ONLY for certain blood clots (those that were able to stain the Shroud).  I’m sure there was much more blood clots on the dead body of Jesus when he was put in the Shroud, but many of those clots were most probably completely dried when his body was put in the Shroud, so that they were not able to leave any stain on the cloth.\n\n","date":"January 26, 2012 at 2:00 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7558","author":"Yannick Clément","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"El Prof. Carlo Brillante ya trató el tema en 1981, “La fibrinolisi nella genesi delle impronte sindoniche”, el que usted hable de la ciencia de Mickey Mouse al referirse a Brillante, profesor de la Universidad de Bologna le da méritos suficientes para hacerse acreedor al término “bocazas”, hablar con la boca muy abierta de aquello que se desconoce……\nLos muertos no sangran de modo ACTIVO, la sangre de las grandes heridas que aparecen en la Sábana, clavos y herida del costado, son producto del derrame o volcado PASIVO de sangre líquida, que no ha iniciado la coagulación, y de COAGULOS ya formados, todo ello normal  en el CADÁVER cuando la sangre queda retenida o acumulada (cavidades derechas del corazón, cavidad pleural con hemotorax post-mortal, cavidad y retención tras la extracción de los clavos…).\nEn las necropsias los forenses diferencian los TROMBOS (coágulos de sangre en el árbol arterio-venoso producidos en VIDA) de los COAGULOS (coágulos de sangre producidos POST-MORTEM ya en el árbol arterio-venoso o FUERA de él). La estructura de ambos es distinta.\nSi se dan las circunstancias adecuadas (entre ellas un determinado ESPESOR de la capa o volumen de sangre) se producirá la coagulación y la fibrinólisis del coágulo, en el VIVO y en el MUERTO.\nEn el VIVO este ESPESOR es muy inusual en una herida o lesión externa porque se ponen en marchas los mecanismos de retracción de la herida y se contiene la hemorragia taponando la herida; pero cuando se produce el acúmulo en una cavidad natural con salida al exterior NO se producen las costras protectoras y SI se produce el coágulo y su fibrinólisis si el coágulo se mantiene y no es eliminado ( coágulos en la endometriosis, en la sangre menstrual de la mujer, en la epixtasis nasal mantenida etc, etc).\nEn el MUERTO la sangre POST-MORTAL , que procede siempre de derrame pasivo y/o volcado de la acumulada en cavidades, NO forma costras en el sentido que usted pretende, el coágulo se va endureciendo desde la superficie por la red de fibrina, se exprime reduciendo su tamaño y eliminando suero al exterior formando un halo y finalmente se reblandece y licua mediante el mecanismo de fibrinólisis.\nLe guste o no le guste a usted.\nPaul Vignon, biólogo, experimentó mucho tiempo con los COÁGULOS y el LINO, ¿cree que esos coágulos se transformaban en costras?. Los coágulos de sangre de Vignon, cuando se iniciaba la fibrinólisis producían improntas en el lino muy pobres y si la fibrinólisis se completaba emborronaban el lino, para desesperación de Vignon.\nEse ”momento exacto” en que la imagen es tan definida y nítida como se presenta en la Sábana no se ha podido conseguir en el laboratorio.\nMario Latendresse llamó la ATENCION sobre 4 marcas en la imagen dorsal  y en la baja espalda del Hombre de la Sábana en un bonito artículo:\n “ Why would a forger be so precise? The four circle blood marks on the back of the man of the Shroud”.  \nhttp://www.sindonology.org/papers/bloodMarksButts.shtml\nCon independencia de que sean o no sean causadas por el sedile,  la IMAGEN de esas marcas es IMPACTANTE y recogí en mi blog junto a las imágenes de Barrie Schwortz 1978, las de Secondo Pía 1988, Enrie 1931 y Durante 2002 para COMPARARLAS.\nhttp://lasabanaylosescepticos.blogspot.com/2010/11/son-las-marcas-del-sedile.html\nEsas imágenes que propone Latendresse:\n1.- NO pueden observarse en la práctica médica.\n2.- NO pueden obtenerse en el Laboratorio.\n3.- NO han podido por tanto ser OBSERVADAS por ningún artista falsario.\n4.- Son por tanto IRREPRODUCIBLES e INFALSIFICABLES .\nProbablemente usted, amigo de la buena ciencia, podrá dar alguna explicación para esas imágenes que sea MINIMAMENTE COHERENTE.\n\n","date":"January 26, 2012 at 2:47 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7560","author":"co","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"Hey, you don’t need fibrinolysis to obtain serum stains around blood clots !  It is a normal process of blood cloting ! Excuse me but fibrinolysis is NOT a normal process regarding the first 36 hours after death.  Sebastiano Rodante proves that with real time experiments !  I’m not making this up ! \nOn the 4 marks you mentioned from Latendresse website, I personaly think they are in fact traces of superficial burns that came most probably from some incense brand.  I’ve debate this point with Mario and he didn’t agree with me (OF COURSE, since he his idea was already settled about that !!!).  But I’ve studied the pictures well enough to know that he cannot scientifically prove his idea against mine.  Of course, I cannot do it either, but I think those marks are not blood at all and I have some good clues to say that.  Look carefully around each marks.  There are water stains, just like around all other burn marks !  This is a clear sign of burn marks.  Why deposit water on blood stains ???  Not logical at all.\n\n","date":"January 26, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7573","author":"Yannick Clément","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"\nGabriel :I must admit that this is completely news for me but, Yannick, after your recent posts on the work by Pierre Barbet, the implications of not detecting on the blood stains a process of unwrapping the cloth from a body, are obvious and go very far. I have got a few questions: Has his conclusions been confirmed by someone else? Was Barbet granted direct access to the Shroud? Why his work is not so widely known ?\nIt was Adler and Heller that ‘actually’ noticed there was no image under the blood (apparently) in 1980-81, not Barbet. Barbet was working from photo images only, he had no direct access to the Shroud or should I say fibrel samples from such, in his studies, that I am aware of.\nR\n\n","date":"January 26, 2012 at 2:57 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7562","author":"Ron","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"-Sorry Gabriel, let me retract my statement, as I misunderstood your statement. But I would like to say the fact that the blood stains are very ‘exact’, for lack of a better word, is I think good evidence to the images showing no sign of disturbance expected if the Shroud had been pulled off the body.\nR\n\n","date":"January 26, 2012 at 3:05 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7563","author":"Ron","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"Yannick, la coagulación y la fibrinólisis son temas de extraordinaria complejidad por la enorme cantidad de factores que intervienen, los propios de los tejidos, de la propia sangre, de los órganos con ello relacionados, de la forma y causas de muerte (en el caso de cadáveres) y de un montón de factores externos…..\nLa fibrinólisis NO tiene NADA que ver con la putrefacción.\nY como caso EXTREMO la coagulación de la sangre y su FIBRINOLISIS pueden acontecer en el cortísimo plazo de 2 horas.\n\n","date":"January 26, 2012 at 3:14 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7564","author":"co","site":"shroudstory"},{"title":"He’s back and it’s a doozy","post":"Rodante PROVE with experiments that fibrinolysis come for blood clot after 36 to 40 hours.  You can believe what you want, he PROVE this with real time experiments.  And, by the way, fibrinolysis liquify the blood clots !  This is not at all what you see on the Shroud.  It is decals from humid blood clots and not stains from blood clots that have been liquified.  Liquified blood clots would have done smear on the Shroud and the fact is :  there’s no smear at all, except maybe in one or two places (ref. : The study of UV fluorescent photos by Miller and Pellicori).  Other than that, there’s no smear at all.  Barbet would agree with what I just said…\n\n","date":"January 26, 2012 at 4:42 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","id":"comment-7572","author":"Yannick Clément","site":"shroudstory"}]
