[{"title":"How can you argue with this?","post":"Hair does not grow after death. Shrinkage of the skin layer due to water evaporation sometimes results in slight exposure of more of the root. There is no biblical description of Jesus, who could have had hair of any length. To what ‘biblical fact’ is your correspondent referring?\n\n","date":"May 30, 2013 at 4:56 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35322","author":"Hugh Farey","site":"shroudstory"},{"title":"How can you argue with this?","post":"It all depends what you call long hair. If you saw hair the length of that on the man on the shroud on a woman you’d probably say her hair was short or mid length. Women in the time of Jesus didn’t cut their hair, so long hair was really long. In that context Jesus could be said to have had short hair. Also Paul was referring to the way women decorated their hair in tresses etc.\n\n","date":"May 30, 2013 at 4:58 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35323","author":"Philip Maguire","site":"shroudstory"},{"title":"How can you argue with this?","post":"We went down this tiresome road within the last few months. Check the dorsal image of the head, there is a pigtail which appears to have some kind of oily dressing on it. The TSM has long hair. It is only the biblical literalists such as those in the “Church of God” who want to insist that Jesus had short hair. They misread scripture. Paul (brought up in Tarsus in Cilicia, and who never met Jesus in mortal life) tells the Greek Corinithians (not the Jewish Christians) to ask themselves whether nature itself does not tell them that long hair on a man is nothing to be admired (I Cor 11:14). Clearly the fashion in 1st century Corinth, and indeed throughout much of the Roman Empire was for short hair. Paul would not want his Greek converts to make themselves targets of mockery on the specious gounds of not complying with such trivial local customs. A blogger claimed there was a verse in Peter, I couldn’t find it; I think he confused Paul with Peter. A more interesting claim concerned the Arch of Titus erected in 81 AD in the Sacra Via in Rome celebrating Titus’ pillage of the Temple in Jerusalem. A frieze shows the victorious army carrying off the menorah and other temple spoils. It is claimed that the figures have short hair. Artistic licence and ignorance aside, it is not at all clear to me whether any short-haired figures depicted are Jewish captives or Roman soldiery. It seemed to me that some of the figures were certainly bearded and had hair of a reasonable length that could be called long. Someone more knowledgable may be able to comment with better authority than I can. Search on “Arch of Titus images”. \nClaims that Jesus had short hair seem to be based on no more than an anti-Catholic bias against classical depictions of Christ, and tenuous arguments are found to support such spurious claims. \nThe standard depiction of a bearded Christ seems to have commenced with the icons of the 6th century, and it seems very likely that the Image of Edessa (whatever that might have been – some speculate that it may have been the facial image of the Shroud) was the template for those icons. There may even be an earlier depiction, as an early mosaic found at Urfa also shows the same image with long hair and beard. \nA search on “Jewish rabbi images” will all show them with long hair and beards, particularly the ultra-orthodox, who clearly seek to follow what they believe to be the proper biblical traditions. \nIt is known that Moses’ brother Aaron had a beard so that it became included in a blessing, the nazirite under a vow was obliged not to cut his hair, the One on the throne is described as with hair like wool. There can be no strong argument that Jesus was beardless with short hair.\n\n","date":"May 30, 2013 at 8:31 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35340","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How can you argue with this?","post":"Hey, Guys, I think Dan wanted us to see the humor in this “reasoning.” It is too ridiculous to comment on.\n\n","date":"May 30, 2013 at 9:03 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35342","author":"Paulette","site":"shroudstory"},{"title":"How can you argue with this?","post":"Right. I should have called this post “Nonsense of the Day.” But I like the comments that are there.\n\n","date":"May 30, 2013 at 9:15 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35343","author":"Dan","site":"shroudstory"},{"title":"How can you argue with this?","post":"I’d still like to know more details about the frieze on the Arch of Titus, but then again it would assume an adequate knowledge of Jewish fashions in 70 AD on the part of the sculptor-artist. The Arch was constructed in 81 AD.\n\n","date":"May 30, 2013 at 4:13 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35384","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How can you argue with this?","post":"This is nothing but anti-Catholic bias, typical of religious communities called “churches” with no apostolic tradition. They are aware of that, develop a complex as a result, and aim at Catholicism in some way or the other  Did the blogger enter a time machine to see what Jesus’ hair was like as he lay dead in the sepulchre?\n\n","date":"May 30, 2013 at 10:33 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35350","author":"Louis","site":"shroudstory"},{"title":"How can you argue with this?","post":"He did not have short hair\n\n","date":"May 30, 2013 at 11:21 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35353","author":"jesterof","site":"shroudstory"},{"title":"How can you argue with this?","post":"What do the men of that era look like in a painting from that time frame??  If my memory holds true, they have a look of what is considered today to be “long haired”.  They did not look like they came out of a Barber Shop after receiving – not a short cut but a regular cut.  Of course if they were bald then they were bald.  Men had long hair but not as long as women usually wore theirs.\n\n","date":"May 30, 2013 at 4:18 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35385","author":"Emmett","site":"shroudstory"},{"title":"How can you argue with this?","post":"Not much in the way of painting of 1st century Jewish hairstyles – they didn’t like images. I’ve continued to pursue the question of a long-haired Jesus, no more conclusively. There’s a lot of confused discussion about it on the Protestant Triablogue web-site. The wittiest comment I’ve seen so far is: “I don’t know, Ask his hairdresser!”\n\n","date":"May 30, 2013 at 5:30 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35391","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How can you argue with this?","post":"I don’t know what you mean by “confused discussion”, daveb, but here’s the thread if anybody wants to read it.\n\n","date":"May 30, 2013 at 7:03 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35402","author":"Jason Engwer","site":"shroudstory"},{"title":"How can you argue with this?","post":"\nJason Engwer :\nI don’t know what you mean by “confused discussion”, daveb, but here’s the thread if anybody wants to read it.\n\nI checked the site and already the beginning fits the description of “confused” –\n A common objection to the Shroud of Turin is that the hair on the man in the Shroud is too long to be Jesus’ hair.\n“common” by WHOM? some people on the web who have no idea what they are talking about? if one would at least want to search the issue for real, one would dig into the history of iconography and immediatelly found out that the notion of “common objection” is probably not older than HuffPost blogging started…\n\n","date":"May 30, 2013 at 10:10 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35414","author":"jesterof","site":"shroudstory"},{"title":"How can you argue with this?","post":"The premise of his argument is presumptive and incorrect.\n\n","date":"May 30, 2013 at 10:15 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35415","author":"Andy Weiss","site":"shroudstory"},{"title":"How can you argue with this?","post":"I can’t believe I am reading this at a protestant site.\n\nThat is the start of the FIRST comment to actually interesting article, thank you, Jason Engwer\nThe arguments and the issue do not matter, but “I am reading this on a protestant site” (sic!) is priceless as an illustration whom I was referring above as the people who do not know what they are talking about.\n\n","date":"May 30, 2013 at 10:18 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35416","author":"jesterof","site":"shroudstory"},{"title":"How can you argue with this?","post":"Jason, To clarify my position: I thought the piece you yourself wrote was quite good, illustrating the difficulties in penetrating an aspect of 1st century Jewish or Palestinian customs. However the confusion giving rise to my perhaps uncharitable derision is I think evident in several of the comments which you yourself felt obliged to rebut, and very well too. The main problem I see with a certain type of too prevalent Protestant fundamentalism, is not so much because of its claims to be based on scripture alone, so much, as to how the same scripture is read and interpreted, and how it is perceived. It seems to me that rationality and critical thinking are relegated to a distant second or even third place, while personal perspectives mask the Truth of the text with claims of being guided or inspired by the Holy Spirit. There is a word for this and it is called “fanatacism”. Of such was the Tower of Babel built! I doubt if your readers could comprehend the concept that the Shroud might well be the “love-letter” from Jesus written to be fully understood only in the modern era with our technology and science, as it is not referred to directly in the New Testament. But the early Christians had to be discreet in the face of persecution, they did not cast “pearls before swine”, they knew how to keep their most precious secrets, and only oblique references will be found. For example, what reading might one make of Revelations 19:12-14 with its reference to the rider called Faithful and True on a white charger with a cloak soaked in blood and an army of heaven dressed in linen of dazzling white? Is this an oblique reference to the Shroud? Who knows? There is more!\n\n","date":"May 31, 2013 at 12:11 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","id":"comment-35421","author":"daveb of wellington nz","site":"shroudstory"}]
