[{"title":"How Knowledge is Created:  The Shroud of Turin","post":"It is not a huge revelation that we all filter information according to our world view, our preconceived ideas and opinions.  It is standard psychology that information that conflicts with our world view creates cognitive dissonance and must either be rejected (most likely) or accepted and integrated (less likely).  For those who hold strong opinions, conflicting information must be very persuasive to effect a change in that opinion.  We cannot tolerate being in a state of confusion so we form opinions that integrates information in accordance with our world view and rejects everything else.  The white lab coat of pure objectivity is an illusion.  Everyone has a bias and no one has all the information available on a given topic. This is exactly why the legal system of prosecutor and defense with 12 jurors is so important.  Not only will both lawyers present radically different views of the facts it is now up to 12 individuals to come to a reasoned consensus.  Each juror heard something different from the testimony of witnesses and evidence presented by both sides.  It is the closest we will ever get to the truth–and even then they get it wrong from time to time.  I have often said that when it comes to the Shroud, we cannot get to a verdict that is “beyond a reasonable doubt” as in a criminal trial.  However, I believe the “preponderance of evidence” will support authenticity.  But then again, thats my opinion based on my world view!\n\n","date":"October 31, 2014 at 6:04 am","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","id":"comment-167162","author":"Russ Breault","site":"shroudstory"},{"title":"How Knowledge is Created:  The Shroud of Turin","post":"“However, it is an article by historian Charles Freeman that may at last give some definitive answers”\nThat’s her opinion, shaped by her own worldview.\n\n","date":"October 31, 2014 at 11:58 am","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","id":"comment-167272","author":"Mike M","site":"shroudstory"},{"title":"How Knowledge is Created:  The Shroud of Turin","post":"Exactly!\n\n","date":"October 31, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","id":"comment-167363","author":"Russ Breault","site":"shroudstory"},{"title":"How Knowledge is Created:  The Shroud of Turin","post":"In fact her phrase, “may at last give some definitive answers” betrays her own bias–as if to say there have been no definitive answers given to date.\n\n","date":"October 31, 2014 at 4:05 pm","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","id":"comment-167364","author":"Shroud Encounter","site":"shroudstory"},{"title":"How Knowledge is Created:  The Shroud of Turin","post":"How knowledge is created? What if it is not created and comes in the form of intuitive knowledge, generated spontaneously, coming as though by accident? In this case the question of objectivity does not arise. Why? Because the knowledge comes spontaneously, it is not chosen and can come in the form of bad news. It leads to insight.\n\n","date":"October 31, 2014 at 8:15 am","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","id":"comment-167203","author":"Louis","site":"shroudstory"},{"title":"How Knowledge is Created:  The Shroud of Turin","post":"knowledge is a process. Is ultimate knowledge attainable? The  ultimate make up of matter is still not known.\n\n","date":"October 31, 2014 at 9:19 pm","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","id":"comment-167422","author":"Paul","site":"shroudstory"}]
