[{"title":"How not to get people to comment","post":"No comment!\n\n","date":"April 20, 2012 at 5:32 am","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","id":"comment-10627","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How not to get people to comment","post":"I posted this morning to the questioned blog:\nIf your atheism is founded on the same reasoning that leads you to post that the Shroud of Turin is a medieval fake, than you have a problem.\nThe medieval origin of the Shroud is preposterous. End of story. The image can not be replicated by any process demonstrated to have been used in the Middle Ages, actually, no process has been demonstrated today that can duplicate it.\nAnd the FACT is that the examination of the Shroud by forensic pathologists (are you one, or do you know one?) demonstrate physical conditions that are compatible with today’s science, but incompatible with known science until the turn of the last century. That is, until 1900 or so no artist – including DaVinci – had the knowledge of anatomy to accurately depict in minute detail the condition of a tortured, crucified man – right down to analysis the content of his blood indicating stress and torture.\nYour medieval faker was not only a genius of not yet invented technology, he/she was a master of not then discovered physical and anatomical processes which could only be meaningfully analyzed again, at the turn of the last century. (1900)\nAmong the autopsies published on the web is http://www.shroud.com/bucklin.htm\nThere is a plethora (a lot) more information at http://shroud.com\nI don’t feel sorry for your ignorance, but I do feel sorry for those you mislead. Your arrogance is not merited.\nIf I am harsh, it just that Shroud deniers who cite medieval origin for the Shroud are right-up there with those proclaiming Obama is a Muslem. He isn’t and the Shroud is not a fake.\nhttp://johnklotz.blogspot.com\nklotzlaw@gmail.com\n\n","date":"April 20, 2012 at 7:22 am","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","id":"comment-10633","author":"John Klotz","site":"shroudstory"},{"title":"How not to get people to comment","post":"“The image can not be replicated by any process demonstrated to have been used in the Middle Ages, actually, no process has been demonstrated today that can duplicate it.”\nMaybe that is because with one or two exceptions, notably John Jackson*, few of the Shroud researchers have tried, at least Dan’s STURP fraternity. Most seem more interested in nipping in the bud any proposals that it woz medieval arts & crafts wot dun it, often, nay invariably, on the most flimsy or fragmentary of evidence, Even so-called scientists have been known to issue challenges to nameless (shameless?) sceptics  wherever they may be to replicate all the supposedly unique characteristics of the Shroud (which if the truth be told are by no means as unique as they would have us believe).  Anything than have to roll up their own sleeves and get stuck into systematically designed model studies. \nIf you ask me (OK, so you didn’t) there is a yawning objectivity-deficit in Shroud so-called science, and has been since the 70s.\n* Jackson’s bas-relief findings could be cited as compelling evidence that negative images and encoded 3D information are easily obtained by thermal-imprinting (such a shame that he chose to abandon that line of research, just as it was starting to turn up trumps).\nPS: In case you weren’t aware, John,  I’m known as the ‘scorch man’ in these parts and as you will have gathered I’m frankly contemptuous of a lot of Shroud so-called science (and so-called scientists) which is why Dan now vets all my comments before allowing them to appear.\n\n","date":"April 20, 2012 at 6:56 pm","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","id":"comment-10654","author":"colinsberry","site":"shroudstory"},{"title":"How not to get people to comment","post":"Guess what? I commented as above on the atheist blog and it didn’t get posted. I think we should award the site the Pope Richard Dawkins “let’s not get carried away with this free speech thing” Medal.\n\n","date":"April 20, 2012 at 3:28 pm","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","id":"comment-10651","author":"John Klotz","site":"shroudstory"},{"title":"How not to get people to comment","post":"Thats not surprising, I find if ever you post a good comment which would require them too actually ‘check it out for themselfs’ or with irresputable information, they usually won’t post it. Free speech I don’t believe is a ‘motto’ on most of those blogs or forums.\nR\n\n","date":"April 20, 2012 at 6:27 pm","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","id":"comment-10653","author":"Ron","site":"shroudstory"},{"title":"How not to get people to comment","post":"I’m the guy at the atheist blog. Your post disappeared on its own. I thought you clicked the button to remove it. I’m planning to dissect your idiotic response when I get a spare moment. I never block a comment. Never. Especially not dumb ones like yours. They’re fun!\n\n","date":"April 22, 2012 at 10:53 am","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","id":"comment-10703","author":"Keith O'Connor","site":"shroudstory"},{"title":"How not to get people to comment","post":"How does a post disappear by itself? If you think his comment was dumb you have a serious problem bud. I’m waiting to read your dissection, I’m sure it’ll be filled with rediculous untruths, conjectures and basically nonsensical statements.\nRon\n\n","date":"April 22, 2012 at 12:46 pm","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","id":"comment-10709","author":"Ron","site":"shroudstory"}]
