[{"title":"Image by scorching heat? Or science by hot air?","post":"Hey, I’ll give him this: maybe it IS a scorch but now he has to demonstrate how it was done by human hands. If it winds up being a scorch that cannot reasonable be made by medieval human hands he’s got a lot of splaining to do. \nMy prediction is it can’t be done in the manner in which he’s suggested which is why he keeps begging out.\n\n","date":"February 20, 2012 at 11:16 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8535","author":"Chris","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Hello again Dan\nHere’s a little something to be getting on with. One can take any old scorch image on linen, load it iinto a software program that converts image intensity (half tone or otherwise) into 3D relief, and convert from flat plain to spectacular peaks and valleys.\n here’s before tweaking the controls\n and here’s after \nWho will be the first to say there is mysterious “encoded 3D” information in my scorch mark? Yet that is what they say when they put the Shroud image through this type of matrix-transformation (applied maths, not science) to convert planar images into spell-binding 3D, usually in fluorescent ghostly green, the stuff of hour-long TV programmes (“the real face of Christ etc”) …\n I hope I’ve done the tags properly this time\n\n","date":"February 20, 2012 at 11:52 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8536","author":"colinsberry","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Colin, we’ve been here before. Of course, you will get 3D relief from any scorch. You;ve told me that and I have always agree. You’ll get it from a drop of ink on blotter paper. You’ll get it from squished bugs and bloodstains and any spot that is lighter or darker than its surroundings. Duh! There is nothing magical about this. You get it from paintings and photographs, too. In demonstrating the old VP8 they would use a chess board. \nThe whole point is do you get 3D that looks realistic for what is being plotted, in particular a face or a human body. It is a judgment call. And adjusting the gain and the blur is not only permissable, but expected. \nAs for the fluorescent ghostly green screen, maybe you’re too young to remember old fashioned dumb terminals with their fluorescent ghostly green screen. It wasn’t made for TV.\n\n","date":"February 20, 2012 at 2:40 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8549","author":"episcopalian","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Is this idea really new?  Heller & Adler (no personally directed comments please, let’s just focus on the science) reported in their paper published in the Canadian Society of Forensic Sciences Journal 14 (3), 1981, “This would suggest some type of low temperature heating process or a high temperature of extremely short duration (insufficient to produce carbonization) as a mechanism for production of the image.”  \nIt seems to me that the same arguments apply to those discussing the existence of blood: if one concludes that it is indeed real blood present on the Shroud, scientifically you can’t use this to claim authentication.  Someone could always argue that a forger used real human blood.\nLikewise, if the image did result from a type of scorching event/mechanism, is this really a smoking gun for the disauthentication of the Shroud?  Seems to me you could use the argument either way.  Sorry, but I say: Show me the Money…Scorch a Shroud.   \nColin, I’d like to add, that I appreciate your ideas & opinions-it would be a dull, dull world if everyone thought alike, especially in the scientific community.  I respect your skepticism & your science-driven suggestions/hypotheses.\n\n","date":"February 20, 2012 at 12:38 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8538","author":"Kelly Kearse","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Thank you Kelly. Your comment is much appreciated, especially in view of the derision expressed elsewhere. With that I shall now take a break from this site, but maybe look back again in a week of so.\nThe great thing about any scientific idea  – regardless of merit – is that once the genie is out of the bottle, even the most determined foe finds it well nigh impossible to re-bottle it…\n\n","date":"February 20, 2012 at 1:23 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8543","author":"colinsberry","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Hope you’ll be working on your sandbox/heated sculpture experiment…\nSee you in a week Colin.\nR\n\n","date":"February 20, 2012 at 6:56 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8556","author":"Ron","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"I’m at work at moment so dont have time to address this properly, but I found Fanti’s paper that I think Colin got the information about the nature of the image and the hemicellulose.\nhttp://www.ligklaedet.dk/images/SUPERFICIALITY%20published%20JIST.pdf\nIn the paper Fanti et al goes out of his way show (in Figure 7), that the image have many characteristics that dont seem to tally with the contact theory.\nIn particular coloured fibrils going into furrows (not just being on the crests of the threads as was implied). Other peculiar aspects like abrupt striations (interruptions of the colouring) on many parallel fibrils, and the continuation of a colouring pattern across separate parallel threads (with a gap between), make the fuse wire theory struggle a bit there. \nI think the biggest problem is the double image on the other side, which Colin made two very lame attempts to explain, but to my mind are totally inadequate for the job. Fanti also dismisses another explanation that perhaps the image wraps around along the fibrils to the other side.\nPersonally I’m still keen on the theory as it has the possibility of accounting for some but not all of the characteristics. However unlike Colin, I am not willing to ignore data that doesnt fit in with the theory (that it is what I also call being in denial!), and I dont think its enough to say its done and dusted until experimental proof is furnished.\n\n","date":"February 21, 2012 at 6:27 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8571","author":"ArtScience","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Tut tut. So I am ignoring the key content of figure legends, eh? Good, isn’t it, when you have to put figure legends under the microscope to find the preemptive knocking copy on the contact theory, which then does not rate so much as a single mention whatsoever in discussion? Instead the discussion makes brief reference to two other hypotheses, both of which I regard as chemical or physical bunkum that make a complete mockery of scientific laws and principles (image-forming chemical diffusion and corona discharge).  I ask you, who is the one attempting to bury the bad news? Not me, I can assure you. if there is  serious scientific objection to what I have written, and folk can make it without slipping in snide character attacks, like suggesting I deliberately “ignore” inconvenient data  or try to browbeat with words, then bring it on is what I say…\nThere’s a simple explanation for the presence of limited scorch coloration in some (not all) nooks and crannies – namely secondary thermal effects. That’s  what one tends to get with heat (surprise, surprise) but not with adhering pigment like rust, which the authors were at such pains to slip into that figure legend – just in case anyone got the wrong idea that it was all about (shhh – scorching by contact with a hot body) as the PREDOMINANT  location of colour on thread crowns would suggest.\n\n","date":"February 21, 2012 at 8:35 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8577","author":"colinsberry","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Colin, I think again you are doing your normal rant and not addressing the problems with the theory. Again try the second image on the back…is that a secondary thermal effect as well?\nExplain.\n\n","date":"February 21, 2012 at 8:58 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8578","author":"ArtScience","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Let’s stick to a structured approach shall we Art? The central and key question is what produced the main image on the body side of the cloth. I can’t see that you can falsify one or other theory by speculating on what may or may not have happened on the opposite side, unless you have a rival hypothesis to put up, or new experimental data, e.g.with those temperature or infrared probes I suggested earlier.. If you haven’t, then scorching by contact – with the possibility, indeed probability of secondary thermal effects – is the only game in town, Scienceville that is…Everything else is pie in the sky…\n\n","date":"February 21, 2012 at 9:30 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8579","author":"colinsberry","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Well I did give my rival steam hypothesis, assuming scorching was the only game in town (which it might not be), but it was as much rubbish as yours. \nAnyway go ahead and test then, its just that I fail to see how a very faint image is expected to re-radiate giving infra-red strong enough 1)to go through the intervening reflective threads and heat up the sand on the other side strong enough to pyrolyse an image there  2)whilst standing out from the already over strong infra-red already coming off from the bas-relief. I think you know this is also pie in the sky…\n\n","date":"February 21, 2012 at 12:33 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8587","author":"ArtScience","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"You need to get some hands-on experience – literally – with a hot branding iron on linen. Put your hand behind the linen – where my sand bed interface would be situated. Feel the force – or rather the temperature. Nerve endings are a poor substitute I know for separate temperature and infrared sensors, but they do at least alert one to the possibilities. As for your steam hypothesis – does it also generate a cornucopia of experimental possibilities? I’m sure I need hardly remind you, Art,  that the value of a hypothesis in science lies not so much in whether it ultimately proves to be right or wrong but in the possibilities it opens up for new and potentially fruitful lines of research.\n\n","date":"February 21, 2012 at 12:49 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8588","author":"colinsberry","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"I’m sure heat and ir are gonna get through! That’s not the problem, but will it get through whilst not pyrolysing the intervening fibrils, in sufficient amount to heat up the sand, in such a way as to distiguish that bit of sand from the rest of the sand which is already being bombarded by ir straight from the metal! I don’t think I’m getting through to you, am I?\n\n","date":"February 21, 2012 at 1:03 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8590","author":"ArtScience","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"And what the heck is secondary thermal effects and how does this explain the colouring in furrows, striations, and continuation of pattern across to separate threads?\n\n","date":"February 21, 2012 at 12:50 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8589","author":"ArtScience","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Secondary thermal effects? When you apply a hot template to linen with its natural moisture content you will first get heating, expansion, evaporation of water and then pyrolysis. After  pyrolysis –  with its weight loss due to driving off more water, CO2, CO etc you then get contraction. Is it any wonder then that the initially scorched area will show some movement relative to the furrows and crevices of the fabric when you have thermal expansion and contraction going on? That’s quite apart from any mechanical stretching of the fabric that takes place when one presses a hot template into the fabric with some force with a view to getting a good imprint. That stretching of the fabric will tend to temporarily flatten the fabric, i.e. the crowns will tend to drop into the general plane of the weave, and that will then expose parts of the thread adjacent to the crowns that were previously NOT proud of the surface. When the fabric cools and contracts, those additionally scorched areas will tend to retreat once more into the furrows and crevices. \nI do think you have to (attempt to) refute the idea of scorching by direct contact at a more general level, if you don’t mind my saying, and not try to conjure up killer arguments that depend on speculation about the incidental details. You need to account for the preferential scorching at the crowns, for example. How can that be explained by any model other than scorching by direct contact?\n\n","date":"February 21, 2012 at 2:09 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8592","author":"colinsberry","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"\ncolinsberry :\nI do think you have to (attempt to) refute the idea of scorching by direct contact at a more general level, if you don’t mind my saying, and not try to conjure up killer arguments that depend on speculation about the incidental details.\n\nI think you misunderstand me, Colin. I actually think the theory has potential and so like any good  scientist I want to become my own worse critic and find any possible flaws…I want to be able to see problems and have answers to them, or if need be readjust my views  (which are always a bit in flux until I really feel as though I’ve nailed it). This approach has made me re-adjust a couple of times….most notably with the Hungarian Pray Manuscript which I cant see really how any honest scientist cant be at least willing to put a question mark over the C14 dates.\nA straight out question to you, Colin….arent you just a teeny weeny bit disconcerted by the Hungarian Pray Manuscript? An itsy witsy bit maybe? I think we’re alone here, you can just whisper your answer in my ear ;)\nBTW even if the Manuscript were taken on face value, it could all be done with a bas-relief still (just added that in to allow  some face saving!)\n\n","date":"February 21, 2012 at 7:06 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8616","author":"ArtScience","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"“A straight out question to you, Colin….arent you just a teeny weeny bit disconcerted by the Hungarian Pray Manuscript? An itsy witsy bit maybe? I think we’re alone here, you can just whisper your answer in my ear ;)”\nNope, just hugely bemused that anyone would think that the Pray artist would imagine that the L-shaped poker holes he had seen in the Shroud had been there from the word go, when used to wrap the body and dutifullyu add them to his picture,  And if he had been so keen to incorporate details from the Shroud for the sake of authenticty, why did he not show the nail hole in the wrist, the blood trails on the forearms, the pierced side etc etc. Indeed, why did he make it seem as if the body had been thoroughly cleaned up, when according to the Shroud the opposite was true? \nOne’s reminded of archaeology, where a single tool or fragment of bone is used to reconstruct entire lifestyles of nomadic hunters, their funeral rituals etc – or so we are asked to believe. Human beings have a seemingly infinite capacity to get carried away by their own theorising, often based on little more than fragmentary evidence.\n\n","date":"February 21, 2012 at 8:10 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8624","author":"colinsberry","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"\ncolinsberry :\n  And if he had been so keen to incorporate details from the Shroud for the sake of authenticty, why did he not show the nail hole in the wrist, the blood trails on the forearms, the pierced side etc etc.\n\n….and here’s a little clue for you, Colin…an illustration is not a photograph. We already know in the gospels that Jesus had been nailed and then pierced with a lance….and its not shown on the body illustrated…does that imply its not Jesus being illustrated. Nope, it means that artists dont put in everything, especially when somethings are a given as understood….making it all the more striking why include the details like the poker holes and the blood on the shroud and herringbone pattern, plus illustrate a Jesus naked and with crossed hands with missing thumbs (never before seen in christian illustration).\nSorry Colin, you give all signs of being from the raving bonkers school of scepticism, which refuses to admit anything at all to the other side (btw arent you glad I established that cellulose has a low conductivity inspite you resisting like I was extracting teeth from you without anaesthetic…cellulose having a low conductivity might help explain why there is only surface scorching that doesnt penetrate into cellulose)\n\n","date":"February 22, 2012 at 5:17 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8629","author":"ArtScience","site":"shroudstory"},{"title":"Image by scorching heat? Or science by hot air?","post":"Looking at that latest example of special pleading, Art, I’m beginning to think it’s not so much Occam’s Razor that is sorely needed in Shroud Fantasy Land so much as a jungle machete.\n\n","date":"February 22, 2012 at 6:40 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","id":"comment-8630","author":"colinsberry","site":"shroudstory"}]
