[{"title":"Important Comment","post":"Bravo, Dave.\n\n","date":"February 16, 2015 at 2:29 pm","url":"https://shroudstory.com/2015/02/16/important-comment/","cat":"comments_promoted","id":"comment-191213","author":"Andy","site":"shroudstory"},{"title":"Important Comment","post":"Thanks for posting this, Dan.  I had a slight senior moment in making the comment, the Shroud is of course 4.34m x 1.09m, not 4m x 2m, but I stand by the comment, the complexity  of weaving and the dimensions of the Pazyryk in 5th c. BCE were a surprise to me. \nA quick reference with an illustration can be found at http://en.wikipedia.org/wiki/Persian_carpet  \nArticle quote: “The exceptional Pazyryk carpet was discovered in 1949 in an archaeological excavation in the Pazyryk Valley, in the Altai Mountains in Siberia. The carpet was found in the grave of a Scythian prince. Radiocarbon testing indicated that the Pazyryk carpet was woven in the 5th century BC. This carpet is 283 by 200 cm (approximately 9.3 by 6.5 ft) and has 36 symmetrical knots per cm² (232 per inch²). The advanced technique used in the Pazyryk carpet indicates a long history of evolution and experience in weaving. It is considered the oldest known carpet in the world. Its central field is a deep red color and it has two wide borders, one depicting deer and the other horsemen.” \nOf particular significance is “… The advanced technique used in the Pazyryk carpet indicates a long history of evolution and experience in weaving”.  The inference has to be that complex weaves of comparable dimensions in the Middle East were firmly established even well before the 5th c. BCE, and it would seem a small step from wool to linen.\n\n","date":"February 16, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/02/16/important-comment/","cat":"comments_promoted","id":"comment-191214","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Important Comment","post":"It is true that, up to now, no 3:1 herringbone (which is not technically similar to 2:1 or 4:1 according to Vial), Z spun, large linen fabric from the Roman period has been found in the Palestinian area.\nNevertheless, several fabrics have been found in this area or neighboring countries which have one or two of these fundamental characteristics.\n– Long and large fabrics. Like the TS we have many examples of fabrics woven “by the kilometer”.\n– Z twist: it is true that it is not characteristic of the Palestinian area, nevertheless “although quite rarely, LINEN threads with a Z TWIST have been mentioned at Palmyra and in the Judean Desert” (G. Vial with references).\n– The 3:1 herringbone twill: Damask cloth, for example those of Palmyra, Treves, Conthey, Ribeauville, cologne, Holborough are ‘derivatives’ of 3:1 twill butt they are in silk. \nDiana Fulbright’s paper (thanks OK) is also interesting:\nhttp://www.acheiropoietos.info/proceedings/FulbrightAkeldamaWeb.pdf\nMy Conclusion: although we have- to my knowledge- no example of a cloth (or a shroud) from the first century in the Middle-East with ALL of the characteristics of the TS, we can infer from the archaeological findings that there is no technical reason to rule out the TS as a first century fabric.\nTaking into account the technical characteristics, it was possible to make it in the first century CE, and\ntaking into account the fact that Middle-east (including Jerusalem) was, during the Roman period, a crossroads of trade,\nI conclude that there is no technical nor historical reason to rule out the TS as an imported fine linen cloth (from Palmyra or Greece or Italy…).\nOn the other side, there are, up to now (to my knowledge), only two documented 3:1 linen herringbone from the medieval period.\nThe first one is cited by Vial: ” The only herringbone in linen so far analysed and published is that cited in note 10. It is very LATE SECOND-HALF OF THE 16TH century- and much simpler than that of Turin. The number of threads per centimeters in its main warp is practically half of the Turin count ..”\nIt is a painting of the”last supper” (attributed to Martin de Vos) on linen with a 3:1 herringbone.\nAnd the Victoria & Albert (V&A) Museum cloth [ref. no. No. 7027-1860]. (1350-1400)\nhttp://collections.vam.ac.uk/item/O129528/printed-linen-unknown/\nSearching for “linen textile”, “herringbone” etc ..on the search engine of the V&A museum, I could not find any kind of European medieval linen fabric similar to that of the the TS (except that quoted above)\nUndoubtedly, from a technical point of view, a medieval forger could make a 3:1 linen fabric in order to use it as a ‘ground’ for painting etc.\nBut the fact is that we have only one example and this example has nothing to do with the TS (block printed linen etc.).\nHow is it that we have no example of a medieval painting  on a 3:1 herringbone linen sheet?\nI would like to quote G. Vial:\n” If one takes into account the three constitutive elements of a textile- the structure, the primary material, and the reductions of warp and weft- one must acknowledge that the Shroud of Turin  is truly ‘incomparable’.”\n\n","date":"February 16, 2015 at 5:24 pm","url":"https://shroudstory.com/2015/02/16/important-comment/","cat":"comments_promoted","id":"comment-191223","author":"Thibault HEIMBURGER","site":"shroudstory"}]
