[{"title":"In Case You Missed, “In Case You Missed It”","post":"Does anyone have information on this assertion I ran across>   “The Shroud of Turin is one of the many relics manufactured for profit during the Middle Ages. Shortly after the Shroud emerged it was declared a fake by the bishop who discovered the artist.”\nIn the literature, we find references to shrouds of Milan, Lodz, Nice, Aix-la-Chapelle and Besançon, among others. Concerning this issue of relic-forging, Dr. Gerald Larue remarks:\nCarbon-14 dating has demonstrated that the shroud is a 14th-century forgery and is one of many such deliberately created relics produced in the same period, all designed to attract pilgrims to specific shrines to enhance and increase the status and financial income of the local church.\n\n","date":"September 30, 2013 at 2:45 am","url":"https://shroudstory.com/2013/09/29/in-case-you-missed-in-case-you-missed-it/","cat":"other_blogs","id":"comment-45887","author":"Julie Fantham","site":"shroudstory"},{"title":"In Case You Missed, “In Case You Missed It”","post":"Hi Julie,\nI’m not sure what you mean by ‘information.’ Wikipedia has a reasonably balanced article about the shroud which should give you a fair grasp of the ideas for and against authenticity. There were a lot of relics about in the middle ages, and many of them were declared fakes – mostly by bishops who also declared that their own fakes were real. Such was the commercial exploitation of ‘relics’ that it is difficult to give much credence either to accusations of fraud or to declarations of honesty. Those which remain today have to tell their own story.\n\n","date":"September 30, 2013 at 6:46 am","url":"https://shroudstory.com/2013/09/29/in-case-you-missed-in-case-you-missed-it/","cat":"other_blogs","id":"comment-45904","author":"Hugh Farey","site":"shroudstory"},{"title":"In Case You Missed, “In Case You Missed It”","post":"Thanks Hugh, \nShould’ve said refutes not information. I found what I was looking for.\n\n","date":"September 30, 2013 at 2:37 pm","url":"https://shroudstory.com/2013/09/29/in-case-you-missed-in-case-you-missed-it/","cat":"other_blogs","id":"comment-45946","author":"Julie Fantham","site":"shroudstory"},{"title":"In Case You Missed, “In Case You Missed It”","post":"Just found this image of the empty tomb, never seen it before, 12th century\nhttp://digitalgallery.nypl.org/nypldigital/dgkeysearchdetail.cfm?trg=1&strucID=2060190&imageID=3975497&total=10&num=0&parent_id=185735&s=&notword=&d=&c=&f=&k=1&sScope=&sLevel=&sLabel=&lword=&lfield=&sort=&imgs=20&pos=5&snum=&e=w\nThoughts?\nIs the beige object the sarcophagus lid? Or the shroud? It looks much too long to be the lid, but then again perspective was not always a strength of middle ages artists.\nIf it’s the lid then there’s no shroud, which is unusual for this scene.\n\n","date":"September 30, 2013 at 7:57 am","url":"https://shroudstory.com/2013/09/29/in-case-you-missed-in-case-you-missed-it/","cat":"other_blogs","id":"comment-45907","author":"Matthias","site":"shroudstory"},{"title":"In Case You Missed, “In Case You Missed It”","post":"I can’t remember if I’ve seen it or not. The steeply sloping tomb lid with the angel perched on it is a common feature of icons of the time. I think it must hark back to Constantine Monomarchus’s restoration of the Holy Sepulchre, but I don’t know how. There was reputedly a stone slab outside the entrance to the Sepulchre itself, which although roughly rectangular, was supposed to be a piece of the original “rolled away” stone blocking ther entrance. I don’t know how much of it remains in the “Angel Stone” which is still there, and quite small, but it may have been considerably larger once.\n\n","date":"September 30, 2013 at 2:15 pm","url":"https://shroudstory.com/2013/09/29/in-case-you-missed-in-case-you-missed-it/","cat":"other_blogs","id":"comment-45938","author":"Hugh Farey","site":"shroudstory"}]
