[{"title":"Into a World Not Cut Off from Reality?","post":"What does this have do with 1350CE? Medieval sources please.\n\n","date":"August 18, 2014 at 7:03 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144527","author":"John Klotz","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"On Colin’s site I can see that individual fibres are coloured, adjacent to uncoloured fibres, and some fibres are only partially coloured along their length.  I did not see any examples where only the PCWs were coloured, but the medullas of such fibres were uncoloured.  It is my understanding that a common claim made for Shroud fibres is that the superficiality of the colouring is such that it is confined to the outer surface of the fibres only, specifically the crowns;  alternatively it is confined to an impurity layer of starches on the fibre surface.  The figure of 200 nm, sometimes up to perhaps 500 nm, is sometimes quoted as the upper limit of the thickness of the colouring.  Raymond Rogers claimed to have removed the colouring from a fibre which left the underlying fibre intact and otherwise unaffected, which seemed to persuade him that the colouring resided on the impurity layer.  Surely this is what is meant when superficiality is claimed for the colouring.  I can applaud Colin’s attempts and industrious efforts at his experimentations.  But I do not see that he can yet claim that the colouring has a comparable superficiality to that of the Shroud fibres.  Surely for his claims that the scorching model is valid, he has to demonstrate that the colouring is confined to no more than the primary cell wall of the fibres, leaving the medullas unaffected.  Or is there something wrong with this reasoning?\n\n","date":"August 18, 2014 at 7:10 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144529","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"Fair comment daveB, but at the risk of seeming  evasive, I was not addressing the claim for superficiality at the sub-fibre level (PCW v SCW v abutment on medulla) which I alluded to briefly. \n I was responding to the oft-cited claim, dare one say shroudie mantra, that a contact scorch lacks superficiality at the THREAD level. The focus was specifically on Thibault Heimburger’s claim that ALL the fibres in a thread become scorched, i.e. an alleged ‘all-or-nothing’ effect. That I have to say is a major boo boo on his part, for reasons one can only wonder at (pressure of work?)  as he will see if he performs the simple straightforward experiment I have described in which one jiggles apart the fibres from a single scorched thread while still maintaining a semblance of the original order.   Repeat: an intense scorch imprint produced by briefly pressing a hot metal template into linen affects only the most superficial fibres. Time to give that mantra a decent burial methinks. Actually, cremation seems more appropriate…\nAs for the half-tone effect, discontinuities etc etc, while interesting, and worthy of further study, they all seem to be based on the (splendid) Evans photomicrographs of whole image-bearing threads, but sadly with no teasing out of individual fibres. It’s hard to be absolutely certain about anything when the fibres are jampacked together,  photographic resolution leaving much to be desired at the individual fibre level.\nhttp://www.academia.edu/4294684/Microscopic_and_macroscopic_characteristics_of_the_Shroud_of_Turin_image_superficiality\n I’m not disputing the ‘microscopic complexity’ that is claimed for the TS image, but feel it ought to be based on something rather more substantial than those unseparated skeins of image fibres. In any case, microscopic complexity should not be cited as an argument against a man-made provenance. \nOne can flick a switch on a compressed air gun fed liquid water. The adiabatic cooling of atomised droplets of plain old H2O produces  complexity at the microscopic level with no assistance that we know of from On High.  The end result with its millions of individual unique six-sided crystals (“microscopic complexity”) is what in common parlance we call “snow”.\n\n","date":"August 18, 2014 at 7:46 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144534","author":"Colin Berry","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"Two posts; two comments, I think. Firstly Colin is correct to query established dogma. Too much of it is based on remarkably little evidence. We must not forget that the only things the STURP team (or Rogers later) had to work on were individual fibres stripped from the surface of the shroud by sticky tape, or the occasional snippet of extracted thread, rarely more than a few centimetres long. I have studied a lot of linen fibres, scorched and unscorched, with a microscope, and find that whether the lumen (lumen, note, a plant fibre has a lumen; wool has a medulla – why do we have to perpetuate Rogers’s error?)  is well defined or not is as often a feature of the lighting conditions as of any chemistry. Well scorched fibres may or may not have obvious lumens, as, indeed, may unscorched ones. After all the lumen itself is a void; any colouration must be of its wall, and extremely thin. Thibault’s paper referenced above has lots of micrographs of scorched fibres not one of which has a dark lumen.\nIn his later work, Rogers identified not simply his thin surface ‘impurity’ layer, which he attributed to an evaporation gradient produced from a solution of dextrin, but also the fact that it dissolved in water. Not so the image on the Shroud, which is clearly visible ‘through’ the big water stains across it. The solubility (or just wash-away-ability) of Rogers’s layer is a major objection to its validity.\nAs I mentioned before, the UV problem (which I know Colin does not think significant) is to me the only objection to the image being a scorch. Almost everyone on the STURP team commented on how similar the image looks to a scorch to the eye (the scorched ironing board), the ‘top-of-the-ridge’ image marks of Mark Evans’s micrographs have clearly and easily been replicated several times, not least by Thibault himself, and microscopically it is clear that individual fibres, and fragments of fibres, can be scorched selectively without the scorch discolouring an entire thread thickness. Whether it actually is a scorch, and how it was done if so, is still a mystery to me, but the chemical and physical arguments against it being a scorch (apart from the UV) have largely been discredited.\n\n","date":"August 18, 2014 at 8:07 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144536","author":"Hugh Farey","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"Thanks Hugh. I did not know that about medulla v lumen/wool v linen. One learns something new each day.\nAt least we’re agreed that it’s a void in the centre of a linen thread that cannot take a colour. From what I recall from subsidiary Year 1 botany at University, the subcellular component that abuts on that lumen is not the secondary cell wall, but whatever remains of the cytoplasm of the flax bast cell, ie. desiccated remnants of the thin film of pulsating  “jelly-like stuff”. That being the case it would probably be highly susceptible to “scorching”, packed as it is with protein, DNA, sugars etc, far more so than the relatively inert cellulose of the SCW.\nRogers was a gifted chemist, blessed with the Star Trek factor (going boldly etc) but knew sweet FA about plant cells.\n\n","date":"August 18, 2014 at 8:26 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144541","author":"Colin Berry","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"Now, Stephen Jones’s reply to a “bippy123,” who, by virtue of being exclusively congratulatory, is one of the few commenters to feature on his blog.\nNot for the first time I am taken to task for the use of the word ‘accidentally.’ OK, I wish I hadn’t used it, but I have explained what I meant and won’t go on about it.\nWhat I disagree with here is the idea that I (or anybody else of my ilk) have simply ignored all the evidence in support of the authenticity of the Shroud. “IS he just overlooking all of the evidence for it being much older,” asks Bippy. “Was it accidently created to have the head image blood stains be an almost perfect match with the blood stains on the sudarium? What about the Hungarian Pray codex? And what about the Mandylion?” I have no doubt whatever that I have examined all these in much greater detail than Bippy himself, and detailed both my inquries and the conclusions I derive from them on this blog. “THE FACTS” shouts Stephen in capital letters, “ARE SIMPLY IGNORED OR BRUSHED ASIDE AS SOMEHOW DECEPTIVE.” Well, I challenge anyone to find a single fact (or even vague hypothesis) that I have either ignored or brushed aside. A few posts ago Andrea Nicolotti couldn’t understand why I didn’t! \nWe are collectively lucky on this (Dan’s) site that whoever we disagree with, we do not either ignore or brush aside their ideas, but examine them with patience and generosity. We may not agree with them, but we give them every opportunity to establish their credentials.\nThe Newsletter of the British Society For the Turin Shroud is in very good hands. Sadly my work will not allow me to attend either Bari or St Louis, but I believe I will be able to spend a week in Turin next June. Perhaps I may meet some of you there.\n\n","date":"August 18, 2014 at 8:54 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144546","author":"Hugh Farey","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"Please Colin, I’m begging you, create one exactly like the TS. I’m losing my patience.\n\n","date":"August 18, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144578","author":"don","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"Nobody challenges science to produce an exact copy of the Mona Lisa or the world’s first daguerrotype photograph (1839), Don. So why expect an exact replica of the TS?  \nScience is not a cross between a Xerox photocopier and time-travel machine. The challenge is supposed to be about how the TS was made in principle, reproducing chief characteristics (negative image, superficiality, 3D properties etc). I reckon we can tick those 3 boxes already by positing a contact scorch. \nExplaining the lack of fluorescence under uv light may take a while longer.  Shame we don’t have that time machine. Maybe the TS image fluoresced when first made.\n\n","date":"August 18, 2014 at 2:39 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144593","author":"Colin Berry","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"Can thermal imprint be superficial at thread level ? It’s all about time scale.\n“The problems this technique, as explained in detail in my 1984 paper, is that thermal discoloration propagates through the thickness of the cloth on a time scale between 1/100 to 1/10 second.  This could be mitigated to some extent by pre-soaking the cloth, but this moved the resulting image to appear more like one of direct contact, owing to the need to vaporize the moisture in the linen which requires time that competes with the thermal penetration time into the cloth.”\nhttps://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/\n\n","date":"August 18, 2014 at 1:22 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144579","author":"anoxie","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"“Thermal discoloration propagates through the thickness of the cloth on a time scale between 1/100 to 1/10 second.” Does this mean anything? Discoloration does not ‘propagate.’ Heat propagates, perhaps, discolouring as it goes, but it also dissipates. Depending on the temperature, the conductivity of the material and no doubt other factors, there may not be sufficient heat to discolour anything beyond the first few fibres thickness, however fast it goes.\n\n","date":"August 18, 2014 at 1:43 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144582","author":"Hugh Farey","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"Thank you Hugh. You have pre-plagiarized what I was about to say. Full marks for mind-reading, but please don’t make a habit of it.\n\n","date":"August 18, 2014 at 1:58 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144586","author":"Colin Berry","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"Do you really think J. Jackson is this stupid ?\n“Depending on the temperature, the conductivity of the material and no doubt other factors, there may not be sufficient heat to discolour anything beyond the first few fibres thickness, however fast it goes.”\nThe problem is not how fast heat propagates, but how long you apply the template, this is the critical factor as far as heat and then temperature, is concerned.\nThe time scale is what it is, a time scale.\n\n","date":"August 18, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144591","author":"anoxie","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"I don’t think Jackson is at all stupid. I just wonder what he means. He seems to imply that it is not possible for discolouration only to occur on the topmost fibres of a thread, when we have clearly seen that it is. You claim the problem is not one of speed, but your quotation from Jackson is only about speed. Perhaps you could clarify both.\n\n","date":"August 18, 2014 at 2:59 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144597","author":"Hugh Farey","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"J. Jackson is talking about a “time scale” because this is how you will roughly describe the evolution of heat transfer or propagation of the thermal discoloration, which are not constant in time/space.\nI don’t think he claims a thermal discoloration can’t be superficial.\n\n","date":"August 18, 2014 at 3:29 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144599","author":"anoxie","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"It’s like acquiring a suntan without a sunburn. One starts with minimal exposure, increasing it until one gets the optimum result.\n One does not start with maximum exposure, guaranteeing sunburn, and then broadcasting to all and sundry that it’s impossible to get a suntan without a sunburn. Yet that is what Messrs Paolo Di Lazzaro and Thibault Heimburger have been doing – and, what’s more, using this site to do it. Their so-called “science” is less than impressive…\n\n","date":"August 20, 2014 at 1:36 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144898","author":"Colin Berry","site":"shroudstory"},{"title":"Into a World Not Cut Off from Reality?","post":"Here for the record are their exact words:\nPDL (2012, this site)\n“We have heated a 5-cents euro coin at about 230 °C in contact with a linen cloth. Just 5 seconds after the coin reached the max temperature the whole cross section of threads in contact with the coin was colored.  After 15 seconds all the thickness of the cloth was colored and the round shaped image of the coin appeared on the opposite side.\n…  In summary, when heating a linen cloth by a hot metal in contact, well known physics models foresee the pyrolysis of the whole fibers and threads, and this is exactly what we observe in the experiments.”\nhttps://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/\nTH (2014, this site):\n“The cross section experiments show clearly that a light scorch, which is able to give a superficial imprint at fabric level is not superficial at all at thread level: the entire thickness of the threads in contact with the template is colored (while the threads or portions of threads which are not in contact with the hot template are not colored). On the Shroud, only the 2 or 3 surface layers of fibrils at the surface of the image threads are colored.” \nhttps://shroudofturin.files.wordpress.com/2014/04/scorch-2-eng-final.pdf\nAs I say, it’s essentially a claim in both missives ( missiles?) that a suntan is impossible without a sunburn. To which my response again is:  NUTS.\n\n","date":"August 20, 2014 at 2:52 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","id":"comment-144914","author":"Colin Berry","site":"shroudstory"}]
