[{"title":"Is the Shroud Evidence for God’s Existence?","post":"Some interesting philosophical points, Dan. Not for the first time, I think, I am somewhat at odds with Fr Longenecker’s cursory ideas about scientfic, historical and sindonological facts, but most of all, and he is not alone in this, I strongly object to the idea that anybody who does not believe in the authenticity of the Shroud is an atheist. I do not believe that I am any less a committed Roman Catholic than Fr Longenecker himself, but, in common with many other equally committed Roman Catholic scientists, I believe that universe is supremely rational, and do not believe in all his “angels or aliens, demons or devils, goblins or gods.” The sly way he has coupled this bunch together says a lot about his argument. He will jump down my throat, I am sure, with: “Aha, so you don’t believe in angels or god!” but will no doubt claim that my riposte “Aha! so you do believe in aliens and goblins!” should not be taken seriously. This is not the place to discuss the theology of angels, but clumping them together with goblins is simply trite. Sure, “if atheistic materialism is right there are not intelligent, reasonable, personal exterior forces superior to the natural world who might interfere or interact with the natural world,” but I believe that even if atheistic materialism is wrong the world is not beset with “personal exterior forces” who interfere with the natural world. And why do I think that? Because of the total lack of evidence for any such things. [At this point, people who disagree with me give a long list of miracles, usually including rainbow Buddhists and the visions at Fatima, none of which I think demonstrate any ‘outside’ interference with the natural world, least of all the Shroud, which even most of its authenticist adherents do not think is supernatural. Please don’t bother; I already know them all.]\nIn common with many other authenticists (even ‘rational’ ones), Fr Longenecker lists evidences about the Shroud, and on the basis of a 9-1 majority, imagines that his case would be proved to anybody looking “objectively, carefully and with an open mind.” As usual, most of the nine are irrelevant or highly disputed, even among the authenticists themselves (No. 7, for example – “the shroud shows details perfectly consistent with first century Jewish burial customs”, or No. 9 – The cloth is consistent with fabrics from first century Israel). I don’t wish to repeat myself (find other references to Fr Longenecker at shroudstory), but will at least reiterate that “You don’t know how it was done”, which is the first and biggest plank in Fr Longenecker’s case, is not evidence for anything.\nFinally, unlike most authenticists, I am fully aware of the genuine evidence in favour of authenticity, and am not so convinced in non-authenticity that I would go to the stake for my opinion. As I have said many times, much of Dan’s apologia down the right hand side of this blog reflects my view exactly. We have (I hope this is true, Dan!) repect for each other because our reasoning processes are almost identical, and our disagreement, opting for one side or the other, is really not so important as our continued search for better evidence, whichever way it points.\n\n","date":"October 11, 2014 at 9:53 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161320","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Well said, Hugh and Dan.\n\n","date":"October 11, 2014 at 2:49 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161394","author":"David Goulet","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I am of the strong opinion that God does not and will not compel belief, but invites belief.  Why?  Because this is an essential attribute of a merciful God.  If God compelled belief, then it would be unforgivable to reject it, as Lucifer once found.  Belief requires a leap of Faith, whether it is belief in God, in Christ, the Shroud, in a person or for that matter one’s own paternity.  That faith may be sustained until it is betrayed, or proven false.  I have a suspicion that if indeed the Shroud is indeed the burial cloth of Christ, it would be consistent with that opinion of merciful restraint, that it will never be proven to be so.  Curiously that might be considered as persuasive evidence that it is authentic. Odd!\n\n","date":"October 11, 2014 at 3:34 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161406","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"why did Jesus appear to the apostles after the Resurrection; was to give them knowledge or faith or both\n\n","date":"October 11, 2014 at 10:33 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161487","author":"Paul","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Just from the text of the NT Jesus was very big on faith.\nMatt 9:22  “thy faith hath made thee whole”\nMatt 9:29 “According to your faith be it unto you.”\nMark 2:5 “When Jesus saw their faith, he said unto the sick of the palsy, Son, thy sins be forgiven thee.”\nLuke 7.50 “Thy faith hath saved thee; go in peace.”\nLuk 17:5 “And the apostles said unto the Lord, Increase our faith.”\nNow I can add a many more quotes but I’ll end it with this\nJhn 20:29\n“Jesus saith unto him, Thomas, because thou hast seen me, thou hast believed: blessed are they that have not seen, and yet have believed.” \nJesus was also big on mystery but I’ll save that for another post.\nPS I’m not a Christain\n\n","date":"October 12, 2014 at 8:24 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161633","author":"John Green","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"The apostles might have known, and Mary Magdalen might have known.  But posterity relies on faith.\n\n","date":"October 11, 2014 at 11:39 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161501","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"To answer the question that makes the title of this topic, I would say “obviously no” and God never intent to gave us any proof of his existence…  He let us free completelly while we’re here on Earth.  That’s precisely why Jesus in the Gospel was always very happy and impress when he saw people showing great faith and confidence in him and/or the Father. \nBut as I have proposed in a recent paper (link: http://shroudnm.com/docs/2014-07-Reflection-If-Shroud-is-Image-of-Christ.pdf), I think the Shroud is speaking very loud about his Incarnation in our humanity (and much more than it can speaks about Jesus’ Resurrection), as long as you got the eyes of faith open…\n\n","date":"October 11, 2014 at 6:37 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161432","author":"Yannick Clément","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"OK one last time.  I am convinced of the Shroud’s authenticity not because of this or that piece of evidence, but the weight of all the evidence, and all the kinds of evidence, together with the curious fact, for fact it seems to be, that there is no dispositive evidence, or evidence of any sort that I can tell, against it.  Certainly anyone who considers the carbon dating fiasco cannot regard those results as evidence.  At a minimum a retest would be required to establish any carbon dating evidence whatsoever.\nSo what is the evidence, what is the weight of evidence, against authenticity?  Where is it?  Have I not been looking in the right places?  And if indeed all that counts against the Shroud is one freshly minted conjecture after another, none of which seem to stand up very well, and what counts for it is a body of solid evidence gathered across many disciplines over many years, is it not reasonable to conclude that the relic is authentic?  Otherwise you will have made hyperbolic doubt an unbeatable standard, one that nothing but a Cartesian cogito can overcome.  That, it seems to me, is unreasonable.\n\n","date":"October 11, 2014 at 11:27 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161496","author":"R. H. Cahall","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"“the curious fact, for fact it seems to be, that there is no dispositive evidence, or evidence of any sort that I can tell, against it.”\nThere is nothing wrong, RH, in your conclusion in favour of authenticity, but your asserted method of acheving it is, if I may say so, deeply flawed. Many people have weighed all the evidence for and against the authenticity of the Shroud and come down for or against authenticity as their personal position. Nothing wrong with that. Others have allowed the image on the Shroud itself, as an icon of Christ, to form their judgement, regardless of science, and that is a valid position too. But your position is that you have balanced the evidence in favour against – what? Nothing. You have not found any evidence against it. How could you fail to be convinced of the Shroid’s authenticity? How could anybody? Of course, in those circumstances, it is “reasonable to conclude that the relic is authentic.” I do not know where you have been looking, but this site, from its inception, has been devoted to examining all the evidence, for and against, in such excruciating detail that exact quotations from obscure publications, or minute blips in spectrographic analyses, have been debated for days.\nA person’s convictions are his own, and no one should deny him them, but when he communicates them publicly, he has some responsibility to his audience, especially to those who hold different opinions. It is not enough for him to explain why he is right; he must also try to explain why they are wrong. If he is unable to explain their attitude at all, then he cannot refute it, although he may simply consider them evil or mad.\nIf RH has read any of my, or David Mo’s, or Charles Freeman’s or several others’ comments over the past months, he will have come across evidence in abundance to explain why we cannot agreee that the Shroud is authentic. He should have considered it, and decided that it was not sufficient to change his view of authenticity. To announce that he has never seen “evidence, of any sort … against it” is irresponsible, making, if I may paraphrase, hyperbolic certainty an unbeatable standard. That, it seems to me, is unreasonable.\n\n","date":"October 12, 2014 at 3:59 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161560","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I have been following this site for well over two years, several times a day, most days.  I am sorry but I remain quite unimpressed by any arguments against authenticity mustered by any of Hugh Farey, David Mo, Charles Freeman, or for that matter even Colin Berry.  One of the main problems I think I have with their arguments, is that they are usually so very narrowly focused on a single issue.  They so very seldom seem capable of dealing with any argument concerning the WEIGHT OF EVIDENCE.  That is not to denigrate their efforts at all.  They have sometimes brought many important matters of detail to light.  But that is all it amounts to, matters of detail, never a fatal thrust against authenticity at all.  Both sides of the argument perhaps at times indulge in some amazing mental gymnastics to bolster their case, but the anti-authenicists certainly no less than those who argue that the cloth is indeed the true burial cloths of their Lord and Saviour!\n\n","date":"October 12, 2014 at 4:21 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161568","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"The problem facing sceptics is not the “weight of evidence”. Would that were the case. The problem is the weight of wishful thinking. (See Hungarian Pray Codex, Roman coins in eyes, “bilirubin” in blood –  just 3 instances one can cite of that wishful thinking, there being lots more.\nWe need a new smaller unit for measuring weight (of accumulated wishful thinking), smaller even than nanograms.\n\n","date":"October 12, 2014 at 5:21 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161584","author":"Colin Berry","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I would be prepared to concede that the Hungarian Pray Codex, Roman coins on eyes, other quasi-pareidolia, are incidental, but I would not call them wishful thinking, I think of them more as debatable, and if valid, even icing on the cake.  But it does not matter a great deal if they are there or not.  I am not qualified to comment on bilirubin, but there are those who are so qualified and have claimed that it is present. \nI am thinking more of the several forensic pathologists who all concur that the image is that of a real crucified human body, even though they may differ over minor details;  that the wounds go one better than even the gospel accounts, in that they are anatomically correct;  that the blood flows on the head match a helmet of thorns and that Jesus Christ is the one crucifixion victim who was inflicted with this gratuitous punishment;  that the detailed forensic information was not available in medieval times;  that the image satisfies no known medieval artistic conventions; that medieval artistic portrayals of the crucifixion and flagellation are amateurish by comparison with the reality of the image;  that it seems likely that there is no known image under the blood stains;  that the stains have satisfied several tests as real anthropoid blood;  that there is sufficient pollen evidence to sustain a provenance consistent with the burial cloth’s likely locations;  that there are historic reports corroborating the existence of Christ’s burial cloth, some of those reports claiming, bearing an image; that to date no credible means of creating the image has been identified.   \nIndividually they may be argued.  Collectively they create a solid argument, difficult, I believe impossible, to refute!\n\n","date":"October 12, 2014 at 6:38 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161596","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"“Individually they may be argued. Collectively they create a solid argument, difficult, I believe impossible, to refute!”\nMethinks you’ll find few scientists prepared to be dossiered into submission. It’s the soundness of individual arguments that matters, not their “combined weight”,  whatever that means,\n\n","date":"October 12, 2014 at 6:43 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161600","author":"Colin Berry","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"‘not their “combined weight”, whatever that means,’\nThat is why scientists may be asked to give expert evidence at jury trials but usually disqualify themselves from the jury who decide on the verdict!\n\n","date":"October 12, 2014 at 6:53 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161604","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Donald Rumsfeld: “There are things we know that we know. There are known unknowns. That is to say there are things that we now know we don’t know. But there are also unknown unknowns. There are things we do not know we don’t know.”\nWhich explains why science does not and cannot operate like a court of law, and why scientists should not play at being jurors. Why should they? Science is not time-constrained, so does not attempt to arrive at verdicts, instant or otherwise. Indeed, individual scientists may even be reluctant to cooperate in the framing of so-called collective consensus statements unless there’s a really compelling need to do so (national emergency etc).\n\n","date":"October 12, 2014 at 7:14 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161614","author":"Colin Berry","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Suppose one consults an expert on ancient weaving an d looms and they say 3in 1 herringbone was possible by the third century AD on very complex looms but almost certainly not for that length of cloth. Medieval treadle  looms would, however , be quite capable of it and there is a fourteenth century example of a 3 in 1 in the Victoria and Albert Museum in London to prove that that that weave was being done at that time.\n\n","date":"October 13, 2014 at 12:18 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161857","author":"Charles Freeman","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Interesting.  Is there an expert who you know who can provide this view?\n\n","date":"October 13, 2014 at 3:16 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161891","author":"Thomas","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Charles\nStill interested to know if you know of such an expert.\nIf so,I’m sure they would be interested in sharing their opinion.\n\n","date":"October 14, 2014 at 4:46 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-162267","author":"Thomas","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"With all due respect Hugh, neither you, David Mo nor Charles have provided compelling cases against authenticity. Far from it. What you have all done is raised valid questions challenging the case for authenticity. That’s a very different thing.\nAnd all three of you face a problem – which to my eyes none of you have convincingly addressed. If the Shroud was made by man’s hands in the middle ages, who was it created by and how? And why does it contradict a number of artistic and historical traditions?\n\n","date":"October 12, 2014 at 4:21 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161569","author":"Thomas","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I have never claimed to have provided a compelling case against authenticity. I have demonstrated evidence against authenticity, and in favour of a 12th or 13th century origin, which I personally find persuasive, but I fully accept that others do not. I agree with Thomas that non-authenticists face the problem of finding a context within which the Shroud was created, but have suggested lines of inquiry which may be worth pursuing. However, authenticists simply cannot – and they do, all the time – fall back on the “You don’t know how it was done artificially so it must be authentic,” argument. This is nonsense, and so easily reversed to say, with equal validity, “You don’t know how it was done authentically so it must be artificial.”\nDaveb is a good example of one who, like myself, has weighed all the arguments for and against, and although he has reached a different conclusion, he has carefully explained why. He has listed some debatable issues, and the evidence which he finds persuasive to him, and it is impossible not to respect that (although even he slips in the “You don’t know how it was done” argument at the end).\nAnother constant of the authenticist argument – and this applies to almost everybody and is not specific to Daveb, Thomas or anyone else – is this business about the weight of evidence being sufficient, and a certain irritation with scientists who are pernickity about tiny details. I don’t agree with this. To a scientist the Shroud is not a maypole held up by so many guyropes that a few snapped ones here or there make no diference to its stability, but a reservoir held back by a dam made of many stones, within any of which a single crack threatens the stability of the entire edifice. I dare say a proper approach combines the two metaphors. Some evidence may be considered trivial by either side, and its validity or not makes little difference to the argument, but other evidence may indeed be stand-or-fall to the conclusion one eventually comes to. For me, one such is the radiocarbon evidence. If it were demonstrated satisfactorily that there was a Russian hacker, an episcopal switch, or any interweaving, then I would agree that on balance, the evidence now tipped in favour of authenticity. I believe also that I have tried harder than most to find such evidence, on the principle that a hypothesis stands or falls on its falsifiablility, but so far, I find it insufficient.\nAuthenticists, I think, would go for historical provenance. If a good source of 3/1 twill were identified, an artist’s workshop and some models or preliminary sketches – if, finally, someone could satisfactorily say, “This is how it was done” – then many would concede that perhaps the evidence now tipped in favour of a medieval artifact.\nOn with the search then…\n\n","date":"October 12, 2014 at 7:32 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161623","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Hugh, you wrote: “I have demonstrated evidence against authenticity, and in favour of a 12th or 13th century origin, which I personally find persuasive, but I fully accept that others do not.” \nA reference to a document collecting this evidence would be helpful. I do not remember to have read any clear “evidence against authenticity, and in favour of a 12th or 13th century origin”, besides the carbon dating, from you.\n\n","date":"October 14, 2014 at 1:34 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-162227","author":"Mario Latendresse","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I would suggest that a study of the early descriptions and depictions of the Shroud might suggest that ,as it originally was, vivid enough to be unfurled before enormous crowds, there were lostdetails typical of medieval iconography. I was amazed that de Wesselow did not seem to be aware of all this early evidence and him supposedly a trained art historian! Nor, might I say, have I come across any Shroudies who seem to have put all this evidence together.\n\n","date":"October 13, 2014 at 1:01 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161867","author":"Charles Freeman","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I think Charles and Hugh had shown here how the sindonist’s arguments pro-authenticity are inconsistent and that some evidence pointing to the  fourteenth century are plausible. I do one step forward. I think some arguments show the Shroud is an artifact. They are not ultra-sophisticated scientific experiences, but some considerations to the naked eye. First of all, the blood trails. Blood trickles don’t naturally run on the hair (frontal and dorsal(!!) images) forming so “gracious” forms. They are obviously painted.\nOther naked-eye perceptible features of the image squarely contradict some  sindonists’ hot issues, as the bottom of the foot that makes incoherent every theory of the “perfect” 3D . But this is another subject.\n\n","date":"October 13, 2014 at 5:44 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161920","author":"David Mo","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Donald Rumsfeld? Brilliant thinker, tactical wordsmith, a man of true political ‘science’.. But also a man completely blind to moral truth.\n\n","date":"October 12, 2014 at 9:01 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161644","author":"David Goulet","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"“But also a man completely blind to moral truth.”\nIt wasn’t (arguably) just moral truth that eluded Donald Rumsfeld. A tenuous grasp of geopolitical realities, combined with a blind spot for centuries-old sectarian divisions,  notably Sunni v Shia, needs to be added to the indictment, as seen in this other quotation of his:\n“I can’t tell you if the use of force in Iraq today will last five days, five weeks or five months, but it won’t last any longer than that”\nBe that as it may, probably everyone, no matter what their track record in life,  is or should be capable of at least one quotable quote.\nLike your: “I think Max winds himself up more than anyone else”.  ;-)\nMine? Possibly this one, from my University days: “If future time travel were possible, to observe what life was like in previous centuries, then people from the future would be here among us today”.\n\n","date":"October 12, 2014 at 9:42 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161656","author":"Colin Berry","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I’ve got one other quote for posterity: “I’d rather be someone who was fit to be held, than someone who was fit to behold.”\n\n","date":"October 12, 2014 at 5:44 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161778","author":"David Goulet","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Future is only predicted or unpredicted past that happens in the present.\n\n","date":"October 12, 2014 at 11:14 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161672","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"…for  “there is no past no future everything flows in an eternal present”.\n\n","date":"October 12, 2014 at 12:12 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161693","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"(Comment I posted on another thread). Methinks you do have to ‘wind up’ with people who, in bad faith or misinformed on a regular basis and/or speaking out of their field of expertise (if really any), keeps attacking you on trifles while keeping ignoring the facts against their opinion/hypothesis and totally ruling out real alternative possibilities to force on you pseudo final words/pseudo absolute truths.\n\n","date":"October 12, 2014 at 11:57 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161687","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Thomas: “If the Shroud was made by man’s hands in the middle ages, who was it created by and how? And why does it contradict a number of artistic and historical traditions?” \nThere is only one man who had the capability, imagination and resources to create it.  He is unique.  Roger Bacon b. ~1220 England, d. 1292 guess where, Oxford!! His career is worth the effort of researching by anyone interested in investigating a possible medieval provenance of the Shroud.  The only problem is that Bacon was an extremely busy chappie, very likely he would have left some record of his efforts, and he was probably engaged on so many other projects, he would not have had the time to dedicate to it. \nOrdered by his Franciscan superiors to desist from his researches, and counter-commanded  by Pope Clement IV to send him his researches under secrecy, he prepared and dispatched three massive volumes.  Unfortunately the death of Clement in 1268 extinguished Bacon’s dreams of gaining for the sciences their rightful place in the curriculum of university studies.  He was Aristotelian in his outlook rather than Platonist.  He extolled experimentation so ardently that he has often been viewed as a harbinger of modern science more than 300 years before it came to bloom.  \nBacon had a sort of laboratory for alchemical experiments and carried out some systematic observations with lenses and mirrors. His studies on the nature of light and on the rainbow are especially noteworthy, and he seems to have planned and interpreted these experiments carefully. But his most notable “experiments” seem never to have been actually performed; they were merely described. He suggested, for example, that a balloon of thin copper sheet be made and filled with “liquid fire”; he felt that it would float in the air as many light objects do in water. He seriously studied the problem of flying in a machine with flapping wings. He was the first person in the West to give exact directions for making gunpowder (1242); and, though he knew that, if confined, it would have great power and might be useful in war, he failed to speculate further. (Its use in guns arose early in the following century.) Bacon described spectacles (which also soon came into use); elucidated the principles of reflection, refraction, and spherical aberration; and proposed mechanically propelled ships and carriages. He used a camera obscura to observe eclipses of the Sun.\nIf it was not Roger Bacon, then it was no-one else!\n\n","date":"October 12, 2014 at 3:47 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161745","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"If it was not Roger Bacon, then it was no-one else!\nMy copyright.\n\n","date":"October 12, 2014 at 3:50 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161749","author":"O.K.","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"In that case, then you had successfully imprinted it on my subconscious!\n\n","date":"October 12, 2014 at 4:49 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161762","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I bet he regularly wove 3/1 herringbone twill as well!\n\n","date":"October 12, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161784","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"He probably had it sent down from Manchester!\n\n","date":"October 12, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161794","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Methinks we are lending to much to Robert Bacon.\n\n","date":"October 14, 2014 at 7:46 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-162308","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"HF: “To a scientist the Shroud is not a maypole held up by so many guyropes that a few snapped ones here or there make no difference to its stability, but a reservoir held back by a dam made of many stones, within any of which a single crack threatens the stability of the entire edifice. I dare say a proper approach combines the two metaphors. Some evidence may be considered trivial by either side, and its validity or not makes little difference to the argument, but other evidence may indeed be stand-or-fall to the conclusion one eventually comes to.”  \nOf the various arguments I catalogued above, I believe there are more maypoles than dams!  \nHugh clings to the C-14 argument, but it is a tenuous one as has often been discussed here.  If an explanation for the image was ever discovered, then unless it was only feasible by an artisan, it might still leave the naturalistic cause available.  Looking for a 3-in-1 twill workshop might be interesting, but after 2000 years of history with invasion, wars and general ravagement, earthquakes and floods, that might be too hopeful.  For all we know the cloth might just as easily have emerged in Jerusalem from China, Gaul or perhaps even Manchester!  Wilson mentions 3-in-1 twill was sometimes used for silk, and trade on the Silk Road occurred from ancient times!  Roman soldiers garrisoned in ancient Britain or Gaul, then posted to Palestine?  A possibility!\n\n","date":"October 13, 2014 at 2:31 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161880","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"” If an explanation for the image was ever discovered, then unless it was only feasible by an artisan, it might still leave the naturalistic cause available.” Have you any explanation for the journey of the”blue” stones of Stonehenge 200 km away? Any explanation for the perfect sound of the Stradivarius? Unnatural explanations? E.T? Druidas’ magic? Devil covenants? HOw the Shroud was made is a mistery, but misteries don’t imply supernatural. (Rogers).\n\n","date":"October 13, 2014 at 5:57 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161923","author":"David Mo","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I do not see the relevance of the “mysteries” you refer to.  All of them have feasible explanations relying only on human skill, insight, ingenuity the industry to bring them about, and likely some good fortune.  The Shroud image remains an enigma despite our best efforts to discover its solution.  I have listed a dossier of reasons why I believe it is authentic, and for those reasons I am unable to accept that it was a work of human skill.  I do not assert that it required a supernatural intervention as you imply, although in my view it does remain one possibility.  If it is not a work of human skill nor of supernatural origin, that can only leave some fortuitous natural cause, which in the absence of the necessary experimental investigations, we do not yet have an explanation.\n\n","date":"October 13, 2014 at 3:02 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-162061","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"“All of them have feasible explanations relying only on human skill, insight, ingenuity the industry to bring them about, and likely some good fortune.”\nYou are in a mistake. Nowadays, nobody can explain how the men of the Stone Age were able to carry several stones of 40 tonnes approx. from a  place located 250 km to Stonehenge. See here http://www.dailymail.co.uk/sciencetech/article-2510487/Origin-Stonehenges-blue-stones-revealed–experts-dont-know-travelled-160-miles-South-Wales.html .The same for other mysteries in History. I have quoted some of them.\nThe essential difference between Stonehenge and the Shroud is that in the first case many scientific teams have had access to the site and were allowed to excavate the ruins. The Shroud has been directly examined just three times, only with a lot of constrictions and never by a complete team of specialists. Therefore, Stonehenge is a more consistent mistery than the Shroud, so to speak, I find more simiilarities with San Genaro’s blood and other relics.\n\n","date":"October 14, 2014 at 3:56 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-162255","author":"David Mo","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Wikipedia says with regard to Stonehenge:\n“However, conventional techniques, using Neolithic technology as basic as shear legs, have been demonstrably effective at moving and placing stones of a similar size.”\n“According to a team of British researchers led by Mike Parker Pearson of the University of Sheffield, Stonehenge may have been built as a symbol of “peace and unity”, indicated in part by the fact that at the time of its construction, Britain’s Neolithic people were experiencing a period of cultural unification”.\nIf this theory is correct, then tribes across South Western Britain could have collaborated to undertake this task.\n\n","date":"October 14, 2014 at 4:44 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-162266","author":"Thomas","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Wikipedia, Wikipedia. Only a hundred of meters had been gone over in the best of cases. As far as I know.\n\n","date":"October 14, 2014 at 5:42 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-162281","author":"David Mo","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"David Mo is a little inaccurate concerning the origin of stones for Stonehenge.\nThere are divisions of opinion concerning the precise timing of construction.\nOne source I used for an intended presentation some years ago was Martin Palmer’s “Sacred History of Britain”.  He paints the following scenario. \nOveruse of farmland resulted in crop failures and the previous Barrow Culture was abandoned about 3200 BC.  It was succeeded by a stone circle culture spreading right across Europe from about 3000 BC, commencing with “wood-henges”, then stone from about 2700 BC, with joints and dressings imitative of wood-work.  Purpose not strictly known but includes: Elite burial sites, Community & Trade centres, Religious activities, Military purposes.   Cosmology significance include astronomical alignments, and important “ley-lines”.  Bones of some 50 or so cremated bodies were discovered. \nPalmer asserts that about 2100 BC some 80 bluestone pillars, each weighing 4 TONS (NOT 40 TONS) originating in the Preseli Hills, were used to build two incomplete concentric circles.  The method of transport although presently unknown for certain cannot be classified as a “mystery” in the same sense as is the enigmatic Shroud image.  There are two fundamental theories.  One is that they had already been transported there by a glacial ice sheet.  The alternative that they were transported by sea, and then manhandled overland to the site would be well within neolithic human endeavour (Note they were 4 tons each not 40 tons). \nAbout 2000 BC, the lintel circle and horseshoe of sarsen stones were constructed, originally some 30 uprights (only 17 survive) each of about 50 TONS, brought from some 30 KM away.  This remodelling reduced the importance of other stone circles within about 240 km. Other works at Stonehenge followed including the unfinished avenue to the Avon River.  \nIn 1150 BC, the ash from an Icelandic volcano eruption blocked out the sun from N. Europe, killing vegetation, trees and crops, and the Stone Circle was then abandoned.  Their gods had failed them!  In Britain there were no known monuments nor ceremonial burials 1100 – 600 BC.  From 500 BC, Celtic ideas surfaced, religion focused on springs and wells, emanating from the Mesopotamian Ainu cult. \nThe construction of the Egyptian pyramids remained a mystery until their solution was discovered.  Earth (sand?) ramps were built to the placement locations and the stones hauled into place by sled using manpower.  Whether timber rollers on timber rails were used has been discussed, or whether milk was used as a lubricant.  In any case the problem of hauling the 50 ton sarsen stones for Stonehenge some 30 km away is a credible neolithic human achievement.  Although ancient Britons terminated their Stone Circle cult by about 1100 BC, the spectacle of the site clearly attracted Roman garrisons posted there and also the Druids, but they had no input into its construction.\n\n","date":"October 14, 2014 at 6:06 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-162286","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"If you want to know more about Stonehenge I suggest you consult Colin Berry who I understand has some interest in the matter, or perhaps Hugh Farey, both of whom live a damn sight closer to Salisbury Plain than myself in the Antipodes, although thousands of Kiwis and Ozzies spent several months there at Boot Camp during both World Wars in training for battle in engagements that hardly concerned their interests.\n\n","date":"October 14, 2014 at 2:33 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-162382","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"As a professional cryptanalyst, I do think too the TS is not supernatural per se yet is a ‘providential image’ of Yeshua’ (reminder: his name in Hebrew means ‘Providential SALVATION’). \nNow most curiously, if you apply what I call the lezeker-bezeker cryptographic system (or Hakhamic/rabbinic hermeneutic/cryptographic system) to a Pilate coin obverse bearing a lituus or augur wand for instance, you can decode by means of an association of ideas and ‘imageplay’, the very name Yeshua’ as the bronze central device (seen in conjunction with the final C letter in the KAICAPOC inscription and through rabbinic/hakhamic eyes) can visually conjure up a “brass snake”-like shaped form (nâHâsh or neHushstân neHoshet in Hebrew). \nReminder here: the brass snake is the symbol both of ‘Victory (over death/the enemy)’ AND ‘SALVATION’. Therefore it can code here the very name Yeshua’, “Jesus”, SALVATION in Hebrew (see Num. 21:49; John 3:14-15).  This is just a cryptographic example among many others that can be triggered off through a Pilate coin obverse (and reverse).\n\n","date":"October 13, 2014 at 7:01 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161936","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Addendum: This would account for finding of many Pilate coins in Second Temple tombs (at least 46 coins out of  124 found in STP tombs were Pilate coins).\n\n","date":"October 13, 2014 at 7:05 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-161937","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Longnecker’s argument has some merit since he is referring to evidence and not proof.\n\n","date":"October 13, 2014 at 7:38 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-162145","author":"Andy","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"My faith in Jesus Christ does not hinge on the authenticity (or not) of this cloth, but the latest scientific evidence makes a compelling case FOR its being authentic. Either way, it won’t matter, salvation-wise, to those who don’t want to believe in Christ, because He Himself said that even if one were to return from the dead, those who don’t want to believe, won’t. And guess what? Over 500 people at one time saw the post-crucifixion, resurrected Christ before He ascended to the Father and that still wasn’t “enough proof” for that day’s hardened hearts. Possible very soon, we will see Him again, and this time, He won’t be coming as a meek and mild Shepherd, but as the King of Kings and Lord of Lords and Judge over all peoples. “Even so, come, Lord Jesus!”\n\n","date":"October 24, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-165265","author":"Linda Zedler Talley","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Linda, for those who believe, no proof is necessary.  For those who refuse to believe, no amount of proof is enough.\n\n","date":"October 24, 2014 at 11:35 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-165327","author":"Andy","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Hello everyone,\n I think the discussion on The Shroud of Turin is utterly fascinating! It is amazing how the discussion can take some pretty sharp turns in different directions. I have read a lot of information pertaining to the Shroud. Both for and against authenticity. One of the things I find most intriguing are the 3D properties of the Shroud. Scientists have confirmed that this piece of linen cloth contains the most advanced image ever seen by man. It is truly a one of a kind. It is the only two dimensional image on earth that can be photographed and turned directly into a 3D image.  This aspect alone is enough to convince me. I do not believe there has ever been anyone in the middle ages, let alone now, that has the ability to create an image with these properties. If so, they would have been the greatest genius to have ever lived. If such a genius did exist, don’t you think that they would have demonstrated their abilities in a different manner? If a genius such as this did exist, don’t you think he would have communicated this ability in some way, to someone?\n No, I think The Shroud of Turin speaks for itself. If there is someone out there that can find a two dimensional object that can be photographed and the photograph be turned directly into a full 3D image,[ edited]\nThanks for the insights\n\n","date":"December 6, 2014 at 9:47 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174927","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Good thing Colin’s already paid his mortgage off.\n\n","date":"December 6, 2014 at 10:17 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174936","author":"David Goulet","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"“If there is someone out there that can find a two dimensional object that can be photographed and the photograph be turned directly into a full 3D image, I will pay their mortgage until your home is paid off.” Colin? Have you got a mortgage? (I don’t or I’d grab it myself!). Any cloth singed by a bas relief achieves at least a good as, if not better than an image as the Shroud…\n\n","date":"December 6, 2014 at 10:28 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174939","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Tsk! David G beat me to it…\n\n","date":"December 6, 2014 at 10:28 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174940","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Just show that it has the same properties as the Shroud [edited]\n\n","date":"December 6, 2014 at 10:45 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174942","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Will this do, Todd?\n\nThat’s brass crucifix left, and 3D-enhanced heat scorch onto liinen after positive-to-negative conversion in ImageJ (right).\nYou don’t need to pay my mortgage (cleared I’m glad to say). But maybe you could see your way clear to supplying a 4.4 x 1.1 metre length of linen, preferably herringbone weave. It’s for my next scaling-up experiment… Oh, and a life-size bronze of a fella would come in handy too.\n\n","date":"December 6, 2014 at 11:07 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174946","author":"Colin Berry","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Great, now all you have to do is present your evidence and research to peer review so that the image can be confirmed to have the 3D holographic properties of the Shroud of Turin. You are one step closer to being famous, [edited]\n\n","date":"December 6, 2014 at 11:44 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174949","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I doubt if I am the first to show 3D properties in a 2D image, Todd, given that ImageJ and its analogue predecessor had been around long before this blogger came sniffing by.\nThe real prize where the TS is concerned is not with producing a feasible model. It’s with producing one that is so blindingly obvious as to have folk think “Why didn’t I think of that first?” \nThere’s still more work to be done in that department, says he with a gleam in his eye…\n\n","date":"December 6, 2014 at 12:09 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174953","author":"Colin Berry","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Colin, FYI there is no one on earth that has a two dimensional image that contain the 3D properties of the TS. IF you doubt this FACT. Please do your homework. If you indeed have in your possession an image that contains the same properties, you are much more intelligent than the finest Physicists on earth. As a matter of fact. the Shroud image can not be explained by physics. Like I said before. IF you have cracked this mystery, you are a super genius. Prove me wrong.\n\n","date":"December 6, 2014 at 12:35 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174957","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Colin,\n I think your next experiment might be to take a photograph of the image that you are showing, and convert the photograph to a 3D hologram. That would be absolutely amazing!!!!!!!!!! If this is true, you are absolutely the finest genius on earth. Hats off to you……..If it’s true. I would head straight down to the Oxford physics department to let them know that you have cracked the mystery. Your gonna be a legend!!!\nYou have me completely exited about this!!!!!\n\n","date":"December 6, 2014 at 12:06 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174952","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Colin, I have heard a lot of talking. Present your evidence. A simple image won’t due. If this were legit, I’m sure that it would have gotten some serious attention. The fact that I am just seeing it for the first time is a little suspect. Here in lies one of the main issues. People are quick to talk, but when it comes to evidence…………………..Well that remains to be seen?\n\n","date":"December 6, 2014 at 12:18 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174954","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Todd, you may want to spend a few hours, days, reading through this blog. You’ll soon find that Colin’s work is not to be dismissed so easily. And you might dial down the hyperbole when someone calls your bluff.\n\n","date":"December 6, 2014 at 12:28 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174955","author":"David Goulet","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"[edited] If it’s true that Colin has managed to crack this mystery, I will be the first to congratulate him. I would like to meet him in person to shake his hand. I am not trying to be brash.\n\n","date":"December 6, 2014 at 12:53 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174959","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Solving the mystery of the TS is just a sideline for me, Todd. The real challenge is CO2 and global warming, reversal of cancer, Stonehenge, the Pyramids, the origin of life, the nature of the pre-Big Bang singularity, the fate of our Universe, who really wrote the Beatles hits.  But first there are some loose ends to tie up re the TS…  ;-)\n\n","date":"December 6, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174956","author":"Colin Berry","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Well of course you are right about all of those terrible things. One piece of advice I have for you though. Do not underestimate the power of The Shroud of Turin Image. We may find in this very image some of the answers to the problems that you have listed? Just a thought?\nRespectfully Yours,\nTodd Nelsen\n\n","date":"December 6, 2014 at 12:38 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174958","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I think Todd is getting a bit carried away. It was the mortgage thing.\nHis first remark was ““If there is someone out there that can find a two dimensional object that can be photographed and the photograph be turned directly into a full 3D image, I will pay their mortgage until your home is paid off.” A two dimensional object (Colin’s scorch) was turned directly into a full 3D image within a hour and a half. So now Colin’s image must be shown to have “3D holographic properties.” Why? Because “FYI there is no one on earth that has a two dimensional image that contain the 3D properties of the TS. IF you doubt this FACT. Please do your homework.” I think you’ll find, Todd, that we have done our homework. The Shroud of Turin is not a hologram, and has no more (or fewer) holographic properties than Colin’s scorchmarks. A hologram can be made of any 3D image, and therefore of any 2D image that can be converted into a 3D image.\n\n","date":"December 6, 2014 at 1:17 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174961","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Hugh, This is the problem. What you are saying is absolutely absurd. If it were true…….. we probably would not be talking about it right now. Fact is that no one on earth can currently explain the UNIQUE PROPERTIES of the shroud. If you say that I am incorrect, then show the proof. [edited]\n\n","date":"December 6, 2014 at 1:50 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174965","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"You keep widening the goalposts, Todd. Here’s the big dare you should have made your ‘mortgage’ offer on: show me anyone on earth who can explain definitively, with evidence, how the image was formed. You’re money would be safe with that challenge….for now.\n\n","date":"December 6, 2014 at 2:50 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174971","author":"David Goulet","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"David, there is a reason that I was so specific about the two dimensional image having to be photographed, and that photograph made into a three dimensional image. In other words, if you can take a photo of a photo and turn that photo into a three dimensional image. That is the phenomenon that I am referring to. As far as i am aware, the shroud image is the only one on earth that bear these characteristics. What you gentlemen are saying if I am correct…….. that you currently have a means of creating an image that bears the same three dimensional characteristics as the shroud of Turin. I am asking you to present, in a logical manner this evidence so that the rest of us can compare. It’s that simple\n\n","date":"December 6, 2014 at 3:26 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174976","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Todd, I am the moderator of this blog. Your monetary offer is not trivial and therefore poses potential problems. If you want to make such an offer, find another venue. I am removing any reference to it. \nOn other things you are saying, we don’t know “that no one on earth can currently explain the UNIQUE PROPERTIES of the shroud.”  There is no way to know that. Do not demand proof to the contrary because you must bear the burden of proof if you make the statement.  And what do you mean by unique properties?  Which ones?\nStatements like, “As a matter of fact. the Shroud image cannot be explained by physics,” is simply wrong. Can you prove that? In fact, the image can be explained by physics. What may not be explainable is how the image got there on the cloth. \nYou statements about photographs or paintings comes from a lot of old, maybe out of date, attempts to explain that the body images are some sort of brightness maps or height-fields that can be plotted as 3D objects.  I get it and I do think it is quite mysterious.  But you are misstating the situation. \nI would recommend that you don’t use such bullying language as talk is cheap. It is insulting.\n\n","date":"December 6, 2014 at 3:02 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174975","author":"Dan","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"My apologies. If you have any current information that I am not aware of regarding the image properties I would be very interested. I am only aware of the current studies that have been presented regarding the 3D properties of the photograghs that we currently have.\nSorry if I got carried away.\nTodd Nelsen\n\n","date":"December 6, 2014 at 3:32 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174978","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"A far as I am aware, physics has not presented an explanation as to how a two dimensional object , has 3D caracteristics such as are present on the shroud. Again, If you have any information that refutes this, then I would be interested.\nThanks Dan\n\n","date":"December 6, 2014 at 3:35 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174979","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"It is not to be refuted. It simply is not correct. Who told you that physics has not presented an explanation? You can’t go around saying “as far as I am aware” and then ask people to refute it. You might as well say that as far as you are aware the world is flat and think it so unless someone refutes it.\nVirtual reality and gaming software regularly uses 2D height-field images to produce realistic looking 3D landscapes. NASA uses them to generate 3D surface representations of the moon and planets. Those height-fields are created by radar and lasers. Google Earth software makes 3D renderings of our planet from 2D heigh-field images. NOAA produces 3D images of hurricanes from radar data represented in 2D images. Height-fields are regularly used in new-generation 3D ultrasound sonograms.","date":"December 6, 2014 at 4:25 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174981","author":"Dan","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"I am sorry if I was not clear. What I am saying is this. If you were to take a photograph of the image that you just posted, and viewed it under a VP-8 analyzer, you would see a flat or distorted image. If you look at an image of the shroud, you get a 3D image. I understand that we are able to make 3D images. Not refuting that.\n\n","date":"December 6, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174983","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Here is a quote from a study that I found. “The VP-8 image analysis revealed that a photograph of the Shroud image was “spatially encoded”, i.e., it possessed depth information and resulted in anatomically correct 3D images of the face and the body. So now they had the scientific proof that the observations of Paul Vignon were correct . It is important to note, that they experimented with lots of photographs of faces and other images, including paintings, and that the result always was a distorted image.”\n\n","date":"December 6, 2014 at 4:56 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174990","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Rather to my surprise, when I did exactly as Todd suggested, and took a screenshot of Dan’s image and looked at it with ImageJ, it was quite good. The fingers of the hand stand out particularly well, and the dimple in the nose and cheek. The cranium, being closest to the image plane, is brightest and highest. I think it bears comparison with Shroud in spite of not being a symmetrical face-on obviously recognisable pattern.\n\n","date":"December 6, 2014 at 5:42 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174998","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Interesting because the picture is the plot made from sonagram data where brightness represents distance. I wish I had the source data, in effect the 2D picture. I’m looking for it.\n\n","date":"December 7, 2014 at 1:21 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175047","author":"Dan","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"The two most important and irrefutable modern day discoveries, by\nPia for one and by Jackson et al for the other, both come from image\nprocessing and remote sensing of the Shroud. No picture of any other\nperson, statue, or artwork\nproduces results equal to Pia’s photonegative of\nthe Shroud. No photograph of any other person, statue, or artwork causes\nresults equal to the brightness plot of the VP8 Image Analyzer system\nviewing a Shroud image. A third, recent improvement of image processing\nanalysis has produced unequaled results from works by Dr. Petrus Soons,\nby Ray Downing, and by others who have proven the value of spatial\ndatabase management and processing of Shroud images. These works yield\noutstanding 3D models of the data present on the Shroud. My continued\nwork is motivated by these discoveries and process improvements. The\nShroud is very exciting. It continues to prove there is always more to learn\nabout all the information it contains.\n\n","date":"December 6, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175006","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Hello again Pete, er, sorry, I meant to say Todd. Nice to have you with us, Pe…    er, Todd:\nBtw. I preferred the original choice of font (blue):\nhttps://www.shroud.com/pdfs/Schumacher-refl.pdf\n\n","date":"December 7, 2014 at 12:46 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175046","author":"Colin Berry","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Here is a quote from DR. PETRUS SOONS\nTHE SHROUD OF TURIN, THE HOLOGRAPHIC EXPERIENCE\n“Dr s. Jackson and Jumper used a densitometer to\nextract the gray scale information and then with the\nhelp of the VP-8 Image Analyzer, translated this information into vertical relief, which resulted in the\nfirst three-tridimensional photos of the Shroud image. They were able to conclude that Vignon’s theory\nwas correct. The work of Prof. Tamburelli confirmed this also. It is important to note that if you use any\nregular photograph in this process, the result will be distortion and flattening of any three-dimensional features, because there is no photograph that contains the 3D information that we find in the image on the Shroud.”\n\n","date":"December 6, 2014 at 9:57 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175033","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"They did say that, didn’t they? And they were wrong, weren’t they? The first tridimensional images of the shroud were made simply by scanning a photo of the Shroud with the VP-8 analyser. Vignon’s hypothesis, that if the reflectivity of the shroud is directly related to distance from a hypothetical horizontal a relief resembling a face can be extrapolated, has never been denied. They are wrong about the distortion and the flattening, as can be seen in abundance in this blog, where relief images at least as good as the shroud and often better (such as Colin’s above) are demonstrated.\n\n","date":"December 7, 2014 at 4:14 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175065","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Hugh, So far I have seen and image of a brass Jesus draped in cloth, and a baby. I have heard you say that what I am saying is wrong. All of the studies that I have read say that what you are saying is wrong. Can you provide published work that refutes the claims that have been made that the photos of the shroud of turin have spacial encoding unlike any other photograph? If these claims have been refuted by credible evidence, I would be most interested.\n\n","date":"December 7, 2014 at 10:45 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175101","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"“All of the studies that I have read”\nIf you’d like to mention one or two of them, I will happily refute their claims.\nAnd seriously, have you never seen a hologram? They were very popular some years ago, and can be bought for very little on ebay. The one I was referring to was of course the flying bird which appears on every VISA card throughout the world. There is no doubt something similar on other credit cards. The Shroud is not a hologram.\nYou mentioned Dr Soons, whose work was remarkable in several ways, and who did produce a hologram from the image on the Shroud. The production of the hologram, however, could have been just as easily achieved with any 3D image digitally plotted on a computer, and had nothing to do with the Shroud. Where he, and later Ray Downing, really achieved success was in their taking of the fairly crude bas relief achieved by the 3D software, and manipulating it into an image which better resembles a man lying down. No one could fail to be impressed by their achievement, but it requires considerable subjectivity and is really more of an art than a science. However, their starting point was no better than Colin’s scorch, and, had they bothered, they could have produced just as good a hologram from that as from the Shroud image.\nI have to say that I’m not sure that if you have read Drs Jackson, Jumper or Soons or Ray Downing’s detailed accounts, you have really understood them. As I say, if you would like to give a reference, I will be most happy to explain it to you, and, if there is anything to refute, to refute it.\n\n","date":"December 7, 2014 at 3:02 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175122","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Hugh, Let’s set the Hologram debate aside. Let’s focus on some of the statements that I have made regarding the spacial encoding of 3D information. Would you tell me flat out that the Shroud when photographed, does not have any different properties than any other photograph?\n As for the studies that have been done on the Shroud of Turin. There are many. A lot of this information can be found readily on-line. I have listed quotes from two of them that say “No other photograph contains spacial encoding when viewed under the VP-8. If this is not true, then can you please provide information to the contrary ?https://www.shroud.com/pdfs/schumchr.pdf\n\n","date":"December 8, 2014 at 3:07 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175257","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Quote by: Peter M. Schumacher\n“Consider the following: The Shroud of Turin induces a result through photographic\nimaging that is unique, compared to all other photographic results taken from other\nobjects of the same acknowledged period as the Shroud, of prior periods, and to the\npresent day. It is the “data” existing on the Shroud of Turin, which induces the unique\nphotographic results. Therefore, the Shroud image, itself, is unlike any other object or\nimage known to exist.”\nOK Hugh, Maybe you can respond to this quote. I ask again that you provide published evidence to refute this claim.\n\n","date":"December 8, 2014 at 3:32 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175261","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Hugh, Unfortunately you are mistaken. Think Again. Show the evidence. Again, Talk is cheap.\n\n","date":"December 6, 2014 at 1:46 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174964","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"“Talk is cheap”…so too online comments it would seem.\n\n","date":"December 6, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174972","author":"David Goulet","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"The absurdity of my comment may be judged by other readers. The Shroud is not a hologram. I do not know of any unique properties. In common with every other artifact, it has a blend of properties which make the object unique, but none of them is particularly mysterious.\nTalk is indeed cheap. I note your 10 comments so far with interest, but I’m not sure what evidence you would like me to show. Do you want me to demonstrate that the Shroud is not a hologram? Well, I have hologram in front of me here. It is of a flying bird and about a centimetre square. As I tilt the hologram I seem to see a 3D object in that some parts of the bird are revealed and hidden, as they would be were it solid, as I move it from side to side. The beak almost touches the tip of the left wing in one orientation, but is far removed from it in another. This does not happen with a picture of the Shroud. No part of the cheek is hidden by the nose as I change my point of view, nor do the fingers seem to change their orientation. The Shroud is not a hologram.\nWhen viewed in a VP-8 analyser, or by ImageJ, a 3D image can be generated from anything at all, more or less realistically. Whether the Shroud image is better than any other full-face, frontally lit, black background, portrait is somewhat subjective, but whatever the realism, a contour map of the 3D image, and thence a solid 3D object can be generated from it. A hologram could then be made of this object, just as it can of any object, using the appropriate equipment. The Shroud is nothing special in this respect. In spite of “doing my homework” I have yet to see anything different elsewhere in Shroud research. If Todd can show anything different, I would, of course, give it my most concentrated consideration.\n\n","date":"December 6, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174969","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Hue, Sounds like a lot of talk. Maybe you should submit this with the evidence you are suggesting that refutes the current evidence that shows that the shroud is indeed a 3D hologram imposed on a piece of linen cloth to a peer review and see if what you say stands up to scrutiny. Again, if this is the case you would be refuting the current claims. If what you say is true………………..present the evidence. [edited]\n\n","date":"December 6, 2014 at 3:00 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174974","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"“the current evidence that shows that the shroud is indeed a 3D hologram”\nNo Todd. The onus is on you. If you can point me to any evidence that the Shroud is a 3D hologram, I shall be happy to refute it. There is no such evidence. There is nothing to refute.\n\n","date":"December 6, 2014 at 5:09 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-174994","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"OK Hugh, the Holographic properties of the shroud are a theory based on the unique 3D properties of the Shroud. The theory may indeed be true. Or not. There is evidence to suggest that it is.  Here is a quote from a discussion on this matter.\n“Chidambaram Ramesh gives us his explanation how this holographic 3D quantum matrix of the body of Jesus Christ could have projected itself onto the surface of the Shroud linen, creating the image of Our Lord Jesus on the Shroud. He gives us also an explanation of some of the very specific characteristics of the Shroud image, the photographic negativity and the built-in body-to-linen 3D information in the grayscale of the image that ought to be explained by anybody who proposes a new image-formation mechanism.                                \nWhen you reconstruct a hologram from the master-hologram, it produces a real and a virtual image of the object in 3D. A copy of the virtual image is always positive. A contact copy of the real holographic image however, is a “negative” image as we can observe in the Shroud image. Photographs of quantum holographic manifestations as recorded for example by Dela Warr’s device show spatially encoded 3D information when subjected to the Bryce Program or VP-8 Image Analyzer, and this is what we can observe in the Shroud image also. Another series of specific Shroud image qualities like the non-directionality, superficiality and the half-tone effect can also be explained with this quantum holographic idea.”\n\n","date":"December 8, 2014 at 4:06 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175263","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Todd. “Would you tell me flat out that the Shroud when photographed, does not have any different properties than any other photograph?” No, of course not, why would I? I have already said that when analysed by a 3D interpreter such as the VP-8 or ImageJ, the Shroud image can be converted to what looks like a bas relief of a face, where the nose and forehead appear more prominent than the eyesockets and so on. I am however very happy to disagree with you and any quote to the effect that “no other photograph contains spacial encoding when viewed under the VP-8.” The evidence is clear, unequivocal, and appears a few column inches above this comment. A scorch on a cloth, made by a heated object, photographed and analysed by 3D software reveals precise spacial encoding, and can be converted back into a 3D image of the object that made it. Exactly like the image on the Shroud. What’s more, as I have found out by myself, such an image is easily made from any object that can be sufficiently heated to produce a scorch.\nIt may be that Pete Schumacher had never seen a scorch image, but you, now, have. You can see that Schumacher’s sweeping generalisations, such as “the Shroud image produces a three dimensional response unlike any other image so processed” is simply wrong. Yes, wrong. A scorch produces a three dimensional response very like that of the Shroud. There’s a picture of it above.\nNow; how will you respond to the paragraph above? By quoting, again, from Schumacher? Why? Is he somehow infallible? Please don’t. Compare the Shroud 3D and Colin Berry’s 3 yourself and explain why they are not comparable.\nForgive me if I err, Todd, but it seems that you would rather accept the pontification of an “authority” over the evidence of your own eyes. If so, then of course there is little point in my attempting to demonstrate him wrong, and I apologise for wasting your time, but if you are able to make up your own mind from evidence presented, then please explain why the image above is so different from that of the Shroud image to you.\n\n","date":"December 8, 2014 at 7:02 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175281","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Hugh, I am sorry to say that it is pretty hard to make a comparison. It is a small photo posted on a web site. I would have a better time considering this work, if there were some study  that was provided that could be confirmed by someone besides you and Colin. I have not seen any study that cites Colin’s work. Can you or Colin Provide this? Hugh, Please don’t get me wrong. If this truly does represent a true comparison to the shroud it is amazing, I have never heard of anyone getting even close, so I would be very surprised. It would be the second known object with these special properties, and surely would go along way to possibly explaining how the image on the shroud was formed.\n\n","date":"December 8, 2014 at 8:01 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175287","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"It’s not rocket science Todd to convert a thermal imprint to a passable 3D-rendered image of the original template. Here it is in 4 steps:\n1. Brass crucifix and its negative scorch image in linen\n\n2. Same scorch in close-up:\n\n3. Same scorch after tone-reversal in ImageJ (use Edit Invert)\n\n4.Same scorch after left-right flipping and 3D enhancement in ImageJ. Compare with crucifix above. Not bad eh?","date":"December 9, 2014 at 2:15 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175315","author":"Colin Berry","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Hugh, I was unaware, as you may be as well, that Collin’s scorch hypothesis has been ruled out long ago. Attached is a link to a study done on this very subject.\nhttps://shroudofturin.files.wordpress.com/2012/10/scorch-paper-en.pdf\n\n","date":"December 8, 2014 at 8:30 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175289","author":"Todd","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Todd: this blogger has provided extensive critiques on Thibault’s anti-scorch claims, the latter made in his pdfs that this site obligingly displays in its margin notes. But I get no response, and those pdfs remain inviolate and unchallengeable, having no facility for placing comments, and the author sees no need to add a section that addresses criticisms. In any case, how can a non-peer reviewed pdf presented as a fait accompli ever be said to “rule out” anything?\n\n","date":"December 9, 2014 at 2:47 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175318","author":"Colin Berry","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"As a (fairly) long time student of shroudstory by now, I am of course aware of all the reasons for and against the Shroud image being a scorch. I have carried out extensive research into the UV characteristics of scorched linen myself, corresponded in detail with Colin and Thibault, and deeply respect their ongoing research into the subject.\nThat, however, was not your point. You asked for evidence for two things, which has been provided with speed, clarity and abundance.\n1) Can I demonstrate that the shroud is not a hologram? Yes I can, and have done.\n2) Can I demonstrate any image at all that shows a similar 2D-3D convertibility to the Shroud. Yes I can, and have done.\nThere is no doubt that the Shroud is a unique object. It shows an image of Christ that is to mind superior to that of, say, Michaelangelo’s Pieta, Da Vinci’s Last Supper, Della Francesca’s Baptism, the Byzantine Pantocrators or any of the 20th Century images, including Ray Downing’s “Real Face of Jesus” or Akiane Kramarik’s paintings. That in itself could be evidence of a miraculous origin, and I would respect anybody who thought it so. As daveb reminded us a little while ago, the Shroud’s chief interest to Christians is as an icon of the almighty, and a very fine one it is too. It can justify its existence perfectly well without being wrapped up in para-scientific generalisations or mumbo-jumbo such as “holographic 3D quantum matrix” which means nothing at all. Beyond that, it’s a cloth, with an image, of unknown age, provenance and manufacture. These qualities can be investigated forensically. Some of us find it rewarding to do so, but it’s not compulsory.\n\n","date":"December 9, 2014 at 5:57 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175341","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud Evidence for God’s Existence?","post":"Well obviously I am not going to get credible studies from you gents to make a logical determination about your image testing. If it were available I’m sure you would point me to it. I will have to conclude on the basis of the conversations, and the fact that the only evidence that you have presented is a photo of a scorched piece of cloth, that you have a long way to go to convincing anyone but yourselves. Colin, if what you say is true, it sounds like all you have to do is take the study that I posted, and to write a counter to this study with your findings, that refute each statement made. I’m sure it would go a long way to proving your point, and eliminate a considerable amount of hot air.\nIt was a pleasure to speak with you fine gentlemen. I am sure there is a group of people out there that will buy your arguments, but as of yet you have not convinced me.\n\n","date":"December 9, 2014 at 11:36 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","id":"comment-175381","author":"Todd","site":"shroudstory"}]
