[{"title":"Is the Shroud Really the Most Studied Whatever in History?","post":"To paraphrase Bill Clinton it depends on what the meaning of the word “:relic” is. Granted that one definition is more or less identical to artifact. However, it also has a more limited definition as meaning something connected to a particular figure often a saint. It might have a secular meaning even in that regard. \nBen Franklin’s eye glasses would be a relic more than just an artifact. Do we have Washington’s wooden teeth? Brutus’s knife would be a relic more than a artifact but I don’t believe such exists.\nThere is of course the arm of St. Francis Xavier that is a relic more than just an artifact.\nIf the Shroud is authentic, than it would probably be the most studied relic in the limited definition of a relic.\n\n","date":"June 29, 2015 at 6:18 am","url":"https://shroudstory.com/2015/06/29/is-the-shroud-really-the-most-studied-whatever-in-history/","cat":"comments_promoted","id":"comment-204044","author":"John Klotz","site":"shroudstory"},{"title":"Is the Shroud Really the Most Studied Whatever in History?","post":"Yes, relic vs. artifact is a distinction that matters.  Ultimately, though, that comes down to belief.  The ‘most studied’ part is true in the sense that it has been examined, pondered, sought after, etc. for (the evidence suggests) nearly two thousand years.  In another sense, though, it’s not even close to the top of the things-examined-by-science pile (let’s assume for the moment that such a thing exists) simply because of a lack of access.  All of which makes sense given its fragility and the stakes involved but would still exclude it from the upper echelons of examined…thingies.  Until, perhaps, reliable and accepted non-destructive methods are available.\n\n","date":"June 29, 2015 at 8:59 am","url":"https://shroudstory.com/2015/06/29/is-the-shroud-really-the-most-studied-whatever-in-history/","cat":"comments_promoted","id":"comment-204051","author":"Jeffrey Liss (@jeffliss)","site":"shroudstory"},{"title":"Is the Shroud Really the Most Studied Whatever in History?","post":"For an object that “has been examined, pondered, sought after, etc. for nearly two thousand years “, it has remained remarkably unnoticed by historians until medieval times.\n\n","date":"June 29, 2015 at 9:19 am","url":"https://shroudstory.com/2015/06/29/is-the-shroud-really-the-most-studied-whatever-in-history/","cat":"comments_promoted","id":"comment-204053","author":"PHPL","site":"shroudstory"},{"title":"Is the Shroud Really the Most Studied Whatever in History?","post":"Curious you left out my parenthetical.  It crossed political, cultural, religious and language barriers.  Do you really expect it would be called the same thing — or even understood the same way — that entire time. Simply because there isn’t a formal chain of custody isn’t an excuse to ignore the evidence, which is compelling and abundant.\n\n","date":"June 29, 2015 at 10:26 am","url":"https://shroudstory.com/2015/06/29/is-the-shroud-really-the-most-studied-whatever-in-history/","cat":"comments_promoted","id":"comment-204061","author":"Jeffrey Liss (@jeffliss)","site":"shroudstory"},{"title":"Is the Shroud Really the Most Studied Whatever in History?","post":"Thousand years of silence???\nWell…\nHere what I have read about the silence by St. Paul about the Holy Virgin:\n>…It is often stated that “Mary is never mentioned in the Bible by Paul” …\n>…it would be a mistake to base a doctrine or even a view of the relationship of Mary to Jesus based on silence in St. Paul’s epistles.  …\nIs a similar case the mysterious problem of the Shroud?\n— —\n>Rabban Gamallel (first century) instituted the use of a plain linen shroud for everyone (Bavli Moed Katan 27b. Cf. Matthew 27:59).\nLink:\nhttps://www.shroud.com/faq.htm\n— —\n>… …The textile fragments belong to a shroud. The deceased was buried with the shroud because there was no secondary burial. The tomb was probably sealed because of leprosy and there was no bone-collecting after a year. The shroud is made of wool. The Z-spin of the wool suggests production outside of Israel as Z-spun threads form only a small proportion of textiles in Israel and its neighbouring countries in the Roman period. The wool textile from the Ben Hinnom Valley could, therefore, have been imported from Greece or Italy in which Z-spinning was the norm. … …\nSource, the study:\n“A burial textile from the first century CE in Jerusalem compared to roman textiles in the land of Israel and the Turin Shroud”\nby Orit Shamir\nLink:\nhttp://www.shs-conferences.org/articles/shsconf/pdf/2015/02/shsconf_atsi2014_00010.pdf\n\n","date":"June 29, 2015 at 10:39 am","url":"https://shroudstory.com/2015/06/29/is-the-shroud-really-the-most-studied-whatever-in-history/","cat":"comments_promoted","id":"comment-204062","author":"piero","site":"shroudstory"},{"title":"Is the Shroud Really the Most Studied Whatever in History?","post":"Irrelevant.\n\n","date":"June 29, 2015 at 10:43 am","url":"https://shroudstory.com/2015/06/29/is-the-shroud-really-the-most-studied-whatever-in-history/","cat":"comments_promoted","id":"comment-204063","author":"PHPL","site":"shroudstory"}]
