[{"title":"Am I the only one?","post":"Actually CB is just recycling my one of my own ideas to fit in his scorch theory-like speculation. I first draw his attention to the Saint Lawrence and Turin Shroud issue as early as February 2013.\n– First on February 25, 2013 at 3:43 pm, in CB’s blog, I wrote half seriously half tongue in cheek:\n“Le terme de graal est traduit en anglais par « grail » – le saint graal : the holy grail. Or graal se rapproche du terme de vieux français « grail » qui signifie gril et grille – car les deux mots ne sont différenciés qu’au XVIIème siècle – du latin cratis (grille, claie). Le verbe « griller » était orthographié « graailler », remarquez les deux « a ». On retrouve le gril dans un récit irlandais racontant l’évolution de Tuân mac Cairill réalisant l’Homme primordial en lui.\nIf you still don’t know the optical reason why YOU THINK YOU SEE “un homme grillé à petit feu” just pray Saint Lawrence for it… and Saint Cecil too…”\n– Then on October 16, 2013 at 9:53 am | #12 Reply | I first wrote in DP’s blog:\n“Re CB being the victim of a pareidoliac “semblance et avision” is another good example of RE-EXPERIENCED archaeopareidolia…”\n“Actually the first “CRYPTIC SYMBOLICAL” rendering of the vision” of a man been roasted while the observer was looking at the burial Shroud (now kept in Turin) dates back to the first half of the 5th C. CE (see the Maryrdom of St Lawrence mausoleum of Gallia Placidia, Ravenna). Many Turin Shroud data are here YET ciphered. There is another late 11th-early 12th Shroud-like cryptic Martydom of Saint Vincent/Lawrence being roasted on a grate by Benedictine Abbot-mural artist, Hugh of Cluny (1049-1109) (see his designed programme of mural paintings in the Cluniac chapel of Berzé-la-Ville in Burgundy). Actually Saint Vincent and Saint Lawrence are currently mistaken one for the other. ”\n– Then again on October 16, 2013 at 10:08 am | #14 Reply | and October 19, 2013 at 10:15 am | #53 Reply |:\n“Notice in the Ravenna mosaic the most intriguing characteristic of Saint Lawrence’s grate: it has wheels! Actually the two small wheels cryptically feature two of the four roundish water-stains in conjunction with the series of burn holes one can still see on the TS.”\n“Actually, in the Ravenna mosaic the gridiron grate leg rings (about 5cm in diameter) are about twice smaller in diameter than expected and look more like small wheels. Now the water-stains in conjunction with the 4 series of symmetrical burn-holes on the TS, are about 5cm in diameter too. This is both a spy clue and a de-rhyming pattern in the composition.”\n“Most likely the original size of the bloodied body long burial cloth (TS) was 111x436cm not 113x444cm, present size. Hence folding shall be adapted to get about 28x27cm square folding marks all over the cloth surface (and conjure up a pareidoliac grate image in conjunction with roundish water-stains as pareidoliac wheels and blood-belt as pareidoliac raging flames).”\n– Then again on October 16, 2013 at 5:24 pm | #23 Reply |, I wrote in DP’s blog:\n“(…) can you (Dr. I. Colinsberry)  “scientifically” recognized a naked Templar by means of the head on the Lirey Pilgrim badge? Is that what you call circumstantial evidence? A medieval observer taking a look at the Lirey Pilgrim badge, would have either recognized the Holy Shroud or mistaken the naked man for Saint Lawrence or Saint Vincent (not a Knight Templar)”.\n– Then again on October 16, 2013 at 5:30 pm | #26 Reply |:\n“Addendum rearding Dr. I. Colinsberry’s big S(cience): Jacques de Molay and Geoffrroi de Charney were burned at the stakes KNELT AND IN THEiR SHIRTS (and not stark naked) not on a grate or griderion like Saint Lawrence and Saint Vincent. Your pseudo BIg S(cience is FLABBERGASTING!”\n-Then again on October 16, 2013 at 7:10 pm | #29 Reply |:\n“Reminder: Saints who died in imitation of Christ’s self-sacrifice and martyrdom (i.e. in imitatio Christi) could be depicted with Christ-like and even at times Shroud-like characteristic traits AND/OR (pareidoliac) attributes whence the steganographic depictions of e.g. Saint Lawrence (in Ravenna, early 5th c. CE) and Saint Vincent (in Berzé-la-Ville, early 12th c. CE).”\n\n","date":"April 3, 2014 at 10:27 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96160","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Am I the only one?","post":"Colin is a strange person.\nOn one side, he provides some interesting ideas (although questionable) based on his scientific background. His main purpose is supposed to demonstrate that almost all the previous studies on the Shroud are “pseudo-science”.  \nOn the other side, he advances a strange proposal about the origin of the TS image based on very very very doubtful connections. This is pseudo-(historical) science. \nI am not interested in Colin’s historical pseudo-science.\nI am interested in his scorch hypothesis. \nSome months ago, I wrote a paper about the scorch hypothesis:\n https://shroudofturin.files.wordpress.com/2012/10/scorch-paper-en.pdf \nNow, I am writing another paper based on new experiments at fabric, thread and fiber level.\n\n","date":"April 3, 2014 at 3:17 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96201","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Am I the only one?","post":"Seems to me that Thibault has a lot of time to lose…  It’s EVIDENT that the Shroud image is not the result of a scorch.  The combination of the evidence concerning the blood and serum stains, along with the ultra-superficiality of the image no matter which area we look on (whether it is a very faint zone or a dark zone, the ultra-superficiality is the same) must be well enough for anyone with a brain that works all right to discard any hypothesis of image formation involving any kind of artistic technique.\nI know I said all that a hundred of times here but since I keep on seeing Shroud researchers losing their precious time on ludicrous hypotheses, I felt it was ok to repeat myself here…\nMessage to Thibault:  Do whatever you want.  It’s your freedom.  But, to me, you are losing a lot of hours that would have been much more productive working on other (serious) aspects of Shroud research.\n\n","date":"April 3, 2014 at 3:39 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96208","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"Thibault’s experiments may provide new insights into image formation. Often in science one goes looking for one thing and stumbles upon something new that was not anticipated.\nYou can repeat yourself all you want, and I will repeat myself in turn on this point. Exploring scorches is not a waste of time because it may bring new ideas about the image formation — unrelated to the medieval artisan theory.\nScience is based on a reciprocal system wherein when someone presents a hypothesis backed up with some experimentation, others respond by examining the evidence and performing similar experiments to corroborate or dismiss the earlier observations. It’s part of the scientific method and a professional courtesy.\nThis can be a tedious process, but that’s how science works. No stones unturned. Ideas continually re-examined.\n\n","date":"April 3, 2014 at 4:06 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96216","author":"David Goulet","site":"shroudstory"},{"title":"Am I the only one?","post":"You can think that.  I have no problem with your opinion…  But personally, I think there are lots of research fields much more important and relevant that should be explored in deep, well before the scorch hypothesis.\n\n","date":"April 3, 2014 at 4:17 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96218","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"I too am working on the scorch hypothesis. It is, as Yannick puts it, my freedom. This is because to me it is neither “EVIDENT” that the shroud is not a scorch, nor “ludicrous” to suppose that it is. However, I agree that there are other aspects of the image to research, and, apart from a slight difficulty with saponaria (where do you get saponaria from?), I am also attempting to duplicate Rogers’s ammonia/evaporation gradient experiment. If Yannick would like to suggest other (serious) aspects to investigate, I should be delighted to add them to the list…\n\n","date":"April 3, 2014 at 4:34 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96222","author":"Hugh Farey","site":"shroudstory"},{"title":"Am I the only one?","post":"If you want some inspiration, look at my last comment just under this one…\n\n","date":"April 3, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96225","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"And please, answer this to me with honesty:  How a medieval guy could have used the bloodstained cloth of a crucified man (there were no crucifixion in Europe during medieval time) and then, use a scorch technique to produce a perfect body image around those stains, so that the image would be in almost perfect sync with the blood stains, while, at the same time, producing no evident damage to those biological stains?  Sorry, but this is truly a ludicrous idea…\n\n","date":"April 3, 2014 at 4:41 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96227","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"And I’m not even talking about the question of how this medieval forger could have manage to produce an image with a scorch technique that would have been limited to the top-surface of the cloth, no matter if we look at a very faint zone or a darker one?  When you put the question regarding the blood along with this one, you don’t need to be a genius to understand that the answer to the image formation is lying elsewhere…\n\n","date":"April 3, 2014 at 4:44 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96229","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"Yannick, enough is enough. Thibault is right to study scorches. Hugh is right in his criticisms of your endless repetition.\n\n","date":"April 3, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96244","author":"Dan","site":"shroudstory"},{"title":"Am I the only one?","post":"Think about that:  While a lot of time is prent on checking hypotheses involving whether a burst of some kind of energy that would be related to the Resurrection or some sort of artistic technique, almost no time at all is spent checking all the different hypotheses that have been proposed over the years involving a natural phenomenon, even though this is probably where the answer to the Shroud image formation is lying…  \nI always found this reality very strange and, honestly, I don’t you if I should laugh or cry when I think about that.\n\n","date":"April 3, 2014 at 4:37 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96223","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"I think many of these smaller ‘kitchen’ experiments are done because they are just that – small and simple to perform. And yet they can provide interesting results. The experiments you speak of require more time and resources than most amateur researchers can afford. And no one has access to the Shroud itself which is the very heart of the matter.\nI believe everyone is frustrated with the lack of new data, the lack of new testing. So when one at least finds a small experiment to work with it is almost a catharsis to dive into it.\nUntil such time as science once again has full access to the Shroud, all other experiments – from the ‘serious’ to the admittedly fantastic – keep the fire burning and provide the opportunity for new insights. Some may even put the final nail in a theory or two.\n\n","date":"April 3, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96234","author":"David Goulet","site":"shroudstory"},{"title":"Am I the only one?","post":"Yannick, you have just taken the trouble to repeat your previous assertion several times. Please believe me that I am by now very familiar with what you think, and why. I just don’t agree with you. Now why not re-read my comment, refrain from telling me how ludicrous my work is at present (again!), and suggest what I might be better employed on instead.\n\n","date":"April 3, 2014 at 5:23 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96241","author":"Hugh Farey","site":"shroudstory"},{"title":"Am I the only one?","post":"Have you thought of setting up a BSTS site with a research orientation Hugh? Leave this one to the trolls and the mantra chanters…\n\n","date":"April 3, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96243","author":"colinsberry","site":"shroudstory"},{"title":"Am I the only one?","post":"You know, I’m just a regular guy here. As I sit here looking at the portrait of Jesus (a negative image of just the face I purchased 10-12 years ago from Barrie Schwortz with the caption that read-“Contemporary Insights To An Ancient Paradox”), the image’s so vivid, real, anatomically accurate. Everything I see of the image is perfect, Its a photographic snapshot of a scourged, beaten body. I can’t believe some of you are hanging on to ‘scorch theory’. Its ridiculous. If you look at the image long enough, you would be shaking your head thinking-“no way its a scorch because its too REAL!\n.\n\n","date":"April 3, 2014 at 7:49 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96274","author":"Don","site":"shroudstory"},{"title":"Am I the only one?","post":"As we do not know the actual mechanism that caused the image, experimenting with scorches could provide incites into that mechanism (i.e. direct heat, chemical, radiation, etc). Such experiments could provide evidence that a certain mechanism was not in play.\nI don’t think the available evidence points to a medieval crafted scorch, however experiments that start with that premise may still uncover revelations related to the image formation mechanism. This is why I do not feel they are a waste of time.\nIn fact if someone told me they were doing an experiment to see if the image was created with rancid olive oil and sheep bladders I’d want to see the results. Not because I believe that was how it was made, but because in the results we might find insights that do lead to more likely mechanisms. Chances are of course this experiment will provide nothing helpful, that’s science most of the time, but we just never know where the eureka moment will come from.\nThat being said, experiments that test other premises – such as post-mortem gases — are most welcome as there is indeed a lack of such experimentation.\n\n","date":"April 4, 2014 at 9:31 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96478","author":"David Goulet","site":"shroudstory"},{"title":"Am I the only one?","post":"In 2003, Ray Rogers took a sample of Edgerton bleached linen and treated it with dextrin and saponaria; Result no colour. After evaporation he exposed it for 10 minutes with ammonia. Afer 24 hours a light colour was observed “on the surface only”.  Has this experiment ever been repeated? I don’t know, but I suspect not.  What are the parameters (concentrations, strength, environmental conditions) that optimise the colour, What about amine chemicals different from ammonia, maybe simulate cadaverine, putrescine, sweat, urea etc?  There’s a programme worthy of attention! \nI know of no-one who has wrapped a freshly dead lab animal in Edgerton linen, to see what transpires in the way of forming an image.  But I’m repeating myself! \nThe key is to focus on the Shroud having wrapped a dead body, don’t waste time worrying about forger’s theories, think outside the square, and the Spirit will enlighten you as to which ideas are worthwhile pursuing for an experimental programme.\n\n","date":"April 3, 2014 at 8:16 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96281","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Am I the only one?","post":"“Edgerton linen” was hand-produced by a Kate Edgerton, from plant to woven cloth, and then, much to Ray Rogers’s chagrin, ironed, which made it go yellow, so he soaked it in hydrogen peroxide to bleach it. He hoped, and was probably correct, that this had no effect on his subsequent experiments. Although the linen is descibed as prepared “following the methods used in the Near East in Roman times,” no details are given in “A Chemist’s Perspective on the Shroud of Turin.” I have acquired some quite stiff unbleached linen, however, and am prepared to give it a try, using leaves from soapwort mashed in water as a source of saponin, and commercial dextrin (a readily available water-soluble glue) as the starch. I also have ammonia and urea. The problem is “freshly dead” animals. The trouble here is to acquire enough for sufficient repeatable experimentation. However, after asking around, I find that people who keep snakes as pets feed them on frozen mice, which are available quite cheaply in bulk. This looks promising, so I’m preparing an appropriate protocol for just the experiments you suggest!\nIncidentally, although my linen feels quite stiff and heavy, it has an areal density of only 16mg/cm2, which is considerably less than the Shroud, which therefore appears to be considerably thicker than I had previously imagined. As such, I think it will be much easier to produce discolouration on one side of the cloth only. Other investigators (Thibault? Colin?) might be able to comment further on this, and readers of this blog might like to weigh a bed-sheet themselves to confirm how flimsy it is compared to the Shroud.\n\n","date":"April 4, 2014 at 5:04 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96430","author":"Hugh Farey","site":"shroudstory"},{"title":"Am I the only one?","post":"That’s sound terrific, Hugh, and it’s at least a start on something closer to potentially authenticising experiments than some of the off-the-track attempts we’ve been more used to seeing here recently.  I wish you well in your endeavours, daveb.\n\n","date":"April 4, 2014 at 5:44 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96436","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Am I the only one?","post":"Good luck, however my prediction is not positive. You ay get a discoloration (contact image) but diffusion will never produce the resolution of the shroud image. However, it’s good thing to test and see.\n\n","date":"April 4, 2014 at 7:14 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96450","author":"Mike M","site":"shroudstory"},{"title":"Am I the only one?","post":"I would like to underline 2 very big problem I see in the pro-Shroud world (which are both evident on this blog) :\n1- The untouchables.  There are some pro-Shroud researchers that we can’t, under any circumstances, criticize for the way they perform their science.  I don’t need to mention any names.  Let’s call them « Sacred cows of sindonology ».  We all know who they are.  This kind of sham really leaves a very bad taste in my mouth and I really believe this is doing a great damage for the credibility of sindonology.\n2- The researchers who step out of their fields of expertise.  This is maybe the biggest problem right now.  All I see is people doing researches in a field for which they have no expertise, while often pretending being able to do « good science » in that field.  The case of Thibault Heimburger is a perfect example of this.  He’s a doctor and, very strangely, the only field of research relate to sindonology I never saw him perform any work is precisely all the things related to the biological aspect of the Shroud, including the whole question of the blood and serum stains…  This is just an example among a ton of other cases and, to me, this real problem of people stepping out of their field of expertise is the worst when it comes to the credibility of sindonology.\nOne last thing : On another completely different subject, I would like to share with you a great quote from from a great philosopher from here in Québec named Placide Gaboury, who died in 2012, and who was a Jesuit (he drop out of this Order in the 80s because he, like me, wanted to follow is consciousness through spirituality more than man-made dogmas and rituals) : “Because emotional and irrational impulses are hidden behind beliefs, they easily escape criticism, thus constituting a fertile ground for credulity, and from there, to intolerance versus everything that is different and threatening.”\nI agree 100% with him about that and the history of religions (including Catholicism with examples such as inquisition, excommunication, crusades, etc.) is there to prove it.  \nAnd I think you can agree easily with me that it is also very often the same thing in the Shroud world (and particularly on your blog), with all the wars that rages on, mainly because emotionalism linked with certain beliefs (a belief in the authenticity or not of the relic and also a belief in the idea that the image is a proof of the resurrection or not) is too high.\nThis quote was simply too good to keep it for myself…\n\n","date":"April 4, 2014 at 9:24 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96475","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"I must apologize to Thibault for one thing :  It’s true that, with Neil Svensson, he wrote a paper about the biological aspect of the Shroud.  I forgot about this one when I wrote my previous comment.  But that doesn’t change the fact that most of his research on the Shroud is concentrate on fields for which he’s not at all an expert…  Note : I use Thibault as an example, but as I say (and it’s very sad to see), he’s far from being the only one to do this (i.e. stepping out of his field of expertise).\n\n","date":"April 4, 2014 at 9:30 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96477","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"“This quote was simply too good to keep it for myself…”\nBut don’t forget to also apply it to yourself. :)\n\n","date":"April 4, 2014 at 9:34 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96480","author":"David Goulet","site":"shroudstory"},{"title":"Am I the only one?","post":"When you point a finger at others David, there is 4 others pointed at yourself.  I note that you’re very good at that.\n\n","date":"April 4, 2014 at 9:44 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96483","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"And don’t worry, because I’m not an alien but a human being, I don’t have any problem to recognize that I did let emotion goes too far when it comes to defending an opinion about the Shroud.  I don’t think anyone here is free of this problem.  The most important thing is to recognize this and work hard to avoid this as much as we humanly can (which will never be perfect).\n\n","date":"April 4, 2014 at 9:46 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96484","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"I should have said : “I don’t have any problem to recognize that I did let emotion goes too far SOMETIMES when it comes to defending an opinion about the Shroud.”  That’s more accurate.\n\n","date":"April 4, 2014 at 9:47 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96485","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"\nYannick Clément :\nWhen you point a finger at others David, there is 4 others pointed at yourself.  I note that you’re very good at that.\n\nActually there are only three fingers pointing back, try it. But you’re right, we all show our faults from time to time.\n\n","date":"April 4, 2014 at 10:45 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96494","author":"David Goulet","site":"shroudstory"},{"title":"Am I the only one?","post":"The problem is when someone (or a religion as a matter of fact) is not able to recognize this…\n\n","date":"April 4, 2014 at 10:50 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96496","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"Yannick, do any of the above postings mean anything? I’ve done my best, but got hopelessly lost.\n1) Your “Sacred cows of Sindonology.” Who are these people? I know nobody who hasn’t been thoroughly criticised on this blog and elsewhere, from Ray Rogers to Barrie Schwortz, via Marino, Heimburger, Fanti and myself. You say, “We all know who they are.” Well I don’t, and to be frank I don’t believe they exist at all. Would you care to name one?\n2) Fields of expertise. I don’t follow this. You seem to be criticising Thibault (specifically) for carrying out experiments on scorching when he should be focussing on blood serum because he is a doctor. Thank goodness I don’t have a “field of expertise.” I’m just an expert in general scientific methodology – does that count, or aren’t I allowed to carry out any experiments at all? \n3) Sadly the “great” Placide Gaboury doesn’t make it to the English version of Wikipedia, but even the French version does not describe him as a philosopher. It does say that he was expelled (rather than dropped out) from the Jesuit Order in 1983. I’ve no idea what the quotation you give really means. It seems to be a rather facile critique of religion and is far from original. Perhaps it sounds better in French.\n4) Finally, I quite like your “pointing the finger” aphorism, but when I point one finger, only three others point back at me. My thumb doesn’t.\nBack to my laboratory…\n\n","date":"April 4, 2014 at 11:16 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96504","author":"Hugh Farey","site":"shroudstory"},{"title":"Am I the only one?","post":"All that you said doesn’t surprise me at all…  That’s all I have to say, because if I add something, I will be mean and “non-Christian”…\n\n","date":"April 4, 2014 at 11:46 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96513","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"Just a precision for Placide Gaboury (who was a  much more intelligent and wise person than you and me) :  Because he preached things that were not totally in sync with the magisterium of the Church, the Jesuit Order gave him a choice :  You submit to us or you leave.  He CHOOSE FREELY to leave and you cannot know how I respect people like that who prefer by far to follow their consciousness instead of dogmas, rituals and rules dictated by men.\nBy the way, here’s another quote from him :  « I will believe in the Catholic Church when the Pope will be a black women and not just that, a black women who his a lesbian! »\nWhat a great quote! :-)  I agree with him…\n\n","date":"April 4, 2014 at 11:53 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96514","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"And here’s another one :  « The role of the priest should be one that would help the faithful to gradually get free from needing a priest. » Great quote!\n\n","date":"April 4, 2014 at 12:01 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96515","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"That is a good one.\n\n","date":"April 4, 2014 at 12:27 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96520","author":"David Goulet","site":"shroudstory"},{"title":"Am I the only one?","post":"I agree…  And the other 2 quotes are not bad at all either.  \nIn fact, what put him in trouble with the hierarchy of the Church is the fact that, like many free-thinkers and prophets, he preached (and lived) to follow our own consciousness through a personal relationship with God (spirituality) well before any dogma or rule imposed by men (religion), and especially those who goes against our consciousness.  In the 60s and 70s, he was truly a great prophet for our people here in Quebec.  To bad most people of his generation, instead of following in his footsteps, have simply chosen to get rid, not only of religion but also of God…\n\n","date":"April 4, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96529","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"Read “Too bad” instead of “To bad”…\n\n","date":"April 4, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96530","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"A belt around the waist or blood along the lower back and to the sides?\n\n","date":"April 5, 2014 at 12:07 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96679","author":"Thomas","site":"shroudstory"},{"title":"Am I the only one?","post":"Not, in my opinion, a belt or chain. Just possibly a single blood soaked cord making two marks as it moved from one position to another, but I don’t find that compelling. So perhaps a ‘reservoir’ of liquid blood at one side of the body, which leaked/trickled across to the other side and pooled, possibly twice, or possibly ‘there and back again.’ Perhaps the body was being rolled onto its side, as Max has suggested. But where could the ‘reservoir’ of blood have come from. Not, I think, the wound on the side. That would have flowed straight off. What about a blood-soaked cloth or sponge, being used to wipe the body down, and held at just the correct position as it was being turned?\nOr an artistic irregular double-dribble of a blood/madder mixture, very much in the style of all the other blood flows on the cloth, whether from the back or front of the head, the arms, the spear wound or the feet.\n\n","date":"April 5, 2014 at 5:35 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96740","author":"Hugh Farey","site":"shroudstory"},{"title":"Am I the only one?","post":"Very odd those lower back markings.\nI don’t know what to make of them. Make very little sense as an artistic addition but are also hard to explain as a natural phenomenon.\n\n","date":"April 5, 2014 at 6:55 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96747","author":"Thomas","site":"shroudstory"},{"title":"Am I the only one?","post":"I suppose it’s conceivable that the representation of a belt or cord may be just some artistic licence, perhaps an interpretation of the cause of the dorsal blood stain. Barbet implies his own  reasons for this stain [Doctor at Calvary, Ch 8 – Descent from Cross, Journey to Tomb …, p.149] \n“It is certain that the body of Christ was borne horizontally, but as it was on the cross, from this to the neighbourhood of the toomb, it was not till then that it was placed on the Shroud.” \nHe asserts that if otherwise, the cloth would have been drenched with blood because of the flow from the inferior vena cava; the journey was long enough for the inferior vena cava to empty itself through the wound in the heart. He also happens to mention discussing the matter with some abattoir officials who were familiar with this emptying of the vena cava during the killing of oxen. \nThe blood was therefore either lost or collected. Only that remained which coagulated on the skin, to a limited extent while it was flowing. Only after the journey, and the body then laid on the cloth, it received only the impression of the clots of blood formed on the skin of the back during the journey. Only these clots have imprinted on the Shroud, “what we call the dorsal transversal flow, because these clots are its mark.” \nWhether Barbet is correct or not, and I have no reason to think not, I suggest that comment on them be reserved to those who are adequately qualified in forensic pathology as was Barbet.\n\n","date":"April 5, 2014 at 6:50 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96746","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Am I the only one?","post":"IN DEFENSE OF DR. THIBAULT HEIMBURGER AND OTHER SHROUD SCHOLARS\nI regret reading a previous comment crticizing Dr.Thibault Heimburger (and other shroud scholars) for doing research allegedly outside their field of expertise.\nDoes knowlege have rigid boundaries?\nI can be a medical doctor and also have the skill to drive a fast race car in automobile race without being a professional pilot.\nDr. Thibault Heimburger is a medical doctor (like myself) and so he undoubtedly has a background in microscopy, physics and chemistry, I recall that some medical doctors specialize in Biochemistry and are teatchers in Medical Schools.\nAfter reading attentively his papersI I get the idea that he has indeed a great knowlege in microscopy, physics and chemistry,, much greater than mine.\nHis papers analyzing microscopical, chemical and physical aspects of the Shroud in a comprehensive way, gather overwhelming data to discard once and for all McCrone’s painting image theory, AND SCORCH THEORY.\nNevertheless I eagerly wait reading his new paper on his  new reaearch on the Scorch issue.\nDr. Thibault Heimburger is an outstanding Shroud researcher who is seeking the scientific truth unlike  pseudo Shroud researchers who get in kitchen lab experiments only to mislead readers of this wonderful blog.\nDr. Kelly Kearse is another good example of a Shroud researcher who has given a great contibution to Shroud studies.\nHis detailed studies on Blood issue enables us to conclude that the «blood stains» on the Shroud were produced by contact with a human body and not just a primate, and he also explained in a previous post why Dr. Charles Freeman’s statement that AB blood appeared only about 900A.D. WAS WRONG,\nThis is extremely important because if Shroud blood was only about 1000 years old despite many other facts, the Shroud could not be authentic ( could not have wrapped Jesus body).\nHe debunked in a comprehensive way this theory presenting for example, archeological findings of  2000 years old AB blood mummies found in Israel and statements from experts who are in total disagreement with D’Adamos’ diet theory.\nHe also explained on a genetic and molecular basis why the A gene appeared first than O gene,, and human AB blood group is much older than 900A.D. as had been claimed.\nTill then nobody had solid arguments to disprove that theory !\nI apologize for not mentioning ALL Shroud researchers who are doing excellent and honest research and contributing with their papers and presentaions to the advances in Sindonology, although a bit outside their field of expertise\n                                                                                   regards\n                                                                    Antero de Frias Moreira\n                                                                (Centro Português de Sindonologia)\n\n","date":"April 5, 2014 at 8:19 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96762","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Am I the only one?","post":"Thank you Antero for your most timely and apposite comment.\n\n","date":"April 5, 2014 at 3:26 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96853","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Am I the only one?","post":"Thank you Antero,\nI have nothing to add to your comment.\nTomorrow, I’ll send Dan my new pdf paper about the scorch hypothesis based on some new experiments and my final thoughts.\n\n","date":"April 5, 2014 at 3:28 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96854","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Am I the only one?","post":"The comment above prove that I was right when I talked about “the Sacred Cows of sindonology” (Thibault Heimburger being obviously one of them) in a previous comment and the fact that, inside the pro-Shroud world, there are researchers that we (those who believe the Shroud is authentic) cannot criticize at any cost…  \nToo bad for you guys but I have the RIGHT to criticize any researcher who goes on the public place and publish papers on the Shroud, just like he can do the same with me (but with an important difference: I never pretend to be a scientist and my papers about the Shroud are not what we can call “scientific papers” in the strict sense).\nOne thing’s for sure:  I KNOW Thibault is NOT an expert in ancient textile and I KNOW he’s not an expert with everything that concern the chemistry of a scorched linen, so I don’t give too much credit to anything that come out of his writings regarding the Raes samples for example or the analysis of the scorch hypothesis proposed by Colin Berry, just like I don’t give too much credit to anything that come out of Fanti’s writings regarding the chemistry and microscopic aspects of the Shroud.  Other people can think differently of course and that’s their right and I don’t care…\nAnd concerning Thibault’s work in sindonology, here’s an idea of a good research project he could do (because it is right in his field of expertise): Why not revisiting the work of Lavoie concerning the transfer of blood on linen?  We once talked about that via email and we both agreed that his research protocol had some potential flaws.  Now, that would be a work I would give more credit because he’s a doctor and the subject is blood transfer…\n\n","date":"April 5, 2014 at 5:44 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96883","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"Where is the control on adhesion of thin layers on linen fibrils ? …\nSee also the “ghosts” …\n\n","date":"April 5, 2014 at 9:39 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96783","author":"Piero","site":"shroudstory"},{"title":"Am I the only one?","post":"Antero,\nThank you very much for your kind comments\n\n","date":"April 5, 2014 at 5:01 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96874","author":"Kelly Kearse","site":"shroudstory"},{"title":"Am I the only one?","post":"Mr. Kearse, I must say I have a lot of respect for the work you did so far about the Shroud because you were able to stay in your field of expertise…  I needed to say this in order to show that there are still scientists in sindonology who are doing it “the right way”.\nNote that this is also true for good scientists like Fazio and Mandaglio in Italy (who are nuclear physicists and who don’t try to make ancient textile analysis or historical researchers or anything that is not in their field of expertise) and for some others too.  And this was also the case for the STURP team and, as Barrie Schwortz often told me personally, this is one of the most important reason why the science of this team effort is so solid and hard to dismiss by skeptics…\nNote:  I know the truth that I said about the fact that some Shroud researchers are hurting the credibility of sindonology by stepping out of their field of expertise hurts many pro-shroud people but I think this truth needed to be said.  Often in life, truth hurts…\n\n","date":"April 5, 2014 at 5:52 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96885","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"I will also say that I respect Thibault Heimburger’s will to find truth about the Shroud, but I think he should stay in his field of research when it comes to do Shroud science…  That’s all I say.  And I hope people will understand that I used Thibault just as an example and that there are a lot of people who do the same (and much worse than him in many cases).\n\n","date":"April 5, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96886","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"Yannick, again, what are you talking about?\nThibault’s work has been closely examined by lots of people, some of whom agree with his conclusions and some of whom don’t. There is no sense in which he is an inviolable  “Sacred Cow.” Colin has criticised his work at length, and I often disagree in detail. He is emphatically not a researcher that we “cannot criticize at any cost,” and to claim that he is, is vapid.\nOf course you have a RIGHT to criticise: you may criticise his methodology, his presentation of results, and his conclusions. But there is no need to get overexcited about it as no one has ever denied you that right. You do not have a right to criticise his character, his beliefs or his faith, because you know nothing about them, and when overexcitement has led you into intemperate language, your views have been deleted by Dan, which, of course, he has every right to do.\nSo you know Thibault is not an expert in ancient textiles or the chemistry of scorched linen. Well so what? He has carried out some experiments and presented his results. Not being a scientist you do not know whether his conclusions are valid, so reject them by appeal to “lack of authority.” I think that’s a perfectly reasonable position to hold. I don’t mind you holding it, and I don’t suppose anybody else does either, so why say “too bad” for “us guys”? We don’t mind at all. We hope you’ll forgive us, as scientists, for not taking your admitted ignorance as good evidence for changing our own opinions of Thibault’s work.\nAnd yes, a great deal of useful work could be done with a doctor with ready access to a lot of spilt blood and some linen. I have no doubt Thibault agrees with you. However he is under no obligation to carry out such work, and may not have the time, the resources or the inclination to do so. And such is his right.\n\n","date":"April 5, 2014 at 6:28 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96892","author":"Hugh Farey","site":"shroudstory"},{"title":"Am I the only one?","post":"Nothing else to answer than this Hugh: Other people can think differently of course and that’s their right and I don’t care…\n\n","date":"April 5, 2014 at 6:34 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96894","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"It is time-wasting, unpleasant, self-serving, arrogant and unacceptable!\n\n","date":"April 5, 2014 at 7:23 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96910","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Am I the only one?","post":"I’m sure you would prefer that I say:  every pro-Shroud researcher is good, nice, perfect and his doing a good, nice, perfect science and everyone of them is clean, honest and beautiful. :-)\n\n","date":"April 5, 2014 at 7:47 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96915","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"I fail to see the need to express any kind of opinion on individual researchers’ personal qualities or abilities at all. I’m sure they all attempt their best as they see it, no matter what their names might happen to be. Comment on their work and results might be another matter, and that is what should be addressed.\n\n","date":"April 5, 2014 at 11:16 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96968","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Am I the only one?","post":"Perhaps, Yannick, you should take a brief respite. Also, due to the directionless and pointless string of comments, it would be optimal that you stop doing the same. Thank you.\n\n","date":"April 5, 2014 at 9:16 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96937","author":"Alexander Walker","site":"shroudstory"},{"title":"Am I the only one?","post":"Corrected copy: Perhaps, Yannick, you should take brief respite. Also, due to the directionless and moreover pointless string of comments, it would be optimal that you stop, well, making directionless and pointless strings of comments. Thank you.\n\n","date":"April 5, 2014 at 9:21 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-96938","author":"Alexander Walker","site":"shroudstory"},{"title":"Am I the only one?","post":"In light of this post I have been thinking about Colin’s theories some more.\nI have some major objections to any theory that involves bas relief or statue.\nWith a bas relief image we would expect something quite different.  For example we would expect to see the back of forearms on the dorsal image.\nAnd a major problem for both statue and bas relief generated images is the display of buttocks.\nThe image came from a real human being who was probably Jesys.\n\n","date":"April 6, 2014 at 5:08 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97045","author":"Thomas","site":"shroudstory"},{"title":"Am I the only one?","post":"Sorry, Jesus\n\n","date":"April 6, 2014 at 5:09 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97046","author":"Thomas","site":"shroudstory"},{"title":"Am I the only one?","post":"“For example we would expect to see the back of forearms on the dorsal image.” I’m not sure I follow. Can you say why?\n\n","date":"April 6, 2014 at 8:10 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97068","author":"Hugh Farey","site":"shroudstory"},{"title":"Am I the only one?","post":"It would take a very clever 13th / 14th century bas relief artist to leave off the underside of the forearms on the dorsal bas relief, thinking\nin a 3 dimensional way. Possible, but unlikely I would suggest\n\n","date":"April 6, 2014 at 4:20 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97171","author":"Thomas","site":"shroudstory"},{"title":"Am I the only one?","post":"Ah, yes, I think I understand, and quite agree. If the ‘hot bas relief’ hypothesis were to be the cause of the image, I think there would have to be two bas reliefs, a front and a back, or a very flattened statue with two well defined sides.There is no way I can see the dorsal image beng made from the ‘inside’ of the ventral one.\n\n","date":"April 6, 2014 at 6:33 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97204","author":"Hugh Farey","site":"shroudstory"},{"title":"Am I the only one?","post":"I am not an expert in ancient textile; That’s true.\nRogers himself was not an expert in ancient textile.\nI never claimed that I am an Thank you Hugh.\nYannick wrote: “One thing’s for sure: I KNOW Thibault is NOT an expert in ancient textile and I KNOW he’s not an expert with everything that concern the chemistry of a scorched linen, so I don’t give too much credit to anything that come out of his writings regarding the Raes samples for example or the analysis of the scorch hypothesis proposed by Colin Berry, just like I don’t give too much credit to anything that come out of Fanti’s writings regarding the chemistry and microscopic aspects of the Shroud.”\n“expert in ancient textile”.\nIt seems that Yannick’s claim is based on my study of Raes 7.\nThe aim of this study was to look at cotton fibers in the sample.\nI found (like Rogers) much more cotton fibers mixed with flax fibers in the sample than expected.\nBecause I am am not an expert, I sent the samples to true textile experts. These experts confirmed that the cotton fibers I saw were truly (old not modern) cotton fibers.\nYannick knows that.  \nI am not an expert in the chemistry of scorched linen.\nMaybe.\nBut who is an expert?\nI can say what follows: I performed many experiments with different kinds of scorch.\nI looked at the results at fabric, thread and fiber level.\nI wrote the pdf paper. Colin criticized this paper.\nI am now writing another paper,based on new experiments, taking into account Colin’s critics.\nBeyond the scorch hypothesis,I think that this new paper will give some interesting questions about the TS body image.\n\n","date":"April 6, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97182","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Am I the only one?","post":"Beyond the scorch hypothesis,I think that this new paper will give some interesting questions about the TS body image.\nWe look forward to it.\n\n","date":"April 6, 2014 at 5:02 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97185","author":"O.K.","site":"shroudstory"},{"title":"Am I the only one?","post":"Return to the core of my first comment: All I said basically is that when researchers are stepping out of their field of expertise (Thibault Heimburger is just an example among a ton of examples), this open the door wide open for critics and, personally, I don’t give too much credit to their conclusions. \nAs I also said, Barrie Schwortz always told me that because the STURP team was composed of experts who all worked in their field of experise (for example, Adler did not tried to make textile analysis but only concentrate on the blood aspect, which is, to me, something Thibault should also do), their conclusions were very hard to attack and dismiss by the skeptics and that’s probably why there is so much respect today for their work.\nBasically, that’s all I wanted to say.  Now, if Thibault wants to keep on working on other aspects of the Shroud other than the biological and blood aspects for which he his an expert, so what?  That’s his freedom.  But he should at least know that, by acting like this, he contribute to hurt the credibility of Shroud science, at least in the eyes of the skeptics (and personally, I don’t think they are wrong by thinking like this).  Personally, if I was him, I would contact a chemist who would be also an expert in microscopy and ask him to analyse the work of Colin Berry and then, I would write a paper with this expert…\nPeople saw my comments on this page as a personal attack against Thibault.  This was not my goal.  I just size the opportunity to use a comment he made about a new paper he’s working on concerning Colin Berry’s scorch hypothesis as a good example of a major problem I have detected for years in sindonology (i.e. researchers that are constantly stepping out of their field of expertise instead of finding true experts to do the job for them).  \nQuestion: If Adler and Heller would have concentrated on analysing the image formation or the textile aspect of the Shroud instead of the blood question back in the STURP days, do you really think the conclusions of the team would have been so respected by so many people up until today?  I don’t think so…  This would have certainly open the door to all kind of critics.\n\n","date":"April 6, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97197","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"It’s funny to note that no people on this blog have dared to answer the very good question I asked in the comment just above this one!  This speaks loud to me…\n\n","date":"April 8, 2014 at 10:54 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97636","author":"Yannick Clément","site":"shroudstory"},{"title":"Am I the only one?","post":"You want a reply ?\nThis is my final reply about this question.\nFollowing your argument, Rogers who was not at all a textile expert, “contributed to hurt the credibility of Shroud science”. Remember that he based some of his most important papers on considerations about the characteristics of the Shroud as a textile.\nSome of them are true, some are disputable and some are false.\nAs an example of false claims, we know that the growth nodes are  in fact “dislocation bands” and that the dark spots at the “growth nodes” are very likely not lignin deposits (contrary to what Rogers wrote).\nThis has been shown by textile experts (SSG documents).\nDoes it mean that Rogers was wrong about anything he wrote. Certainly not.\nAnd you Yannick ?\nWhat is your field of expertise ?\nYou wrote so many posts about Wilson’s hypothesis without being an historian. So, again, you  “contributed to hurt the credibility of Shroud science” (following your argument).\nDoes it mean that your claims, based on the study of the documents are wrong ? Certainly not.\nYou wrote: “Now, if Thibault wants to keep on working on other aspects of the Shroud other than the biological and blood aspects for which he his an expert, so what? That’s his freedom. But he should at least know that, by acting like this, he contribute to hurt the credibility of Shroud science, at least in the eyes of the skeptics (and personally, I don’t think they are wrong by thinking like this)”\nPlease, give me a single comment from an “expert” showing where I am wrong in my (many) previous papers (about Raes 7, Garlaschelli’s experiments, McCrone vs Adler, the scorch hypothesis etc…).\nRegarding my field of expertise, I am not at all an expert in forensic science. I am not an expert in blood chemistry. However I have a 6 months old linen soaked with my own blood (already brown). I’ll look at it.\nBut since several years I have good microscope. I did look at as many textile samples as possible during dozen of hours.\nFor this reason, I consider that my previous as well as my forthcoming observations regarding the scorch hypothesis are reliable.\n\n","date":"April 8, 2014 at 4:12 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97684","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Am I the only one?","post":"Nobody has dared? You flatter yourself. There are many reasons why your question (actually you haven’t asked one, but I know what you mean) hasn’t been addressed to your satisfaction, but lack of courage is certainly not one of them. The findings of all the blood specialists, the highly questionable spectrum, the disagreement between the experts about whether the blood is fresh, dried, dried and remoistened, or in fact not blood at all but some kind of exudate, the bilirubin hypothesis, the iron oxide, mercuric oxide and madder root hypotheses; all these have been discussed in considerable detail on this blog.  If there has been little practical experimentation, then I suggest a shortage of a ready supply of blood constitutes the most important reason, not because we’re all scared of uncovering the truth.\n\n","date":"April 8, 2014 at 5:29 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97703","author":"Hugh Farey","site":"shroudstory"},{"title":"Am I the only one?","post":"O.K. the debate will go much beyond what we read here and we will have developments this year.\n\n","date":"April 6, 2014 at 6:45 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","id":"comment-97208","author":"Louis","site":"shroudstory"}]
