[{"title":"Hello Mr. Zias","post":"Various points. Firstly, like Yannick, I am not a great believer in all the extraneous clutter, from papyrus inscriptions to pieces of the titulus, ropes, nails, crowns of thorns or any of the flowers supposedly observed on the Shroud, and secondly, I know nothing about early Jewish burial rituals. However, I am also not a great fan of the appeal to authority simply because the authority is an authority. This approach leads to the “my expert is better than your expert” kind of bickering, and, although it seems to have passed Yannick by, he is not the first person to have consulted an “expert in ancient Jewish burial rituals.” There are undoubtedly several others of equally impeccable credentials who would disagree with some of his opinions.\nNo, an expert is useful not because “he is an expert,” but because of his ability to explain how he has come to his opinions, via his research. Yannick’s “Am I right?  –  Yes you are” conversation is unlikely to convince anybody who disagrees with him. If Yannick really wants his expert to sound convincing, he must words his questions to attempt to disprove his hypothesis. \nSo:\n1) Have any 1st century Jewish burials been found with flowers (or papyri, ropes, coins, etc) associated with them? In what circumstances?\n2) How good is our evidence for what exactly was the ‘prescribed ritual?’\n3) Were there particular rituals for people who were executed criminals, or had to be buried in a hurry? Is there evidence of exceptional procedure in such cases?\n4) Could the fact that Jesus was thought of as God have influenced his followers in diverting from the prescribed ritual?\n5) How closely were prescribed rituals followed anyway? How do we know?\nPerhaps, if Yannick reads this, he could put this sort of question to Joe Zias, whose answers would be far more interesting than those he gives above.\n\n","date":"September 29, 2014 at 5:39 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157622","author":"Hugh Farey","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"No Yannick! No!\nRemember, NEVER rely on an opinionion of a single archeologist -especially biased archeologist!\nRead this:\nhttp://en.wikipedia.org/wiki/Joe_Zias\nThe PBS documentary Secrets of the Dead: Shroud of Christ, which aired in April 2004, presented new and controversial claims that the Shroud of Turin was the authentic burial cloth of Jesus. Several experts disputed these opinions, since carbon-dating tests performed in 1988 placed its origin 1300 years too late. Specifically, Zias noted that the shroud depicts a man whose front measures 2 inches taller than his back and said, “Not only is it a forgery, but it’s a bad forgery.”\nAs Zias is completely biased on the subjecct (and completely ignorant on the topic of the Shroud of Turin, since the argument that ventral image is longer than dorsal is one of the most often raised by the sceptics, and one of the easiest to refute), it was obvious that he would say ‘No’ for every your question! \nThe FACT is, that when the matter is controversial and ideologically-sensitive, for every archeologist that says ‘Yes’ to the issue, you can find another that says ‘No’ (and vice versa).\n\n","date":"September 29, 2014 at 5:53 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157627","author":"O.K.","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Methinks Yannick is a naive.\n\n","date":"September 29, 2014 at 6:30 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157634","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"…or/and all prone to listen to what he wants to hear and reject what is contrary to his agenda (hasty burial, no flowers, no coins). Most funny his almost schizophrenic ‎suspension of critical thinking (his one and sole expert would now infallible).\n\n","date":"September 29, 2014 at 6:45 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157639","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Re “The signature of Giotto is much more visible than Jewish coins”:\nNicolotti’s so-called ‘demonstration’ is A BLATANT SOPHISM (an argument apparently correct in form but actually invalid). If we follow the thread of his pseudo-demonstration, the very face of the TS man should be not on the shroud either and should be nothing else but a pareidolia too since Christ faces can be seen in clouds, on pizzas, toated breads, at the bottom of sold frying pan… Methinks Andrea Nicolotti recurs to this time-worn argument just to deceive the gullible and reassure himself (as he just would hate the very idea of being wrong in what he thinks he doesn’t see on the TS). \nIn the past and still today, both pro-authenticists and anti-authentiicists were/are the victims of pareidolias whether negative (Nicolotti, Rinaldi, Lombatti etc) or positive (Whangher, Baima-Bollone, Fontanille etc). The issue is far more complex than Mr Nicolotti can think. Methinks the latter totally misses the initiated eye for the real thing/forms as far as GENUINE palaeography is concerned.\n\n","date":"September 30, 2014 at 3:53 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157896","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I agree with much of what Hugh and O.K. have to say on this matter. \nI do not believe it is possible to be dogmatic about aspects of the Shroud which are disputed.  Also I do not think it reasonable to argue that general principles will necessarily apply to every particular case.  \nAn underlying unstated assumption is the text of John 20:39-41: “39 Nicodemus, the one who had first come to him at night, also came bringing a mixture of myrrh and aloes weighing about one hundred pounds. 40 They took the body of Jesus and bound it with burial cloths along with the spices, according to the Jewish burial custom. 41 Now in the place where he had been crucified there was a garden, and in the garden a new tomb, in which no one had yet been buried.” \nFirst: “according to the Jewish burial custom”.  We do not know how literally this was followed, or if it is a gloss.  Were the customs followed to the letter, or just in a general way, or at all?  We do not really know.\nSecond: Spices of 100 Roman pounds is a large sack of potatoes, about 40 kg.  Obviously something was done with it.  My personal view is that it was likely packed along the side of the body, which may account for masking of the sides on the image, but that is only an opinion.  Some experts have asserted they have detected signs of myrrh and aloes on the cloth.  They may be right, or they may be wrong.\nThird:  The tomb was in a garden and it was springtime and flowers were abundant and at hand.  They are useful for discouraging flies and other insects from laying their maggots.  Flowers may have been placed on the body or not. \nI am no great believer in images of flowers on the cloth, nor of coins or potsherds over the eyes.  Some notable experts do so believe in such.  My personal views are that they may well be pareidolia.  On the other hand they may well be present. \nJesus was well-known for not setting much store in rigorously following man-made laws and customs, if there was good reason for not doing so.  E.g. “The sabbath was made for man, not man for the sabbath.”  Likely his followers may well have taken this lesson.  Others did not. \nDespite Yannick’s best intentions, I feel his communication with Joseph Zias adds little to our knowledge, and is no better than any other informed opinion, of which there are many.\n\n","date":"September 29, 2014 at 6:34 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157635","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"If I got time I’d email Dan two tables (Eidomatic Nusmismatic analysis based on bloodstain pattern analytical technique) with comments, showing eidomatic numismatic crucial evidence two Roman coins were placed over the TS man’s eyes.\n\n","date":"September 29, 2014 at 7:10 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157646","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"BTW Joe Zias is an anthropologist and paleopathologist not a first Temple period specialist.\n\n","date":"September 29, 2014 at 7:22 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157649","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: BTW Joe Zias is an anthropologist and paleopathologist not a Second Temple period specialist.\n\n","date":"September 29, 2014 at 7:24 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157651","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"…in terms of STP History and Burial rites and customs evolution.\n\n","date":"September 29, 2014 at 7:28 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157652","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"GMR, FIRST SEE MY two tables (not Whangher’s, Baima Bollone’s etc) showing Roman coins were placed over each eye defore passing negative comments. The most partial yet recognizable coin imprints are definitely there. \nBesides it does seem neither Zias, nor Yannick or youself are subtle enough to discriminate between Second Temple Period Judean common and\nSPORADIC practices. \nReminders for GMR: on March 4, 2014 at 10:08 am, I wrote:  \nReminder one: the koine Greek word aromaton (John 20) can also refer to flowers (used as insect repellent) not only spices (such as myrrh and aloe).\nReminder two: flowers were found in the sole Second Temple period crucifixion victim ossuary ever found in the Land of Israel.\nReminder three: Israeli botanist, Avinoam Danin found markings on the TS left by flowers from the Land of Israel (especially around the head and hands).\nReminder four: I myself detected 4 flower heads on Tamburelli’s 3D reconstruction of the TS man’s face.\n\n","date":"September 29, 2014 at 8:43 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157664","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"There is no need to consult an expert of ancient Jewish custom for realizing that there are no such images on the cloth. Simply look at the photos (even the same photos where Whanger, Danin or Baima Bollone see all those things). Do you see flowers or coins? No, simply because the images are not there, quite independently from Jewish funerary rituals.\n\n","date":"September 29, 2014 at 8:14 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157658","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"even the same photos where Whanger, Danin or Baima Bollone see all those things\nIf you have those photos, of such quality. Have you, Gian Marco?\n\n","date":"September 29, 2014 at 8:23 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157659","author":"O.K.","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"As to Baima Bollone, for the “simpulum” coin he has used the 1931 photo that all of us know. The two-dimensional “eidomatic” elaboration of Balossino is here at Fig. 14:\nhttp://www.cicap.org/new/articolo.php?id=273767\nIt is identical to the Enrie photo, only with a stronger contrast and a worse definition. There is also a three-dimensional elaboration that you can see here at the bottom of p. 36:\nhttp://www.cmc.milano.it/Archivio/2010/Approfondimenti/100301Sindone.pdf\nBaima Bollone can read six letters of the coin insciption: the first three (TIB) and the last three (LIS, where I have written S for the Greek “stigma”). Surely you can see them yourselve.\nA couple of years ago I assisted to a lecture of Baima Bollone in Lucca, Italy. One of his slides was the latter photo. At the end of the lecture I went near the screen and asked Baima Bollone to show the photo again. I asked him to point to the letters on the screen. He promptly with his finger pointed at three spots in succession and said: lambda, iota, stigma!\nI have a question for you, Oskar. Baima Bollone saw the three letters LIS on the low-right corner of the photo and in clockwise order. Do you think that the letters (if they existed) should be in that position or elsewhere? And are they in clockwise or counter-clockwise order? Are they specular or not (I mean those letters that are not themselves symmetric)? These questions are relevant because Baima Bollone has sometimes published such photos in different configurations, for example with right/left or top/bottom inversions (I leave it to you to ascertain the configuration of this particular photo). One should consider that Baima Bollone asserts that the coins were put in straight-up position with a vertical axis and that the images on the cloth are imprints, that is they should be specular.\nAs to the flowers of Whanger and Danin, they have published their photos several times. If you think that they have seen the flowers in other photos, not those they have published, you have to ask them, not me, to unveil them.\n\n","date":"September 29, 2014 at 1:01 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157721","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I just remarked that one should use scientific quality photos, not those bad-quality jpegs,which are many in the Internet, and you start your tirade, Gian Marco.\nThe fact that you cannot see what others see, does not mean those items cannot be present there. We cannot say that coins and flowers were not used in ancient Jewish burial customs, simply because Gian Marco Rinaldi cannot see them on the photos of the Shroud of Turin. It is simply another example of sceptics’ usual flawed logic.\n\n","date":"September 29, 2014 at 1:32 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157728","author":"O.K.","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Oskar, can YOU see the flowers and coins, whether in scientific quality or bad-quality photos? And please note that the proponents themselves use bad-quality photos. I have indicated the very same photos that were used by Bauma Bollone. He sees the letters of the inscriptions on them. If you see them you can answer my question in my previous comment. If you don’t see them, you cannot say that it is only I who do not see.\n\n","date":"September 29, 2014 at 2:18 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157739","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"(sorry my comment appears having been deplaced): GMR, FIRST SEE MY two tables (not Whangher’s, Baima Bollone’s etc) showing Roman coins were placed over each eye defore passing negative comments. The most partial yet recognizable coin imprints are definitely there. \nBesides it does seem neither Zias, nor Yannick or youself are subtle enough to discriminate between Second Temple Period Judean common and\nSPORADIC practices. \nReminders for GMR: on March 4, 2014 at 10:08 am, I wrote: \nReminder one: the koine Greek word aromaton (John 20) can also refer to flowers (used as insect repellent) not only spices (such as myrrh and aloe).\nReminder two: flowers were found in the sole Second Temple period crucifixion victim ossuary ever found in the Land of Israel.\nReminder three: Israeli botanist, Avinoam Danin found markings on the TS left by flowers from the Land of Israel (especially around the head and hands).\nReminder four: I myself detected 4 flower heads on Tamburelli’s 3D reconstruction of the TS man’s face.\n\n","date":"September 29, 2014 at 8:45 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157665","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder five: one American professional numismatist and two scholar numismatists and Jewish ancient coin experts did identify the partial imprint of a Pilate coin (dilepton lituus type) on the TS man’s right eye. Is GMR a Jewish ancient coin expert?\n\n","date":"September 29, 2014 at 9:09 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157669","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Yannick I appreciate the time and thought you put into this article. However I also agree with Hugh and OK that your methodology was flawed. You relied on only one expert to come to a very dogmatic conclusion and an expert that is a bit biased in his opinion (the Monty Python reference was a give-away).\nSecondly you were ‘begging the question’ with your emails to Mr Zias. A scientific methodology requires strictly objective questions. Forming a question such as: “I think Theory A is silly, I’m sure you, being an expert, will concur, right?”, is not objective.\nYour article still has some good insights but they remain inconclusive — like so much of Shroudology. Keep on investigating!\n\n","date":"September 29, 2014 at 9:46 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157675","author":"David Goulet","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder six for GMR: Regardless of 2008 HAL9000’s HD digital photograph that should allow researchers to analyze the Shroud in unprecedented detail, Enrie’s digitized authentic reversed negatives and positives are still the best candidates available so far (along with digitized 1978 Miller’s authentic silver black & white + 2002 Durante’s authentic digital photograph of the Shroud face as double or triple check) for detecting and studying any possible 3D encoded (bloodstained) coin tiny patterns embedded in the suspected image areas.\n\n","date":"September 29, 2014 at 9:47 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157676","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder seven for Gian Marco Rinaldi: \nNaturalistic or stylized flowers(known as “rosettes”)are currently carved out in stone in Second Temple period ossuaries, sarcophagi and memorial tomb facades. Don’t you think it would be high time one should tell Professsor Joe Zias and his pseudo-independent thinking student Yannick Clément too about flowers found in the sole Second Temple period crucifixion victim ossuary ever found in the Land of Israel?\n\n","date":"September 29, 2014 at 11:28 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157707","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder eight for GMR: In Judean culture flowers were the symbol of ephemerality of life of the present duration or passing glory of the world as opposed to eternity of life/eternal glory of the duration to come.\n\n","date":"September 29, 2014 at 11:41 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157709","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Yannick Clément,\nplease ask Mr. Zias (who as an expert in the crucifixion in antiquity can not fail to know) where we can read this:\n“In two cases — I/ 1 and III/2 — the presence of a salty liquid at the top of the ossuary had preserved bunches of withered flowers (in the first case) or plaited bundles of cereal spikes (in the second case). In I/1, two skulls (male and female) ) and the long bones were found at the top of the ossuary, with the flowers.”\n\n","date":"September 29, 2014 at 12:23 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157716","author":"domenico","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Posted on behalf of Yannick who cannot comment on this site:\nI’ve read your interesting comment following my guest post and I decided to go ahead and ask Mr. Zias about the particular quote you gave us.\nHere’s what he just told me via email: « He (Domenico) probably got it from Haas and what he (Haas) mistook for flowers were probably remnants of decayed roots from plants/ trees which had infiltrated from above the tomb. Even today when Jews place flowers on graves here in Jerusalem, the burial society removes them when the mourners have left. »\nThen, I sent this email to Mr. Zias: « Thanks for your fast answer…  So, to complete your thought on this topic, would you say that there is no solid archaeological (and historical as well) indications that the Jews of the first century were using flowers and/or plants during the enshrouding procedure of the body and that there is no more solid indications that they were using these botanical species when they were placing the bones of their deads in ossuaries? I just want to be certain that I understand you correctly… »\nHis reply was short but confirmed that I understood him correctly. He said: « This is correct. »\nFinally, I sent him one last message: « So, since no flowers or plants were used in ancient Jewish burials, we can say that today’s Orthodox Jews have been able to keep this ancient tradition up until today, right? I say this because it is a fact that in today’s Orthodox Jewish burials, no botanical species are used. »\nAnd here’s what he told me (which confort even more my impression that, inside the Shroud, there was only the Shroud man’s body and nothing else): « Correct.  In Jerusalem today, it’s much as it was back then : no casket, no embalming, body is washed, wrapped in the shroud, covered, carried on a stretcher and buried. Psychologically i think its healthier, no illusion that one went to sleep as is the case in the US. In fact, here burial costs are picked up by the state whereas in the US costs thousands of dollars to be buried as on co. bought most of the cemeteries in the US, its thus a monopoly on the burial game. »  \nAnd here’s one last note concerning the washing procedure : Despite what Mr. Zias just told me concerning the usual washing of the corpse prior to be placed inside a burial shroud, I still believe, like Barbet and other specialists, that in the particular case of the Shroud, the man’s body was still unwashed when he was placed inside the cloth, mainly because of the kind of blood and serum stains we see on the cloth (which came from moistened blood clots and not from liquid blood) and also because of the few traces of dirt that were found in specific areas of the body image…\n\n","date":"October 1, 2014 at 6:01 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158299","author":"Dan","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I give a more complete quote:\n“In two cases — I/ 1 and III/2 — the presence of a salty liquid at the top of the ossuary had preserved bunches of withered flowers (in the first case) or plaited bundles of cereal spikes (in the second case). In I/1, two skulls (male and female ) and the long bones were found at the top of the ossuary, with the flowers.The long bones belonging to the two individuals where fastened togheter with a plaited bundle of plant stems. This ossuary was labelled: ‘Simon, builder of the Temple’.  In the second case (III/2) … a number of carbonized seeds (barley = hordeum perlatum) were found among the bones).”\nAs we can read Haas is very accurate non only in the identification of the seeds but in to specify why only  these ossuaries had preserved the flowers, the plants and the seeds.\nMr. Zias, if you do not mind, I can not think that Haas was unable to recognize a flower from a root (he specifies that it was all ‘well preserved’)  and to recognize the presence of infiltrating roots in stone ossuaries (there were visible cracks in the case of infiltration). I can not think about infiltrating roots that could wrap only the long bones but not the skulls which where at the top of the ossuary too and in any case the bundles of cereal  spikes and the carbonized seeds of barley did not arrive there by infiltration.\n\n","date":"October 2, 2014 at 5:25 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158560","author":"domenico","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Posted on behalf of Yannick:\n“Hi again Mr. Zias!\nIn a study done by Dina Teitelbaum concerning the practice of ossuary burials (link : http://www.collectionscanada.gc.ca/obj/s4/f2/dsk2/ftp04/mq22102.pdf), she mention the finding of Haas:\n« Dried herbs were sprinkled afterwards on top of the collected bones. Apparently, people used different spices and ointrnents, for example myrrh and aloes. (note : Bunches of withered flowers were found in ossuaries among bones – Haas, “Giv’atha-Mivtarw, 38-40. Spices and embalment rnay have been an act of deference to the deceased, and for improving the srnell; see Zlotnick, Mourninq, 16 1 n.9). »  \nThen, she wrote :\n« The next citation leads to the conjecture that eventually only dried herbs were permitted: “The bones may be sprinkied with wine and oil.” So Rabbi Akiva. Rabbi Simeon ben Nannas says: “Oil, but not wine, because wine evaporates.” “Neither wine nor oil”, Say the Sages, “because these only invite Worms, but dried herbs may be put on them.” Sem 12.9\nFollowing this interesting part of Mrs. Teitelbaum’s paper, I have some good questions for you :\n1- Is it possible that the so-called flowers and wheat found by Haas were truly what he thought but that it was a very exceptional practice that was only confirm for this specific case?  Note : The same good question can truly be asked in the case of the nailing of Jehohanan  through the heel bone!\n2- Sub-questions : In how many ossuaries did Haas found out these botanical species?  Beside the tomb where Haas made his finding, are you aware if there were any other botanical discoveries like that in other ancient tombs or ossuaries?\n3- Concerning the Jewish quote given my Mrs. Teitelbaum, which indicates that only dried herbs could be sprinkled over the bones, is it possible that, in most cases, this had nothing to do with flowers or wheat, but concerned some particular species of dried herbs (maybe spices more than anything) usually used for burials?”\nAnd here’s what he wrote to me: « Shalom, some of this requires me going to a library and remember I left the IAA in 97, due to religious folks changing the laws. \nAs for question one and two, one has to read the entire Haas article in IEj to see why he is almost never quoted. As for three, there is often quite a difference in what is perceived and what is written in a biblical sense. In ossuaries, we find stones, animal bones, in fact, in one ossuary we found remains of 8 individuals. It was done in a dark cave and whatever wasn’t moving got put in. There is some evidence in but a few ossuaries that some liquid was poured over the bones, but no one ever tried to find which. » \nAfter this, I sent him this new email: « Then I must understand that what Haas took for flowers and cereals was surely something else, probably what you say to me (remains of roots or plants that were growing near the tomb).  Nevertheless, I have to say that some people to whom I talked about this particular hypothesis of yours have remained skeptical about that… » \nAnd here’s the short reply I received from Mr. Zias: « These skeptics have never cleared nor seen an ossuary in-situ… »\n\n","date":"October 5, 2014 at 6:50 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159471","author":"Dan","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"on behalf of Mr. Zias:\n1) Kokhim/loculi and burial chambers were carved into the rock. To write about “decayed roots from plants/ trees which had infiltrated from above the tomb” does not make sense as there are no infiltrated roots in those chambers. It suffices to search google image for ‘Kokhim’ to realize that it is impossible any infiltration of roots ‘from above the tomb’.\n2) Vassilios Tzaferis confirms in his report published on  BAR that “One ossuary also held a bouquet of withered flowers.” Was he mistaken too?\n\n","date":"October 6, 2014 at 4:33 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159752","author":"domenico","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Zias: “There is some evidence in but a few ossuaries that some liquid was poured over the bones, but no one ever tried to find which.”\nFew ossuaries. Really? Let’s read Haas’ article.\n“Fifteen limestone ossuaries were found… In the 13 completely filled ossuaries, considerable moisture was found, bringing about a peculiar kind of preservation of the packed bones… A syrupy fluid was found filling the lower third  of 13 ossuaries. The bones and other material immersed in this fluid were coated with a limy sediment. On the surface of some bones dark-brown blotches were occasionally observed, or even a thick, adherent black-brown crust.”\nDo you really call 13 of 15 ‘few’?\np.s. in my previous comment I quoted Tzaferis’ article on BAR. It is on line:\nhttp://www.biblicalarchaeology.org/daily/biblical-topics/crucifixion/a-tomb-in-jerusalem-reveals-the-history-of-crucifixion-and-roman-crucifixion-methods/\n\n","date":"October 9, 2014 at 5:50 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160611","author":"domenico","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Was Joe Zias attending the second burial in situ too? Did he see  all the 124 coins falling out from Second Temple period buriers’ ‘pockets’ in situ too and did he specifically see the 55 coins falling from the pockets of Jason tomb’s buriers too? Is Joe Zias a reliable archaeobotanist too?\n\n","date":"October 9, 2014 at 7:40 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160645","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Hi Domenico, it may be unjust to judge Joe Zias in this case. See my comment below (October 1, 2014 at 8:02 am). We have his reply at third hand, and no information about what he was actually asked. I do not believe he can be ignorant of the Giv’at ha-Mivtar excavations, and suggest it may have been the wording of the question which led him into his apparently fairly nonsensical answer.\n\n","date":"October 2, 2014 at 6:54 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158578","author":"Hugh Farey","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Oskar, can YOU see the flowers and coins, whether in scientific quality or bad-quality photos? And please note that the proponents themselves use bad-quality photos. I have indicated the very same photos that were used by Bauma Bollone. He sees the letters of the inscriptions on them. If you see them you can answer my question in my previous comment. If you don’t see them, you cannot say that it is only I who do not see.\nWith regards of coins I can say to you, I see them. And at the same time I can’t see them. Because actually the matter is not about seeing or not seeing things, but about interpretation of what is seen. But it seems that understanding this is beyond comprehension of most people especially sceptics.\nI don’t have opinion about flowers yet. \nAnd it doesn’t matter whether you are the only one who doesn’t see, or some other too. As I wrote, we cannot say that coins and flowers were not used in ancient Jewish burial customs, simply because Gian Marco Rinaldi (and others) cannot see them on the photos of the Shroud of Turin. Neither opposite conlusion, because some people claim they see.\nI’ll explain this later in some presentation.\n\n","date":"September 29, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157745","author":"O.K.","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"SEEING is TO RECOGNIZE. \nIT is not possible TO SEE therefore that one that before does not know itself. \nTo see, as example, in a X-ray photography or in a tomography it needs the previous knowledge of how it is that one that has that it turns. \nCarlos\n\n","date":"September 29, 2014 at 3:29 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157755","author":"Carlos","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"The foregoing debate, particularly between the opposing views of MPH and GMR, merely underscores the point I made previously, that it is impossible to be dogmatic about such matters.  The flowers may be there or not. The coins may be there or not.  Much depends on whether perceptions are real or pareidolia.  Furthermore a generally prescriptive rite or prohibition, does not necessarily imply that either was followed in any particular situation, even under the strict conditions prevailing in first century Judaism, especially when related to the teachings of Jesus of Nazareth which often seem somewhat dismissive of ritualised man-made prohibitions.\n\n","date":"September 29, 2014 at 3:32 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157757","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I think Hugh pointed this out before to MPH, but it’s worth repeating. We know pareidolia exists and we also know that sometimes an untrained eye can miss an object that is actually in plain view (the infamous ‘can you find the cat in this picture’ exercise). But with those latter cases once someone shows me the cat (circles it on the picture) I too can see it and will find it on my own the next time. There is that moment of “oh, you’re right, I see it now too.”\nThis does not seem to happen as much with the claimed objects on the Shroud. Those who claim to see objects are unable to point them out in a fashion that others can also then see them. Even if I believed the objects are pareidolia I should still be able to recognize them as objects – once my eye is guided to them. I cannot conclude decisively that these objects do not exist there, but if they do they appear to have visual characteristics unique to this icon.\n\n","date":"September 29, 2014 at 3:51 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157761","author":"David Goulet","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David, rest reassure. In my unpublished 2011 Torun paper “final version One” (as I am still waiting to double and triple check my finding from authentic copies of 1978 Miller traditional silver B&W and 2002 Durante digital TS face photographs), I have done better than just ‘circle’ the incomplete yet recognizable Pilate coin inscriptions and central devices from the TS face: digitally I was able to most accurately reconstruct the two small coin obverse types from tiny bloodstain patterns on the eye areas (on right eyelid + astraddle on left lower eyelid and zygomatic ridge).\n\n","date":"September 30, 2014 at 5:33 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157920","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"This discussion has prompted me to have another look. I see no coins, and although I do see a flower shape (the most famous one, upwards and outwards from the brow, epsilon side), I do not recognise it as a chrysanthemum. To me, its petals are very round, with rounded outer edges, like a ranunculus, quite unlike the longer more daisy-like petals of the Chrysanthemum coronarium as identified by Oswald Schewermann and confirmed by several others. (Needless to say that neither Chrysanthemum nor Ranunculus pollen has been found…).\nNow what I want from an expert is for him to explain to me why this flower looks like a chrysanthemum to him, when it so clearly doesn’t to me. It is frequently published alongside actual chysanthemums and coronal discharge photos of chrysanthemums, and they don’t look the same.\nI mention this because it follows on rather neatly from my earlier comment, which could have been sub-titled “What’s the point of an expert?” It is not enough to retort “Well, I’m an expert and you know nothing of Israeli botany,” you have to explain what you see and I don’t, and why, for your expertise to have any value in this case.\nMy own opinion is that this flower image does not exist at all as such and is an artifact of the weave and the photo, but the point remains valid.\n\n","date":"September 29, 2014 at 3:48 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157760","author":"Hugh Farey","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"The signature of Giotto is much more visible than Jewish coins.\nhttp://www.nannimagazine.it/_resources/_documents/Uploaded-Files/File/sacrasindone%281%29.pdf\n\n","date":"September 29, 2014 at 3:52 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157762","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"A good example of how capricious this whole exercise is. One can find just about anything in that linen.\n\n","date":"September 29, 2014 at 4:24 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157768","author":"David Goulet","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Capricious? You do not see “Giotto”?\n\n","date":"September 29, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157771","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I see it, how couldn’t you with the enhancements done on the image. You don’t actually think the name is there though I hope?\n\n","date":"September 29, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157773","author":"David Goulet","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder for Nicolotti: Although the TS imprint/image is that of a real bloodied body, it “does behave” like an oversized Rorschach hence the optical illusions (see e.g. the  medieval “avisions and semblances” of the Holy Grail in Arthurian literature).\n\n","date":"September 30, 2014 at 8:41 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157979","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"On December 30, 2011 at 9:39 pm | #31,\nI already wrote: ” (…) you can see the avison and semblance of the Grail Chalice of Christ Blood… right in the Shroud bust positive image vertical axis seen UPSIDE DOWN. This is just one of the “archaeopareidoliac vestures” that can take up the TS. The likeness is not unlike a primary vision as the Shroud image does “behave” like an oversized Rorschach.”\n\n","date":"September 30, 2014 at 8:59 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157981","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"You remember Piero Ugolotti, the father of the inscriptions on the Shroud? People do not know that he saw also the decrees of condemnation issued by Pontius Pilate nailed on the face of Christ. And the nails would have been stuck in the eyes, causing the leakage of aqueous humor.\n\n","date":"September 29, 2014 at 6:58 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157790","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Any so-called decrees on the face of Christ cannot be interpreted as the titulus damnationis.  All four gospels mention the inscription.  Matthew says it was ‘over his head’, Luke says it was ‘above him’, John says it ‘was on the cross’.  All this seems to have been the normal crucifixion practice.  None of the writers refer to any decree nailed to the face of Christ through the eyes, and John’s gospel has him “looking at his mother and the disciple whom he loved”.  Any such decree would surely have been removed by the burial party, so that it is unlikely that such would be imaged anyway.  I conclude that  any such decrees appearing are the result of an over-active imagination.\n\n","date":"September 30, 2014 at 12:23 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157855","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Just in case you could miss it (comment displaced) \nRe “The signature of Giotto is much more visible than Jewish coins”:\nNicolotti’s so-called ‘demonstration’ is A BLATANT SOPHISM (an argument apparently correct in form but actually invalid). If we follow the thread of his pseudo-demonstration, the very face of the TS man should be not on the shroud either and should be nothing else but a pareidolia too since Christ faces can be seen in clouds, on pizzas, toated breads, at the bottom of old frying pans… Methinks Andrea Nicolotti recurs to this time-worn argument just to deceive the gullible and reassure himself (as he just would hate the very idea of being wrong in what he thinks he doesn’t see on the TS). \nIn the past and still today, both pro-authenticists and anti-authentiicists were/are the victims of pareidolias whether negative (Nicolotti, Rinaldi, Lombatti etc) or positive (Whangher, Baima-Bollone, Fontanille etc). The issue is far more complex than Mr Nicolotti or Rinaldi can think. Methinks the latter totally miss the initiated eye for the real thing/forms as far as GENUINE palaeography is concerned.\n\n","date":"September 30, 2014 at 3:57 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157897","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder for Nicolotti: Piero Ugolotti (his fellow compatriot NTW) was a pharmacist. He was neither a palaeographer nor an epigraphist or a ghostly/incomplete image/inscription analyst or cryptanalyst! Don’t you mix apples with oranges.\n\n","date":"September 30, 2014 at 4:35 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157905","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Ugolotti asked Father Aldo Marastoni, a philologist and renowned Latinist to validate his finding just as far as the presence of Latin & Greek ghost writing were concerned. Marastoni did confirm it.\n\n","date":"September 30, 2014 at 6:03 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157934","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Re the coin-on-eyes issue, on June 21, 2013 at 12:20 pm re “the placing of coins over the eyes is myth”. \nThe true fact is placing coins over the deceased’s eyes as a Second Temple period/1st century CE CURRENT/DAILY PRACTICE is myth. However, the numismatic archaeological finds in Second Temple tombs just cannot TOTALLY RULED OUT a MOST SPORADIC PRACTICE of placing either a coin between the teeth/on the tongue OR over each eyes. \n1/Is it “impossible” for coins to fall down into the mouth of an undamaged skull? \nSo far as the archaeological record is concerned, only four small bronze coins (or prutot in Hebrew, dilepta in Greek) were retrieved inside three different skulls (one damaged, two undamaged) excavated from Judean tombs of the Second Temple period. Because all the coins were found in the oral cavity, those inside the two intact skulls were explained as coins “unequivocally” placed in the mouth and very rare manifestations of a pagan influence on Judean burial customs associated with Charon’s obol (or payment required by the ferryman Charon to reach the mythical underworld).\nNow it has been demonstrated experimentally a prutah or dilepton type coin (i.e. a thin small coin), placed over the eye of a deceased lying in a supine position with his head held upright (as if on a headstone or head-rest) or tilted forward (as if on a pillow), by a “piggybank effect” may drop through the lower fissure in the back of the eye socket and fall into the mouth, as the body decays. It may also happen with a coin placed over both eyes.\nAlthough arch-sceptics dismiss the coin-on-eye theory in connection with these finds, at close examination, in the context of a Judean burial of the Second Temple period, the Charon’s obol theory is a most unconvincing explanation as it creates more questions than answers and has a potential to mislead. For instance, in the Jericho D/18 tomb case, why exactly a Judean burier or mourner would have felt the need to place two coins instead of only one in the deceased’s mouth as Charon’s obol? Would the two coins have been intended for a return trip? In the Caiaphas’ daughter’s intact skull case, why exactly would a high priest family of Jerusalem have felt the need to recur to the pagan custom to bury one of its deceased members? It actually verges on sheer anachronism. Therefore, it would be good archaeology to integrate the forensic datum to reassess past findings and keep an open mind for the coin-on-eye issue in connection with the Turin Shroud. \nReminder 1: Several 1st c. CE tombs (4-9) yielded more than 30 (30-40) Pilate coins throughout the Land of Israel.\nReminder 2: An erroneous numismatic theory crept into Shroud literature. According to the Italian coin collector, Mario Moroni following Hendin, the Judeans considered it offensive to their religion to be forced to use coins depicting pagan symbols such as a simpulum and a lituus. This is far from a proven theory though currently accepted as such.\nSporadic placings of a small coin over each eye to be found in the deceased’s mouth as  the body decays is NOT inconsistent AT ALL with anatomothanathology, halakha (religious Judean/Jewish law) and Second Temple period archaeological finds. To claim to the contrary is BAD archaeology. How shall I have to DEpoison the well?\n\n","date":"September 30, 2014 at 7:39 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157964","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: How LONG shall I have to DEpoison the well?\n\n","date":"September 30, 2014 at 7:39 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157965","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"«If we follow the thread of his pseudo-demonstration, the very face of the TS man should be not on the shroud either and should be nothing else but a pareidolia»….. I do not comment this statement because is clearly nonsensical. And the negative pareidolia does not exist.\nIn fact, the discussion on this topic is useless, and my intervention is also useless. I am convinced that I am not able to discuss with people who see flowers, coins, and other things on the shroud, and also with those who see the Shroud in the code Pray. It seems pointless to me to discuss what I consider the evidence. Simply, my brain works differently and so there is no chance that I can discuss on this topic. I have to shut up.\nP.S. Ugolotti showed to Marastoni his manipulated photographs, and Marastoni tried to read. Then Messina has manipulated other photographs and tried to read Hebrew words; showed them to father Orecchia, and also Orecchia tried to read them (but today he has changed idea about it….) Then Marion did the same. Then Frale did the same. Then Castex and Ventutini. Then arrived Giotto. Then Leonardo da Vinci (but sindonologists don’t like this kind of inscriptions, they see only Hebrew, Latin, flowers and coins from Jerusalem). If you want, I can read letters too. I also read the clouds, but I do not think that what I read is real. My mother saw many other things on the shroud, she is very imaginative.\nYou do not need a palaeographer, because a palaeographer reads what is visible, and no one doubts that there are letters on his manuscripts. You do not need a palaeographer to read the “letters” on the Shroud, because they are so easy to “read” by anyone who knows the Latin alphabet. The palaeographer is expert in reading unintelligible handwriting, not in seeing what is not visible. I read manuscripts, but I see the letters exactly how all people see the same letters : the only difference is that I am able to understand those graphic signs, when normal people does not understand them. They see them, but they not understand them. I do not know Arabic, but I see the Arabic letters on a book. “To decipher” and “to see” is not the same thing.\n\n","date":"September 30, 2014 at 8:56 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157980","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"AN: I am convinced that I am not able to discuss with people who see flowers, coins, and other things on the shroud, and also with those who see the Shroud in the code Pray. It seems pointless to me to discuss what I consider the evidence. Simply, my brain works differently and so there is no chance that I can discuss on this topic. I have to shut up.\nSo why not to give up the Shroud matter, if that’s the situation, in your opinion?\nP.S. No sceptic has been able to undermine reasoning I presented here https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/ about Pray Codex -including you (I am certain you read this).\n\n","date":"September 30, 2014 at 9:57 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157997","author":"O.K.","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"AN wrote: “negative pareidolia does not exist”. Oh really? \nI once wrote: “Falsely positive unexpected images may appear in some object at times. The optical illusion\nor misperception is called pareidolia (a term derived from Ancient Greek para, “amiss,\nwrong” + eidōlon, “image”) to describe a tendency to interpret vague stimuli as something\nfamiliar.” What would you call a falsely NEGATIVE image (“I think I don’t see”). Allow me to call it a negative pareidolia. “Falsely negative perception” is still a perceptive fact (in terms of an unability to percceive what is really there). \nYou wrote: “I am convinced that I am not able to discuss with people who see flowers, coins, and other things on the shroud, and also with those who see the Shroud in the code Pray. It seems pointless to me to discuss what I consider the evidence”. Shall I replace “evidence” by “obvious”?\nMethinks there are none so blind as those who will not see.\nI won’t bet much either on your true ability to decipher.\n\n","date":"September 30, 2014 at 9:22 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157988","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"AN also wrote: “Simply, my brain works differently and so there is no chance that I can discuss on this topic.” He cannot discuss and yet keeps commenting… BTW I don’t see “coins” or “flowers” either on the TS face. I see markings (whether whole or incomplete) left by coin obverses and flower heads.\n\n","date":"September 30, 2014 at 9:45 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157994","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"“He cannot discuss and yet keeps commenting”. Yes, you are right. But I have just finished now. I was not able to remain in silence, only because sometimes the argument seems to me very fun and I cannot resist…\n\n","date":"September 30, 2014 at 10:08 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-157999","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I was not able to remain in silence, only because sometimes the argument seems to me very fun and I cannot resist…\nGo to the specialist.\n\n","date":"September 30, 2014 at 10:11 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158000","author":"O.K.","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"“I was not able to remain in silence, only because sometimes the argument seems to me very fun and I cannot resist…”","date":"September 30, 2014 at 10:35 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158004","author":"Colin Berry","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Thanks Colin.  Stevie’s words put everything in their proper perspective.  Nice to see the human face of Colin.\n\n","date":"October 1, 2014 at 1:18 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158245","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"“Nice to see the human face of Colin”\nAffirmative Dave, I read you.","date":"October 1, 2014 at 9:16 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158331","author":"Colin Berry","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Posted on behalf of Yannick who cannot comment on this site:\nAfter having read a few comments in link with my guest post, I would like to ask 2 questions to those who still wants to see flowers and coins images on the Shroud :\n1-      If the Shroud is authentic like you obviously believe, then how in the world those who did the burial (which would have been all first century Jews obviously) would have lose time picking flowers outside the tomb, while this kind of action was not at all common in their culture when it comes to burying their dead (even if there could have been some exceptions in history, the fact remains that flowers were not part of a normal Jewish burial at that time and even today) and also while they were in a hurry because of the coming of the Sabbath?\n2-      Why those who did the burial would have lose time placing coins or any other material thing to cover the eyes of the Shroud man, while the whole shroud itself was covering all his body, including his eyes?  Sub-question: If the purpose of placing these things over the eyes was just to make sure they would not open, then again, I ask the question: why doing this while the whole shroud itself was covering all his body, including his eyes?  Another sub-question, just in case some people think these coins would have been part of a burial ritual: Taking into account the historical fact that coins were placed inside the mouth during Pagan burial rituals, why in the world these Jews would have placed coins over the eyes of the Shroud man instead of in his mouth if they really wanted to perform such a Pagan ritual? \nI can’t wait to see someone giving me a RATIONAL answer for all these good questions…\n\n","date":"October 1, 2014 at 6:04 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158300","author":"Dan","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I’m sorry that I don’t think Yannick’s latest contributions add anything to his previous ones. I can’t believe Joe Zias is unfamiliar with the excavations at Giv’at ha-Mivtar, so I wonder if it was the form of Yannick’s question that enabled him to suggest that the well-preserved bunches of flowers and twisted plaits of straw found in some of the ossuaries were mistaken identifications of “remnants of decayed roots from plants/ trees which had infiltrated from above.”\nFurthermore, Yannick is trying to have his cake and eat it. Having begged Zias to confirm that the Jews were sticklers for ritual observation (no coins, no flowers), he is nevertheless happy to believe that it was bypassed in the case of the washing of the body (no washing), simply in order to account for some of the alleged blood flows. I don’t think appealing to ‘experts’ in one case, and ignoring them in another, gives credence to his hypothesis.\nFinally, Yannick wants a rational answer to two questions – why coins? and why flowers? Various people, particularly Max, have given sensible replies to these. The hurried burial, the intention to return to complete the ritual, the social variety of Jesus’s followers, the belief that he was the son of God, the company of women, the necessity of weighing down the eyelids, even the Roman guards could all have had something to do with it.\nBut that’s not really important. You can’t make something disappear by asking why it should be there in the first place!\nIt seems that, unusually, we have an authority on Jewish archaeology taking an interest in the Shroud. It would be a pity to waste this opportunity to explore his accumulated experience and knowledge by asking simplistic yes/no questions, rather than trying for a more nuanced opinion.\n\n","date":"October 1, 2014 at 8:02 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158319","author":"Hugh Farey","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Nicolotti wrote: “He (Nicolotti) cannot discuss and yet keeps commenting”. Yes, you are right. But I have just finished now. I was not able to remain in silence, only because sometimes the argument seems to me very fun and I cannot resist…” \nWhat’s is REALLY FUNNY is you telling me “negative pareidolia does not exist” and being in absolute denial of this simple perceptive fact: as an observer one can be NOT only the victim of unexpected positive images (positive pareidoliae in terms of ‘I think I see what is not really there’) BUT ALSO unexpected negative images (negative pareidoliae in terms of ‘I think I don’t see what is really there hidden in full view (accidentally embedded in background noise) or deliberatedly camouflaged’). \nMethinks what is really funny having you think you are absolutely right when you are absolutely wrong. You can be wrong in your opinion not in your facts.\n\n","date":"October 1, 2014 at 1:08 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158363","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: What’s is REALLY FUNNY is you telling me “negative pareidolia does not exist” and being in absolute denial of this simple perceptive fact: as an observer one can be NOT only the victim of unexpected FALSELY positive images (positive pareidoliae in terms of ‘I think I see what is not really there’) BUT ALSO unexpected FALSELY negative images (negative pareidoliae in terms of ‘I think I don’t see what is really there hidden in full view (accidentally embedded in background noise) or deliberatedly camouflaged’).\n\n","date":"October 1, 2014 at 1:26 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158368","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Methinks Nicolotti should do some homework before passing comments.\n\n","date":"October 1, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158370","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Most curiously, in ‘the pareidolia phenomenon that has been described’ in two papers by Di Lazzaro, Murra and later Schwortz, unexpected FALSELY negative images (or negative pareidoliae in terms of ‘I think I don’t see what is really there hidden in full view (accidentally embedded in background noise or deliberatedly camouflaged’) WAS TOTALLY OVERLOOKED as if people could be only the victims of positive pareidoliae not negative ones! This paper is most partial and as such unscientific.\n\n","date":"October 1, 2014 at 1:48 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158374","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"How long is Yannick to be unable to discriminate between common and sporadic funerary pratices in conjunction with time (Second Temple period), religious trends (Hellenised Pharisees, Sadducees, Essenes and Zealots)and space (Judeans coming from all over the known world then)implying funerary pratice variants prior to 50 c. CE? In 2005, I discovered (it is a long story), Joseph of Aramathea/Yossef Ha-Ramathaim and Joseph Barnabas/Yossef Bar Naba are one and the same man. The latter like John-Mark/YoHanan Maqqaba/Lazarus/El’eazar was from Cryptos Island (= Cyprus).Nicodemus/Beni Naqdimon/Naqi ben Gwryon most likely was from Cyprus too. Whatever the case, he was a Hellenistic Judean (see The Talmwd Babli). Most likely, at least two of them were liberal Pharisees (from Sadducean background?)I also attempted to identify Yeshua’s 3-4 other buriers. In conjunction with Nicodemus/Naqdimon/Naqi I did find 3-4 other names among which that of Matthias/Mattayah, the substitute for Judas Iscarioth/Yehwdah Ish-Karioth. They were Yeshua’s Hellenistic Judean secret disciples who buried him not his Galilean diciples. In 2005 I also found John-Mark was High Priest Hanan’s assitant scribe and son, hence a Hellenistic Judean too (from Cyprus too?).\nReminder 1 for Yannick:\n“What is most extraordinary in the Jewish burial customs of the Second Temple period is the astonishing fact that within a comparatively short span of time burial practices, which are typically among the most conservative customs in a society, underwent rapid changes.”  \nReminder 2: On March 6, 2014 at 6:23 I wrote: “As early as 1994, I myself thought there was a cloth laid on top of head too. Now the very presence of markings left by flower heads (and other plants?) on top of the head and around, did convince me flower heads did act as a screen along with air gaps. This is genuine Occam’s razor since to the initiated eye (Botanist’s and Archaeocryptologist’s), there really are markings left by flowers on top and around the TS head. Reminder: I did detect and identify four floral images (of compressed fresh flower heads)on the HD TS face close-up 3D reconstruction by Tamburelli. Then I submitted my findings to Avinoam (who has got the eye for floral forms). He agreed for at least 2 crown daisies inflorescences I found in Tamburelli’s 3D close-up.” and “Most likely there was neither “penetration” nor any “thick” layer of flowers on the top of the head, just a few compressed flower heads (probably mixed with fresh plants) implying air gaps in-between hence a very faint and incomplete recording while the face ‘hills’ and ‘valleys’ were manually moulded with no air gap.”\nReminder 3:  Yeshua was buried in a GARDEN cave-tomb.\nReminder 4: The koine Greek word aromaton, ‘spices” used in John’s Gospel can refer to medical fresh plants and flower heads (used as insect repellent)not only to myrrh resin and aloe wood. Now fresh coronation daisy heads could have been be used as an insect-repellent on Yeshua’s burial.John 19:40 can read: “So they took the body of Yeshua and fastened/bound it in shrouds along with the spices (= granulized myrrh, aloe wood AND/OR fresh plants and flowers), as is the burial custom of the Judeans.” Most likely myrrh resin mixed with aloe wood formed in solid blocks or lump shape or granulized myrrh mixed with aloe wood in small bags were packed alongside the corpse and fastened in shrouds while granulized myrrh resin was spread on the burial bench (to absorb body fluids and prevent bad smells). Most likely aloe wood (and granulized myrrh resin?) were (also) used to make a fumigation for tahara.\nQuestion 1: Could Joe Zias account for the fairly current presence on Second Temple period ossuaries, sarcophagi and memorial tomb facades of many flower head decorations more or less stylized(as “rosettes”) or in fine detail, among which coronation daisy and rock rose heads (the very same head flower types of which floral images were found on the TS and confirmed by Israeli botanist Avinoam Danin)? (See e.g. Hachlili’s Jewish Funerary Customas, Practices and Rites in the Second Temple Period, BRILL ed., 2005.)\nQuestion 2: Were remnants of decayed roots from plants/trees ‘probably'(sic) mistaken too for  the bouquet of withered flowers found in the Giv’at ha-Mivtar ossuary that held the bones of the sole Second Temple period crucifixion victim ever found in the Land of Israel?\nReminder 3: Most likely he use of an alkaline solution to soak in the inner large burial wrapping aka TS working in conjunction with an external source of heat (fumigation as purification/cleansing ritual) could account for the recording of images of compressed fresh flower heads and small copper/brass coins very partially smeared with blood on the stretched and then slightly unstretched 3/1 twill fabric. \nReminder 4: Most likely too Pilate coins were used in Second Temple period funerary practices. All the more so as, symbolically speaking, Pilate coin central devices were specifically designed (or ambivalent enough as ‘aniconic designs’) to agree with both 1st c CE Judean and Roman sensibilities and be used by Judeans on an everyday basis. The fact is aniconic lepta and dilepta were allowed in the Jerusalem Temple treasure chamber (re-read Mark and the ‘widow’s mite/Pilate coin episode’). Had Pilate coins feature really offensive central devices, they just could not have been used by Judeans, which is not the case. \nArchaeologically speaking, Pilate coins were used in Second Temple period/1st c. CE funerary practices too (nearly a dozen of Jewish tombs yielded 46 Pilate coins both dilepta (lituus type) and lepta (simpulum type). That’s a fact unless like Zias you think all the Pilate coins found in STP tombs ‘simply fell out of the pockets (sic!)of those visiting or preparing the tomb'(dixit). If so in the Jason’s Tomb for instance (Greenhut’s reference), they were many to have a hole in ‘their pockets’ and to lose Pilate coins since, in 1956, it yieded more than 55 coins  among which no less than 28 Pilate coins (at the feet and nearby the body remains). Sporadic Second Temple funerary practices have not been convincingly cleared up yet (see Greenhut). Placement of Roman aniconic coins over the deceased’s eyes (no matter how sporadic) just cannot thus be totally excluded in the state of our knowledge of 1st c. CE Jewish burials. The fact remains 59 coins of “Roman procurators” + 12 “Roman” coins were found inside a dozen of Second Temple period tombs. More than half of them are Pilate coins (augur wand and pail types). This speaks volumes re the use of Roman coins in Second Temple period funerary pratices. It was a Second Temple period sporadic funerary pratice at worse, yet a funerary practice all the same.Besides Roman coins, Herodian coins too shall be taken into account, which involved 27 Second Temple period tombs (hence more than two dozens) and 124 coins in all (in 2005) thus more than 10 dozens of coins. Methinks they might well be only the tip of the Second Temple period funerary monetary iceberg respective of the percentage of coins inside tombs that were undiscovered, or else disappeared with time and given the fact only 8-9 hundreds of Second Temple period TOMBS were excavated so far.\nReminder 5: The body image resolution is 0.5cm while the blood image (and thus any blood smeared object images) resolution is 0.4-0.5mm. Experimentally, Moroni, Rodante and myself could record Pilate coin or one Euro cent coin tiny characters on a 3/1 twill fabric providing the coin is partially smearded with blood. This is an experimental fact.\nReminder 6: Yosseph Ha-Ramathaym/Yossef Bar Naba could gave placed himself the coins over Yeshua’s eyes on burial as the very name Yossef was given to the eldest son/disciple (Ben = Tamid = Disciple in Hebrew)for him to close not only his father’s eyes but also his master’s (aka Yeshua Ha-Nostry’s/Jesus of Nazareth’s).\nThe placing of coins over Yeshua’s eyes had nothing to do with the Charon’s obol. Most likely it was both to keep his eyelids closed or to cover his still open/half open eyes AND to read as a silent/coin rebus-like/coin puzzle-like eulogy as eulogy was not allowed to be pronounced in the month of Nissan, the month in which Yeshua was put to death. According to Jewish traditional custom, the eulogy should not be PRONOUNCED to honour the departed during the entire month of Nisan. Hence recurring to a monetary rebus to silently honour the departed Rabbi is therefore a real possibility to finally account for the placement of coins over eyes in the Second Temple period. Most likely, the placement of coins over Yeshua as great Torah Scholar’s eyes was done with this kavannah, i.e. in this specific design. The word kavvanah (literally “direction”)refers to one ‘s state of mind/intention i.e. concentration on the meaning of the words recited, the act performed (here silent eulogy), or the theological goal (such as the acceptance of the sovereignty of God).\nTherefore it would be good archaeology not to too rapidly rule out the real possibility for such small thin bronze coins to have been originally placed over the eyes in order both to keep the deceased’s eyelids closed (or cover his eyes) and pay a last tribute to the deceased’s memory in the manner of a rebus-like silent eulogy (see my 2005 unpublished paper “Linceul de Turin : L’Eloge Funèbre du Christ Retrouvée ? ou Tentative de décrytptage d’un très singulier rebus monétaire”.\nBesides Moroni in the late 1980s, in the 1990s, American MD, Alan WHANGER experimentally demonstrated too that, by a ‘piggybank effect’, a bronze dilepton (augur wand/lituus type), once placed on each eye of a deceased lying in a supine position, can drop through each superior orbital fissure and fall into the brain-pan as the body decays. It would be good archaeology too to integrate this forensic datum to re-assess past findings and in particular that of two bronze coins discovered in Jericho tomb D3 as the the coins were found stuck together in a skull uncovered in koch 1.”\n(I just “patched up” here what I wrote as comments on March 2014)\n\n","date":"October 2, 2014 at 7:55 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158593","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"This is very informative. Thanks for taking the time to present it all in one longer post.\n\n","date":"October 2, 2014 at 9:22 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158607","author":"David Goulet","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: Talmid\n\n","date":"October 2, 2014 at 8:03 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158598","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Max, you wrote at Reminder 2: ““As early as 1994, I myself thought there was a cloth laid on top of head too. Now the very presence of markings left by flower heads (and other plants?) on top of the head and around, did convince me flower heads did act as a screen along with air gaps.”  \nThe question of whether or not there was an air gap at the top of the head was exhaustively discussed earlier this year.  There had to be some explanation as to why there was no ‘top-of-head’ image.  Measurements on Shroudscope showed there was a distance of some 35 cm between the tip of the nose on the ventral image and the likely position of the back-of-head occiput bump on the dorsal image.  This seemed to imply that the cloth was drawn firmly, even tightly, over the top of the head leaving virtually no room for an air gap.  The general conclusion, with some dissenters, was that there had to be some object such as a cloth or cap masking the main cloth from the top of the head.  Your flowers might do it.  But I and others were of the opinion that there was virtually no air gap.  Otherwise I find your posting is interesting and informative.\n\n","date":"October 2, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158669","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Thank you Daveb and David Goulet. Daveb no room for air gap + presence of flower heads is a sensible alternative explanation too.\n\n","date":"October 2, 2014 at 5:57 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158696","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"While Yannick’s offering is interesting, he needs more science and experts and less conclusive conclusions based on one “expert.”\n\n","date":"October 2, 2014 at 8:10 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-158720","author":"Andy","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Posted on behald of Yannick:\n” Hello folks! \nFollowing my last 2 replies that Dan kindly posted for me on the blog, I reflect again on the whole subject and I now think that there’s a slim possibility that things like flowers and coins (or some other material objects covering the eyes) could have been used in the particular case of the Shroud man, simply because those who did the burial knew they had to comeback and re-open the shroud. In such a context, we can think they could have used flowers to help remove some bad smells and they could have used « something » (whether it’s coins or pieces of ceramic or something like that) to make sure they wouldn’t see the eyes open when they would re-open the cloth.\nBut having said that, I have to underline the fact that these 2 hypotheses must be considered as being highly improbable for at least 2 good reasons :\n1- These kind of « procedures » were not part of the First Century Jewish culture when it comes to burial rituals, at the exception of maybe some very scarce examples here and there (which could well have come from very hellenized jews by the way). On that question, sorry but I prefer to rely on the professional opinion of Joe Zias, who is a real Jewish achaeologist who spent all his life diging ancient Jewish tombs than, let’s say, Max Patrick Hamon… Important note about Mr. Zias : I’m fully aware that he’s not at all a partisan of the authenticity of the Shroud, but I don’t see why his opinion on this topic should affect in any way his professional knowledge of the most common Jewish burial procedure in the time of Christ (which did not included the use of flowers, not the use of coins or any other things to cover the eyes of the dead). Also, I need to underline the fact that even if there could be some examples  of possible uses of flowers and coins (or any other things covering the eyes) during ancient Jewish burials coming from archaeological findings, these are obviously exceptions that confirm the rule, because, to my knowledge, withered flowers have only been found in one particular tomb (in some ossuaries and not in a burial shroud, which refers to a different part of the whole Jewish burial procedure!) and coins have only been found in 2 different tombs (and they were placed singly inside the mouth and not over the eyes).  And concerning the eyes, I’m not aware of any archaeological finding in Israel that would have lead the scientist to conclude that the eyes of the dead were covered with material things to make sure they would not open suddenly… So, in such a cultural context where these kind of burial procedure were surely done only on very rare occasion, I think it’s fair to consider improbable a scenario in which those who would have done the partial preparation of the body would have thought of doing these unusual « procedures »…\n2-  If there would have been flowers, coins or any other material things over some parts of the Shroud man’s body, including the eyes, then we must expect that absolutely no yellowing of fibers would have happened in these places, because we know for a fact that even a very thin layer of serum was enough to prevent any image formation on the cloth’s surface.  Of course, since we don’t knowfor sure what was the real process that lead to the image formation, we must remain prudent here, but in my mind, there’s only one slim possibility that a mild chemical process could have produced at the same time a body image and images of flowers and/or coins on a linen cloth and it’s to think that a yellowing of fibers would have been produced by the interraction of some highly volatile and reactive burial product(s) that would had been sprinkled over the corpse (and therefore, over the flowers and/or the coins or any other thing covering the eyes) just before the end of the partial burial procedure and a thin layer of carbohydrate impurities located on the top-surface of the cloth, thus creating not only an image of the body on the cloth, but also images of these flowers and/or coins (or any other thing covering the eyes). In such a scenario, it would be the burial product(s) that would have acted as the sole « catalytic compound » that would have lead to the yellowing of a portion of the topmost fibers of the cloth. But having given you this possible scenario, I must admit that this seems to me as being quite far-fetched and that’s why I still believe that this second reason I just gave you is a very good one to think these hypotheses are highly improbable…\nIn the end, it’s evident that, regarding the hypotheses I discussed in my guest post, it’s impossible to be 100% sure about their inaccuracy, considering the present state of our knowledge.  To discard them for good, we would need to make an in-deep analysis (including a chemical investigation and a very high-resolution imagery analysis) of the areas where some people claim to see flower images and coins inscriptions.  But having said that, I think the 2 reasons I just gave you are strong enough to at least consider these hypotheses as highly improbable IN THE PRESENT STATE OF OUR KNOWLEDGE.  Maybe the future will prove I was wrong of thinking this, but when I consider the known cultural context in which ancient Jewish burials were normally performed (which normally do not included the use of flowers and coins or other things covering the eyes, at the exception of the very scarce examples that archaeologists have found in one or two ancient tombs) and when I consider the fact that even a thin layer of serum located between the corpse and the cloth’s surface was enough to prevent any yellowing of fibers, I’m not ready to change the highly improbable estimation I reached (which must be, I’m sure, better for Max, Hugh, Domenico and some other people than if I said « the probability is equal to absolute zero »).\nLet’s wait until new direct researches could be done on the Shroud and, at that moment, we’ll surely have a better idea if my estimation was right or wrong…”\n\n","date":"October 5, 2014 at 6:47 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159468","author":"Dan","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Dan, I would not talk about ‘exceptions’ regarding  the issue of the flowers. The fact is, that ossuaries still closed and intact with their liquid inside are very few and incidentally inside one of the few discovered there were flowers! Please note that Tzaferis and Haas writing plainly about ‘withered flowers’ seem not to consider an oddity their finding and they were of course expert of Jewish customs.\nIt is true that we do not have flowers or plants associate with a burial shroud but are you aware how many burial shroud have been discovered in conditions to allow the preservation of plant material?\n\n","date":"October 6, 2014 at 5:13 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159766","author":"domenico","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"See Mark Antonacci The Resurrection of the Shroud, pages 105-108:\nhttp://books.google.pl/books?id=h8bSVuYzMjoC&printsec=frontcover&hl=pl#v=onepage&q=coin&f=false\nInterestingly, after Shroud of Turin researchers discussed the appearance of a coin over the eye of the man in the Shroud and drew connections with ancient Jewish burial customs, Hachlili changed her interpretation of her findings, She stated her new belief that the coins found at Jericho had been placed in the mouth, not on the eyes. (pg. 105)\nI have bad feelings about this…\n\n","date":"October 5, 2014 at 10:37 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159523","author":"O.K.","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Ian Wilson, The Turin Shroud, Penguin Books 1979, pg. 260:\n“But Jackson could not rest. He began searching his library, hunting out references to ancient Jewish burial practices. In an article in the 1898 Jewish Quarterly Review he found the information he was looking for. It was a custom, the article said, among Jews and certain other nationalities to lay coins or pieces of potsherd over the eyes when laying out a corpse for burial, the intention being to keep deceased from seeing the way by which he was carried to his lat home.3″\nFootnote:\n“3. A.P.Bender. ‘Beliefs, Rites and Customs of the Jews Connected with Death, Burial and Mourning’, part IV, Jewish Quarterly Review, VII (1895), pp. 101-3. Bender quotes the practice from J.G. Frazer, Journal of the Anthropological Institute, XV p. 71, who in turn quotes Bodenschatz, Kirchliche versfassung der heutingen Juden, IV p. 174, and Gubernatis, Usi funebri, p. 50. Archeological evidence for the practice is lacking due to Jewish corpses being put in ossuaries after decomposition. But it is by no means unlikely.”\n\n","date":"October 5, 2014 at 11:05 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159528","author":"O.K.","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"O.K. cited source: Sir James George Frazer, 1854-1941, born Glascow, Scot.\nBritish anthropologist, folklorist, and classical scholar, best remembered as the author of The Golden Bough, A Study in Comparative Religion, enlarged to 12 volumes 1911-15 .  This work is a major classic in anthropology and is often cited;  I came across it during my course in Religious Studies. \nAlthough the evolutionary sequence of magical, religious, and scientific thought is no longer accepted and Frazer’s broad general psychological theory has proved unsatisfactory, his work enabled him to synthesize and compare a wider range of information about religious and magical practices than has been achieved subsequently by any other single anthropologist. \nIn making a vast range of primitive custom appear intelligible to European thinkers of his time, Frazer had a wide influence among men of letters; and, though he traveled little himself, he was in close contact with missionaries and administrators who provided information for him and valued his interpretation of it. His other works include Totemism and Exogamy (1910) and Folk-Lore in the Old Testament (1918). He was knighted in 1914. \nIf Frazer claimed that the practice of placing coins or potsherds over the eyes of deceased Jews. then it is almost certainly correct.  Note that the ref provided by O.K. gives an explanation of the practice unconnected with Charon and the Styx: “… the intention being to keep deceased from seeing the way by which he was carried to his last home …”  Whatever, the practice may very well derive from a more ancient custom which may have had other connotations.  Coins found in the mouths of some skulls, may very well have dropped through from the eye sockets.  Images of coins on eyes of the TSM may well be back on the agenda.\n\n","date":"October 5, 2014 at 3:19 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159583","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Yannick, \n1/- How can you believe at one and the same time (a coin or two coins) placed in the mouth were rare manifestations of a pagan influence on Judean burial customs associated with Charon’s obol (or payment required by the ferryman Charon to reach the mythical underworld) and think Pilate coins could not be used on Judean burials because they bore offensive pagan symbols? That’s called a double standard and such a standard indicates a flawed argument.\n2/- How can one follow Israeli anthropologist, Joe Zias, when he thinks ALL the coins (and  Pilate coins) found in Second Temple Period tombs ‘simply fell out of the pockets (sic!) of those visiting or preparing the tomb’? If so in the Jason’s Tomb for instance, they were many to have a hole in ‘their pockets’ and to lose Pilate coins since, in 1956, it yielded more than 55 coins among which no less than 28 Pilate coins (at the feet and nearby the body remains).  Most obviously Zias is biased and totally unreliable on this particular issue. \n3/- Yannick you wrote “(you)  prefer to rely on the professional opinion of Joe Zias, who is a real Jewish achaeologist who spent all his life diging ancient Jewish tombs than, let’s say, Max Patrick Hamon”. What do you make too of Zias’s assertions “Jesus didn’t have long hair” and the shroud is indisputably a fake? Do you follow him too? Why not?\n\n","date":"October 5, 2014 at 5:04 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159605","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"BTW I am a professional cryptologist (cryptology applied to archaeology, criminology and therapy).\n\n","date":"October 5, 2014 at 5:10 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159606","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Methinks Zias is first and foremost an anthropologist not an archaeologist per se.\n\n","date":"October 5, 2014 at 5:13 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159607","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Posted on behalf of Yannick who cannot comment in this blog:\nHi Max!\nConcerning your questions, I would answer this:\nQuestion 1: After having exchanged a lot on the subject with Mr. Zias and after learning the FACT that there’s only TWO CASES where coins have been found in-situ inside ancient Jewish skulls, I came to believe (just like Zias by the way) that this must have been a very rare practice in ancient Israel and, personally, I came to the rational conclusion that, in these rare cases where Jews placed coins on the body of their dead (whether it was in the mouth, which seem to be the most common “pagan” ritual, or over the eyes), it is most probably due to the fact that these particular Jewish burials were done by hellenized Jews greatly influenced by pagan culture and pagan beliefs.  This seem highly logical to me, because we know for a FACT that, during that era, there really was in Israel some Jews (mostly from the high class by the way, including some members of the Saducees, but most probably not Pharisees, who respected much better their ancient traditions) who adopted the Greco-Roman lifestyle.  We also know for a FACT that these hellenized Jews were in minority among their Jewish brothers and sisters. In such a context, I think it’s fair to assume that including some pagan rituals in a Jewish burials (like the use of coins and probably also the use of flowers) must have been very rare and must have come, in most cases, from these hellenized Jews.  What’s illogical in that kind of reasonning?\nQuestion 2: If Zias and other colleagues came to this surprising conclusion, it’s mostly because of the reasonning I just exposed you, which is based on the FACT that, during that period, most Jews were not hellenized Jews and must have been very respectfull of their culture and tradition when it comes to burial procedures, which didn’t normally included the use of flowers, coins or any other object over the eyes.  The other basis for such a conclusion comes from the FACT that all these coins were not found in-situ but elsewhere in the tombs, except for the cases of the two coins found in ONE skull in Jericho and another one found in ONE skull in Caiaphas tomb.  Personally, I think some of these other coins (those not found in-situ) can well have been originally placed on the dead, but who can be sure about that?  And even if that would be the case, these cases where coins were found in some tombs do not represent a majority, or else, archaeologists would surely have come to the conclusion that the use of coins was common in ancient Jewish burials…  The truth is that I’m not aware of any archaeologist expert in Biblical archaeology who believe this pagan practice was common in Israel during the Second temple period.  If I’m wrong here, please prove it by giving me some quotes taken from papers or books written by REAL archaeologists expert in Biblical study that would clearly state that this was a common practice among Jews of that time to use coins during their burial procedure…  Important note: even if Sir James George Frazer, who was not an archaeologist but an anthropologist and who, unlike Zias, did not digged ancient Jewish tombs in Israel, thought that practice of placing coins or potsherds over the eyes of deceased Jews was common in Antiquity, this is surely not the general opinion defended by the vast majority of Jewish archaeologists and anthropologists today.  Just read this quote from Wikipédia concerning Charon’s obol, which represent the general conclusion of modern experts (at least, those not influenced at all by the Shroud) on this topic (which is the roughly the same exposed to me by Zias the other day): “Jewish ossuaries sometimes contain a single coin; for example, in an ossuary bearing the inscriptional name “Miriam, daughter of Simeon,” a coin minted during the reign of Herod Agrippa I, dated 42/43 AD, was found in the skull’s mouth. Although the placement of a coin within the skull is UNCOMMON in Jewish antiquity and was potentially an ACT OF IDOLATRY, rabbinic literature preserves an allusion to Charon in a lament for the dead “tumbling aboard the ferry and having to borrow his fare.” And concerning the specific use of coins over the eyes, here’s another interesting and very telling quote taken from the same Wikipedia page, which express, once again, the most common conclusion among experts: “Only RARELY does the placement of a pair of coins suggest they might have covered the eyes. In Judea, a pair of silver denarii were found in the eye sockets of a skull; the burial dated to the 2nd century A.D. occurs within a Jewish community, but the religious affiliation of the deceased is UNCLEAR. Jewish ritual in antiquity did not require that the eye be sealed by an object, and it is debatable whether the custom of placing coins on the eyes of the dead was practiced among Jews prior to the modern era. During the 1980s, the issue became embroiled with the controversies regarding the Shroud of Turin when it was argued that the eye area revealed the outlines of coins; since the placement of coins on the eyes for burial is not securely attested in antiquity, apart from the one example from Judea cited above, this interpretation of evidence obtained through digital image processing CANNOT BE CLAIMED AS FIRM SUPPORT for the shroud’s authenticity.”\nQuestion 3:  Read again my recent post:  “I’m fully aware that he (Zias) is not at all a partisan of the authenticity of the Shroud, but I don’t see why his opinion on this topic should affect in any way his professional knowledge of the most common Jewish burial procedure in the time of Christ (which did not included the use of flowers, not the use of coins or any other things to cover the eyes of the dead).”  On the contrary, when it comes to questions directly related to the Shroud, I’m much more prudent versus what he can think or conclude…  But on the particular topic concerning the question of whether or not flowers and coins were commonly used in ancient Jewish burials (which is a topic not directly in link with the Shroud), I have no reason to doubt his professional opinion.  Note also that, in my recent post, I do not reach the kind of drastical conclusion Zias reached when it comes to the Shroud…  In other words, Zias would say something like: “The use of flowers and coins was not part of the common Jewish burial in the time of Christ; therefore there is SURELY no images of things like that on the Shroud”, while I conclude this instead (which is a much more “balanced” and “open” conclusion): “Maybe the future will prove I was wrong of thinking this, but when I consider the known cultural context in which ancient Jewish burials were normally performed (which normally do not included the use of flowers and coins or other things covering the eyes, at the exception of the very scarce examples that archaeologists have found in one or two ancient tombs) and when I consider the fact that even a thin layer of serum located between the corpse and the cloth’s surface was enough to prevent any yellowing of fibers, I’m not ready to change the highly improbable estimation I reached.”\n\n","date":"October 7, 2014 at 10:49 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160131","author":"Dan","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Joe Zias never was in charge of any dig as far as Second Temple period tombs in the land of Israel are concerned. This is a myth. He was handed over a few ossuaries and studied bones. found by true Second Temple period archaeologists.\n\n","date":"October 6, 2014 at 3:56 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159741","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"He’s no botanical expert either as far as the flower heads and plants issue is concerned.\n\n","date":"October 6, 2014 at 4:01 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159742","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"That rings a bell. It’s somewhat reminiscent of those two senior STURP scientists who never made the trip to Turin in 1978 to see the TS with their own eyes, who were later handed minute blood samples that others had brought back from Turin, and who then proceeded to make claims unsupported by the evidence (“extraordinary” amounts of bilirubin that “keep the blood looking unrealistically red”). Years later, one of them WAS finally in Turin to advise on Shroud conservation, and warned that bilirubin’s photosensitivity might accelerate what he called autocatalytic degradation. \nTake your pick: either the alleged bilirubin (absent in my humble opinion) is a photochemically-stable long-term preservative of ancient blood OR it’s a photosensitive chemical  that generates reactive oxygen species, notably singlet oxygen, when illuminated by visible light (450nm absorbance max) and the reason for needing to take active conservation measures.\nYou couldn’t make it up.\n\n","date":"October 6, 2014 at 4:20 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159748","author":"Colin Berry","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"CB, for once, I am with you on that.\nOn March 16, 2013 at 7:35 pm (#21 Reply), I wrote:\n“Bilirubin is neither the problem nor the solution, just probably one part of the whole equation.”\nBTW, how many (bio)chemists have been able to replicate Adler’s findings so far? What about an independent confirmation?”\n“Final remark: Adler’s finding (which still needs to be independently confirmed) doesn’t prove beyond the shadow of a rational doubt the TS man’s bloody body was not purified in accordance with an ancient (Judean) burial practice. Far from it as It can also prove quite the opposite actually!”\n\n","date":"October 6, 2014 at 5:50 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159771","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"On June 3, 2013 at 6:29 am, I also wrote:\n“Adler NEVER considered a Second period Temple puriyfing & drying ritual scenario (implying the use of alkaline solution coupled with (myrrhic-)aloetic fumigation) could account for potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal. Now these two signals tend to prove the body could have been purified in accordance with an ancient (Judean) burial custom/practice (see 2 Chronicles 16:14 – 21:19 Targum and my TS man’s burial reconstruction).\nIn the case here under study, Second Temple period speedy tahara in terms of wrapping in shrouds, purifying & drying out was an act of ultimate kindness to honor the deceased who died a violent death. It shall not be mistaken with careful physical cleansing Jewish/Judean ritual of a NON-bloody body.\nThe true archaeological fact is there is more than one way by which blood could have become depleted of key ingredients if one considers the bloody body purifying & drying ritual scenario, which Adler clearly did not (crucifixion being an implicit assumption in all his discussion at the expense of specific burial practices, rites and customs). His shortcomings and partial view do show as far as archaeological bloodstain pattern analysis is concerned.”\n\n","date":"October 6, 2014 at 8:17 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159802","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Still waiting for Yannick Clement to answer my “Question 1”: Could Joe Zias account for the fairly current presence on Second Temple period ossuaries, sarcophagi and memorial tomb facades of many flower head decorations more or less stylized(as “rosettes”) or in fine detail, among which coronation daisy and rock rose heads (the very same head flower types of which floral images were found on the TS and confirmed by Israeli botanist Avinoam Danin)? (See e.g. tables of illustrations in Hachlili’s Jewish Funerary Customas, Practices and Rites in the Second Temple Period, BRILL ed., 2005.)\n\n","date":"October 6, 2014 at 4:07 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159744","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"O.K. re the coin-on-eye issue, you wrote: \n“See Mark Antonacci The Resurrection of the Shroud, pages 105-108:\nhttp://books.google.pl/books?id=h8bSVuYzMjoC&printsec=frontcover&hl=pl#v=onepage&q=coin&f=false\n“Interestingly, after Shroud of Turin researchers discussed the appearance of a coin over the eye of the man in the Shroud and drew connections with ancient Jewish burial customs, Hachlili changed her interpretation of her findings, She stated her new belief that the coins found at Jericho had been placed in the mouth, not on the eyes. (pg. 105)\nI have bad feelings about this…”\nReminder on March 18, 2014 at 4:20 pm I wrote:\n “Hachlili was one of Rahmani’s students. Maybe she did not want to hurt her former professor’s sensibility on the issue… The fact first she tended to admit the placement of coins over the deceased’s eyes as a very sporadic Second Temple funerary practice and then revised her position in 1979.”\n\n","date":"October 6, 2014 at 4:39 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159753","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder on March 19, 2014 at 9:00 am, I wrote:\n“Methinks the placing of coins over the deceased eyes is sort of an original recycling/revisiting of the Hellenistic custom of placing a coin or two in the deceased’s mouth.\nMost likely, there were specific circumstances in which (rich?) Judean buriers or mourners recurred to placing coins over eyes not only to prevent the deceased’s eyelids to lift up or to hide his/her open/half open eyes but also to honour the deceased’s memory and abide by the Halakha(Judean religious law)when the eulogy was not allowed to be pronounced.\nIn the years 2003-2004, my personal investigation of the issue led me to seriously consider the possibility of coins central devices and/or legend to be used (within Second Temple period Judean context) in a manner of puzzle or rebus (i.e. via image and word plays in Hebrew, Aramaic and even Greek) to have silent eulogy. Reminder: no eulogy for instance should be pronounced during burials occuring in the month of Nissan. Now in the hypothesis the TS man is Yeshua, he was put to death in the very month of Nissan at a time when most definitely a eulogy just could not be pronounced over his body (today it is allowed/tolerated to pronounce a eulogy only over great Torah Teachers’ bodies though).\nI even went as far as reconstructing both a short and long version of the TS man’s silent eulogy by means of Pilate coins symbols and legends (see my 2005 unpublished paper “Linceul de Turin : L’Eloge Funèbre du Christ Retrouvée ? ou Tentative de décrytptage d’un très singulier rebus monétaire”).”\nOn March 22, 2014 at 4:00 pm, I also wrote:  \n” Sceptics have argued that the flower images are too faint for Danin’s determination to be definite. They are to the sole exception of four crown daisy and one rock rose 3D and digital squeeze images on the Shroud face I could detected or myself processed in 2010, on the far end of the left eyebrow arch area. Floriographically speaking, rock rose’s symbolic meaning is courage and crown daisy’s is glory, majesty, purity, innocence, loyal love,beauty, patience and simplicity. As such, the crown daysy can refer to man both as enosh and ha-ben-adam (see Ps 8:4-6 and Hebrews 2:7-9).One of the crown daisy head image had its petals all plucked out most likely to symbolize terrestrial life’s ephemerity as mere passage. In 1996, Baima-Bollone mistook the petalless crown daisy head for a coin (actually there may be a Pilate coin –simpulum type– stroboscopic bloodied mark on the middle of the left eyebrow arch siding with it). Now the victor’s crown also appears yet as a laurel wreath with berries, on Pilate’s dilepton coin type reverse and there are 21 references to the victor’s crown in the New Testament.”\n“In light of eidomatic (i.e. 3D and digitally squeezed images), botanical and archaeological pieces of evidence, methinks several fresh flower heads, mainly crown daisies along with rock roses (and other fresh plants?) were placed and compressed on top and both sides of the TS man’s head as a sort of crown or halo to symbolize him as righteous/courageous victor of eternal life for such is the symbolic meaning of crown daisy and rock rose heads carved in stone on Second Temple period ossuaries, sarcophagi and tomb facades while the TS ‘herringbone’ weave pattern is symbolic of the living waters of the Torah.”\n“Reminder: Dr. Petrus Soons produced a holographic 3D image from photographs of the Shroud and found seemingly blocked, “empty” spaces, in which, Avinoam Danin hypothesized that dozens of tiny inflorescences of Anthemis bornmuelleri or Matricaria recutita were placed.”\n\n","date":"October 6, 2014 at 5:07 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159765","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Correction (miscut-and-paste paragraphs):\n“Sceptics have argued that the flower images are too faint for Danin’s determination to be definite. They are to the sole exception of three (-four) crown daisy and one rock rose 3D and digital squeeze images on the Shroud face I could detect or myself process in 2010. Floriographically speaking, rock rose’s symbolic meaning is courage and crown daisy’s is glory, majesty, purity, innocence, loyal love,beauty, patience and simplicity. As such, the crown daysy can refer to man both as enosh and ha-ben-adam (see Ps 8:4-6 and Hebrews 2:7-9). One of the crown daisy head image had its petals all plucked out (see far end of the left eyebrow arch area).  Most likely it symbolizes terrestrial life’s ephemerality as mere passage. In 1996, Baima-Bollone mistook the petalless crown daisy head for a coin (actually siding with it on the middle of the left eyebrow arch, there may be a Pilate coin –simpulum type– stroboscopic bloodied marking).”\n\n","date":"October 6, 2014 at 8:03 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159799","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Lombatti:  Coins have been found only in ten Hebrew tombs from three thousand explored. http://www.antoniolombatti.it/b/blog/46C4EC81-968C-46ED-9CF4-0FD0A9CE2424.html\nRahmani: Coins on the eyes was not a Jewish custom. Some coins are been found in debris. Only one into a skull. Perhaps it was on the mouth because Hellenization . ”The Shroud of Turin”; Biblical Archeologist, Autumn 1980, p. 197\nFrazer wasn’t a field researcher. He is very contested by contemporary anthropologists. We should know his sources before to attribute some authority to him.\n\n","date":"October 6, 2014 at 5:22 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159767","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"please ask Dr Lombatti: of the three thousand tombs explored how many were untouched by robbers and  were still closed at the time of investigation?\n\n","date":"October 6, 2014 at 6:25 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159778","author":"domenico","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Do you know the datum? How many? Do you know more instances of coins into skulls? I have quoted an article of 1980. Has anything changed since then?\n\n","date":"October 7, 2014 at 3:33 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160049","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Again READ Hachlili’s Jewish Funerary Customs, Practices and Rites in the Second Temple Period, BRILL ed., 2005 to start with, please.\n\n","date":"October 7, 2014 at 4:26 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160063","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David,\nI offer you this counterexample. In the thousands of tombs excavated in Jerusalem were found only three examples of burial shrouds (actually one certain and the other two dubious).\nShould we conclude that the burial shrouds were not a Jewish common practice?\n\n","date":"October 7, 2014 at 4:54 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160072","author":"domenico","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Domenico: Coins are not cloths. Do you see the difference? Resistence to degradation.\n\n","date":"October 7, 2014 at 10:17 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160126","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David,\nthe coins attract thieves, degraded tissues do not.\nDo you see the difference?\nAnd in any case in arid climates tissues, though in fact degraded, could be preserved quite well.\n\n","date":"October 8, 2014 at 4:42 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160344","author":"domenico","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"On Oct 5, 3:19 pm, I clearly stated:\n“In making a vast range of primitive custom appear intelligible to European thinkers of his time, Frazer had a wide influence among men of letters; and, though he traveled little himself, he was in close contact with missionaries and administrators who provided information for him and valued his interpretation of it.”\nThe words are those of the Encyclopedia Britannica, and your quarrel is with them.\n\n","date":"October 6, 2014 at 3:17 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159901","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Of course. I think that  Encyclopedias are not the paramount of scientific information. I can provide to you some more expert criticism against Frazer if you like.\n\n","date":"October 7, 2014 at 4:09 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160057","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Item plus, Frazer doesn’t speak about the ancient Jews,  in the case of the coins. He is referring to a modern custom. The case is over.\n\n","date":"October 7, 2014 at 5:28 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160082","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David Mo wrote: “Coins have been found only in ten Hebrew tombs from three thousand”. Lombatti is misinformed and should do his homework.\nDavid Do your homework yourself first before passing comment or parroting Lombatti (read Hachlili’s Jewish Funerary Customs, Practices and Rites in the Second Temple Period, BRILL ed., 2005   to start with).\n\n","date":"October 6, 2014 at 6:02 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159773","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder for David Mo: the issue here is on coins found in SECOND TEMPLE PERIOD TOMBS.\n\n","date":"October 6, 2014 at 6:28 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159780","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"..untouched by robbers and  still closed at the time of investigation (implied).\n\n","date":"October 6, 2014 at 6:39 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159782","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder for David Mo:  ONLY in Jerusalem, eleven  STP tombs yielded 114 coins (see Hachlili’s table, ibidem p. 434).\n\n","date":"October 6, 2014 at 6:58 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159786","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder 2: Jerusalem + Jericho +En-Gedi/Hahal David burials = 79 coffins, 1471 ossuaries and 22 sarcophagi in all = 124 coins.\n\n","date":"October 6, 2014 at 7:29 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159791","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: NaHal David\n\n","date":"October 6, 2014 at 7:30 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159792","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Don’t you mistake Second Temple Period TOMBS with STP coffins, ossuaries and sarcophagi. No matter how sporadic placing coins over the deceased’s eyes was, as a possible sporadic STP Judean funerary practice just cannot be totally ruled out in our present state of knowledge of STP burial practices though whether archsceptics like it or not.\n\n","date":"October 6, 2014 at 7:51 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159798","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Re Rahmani’s totally biased opinion/reliability on the TS coin-on-eye issue: \nIn 1980, Rahmani stated “No coins of the period 50 BC to 70 AD were found in any tomb” while, in 1956, Jason’s Tomb (excavated by Prof. Rahmani himself!), yielded no less than 55 coins among which 28 Pilate coins (both lepton simpulum and dilepton littus types). This is not serious!\n\n","date":"October 6, 2014 at 6:16 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159776","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Ref. L.Y.RAHMANI, “Jason’s Tomb”, Israel Exploration Journal 17(1967) 100 and L.Y.RAHMANI, A Catalogue of Jewish Ossuaries.\n\n","date":"October 6, 2014 at 6:22 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-159777","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"(Just in case Yannick Clément missed it again):\nOn June 3, 2013 at 6:29 am, I also wrote:\n“Adler NEVER considered a Second period Temple puriyfing & drying ritual scenario (implying the use of alkaline solution coupled with (myrrhic-)aloetic fumigation) could account for potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal. Now these two signals tend to prove the body could have been purified in accordance with an ancient (Judean) burial custom/practice (see 2 Chronicles 16:14 – 21:19 Targum and my TS man’s burial reconstruction).\nIn the case here under study, Second Temple period speedy tahara in terms of wrapping in shrouds, purifying & drying out was an act of ultimate kindness to honor the deceased who died a violent death. It shall not be mistaken with careful physical cleansing Jewish/Judean ritual of a NON-bloody body.\nThe true archaeological fact is there is more than one way by which blood could have become depleted of key ingredients if one considers the bloody body purifying & drying ritual scenario, which Adler clearly did not (crucifixion being an implicit assumption in all his discussion at the expense of specific burial practices, rites and customs). His shortcomings and partial view do show as far as archaeological bloodstain pattern analysis is concerned.”\n\n","date":"October 7, 2014 at 4:18 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160061","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"“Rahmani (1980: 197; 1982: 6–7; 1993) correctly argues that the subjective evidence Father Filas presents is not sufficient to identify the spots found in the region of the eyes on the Shroud of Turin as coins, specifically those of Pontius Pilate. He also stresses the lack of evidence from first-century CE tombs to support the claim for a coin-on-eye custom.” (Rahel Hachlili: Jewish Funerary Customs, Practices and Rites in the Second Temple Period . Op. cit. p. 442)\nMax, I suggest you to make a quotation after you have read what you are quoting in its integrity. But fully, please.  Otherwise I shall think that you  are only quoting pro domo sua.\nHachlili speaks about hundreds of tombs and one single evidence of a coin on the eyes. But there are some doubts whether it actually was a Jewish tomb. She speaks of other seven cases of coins into the skulls, but she warns about the bad state of the skulls (debris) and thinks (with Rahmani) that the coins were likely placed on the mouth. He emphatically concludes that the coin in the eyes was not a Jewish custom.\nThank you, Max. The book is very interesting.\n\n","date":"October 7, 2014 at 5:05 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160074","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I call your attention to the fact that Hachlili quotes in her favour the same page that I had quoted from the article Rahmani. I hadn’t do it badly.\n\n","date":"October 7, 2014 at 5:18 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160079","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: “hadn’t done”\n\n","date":"October 7, 2014 at 5:20 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160080","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David Mo, \nHachilili wrote (your quote): “Rahmani (1980: 197; 1982: 6–7; 1993) correctly argues that the subjective evidence Father Filas presents is not sufficient to identify the spots found in the region of the eyes on the Shroud of Turin as coins, specifically those of Pontius Pilate.’ \nI do agree with Hachlili here. However, as a pioneer, Father Filas did find sthg but most unfortunately was the victim of BOTH positive AND negative pareidoliae: he misread the truncated inscription that what was there, thought he saw a full lituus/augur wand that was not really there and totally missed at least three paleographic elements that were really there.\nRe YOUR “pro domo sua” statements: \n1/- You NOW wrote: “Hachlili speaks about HUNDREDS (my upper cases) of tombs and one single evidence of a coin on the eyes” NOT “thousands” a you FIRST implied quoting Lombatti. Reminder for Lombatti and archsceptics: “Although during the past century HUNDREDS OF TOMBS DATING FROM THE SECOND TEMPLE DOWN TO THE LATE ROMAN PERIOD have been excavated or surveyed, coin are a rare occurrence.” (dixit Hachlili p. 437, ibidem). \n2/- Now Rahmani and Hachlili’s INTERSUBJECTIVITY is quite obvious to the attentive reader of their articles on the coin-on-eye issue. Shall I repeat (till you can finally hear!) that “anatomothanathologically” speaking, small thin coins found in the mouths of some skulls, may very well have dropped through from the eye sockets as the soft tissues decay. The placing of coins over the eyes per se is consistent with the Halakha too (Judean/Jewish religious law). Besides the very presence of 46 Pilate coins found in STP tombs is also consistent with a sporadic funerary practice/sporadic funeray practices in which they were used; practices that have not yet been convincingly cleared up. To claim to the contrary is BAD archaeology.\nHachlili also wrote: “This (referring to three instances of coins associated with skulls) MIGHT have been (MIND not “WAS”!) inspired by the pagan Greek custom (Charon’s)”. Actually she just cannot convincingly state whether the Greek custom was literally applied as such or totally revisited and in which way.\nBasic reminder one for you: re the sporadic  custom of placing coins over a STP deceased’s eyes, lack of evidence is not absence of evidence  The true fact is there is SOME anatomothanathological, Halakhic (closing/covering of the eye of the deceased) and archaeological EVIDENCE to the contrary…\nBasic reminder  two: A custom that is sporadic is non widespread/not common (here among STP Judeans). \nBasic reminder three: “The placing of coins over the eyes is reported in only one case at ‘En Boqeq (furthermore, it is highly doubtful the interred at the site was a Jew)” (dixit Hachlili on p. 443). Two Hadrian silver coins  (early Second c. CE) were found in the deceased’s orbits. Most likely (i.e. anatomothanalogically speaking), the two coins were too thick to  drop through the orbital fissures and fall into the brain-pan as the body decayed. \nBasic reminder four: in Greek the word lepton means “thin”.\nHachlili’ conclusion: “Jews quite rarely used items with pagan characters as grave goods: the example consist mainly of ring gems AND COINS” (see p. 445). \nIn other words irrespective of Asmonian and Herodian coins, procurator/Pilate coins were used by Judeans in Second Temple period funerary practices. The latter have still to be convincingly cleared up.\n\n","date":"October 7, 2014 at 6:33 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160091","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: Basic reminder one for you: re the sporadic custom of placing coins over a STP deceased’s eyes, lack of evidence is not absence of evidence The true fact is there is SOME anatomothanathological, Halakhic (closing/covering of the eye of the deceased) and archaeological EVIDENCE IT CAN HAVE BEEN A SPORADIC JUDEAN CUSTOM…\n\n","date":"October 7, 2014 at 7:20 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160096","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"1.“… the issue here is on coins found in SECOND TEMPLE PERIOD TOMBS”. No. You are in a mistake. The problem is coins found in the eyes etc. and “114 coins” on the floor or at the entrance of the tomb are irrelevant here.\n2.Hachlili speaks on a circumscribed period: Second Temple. Lombatti not.\n3.Filas do not match the Hachlili et allia experience in archaeological Palestine.\n4.“Halakha” is a very vague word. What period are you speaking of? There is not a Halakha corpus clearly datable at the first half of the first century.\n5.“Lack of evidence is not absence of evidence” (?). Lack = absence. Do you mean that absence of evidence does not mean any contrary evidence? But in no way it means evidence. You know, burden of proof.\n6.In any case: it is unthinkable the disciples of a Galilean prophet were using a pagan burial custom. And the coins in the eyes problem sends us to a pagan costum, not a Jewish one.\n\n","date":"October 7, 2014 at 11:01 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160134","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"This is just blabla. I already refuted all your/these arguments.You have no hard physical evidence and forensic evidence to oppose mine while I have.\n\n","date":"October 7, 2014 at 11:23 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160140","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"..to refute yours.\n\n","date":"October 7, 2014 at 11:24 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160141","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"“¡Mecachis, qué guapo soy!” (Untranslatable)\n\n","date":"October 8, 2014 at 4:01 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160335","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Addition: re what Hachlili (following Rahmani) thinks results from the placing of a coin in the mouth of STP deceased as payments to Charon (Charon’s obol), she wrote: “As Jews were often influenced by the surrounding Hellenistic culture, ON OCCASION  they ADOPTED (my upper cases) Hellenistic practices and customs WITHOUT ACCEPTING necessarily their pagan significance.” (ibidem p. 441). \nMethinks this is not only a bit too short (and yet convoluted). \nHow long shall I have to repeat: “in the context of a Judean burial of the Second Temple period, the Charon’s obol theory is a most unconvincing explanation as it creates more questions than answers and has a potential to mislead. For instance, in the Jericho D/18 tomb case, WHY EXACTLY a Judean burier or mourner would have felt the need to place two coins instead of only one in the deceased’s mouth as Charon’s obol? Would the two coins have been intended for a return trip? In the Caiaphas’ daughter’s intact skull case, WHY EXACTLY would a high priest family of Jerusalem have felt the need to recur to the pagan custom to bury one of its deceased members (Sadducees did not believe in resurrection or life after death!) ? It actually verges on sheer anachronism. Therefore, it would be good archaeology to integrate the forensic datum to reassess past findings and keep an open mind for the coin-on-eye issue in connection with the Turin Shroud”?\nMethinks that recurring to an alleged ‘Charon obol’ to account for the coins found in STP Judean skulls just doesn’t fit.\n\n","date":"October 7, 2014 at 11:20 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160139","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Exact quotations, please. And number of pages.\n\n","date":"October 8, 2014 at 5:13 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160358","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Is everybody aguing the same thing here? It seems that nobody, including Yannick, Max, Frias or Mo thinks that coins were a common Jewish burial practice, but equally nobody (perhaps with the exception of Mo) thinks it impossible that coins were occasionally used in some circumstances. In that case, whether there are coins over the eyes of the man in the Shroud depends wholly on the evidence of the Shroud itself, not on historical precedent. Are there marks of coins or not? I think not. Max thinks there are. Others agree with one side or the other. And that’s it. Interminable perorations about FACTS (all of which are disputed) are no help at all.\n\n","date":"October 7, 2014 at 11:25 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160142","author":"Hugh Farey","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Are there marks of coins or not? I think not. Max thinks there are. Others agree with one side or the other. And that’s it.\nThey are there -and they are not. My position is that the issue cannot be resolved. Maybe in a few days I will make some presentation showing why I think so -if I mobilise myself to make it. I have little motivation so far.\n\n","date":"October 7, 2014 at 11:39 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160146","author":"O.K.","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"If have got more time enough I will send too two illustration table showing the Holy Grail evidence i.e. BOTH typological and accidental characteristics of a dilepton lituus obverse and a lepton simpulum obverse partially recorded on the TS.\n\n","date":"October 7, 2014 at 11:50 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160152","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"“…but equally nobody (perhaps with the exception of Mo) thinks it impossible that coins were occasionally used in some circumstances”.\nThis is not my point, Hugh. I have only  stated:\n-The main experts on the subject think that putting a coin on the eyes wasn’t a Jewish custom.\n-No evidence of this practice exists and you cannot state something without any proof. Burden of the proof.\n– The alleged vision of leptons (by Filas or Whanger) is subjective, as Hatchlili correctly affirms.\n-The theory of leptons falls for some insurmountable contradictions. I have pointed to one above. \nIt is useful for more critical information about the two last pointsl: Gian Marco Rinaldi: “La farsa delle monetine sugli occhi”, Scienza & Paranormale N. 81,  http://www.cicap.org/new/articolo.php?id=273767 \n“Impossible” is not in my vocabulary. (Napoleon).\n\n","date":"October 8, 2014 at 4:38 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160343","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David Mo you can wrong in your opinion no in your fact.\nYou most misleadingly wrote: “114 coins” on the floor or at the entrance of the tomb are irrelevant here”. Shall I repeat,   among the114 coins found, Jason’s Tomb IN JERUSALEM yielded more than 55 coins (among which no less than 28 Pilate coins), most were at the feet and nearby the body remains and  in the Caiaphas tomb IN JERUSALEM, an Agrippa I prutah/dilepton was found in a skull. This is relevant (cannot you archaeological fact that are contrary to your agenda?).\n\n","date":"October 7, 2014 at 11:42 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160147","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: David Mo you can BE wrong in your opinion noT in your fact.\n\n","date":"October 7, 2014 at 11:43 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160148","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Response to Hugh:  I see the debate as relevant because it has been argued that placing coins on the eyes is confined to pagan or Hellenistic burials, NEVER to orthodox Jews, and therefore the images of coins CANNOT be on the Shroud, as this is alleged as being an orthodox Jewish burial.  There are obvious errors in that argument.  \nWay back on Oct 5, 11:05 am, O.K. provided a reputable source saying that it was an Orthodox practice, and gave an explanation for it, whether or not the source is accepted, or perhaps rejected because it did not suit David Mo’s point of view.  Max has provided a number of Jewish examples where coins have been found in skulls, or in ossuaries, or in sarcophagi, and this is at least suggestive that the practice was at least sporadic if not more frequent.  The fact that not all cases were found on the eye sockets is easily disposed of because afterwards the bones were placed in ossuaries and there was then no point in replacing the coins on the eye sockets.   Furthermore, members of Jesus’ burial party may have been influenced by Hellenist customs.  \nI agree that the Domenico counterexample of there being very few shrouds found in Jewish burials is not relevant, for the simple reason that it was more common at that time for the bones to be placed in ossuaries, and it would seem that any remnants of burial shrouds or other burial garments would have then been normally disposed of, possibly burnt.  The TS survived only because its occupant vacated it, presumably due to his resurrection, and it remained intact.  \nTherefore the question of images of coins on eyes remains a viable hypothesis.  Max and some others claim that they have discerned such images, while others do not.  Note that Giovanna De Liso in her seismic experiments obtained an image of a metallic object (a key), so that apparently an image causing object does not need to be organic.  I think that’s about as far as the debate may take us.  The images of coins on eyes remains as a possibility and can only be denied if it can be conclusively shown that the images do not in fact exist.  On this last point, opinion remains divided.\n\n","date":"October 7, 2014 at 3:14 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160187","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Two further points concerning this debate: \n1)  The coins on the eyes are said to be those issued by Pontius Pilate, and are said to show his lituus and initials of the Roman Emperor.  In that case, anti-authenticists have a vested interest in demonstrating that the coin images are not present, and their arguments are therefore loaded.  Conversely, authenticists who claim the images are present also have an interest as it would strongly support the argument for authenticity.  The argument is therefore more than merely academic, but its resolution in favour of the images being present would be decisive in resolving this issue.  \n2)  The question of the coins bearing an image and therefore not appropriate for Jewish burials or other use, will not hold water.  The census tax of one denarius, clearly has an image of Caesar (Mt 22, Mk 12, Lk 20), the Pharisees can readily procure one when asked to be shown it, so that the coins were clearly in common use.  Likewise the temple tax of two drachma (Mt 17) would also presumably have an image on it, and Peter is to give a four drachma coin out of the mouth of the fish he catches to the temple officials to pay the tax for  both Jesus and himself.\n\n","date":"October 7, 2014 at 5:23 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160210","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"” … for the simple reason that it was more common at that time for the bones to be placed in ossuaries. ”\nthe bones were placed in the ossuaries after one year of burial. In tombs excavated we find both skeletons in their coffin or loculus and the ossuaries.\n\n","date":"October 8, 2014 at 4:48 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160349","author":"domenico","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Daveb: Frazer is not a source. He was speaking on orthodox Jews in the nineteenth century. It is not whether I like him or not.\nIt is not a debate of sceptics versus believers. Some relevant sindonists don’t support the theory.\n\n","date":"October 8, 2014 at 4:58 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160352","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"The fact remains that coins have been found in and around ossuaries and other funerary sites of the 2nd Temple period.  Frazer’s explanation offers a non-pagan rationalisation of the custom of placing them on the eyes of Jewish corpses, 2nd Temple period, 19th century or at any other time.  After the bodies decayed, there was little point in replacing them on the eye sockets from whence they had fallen, assuming the sites had not been pillaged by grave robbers.  I did not comment on whether you liked Frazer or not, but that it did not suit your particular point of view on the matter.  It seems fatuous to argue that it was not at least an occasional custom, and that it never occurred at all among devout orthodox Jews, when there’s evidence of the presence of coins at some funerary sites of this period.\n\n","date":"October 8, 2014 at 7:02 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160376","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"“…and that it never occurred at all among devout orthodox Jews”. If you have not any evidence (first century, please), why we have to accept your speculations?\nThe topography of Jesus’ preaching and disciples’ social background exclude the Hellenization. And coins in the mouth, not the eyes, was a Hellenistic influence. Whether implied in some pagan beliefs or not is irrelevant here again.\n\n","date":"October 8, 2014 at 11:11 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160415","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder for David Mo: Yeshua’s secret Hellenistic Judean disciples (among whom were Nicodemus and Joseph most likely along with 3-4 other buriers) buried their master not Yeshua’s Galilean disciples (the latter kept hidden indoors). Do your homework before passing comments, please.\n\n","date":"October 8, 2014 at 11:34 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160420","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David Mo wrote: “Some relevant sindonists don’t support the theory.” \nThe true fact is the presence or absence of partial coin impressions on the eye areas has not yet been convincingly demonstrated by either side and good archaeology just cannot totally ruled out sporadic placing of coins over the deceased eyes in the Second temple period.\nRe the interpretation of the suspected areas, most of the archsceptics (whether authenticists or anti-authenticists) either  haven’t got the initiated eye for paleographic forms and the first clue about what good archaeology is all about or are speaking out of their field and wrong.\nReminder: an American professional numismatist, two Israeli scholar numismatists and three ancient coin collectors and amateur numismatists (among whom a Pilate coin specialist) more ‘sensed’ than correctly identified the tiny markings left by a Pilate coin obverse (dilepton lituus type) on the right eye area. Thus the presence of the Pilate coin on the right eye is independently ‘sensed’/confirmed by at least 3-4 ancient coin experts/specialists. The only snag is correct and rigorous identification of the tiny markings is still desperately wanting.\nIMHO, as a professional cryptologist, methinks I have reached the Holy Grail of evidence that leads to conclusively demonstrate (from authentic TS face photographs by Enrie, Miller and Durante) the presence of partial markings (most likely tiny blood plasma and bloodstain patterns) left by two Pilate coin obverses (dilepton lituus and lepton simpulum types).  However to complete my research paper and convincingly prove beyond the shadow of a rational doubt partial Pilate coin impressions are really on the TS face, I do need to double and triple check my findings from HD authentic/first generation slides and/or digital copies of at least (i.e. irrespective of the 2008 HAL9000 Sindon face photographs):\n 1/- 1978 Miller traditional silver UV AND B&W TS face photograph (the latter printed on the back cover for Ian Wilson’s 1978 book The Shroud of Turin: The Burial Cloth of Jesus Christ? \nAND\n 2/- 2002 Durante extensive digital TS face photograph (the latter separately printed in Giulio Bruno Barberis & Massimo Bocaletti’s book Il caso Sindone non è chiuso, 2010, San Paolo Edizioni (January 1, 2010)\nCould somebody help me there (Dan could give them my email)? Thank you in advance for your help.\n\n","date":"October 8, 2014 at 7:24 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160381","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Max; I’m not be able to compete neither with your “chryptologic” capacities nor your anonym quotations. Could you be more precise, please? I had made you a question and it will be good resolve our debate before opening new items. (October 8, 2014 at 5:13 am)\n\n","date":"October 8, 2014 at 11:24 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160417","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"On October 7, 2014 at 11:20 am I added:\n“re what Hachlili (following Rahmani) thinks results from the placing of a coin in the mouth of STP deceased as payments to Charon (Charon’s obol), she wrote: “As Jews were often influenced by the surrounding Hellenistic culture, ON OCCASION they ADOPTED (my upper cases) Hellenistic practices and customs WITHOUT ACCEPTING necessarily their pagan significance.” (ibidem p. 441). (I mentioned the page number!)\nOn October 2, 2014 at 7:55 am and June 21, 2013 at 12:20 pm replies I wrote: \n(“Methinks this is not only a bit too short but also quite convoluted.\nHow long shall I have to repeat” = and thus QUOTING MYSELF): \n“in the context of a Judean burial of the Second Temple period, the Charon’s obol theory is a most unconvincing explanation as it creates more questions than answers and has a potential to mislead. For instance, in the Jericho D/18 tomb case, WHY EXACTLY a Judean burier or mourner would have felt the need to place two coins instead of only one in the deceased’s mouth as Charon’s obol? Would the two coins have been intended for a return trip? In the Caiaphas’ daughter’s intact skull case, WHY EXACTLY would a high priest family of Jerusalem have felt the need to recur to the pagan custom to bury one of its deceased members (Sadducees did not believe in resurrection or life after death!) ? It actually verges on sheer anachronism. Therefore, it would be good archaeology to integrate the forensic datum to reassess past findings and keep an open mind for the coin-on-eye issue in connection with the Turin Shroud?” \n“Methinks that recurring to an alleged ‘Charon obol’ to account for the coins found in STP Judean skulls just doesn’t fit.”\nDon’t you mistake me repeating what I said in the very recent past with alleged ‘anonymous quotes’, please!\n\n","date":"October 8, 2014 at 12:18 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160429","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"You don’t need to repeat the paragraph. I’m asking you for a precise quotation of it, what is to say, the number of page. If it is extracted from the Hachlili’s book, of course. I ask you because I have found some differences between your words and the text. Perhaps I have not found the precise quotation and so I ask you.\nThank you.\n\n","date":"October 9, 2014 at 4:36 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160596","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Max: Arimathea and Nicodemus are just legendary characters. I.e: very improbable. And the gospel legend says nothing of “Hellenistic disciples”.\n\n","date":"October 9, 2014 at 4:45 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160598","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David Mo, are you kidding?  \nNicodemus/Naqdimon/Naqi is even mentioned in the Talmud Babli as a Hellenistic Judean! Besides I myself have identified Joseph of Aramathia with Joseph Barnabas as a Hellenistic Judean from Cyprus (see my 2005 unpublished paper “Linceul de Turin : L’Eloge Funèbre du Christ Retrouvée ? ou Tentative de décrytptage d’un très singulier rébus monétaire”). \nShall I endlessly repeat:\nThe placing of Pilate coins over the TS man’s eyes on his burial correlates with:\n1/- the Halakha (or Jewish/Judean religious law) re the closing/covering of the deceased’s eyes so they won’t be open because as long as they can see the present duration they cannot see the duration to come (see the Mishnah).\n2/- archaeological finds of nearly four dozens of Pilate coins in Second Temple period tombs (see Rachel Hachlili’s book) implying they were used in a funerary practice or practices.\n3/- Anatomothanathology since via a ‘piggy-bank effect’, small thin coins such as Pilate coins can drop through the skull’s orbital fissures and fall in the oral cavity or brainpan of the deceased as the body decays (see American MD, Alan Whanger’s & ancient coin Italian collector, Mario Moroni’s experiments).\n4/- the Gospels since Hellienistic Judeans (most likely liberal Pharisees from Sadduceean background)  buried Yeshua‘ (NOT Galilean buriers).\n\n","date":"October 9, 2014 at 5:47 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160610","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"BTW Nikodemos is Boni ben Gwryon’s Greek nickname for Naqdimon (full for Naqi).\n\n","date":"October 9, 2014 at 6:06 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160618","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Addendum: \nIt also correlates with\n5/- the very fact that at least 3-4 ancient coin experts/specialists (one American professional numismatist, two Israeli scholar numismatists and three ancient coin collectors and amateur numismatists (among whom a Pilate coin specialist) independently did ‘sense’ (more than correctly identify) the presence of the Pilate coin on the right eye.\n\n","date":"October 9, 2014 at 7:04 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160636","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"If you think (like Dan) the placing of coins over the TS man is unlikely and ‘the sensing’ Pilate coin very partial impressions by 3-4 ancient coin experts/specialists just crazy stuff, just ask yourself if YOU really have got an eye for paleographic forms and really can discriminate between misreading, negative and positive pareidoliae. Just ask yourself what really is GOOD archaeology and you may get the answer.\n\n","date":"October 9, 2014 at 7:21 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160637","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Yannick Clément too, should ask himself those three very simple questions and try to honestly answer them for a change.\n\n","date":"October 9, 2014 at 7:29 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160642","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"“Put that in your pipe, (David Mo), and smoke it”\n\n","date":"October 9, 2014 at 5:51 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160786","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Don’t you read what is wrote by others or do not understand how to do a quotation? I asked you a simple question. Pages and names.\n\n","date":"October 9, 2014 at 10:41 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160682","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"“¡Mecachis, qué guapo soy!” (Untranslatable)\n\n","date":"October 9, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160785","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Should I assume that your quotations were retouched?\n\n","date":"October 10, 2014 at 4:18 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160930","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"My quotations (from Hachlili’s book) are NOT RETOUCHED. Just buy and read the book before passing comments, please.\n\n","date":"October 10, 2014 at 4:23 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160931","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Max, is a simple photograph of one of the pages a possibility? I’ll post it.\n\n","date":"October 10, 2014 at 4:35 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160934","author":"Dan","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Dan, which specific page do you want me to photocopy? Give me an accurate page number, please.\n\n","date":"October 10, 2014 at 5:36 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160948","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Dan; the photograph will be welcome; however I have the book. Only a page number suffice to me. I don’t understand the problem.\n\n","date":"October 10, 2014 at 7:05 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160974","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"This is nonsense.  There are certainly various legends concerning both, but that they were real persons is more probable than not, and certainly not “very improbable”.  There is a weak argument that Joseph of Arimathea was created to fulfill the prophecy Isaiah 53: “He was assigned a grave with the wicked, and with the rich in his death, though he had done no violence, nor was any deceit in his mouth.”  But none of the four gospel writers make a point of citing this prophecy in reference to Joseph, not even Matthew who usually makes a point of saying so.  All four evangelists mentions Joseph, their stories concerning him are consistent, including John who hardly ever otherwise seems to use the synoptics.   He is also referred to in early 2nd century apocrypha, including the Acts of Pilate, and its appendix the Gospel of Nicodemus.  He is referred to as a real person in the early Church historians: Irenaeus, Hippolytus, Tertullian and Eusebius, adding details not found in the canonical works.   Certainly Arthurian legends developed about him in the 12th century, but none of them form part of the Anglican canon.  \nJohn’s gospel is the only one to mention Nicodemus, but does so in respect of three separate occasions: Visits Jesus secretly at night to discuss his teachings Jn 3:1-21;  States the Law re Jesus arrest on Feast of Unleavened Bread Jn 7:45-51;  Finally assisting Joseph at the burial bringing some 75 lbs of spices Jn 19:39-42.  There is little there that does not have the ring of truth, and the details given are such that it seems probable.  He is also mentioned in early apocrypha.  To assert that Nicodemus is an invention of John, is gratuitous and with no foundation.\n\n","date":"October 9, 2014 at 5:56 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160613","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I think Arimathea as an expedient to support the narrative of the Resurrection. He is not mentioned by Paul and Acts says the that the same Jews that killed Jesus buried him (Acts 13: 28, if I remember correctly). Otherwise, Jesus would have been buried in a common grave. Some contradictory features surround Arimathea. Some Christians historians, as John Dominic Crossan think as me.\nI don’t think here is the correct place to discuss this point.\n\n","date":"October 9, 2014 at 10:53 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160688","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"If you did not want to discuss it here, then you ought not to have raised such a provocative challenge!\nCrossan is a controversial and ultra-liberal scholar, who also claims that the body of Jesus was fed to dogs.  If you want to follow him then that’s your choice. \nThe correct reference is Acts 13:29.  It is part of Paul’s very succinct history(?) summary address in only about 14 verses from the time of the Exodus to the witnesses of Jesus’ Resurrection.  Paul is often vague about the details of Jesus’ life and death, and is evidently unaware of much of them.  Book of Acts is claimed to have been written by the same author as Luke’s gospel, and Luke is specific about Arimathea.  Other writers support the existence of Arimathea as a real person. \nYour case fails!\n\n","date":"October 9, 2014 at 3:11 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160748","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"The nature of the Passion narrative is not a “provocative challenge”. It is an ordinary issue between scholars. Crossan is Christian. Whether he is “ultra-liberal” or orthodox is not relevant for assessing his work.\nLuke contradicts himself in several passages of his gospel and Acts. This (Joseph of Arimathea versus “the Jews”) is one. The fact casts some doubts about the actual existence of this character. These doubts grow with other contradictory depictions of him and with the evident justificatory nature of his appearance.\nIf you find scandalous these points, you are adopting a close-minded stance. I’m sorry.\n\n","date":"October 10, 2014 at 4:09 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160927","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I think you are the one who has a closed mind in this matter in that you assert that Arimathea and Nicodemus are legendary characters on the most slender of evidence.  Let us examine that.  Obviously if Jesus was buried, and the gospels and the weight of ecclesial tradition, and the creeds, and the early church historians, all assert that he was.  In that case there had to be a burial party.  You assert that it was the executioners, on the basis of a trite summary given by Paul, bereft of any detail, written up by Luke in Acts 13:29.  The only places that executioners buried crucifixion victims, was in a common grave accessible to wild animals, or in the common sewer.  In that, you are following Crossan.  You reject four gospel accounts that are all consistent with one another, and you reject the evidence of early church historians.  Why?  Only because there had to be a burier, the gospels identify him, and you say that this is therefore a convenience to sustain the narrative.  Obviously your argument is circular!  There had to be a burier;  the four gospels identify him; therefore it is not him because it merely sustains the narrative!!?? \nBarbet in his chapter 2.5 cites several Roman historians that make it clear that families could ask for the bodies of those crucified, and this would not normally be refused; he cites Cicero who castigates Verres for extortion on this matter which is against the law,  The gospels identify who asked for the body of Jesus and that was Joseph of Arimathea.\n\n","date":"October 10, 2014 at 5:48 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160954","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David Mo,\n First do your home work about Second Temple period Hellenistic Judeans in the Second Temple period,  The Gospels, The Acts and the Talmudic literature before passing comments, PLEASE. \nI repeat: Boni ben Gwryon aka Naqdimon/Naqi/Nikodemos/Nicodemus is well known as an Hellenistic Judean (see Talmwd Babli). He was one of Yeshua’s buriers.\nRe Joseph Aramathea,  Aramathea comes from Ha-Ramathaym in Hebrew. Litterally it means “The Two Heights” and most likely this designation doesn’t so much refer to a city as to the known fact among Yeshua’s disciples, Yoseph Aramathea had a garden (with a cave-tomb under a vine and a figtree) on Mount Golgotha and an olive field on Mount Olive i.e on two Jerusalem mounts or “two heights”. This is my own etymocryptology of  Aramathea. Now its very transcription in Greek as Aramathia is a Hebrew-Greek pun on the phrase, aristos mathetes, “best disciple”. Most likely alike Nikodemos/Naqdimon he was a Hellenistic Judean Besides most likely Joseph Aramathea and Joseph Barabas are one and the same man.  most likely aka Joseph of Aramathea) and was a rich man and a Levite from Cyprus (see my 2005 unpublished paper in French “Linceul de Turin : L’Eloge Funèbre du Christ Retrouvée ? ou Tentative de décrytptage d’un très singulier rebus monétaire”). \nTherefore BOTH Nicodemus and Joseph of Aramathea were Hellenistic Judean (most likely liberal Pharisees from Sadduceean background).\nThis is consistent with the placing of Pilate coins over their master’s eyes all the more so as: \n1/- on March 14, 2014 at 5:22 pm I wrote:\n“Symbolically speaking, Pilate coin central devices were NOT OFFENSIVE since they were specifically designed (or ambivalent enough) to agree with both 1st c CE Judean and Roman sensibilities. Could people stop indulging in a 20th c CE received idea (again) about Pilate coins and poison the well?.”\nIn other words Pilate coins obverse central devices were/are not pagan per se. This is a myth. Besides the lituus and simpulum shapes can combine to evoke the two libation vessels used to mix wine and water in the Jerusalem Temple. They are ambivalent/neutral isolated simplified symbols to agree with both 1st c CE Judean and Roman sensibilities. Had Pilate coins feature really offensive central devices, they just could not have been used by Judeans, which is not the case. They were even used in the Jerusalem Temple treasure chamber and on burials (see Hachlili’s book)\n2/- Most likely too Yosseph Ha-Ramathaym aka Yossef Bar Naba as Hakham/Old wise man, Yeshua’s secret disciple and burier placed himself the Pilate coins over Yeshua’s eyes on burial since the very name Yossef was given to the eldest son (ben)/disciple(talmid) for him to close not only his father’s eyes but also his master’s (aka Yeshua Ha-Nostry’s/Jesus of Nazareth’s) on their death.\n\n","date":"October 10, 2014 at 5:30 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160946","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: Besides most likely Joseph Aramathea and Joseph BarNabas are one and the same man. \nDan, my previous comment is awaiting moderation, can you please account for this?\n\n","date":"October 10, 2014 at 5:33 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160947","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder for Dan and David Mo: \nHere are my quotations from Hachlili’s book Jewish Funerary Customs, Practices and Rites in the Second Temple Period . \n“As Jews were often influenced by the surrounding Hellenistic culture, ON OCCASION they ADOPTED (my upper cases) Hellenistic practices and customs WITHOUT ACCEPTING necessarily their pagan significance.” (ibidem p. 441). (UNTOUCHED except for my upper cases)\nHachlili also wrote: “This (referring to three instances of coins associated with skulls) MIGHT have been (MIND not “WAS”!) inspired by the pagan Greek custom (Charon’s)”. (UNTOUCHED except for my upper cases)\nActually she just cannot convincingly state whether the Greek custom was literally applied as such or totally revisited and in which way. (my comment)\n“The placing of coins over the eyes is reported in only one case at ‘En Boqeq (furthermore, it is highly doubtful the interred at the site was a Jew)” (dixit Hachlili on p. 443). (UNTOUCHED)\n“Although during the past century HUNDREDS OF TOMBS DATING FROM THE SECOND TEMPLE DOWN TO THE LATE ROMAN PERIOD have been excavated or surveyed, coin are a rare occurrence.” (dixit Hachlili p. 437, ibidem). (UNTOUCHED except for my upper cases)\nHachlili’ conclusion: “Jews quite rarely used items with pagan characters as grave goods: the example consist mainly of ring gems AND COINS” (see p. 445). (UNTOUCHED except for my upper cases)\nIn other words irrespective of Hasmonean and Herodian coins, procurator/Pilate coins were used by Judeans in a Second Temple period funerary practice or practices. The latter have still to be convincingly cleared up. (my comment)\netc.\nHope you can face archaeological facts and  discriminate between facts and their interpretation.\n\n","date":"October 10, 2014 at 6:20 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160961","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Addition: Re the 124 coins found in Second temple period tombs see table X-9 p. 434 ibidem.\nRe the 55 coins found in Jason Tomb see table X-2 p 423 ibidem.\n\n","date":"October 10, 2014 at 6:30 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160966","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder for Dan and David Mo: THE SPORADIC USE OF (Procurator/PILATE) COINS (besides Hasmonean and Herodian coins) IN SECOND TEMPLE PERIOD FUNERARY JUDEAN RITUAL is attested by archaeology.\n\n","date":"October 10, 2014 at 6:40 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160968","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"“Obviously if Jesus was buried, and the gospels and the weight of ecclesial tradition, and the creeds, and the early church historians, all assert that he was.”\nObviously. Your sources are unappealable.\n\n","date":"October 10, 2014 at 7:13 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160977","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Hi Mo!\nMost of “Jewish Funerary Customs, Practices And Rites In The Second Temple Period” can be found at http://books.google.co.uk, and purported extracts can be looked up. Which of Max’s quotes would you like confirmed or denied?\n\n","date":"October 10, 2014 at 7:57 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-160993","author":"Hugh Farey","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Hello Hugh: Jericho D/18 tomb:  two coins  in the deceased’s mouth? and\nCaiaphas’ daughter’s intact skull case.\nI insist: I have the book and I cannot find these details. I found some references to Jericho’s D18 and Caiaphas’ tombs but not exactly these quoted by Max. It will be useful that Max provide me with the data instead to be obliged to continue the search. But he has a problem that I don’t understand.\n\n","date":"October 10, 2014 at 10:15 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161031","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Mais c’est pas grave!\n\n","date":"October 10, 2014 at 10:16 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161032","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reference 1: Jericho D18. Hachlili makes clear that two coins were found in the tomb, one in a damaged skull and one on the floor. (Page 439 in the Googlebooks edition) Unless Max has a different source, he is mistaken in saying that two coins were found in the skull.\nReference 2: Caiaphas’ daughter’s intact skull. There in no specific mention of any intact skull in Hachlili’s book. However, an intact skull “of a woman in Ossuary 8 of the Caiaphas family tomb” is implied in a paragraph on Page 443. A passage on Page 266 says, “Two inscriptions, 4 and 7 (on ossuaries 5 and 8) are incised with the names of women: [Hebrew text] ‘Miriam daughter of Shim’on’ and [Hebrew text] ‘Shalom.’ There is no obvious suggestion that either of these women were daughters of Caiaphas, however.\nI hope this helps!\n\n","date":"October 10, 2014 at 10:56 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161040","author":"Hugh Farey","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Exactly!\nI sincerely believe that Max is wrong or he “retouchs” the quotation. I have just consulted Rachel Hachlili and Ann Killebrew:  “Was the Coin-on-Eye Custom a Jewish Burial Practice in the Second Temple Period?”, The Biblical Archaeologist, Vol. 46, No. 3 (Summer, 1983), pp. 147-153. The authors claim that the tomb D / 18 Jericho had only two coins. One among the debris and the other on a skull “damaged” (p. 148). Nothing to do with descriptions provided by Max. I don’t want to do any assessment.\n\n","date":"October 10, 2014 at 11:08 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161046","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"On September 30, 2014 at 6:03 am, I wrote:\n“(…) at close examination, in the context of a Judean burial of the Second Temple period, the Charon’s obol theory is a most unconvincing explanation as it creates more questions than answers and has a potential to mislead. For instance, in the Jericho D/18 tomb case, why exactly a Judean burier or mourner would have felt the need to place two coins instead of only one in the deceased’s mouth as Charon’s obol? Would the two coins have been intended for a return trip? In the Caiaphas’ daughter’s intact skull case, why exactly would a high priest family of Jerusalem have felt the need to recur to the pagan custom to bury one of its deceased members? It actually verges on sheer anachronism. Therefore, it would be good archaeology to integrate the forensic datum to reassess past findings and keep an open mind for the coin-on-eye issue in connection with the Turin Shroud.”\nI ONLY made a typo: “For instance, in the Jericho D/18 tomb case, why exactly a Judean burier or mourner would have felt the need to place two coins instead of only one in the deceased’s mouth as Charon’s obol?” should have read in reference to the Jericho tomb D3. That’s all.\nOn page 439 Hachlili does write: “Two bronze coins were discovered in Jericho tomb D3 (Tomb Type II). THE COINS WERE FOUND STUCK TOGETHER IN A SKULL (my upper cases) uncovered in kokh 1 (Pl. X-11)”\nEach time a coin is found in a damaged Hachlili specifies it (STILL on p. 439): “One bronze coin of Herod Archelaus (‘ BCE-6 CE) (Pl. X-9) was found in THE DAMAGED SKULL (my upper cases) of a coffin buial in tomb D18 on the west bench of the chamber.”\nWhen the skull is intact, methinks she just writes “in a skull” (see  p 439 quotation above). Second instance: on p 438  she writes: “A coin of Aggripa I was foundIN A WOMAN’S SKULL  in Ossuary 8”.  Had the skull been damaged, she would have written “in a damaged skull” instead.\nDavid Mo, Methinks you are just clinging at gnats for lack of real data to substantiate your stand and your are wrong.\n\n","date":"October 10, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161075","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder: I am used to type in a hurry\n\n","date":"October 10, 2014 at 1:07 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161077","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Thank you anyway for correcting my typo D18 for D3.\n\n","date":"October 10, 2014 at 1:20 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161079","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: Thank you anyway for having me correct my typo D18 for D3\n\n","date":"October 11, 2014 at 4:53 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161269","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Max: If you had answered to my questions before we wouldn’t have lost our time. You have made both a mistake and a retouch as I supposed. The mistake: you are referring to Jericho D3 tomb, not the “D/18”. In addition, “Caiaphas’ daughter” is inexistent. The retouch: you added “intact” skull where Hachlili says nothing. However, the point is not whether the skull was intact or not, but its location. Jericho D3 is a secondary burial, it is to say, a tomb where the bones are translated and replaced (p. 504). In D3 the bones are not replaced in coffins, but piled on the floor, as you can see in p. 505. Distinguishing whether the two coins were placed on the skull or had got inside in the successive manipulation of the bones is impossible.\n\n","date":"October 11, 2014 at 4:57 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161272","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David Mo,\nShall I remind you AGAIN AND AGAIN, that anatomothatologically speaking, the finding of two coins stuck in a skull (most likely an undamaged one see my previous comment on Hachlili) DOES NOT imply EITHER the coin shall be associated with an obol to Charon! Far from it.\nI DID NOT RETOUCH Hachlili’s quotation (it was not a direct quote). The fact remains when she refers to ‘a skull’ and not ‘a damaged skull’ (as she used to do i her book and articles), most likely she is referring to an undamaged or intact skull whether you like it.\n\n","date":"October 11, 2014 at 12:14 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161354","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"…or not.\n\n","date":"October 11, 2014 at 12:15 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161355","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder for David Mo: \nIn 1990, a coin was found in the skull of a woman in ossuary 8 in the Caiaphas family tomb (no matter whether the woman’s was Caiaphas granddaughter, daughter, mother, sister or wife). The main point is the fact (‘a coin found in a skull) cannot be denied. The main issue is this: Israeli archaeologists Greenhunt and Horbury  explained it methinks too quickly and unconvincingly as a coin placed in the mouth  as a payment for Charon (obol to Charon) i.e. a very rare and heretical funerary ritual (Charon’s obol) when actually there is an alternative explanation the two Israeli archaelogists totally missed: anatomothanathologically speaking, the coin in skull could result from the placing of the coin on one of the deceased’s eye as well (along with a second coin on her other’s eye; a coin that was displaced or lost now). The substance of the issue remains the same.\n\n","date":"October 11, 2014 at 12:54 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161364","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Addition: most likely an undamaged skull…\n\n","date":"October 11, 2014 at 12:56 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161366","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"…if we rely on Hachlili’s book “forensic linguistic”.\n\n","date":"October 11, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161369","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Max: Your arguments are based  again and again on unwarranted suppositions.\nHachlili explicitly says that most ofthe  skulls with coins inside are damaged (p. 485). She mentions about a dozen of skulls and only uses “damaged” in one case. You cannot suppose that the word “skull” without adjective implies that the skull is intact.But I insist: this is not the point.\nThe “Caiaphas” tomb is not attirbuted to the High Priest. See p. 267-8. You cannot conclude anything based on this false supposition. \nThe alleged practice to place coins in the eyes is not supported by any evidence. The practice to put a coin in the mouth is well tested  in the Hellenistic world. The latter is a very more likely explanation of the indisputed fact that some coins has been found into skulls. \nAnd so and so.\n\n","date":"October 12, 2014 at 4:52 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161573","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"BTW Maryam granddaugther ‘s Caiaphas decorated ossuary bears stylized floral motives of crown daisy heads that do echo the two crown daisy heads I spotted on Tamburelli’s 3D reconstruction of a TS face  closed-up (just in case you have eyes to see).\n\n","date":"October 11, 2014 at 1:30 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161375","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Does anyone else share my hypothesis that Max Patrick Hamon’s contributions are spoof ones, deliberately obscurantist nonsense to see how far he can wind everyone up?\n\n","date":"October 11, 2014 at 2:29 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161388","author":"Charles Freeman","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Does anyone else share my hypothesis that Max Patrick Hamon’s contributions are spoof ones, deliberately obscurantist nonsense to see how far he can wind everyone up?\nI have a feeling that yours are the same, Charles.\n\n","date":"October 11, 2014 at 2:36 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161389","author":"O.K.","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I also agree with your point of view Charles.  And I would add this: I think that Max got way too much imagination and let it interferred a lot into what should be an honest quest for truth.  And sadly, I think he’s not the only one who suffer of this kind of “unscientific disease”…  We simply have to look at all the nonsense that has been written and proposed over the years concerning the Mandylion being the Shroud folded in 8, as well as all the crap that has been published since the C14 result came out in 89 concerning the Shroud image having been produced by some sort of a burst of energy at the exact moment of the Resurrection (two proposals that do not find any real credible support from the sum of all the known and soid data relevant to these subjects) to understand that many other Shroud researchers are sufferring of the same bad disease, which contribute each day to discredit the credibility of Shroud science in the eyes of the international scientific community…  As Leadbelly sung: Ain’t that a shame???\n\n","date":"October 11, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161423","author":"Yannick Clément","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"I think Max winds himself up more than anyone else. :)\n\n","date":"October 12, 2014 at 9:09 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161647","author":"David Goulet","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Charles you are very good at  seeing the speck in your neighbor ‘s eye, but not the beam in yours.\n\n","date":"October 12, 2014 at 11:34 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161679","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"The irony is you took up my contribution on the tetradiplon issue to make it yours!\n\n","date":"October 12, 2014 at 11:39 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161681","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Besides methinks you do have to ‘wind up’ with people who, in bad faith or misinformed on a regular basis and/or speaking out of their field of expertise (if really any), keeps attacking you on trifles while keeping ignoring the facts against their opinion/hypothesis and totally ruling out real alternative possibilities to stick to pseudo final words.\n\n","date":"October 12, 2014 at 11:53 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161686","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Methinks Charles Freeman, Yannick Clément and David Mo are speaking out of their field of expertise if they have got any and keep ignoring FACTS. This is their main HEAVY DESEASE not mine! They just see the speck in their neighbor ‘s eye, but not the beam in theirs. \nSince most of the time I write from memory AND in haste (having breaks in snatches while working) ChF, YaC and DaM, allow me to do typos et don’t you make too much of them. Methinks because the three of you just cannot substantially refute facts, you make ad homs. Your lack of true research and studies on the coin and floral image issue does show.\nReminder: Most NOT ALL the excavated skulls were found in a damaged condition.\nONE coin of Agrippa I was found “in a woman’s skull” (dixit Hachlili) (NOT in a woman’s damaged skull”) in ossuary 8 from the CAIAPHAS TOMB, Jerusalem (p. 438).\nTWO coins were found in the Jericho D3 tomb. My typo is on the tomb reference (D/18 for D3) (just typing in haste from memory) NOT on the fact two coins were found stuck “in a skull” (dixit Hachlili)!\nONE coin was found in Jericho D18 tomb “in a damaged skull” (dixit Hachlili) (p.439).\nNow can ChF, YaC and DaM tell me why on pages 438 and 439 of her book, Hachlili linguistically DISCRIMINATE between “coin found in damaged skull” (p 439) and “coin found in a skull” (p. 438) ? This is not clear. Had the skull found in Caiaphas tomb been damaged, why doesn’t Hachlili specify it on page 438? Methinks it was good forensic linguistics to infer in the woman’s skull case was either undamaged or slightly damaged that is intact or fairly intact as opposed to those found in Jericho. \nBesides, I shall repeat, the placing of Pilate coins over the TS man’s eyes on his burial correlates with:\n1/- the Halakha (or Jewish/Judean religious law) re the closing/covering of the deceased’s eyes so they won’t be open because as long as they can see the present duration they cannot see the duration to come (see the Mishnah).\n2/- archaeological finds of nearly four dozens of Pilate coins in Second Temple period tombs (see Rachel Hachlili’s book) implying they were used in a funerary practice or practices.\n3/- Anatomothanathology since via a ‘piggy-bank effect’, small thin coins such as Pilate coins can drop through the skull’s orbital fissures and fall in the oral cavity or brainpan of the deceased as the body decays (see American MD, Alan Whanger’s & ancient coin Italian collector, Mario Moroni’s experiments).\n4/- the Gospels since Hellenistic Judeans (most likely Yeshua’s buriers were liberal Pharisees from Sadduceean background. They were NOT Galilean or conservative Pharisees buriers).\n5/- the very fact that at least 3-4 ancient coin experts/specialists (one American professional numismatist, two Israeli scholar numismatists and three ancient coin collectors and amateur numismatists (among whom a Pilate coin specialist) independently did ‘sense’ (more than correctly identify) the presence of the Pilate coin on the right eye.\n“Put that in your pipe, (Charles Freeman, Yannick Clément, David Mo), and smoke it!\nIf you still think the placing of coins over the TS man’s eyes is unlikely and ‘the sensing’ Pilate coin very partial impressions by 3-4 ancient coin experts/specialists just ‘crazy stuff’, just ask yourself if YOU really have got an eye for paleographic forms and really can discriminate between misreading, negative and positive pareidoliae. Just ask yourself what is really GOOD archaeology all about. Methinks Charles Freeman, Yannick Clément and David Mo should ask themselves those three very simple questions and try to honestly answer them for a change.\nDavid Mo you wrote: “Max: Your arguments are based again and again on unwarranted suppositions.” Oh really? What about yours?\nShall I repeat my stand (typos corrected): \nIn the context of a Judean burial of the Second Temple period, the Charon’s obol theory is a most unconvincing explanation as it creates more questions than answers and has a potential to mislead. For instance, in the Jericho D3 tomb case, WHY EXACTLY a Judean burier or mourner would have felt the need to place two coins instead of only one in the deceased’s mouth as Charon’s obol? Would the two coins have been intended for a return trip? In the Caiaphas’ tomb (intact?) skull case, WHY EXACTLY would a high priest family of Jerusalem have felt the need to recur to this very rare heretical  practice to bury one of its deceased members since Sadducees did not even believe in resurrection or afterlife!) ? Methinks it verges on sheer anachronism. Therefore, it would be good archaeology to integrate the forensic datum to reassess past findings and keep an open mind for the coin-on-eye issue in connection with the Turin Shroud?”\nCould ChF, YaC and DaM answer those questions and spell them, please?\nOn October 7, 2014 at 11:20 am I added:\n“re what Hachlili (following Rahmani) thinks result from the placing of a coin in the mouth of STP deceased as payments to Charon (Charon’s obol), she wrote: “As Jews were often influenced by the surrounding Hellenistic culture, ON OCCASION they ADOPTED (my upper cases) Hellenistic practices and customs WITHOUT ACCEPTING necessarily their pagan significance.” (ibidem p. 441). Methinks this is not only a bit too short but also quite convoluted. ChF, YaC and DaM can buy into that, I as a professional cryptoanalyst\nmethinks that recurring to an alleged ‘Charon’s obol’ to account for the coins found in STP Judean skulls just doesn’t fit somewhere along the line. The question of very partial impressions of coins on eye areas remains a viable hypothesis whether ChF, YaC and DaM ’emotionally’ or ‘viscerally’ don’t like it. \nBesides IMHO, as a professional cryptologist, methinks I have reached the Holy Grail of evidence that leads to conclusively demonstrate (from authentic TS face photographs by Enrie, Miller and Durante) the presence of partial markings (most likely tiny blood plasma and bloodstain patterns) left by two Pilate coin obverses (dilepton lituus and lepton simpulum types). However to complete my research paper and convincingly prove beyond the shadow of a rational doubt partial Pilate coin impressions are really on the TS face, I do need to double and triple and even quadruple check my findings from HD authentic/first generation slides and/or digital copies of  the Sindon face photographs, the 2008 HAL9000 TS eye areas photographs included. This would be GOOD archaeology.\nShall I remind them AGAIN AND AGAIN of Hachlili’ conclusion: “Jews quite rarely used items with pagan characters as grave goods: the example consist mainly of ring gems AND COINS” (see p. 445). In other words irrespective of Hasmonean and Herodian coins, procurator/Pilate coins were used by Judeans in a Second Temple period funerary practice or practices and the latter have still to be convincingly cleared up. To claim the opposite is BAD archaeology, which is exactly what ChF, YaC and DaM are advocating (this no surprise as they haven’t the first clue what discriminating between misreading, negative and positive pareidoliae is all about).\nTo evoke an allegedly ‘very rare heretical practice’ associated with Charon’s obol to account for the presence of coins in Second temple period damaged and/or undamaged skulls is NOT the final word/absolute truth but in ChF, YaC and DaM’s dreams. \nThe true fact is THERE IS A SERIES OF anatomothanathological (the piggy-bank effect’ with small thin coins placed over the deceased’s eyes), Halakhic (closing/covering of the eye of the deceased, see Mishnah, tract. Shabbat) and archaeological (STP tombs yielded 124 coins in trems of Hasmonean, Herodian and Roman coins , mainly Pilate coins), Literary and Numismatic EVIDENCE OF PLACING  COINS OVER THE DECEASED’S EYES CAN HAVE BEEN A SPORADIC SECOND TEMPLE PERIOD CUSTOM/PRACTICE… whether ChF, YaC and DaM just don’t like the very idea. \nWhat is really nonsensical and does a real disservice to Intellectually Honest Shroud Research and Studies is to totally rule out such a possibility and ignore what GOOD archaeology really is all about…And that’s a real shame. Shame on you!\n\n","date":"October 12, 2014 at 10:22 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161661","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"But this is a broken record!\n\n","date":"October 12, 2014 at 10:48 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161665","author":"David Mo","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"David Mo, your bad faith, making a fuss on a couple of mere typos while keeping ignoring the facts IS a broken record.\n\n","date":"October 12, 2014 at 11:01 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161669","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Still waiting for you to answer the questions I raised… if you can.\n\n","date":"October 12, 2014 at 11:04 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161670","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"It’s the word ‘ anatamothanathanogical’ , Max, that convinces me that you are making fun of us all and one day you will publish an article  in English that we can all understand mocking us all for taking you seriously when you knew you were making words up as you went along.\nDon’t worry, I really enjoy your contributions even if I can’t understand them. You have such imagination!\n\n","date":"October 12, 2014 at 2:18 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161722","author":"Charles Freeman","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Charles, if my wording “anatomothanathology” stops you, just change it for the word “thanathology” (BTW can you understand the word thanathology or just cannot you? Nope if you cannot.\n\n","date":"October 12, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161730","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo (for once more typing in haste): thanatology.\n\n","date":"October 12, 2014 at 2:54 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161734","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"BTW I wrote anatomothanatological NOT ‘ ‘anatamothanathanogical’, you RETOUCHED my wording. This is no fair play for an Englishman/a British.\n\n","date":"October 12, 2014 at 3:00 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161736","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Max, if that can help you calm down, I plaid guilty of having suffered of the same sin as yours sometimes in my inquiry about some aspects of the Shroud and truly, I think every Shroud researcher has, one day or another, let his imagination or his preconceive notions take too much place in his scientific studies… .  But, on the contrary to you, I think I’ve been able (or at least I always try hard) to get back to the FACTS AND DATA and stick to them as much as I can, even if that can eventually forces me to sometimes change my mind on one or two things.  With the Shroud, we very often deals with PROBABILITY more than sure proven facts and, because of this, I think it’s very easy for anyone to let his imagination goes wild.  That’s a real problem in the Shroud world and I think it can only get resolve when a researcher is able to put is ego on the side enough to be able to do a proper and honest evaluation of these probabilities.  \nWhen it comes to the possible presence of images of flowers and coins on the Shroud, as I said, if we’re honest in face of the FACTS AND DATA and stick to them the more we can, then we have to estimate the probability that these things are really on the Shroud (instead of being simple image artefacts) as being very low (or highly improbable if you prefer). And such an honest and therefore prudent estimation comes from 2 principal reasons that I already described in earlier comments:\n1- These kind of « procedures » were not part of the First Century Jewish culture when it comes to burial rituals, at the exception of maybe some very scarce examples here and there. And even if there could be some examples of possible uses of flowers and coins (or any other things covering the eyes) during ancient Jewish burials coming from archaeological findings, these are obviously exceptions that confirm the rule, because these things have been found in just a few cases among maybe 1000 ancient Jewish tombs that were found in Palestine.\n2- If there would have been flowers, coins or any other material things over some parts of the Shroud man’s body, including the eyes, then we must expect that absolutely no yellowing of fibers would have happened in these places, because we know for a fact that even a very thin layer of serum located between the cloth’s surface and the corpse was enough to prevent any image formation, so imagine the kind of “protective shield” a flower or a coin placed between the corpse and the cloth’s surface could have been!  As I said, there is a slim possibility that the image formation was started by some volatile and reactive burial substances that could have been sprinkled on the body (and on those hypothetical flowers and coins), but as I also said, this kind of scenario is far-fetched and should not be considered with a high level of probability.\nSo Max, I think you simply have to redo some probabilistic evaluation concerning these hypotheses of images of flowers or coins being really present on the Shroud while letting your imagination on the side…\n\n","date":"October 12, 2014 at 4:26 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161757","author":"Yannick Clément","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Yannick, \nWhat do you really know about ancient/Second Temple period rabbinic cryptographic/hermeneutic systems ? NOTHING!\nWhat do you really know about the Halakha and how liberal Pharisee (most likely from Sadducean background) could have applied it on Yeshua’s burial? NOTHING!\nHow can you tell the placing of coins over Yeshua’s eyes is not definitely ‘the exception that confirms the rule’ (to take up you phrase re the use of coins in Second Temple period funerary practices). YOU JUST CANNOT!\nCan you really discriminate between palaeographic misreading, positive and negative pareidolae? YOU JUST CANNOT!\nRe your  ‘preconceived notions’ you think you’ve left behind and are cured, methinks they STILL strongly do show in your pseudos-‘scientific studies’ (see your ‘stochastic’ image theory) and current comments. You STILL suffer from heavy diseases: you just take and leave facts according to your agenda as if you were in a supermarket; you mistake facts for their interpretation or opinion and you just ignore or overlook real alternative possibilities to yours. YOU ARE NOT CURED!\nOnce you asked me how I could account for the placing of coins over the TS man’s eyes.  I gave you a sensible reply based on the Halakha, the Mishnah, archeological finds, numismatic scholarship, Gospels and Talmudic literature and my eidomatic numismatic studies based on blood plamas and bloodstained pattern analysis. I did the same as far as the presence of floral image on the TS are concerned.\nAs a professional cryptanalyst (late antique and medieval cryptic/egnimatic texts, inscriptions and images) I am used to explore the unknown and debunk blind angles. Methinks you are still living in the unknown and have blind angles as far as genuine sindonology is concerned.\nIf I’ve got time enough, I’ll have everybody see a few floral images on the TS  man’s face region AND Pilate coin tiny  bloodstained patterns nearly invisible to the naked eye (on his orbital region) yet visible once eidomatically ‘disembedded’ from the woven fabric. Then you will know how wrong you, Charle and David Mo were.\n\n","date":"October 13, 2014 at 6:10 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161925","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: the you SHALL know how wrong you, Charles and Davd Mo were.\n\n","date":"October 13, 2014 at 6:18 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161928","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Charles Freeman wrote:\n“my contributions are spoof ones, deliberately obscurantist nonsense to see how far he can wind everyone up?”\nRe. the possibility of a silent eulogy by means of coin symbols and legends within a burial, could Mr. Freeman tell me what are his skills in Second Temple period cryptography and his knowledge of the Halakha? Has Mr. Freeman ever heard of the lezeker (association of ideas) cryptographic system? Methinks he is totally ignorant of the ancient cryptological technique. His mind is clouded. Recurring to this cryptographic technique can make sense within Yeshua’s burial. \nBesides crown daisy flower heads (both as insect repellents and symbol of the ephemerality of life as opposed to the glory of eternal life) can have been compressed with the deceased’s body in shrouds. Stylized Crown daisy head currently decorate Second Temple period ossuaries, sarcophagi and memorial tom facades. It does make sense too here.\nWho is an obcurantist here?\n\n","date":"October 12, 2014 at 2:18 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161720","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Max, if like me you believe there is good evidence that the Shroud was woven and painted( it has since faded dramatically) in the fourteenth century then knowing anything about Second Temple burial practices is irrelevant . The only relevance is the more we know about them the less likely it is that the Shroud comes from a first century Jewish burial.\n\n","date":"October 12, 2014 at 2:23 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161723","author":"Charles Freeman","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Mr. Freeman, can you tell me exactly what are the common ancient Jewish burial procedures that, in your mind, do not fit with the Shroud?  I’m curious to learn them!  So far, I never come accross something in my researches that would really not fit at all, especially if you understand that the burial of the Shroud man was only partial and most probably done in haste (just like the one of Jesus, as we can detect from the Gospel accounts)…\n\n","date":"October 13, 2014 at 5:20 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162099","author":"Yannick Clément","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"…and who is intellectually timid and the victim of  intellectual psychorigidity? Answer: Mr. Freeman\n\n","date":"October 12, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161724","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"You are free to be wrong in your opinion.\n\n","date":"October 12, 2014 at 2:27 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161726","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Methinks Mr Freeman lacks archaeological reconstructive skill as the latter demands both knowledge and imagination.\n\n","date":"October 12, 2014 at 2:32 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161728","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"On October 13, 2014 at 7:01 am, on another thread I wrote:\nAs a professional cryptanalyst, I do think too the TS is not supernatural per se yet is a ‘providential image’ of Yeshua’ (reminder: his name in Hebrew means ‘Providential SALVATION’).\nNow most curiously, if you apply what I call the lezeker-bezeker cryptographic system (or Hakhamic/rabbinic hermeneutic/cryptographic system) to a Pilate coin obverse bearing a lituus or augur wand for instance, you can decode by means of an association of ideas and ‘imageplay’, the very name Yeshua’ as the bronze central device (seen in conjunction with the final C letter in the KAICAPOC inscription and through rabbinic/hakhamic eyes) can visually conjure up a “brass snake”-like shaped form (nâHâsh or neHushstân neHoshet in Hebrew).\nReminder here: the brass snake is the symbol both of ‘Victory (over death/the enemy)’ AND ‘SALVATION’. Therefore it can code here the very name Yeshua’, “Jesus”, SALVATION in Hebrew (see Num. 21:49; John 3:14-15). This is just a cryptographic example among many others that can be triggered off through a Pilate coin obverse (and reverse).\nThis could account for the finding of many Pilate coins in Second Temple tombs (at least 46 coins out of 124 found in STP tombs were Pilate coins).\n\n","date":"October 13, 2014 at 7:08 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161939","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Yes, I persist and sign!\n\n","date":"October 13, 2014 at 7:18 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161941","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Addition: The very top of the simpulum can ‘read’ (via imageplay) like a Second Temple period square Hebrew monogram (NUN). Now in 1rst c. CE Jerusalem Hebrew, ‘nun’ can mean ‘hidden’ ans as such be a synonym for ‘nostry’ that can also read as the short for ‘notsraty’, literally “of the (rocky mountain) grotto region (of Galilee)” > Aramaic nâtsrâth, “Nazareth”.\nTherefore the two symbols (lituus/augur wand and simpulum square handle) can read through lezeker-bezeker as Yeshua’ (Ha-) Notsry (“Jesus (the) Hidden (Prince/Shoot of David)” and/or “(The) Troglodyte”.\n\n","date":"October 13, 2014 at 7:30 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161946","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Addition 2: in Hebrew NUN can also mean PERPETUATION (be-nun = be-zekzer, “IN MEMORY) and… FISH in Aramaic. It can also refer to the Ben Ha-Adam as Ben Nun that is the son of the 50 gates of Wisdom.\n\n","date":"October 13, 2014 at 7:42 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161949","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Typo: BE-ZEKER\n\n","date":"October 13, 2014 at 7:42 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161950","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"As a professional cryptanalyst, methinks that crucial pieces of evidence to accurately date the TS by means of palaeography and identify the man  via numismatic cryptography are intriguing blood plasma & bloodstain patterns on the TS man’s orbital regions.\n\n","date":"October 13, 2014 at 9:31 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-161994","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Re the real possibility of a coin rebus as substitute or support for a silent eulogy:\nReminder one: According to traditional custom, no eulogy is pronounced on Sabbath, on festivals, eve of a holiday and on Isru Ḥag (the day after it), during the whole month of Nissan, except for a great Torah scholar.\nReminder two: in Aramaic NâZRâTh or NâTsRâTh (“Nazareth”) means a grotto region nestled/hidden (“hidden”, in Ancient Heb. nun, notsry) in a valley surrounded/crowned by mountains. In the Second Temple period the very words  NâZRâTh or NâTsRâTh also referred to “a centre of resistance” NOT to a city. Nazareth as a city was built in the 5th-6th c. CE. \nReminder three: Visually speaking, a romanized literate liberal Hellenistic judean (from Sadduceean background?) burier could have noticed that:\n1/ the simpulum image on the Pilate coin obverse could be subdivided into two other images e.g. a ritualistic bowl topped by a 1st c. CE square Hebrew monogram reading like a double Nun letter or a Bet letter combined with a final Nun letter that is reading either Ben Nun (“Son of Perpetuation”) or Be-Nun (“In Perpetuation” = “In Memory”).\n2/ the lituus image,,once almost upside down, could be connected to the final luna sigma (C) of the inscription KAICAPOC to form e.g. a bronze snake and a capital I in Roman cursive.\nThus through one f the buriers’ CREATIVE VISION, ID information of the crucifixion victim could have been hidden here by means of a series of “imageplays” to be read from right to left and top to bottom:\nFirst reading:\n– a square monogram polyvalent for Be-Nun,”In Perpetuation”, “In Memory”; “ben, “son”, nun “50/fivety” > Ben Nun, “son of the 50/fivety (gates of understanding/holiness) = a Hakham, “a wise/skillful man”, “a master of wisdom” > IN PERPETUATION HAKHAM\n– a brass snake, symbol of both “Victory (over death/illness/the enemy)” and “Salvation”, “Yeshua’ in Hebrew, which is also the very Hebrew surname of “Jesus (of Nazareth)” > YESHUA”\nSecond reading:\n– a square Hebrew monogram reading Nun Ben with Nun meaning “Hidden” and synonymous of Nostry, short for Notsraty referring to “(someone) of the (rocky mountain) grotto region (of Galilee) > NOTSRY BEN\n– the capital I in Roman cursive + saph, “a bowl” = Y-saph > YSSAPH or YOSSEPH, “Joseph”\nNow (irrespective of the coin legends), one can clearly read (short eulogy version): IN PERPETUATION (FOR EVER AND EVER) OF HAKHAM YESHUA’ HA-NOTSRY BEN YOSSEF/JESUS DE NAZARETH FILS DE JOSEPH.\nRe the two Pilate coin reverse types namely a laurea or “crown of laurel” with berries and its X-shaped like attachment  and a fascis or a “bunch”of three whole sheaves of barley in a tripod, the outer two sheaves drooping.\nWithin the context of a numismatic silent eulogy:\n– the crown, as a Judean funerary symbol, can refer to “a crown of Thorah” (with X for the Hebrew ancient letter Tav as initial of the word Torah) meaning “a great Torah scholar”.\n– the bunch of three whole sheaves of barley can evoke the Hebrew omer s’orah, “barley sheaves (tied) in a bunch”, symbol of Redemption. This symbol could trigger off the final fragment of a funerary votive formula in Hebrew: tehieh naphsho be-tsror ha Hayim lereshit degan haggan eden (short acronym תנצב״ה), “May his soul be bound up in the bundle of the living as first fruit at harvest time in the garden of Eden.\nThus (irrespective of the coin legends = SHORT VERSION OF THE TS man’s ciphered EULOGY), piecing the jigsaw together,  one can read:\nIN PERPETUATION (FOR EVER AND EVER) OF\nHAKHAM YESHUA’ HA-NOTSRY BEN YOSSEF\n/THE MASTER OF WISDOM JESUS OF NAZARETH SON OF JOSEPH\nGREAT TORAH SCHOLAR\nMAY HIS SOUL BE BOUND UP IN THE BUNDLE OF THE LIVING\nAS FIRST FRUIT AT HARVEST TIME IN THE GARDEN OF EDEN.\n\n","date":"October 14, 2014 at 6:51 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162296","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Actually here the coin rebus could have been used as silent eulogy OR/AND epitaph.\n\n","date":"October 14, 2014 at 7:02 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162302","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Deciphered eulogy in Hebrew:\nBe-Nun (= Be-Zeker) Ben Nun (= Hakham)\nYeshua’ Ha-Nun(= Ha-Notsry)\nBen Yassaph ( = Yosseph)\nKether Torah\nTehieh naphsho be-tsror ha Hayim\nLereshit degan haggan eden\nLiteral translation:\nIn perpetuation (for ever and ever) of the son of the fifty gates\nYeshua’ The Hidden (Shoot of David)/(of Nazareth)\nSon of Joseph\nCrown of Torah\nMay his soul be bound up in the bundle of the living\nAs first fruit at harvest time in the garden of Eden\n\n","date":"October 14, 2014 at 4:05 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162397","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"The word nun is repeated in this short version of the silent eulogy or epitaph as the letter per se is the symbol of the faithful servant in a state of humbleness.\n\n","date":"October 15, 2014 at 5:16 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162520","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"re. NUN \nInterestingly, the numerical value of dag gadol — the Hebrew phrase in Jonah for “great fish” — is 50, which is also the numerical value of the letter nun. \nIn Psalm 72, a psalm dedicated to David’s heir who is, in reality, Mashiach ben David of whom it is said:\n“His name shall endure for ever: his name shall be continued as long as the sun: and men shall be blessed in him: all nations shall call him blessed.” (Ps. 72:17)\n“The phrase “his name shall be continued” is written in Hebrew as sh’mo (“his name”) yinon (“shall be continued). \nThis particular verse has led some rabbinic sources to conclude that a cryptic name for the Messiah is Yinon – (“his name” is yinon). In fact, according to the Talmud, the Messiah (Heb. Mashiach) has four such names: Menachem “comforter,” Shiloh “peace,” Yinon and Chaninah “graceful.” Please notice that the first letters of each of these Hebrew names form an acronym for Mashiach. More importantly, notice that the name Yinon is actually the word nun preceded by the letter yud. In other words, a prominent name for the Messiah is tied to nun and all the concepts that the letter alludes to. According to the rabbinic work Pirkei deR’ Eliezer, Yinon most specifically alludes to rejuvenation (remember the fish). Perhaps a more appropriate word to define Yinon would be resurrection! “(see http://www.hissheep.org/special/nun%20-%20messiah-the_faithful_king.html)\n\n","date":"October 15, 2014 at 5:43 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162528","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Now the acronym for Yeshu’a ha-Notstry can read YHN Yud-He-Nun, which can read Y(eh)inon.\n\n","date":"October 15, 2014 at 5:53 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162530","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Note the TS ‘herringbone’ weave pattern is symbolic of the LIVING WATERS of the Torah and in Aramaic the word nun means “fish”.\n\n","date":"October 15, 2014 at 5:58 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162532","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Besides the Greek word othonia wordplays with the Hebrew phrase oth Yonah, “Sign of Jonas”.\n\n","date":"October 15, 2014 at 5:59 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162533","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"In Koine Greek ‘othonia’ refers to the shrouds found in the empty tomb.\n\n","date":"October 15, 2014 at 6:01 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162534","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Re the name Yinon as a cryptic name for the Messiah: in modern Hebrew Yinwn means ionization, a process that used nature’s secret way to purify waters, air, impurities…\n\n","date":"October 15, 2014 at 7:12 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162550","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Yinwn is ‘the projection’ of YHWH in NUN…\n\n","date":"October 15, 2014 at 7:15 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162551","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"…that makes alchemical sense.\n\n","date":"October 15, 2014 at 7:19 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162553","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Thus the Hebrew letter nun is associated to the role of the Saviour (purification in terms of redemption). Nun as such is ‘hidden’ in the living waters of the Torah, nun being the representative of the all hidden activity occurring beneath those ‘waters’.\n\n","date":"October 15, 2014 at 7:41 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162559","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Needless to say the placing of coins over the TS man’s eyes has nothing to do with the pagan/heretical ritual of Charon’s obol. It is here, at worse, totally revisited and rethought since it does abide by the Halakha or Judean/Jewish religious Law in terms of closing/covering of the deceased’s eyes so they won’t be open and providing the crucifixion victim (whose innocent blood had been shed in the month Nissan on the eve of a Great Shabbat) a silent eulogy or epitaph.\nIn 2005, in an unpublished paper entitled “Linceul de Turin : L’Eloge du Christ Retrouvée ? Tentative de décryptage d’un très singulier rébus monétaire”, I also present a longer version respective of the metalinguistic wordplays (in Greek, Hebrew and Aramaic) triggered off from the coin legends and inscriptions.\n\n","date":"October 15, 2014 at 9:04 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162578","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder for David Mo, Yannick Clément and Charles Freeman: \nA coin of Herod Agrippa I (AD 40-45) was found in an ossuary of the burial cave of the Caiaphas family inside the skullcap of ‘Miriam the daughter of Shim’on’ (and granddaughter of the High Priest Caiaphas).  (see e.g. British Society for the Turin Shroud – Issue #46). It is not said whether the skull was damaged or undamaged (secondary burial).\nA coin of John Hyrcan II was found inside a fractured skull in Jericho D/18 tomb (primary burial) and another nearby in the coffin.\nTwo coins were found in an ossuary stuck in a skull in Jericho D/3 tomb (secondary burial). It is not said whether or not the skull was damaged or undamaged.\nBTW Even in the Charon’s obol case, coins could be placed on the eyes of the defunct not necessarily/automatically in the mouth or clenched between the teeth… \nIn a research paper, THE COINS FROM EL-KABRI,  (‘Atiqot 51, 2006), Danny SYON wrote:\n“Charon’s obol, originally a classical Greek mythological theme, is referred to in ancientGreek and Latin literature as the payment required by the ferryman Charon to reach the mythological underworld. The latest mention of the custom is by the second-century CE Latin author Apuleius (Metamorphoses VI:18). In the classical theme, the obol, or a low value copper coin in general, should be placed in the mouth of the deceased immediately after death.The archaeological record provides us with a wealth of coins found in tombs but it would be incorrect to associate all of them with this custom. Indeed, at least in Greece, the custom of providing the dead with coins is older than the mythological tradition of Charon (Stevens 1991:227). It seems that the custom underwent considerable changes in the Roman and Byzantine periods. \nOriginally, Charon’s obol was placed in the mouth or clenched between the teeth; in later burials, we ﬁnd COINS PLACED ON THE EYES or in the hand (Stevens 1991:225).here were also changes as to when the coin was placed (at death or upon burial) and the number of coins. Charon did not exist in the Roman religious tradition.\n(…) coins cannot be deﬁnitively associated with the custom (Charon’s obol), even if found near the body, and are usually recorded as ‘grave offerings’ (…) coins were found in the mouth of the deceased at Gesher Ha-Ziv(Mazar 1994:78, eight examples) and Lohame Ha-Geta’ot (Peleg 1991:133, four examples); clenched between the teeth at Nahariyya (Barag 1986:399) and Mampsis (Negev 1971:119); PLACED ON THE EYES at Hurfeish (Shaked 2000) and ‘En Boqeq (Gichon 1970:139); or heldin the hand, as at Lohame Ha-Geta’ot (Peleg1991:133).”\n\n","date":"October 15, 2014 at 12:20 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162623","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"Reminder: among the four coins found in the three skulls, three bears on their reverse three ears/sheaves of barley… according to me very apt to trigger off the Second temple period funerary votive formula:  “May his soul be bound up in the bundle of the living, as first fruit at harvest time in the garden of Eden”…\n\n","date":"October 15, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162631","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Hello Mr. Zias","post":"…that is much alike the three ears/sheaves of barley featured on the Pilate coin reverse of the simpulum lepton type of which obverse appears very partially recorded astraddle on the TS man’s left lower eyelid  and zygomatic ridge.\n\n","date":"October 15, 2014 at 12:42 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","id":"comment-162639","author":"Max patrick Hamon","site":"shroudstory"}]
