[{"title":"It may not suit the scientific mind-set","post":"I am still waiting for DaveB to post something that is not well thought out and reasonable. Well done Dave, as usual.\n\n","date":"November 30, 2013 at 9:05 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54159","author":"John Klotz","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"“The TOTAL evidence must be weighed to arrive at a successful conclusion.”  Exactly!  “It is important not to lose sight of the whole picture.”  Precisely.  “[Experts’] role is advisory only.”  Well said.  Beyond that, your Venn diagram is the coolest I’ve ever seen.  It does perspicuously convey an abstract range of options.\nHowever, I think the logical case is better couched in terms of implications and their contraposition.  What we have is something like -P –> -J, where -P is a disjunction of negations (negated propositions), any one of which would be dispositive, and -J the negative judgment on authenticity.\nIf -P –> -J, then by contraposition J –> P, where P is a conjunction of the same evidentiary propositions, and J is the positive judgment on authenticity.\nThe logic is brutally simple.  What is difficult has to do with gaining a viable consensus regarding which propositions to include in P theoretically, and which of those have been established practically.\nYour larger point does need to be made though.  It is all too possible for people to lose sight of the big picture and focus on details inappropriately, as if every niggling contention had the same weight.  This does require the use of common sense reason, the reason of “oh for heaven’s sake be reasonable!”, rather than perpetual rationalization.\n\n","date":"November 30, 2013 at 9:47 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54166","author":"R. H. Cahall","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"No no no. this won’t do at all. The shroud is not under “trial” nor will a “verdict” make it authentic if it is a forgery, or a forgery if it is authentic. I think daveb, a model of good sense, is quite right in guessing that if there was a “trial of authenticity,” the shroud would be found “authentic,” but that will no more make it authentic than any other miscarriage of justice properly determined by a court of law. The same would apply if, after a retrial, it were found inauthentic.\nScientists, surprisingly, are not keen on facts. They work with probabilities, with suggestions and difficulties, out of which a general acceptance, with reservations, gradually emerges. They explore every carp and niggle, and expose new evidence, which they immediatley attempt to discredit. The weight they give to each piece of evidence is often largely subjective, which is why they can differ quite markedly, even from exactly the same evidence, if they’re forced to come to a conclusion.\nI don’t think I have ever claimed that the shroud must be a forgery because of such-and-such, or that it must be authentic because of something-else. For many years I have teetered around the 50/50, sometimes thinking there was 60/40 chance the shroud is genuine, and sometimes thinking the reverse. But a 60/40 chance is not a conviction of authenticity, nor is the reverse a conviction of forgery. A scientific fact is not achieved “beyond reasonable doubt” but beyond any doubt at all: that’s why there are so few of them.\nSo, by all means believe the shroud genuine or fake, according to your convictions, but if you believe it fake, keep those halophytes in the back of your mind, and if you believe it real, do the same with my 610nm spike, and remember that “they can’t show how it was made” cannot be twisted into “therefore it must be authentic” any more than it can into “therefore it must be a fake.”\n\n","date":"November 30, 2013 at 1:12 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54188","author":"Hugh Farey","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"1) The Shroud is under trial, or else so many people would not be trying to discover and evaluate evidence for or against its authenticity.  The entire point of the general exercise is to ground a reasoned judgment.  That’s what a trial is.\n2) Who has ever claimed that a verdict MAKES someone guilty?  The verdict is a reasoned judgment as to whether someone IS, or is not, guilty.  No one with any sense is trying to make the Shroud authentic by means of an evidentiary judgment, but to establish a truth claim.\n3) Scientists do not “explore every carp and niggle” since that would involve a monumental waste of time and energy.  They use intelligence, experience, and intuition to narrow down promising avenues of exploration.\n4) Scientific facts result from observation and measurement, both of which are of necessity open to doubt.\n5) The point is not an individual judgment concerning one fact or another but a collective consensus concerning a viable constellation of facts.\nYour objection fails.\n\n","date":"November 30, 2013 at 3:07 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54202","author":"R. H. Cahall","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"A scientific fact is not achieved “beyond reasonable doubt” but beyond any doubt at all\nRather opposite way.\n\n","date":"November 30, 2013 at 1:18 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54191","author":"O.K.","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"the actual position of any sub atomic particle is always in doubt\n\n","date":"December 1, 2013 at 11:42 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54701","author":"Paul","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"We do not order our lives by proof beyond a reasonable doubt, let alone proof beyond any doubt. The scientific standard is a mirage. Take for example the enigmas of quantum mechanics. Every few years some one announces a new interpretation of quantum mechanics which explains everything and refutes prior interpretations. In began with the Copenhagen interpretation, I believe we are up to eight now, the ;latest one being announced this year “proves” that the others are false – at least the scientists who propounded it said. I really feel sorry for some one who insists on absolute proof which I guess is how some define scientific proof. There are no absolutes.\nWe must live by reasonable belief. Even the criminal standard of proof beyond reasonable doubt allows room for unreasonable doubt. To believe only in absolute truth is to believe in nothing.\nDo you have faith in God. Is it the anthropomorphic God who walked and talked with Adam and Eve in the Garden of Eden? Do you believe that the disparity of human language was created by human hubris in attempting to build a Tower of Babel? Do you believe in Noah’s Ark in which very animal in the world was saved from a flood ordained by God in a single boat? Do you believe in a God who ordered Joshua to slaughter the women and children of Jericho?\nI don’t. I believe as St. John wrote: God is love. I believe also that truth will makes us free. And  that liberating truth comes from love. I believe that all the commandments and prophecy are founded on love. The embodiment of that love was cruelly tortured and crucified – and  rose from the dead by a process we do not yet understand.\nThe scientific evidence of the authenticity of the Shroud demands a response. Not a speculation but one founded on reasonable facts. The only item that approached that was the carbon  dating and that has been scientifically rebutted. \nI believe that the Shroud is a revelation left for this scientific era. The best is yet to be.\n\n","date":"November 30, 2013 at 2:53 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54200","author":"John Klotz","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"1) Bohm’s interpretation may be a necessary, but cannot of itself be a sufficient, condition that, say, the Copenhagen interpretation is false.  In general, interpretations can exist side by side as competing options.  There is usually no question of “refutation”.\n2) The absolute categorical “there are no absolutes” is often regarded as an infelicitous way to express the point, for obvious reasons.\n3) We do live by belief, since choice of action requires a foundation of some sort.  It is not at all clear that belief must in every case be rational.\n4) Augustine and Descartes would disagree that to believe in absolute truth (“if I doubt, I am”, “I think therefore I am”) is to believe in nothing.  To believe “only” in absolute truth is perhaps to extend it hyperbolically.\n5) A lot more science than that involving carbon dating has been applied to judgments concerning the authenticity of the Shroud.\n6) Why should “scientific evidence of the authenticity of the Shroud” demand a response?  It is itself a response.\n\n","date":"November 30, 2013 at 3:41 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54204","author":"R. H. Cahall","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"No no no, again! The shroud is under investigation, not under trial. At the outcome of a trial, it is not possible to deliver a verdict of “Probably,” but that is the outcome of many, many investigations. If Max Frei’s pollen findings were discredited, there would be very little to link the shroud to Jerusalem, and if the C14 dating was discredited, there would be little to link it to the 13th century. Although fanatics of either side think these points have been roundly cleared up (to their own satisfaction, of course) they are still important bones of contention.\nAnd, dear me, of course the verdict makes you guilty (or not). However innocent you be, if you’ve been properly stitched up by cleverer villains, the verdict of guilty locks you away and makes you a pariah in decent society. And conversely, however many atrocities you’ve committed, if you can afford a clever QC to persuade the jury to say ‘not guilty,” then you’re as free as any other citizen to continue on your way with your head held high.\nAnd that’s precisely the point. A verdict is a reasonable judgement, not, by any means, necessarily, a truth. And who is to decide what a reasonable judgement is, in the case of the shroud? Well, it’s every man for himself, I’m afraid. Any my verdict? “Probably” (or probably not, according to the wording of the indictment).\nScientists do not explore every carp and niggle? Nonsense, again. They do not explore every tiny detail, perhaps, but if there is a carp against their findings, or a niggling inconsistency, then yes, getting to the bottom of every one is crucial to the publication of their findings, and occasionally pointed out (with glee) by their peers. Failing to respond to objections, or brushing them aside as irrelevant (unless they are) is a short cut to ignominy.\nAnd finally: “The point is not an individual judgment concerning one fact or another but a collective consensus concerning a viable constellation of facts.” What on earth does this mean? The point of what? Of my investigations? Not at all. Of yours? Scientific truths are not collective consensuses of viable facts. Legal truths are. A legal truth can be overturned, and often is, on appeal. A real truth can’t be. If the shroud is a 13th century fake, then no amount of consensus can make it authentic, and if it’s genuine, then none can make it false. It is not up to a committee to decide. In the absence of irrefutable proof, as I said, it’s every man for himself.\n\n","date":"November 30, 2013 at 3:58 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54205","author":"Hugh Farey","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Well now you’ve written “no” six times.  Was it cathartic?\nSince a trial is a kind of legal investigation, merely shuffling terms around to escape the implications of what you said before is merely pathetic.  Moreover, the law allows all sorts of judgments, such as “not proved” or reductions of charges.  It really depends on whether “probably” rises to the level of beyond reasonable doubt or other lesser sorts of doubt that the law also allows, for instance in civil cases.  But that’s more of your word salad.  Oh and by the way, contention is what happens in trials.\nIf the verdict, dear you, makes one guilty, then there can by definition be no wrong verdict, can there?  No unjust conviction.  No innocent man sent to prison.  It may surprise you to learn that more than one society has regarded more than one man as guilty who was in fact not guilty.  Some such have even been lynched.  If the judgment makes you guilty, why bother with evidence?\nYou say yourself, with embarrassing inconsistency, that legal “truths”, whatever they are, can be overturned.  On what basis, if they establish guilt?  As for “real truths”, what do you mean?  Newton’s theory of gravity?  I honestly don’t think you have a clue what you mean.\nNo simply reasonable judgment, including those of science, is necessarily true.  Necessary truths are matters of logic, not fact.\nIf you think it is “every man for himself” in the case of the Shroud, then perforce you think it is every man for himself in the case of any reasoned judgment.  The Shroud isn’t particularly special in that regard.  Apparently you hold the possibility of genuine consensus in something like contempt, but that is itself contemptible.\n“Scientific truths are not collective consensuses of viable facts.”  I’m not sure what a “viable fact” is.  My phrase was a viable constellation of facts.  But if you seriously believe that science does not proceed by collective consensus, you know very little of its history.\nAs for “irrefutable proof”, any proof concerning matters of fact is of its nature potentially refutable.\nThe next time you accuse me of nonsense, you would do well to spew considerably less of your own.\n\n","date":"November 30, 2013 at 10:04 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54241","author":"R. H. Cahall","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"“Scientific truths are not collective consensuses of viable facts. Legal truths are. A legal truth can be overturned, and often is, on appeal. A real truth can’t be.”\nQuod est veritas?\n\n","date":"November 30, 2013 at 4:07 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54207","author":"O.K.","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"“Scientific truths are not collective consensuses of viable facts. Legal truths are. A legal truth can be overturned, and often is, on appeal. A real truth can’t be.”\nSorry:\nQuid est veritas?\n\n","date":"November 30, 2013 at 4:12 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54208","author":"O.K.","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Brilliant!\n\n","date":"November 30, 2013 at 7:01 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54228","author":"Hugh Farey","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"“Scientific truth” is not a univocal term.\nIt strongly depends on the matter (subject).\nI have to think about that.\nBut, reading the comments above, I can’t avoid to think to my own medical practice.\nAt the first look, it seems to me that ” Shroud science” has something to do with the medical reasoning. Medicine is not a science but it is related to “science” through the “Evidence based medicine”.\nThere are several links between the study of the shroud and Medicine.\nMore later..perhaps.\n\n","date":"November 30, 2013 at 6:19 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54220","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"I think the point of my last comment was missed, although it did build on what had gone before. Innocent people are indeed sent to prison, and a verdict of guilty does not, of course, mean that a prisoner has actually done any of the things that he is convicted of. But the consensus of the court, and by publication, of the rest of the populace, still dooms him.\nGuilt or innocence, in other words, is not a statement of truth, but a statement of publicly accepted truth, based on a consensus of the evidence presented. \nIn the same way, Joe Nickell’s “Inquest on the Shroud of Turin” and, with a nod to metaphor, Walter MccCrone’s “Judgement Day for the Shroud of Turin,” may have ‘convicted’ a first century burial cloth of being medieval. Their findings were very widely publicised and are accepted as fact by hundreds of people. On the other hand Stevenson & Habermas’s “Verdict on the Shroud of Turin” came to the opposite conclusion, and their findings (in conjunction with many others’) are also accepted as fact by hundreds. It doesn’t seem possible to determine where, of if, there is a consensus.\nIf Nickell and McCrone are wrong, how do we overturn their verdict? If Stevenson and Habermas are wrong, how do we overturn theirs? A simple consensus of probabilities won’t do. We examine every tiny detail of their findings, and point out flaws which reduce the probability of their being correct, one by one, painstakingly, until their adherents themselves have sufficient doubt about their conviction that they reclassify it as a probability, or even as simply indeterminate.\nThe conviction that the shroud is authentic has recently been supported on this site by comments insisting on the bigger picture, on a mass of evidence, and consensus. The balance of probabilities for these commenters does not hover around the horizontal, as it does for some of us, but crashes firmly down on one side or the other. Investigating a single tiny detail is unlikely to redress their convictions, and they have wondered why anybody would bother. However for those whose balance is more finely tuned, a single thread, (literally, probably one of Rogers’s), can affect it.\nWe began this discussion by Charles Freeman wondering whether a stitch on the shroud was as unusual as was previously thought. It seems not. A single tiny detail. A shift in the centre of gravity. That’s what I like about studying the shroud. Uncertainty.\n\n","date":"December 1, 2013 at 5:56 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54273","author":"Hugh Farey","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Sorting out the stitch issue was merely a matter of discarding evidence that has been used by some but which, as I have argued here, is, in fact not relevant either way in establishing the authenticity of the Shroud, any more than the fact that it is woven in linen helps either way. \nI mentioned in a previous posting that these are small steps towards moving to a more mature assessment of the Shroud. Part of this would be, although I am not the one who is going to do it, researching the direct links between Jerusalem and northern France in the relics ‘trade’  (e.g. the relics from the Lord’s Tomb that are known to have come in to northern France  in the first millennium). This seems potentially relevant evidence that no one seems to have touched. And here I am talking about evidence that could offer support for authenticity so please don’t accuse me of bias. \nI applaud High’s approach that seems to me to be open-minded but rigorous and will certainly help move toward this new more mature approach to Shroud studies that ,so far,as i can see, is still stuck in the debates of twenty-five years ago. Let’s just disregard the radiocarbon dating  as it never provided any evidence for the contrary view that the Shroud was first century and so perhaps, ( although I am not necessarily as critical of it as others) it too can just be discarded as irrelevant.\n\n","date":"December 1, 2013 at 6:18 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54278","author":"Charles Freeman","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"CF: “Sorting out the stitch issue was merely a matter of discarding evidence that has been used by some but which, as I have argued here, is, in fact not relevant either way in establishing the authenticity of the Shroud, any more than the fact that it is woven in linen helps either way.” \nNot relevant? I seem to recall CF arguing that it could not have been made in 1st c Palestine. something to do with Z twist, or was it Chinese treadle looms? Clearly Mme Flury-Lemburg considers otherwise. Yet another skeptic skittle falls over!\n\n","date":"December 2, 2013 at 2:18 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54770","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Dave B. The fact that the Shroud is in linen is not relevant to its authenticity as linen cloth is known from 6,000 BC to today. The particular counter-hemming stitch is not relevant because it was used widely through the centuries. The Z twist IS relevant as the archaeological evidence shows that it was used primarily in western Europe while S twist was overwhelmingly the most common twist in Egypt and the Near East. It does not settle the issue one way or the other – the Shroud might have been imported to Palestine from the west-  but is significant in the way that the stitch is not.\nI have not seen Mechthild Flury-Lemberg comment specifically  on the Z twist and it would be interesting to hear what she had to say.\n\n","date":"December 2, 2013 at 4:11 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54832","author":"Charles Freeman","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"You seem so profoundly confused that I’ll bail after this response.  My only reason for making it is certainly not to convince you but the fact that the confusion itself is important enough to address generally.\nYou persist in confusing a trial with a collection of individual expressions of opinion.  In any trial, certainly the more notorious ones, there arise thousands of individual opinions based indifferently on reasoned consideration, or inadequate facts, or pure prejudice.  The trial itself, on the other hand, is the most comprehensive way we can devise, albeit imperfect in some respects, to ascertain the truth of a given situation and pass a reasoned judgment on it.  That is the consensus I refer to.\nYou want there to be a grand separation between some sort of idealized “truth” and a rather tawdry “publicly accepted truth”, both in law and in science.  We all know mistakes can be made and, knowing it, do what is humanly possible to avoid them.  We also know that, for the sake of the coherence of our civilization, the ability to make certain judgments with truly reasonable confidence is vital.  You on the other hand seem to think this is just a perpetual game that we can play merely for the sake of playing it.  The game of interminable doubt.  The game of hyperbolic scepticism.  It really won’t do.\nA scientific/historical trial, such as the Shroud is being subjected to, differs in many respects from a legal one, but the similarities are sufficient, and sufficiently important, to justify importing the term.  We do what we can to arrive at the most solidly reasoned consensus.  This is what happens in science as well, and has throughout its history.\nThe original post, and my response to it, had to do with not becoming so fixated on minutiae that the overall shape of the facts is ignored.  In science, as in law, that overall picture can be, and often is, dispositive.  A legal case based on a well-knit pattern of circumstantial evidence is often regarded as much stronger than one based on the single fact of an eyewitness, for instance.  No one, including the original post here, is saying that individual facts should not be investigated appropriately: that is part of what a trial is and does.  Thus your penultimate paragraph is pure drivel.  You have jumped to so many unwarranted conclusions you must be using a trampoline.\nAbsolute certainty in matters of fact is a chimera, but if you wish only to wallow in uncertainty then that becomes your absolute certainty.  You’re welcome to it.\n\n","date":"December 1, 2013 at 12:25 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54338","author":"R. H. Cahall","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Drivel…\nOh, well…\nNever mind…\n\n","date":"December 2, 2013 at 6:02 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54878","author":"Hugh Farey","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"There is some affinity between Theibault’s practice of medicine and my own first professional calling of engineering.  Both are applied sciences reliant on the research of specialists in the pure sciences.  Both involve human risk and safety, medicine in a direct personal way, the engineer in a more vicarious way involving the general public.  The physician may bury his mistakes; the engineer is more likely to leave monuments to his.\nThe physician depends on advances and pure research in organic chemistry and in the subtleties of human biology.  However ultimately the acceptance of new drugs will still depend on the empirical results of blind testing, along with its margins of error, confidence limits, and singular exceptions.  Except perhaps in such cases as electronics, manufactured materials, simple structural analysis and the direct application of mathematics, the engineer is very much more dependent on empiricism, having to deal with the uncertainties in the forces and materials of mother nature.  Yet he must find workable solutions.\nThe hydraulics engineer for example would love to have a solution of the Navier-Stokes equation of fluid flow, one of 23 problems nominated by David Hilbert in 1900 for 20th century mathematicians to solve.  Along with the Riemann hypothesis, it remains as yet intractable.  Hilbert’s #1 problem, Cantor’s cardinality of the continuum, appears to be in a class of Godel’s undecidable problems.  Clearly there are limits to the pure science approach that not even mathematics can resolve.\nDuring my career, I was frequently involved in the resolution of contractual disputes, frequently attending seminars on formal arbitration and the role of the expert witness, to assist me in this.  It was evident that equally competent experts were quite capable of arguing contrary cases supporting either side.  They had their roles to play, but it left me with few illusions that any expert should have the last word on any matter of moment.  For that, I shall put my trust in what appears to me to be the more reasonable conclusion.\nIt is an error of human judgment to place one’s absolute faith in scientism.  It has its practical value, but it also has its limitations.  Yesterday’s scientific dogma is tomorrow’s scientific heresy.  One need only mention the controversies of the dual nature of light, particulate or wave-like, Newton’s laws of motion superseded by Einstein’s theory of relativity, the successive and contradictory theories in quantum mechanics.  And as yet, there is still no Grand Unified Theory.  We are Lilliputians only capable of simple small-scale stuff.\nIn the grander scheme of things, we may need to have recourse to empiricism, what in fact appears to us to be reasonable, hopefully illuminated by any divine spark resident within the human psyche.  We may seek the truth, and occasionally we may even attain it.  But to err, is still to remain human.\n\n","date":"December 1, 2013 at 6:05 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54275","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Wise words, as ever.\n\n","date":"December 1, 2013 at 6:30 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54281","author":"Hugh Farey","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"At last!  Yes.  This is the sort of balance that is required, and not only in Shroud studies.  I have worked with some of the Cantorian problems myself and can subscribe fully to the statement, and the sentiment, that “there are limits to the pure science approach that not even mathematics can resolve”.  (Recall what Russell said, that we are able to mathematize science not because we know so much about Nature but because we know so little.)\nThere is indeed a difference between science and scientism, and to realize it may be the beginning of wisdom for many.  Yet there is also, as you say, a deeper wisdom: the “divine spark”.  We may err, but what is transcendent within us can know the error as error, either actually or in the common potential of human activity.\nThe Shroud sits at the most profound conjunction of science and religion.  All the incomparable brilliance of Brahmanic civilization did not see fit to invent science because it had no need of science.  Prophetic Monotheism, most specifically the Catholic Church, invented science due I believe to pressures arising within itself to address an imbalance caused by too great a reliance on the mythological.  Prophetic Monotheism is essentially historical, not mythological.  The Bible is crucially rooted in history and fact.  Jesus again and again emphasized practical issues and practical consequences.  While grounded in it, the Church had over centuries begun to lose vital contact with that dimension.  The Shroud, and studies related to it, can in my opinion be seen as part of a great spiritual renewal that is not scientific per se, not the sort of heresies Teilhard was peddling for instance, but a revitalization in which the scientific spirit and outlook play a crucial role.  Your point of view, as opposed to some others I have encountered in this blog and elsewhere, seems consonant with such an idea.\nThe divine spark is our access to the superintelligible.  We are “Lilliputians” only when we choose to restrict ourselves blindly and exclusively to the merely comprehensible.\n\n","date":"December 1, 2013 at 11:26 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-54309","author":"R. H. Cahall","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Teilhard was peddling heresey, eh? Is that the official position of the Church?\n\n","date":"December 2, 2013 at 12:30 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55066","author":"David Goulet","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Incomparable brilliance of Brahmanic Civilization? It should actually be Indus Valley Civilisation and they did not need science because there was no one studied anthropology in the region then, so it was convenient to to come up with the caste system and give it a mythical religious sanction although it had (and has) something to do with race.\nTeilhard was the object of some mention in the Church last year, not, of course, as a heretic. We know more than he did now. The Church, however, cannot make any official pronouncements because many things in science are not 100% proved, in physics, for example, where we move from hypothesis to hypothesis. It is evident that even Stephen Hawking knows that. If he didn’t he wouldn’t be a member of the Pontifical Academy of Science.\n\n","date":"December 2, 2013 at 3:22 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55147","author":"Louis","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"A favourite ploy by some Catholic conservatives is to accuse Teilhard of pantheism.  The accusation cannot be sustained. The fundamental error of Pantheism is to identify God with Nature, while the orthodox position is that the Creator is quite separate from Creation.  Teilhard’s fundamental contribution was to attempt a sysnthesis of science and religion, but this did not make him a pantheist. He was essentially a mystic, rather than a theologian, drawing on his expertise as a paleontologist. Being innovative in his thought, his Jesuit order forbade him to publish during his life-time. \nThe accusations of pantheism have been refuted by the eminent Catholic scholar Cardinal Henri de Lubac in his “The Faith of Teilhard de Chardin”.  Relevant extracts from Lubac’s work, can be found  at:\nhttp://tcreek1.jimdo.com/teilhard-a-pantheist/  which adequately disposes of the accusation.\nReferring to Henri de Lubac and de Lubac’s former student Hans Urs von Balthasar, Pope Benedict XVI stated in his book “Milestones: Memoirs, 1927-1977”, “I cannot even begin to say how much I owe to my encounter with them”.\n\n","date":"December 2, 2013 at 3:48 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55158","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Seems I’ve inadvertently opened a can of worms here.\nI don’t quite know what Louis is saying in his first paragraph, since anthropology is a science.  So Indian Civilization didn’t need science because they–what?–didn’t already have it?  Weren’t already studying it?  The caste system was their substitute?  No, that civilization did not choose to come up with science for the unexceptionable reason that their entire religious ethos was a form of idealism in light of which scientific objectivity made no real sense.\nAs for “daveb’s” comment, I don’t recall identifying myself as a Catholic conservative (I’m not), nor do I recall characterizing Teilhard as a pantheist.  Nor do I recall that the Jesuit order forbade him to publish because he was “innovative”.  There had been a number of quite innovative Jesuit scientists who raised not a ripple in that organization.  It was because they felt his “innovations” were in an altogether heterodox direction, which they were.  That  a post-conciliar Pope finds such things inspiring is hardly cause for wonderment, and certainly no reason to think Teilhard was not heretical, or let’s say seriously questionable at a minimum.\nI only tossed in the reference to Teilhard to clarify my own statement, not to inaugurate an inappropriate discussion on a blog devoted to the Shroud.  I started out on this thread merely agreeing with what I took to be the main point of the original comment, and adding a bit of logical analysis to it.  For that unpardonable sin I was accused of nonsense by someone so confused he can hardly follow his own arguments or whatever they are.  Now it is suggested I am something I never was, and hold a position I never articulated.  You people really need to dial it back a little.\n\n","date":"December 2, 2013 at 5:41 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55200","author":"R. H. Cahall","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Cahall, I didn’t say anthropology was not a science, only that science did not interest that ancient civilisation, numbers maybe, and that was because the Indo-Aryans were greedy, demanding whatever they could from the lower castes. The outcome was that it lead (and does lead) to a lot of suffering, with Gandhi trying trying to get rid of the caste system and Mother Teresa helping the victims.\nOnly two people were given a Head of State funeral in India despite not being presidents or prime ministers: Mahatma Gandhi and Mother Teresa.\n\n","date":"December 2, 2013 at 6:36 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55236","author":"Louis","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"R H Cahill: “The Shroud, and studies related to it, can in my opinion be seen as part of a great spiritual renewal that is not scientific per se, not the sort of heresies Teilhard was peddling for instance, but a revitalization in which the scientific spirit and outlook play a crucial role.” \nIf not pantheism, what specific heresies does the correspondent accuse Teilhard of “peddling”? \nRe Indus civilization and science: The Syrian bishop Severus Sebokht wrote in 662 in praise of the superiority of the Hindu numeral system, in castigating the Greeks for their mathematical arrogance.  The same system is the direct fore-runner of the so-called Arabic system of numerals, and includes a zero place-holder. Even the symbols used in the Hindu system are recognizable. Source: Georges Ifrah.\n\n","date":"December 2, 2013 at 5:57 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55211","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Dear Louis,\n     I never claimed that you said anthropology is not a science.  I merely pointed out that it is a science because what you actually wrote is, “they did not need science because there was no one studied anthropology in the region then”.  Turgid grammar aside, what you said was that they did not need science because no one had studied a science.  You then went on to point out, wrongly, that in lieu of science they devised a caste system.  Huh??  Is this blog the other side of a looking-glass?\n                 Yours,\n                 Alice\nDear Daveb,\n     I am quite aware of Indian mathematics.  So what?  It is perfectly clear my comments concerned the development of physical science not a number system.  Between this and your somewhat strange attachment to Teilhard, you seem intent on picking a fight.  Would you like to meet at some cyber OK Corral devoted to Teilhardian heresy and duke it out?  You’d lose.\n                 Yours,\n                 Wyatt\n\n","date":"December 2, 2013 at 8:46 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55302","author":"R. H. Cahall","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"It is a favourite ploy of some Catholic conservatives to accuse Teilhard of Pantheism.  The accusation cannot be sustained. Panthism identifies God with Nature, whereas the orthodox position is that the Creator is quite separate from Creation.  Teilhard’s major contribution was to attempt a synthesis of science and religion. But this did not make him a pantheist. He was essentially a mystic, rather than a theologian, drawing on his expertise as a paleotologist.  His innovative ideas resulted in his Jesuit order forbidding him to publish during his life-time. His “Hymn of the Universe” is profound, celebrates Creation, and echoes themes to be found in the Psalms and other scriptural canticles.\nThe accusation of pantheism is effectively refuted by the eminent Catholic scholar Cardinal Henri de Lubac in “The Faith of Teilhard de Chardin”.  A relevant extract with comments can be found at:\nhttp://tcreek1.jimdo.com/teilhard-a-pantheist/\nReferring to Henri de Lubac and de Lubac’s former student Hans Urs von Balthasar, Pope Benedict XVI stated in his book “Milestones: Memoirs, 1927-1977”, “I cannot even begin to say how much I owe to my encounter with them”.\n\n","date":"December 2, 2013 at 4:03 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55164","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Apologies for the doubling up above.  I seemed to have been having some kind of techy problem with Posting. First attempt, the post didn’t show up, and so I rewrote it a second time. Apparently it was still there lurking in Limbo just waiting for the moment to appear.\n\n","date":"December 2, 2013 at 4:15 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55166","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"\nR. H. Cahall :\nDear Daveb,\n     I am quite aware of Indian mathematics.  So what?  It is perfectly clear my comments concerned the development of physical science not a number system.  Between this and your somewhat strange attachment to Teilhard, you seem intent on picking a fight.  Would you like to meet at some cyber OK Corral devoted to Teilhardian heresy and duke it out?  You’d lose.\n                 Yours,\n                 Wyatt\n\nNext time pick your words more carefully so you don’t have to backtrack, Wyatt. Save everyone a lot of time.\n\n","date":"December 2, 2013 at 10:07 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55335","author":"David Goulet","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"I remain none the wiser concerning R H Cahall’s accusations of heresy against Teilhard de Chardin. I guess it was just a gambler’s bluff, but there’s no payoff. Don’t collect $200 as you pass Go!\n\n","date":"December 2, 2013 at 11:01 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55376","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Dear Dave and Dave,\n     What part of a-discusion-of-Teilhard-on-a-Shroud-blog-is-inappropriate don’t you understand?  Whole books have been written on the subject of Teilhard’s heterodoxy.  Why I even own a couple myself.  Your juvenile tactics are pretty much what someone can expect on these internet forays.  It’s depressing but I suppose inevitable.\n     I used the reference to Teilhard to clarify a point I was making not to invite a discussion about him, interesting as that might be in a proper context and with interlocutors somewhat less adolescent.  If you were as really really offended as you really really seem to be, the fact could have been noted in about one sentence.\n     As it is, kiddies, why don’t you go amuse yourselves by throwing mudpies at each other for a while?\n     Yours,\n     The Bactracking Gambler\n\n","date":"December 3, 2013 at 12:37 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55759","author":"R. H. Cahall","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"Clearly Henri de Lubac did not consider Teilhard heterodox. I find no substance in any of what Wyatt Cahall has to say on the matter, only unjustifiable and unsubstantiated ad hominem abuse of other correspondents. Hardly any kind of a persuasive argument for his singular point of view.\n\n","date":"December 3, 2013 at 5:41 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55912","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It may not suit the scientific mind-set","post":"R.H. Cahall,re. #30, is your first name Alice or Wyatt? It was you who began this talk about “Brahmanism” and science. Let me say the following once and for all:\nThe caste system is based on mythology, it is racial in origin. If you went to India you would notice that and it is only applicable there, not to other peoples like Eskimos, Jews, Zulus, Anglo Saxons and the rest. It is linked to the belief in reincarnation and the cause of much suffering in that country. There was no science around when it was invented, just mythology providing “divine sanction” because it was “divinely created”. With 21st century now around, it is still not interesting for many to get rid of the caste system, and I think you know why.\n\n","date":"December 3, 2013 at 6:29 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","id":"comment-55943","author":"Louis","site":"shroudstory"}]
