[{"title":"Let the Experiments Begin","post":"Hi Hugh,\nI don’t understand the sentence: ” However, after asking around, I find that people who keep snakes as pets feed them on frozen mice, which are available quite cheaply in bulk. This looks promising, so I’m preparing an appropriate protocol for just the experiments you suggest!”\nSnakes, mice ??\nCan you describe your protocol ?\n\n","date":"April 4, 2014 at 3:40 pm","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","id":"comment-96561","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Let the Experiments Begin","post":"See previous posting https://shroudstory.com/2014/04/03/am-i-the-only-one/ comments #17 – #19. \nIt arose from discussions about current experimentation, which I had felt had been directed more at checking out the assertions of anti-authenticists, and little seemed to have been done in following up the experiments with Edgerton linen carried out by Ray Rogers in 2003.  Not entirely “tongue-in-cheek” I have long advocated for experiments with “time-expired lab animals”, to see what, if any, natural imaging might result from simulating the conditions of a dead body wrapped in linen under similar conditions as the Shroud-man. While many have preferred a miraculous explanation, I had considered that naturalistic explanations were far from exhausted and that no recent attempts had been done to check it out. There was the infamous “pig experiment” that Barrie had been coaxed into doing as part of a TV sensationalist documentary, but practically nothing else, except those by De Liso using a dead snake as part of her seismic invesigations.  Mercifully, but perhaps unfortunately for his experiments, there are very few earthquakes in the UK, as it’s just possible they might also be a factor.  \nI am grateful to Hugh for picking up the idea, and admire his resourcefulness. I wish him well in his endeavours. Whether he produces any images or not, whatever results may arise must inform as to what factors might be necessary as part of a naturalistic explanation.\n\n","date":"April 4, 2014 at 4:14 pm","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","id":"comment-96568","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Let the Experiments Begin","post":"Hi Thibault, I’m currently thinking of preparing three types of linen – untreated, treated with saponin and dextrin, and treated with myrhh, and laying these around defrosted mice at about 20°C for three times (perhaps one day, three days and six days), observing the results and if necessary warming the cloths for a while to reveal any latent image. Any success will be followed up with confirmatory and extended experiments until I have used up a pack of 20 or 25 mice. Any deteroration of the linen due to ammoniacal decomposition, or putrescine, cadaverine or anything else ought to be observable.\n\n","date":"April 4, 2014 at 6:36 pm","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","id":"comment-96604","author":"Hugh Farey","site":"shroudstory"},{"title":"Let the Experiments Begin","post":"Hugh,\nOut of curiosity, are you shaving any of these guys?  (I’m serious!)\n\n","date":"April 4, 2014 at 7:02 pm","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","id":"comment-96611","author":"Kelly Kearse","site":"shroudstory"},{"title":"Let the Experiments Begin","post":"Well (it’s surprising where shroudology takes you sometimes) I find that young snakes are fed on “pinkies” which are only a few grams, and are young mice before they get any fur. If they are too small to be used individually, it may be necessary to use three or four at a time, but they are so cheap that I think the budget can stand that.\n\n","date":"April 4, 2014 at 7:21 pm","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","id":"comment-96615","author":"Hugh Farey","site":"shroudstory"},{"title":"Let the Experiments Begin","post":"Pinkies-got it!  Might save a bit on the amount of cloth needed-Best of luck to you in your studies\n\n","date":"April 4, 2014 at 7:26 pm","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","id":"comment-96617","author":"Kelly Kearse","site":"shroudstory"},{"title":"Let the Experiments Begin","post":"I am curious about the reults …\nI believe we have to observe (in a careful manner)\nthe thin layers on linen fibrils …\nThin layers obtained with different kind of experiments (included your new attempt).\n— —\nTen days ago I observed the slide n. 21 (of 24) :\n“2002 Restoration Head 300DPI” versus “Schwortz Positive Head 72DPI”\nin  “24 Years of Photography : 1978 Barrie Schwortz & 2002 Restoration Comparison”,\nclearly we can see an interesting difference (a “different aspect of Holy Face”) …\nbut there was not the comparative table (of measurements).\n(Link : http://www.shroudnm.com/docs/SEAM-Turin-Shroud-Presentation5-Photography.pdf )\n… and then … \nI think we have to investigate the past vacuuming operations (Riggi) and the restore operation (in 2002) because I suspect some detachment of thin layers of linen fibrils\n(besides the dusts !) …\nAgeing of thin layers and vacuuming pressure can turn in a bad manner\nthe original Imprint (and that presumed phenomenon is here\nunderlined only from a speaking from a scientific point of view,\ntaking apart the new arrangement of the famous ancient cloth …).\nI believe that some ghosts were detached from the image.\nSo … we have to observe the dusts in a careful manner.\nWhat is your opinion ?\nThen tiny variations in adhesion of thin layers on linen fibrils\ncan be investigated at nanometric (or angstrom) level using\nthe SPM way and/or the Raman controls …\nIn my idea we have to work in order to know what is the result\nfrom the (AFM andor Raman) investigations on values\n(obtained using the adequate experiments…)\nfor adhesion of thin layers on linen fibrils (See also :\n“ghosts”, physical parameters and their effects on adhesion).\n— —\nWhat was the pressure level in vacuuming operations (by Riggi) ?\n… and now …\nIs it possible to measure and reproduce the presumed effects\n(= ghosts) on treated linen fibrils (obtained in your experiments) ?\nIn my opinion the answer is :\nYes …\n\n","date":"April 5, 2014 at 6:15 am","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","id":"comment-96743","author":"piero","site":"shroudstory"},{"title":"Let the Experiments Begin","post":"results and not reults\nSorry …\n\n","date":"April 5, 2014 at 9:28 am","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","id":"comment-96779","author":"Piero","site":"shroudstory"},{"title":"Let the Experiments Begin","post":"I believe that you cannot find the same idea about adhesion of thin layers\n(that I wrote in this blog) into the paper :\nMicroscopic and Macroscopic Characteristics of the Shroud of Turin Image Superficiality\nLink :\nhttp://www.ingentaconnect.com/content/ist/jist/2010/00000054/00000004/art00001\nI am near sure of that … !!!\n\n","date":"April 5, 2014 at 9:36 am","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","id":"comment-96781","author":"Piero","site":"shroudstory"}]
