[{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"I think O.K. shows quite clearly that the Dürer work really does not have much in common with the images from Manoppello or the Shroud.  I am think the comparison between Manoppello & Shroud show not much in common.\n\n","date":"September 2, 2014 at 8:10 am","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148053","author":"Andy","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"Commendable work OK. You make a very good observation: perhaps the Durer work is an imitation of the Manoppello and not the other way around.\n\n","date":"September 2, 2014 at 10:47 am","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148082","author":"David Goulet","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"I have read what OK wrote (short presentation about Manoppello, Shroud and Duerer)\nand I then I am still curious about “the lost technique of painting on transparent fabrics”…\nI am curious because I have read that :\n>it is not possible to paint on fabric made of marine byssus.\n[Here my note : I am not sure of that…\nIn any case Prof. Donato Vittore has found that on the cloth there are no traces of color.]\n>marine byssus can only be “tinted”, for example through a purple dye, but one can not “paint” anything on it. The salt remaining between the threads sooner of later will cause any color to fall from the threads.\nSource :\n“discussion with Fr. Heinrich Pfeiffer on hypothesis put forth by the photographer Roberto Falcinelli”…\n(Link:  http://www.voltosanto.it/Inglese/dettagliofnti.php?x1=19 )\nand\nPfeiffer also said:\n>we could say that we would be very proud if we possessed\na heretofore unknown original of the great artist of Nuremberg. …\n— —\nUnfortunately we have not yet seen the results from the\ntransmitted light spectroscopy (of Manoppello’s Veil) !\nThis is a negative point.\nThen, in my opinion, the first useful thing to do can be an attempt to obtain a transparent portrait on byssus (= an usesuf thing for the controls and experiments with transmitted light spectroscopy).\nThat work seems to be important in order to show the comparisons about the spectroscopic controls. Do you agree on that idea ?\nI hope in your answers…\n\n","date":"September 3, 2014 at 8:39 am","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148264","author":"Piero","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"I agree.\n\n","date":"September 3, 2014 at 9:15 am","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148272","author":"O.K.","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"Piero, I interviewed Fr. Pfeiffer some years ago and obtained some data on the veil, however the overall the impression was that there is a lot more work to be done. As he said, the veil cannot be removed from the frame, it is delicate and can be damaged beyond repair if this done. Your suggestion about a control, as an “attempt to obtain a transparent portrait on byssus”, is  correct.\n\n","date":"September 3, 2014 at 11:23 am","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148294","author":"Louis","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"Piero: “it is not possible to paint on fabric made of marine byssus”. How do you know that the veil is made of sea byssus?\n\n","date":"September 3, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148300","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"Because Chiara Vigo thinks so, that’s why, Gian Marco.\n\n","date":"September 3, 2014 at 12:05 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148301","author":"O.K.","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"Oskar, Chiara Vigo was taken to Manoppello by Paul Badde, watched the veil from outside the frame and without a microscope or a magnifying glass and immediately stated that it was sea byssus. And you think that this is a proof? Among other things, sea byssus has a somewhat golden colour. Badde had subsequently to postulate that a miracle had discoloured the threads in the areas where the veil is white. Several students have examined the veil during past years but nobody could demonstrate that it is made of sea byssus.\n\n","date":"September 3, 2014 at 3:02 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148334","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"Scientific sources to whom I have had access have raised the question of the textile being linen. I am being open-minded because the mystery is still not solved, the main problem being the fact that the veil cannot be removed from the frame.\n\n","date":"September 3, 2014 at 12:36 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148309","author":"Louis","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"The scarcity of byssus today, and the character of the grand dame of contemporary byssus production, Chiara Vigo, have combined to give it a more or less impenetrable mystique. Daniel McKinley (Pinna and her Silken Beard: A Foray into Historical Misappropriations) does a lot to dispel the mythology that has grown up around it (particularly with reference to transparency in ancient textiles), albeit without reference to Manoppello, and Jaworski (The Properties of Byssal Threads, the Chemical Nature of their Colours, and the Veil of Manoppello) has examined byssal threads in great detail, and found compelling similarities between them and reported observations of the Manoppello veil, but still concludes that Giulio Fanti is probably correct in saying that the fabric is probably linen. A compendium of surviving specimens of nineteenth century byssus is being compiled in Switzerland, virtually none of which are woven, knitting or crotcheting being the dominant method of manufacture. Although I have not seen any painted specimens, that may be more to do with the deep golden brown colour of the fabric than because it is ‘impossible to paint.’ Jaworski found that the fibres were hydrophobic, but that microgranules of colour remained on the surface of fibres which he tried to paint with watercolour. Perhaps a light oil would work better. Also, I don’t think byssus is particularly fragile. It is very susceptible to insects, which is probably why there are no ancient examples to be found, but seems to have been used for gloves and stockings in some abundance, for which a reasonably sturdy material is essential. The fibres are reported as being an average of 25um (Jaworski) or 14um (Fanti) in diameter, which is much thicker than silk, and Fanti reported a thread thickness of 120 um, which is comparable to the linen thread thickness of the Shroud.\n\n","date":"September 3, 2014 at 1:36 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148322","author":"Hugh Farey","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"Daniel McKinley (Pinna and her Silken Beard: A Foray into Historical Misappropriations) does a lot to dispel the mythology that has grown up around it (particularly with reference to transparency in ancient textiles), albeit without reference to Manoppello\nhttp://www.wbrg.net/biblio/index.php?media_id=3103&show=detail&buchstabe=M\nAny pages of particular interest?\n\n","date":"September 3, 2014 at 2:08 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148328","author":"O.K.","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"From the website (in four languages) of Felicitas Maeder, a Swiss specialist about sea byssus:\nhttp://www.muschelseide.ch/en/biologie/byssus/faseranalyse.html\n“Sea-silk fibres have a smooth surface, are not very regular (compared fibre to fibre) and don’t have any structure.\nThe fibre cross-section is elliptical.\nThe fibre diameter is between 10 and 50 µm.\nUsing infrared spectroscopy, the fibre cannot be distinguished from silk or other animal fibres, because they have a similar chemical structure.\nThe nitrogen content is much lower than in other animal fibres.\nSea-silk is extremely flexible, especially when wet.\nThe resistance is low compared with other fibres, even weaker than wool.\nIn wet state the resistance decreases by about 50%.\nSea-silk fibres are flammable.\n“…………. The cross-section of the byssus fibre is – in contrast to all other natural fibres – significantly elliptical or almond-shaped. It shows no structure.\nThe fibre diameter varies within a single fibre. With 10-50 microns it is comparable with other natural fibres, such as mulberry silk or Egyptian linen 11-15 micron, Merino wool 18-25 micron, cotton 12-35 micron, mohair/alpaca 20-40 microns. From ancient times we know linens of a yarn diameter of 50 microns and a diameter of each fibre of 11 microns (Cook & El-Gamal 1990). So the statement of Zanetti (1964), that sea-silk is much finer than the finest silk – «molto più fine delle sete più fini» – can be refuted.”\n\n","date":"September 3, 2014 at 3:26 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148338","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"I mentioned Chiara Vigo and provided a link on another thread yesterday. She fell on her knees the instant she saw the Manoppello veil, and her religious faith should be respected. But now we have science telling us that it may not be byssus, that brush strokes can be seen in some areas and so on.  \nWe have to be strictly objective, there is no “Veronica” in the gospels.\n\n","date":"September 3, 2014 at 2:56 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148333","author":"Louis","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"Gian Marco, what do you want to achieve? You asked Piero “how do you know that the veil is made of sea byssus?” and I, ironically answered for him that he knows because Chiara Vigo thinks it is made of sea byssus. I don’t know whether she is right, or not. It is a secondary matter for me at this moment.\n\n","date":"September 3, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148348","author":"O.K.","site":"shroudstory"},{"title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K.","post":"First of all, as first step, we have to distinguish byssus from linen!\n… and typical spectrum of proteins is different with respect lignocellulosic materials !…\nAll protein fibres – and so all animal fibres – show a similar IR spectrum: at 3300 cm-1 and the amino and hydroxyl peaks at 2800cm-1 CH vibrations at 1650 cm-1, the characteristic vibrations of the amide groups of proteins. In this they differ markedly from the natural fibres of cellulose, which do not have amide groups. \nThen we have to find the truth investigating the question :\nAre the fibers made of silk or byssal [= Sea-silk] threads?\n— — —\nS p e c t r o s c o p i c     c o n t r o l s .\nUntil now I have found only as a vague reference…\nIt is the following study:\n“In-situ Raman Spectroscopic Imaging of a Mussel Coating and Adhesive”\nby\nMasic, Harrington, Waite and Fratzl\nAIP Conference Proceedings, v.1267, 358-359 (2010) 08/2010;\nDOI: 10.1063/1.3482556\nSource: OAI\nHere an excerpt from the Abstract:\n>The mussel has evolved a very interesting and efficient way of attaching to hard substrata in wave-swept rocky seashores. This is enabled by a bundle of fine protein based threads called the byssus. The byssus is emerging as an effective model system for studying the requirements for underwater adhesion, wear resistance and combined hardness and extensibility … … etc. … Here we report in-situ high-resolution Raman spectroscopic imaging of the byssal coating and plaque showing micron level spatial distribution of various proteins and their interaction … etc. …\n— —\nIt is important to find the right spectroscopic references about byssal threads\nand then … to perform the experiments, the controls with spectroscopic analyses on original material (= relic, presumed [as textile material] byssus…) and on a transparent portrait on byssus (or an useful thing obtained on byssus in order to compare spectroscopic results !).\n— —  * * — * *  — —\nWe can consider other informations,\nfor example, from the study:\nLocation and analysis of byssal structural proteins of Mytilus edulis\nDr. Christine V. Benedict and J. Herbert Waite\nJournal of Morphology\nVolume 189, Issue 2, pages 171–181, August 1986\nAbstract\n>The acellular attachment organ (byssus) of the marine mussel Mytilus edulis L. is composed of threads that emanate from the body of the mussel to adhesive discs that anchor the threads to rocks, sand and other mussels. Three proteins have been purified by immunohistological methods and located to specific regions of the byssus. A collagenous protein with subunit molecular weights of 53,000, 55,000 and 65,000 is found in the matrix of the elastic thread region. Its 73,000-MW precursor was extracted from foot glands in the area proximal to the animal body and was identified by immune cross-reactivity. A cystine-rich, acidic protein was found in all regions of the byssus associated with a third protein, the polyphenolic protein. The L-dopa-containing polyphenolic protein appears in the cortex of the entire thread and adhesive plaque and at the substrate-plaque interface. Antiserum to this protein stains spherical vesicles in the phenol gland of the foot. Using immuno-electrophoretic methods, the polyphenolic protein and the cystine-rich protein were shown to form high molecular weight aggregates with aging of the byssus.\n\n","date":"September 4, 2014 at 6:27 am","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","id":"comment-148476","author":"Piero","site":"shroudstory"}]
