[{"title":"Mars, Weeping Mary and the Shroud","post":"I really enjoyed the article. I am one who likes to stay a top on some of the news especially local and world.  It still scares me at my age of 73 to see the amount of peoples refusal to learn the truth of the world and daily living.\n\n","date":"September 25, 2014 at 6:10 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155700","author":"ekmcmahon","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Reality is far more complex than the “rationalists” would ever admit. Their response to anything that doesn’t square with their dogged agnosticism or atheism is to simply write it off has a hoax.\nSome decades ago, we had in my hometown (Syracuse) a weeping Mary frenzy that indeed was a a hoax. A pubescent young girl claimed that she had dropped a statute that broke and when she picked it up the head and kissed it, it wept. (It might have been St. Anne, Mary’s putative mother).\nThere was no scientific investigation to speak of for and after a few weeks or a couple of months  of hysterical viewings it was found to be a hoax. Later, when I was in high school, one of classmates, who was from the same neighborhood,  remarked, “If she kissed me, I would have cried too.” It wasn’t a comment on her looks. \nAnyone, who dismisses the Shroud image as other than an image of a horribly tortured, crucified man that was by all probability created within three days of his death, is a fool whatever his credentials. Science demonstrates that it IS. (caps not a typo)\nAnd the cause of science is not advanced by “scientists” who attack a particular religious belief without doing the science. You wonder why the fundamentalist “young earthers” reject science? The arrogance of lumping all religious  belief together with known absurdities may be one reason. It is far easy for them to cling to error than accept the judgment of others that reject willy-nilly all religious thought.\nIn the case of climate change, the atheists and agnostics who proselytize for atheism instead of sticking to scince, are as big a danger as those who are driven to reject scientific proof by the arrogance of some scientists. And thn the question arises, whose paying for the opinion?\nSee Dan Klotz, http://newswatch.nationalgeographic.com/2014/09/22/cannot-save-climate-without-trees/\n\n","date":"September 25, 2014 at 6:36 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155718","author":"John Klotz","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"John,\nReality is very complex as you write. In Plato’s “Allegory of the Cave” he talks about what we see as reality are really just shadows of reality. That’s as true back then as it is now.\nHaving said that let me say I’m an agnostic and not a fool. For years I debated Christains on the internet many of whom were fundamentalist who believed the earth was only 10,000 years old, the grand canyon was caused by the world flood, Satan when around planting Dinasaw bones, etc.. They didn’t even know what their own Christain scholars have written. Should I consider all Christains fools because of a small group? \nJust because someone may disagree with you doesn’t mean they are less imformed as you. Nor does it mean they are any less able to judge the evidence.\n\n","date":"September 25, 2014 at 11:26 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155892","author":"John Green","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Dinosaur\n\n","date":"September 25, 2014 at 11:40 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155907","author":"John Green","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"I missed your typo just as I often miss mine.\n\n","date":"September 25, 2014 at 11:43 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155909","author":"John Klotz","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"John,\nI am not as simpleminded as I may appear on occasion. There are obviously  many people who disagree with me and they are not fools. That would be a foolish statement. \nHowever, we do not order our lives by proof beyond a reasonable doubt. Some one who purports to be a scientist who doubts the authenticity of the shroud on the basis of the carbon dating without digging deeper is either disingenuous or a fool. Note I said “on the basis of the carbon dating” and “purports to be a scientist.”\nI would be happy to debate in any forum anyone who is a “scientist” and who rejects the authenticity of the shroud “on the basis of the carbon dating.” Right now however, after registering for the St. Louis conference, my travel budget is a bit constrained.\n\n","date":"September 25, 2014 at 11:41 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155908","author":"John Klotz","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Yeah I also have a problem with people that don’t look at both sides. I don’t buy the carbon dating and I think it’s more likely than not that the shroud authentic and the image is of Jesus. What caused it I’m not sure right now.\n\n","date":"September 26, 2014 at 9:28 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-156803","author":"John Green","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"I’m unsure the writer is as illuminated as is claimed.\n\n","date":"September 25, 2014 at 8:12 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155797","author":"Andy","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Even brilliant rationalists get lazy sometimes. Or have blind spots.\n\n","date":"September 25, 2014 at 9:14 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155821","author":"David Goulet","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"As a “fool” as defined by Mr Klotz above, I feel no qualms about saying that his post is nonsense from begining to end. The complexity of reality was discovered and exposed by rationalists, not denied by them. A truly dogged agnostic would not write anything off as a hoax; that would be a rejection of his agnosticism. In 1949 11-year old Shirley Anne Martin made tears come from the eyes of the broken head of a statue of St Ann for a couple of days. There were no weeks or months of hysterical viewings, although she did appear on television demonstrating her ability.\n“Anyone, who dismisses the Shroud image as other than an image of a horribly tortured, crucified man that was by all probability created within three days of his death, is a fool whatever his credentials. Science demonstrates that it IS.” I thought we’d grown out of this childish insult-throwing by now. Science has opened many lines of investigation into the Shroud, but closed very few. It has certainly not conclusively demonstrated that the Shroud is authentic.\n“And the cause of science is not advanced by “scientists” who attack a particular religious belief without doing the science.” Can Mr Klotz name any of these “scientists” and their attacks? Which religious belief does he think has been attacked in the absence of “doing the science?” Does he think belief in the authenticity of the Shroud is a religious belief? Does he think rejection of its authenticity must be a rejection of religion?\n“In the case of climate change, the atheists and agnostics who proselytize for atheism instead of sticking to scince, are as big a danger as those who are driven to reject scientific proof by the arrogance of some scientists. And thn the question arises, whose paying for the opinion?” What on earth does this mean? Atheists are as big a danger as climate-change deniers? To whom? Do atheists deny climate-change?\nCalling people fools tells the reader, I think, more about the character of the caller than that of the called.\n\n","date":"September 25, 2014 at 9:40 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155841","author":"Hugh Farey","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Hugh,\nI find your post insulting. Are you familiar with Psalm 14:\n“14 The fool hath said in his heart, There is no God. They are corrupt, they have done abominable works, there is none that doeth good.” \nPerhaps you should write an outraged letter to King David, although you would be a little late.\nActually, when i was in high school, one of my teachers quoted that as “only a fool says there is no God.” Do they quote scripture at the school where you teach?\nI don’t know how old you are, but at the time of the Martin incident I was 12 or 13. Not yet in high school.  I remember well the hysteria which while it did not amount to thousands clogging the streets, it did include a crowd gathering to watch her kiss the statute. Granted I was not there for the viewing (or ostentation as it were.)\nI am afraid if you find my definition of rationalist offensive. TFB (The initials stand for something i will not write, at least not in this blog. Perhaps  RTB would be more appropriate -Really too bad.) TFB might have been what Lee might have said were he a bit more earthy in the Patton mode after Pickett’s charge disastrous climax at Gettysburg. \nFrankly, I find those who would sip and savor their ideas as if they were fine wine too be be both boring and often wrong. \nOne of my favorite lines from Shakespeare was MacBeth’s defiant challenge to MacDuff:\n“Lay on, Macduff,. And damned be him that first cries, ‘Hold, enough!'”\nAs far as scientists who while eminently qualified but are dead wrong on the Shroud I’ll give you two: Richard Dawkins and the late Carl Sagan. I discuss both in my manuscript. You’ll have to buy the book when it’s out. Maybe it’ll be  a free-bee  of sorts in St. Louis if you are there.\n\n","date":"September 25, 2014 at 10:34 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155868","author":"John Klotz","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Calling people fools tells the reader, I think, more about the character of the caller than that of the called.\n\n","date":"September 25, 2014 at 10:45 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155875","author":"Hugh Farey","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Hugh,\nYour comment reminds of the old childhood chant. “I am rubber you are glue, what you say about me  bounces-off me and sticks on you.”\nYou asked me to name scientists, I named two. I am sure you know who they are and how well credentialed they are. That does not correct the foolishness of their comments on the Shroud.\nDawkins once noted skepticism about the carbon results and then late described the carbon dating as “rock solid.” Any one who believes that at this point in time  has rocks in their head. Sagan made a remark in his final book about carbon dating being a wonderful process by citing it as debunking the Shroud. The book was published posthumously before the avalanche of science proving the carbon dating defective for a variety of reasons. He can be excused. I discuss both in my book.  (It’s coming, it’s coming)\nYou can be skeptical about the Shroud if you wish, but citing the carbon dating is not skepticism but asininity. I  use that word to describe the statement at the carbon press conference that “someone got a piece of linen and just flogged it.”\n\n","date":"September 25, 2014 at 11:01 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155884","author":"John Klotz","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"“avalanche of science proving the carbon dating defective for a variety of reasons”\nAn avalanche of science or an avalanche of bullshit ?\n\n","date":"September 25, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155925","author":"PHPL","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"How much of the later science have you read. Can you give me anthology that supports your position?\nThere will be more than  few in my book.\n\n","date":"September 25, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155952","author":"John Klotz","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"“And the cause of science is not advanced by “scientists” who attack a particular religious belief without doing the science.” In response to my challenge, Mr Klotz named two: Carl Sagan and Richard Dawkins. To the best of my knowledge Sagan did not attack belief in authenticity of the shroud at all. In a radio interview on YouTube he admitted having respect for Walter McCrone, but, not having read anything else about the Shroud, did not commit himself to any particular viewpoint, and certainly did not attack any religious belief. Richard Dawkins, on the other hand, has spent a lot of time and energy “doing the science” and come to the mistaken conclusion that God does not exist. This is not a “particular religious belief,” but a general attack on the whole ideology. The cause of science is certainly not advanced by this view – and in fact such was the naivity of The God Delusion that the cause of religion was rather strengthened by it – but it has little to do with the Shroud. This was mentioned in his book The Greatest Show On Earth, in connection with radiocarbon dating, which, “doing the science,” he accepted. However he also accepted that the date could be wrong. “The dating of the shroud remains controversial … For example, the carbon in the shroud might have been contaminated by a fire.” This is not an “attack” on “a particular religious belief without doing the science.”\nSo, as far as I can discover – and please quote chapter and verse if I’m wrong – neither Carl Sagan nor Richard Dawkins have attacked belief in the authenticity in the Shroud. Furthermore, such a belief is not, for most people, a religious belief anyway, but a conclusion derived from evidence.\nAfter calling me a fool, Mr Klotz now finds my careful exposition of his nonsense insulting. I can’t think why. As I’m sure King David would agree, not all fools deny the existence of God, many of them are his most devoted servants. And yes, being a Catholic school, the bible is quoted frequently here. “Love those who hate you” is a favourite…\nDetails about Shirley Anne Martin are readily available on the internet as reports in numerous papers. There were no “weeks or a couple of months of hysterical viewings,” as I said.\n“I am afraid if you find my definition of rationalist offensive.” Of course I don’t find your definition offensive. For a start you don’t give a definition, and for a second your only mention of the word occurs in a sentence of such absurd generalisation no one could possibly take it seriously.\nSadly, I will not be able to come to St Louis, but I will be delighted to buy your book for the going rate on Amazon.uk when it arrives. I wish it every success.\n\n","date":"September 25, 2014 at 11:46 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155911","author":"Hugh Farey","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Hugh,\nRead his book. He praised carbon dating and called the Shroud of Turin “a pious hoax.” [IMVHO the only hoax was the D’Arcis claim.]\n“If we can measure the amount of radioactive parent material\nand the amount of daughter decay product in a sample, we\ncan determine how long the sample has been around. In this\nway we find that the so-called Shroud of Turin is not the\nburial shroud of Jesus, but a pious hoax from the fourteenth\ncentury (when it was denounced by Church authorities)…”\nCarl Sagan, p. 21, Billions and Billions: Thoughts on Life and Death and the Brink\nof the Millennium (Random House, New York 1997)\nGiven the books posthumous publication, there was apparently intended irony in its title.\n\n","date":"September 25, 2014 at 11:55 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155918","author":"John Klotz","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Fair enough. Thanks for the reference.\n\n","date":"September 25, 2014 at 1:25 pm","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155967","author":"Hugh Farey","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Dawkins was wrong- it was not denounced by the Church authorities- in 1390 the anti-pope Clement VII accepted the Shroud as a justified object of veneration, even worthy of an indulgence on condition that it was publicly  announced before each exposition that it was not authentic. These objects of veneration were very common. I have just seen a crucifix in the Church of Santa Maria in Castello in Genoa where I am leading a study tour which has been venerated ever since the Christ on the Cross was seen to move his head in assent to a question. I suspect that there were similar, now unrecorded, miracles associated with the Shroud that gave rise to its status. I leave it open as to whether Clement was right about its authenticity or not but he certainly did not denounce it!\n\n","date":"September 25, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155951","author":"Charles Freeman","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Re that long-awaited book:\nIt’s a thousand pages, give or take a few\nI’ll be writing more in a week or two\nI can make it longer if you like the style\nI can change it round and I want to be a paperback writer\nPaperback writer","date":"September 25, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-155959","author":"Colin Berry","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"The Shroud is a box trap for skeptics, ignorance…\n\n","date":"September 26, 2014 at 6:35 pm","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-157066","author":"anoxie","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"I had earlier named two scientists that had used the carbon dating to debunk the Shroud: Carl Sagan and Richard Dawkins. When challenged, I easily found the Carl Sagan quote, it was from last  book and I quoted it. This morning reviewing my manuscript I found the Dawkins quote. It wasn’t from a book but from a posting on his web site.\nFor information purposes here it is:\n“However two years later, on his foundation’s web site, he seemed quite\nself-assured that the Shroud is a fake. In attempting to rebut the finding of\nItalian scientists’ “new evidence” that demonstrated that image of a crucified\nman on the Shroud could not be faked, he wrote:\n“The new ‘evidence’ amounts to yet another ‘Argument from\nPersonal Incredulity’: the Italian scientists cannot understand\nhow it could have been faked. By contrast, the carbon-14\nevidence that the shroud’s linen is much too young to be the\nshroud of Jesus is rock solid. Three independent labs, in\nArizona, Zurich and Oxford, were each given four samples,\nmaking 12 dating in all” (p. 13, Coming of the Quantum Christ)..\nThat he got his facts wrong, implying that there were twelve samples carbon dated is a given. That he ignores the evidence of the anomalous nature of the sample site is an inconvenient fact that he does not either know or chooses to ignore – or rebut.\nIn any event, he, as I stated my previous post, used the carbon “rock-solid” carbon dating to debunk the Shroud.\nD=I do’t mean to str a debate but I just wanted to get the record straight.\n\n","date":"September 27, 2014 at 6:32 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-157177","author":"John Klotz","site":"shroudstory"},{"title":"Mars, Weeping Mary and the Shroud","post":"Again, thanks for the reference.\n\n","date":"September 27, 2014 at 7:28 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","id":"comment-157191","author":"Hugh Farey","site":"shroudstory"}]
