[{"title":"Memories of a Shroud of Turin obsessed vicar in Coventry","post":">Even then it seemed odd to me that an evangelical parson (evangelicals base their faith on the Bible alone) – should be an advocate for the authenticity of a Roman Catholic relic.\nI am an evangelical who had this prejudice for nearly 40 years until 2005 when I read a book by evangelicals Stevenson and Habermas (“Verdict on the Shroud“), which set out the evidence for the Shroud’s authenticity. But that is all it is – a prejudice.\nGod is neither an evangelical nor a Roman Catholic. And there were no Protestant churches in existence in 1355 (the Protestant Reformation started in 1517) when the Shroud first appeared in undisputed documented history in Lirey, France. Moreover, the Roman Catholic Church has only owned the Shroud since 1983, when it was bequeathed to it in the will of ex-King Umberto II, whose Savoy family had been the owners of the Shroud since 1453.\nBut even on evangelical (“the Bible alone”) premises, there is reason to accept the authenticity of the Shroud. The Bible records in all four Gospels that Jesus was buried in a linen Shroud (Mt 27:59; Mk 15:46; Lk 23:53; Jn 19:40). And the Bible also records that the disciples found Jesus’ burial clothes left behind in the empty tomb (Lk 24:12; Jn 20:5-7). The Bible does not record that the disciples left Jesus’ graveclothes in the tomb, nor that they later disposed of them. \nSo on purely evangelical (“the Bible alone”) premises, evangelicals have no reason to reject the authenticity of the Shroud. Indeed, if they were consistent, since the Bible does go out of its way to mention Jesus’ linen burial Shroud: “And Joseph took the body and wrapped it in a clean linen shroud” (Mt 27:59); “And Joseph bought a linen shroud, and taking him down, wrapped him in the linen shroud …” (Mk 15:46);  “Then he took it down and wrapped it in a linen shroud …” (Lk 23:53); and does not mention the disciples abandoning or disposing of it; evangelicals should, on balance, be in favour of the Shroud’s authenticity, or at least be neutral towards it.\n>Even then I was sceptical about the “Shroud”, as I am to this day!\nSo was I, for nearly 40 years, until I set aside my prejudice and actually read the evidence for the Shroud’s authenticity. Since when has prejudice based on ignorance been an evangelical principle, or something to be proud of?\n\n","date":"February 2, 2012 at 10:26 am","url":"https://shroudstory.com/2012/02/02/memories-of-a-shroud-of-turin-obsessed-vicar-in-coventry/","cat":"other_blogs","id":"comment-7856","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Memories of a Shroud of Turin obsessed vicar in Coventry","post":"I agree with Stephen E. Jones 100 %…I am an R. C. but that has never stopped me from  mingling and having fellowship with other different denominations.I still practice my Catholic faith …but at the same time I will meet with any other Christian because I can respect what they believe and why they believe it.It really is possible for all Christians denominations to do this if we can put our differences aside and focus on our similarities.\nI am happy that the Shroud of Turin relic is something else which enables us to do this.\n\n","date":"February 2, 2012 at 12:47 pm","url":"https://shroudstory.com/2012/02/02/memories-of-a-shroud-of-turin-obsessed-vicar-in-coventry/","cat":"other_blogs","id":"comment-7863","author":"john macgillivray","site":"shroudstory"}]
