[{"title":"Mental Health Break","post":"Bless him.\nI am loath to think of Stephen as either stupid or wilful, so I assume I did not express myself sufficiently clearly. Lest any of our readers on shroudstory have been similarly misled, let me clarify. I do not for a moment suppose that the apearance of the image on the shroud was a freak combination of circumstances wholly unrelated to its subject, such as those wonderful cloud formations and pieces of pizza that turn up on the web every so often, but I do think that the image as we see it now was probably not what its creator intended. I think it likely that there was something on the shroud, possibly a pigment of some kind, possibly even material glued in place, which has come off, leaving the image we see today. It could have been scorched by a bas relief, either when it was heated (although I find it hard to think that could have been wholly inadvertent), or when a protective covering of paint or varnish or cleaning material or preservative made contact with the cloth. The concept of the volkringer image has occsionally been brought up, in which context you might like to peruse this: http://imgur.com/9taZ8vg, which is the tissue-paper protective covering to one of the plates in my (electronic) copy of Vignon’s 1902 book, the Shroud of Christ. Some of the burn-hole pattern is clearly visible – by accident.\nThere are plenty of authenticists who also think the shroud is an accident, an unintended consequence of the circumstances surrounding the entombment of Jesus. Some say that the image is not mentioned in the bible because it developed over time.\nBrowsing Stephen’s blog (for the primary source, as usual) I find that his flight of fancy was actually written as a response to a correspondent calling himself the devil. Strange bedfellows!\n\n","date":"May 5, 2014 at 9:21 am","url":"https://shroudstory.com/2014/05/05/mental-health-break-2/","cat":"other_blogs","id":"comment-111761","author":"Hugh Farey","site":"shroudstory"}]
