[{"title":"Metaphors or Mix Up?","post":"Some of the illustrations of how the nails were driven show that it would appear on the front of the victims hand as being at the base of the thumb but still above where the hand folds at the wrist and thus still in the palm. The nail enters there and is driven down and back towards the forearm and will exit on the back of the victim’s hand in the area which would be seen as the back wrist. This is why on the shroud it appears in the wrist because you are seeing an exit wound. If this hypothesis is plausible then anyone viewing a victim crucified realtime like this will witness it as the nails being driven through the palms.\n\n","date":"January 9, 2012 at 5:43 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6733","author":"Chris","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"That’s Zugibe’s point of view but I personally disagree.  Too much complex way to drive a nail !  The Roman didn’t had time to lose when they were performing an execution.  Instead I prefer the conclusion of Barbet when he said that the nails were most probably driven through the wrist at a NATURAL angle of 90 degrees and he even made real experiments of nailing with dead bodies and these experiments clearly showed that wherever he drove the nail in the wrist region, the nail always found the Destot space (an empty space in the wrist with small bones all around) and continue through that space to exit exactly where the Shroud shows it.  I think that’s the most probable way the Roman nailed their victims because it’s the simplest way.\n\n","date":"January 9, 2012 at 6:01 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6736","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Complex as it may ‘seem’ to you, it would not be much of an ‘issue’ for one whom has done it countless times (such as a Roman soldier in a crucifixion detail)! Also as ‘simply’ the nail would be pushed into the area of the palm on a angle towards the wrist, where the thumb would start to retract into the palm and the nail then would follow thru the bone ‘opening’ quite easily. Zugibe also shows quite well, Barbet in error, as in Barbet’s theorized method the Nerve would not be severed to retract the thumb!!….So Barbet’s method is not so “probable” anymore is it? Plus we have hundreds of years of depictions of the nails thru the palms! Are we just supposed to simply discount this and the stigmata?? …I think that would not be prudent.\nR\n\n","date":"January 9, 2012 at 6:44 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6738","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Bullsh**  Zugibe was ALWAYS against every possible conclusion reached by Barbet.  ALWAYS.  Barbet was not the fool depicted by Zugibe sorry.  He’s the only one actually to have done real crucifixion experiments on dead bodies !  You’re free to believe Zugibe’s conclusion of course.  But I’m free to reject them.  For the nailing in the bottom of the palm proposed by Zugibe, it was influenced (in some way) by the stigmatas of some saints.  And it’s true because he speak freely about that in his paper.  Not a very scientific thinking.\n\n","date":"January 10, 2012 at 9:34 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6766","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"One more thing Ron about Zugibe’s hypothesis versus Barbet for the nailing in the wrist area : If you apply Occam razor to both hypothesis, Barbet will reach higher points in a probabilistic scale, simply because it is MORE NATURAL to drive a nail like he explain and it is far more EASY !  Of course, Zugibe’s way of nailing is possible, but, if you’re honest with me, you must admit that it need more “special assumptions” than Barbet’s way of nailing.\n\n","date":"January 10, 2012 at 9:45 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6769","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"La crítica que hace Zugibe es muy DESAFORTUNADA.\nPierre Barbet NO cometió ningún error en su trabajo y la grave dislocación de la estructura osea del carpo al penetrar un clavo de 1 cm de sección (como muestra en la radiografía) justifica más que sobradamente la lesión directa del lado sensitivo del nervio mediano y la lesión indirecta del lado motor, sometido a una enorme presión.\n\n","date":"January 9, 2012 at 11:07 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6751","author":"co","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"CO is totally right !!!  Barbet’s experiments PROVED that his way of nailing the wrist was totally compatible with what we see on the Shroud !  What a good comment !  Zugibe, in my opinion, was a bit jealous of Barbet and would have loved to be the first one to talk forensically about crucifixion !  That’s what I feel strongly, after having read all his critics of Barbet (some of them unjustified) AND having read carefully Barbet’s book !  Ron, have you read Barbet’s book at least ?\n\n","date":"January 10, 2012 at 9:38 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6767","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I forget to mention the title :  A doctor at calvary.  It is, by far, THE best book I’ve ever read about the Shroud of Turin.  And I don’t care that some people think old stuff is not as good as recent stuff about the Shroud.  This book prove them wrong !  A MUST-READ for every fanatic of the Shroud of Turin !\n\n","date":"January 10, 2012 at 9:41 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6768","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Is that what Co said? I must have lost something in the translation….\nBut even so, even if Barbet’s experiments prove his way is compatible (with what we see on the Shroud), you are FORGETTING one very important aspect; WE do not see the palm side of the wrist on the Shroud!! SO ANY conclusion can only be SPECULATION. You forget also that Zugibe, for whatever reason caused him to start his own experiments also used ‘Personal experience’ with wounds, models, and also did many experiments. I read the book ‘Doctor at Calvary’ many years ago, I will admit I should read it again as I have most likely forgotten much of what I read but in saying that and in taking both views; We must consider things such as artists depictions over the centuries and the stigmatas seen over the centuries as important clues to this, and not just discard them. In saying that it is in my opinion Barbet’s hypothesis may be in error.\nR\n\n","date":"January 10, 2012 at 4:47 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6788","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I just bonified what CO said with more informations about Barbet’s experiments and conclusions.  For the speculation question Ron, I want you to read my posts again !  I’ve clearly said that Zugibe’s hypothesis can be true, but like many questions regarding the Shroud, since we’re left with hypothesis and speculations (as you say), then we must judge what hypothesis has more chance to be close to the reality.  And the best way to judge between 2 different hypothesis is, as I said before, to used the Occam razor principle.  And, as I said before, when we used this principle, Barbet’s hypothesis reach a higher point in a probabilistic scale than Zugibe’s hypothesis, just because his description of the way of nailing the victims hands to the cross is much more simplier and more easy to do.  That’s all I said.  I never pretend Zugibe’s hypothesis is 100% off-track.  I just say that Barbet’s hypothesis seem more simple and easy to do in the context of a Roman crucifixion.  In other word, the way Barbet describe the nailing of the wrist (and don’t forget that he made real experiments of nailing a dead body) seem more “natural” than Zugibe’s hypothesis, and don’t forget also that the outcome is the same :  the wrist is completely locked and the victim cannot remove his hands from the cross, even if he pull hard with his arms.\nI’m pleased that you were able to read his book and yes, it would surely be a good thing to read it again because it is brilliant and very interesting from a forensic point of view !\nFor the Stigmata topic, read the answer I gave to Chris below.  Tomorrow, I’ll write Barbet’s opinion about that, which is very interesting.\n\n","date":"January 11, 2012 at 12:04 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6813","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"One last thing that is very important to remember (or to learn) about Barbet’s experiments of driven a nail through the wrist :  EVERY time he drove a nail in the wrist area, it ALWAYS found Destot space before coming out on the backside of the wrist, and this was true, no matter where he placed the nail first, as long as it was in the wrist area.  ALSO :  EVERY time, the nail cut a portion of the median nerve.  Barbet was categorical on this subject.  You know why ?  Because after his nailing experiments, he did a forensic desiccation of the wrist area !  EACH time, he notice that only a portion of the median nerve was cut, so that it would cause a terrible pain in the arms each time the person crucified would move his arms on the cross.  An atrocious torture !  I imagine the pain was maybe like when the dentist touches the nerve of your teeth.  I experiment that a few times in my life.  It’s simply excruciating !  That’s why I always thought that most crucified persons must have faint a few times while they were on the cross.  The pain must have been so brutal that they could not support it all along…  And Jesus accept that freely to save every poor people that we are !  It deserve some thoughts about the greatness of the love of God for his children, don’t you think ?\n\n","date":"January 10, 2012 at 10:40 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6774","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"If Barbet is correct, as clearly you believe he is, then what does that mean for the original question posed in this blog? What’s your opinion regarding the stigmata with Padre Pio?\n\n","date":"January 11, 2012 at 11:03 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6810","author":"ChrisFromDallas","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Hi Chris !  Good question.  Barbet talk specifically about this topic in his book.  Give me today and tomorrow, I’ll post Barbet’s thoughts about that here.  I agree completely with his opinion, but I don’t want to forget something.  So, wait for me to post his exact opinion about the Saints with stigmata.  And don’t forget that Barbet was a catholic like me who believed in the resurrection of Christ, so his point of view on this specific question is interesting.\n\n","date":"January 11, 2012 at 11:44 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6811","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I defer to the academic points expressed by Yannick and others as I am not well read on this. \nIt might be interesting to conduct further experiments with the nails being driven through the base of the thumb to gather more data on it’s plausibility. \nI’ll share my thoughts as a layman though for what it’s worth. When I saw the illustrations of the nails through the thumb base I immediately thought it was like hanging a picture. When I drive a nail into a stud in the wall to hang a picture I drive it down at an angle. To me this mitigates issues with the nail coming out of the wall or bending etc. It struck me as reasonable that an executioner practiced in crucifixions may also employ this technique. Is it true that in most crucifixions the victim hung for days before expiring? If that was the common outcome then nailing a victim for the long term might lead an executioner to employ such a technique. \nAs for stigmatas on saints I would not be surprised to find them in areas that the saint perceived to be actual wound sites on Jesus. I don’t think it matters either. If stigmatas are genuine I would find it plausible that God would be working within the person’s perceptions of where the wound sites are. I would think an attribute (exact location) of the wounds is subordinate to the point God was trying to make through displaying them (I suffered at the hands of men, these agonizing wounds until death, to show you how much I love you). It is only through modern science can we more accurately fathom such agony by knowing all the aspects affected. \nOne thing that seems very clear to me is that this subject raises that issue that it would be highly unlikely for a forger to deliberately place the nail marks through the wrist as it would contradict the perception of most of the faithful observers. If the point of a “fake” shroud was to pull in money it would seem to be counter productive wouldn’t it? Doesn’t the controversy within the Church at the time reflect a bit of this? (a 14c Bishop claiming it to be a forgery and  to know the forger etc?) Whatever the shroud is it definitely does not fit exactly as folks have presumed it to be over its lifetime.\nAlso, Thank you, Dan, for creating this site. I enjoy it immensely and hope to learn a lot.\n\n","date":"January 11, 2012 at 1:47 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6816","author":"Chris","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Quote : “If that was the common outcome then nailing a victim for the long term might lead an executioner to employ such a technique.”\nAnswer : No.  Barbet hypothesis show that it is as much solid as Zugibe.  We cannot judge those hypothesis on this base.\nQuote : “One thing that seems very clear to me is that this subject raises that issue that it would be highly unlikely for a forger to deliberately place the nail marks through the wrist as it would contradict the perception of most of the faithful observers.”\nAnswer :  Exactly right !  THAT’S THE MOST IMPORTANT THING TO KEEP IN MIND !  No forger from the Middle Ages would have deliberately put the nail wound in the wrist area.\nQuote : “If the point of a “fake” shroud was to pull in money it would seem to be counter productive wouldn’t it? Doesn’t the controversy within the Church at the time reflect a bit of this? (a 14c Bishop claiming it to be a forgery and to know the forger etc?)”\nAnswer :  Your perception is good.  If it was the work of a medieval forger in order to produce a false relic, there’s MANY aspects of the Shroud that doesn’t seem logical at all.  Here’s another example, other than the wound in the wrist area :  The complete nudity of Jesus on the Shroud would have been scandalous at the time.  Not very attractive for pilgrims, don’t you think ?  Meditate on that folks !\n\n","date":"January 11, 2012 at 2:16 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6818","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Yannick, thanks for the response, I appreciate it. The point about the nudity is spot on. Christ is always depicted in a loin cloth in everything I’ve ever seen so it goes against reason that he would be depicted nude on a fake shroud. Why bother to offend the audience’s sensibilities? It is a testament to the example of humility that Christ gave us.\n\n","date":"January 11, 2012 at 3:31 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6821","author":"Chris","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"You wrote : “It is a testament to the example of humility that Christ gave us.”  I agree.  And also of the greatest love of it all !\n\n","date":"January 11, 2012 at 4:25 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6823","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"\nYannick Clément :I just bonified what CO said with more informations about Barbet’s experiments and conclusions. For the speculation question Ron, I want you to read my posts again ! I’ve clearly said that Zugibe’s hypothesis can be true, but like many questions regarding the Shroud, since we’re left with hypothesis and speculations (as you say), then we must judge what hypothesis has more chance to be close to the reality. And the best way to judge between 2 different hypothesis is, as I said before, to used the Occam razor principle. And, as I said before, when we used this principle, Barbet’s hypothesis reach a higher point in a probabilistic scale than Zugibe’s hypothesis, just because his description of the way of nailing the victims hands to the cross is much more simplier and more easy to do. That’s all I said. I never pretend Zugibe’s hypothesis is 100% off-track. I just say that Barbet’s hypothesis seem more simple and easy to do in the context of a Roman crucifixion. In other word, the way Barbet describe the nailing of the wrist (and don’t forget that he made real experiments of nailing a dead body) seem more “natural” than Zugibe’s hypothesis, and don’t forget also that the outcome is the same : the wrist is completely locked and the victim cannot remove his hands from the cross, even if he pull hard with his arms.\nI’m pleased that you were able to read his book and yes, it would surely be a good thing to read it again because it is brilliant and very interesting from a forensic point of view !\nFor the Stigmata topic, read the answer I gave to Chris below. Tomorrow, I’ll write Barbet’s opinion about that, which is very interesting.\nYou never bonified anything, and you never claimed Zugibe’s hypothesis can be true, you basically attacked him with speculations of jealousy and lack of knowledge compared to Barbet etc;\nLet me point a couple of very intriquing points to you and I expect you to be honest; One -Destot’s point is not actually in the wrist! but technically, in the boney part of the ‘palm’! Two- look close at the exit wound on the Shroud, does it look like the wound is anyway near the desot’s point?…Absolutely NOT! . Anyone with eyes can see that…I see it clearly! Three- the nerve we speak of does not even run thru the area Barbet suggested but closer to the thumb and the thickness of a Roman nail would most likely never touch the nerve as the nerve is too small. But the most important point is the location of the wound!…Look at some pictures of the Shroud wound and also anatomy pictures depicting the running of the nerve and where destot’s spot actually is, and notice it is not where the destot’s spot is, it is too close to the thumb side….Oh one more point I noticed; You talk about a simpler way and the nail going in at 90 degrees; Look at the wound opening and picture a nail striking straight thru; Where would it come out the other side? The boney part of the palm not the wrist. I expect you to check this out honestly.\nR\n\n","date":"January 11, 2012 at 6:09 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6826","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"All you want to believe Ron, good for you !  Barbet was a fool of course and knew anything about forensic…  Read again his book, that’s the best advice I can give you.  Also, if Barbet is the fool you pretend, then Robert Bucklin too !  He agreed almost with every conclusions of Barbet !  For the attack on Zugibe, can you go to Shrouduniversity.com on the audio library page ?  Go and listen to his 2005 presentation in Dallas !  You’ll see that he made many personal attacks on Barbet that were far more bitter than what I said !  That’s when I first heard that presentation that it seemed to me obvious that he had a personal vendetta against Barbet…  You don’t believe me ?  Go listen to his presentation from 2005 in Dallas !  You’ll understand what I mean.\n\n","date":"January 12, 2012 at 9:35 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6845","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I should have said for Barbet : he knew nothing instead of anything.  Sarcastically of course.\n\n","date":"January 12, 2012 at 9:36 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6846","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Thats right Yannick what I believe and it carries as much weight as what you ‘believe’…But I never called Barbet a ‘Fool’ just said he ‘may’ be in error. Noticed I used the word may and not was or is! I really don’t care if one had a vendetta against the other. My point is use your own eyes and tell me where is the wound? Stop shirking questions here, you’ve done it way too often.\nR\n\n","date":"January 12, 2012 at 4:40 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6865","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I recommand that you translate the last comment of Co and you’ll see that Barbet’s hypothesis was confirmed by other experts !  So, forget about the possibility that Barbet was off-track on this topic.  His hypothesis is definitely possible !!!  As for Zugibe’s possibility.  But, like I said before, Barbet reach a high point on a probabilistic scale if we use Occam Razor.  And if you pretend the contrary, then that could smell some bias…  Just do this experiment :  Show the exit wound on the wrist to anybody and ask them where the nail was driven on the other side to exit at that spot ?  If they answer the base of the palms instead the wrist, we have to believe that they know nothing about anatomy !!! ;-)  I’m sure if we would do the test, 8 or 9 out of 10 people would say that the nail was driven through the wrist area…  And Ron, you know I’m right about that.\n\n","date":"January 12, 2012 at 4:55 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6867","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Quote : “You talk about a simpler way and the nail going in at 90 degrees; Look at the wound opening and picture a nail striking straight thru; Where would it come out the other side? The boney part of the palm not the wrist. I expect you to check this out honestly.”\nThere’s 2 ways that a nail could come out where we see the wound on the Shroud : Barbet’s way and Zugibe’s way.  If we believe them, in both cases, the nail should end up at the same spot where we see the wound on the Shroud.  Personally, I don’t doubt that those 2 experts were correct in their assumption.  I just prefer Barbet’s way because it is simplier and easier to do.  Again, if we take the Occam razor principle, it is a better explanation than Zugibe because the angulation of the nailing is done in a more natural way (90 degrees).  Of course, we’ll never know the answer for sure but Barbet, on the contrary of Zugibe, did many real nailing experiments on dead bodies and he observe that the nail was coming out EACH time at the same exact spot we see on the Shroud, even if he placed the nail in different zones in the wrist area.  Why ?  Because the nail found each time the Destot space (believe it or not it’s true) and go through that space between the small bones of the wrist.  Just read again Barbet’s book !  I know Zugibe didn’t agree with that, but that doesn’t mean his critics were justified.  To believe that, I would need 1 or 2 other independent forensic experts that would tell me the same critics than Zugibe.  I still wait for that.\n\n","date":"January 12, 2012 at 11:48 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6851","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"You again misundertand my question; I said drive a nail thru the wound opening we SEE! …I would say and it is quite obvious; If you do drive a nail at 90 degrees, straight thru the wound we ‘see’ on the Shroud the nail would exit from the palm of the hand not the wrist….get it? Your shirking my question again or pretending not to understand it.\nSecondly you keep mentioning Barbet’s experiment’s on cadavers. Take close notice to his hanging cadaver and take notice his nail entry point positions….notice anything? They are in the pinky side ot the wrist and definitely no where near the nerve. Don’t forget also that Zugibe did many experiments also…I’d guess you are just ‘forgetting’ all those in your thinking…..and please stop using “Occam’s Razor has it has been found it rarely is the case.\n\n","date":"January 12, 2012 at 4:59 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6868","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Bullsh**\n\n","date":"January 12, 2012 at 5:22 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6869","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Barbet photo of a real crucified body show ONLY the interior part of the hand and arms and not the anterior part that his compressed between the back of the hand and the patibulum !  In that sense, nobody can see where is the exit spot of the nails that Barbet droves !  And what Barbet report in his book is that the nails would ALWAYS found Destot’s space and come out on the backside of the hand at the exact spot where we see the wound on the Shroud.  And when the nail go through Destot’s space, EVERYTIME, Barbet say that the median nerve was partialy cut.  And Barbet knew what he was talkin’ about because he made desiccation and see the the median nerve was partialy cut !  You can twist it all you want, Barbet’s hypothesis is very compatible with the wound in the wrist area on the Shroud.  Period.  One more thing :  Zugibe NEVER did real nailing experiments on dead bodies to see if his method could be easily done !  That’s another aspect of the question you seem to forget.  Barbet said that his way of nailing was so easy that in one or two hits, the nail had reached the patibulum !!!  Again, I have to give you this advice :  Read again his book !!!\n\n","date":"January 12, 2012 at 5:36 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6872","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"One last precision :  The nail was driven at 90 degrees (naturally), but when he touched the bones of the wrist area, he was deflected each time and was going through Destot’s space.  So, the place where the nail entered in the wrist area was not necessarily the same place where it come out at the back of the hand, mainly because of the small bones in the wrist that would deflect it and force it to go through Destot’s space !  I hope everyone understand now how Barbet hypothesis work…\n\n","date":"January 12, 2012 at 5:40 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6873","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Here’s what Barbet (a devout Catholic) said in his book about the Saints who bears stigmata in regard of his own conclusion that, in Jesus case, the nails were driven through the wrists (forgive my poor english translation, but you’ll get the point anyway) :  \n“Some people have criticised my localisation of the nail in the wrist area because of the stigmatised.  It is sure that most of the stigmatised, I mean those that have been recognised by the Church, since Francis of Assisi until this day, bears their wounds in the region of the palms (for the backside of the hands).  Did those stigmatised showed exact replicas of the hand wounds of Jesus ?  That’s the big question.  It is improbable.  First, we have to note that those wounds didn’t always show the same appearance.  They are more or less superficial or deep, from an excoriation on the skin to a complete hole.  Sometimes we see, like saint Francis of Assisi, kind of an fleshy excrescence that I will not try to explain the exact anatomic nature, because they didn’t look like anything we could ever see.”  Note :  Barbet then give some lines from the Fioretti where those wounds are describe and the text describe those fleshy excrescence as the heads of the nails.\nThen Barbet wrote : “Then, can we answer yes to my question ?  NO !  Those stigmatised don’t show the exact replica of Jesus wounds.  The wounds of Jesus didn’t looked like that when his body was laid into the Shroud.  This is not like that that he showed them to his disciples, in his glorious body.  I also want to say that the exact location of the stigmatised wounds is not always the same.  In fact, for the hands, those wounds varied in all the metacarpal region (note : the palm region) and sometimes very close to the carpal region (note : the wrist area).  Then, we must conclude that the stigmatised cannot give us any clue about the location or the form of the crucifixion wounds.  That’s even the conclusion of the stigmatised themselves.  I will just cite one of them, Therese Newmann.  She said to one of his friend :  Don’t think that the Lord have been nailed in his palms, where I have my wounds.  Those wounds have ONLY A MYSTICAL MEANING (note : it’s me, Yannick, who underline).  Jesus must have been fixed more firmly on the cross.”   \nThen, Barbet conclude his point of view on this question by saying : “And since we talks about mystics, I will only recall, with great reserve and respect, this revelation of the Blessed Virgin to saint Brigit (or Brigid) : “The hands of my son have been pierced at the place where the bone is more solid.”\nPersonally, I don’t have much to add.  I think the most important point to note is that many stigmatised show many types of wounds at many different places (it’s true for the hands and also for the side wounds that was not always on the right side !).  Sorry, but that fact, alone, is enough to show that Therese Newmann was right when she said :  “Those wound have only a mystical meaning.”  We must not see them has forensically accurate replicas of the wounds of Jesus.  That would be a terrible mistake.  I will conclude this comment with a personal assumption :  I think it’s more of a psychosomatic kind of thing, linked with a mystical state.  I’m sure most medical experts would agree with me about that.\n\n","date":"January 12, 2012 at 9:30 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6844","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Totalmente de acuerdo, Yannick.\nEl trabajo de Barbet es impecable, sólo una “mala lectura” y un “peor entendimiento” pueden justificar la crítica de Zugibe ( y yo prefiero no hacer una crítica al trabajo de Zugibe porque sería muy DURA).\nEs muy difícil encontrar un trabajo técnico tan ASEQUIBLE al lector sin conocimientos anatómicos como hace Pierre Barbet.\nEl último trabajo interesante sobre el tema es “Anatomía de la Crucifixión” (sale en el Google) de Lagraña, Terraes y Revidatti. Catedra II de Anatomía de la Universidad de Buenos Aires. La entrada del clavo es MUY CERCANA a la propuesta por Barbet.\n– el clavo se desliza por el lado interno o medial del “hueso grande” (capitate) según Barbet\n– el clavo se desliza por el lado externo o lateral del “hueso grande” (capitate) según Lagraña y col.\nLa opinión médica mayoritaria, en el caso concreto de la Sábana, es a favor de la hipótesis de Barbet, pues SÓLO él realizó sus experiencias con “manos vivas”, recién amputadas, que conservaban la propiedad de responder a los estímulos nerviosos.\n(Sobre la obra de Barbet gravita además la figura de una gran anatomista, el Prof. Hovelacque.)\nPara los lectores que encuentren dificultad en encontrar información sobre el espacio de Destot (es un espacio de interés RADIOLÓGICO sin importancia anatómica):\nhttp://www.anatomyatlases.org/AnatomicVariants/SkeletalSystem/Text/WristHand.shtml\n\n","date":"January 12, 2012 at 4:23 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6864","author":"co","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Thanks for this comment !  It’s fun for once to have someone who agree with me on this blog !!!  Co, I don’t know what do you do for a living but you seem, like me, to be really interested in the medical and forensic aspect of the Shroud…  \nI have to tell that I really don’t trust many scientists in the Shroud World (mainly because I see many agendas out there that are so obvious), but I definately trust much of the conclusions reached by Barbet, as I do about many conclusions reached by Ray Rogers.  I don’t say that both guys were surely right about everything they wrote on the Shroud, but I can say that they were both honest scientists that were seeking the truth about the Shroud and not their own glory…  And in the Shroud world, that’s seem to be pretty rare.\n\n","date":"January 12, 2012 at 4:47 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6866","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Question for Ron or anyone who his a fan of the hypothesis of Zugibe :  Imagine you got the victim of crucifixion placed on the ground with his arms and hands resting flat of the patibulum of the cross and being maintain that way by the Roman soldiers.  This is the most probable way the hands were nailed, if we believe the archaeologists.  In this position (arms and hands resting flat on the patibulum), what would be the most natural angulation for driving a nail, so that he would come out in the wrist area on the backside ???  How can someone answer another thing than the wrist area ???  For me, this answer is as obvious as the nose in anyone’s face !  Even a kid would answer the wrist area !  So, in that regard, we have to conclude that Barbet’s hypothesis is much more probable, historically speaking, than the one proposed by Zugibe.  I see this question as a little “Occam test” for everyone who wants to evaluate what is the most probable hypothesis between the 2.\n\n","date":"January 12, 2012 at 5:23 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6870","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I’d say you obviously never crucified someone, you know very little about carpentry or driving nails thru objects and show a huge bias here to your belief in Barbet’s ‘implausible’ conclusions and to archaeologists almost total lack of ‘actual’ knowledge on crucifixion!….And please take a rest on the “Occam ” thing, it’s getting old and makes no sense here, as we all know nothing is simple when dealing with the Shroud only your conclusions.\nR\n\n","date":"January 12, 2012 at 5:48 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6875","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"When someone as his idea settled, no way you can change his mind !\n\n","date":"January 12, 2012 at 5:52 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6877","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"\nYannick Clément :I recommand that you translate the last comment of Co and you’ll see that Barbet’s hypothesis was confirmed by other experts ! So, forget about the possibility that Barbet was off-track on this topic. His hypothesis is definitely possible !!! As for Zugibe’s possibility. But, like I said before, Barbet reach a high point on a probabilistic scale if we use Occam Razor. And if you pretend the contrary, then that could smell some bias… Just do this experiment : Show the exit wound on the wrist to anybody and ask them where the nail was driven on the other side to exit at that spot ? If they answer the base of the palms instead the wrist, we have to believe that they know nothing about anatomy !!! ;-) I’m sure if we would do the test, 8 or 9 out of 10 people would say that the nail was driven through the wrist area… And Ron, you know I’m right about that.\nMy proposal smells of bias? lol what a joke Yannick, you are the biased one here, as you cling to what Barbet might have concluded; (Could this possibly be a racial bias because he was French?). I say to you and CO look at the wounds for yourself, don’t tell me I don’t understand anatomy, and explain to me how a nail driven 90 degrees into the wound we see will end up on the wrist on the other side? I need only look at anatomical pictures of this area to see it is “improbable”. Oh by the way I HAVE shown the picture of the wound to friends, one being a my personal doctor and a surgeon whom happens to be interested in the Shroud and he along showed it to several of his surgeon friends and you know what they said; Exactly what Zugibe claims…Explain that! …these are surgeons from a VERY highly regarded hospital here in Toronto with absolutely no bias, as most are non believers..\nLet’s also not forget the median nerve, it’s local, and it’s actual diameter and also that the width of a Roman crucifixion nail is at it’s widest point 1 cm. (Keeping in mind the exit point shown on the Shroud); Look for yourself, with no Barbet bias and being honest, tell me the nail entered thru the destot spot at 90 degrees, severed the median nerve and exitted from the point we see on the Shroud? Using Occam’s razor I’d say it’s improbable and reminds me of the “magic bullet” in the Kennedy assasination.\nR\n\n","date":"January 12, 2012 at 5:35 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6871","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Look at my recent comments posted above and you’ll understand…  And for the racial thing, I answer no.  Barbet hypothesis is just much more simplier and easier to do in the context of a Roman crucifixion.  You see the Roman soldier asking themselves :  Is this angulation is really correct ?\nAsk anybody the question I asked before : Imagine you got the victim of crucifixion placed on the ground with his arms and hands resting flat of the patibulum of the cross and being maintain that way by the Roman soldiers. This is the most probable way the hands were nailed, if we believe the archaeologists. In this position (arms and hands resting flat on the patibulum), what would be the most natural angulation for driving a nail, so that he would come out in the wrist area on the backside ??? How can someone answer another thing than the wrist area ??? \nIf the hand is resting flat on the patibulum, sorry but the way describe by Zugibe is impossible.  The soldiers would have to lift the hand to find the correct angulation !  COME ON !  In your dream my friend.  It’s just not logical at all.\n\n","date":"January 12, 2012 at 5:47 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6874","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"WHere do you get the idea your method is easier? The “Barbet Nail” would have had to take a ‘magic’ path!! You obviously don’t understand Roman ways or thinking do you?. They were not in the habit of taking the easy way thru things, in all they did. Being efficient and exact was their way, not the simplest way. AGain the wound is not in the wrist area, look for yourself!\nR\n\n","date":"January 12, 2012 at 5:56 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6879","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"One last thing so that anybody can understand what I just said :  If the hand is put flat on the patibulum and you drive the nail at the spot proposed by Zugibe, there’s no way the nail would exit at the same spot than what is seen on the Shroud !  No way it can be done with the hand resting flat on the patibulum.  You HAVE to lift the fingers in order to get the correct angulation.  So, it’s evident that it’s a much more complex way to drive a nail…\n\n","date":"January 12, 2012 at 5:51 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6876","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"\nYannick Clément :When someone as his idea settled, no way you can change his mind !\nYou just described yourself to a “T”…you should do sopme soul serching there Yannick.\nR\n\n","date":"January 12, 2012 at 6:26 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6881","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I was just quoting my dear friend Barrie Schwortz, who, by the way is another defender of Zugibe’s ideas !  Message for Max :  You can see that me and Barrie can be friend and have different ideas !  Your assumption that I buy everything from Barrie is totally incorrect.  I’m a free thinker and I don’t need anybody to build my own opinion ! ;-)\n\n","date":"January 13, 2012 at 11:40 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6931","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Ron, yo soy médico, pero parece que hace usted poca estima de la opinión de los médicos europeos ya que no sabemos distinguir el carpo del metacarpo.\nVea usted la portada del libro “The Wrist” para hacerse una mejor idea de la situación de los huesos del carpo:\nhttp://www.amazon.com/Wrist-Diagnosis-Operative-Treatment/dp/1608313905\nZugibe plantea un trayecto absurdo en la SUPERFICIE (para salvar los estigmas), porque SU clavo TAMBIÉN penetra en PROFUNDIDAD por el CARPO y sale por el CARPO.\nEl Dr. Domenico Tarantini, cirujano del Ospedale Generale di Trani, realizó la misma experiencia y confirmó plenamente la tesis del Dr. Barbet.\nYves Delage, que era médico y biólogo, Profesor de Anatomía Comparada en la Sorbona, con quien la Sábana Santa entró en el mundo de la Ciencia, escribía en 1902:\n“Les mains percées au CARPE et non au métacarpe, conformément aux nécessités anatomiques et contrairement à la tradition.”\nYves Delage ” Lettre à M. Charles Richet ” Revue scientifique, n° 22 du 31 mai 1902, pp. 683-687\n(y trabajaba, como Barbet, con imágenes a tamaño NATURAL de la Sábana)\n\n","date":"January 12, 2012 at 7:03 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6882","author":"co","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I SAY AMEN TO THIS COMMENT !  Looks like our friend Ron just don’t want to believe that Barbet’s hypothesis is TOTALLY CONSISTENT with what we see on the Shroud.  That’s why I talked yesterday about a little bias…  All I want Ron is that you understand that Barbet hypothesis can WELL BE the exact way the Roman soldiers nailed the wrists of Christ 2000 years ago !  Of course, we cannot be 100% sure, but the fact is that Barbet’s hypothesis is TOTALLY CONSISTENT with the Shroud, so it has some good chances to be true.  And as Co point out, his hypothesis was INDEPENDENTLY CONFIRMED by another medical specialist !  Of course, you can still believe Zugibe was right but THAT’S NOT THE GENERAL OPINION OF MOST MEDICAL EXPERTS THAT HAVE STUDIED THE SHROUD.\n\n","date":"January 13, 2012 at 9:31 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6926","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I can say the same for you Yannick, you don’t want to believe Barbet’s ‘Hypothesis can be wrong’ and you show strong bias here. Forget what Barbet or Zugibe have said, look for yourself as I’ve mentioned before; LOOK AT WHERE THE EXIT WOUND IS ON THE SHROUD!., with your own eyes and tell me the wound could be thru Destot’s spot? Barbet or Zugibe don’t have any better ‘eye’ perception then you or me so their conclusion of the ‘exit wound’ can be no better then ours. I see the wound nowhere near the wrist or Destot’s spot. I can see CLEARLY, if I were to place a nail straight thru that wound it would end up coming thru the back end of the Palm…If you or CO cannot see this, it is not of my error…sorry. I say Barbet’s hypothesis is NOT consistent with what we see on the Shroud, it is quite evident and if you say most medical experts agree with his hypothesis, I say they are all blind aswell.\nR\n\n","date":"January 15, 2012 at 5:47 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6987","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"First, I want to apologize again for the lenght of this comment but you’ll see, I talk about many interesting and important points about the question of the nailing of the hands and also sindonology in general.\nHere, I want to point out 2 FACTS that are important to consider when someone wants to judge who got the best hypothesis for the nailing of the hands :  Zugibe or Barbet.\n1- Barbet, while doing his experiments on recently amputated arms (as he said, those arms had still living nerves that still acts like normal arms, except the fact that the blood circulation was stopped) ALWAYS noted that the thumb did a retraction movement into the palms.  This FACT was totally consistent with what we see on the Shroud and offered a scientific explanation for the missing thumb.\n2- Here’s some reasons Zugibe gave in his article “Pierre Barbet Revisited” in order to support his hypothesis :\n     a.The palm region is the location most Christians across the centuries perceived the wound to be.\n     b.Fifthly, it assures that no bones are broken in accord with Exodus 12:46 and Numbers 9:12.\n     c.Lastly, it is where most of the stigmatists( prior to Dr. Barbet’s book ) like St. Francis of Assisi, Padre Pio, Theresa of Konnersruth, St. Catherine of Sienna, Catherine of Ricci, Louise Lateau, etc. have displayed their wounds throughout the centuries.\nFor me, the first fact is another important sign that Barbet hypothesis is totally consistent with the way the man of the Shroud was nailed to the cross.  Zugibe didn’t conduct experiments like that with freshly amputated arms.  Then, we have to conclude that he was not able to show experimentally that his method of nailing would produce the same retraction of the thumb into the palm of the hand, just like we see it on the Shroud.  It doesn’t mean that his method would not produce a retraction of the thumb, but he was not able to confirm this experimentally.  Nevermind this fact, it seem that Zugibe wanted to pass by this “problem” by giving another explanation (not really convincing to me) about the absence of the thumb on the Shroud image.  He simply said that it was due to the position of the Shroud that would have been far away from the thumb, so that no image could be formed.  And this reasoning can also be applied to the easiness of the nailing.  Effectively, Barbet was able to verify experimentally that his method was VERY SIMPLE, EASY and RAPID to do.  Also, it was done in a VERY NATURAL way.  All those characteristics are totally compatible with the context of Roman soldiers who surely wanted to nail their victim rapidly to the cross.  Zugibe, on the contrary, never did experiments like that and we must conclude that it is impossible for the moment to know if his method can be as simple, as easy and as rapid to do as the method proposed by Barbet.  Again, that doesn’t mean Zugibe’s method would not withstand the comparison with Barbet, but, for the moment, the truth is that WE DON’T KNOW !  And until someone can show me real experiments like the one done by Barbet to show me that Zugibe’s hypothesis can be as simple, easy and rapid to do, I will tend to favoured Barbet’s hypothesis, using Occam razor principle.  And since Barbet’s hypothesis seem to me much more natural in the context of a victim having his arms and hands maintained flat on a patibulum by Roman soldiers, I think his hypothesis is closer to the reality of a Roman crucifixion.     \nAnd for the second fact that I’ve mentioned, we have to recognise that those “Christian” reasons given by Zugibe to defend his hypothesis are somewhat BIASED by his personal faith.  In my opinion, those kind of reasons have simply not their places in an article that is supposed to be scientific.  And the FACT is that the religious reasons given by Zugibe in “a” and “c” of my point #2 are just completely ERRONEOUS !  M. Zugibe forget one thing :  his hypothesis, by making the nail exit in the wrist area instead of the backside of the palm, is COMPLETELY INCONSISTENT with the perception of the Christians over the centuries and with the wounds of the stigmatised !!!  I can’t believe a brilliant person like him used bad arguments like that in order to defend his hypothesis.  One thing’s for sure, it is not on the base of reasons like that, that I will change my mind about the fact that I favored the hypothesis of Barbet !!!  I don’t know for you, but for me, it seem obvious that the hypothesis submit by Zugibe was, to some extend, influenced by his Christian faith.  This kind of acting is sadly common in sindonology, and even if we can understand why someone do that, for me, it is not “acceptable” in a scientific research because there’s too much danger of errors due to some religious bias…  \nIn the end, all I want to say is that Barbet was able, on the contrary to Zugibe, to show EXPERIMENTALLY that his method of nailing through the wrist is completely compatible with what we see on the Shroud of Turin.  Again, that doesn’t mean the Zugibe’s way of nailing is wrong, but that there are some chances (good chances in my mind) that Barbet’s way of nailing the crucifixion victims was effectively what was done on the Golgotha 2000 years ago.  And to those, like Ron, who don’t believe what I just said, I just have this to say :  Read again carefully (and with an honest mind) the book of Barbet and this article from Zugibe and you’ll see that I just wrote some truths here (especially about the FACT that Zugibe was never able to confirm his hypothesis with real experiments, on the contrary of Pierre Barbet).\nHere’s the link to Zugibe’s article :  http://shroud.com/zugibe.htm\nHere’s the link to buy Barbet’s book (I highly recommend it to anybody who’s interested in the Shroud) :  http://www.amazon.com/Doctor-Calvary-Passion-Described-Surgeon/dp/0912141042/ref=sr_1_1?ie=UTF8&qid=1326468620&sr=8-1\nAnd, to conclude this long comment, I just want to make a little Shroud history course that is very telling !  Did you know that Monsignor Paleotto, archbishop of Bologna, was in Turin in 1578 with Charles Borromeo to observe the Shroud and after that, he wrote a document in which he describe all the wounds he had seen ?  And did you know that, well before Zugibe, he was the first to propose the hypothesis that Jesus was nailed at the base of the palms (in the interior of the hand) with such an angulation that the nails would came out at the exact spot we see on the Shroud ?  And did you know that the main reason that was behind his hypothesis was the fact that he wanted to “match” the Shroud with the stigmatised ?  I SUSPECT EXACTLY THE SAME THING FOR ZUGIBE AND Co JUST WROTE THE SAME THING IN HIS LAST COMMENT !  This deserve some thoughts, don’t you think folks ???  \nI’ll say it until I die :  When you let your personal faith interfered into your scientific research, IT’S WRONG AND YOU’RE OFF-TRACK REGARDING THE SCIENTIFIC METHOD !!!  Ray Rogers talk lengthily about this crucial problem in his book.  And we have plenty of those bad examples in the history of sindonology…  So many that I could not write an exhaustive list without having some cramps in my wrist !  And that’s why I pray that the next series of direct researches on the Shroud will be done by a scientific team composed exclusively of atheists and agnostics that don’t care one second if the Shroud is the authentic Shroud of Jesus-Christ, but just want to understand this archaeological artifact from a strict scientific point of view.  And I also hope a team like that would exclude every scientist who ever proposed any hypothesis regarding the Shroud, because there would be a great danger of bias obviously.  \nThat’s the greatest problem in sindonology :  A lot of scientists are not seeking the truth (scientifically speaking) but are searching to comfort their own religious conceptions about Jesus-Christ and his burial Shroud !  And I should also say that some of them are also seeking their own little glory, which can be even worse. \nAnd I also want to say is this :  I wish all the best to M. Zugibe in 2012 because I’ve learned that he have important health problems.  It’s not because I’m very critical versus some of his conclusions about the man of the Shroud that I cannot wish him well on a personal level !\n\n","date":"January 13, 2012 at 11:44 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6932","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Bla, bla, bla…You keep repeating yourself with the same crap. If something doesn’t agree with your ‘PERCEPTION’ of things. You’ve argued alot here using Rogers and other’s hypotheses, yet these hypotheses have not been ‘INDEPENDENTLY REVIEWED’ as you so forcefully point out about and too others. You talk about Barbet as if he was a God and could not possibly be in error!…I say Bull to that!!. Look at Barbet’s hanging cadavor picture and the location he ‘deduced’ the nails went thru, if you then still believe after seeing that picture that he was correct, then I say you are either blind, totally biased or in denile. AND please, Please Quit accussing scientists or everyone of ‘religious’ bias or of seeking glory, just because their findings are not what YOU think….It’s kind of pathetic.\nR\n\n","date":"January 15, 2012 at 6:02 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6990","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Oh almost forgot, you said to Max you are a ‘free thinker’…good. Then if so, you would agree to my suggestion; Forget what you’ve read by Barbet or Zugibe or whomever. Get a good quality photo of the Shroud wrist wound, some diagrams of the anatomy of the wrist and hand, picture yourself putting a nail (1cm in width) at 90% thru the wound you see on the Shroud and then figure out where it would exit from, by yourself…It doesn’t take a medical expert, especially with the information we have now at our disposal, to deduce on our own where this nail exit point would be…Try it and then tell us what you think.\nR\n\n","date":"January 15, 2012 at 6:19 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6991","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"“I see the wound nowhere near the wrist or Destot´s spot”\nRon, su comentario es ININTELIGIBLE.\n¿Dónde cree usted que ve Zugibe la SALIDA del clavo en la imagen de la Sábana?\n¡En el CARPO, en la MUÑECA (wrist).!\n(¿Quiere que hagamos una ANATOMÍA de la muñeca (wrist) a su gusto?)\nDe los 2 espacios propuestos por Zugibe ninguno ATRAVIESA la palma de la mano.\n(para atravesar la palma de la mano tiene que pasar el clavo por los espacios intermetacarpianos, y Zugibe NO lo propone)\nEntendió usted mal el trabajo de Barbet y entendió mal el trabajo de Zugibe.\n.\n\n","date":"January 15, 2012 at 9:06 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-6998","author":"co","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Co, I think we should let our friend Ron in his belief !  You and me knows that Barbet’s experiments were totally consistent with what we see in the wrist area of the Shroud !   As I said the other day :  When someone has made up his mind about something regarding the Shroud, no matter how good the arguments or facts you bring to him, no way he will change his mind.  This is Barrie Schwortz own words and he was god damn right !!!\nFor Rogers and Barbet, I don’t think they were Gods and the proof of that is this :  there’s some minor things they’ve said that I disagree !  So, you see ?  I can I believe they are Gods ?  And for Zugibe, I want to add something important :  yes I criticize some of his conclusions, but there are still some that I find interesting.  \nAs a free thinker, how can I be 100% against everything a guy like Zugibe have said ?  And as a free thinker, how can I be 100% for everything a guy like Rogers or Barbet have said ?  It’s not the way it goes when you’re a real free thinker !  But, in the same time, I’ll say it again :  Rogers and Barbet, to me, were amongst the only Shroud scientists to be able to go exactly where the facts were leading them without letting their faith (they were both believers by the way) interfered with the pure scientific facts and observations they had in front of them…  Of course, they could made some errors or misinterpret some facts and observations, but, in the end, I THINK THE MAJORITY OF THEIR CONCLUSIONS AND IDEAS HAS NOT BEEN FULLY CONTRADICTED OVER THE YEARS BY WELL CONFIRMED EXPERIMENTS MADE BY OTHERS SCIENTISTS.  Yes many of their ideas were challenged by many scientists or pseudo-scientists (this is normal), but few of them have been able to really demonstrate scientifically that they were absolutely wrong.  That’s why I consider most of their conclusions with higher esteem than many others. \nAnd that’s why I consider them to be 2 of the most important sindonologists of all time.\nAnd Ron, if you consider Zugibe in this category instead of Barbet, it’s up to you my friend !\n\n","date":"January 15, 2012 at 6:58 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7011","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"The translator doesn’t seem to work too well but I do understand your first line and I say BULLSHIT. I have a feeling neither you or Yannick have a clue what I’m saying, and your just going by what Barbet said. I say LOOK FOR YOURSELF where the exit wound is, not Zugibe’s or Barbet’s conclusions… Where do you see the exit wound? \nWhere the exit wound is, is an ‘interpretation’ as it is not exactly clear but by ‘deduction’ and a ‘good eye’ one can get a pretty good sense of location. Remember Barbet and Zugibe and whomever else had to ‘DEDUCE’ where the exact position was by ‘eye’, from PICTURES of the Shroud (they didn’t have a cadavor where they could feel into the wound) so this leaves room for ‘interpretation’. Could they interpret this location better then you or I? I think not…Both you and Yannick are not listening very well because I have basically said these things before and have asked a couple of times already. Look closely where the wound appears, imagine a nail 1 cm in width driven 90 degrees straight thru as Yannick has strongly suggested is the true ‘simpler’ way and tell me the nail would come out the wrist. The way I see it, it would exit in the centre of the base of the thumb, still in the palm….this is quite clear in my OPINION and in this particular case my ‘opinion’ is as good as anyone elses because of the interpetation of the wound location….Understand?\nSo forget Zugibe, forget Barbet look for yourself, that is what I have been saying all along!.\nR\n\n","date":"January 16, 2012 at 6:25 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7030","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"In my last comment, I should have wrote : “So, you see ? How can I believe they are Gods ?” instead of : “So, you see ? I can I believe they are Gods ?”\n\n","date":"January 15, 2012 at 8:13 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7015","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Yannick sometimes you are quite irritating, as you are completely biased in most all you say, you close your mind too what people say (If it goes against your ideals) and it is clear you shirk most real questions put forth to you. You misinterpret my words when it seems you have no answer to my questions or suggestions….I never said you think Zugibe AND Barbet were Gods, but that you act as if BARBET alone was a God and cannot possibly make a mistake. Again you have described yourself to a TEE with Barrie Schwortz’s statement , not me.\nI asked you to look for yourself at many things and for your interpretations, yet you ignore this and many things I have said…Why? Is it because maybe you see something that can change your outlook and contradict your beliefs?\nYes Yannick I’ll go on in my beliefs, because that is my right but I do so with an open mind and as a ‘free thinker’ unlike you. \nOur correspondence on this blog is over.\nR\n\n","date":"January 16, 2012 at 6:46 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7032","author":"Ron","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Ron, I’m really sorry that you take all I’m saying so seriously.  We just do some ideas debate here.  You got your point of view.  I got mine.  We don’t share too much the same views obviously, but so what ?  I just exposed you my ideas WITH SCIENTIFIC REFERENCES to go along.  And Co (a doctor by the way) agree with me and even show some medical independent confirmations that Barbet’s hypothesis is conform to what we see on the Shroud.  I don’t invent anything here…\n\n","date":"January 16, 2012 at 12:10 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7053","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Ron, I do understand you can really be CROSSED when talking about…HAND NAILING!\n\n","date":"January 16, 2012 at 12:12 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7054","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I would add this :  No matter who’s right between Barbet and Zugibe about the hand nailing process done by the Romans, the most important thing to note is this :  Both agree that the nail wound we see in the wrist area of the Shroud is totally consistent with a Roman crucifixion !  That’s the main thing to understand…  The rest are details.\n\n","date":"January 16, 2012 at 12:59 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7055","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"I should add :  Details that are fun to debate ! ;-)\n\n","date":"January 16, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7056","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"So here’s a question that I don’t think has been addressed: What explains the seemingly unnatural elongation of the index finger on the right hand? Indeed all the fingers look too long and seemingly do not follow the natural length pattern of a normal persons fingers. \nI have often wondered if this is because of how and where the nail was driven through. Any thoughts?\n\n","date":"January 16, 2012 at 3:17 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7062","author":"Chris","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"“Indeed all the fingers look too long and seemingly do not follow the natural length pattern of a normal persons fingers.”\nChris, creo que si le contesto se va a COMPLICAR mucho el debate………….\nEn mi modesta opinión la imagen de la mano izquierda (la que muestra la herida del clavo) es una de las “claves” del mecanismo de formación de la imagen.\n\n","date":"January 16, 2012 at 4:26 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7064","author":"co","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"The best answer to Chris question is pretty evident :  it is the FACT that there are some distortion in the frontal body image of the Shroud and those distortions are even bigger in the hands and thighs regions.  Those distortions in the hands region are the most probable fact that can fully explain the unnaturally long appearance of the fingers on the Shroud.  IN SCIENCE, A LOT OF TIMES, THE SIMPLEST EXPLANATIONS ARE THE BEST ONES !!!\nThis scientific fact can be seen in a paper published in 1982 by Ercoline, Downs and Jackson from STURP that evaluate the possible distortions in the frontal image.  \nThe only sad thing about this study is the fact that the authors never did the same kind of examination in regard of the dorsal body image of the Shroud.  I really don’t understand why they never did this particular study.  I think it would be important and very interesting that someone could do this particular study.  If we look at the 3D images of the dorsal image, we see that this image, just like the frontal image, wasn’t done uniquely by direct contact.  In that sense, it is very probable that there are some minor distortions too that would be found in the dorsal body image.  But, for the moment, we can just guess that it’s the case since nobody has ever done a proper study of this region of the Shroud.  \nWhat is interesting is the fact that Mario Latendresse did also a study of the frontal body image of the Shroud versus the most probable configuration of the Shroud over it and he was able to confirm the findings of the STURP study.  But, unfortunately, Mario only did a study of the upper frontal part of the body images of the Shroud…\nNevertheless, the bigger distortions that were found by the STURP team particularly in the hands region are the most probable answer to Chris question regarding the long fingers on the Shroud.\nAnd it’s pretty funny because this question is another example of a probable erroneous hypothesis proposed by doctor Zugibe.  Effectively, he said that the long fingers on the Shroud are probably due to a rare syndrome called Marfan’s symdrome that Jesus would have suffered.  This rare hereditary disease has among its symptoms elongated limbs, long spidery fingers, and a long, thin face…\nI’ve never seen a real Shroud expert that is an advocate of this particular hypothesis.  If there is some who believe Zugibe’s idea, they’re not a big bunch.  Since the study published by the STURP team, I really think this “exterme” hypothesis should not be considered as a good one to explain the long fingers on the Shroud.  When you consider the distortions that were found by the STURP team (especially in the hands region), the chances that the explanation proposed by Zugube could be true is extremely low…  I really think the proven distortions in the frontal image (especially in the hands region) are the solution for the mystery of the long fingers in the Shroud image.\n\n","date":"January 17, 2012 at 9:29 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7088","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Yannick, las manos son normales, prácticamente normales…….pero hay que saber QUÉ ES lo que se está viendo.\nBarbet era extraordinariamente cuidadoso en sus afirmaciones.\nFíjese en estas frases:\n“La dernière fois que j’ai disposé d’une main fraîche, j’ai pris un bistouri à lame de 8 millimètres. Je l’ai piqué dans le pli de flexion du poignet et en poussant, sans effort, j’ai traversé le carpe sans rencontrer de résistance pour ressortir au dos de la main, toujours au même endroit. Cet endroit, sur u main d’homme normale, est toujours à environ 8 centimètres de la tête de 3e métacarpien. C’est la même distance que j’ai mesurée sur le Linceul.”\n¿Cómo podía Barbet medir desde la cabeza del III metacarpiano?\nLa respuesta es muy SENCILLA…… pero demasiado FUERTE.\n[es muy fácil hacer medidas en la Sábana gracias a Mario Latendresse]\nhttp://people.bridgewater.edu/~rschneid/FocusProjects/Shroud/ShroudMeasure/enrieImg.html\nMedítelo.\n\n","date":"January 17, 2012 at 3:15 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7108","author":"co","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"This is another very interesting comment Carlos !  It’s true that, for Barbet, the lenght of the fingers never seem to be a problem, in the sense that his estimations show him that they were not abnormal in length versus a normal human being.  But I wanted to show that it is a proven fact that the region of the hands on the Shroud shows some distortions.  I don’t say it is major distortions, but nevertheless, there is some.  It’s a proven fact.  Keeping this fact in mind, we have to conclude that it is IMPOSSIBLE to estimate precisely the exact length of the fingers for the man of the Shroud…  It’s simply impossible, scientifically speaking.  Of course, we can give some length estimation from precise measurements like Barbet did, but the bottom line is :  We’ll never 100% sure about the exact length of the fingers (and many other body parts), simply because there is some minor distortions, especially in the hands and thighs regions.  THIS IS A SCIENTIFIC FACT and it’s totally normal that it is that way for a cloth loosely draped over a dead body.  It is the contrary (no distortion at all) that would have been abnormal !!!\nBut having check out the drawing we can see in the paper written by Jackson, Ercoline and Downs, I have a feeling that the distortion in the region of the hands is more lateral.  If it’s true, then we must assume that it is the larger of the hands that would be more distorted than the length of the fingers…  Nevertheless, we have to assume that a minor distortion in the length must also be present.\n\n","date":"January 18, 2012 at 11:57 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7136","author":"Yannick Clément","site":"shroudstory"},{"title":"Metaphors or Mix Up?","post":"Yannick you wrote: “THIS [distortion] IS A SCIENTIFIC FACT and it’s totally normal that it is that way for a cloth loosely draped over a dead body.”. \nOne shall remember here that the position of the arms was broken with considerable force (from adduction to abduction). Actually the corpse being fastened/tighly wrapped into linen sheets (the inner shroud being soaked with a watery solution), the finger elongation is nothing but the visible trace of a gradual pressure release in the image.\n\n","date":"January 18, 2012 at 1:45 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","id":"comment-7138","author":"Max Patrick Hamon","site":"shroudstory"}]
