[{"id":"comment-131829","author":"chesterbelloc","post":">>With research within the Shroud community so stagnant it seems likely that someone who has had nothing to with the Shroud, will come up with some evidence, probably relating to some other issue, that convinces the wider world for or against the authenticity of the Shroud. And the Shroud community risks being left on the sidelines either way.<< That may have already happened to an extent with de Wesselow's book. His theories don't give particular comfort to either side in this debate, but he's definitely not part of the \"shroudie\" camp, and he did bring fresh insights from his point of view as an art historian..","date":"2014-06-20","mins":"5:01 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129681","author":"chesterbelloc","post":"I thought Hugh was a practicing Catholic. Why would he be bothered by the Shroud being authentic?.","date":"2014-06-14","mins":"11:46 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-132087","author":"chesterbelloc","post":"See what I mean? So an artist in obscure Lirey was not only the greatest and “most cunning” in history, but he traveled to Hungary to copy the Pray Codex for his forgery that was designed for people in the 14th century who wouldn’t have a clue? That’s more miraculous than the Shroud being the burial cloth of Jesus of Nazareth in my opinion..","date":"2014-06-21","mins":"10:04 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132085","author":"chesterbelloc","post":"I think that position of Jesus, the invisibility of His thumbs, and what certainly looks like a herringbone weave are pretty compelling. What appears to be a copy of the “poker holes” is icing on the cake. I don’t know how anyone couldn’t at least wonder about these things, instead of dismissing them out of hand. I sometimes think about who are the more credulous, people who see something like this and say “wow, that looks like the Shroud”, or those who just shrug and say “it can’t be related to the Shroud”, and just never want to consider they could be wrong. I myself was convinced by the C 14 tests in 1988, but I came back to a belief in at least a stronger case for authenticity because of strange “coincidences” sprinkled throughout history like the Pray codex. This was an excellent posting..","date":"2014-06-21","mins":"10:01 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135141","author":"chesterbelloc","post":">>Neither of the examples you cite (Constantine VIII, Clari and these other mysterious not specified by you), provide us with a description of the shrouds mentioned that can be compared with the Shroud of Turin.<< I think that the description by Robert De Clari is clearly a description of the Shroud as we know it. You don't have to believe in the authenticity of the TS to see that. It could have been produced for liturgical rites in Constantinople. But I highly doubt that some artist in 14th century France created the Shroud of Turin. The Byzantines were much more sophisticated in every way, and if the Shroud is ever proven to not be that which Christ was buried in, it will probably be shown to be something from the Eastern Church, not the West. Having said that, I believe that the TS is more than likely the Shroud of Christ. But if was created by human hand, it wasn't in western Europe. IMHO..","date":"2014-07-03","mins":"2:42 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-63596","author":"chesterbelloc","post":"Just from the perspective of an ignorant layman, the first time I saw the Manopello cloth(in one of Ian Wilson’s books I think) I thought “fake!”. Some of the other so called holy faces, Mandylion copies and “Veronica” clothes that resemble the Shroud more closely look more authentic to me. The Manopello cloth just looks like a painting to me, and not even a particularly good one. Just my opinion..","date":"2013-12-20","mins":"6:15 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","title":"What Did Jesus Look Like Throughout History?"}]
