[{"id":"comment-75985","author":"chesterbelloc","post":"<\\ Charles Freeman : Medieval relics are often contemporary with what they are supposed to be and very often genuine. Thomas Becket’s body was kept in Canterbury cathedral where we his was murdered and therefore we can be sure that his bones, until they were destroyed at the Reformation, were genuine. It’s the relics that claim to come from before 1000 AD that are the difficult ones! There are some intriguing cases where bones supposed to have been of Christian martyrs are actually found to be pre Christian Fanti’s dating of the Shroud(by one of his methods) to many years before Christ is surely within this genre. Was it Carsten Thiede who claimed to have found an early manuscript of St. Matthew’s Gospel that he dated with reference to a manuscript found at Herculaneum to the 60s AD (Vesuvius eruption AD 79). Experts in this field soon told him that the manuscript in question was convincingly dated to the first century BC and so, if he was right that the scripts matched, he had truly beaten the field in having a Christian gospel that dated from before Christ! Medieval relics are often contemporary with what they are supposed to be and very often genuine. Thomas Becket’s body was kept in Canterbury cathedral where we his was murdered and therefore we can be sure that his bones, until they were destroyed at the Reformation, were genuine. It’s the relics that claim to come from before 1000 AD that are the difficult ones! There are some intriguing cases where bones supposed to have been of Christian martyrs are actually found to be pre Christian Fanti’s dating of the Shroud(by one of his methods) to many years before Christ is surely within this genre. Was it Carsten Thiede who claimed to have found an early manuscript of St. Matthew’s Gospel that he dated with reference to a manuscript found at Herculaneum to the 60s AD (Vesuvius eruption AD 79). Experts in this field soon told him that the manuscript in question was convincingly dated to the first century BC and so, if he was right that the scripts matched, he had truly beaten the field in having a Christian gospel that dated from before Christ!<< All of which goes to show how tenuous it is to base the authenticity of any object of historical interest on one test alone. People really believe that a C14 date of 1300 A.D. Renders the cloak of St. Francis, who died a mere 75 years earlier, as inauthentic because the date was less than 100 years off? Really?.","date":"2014-02-02","mins":"11:21 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-108030","author":"chesterbelloc","post":"Thanks for the info, Louis. I look forward to reading more..","date":"2014-05-01","mins":"12:30 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-108125","author":"chesterbelloc","post":"Thanks again. It’s Chesterbelloc(for Chesterton and Belloc), by the way. The font cuts off the last couple of letters. On the issue of the Talpiot tomb: we all know that Christianity was obsessed with relics almost from the beginning of the Church. If there was a tomb full of relics of the bones of Christian saints, I don’t believe it would have been untouched until the 20th century. Also, there are no 1st class relics of the Blessed Virgin Mary. Catholics and Orthodox believe that is because Her body was assumed into Heaven and she was, shall we say, one of the “first fruits of those who were asleep”, in a similar manner to the dead who were raised on the first Easter, according to the Gospel of Matthew. If her burial place was known, and her bones were there, the belief in Her assumption would have never taken hold. Also, why have an ossuary for Jesus if His body was raised? Even if His ossuary is empty, it would be strange to have one for someone who was, according to early belief, raised bodily from the dead. It all doesn’t add up. I would also wonder why a family that lived in Nazareth had a burial plot so near Jerusalem. I know that these things don’t pose a problem for non Christians, and the issue of the Blessed Mother doesn’t affect all Christians. But it makes no sense to me, historically or theologically..","date":"2014-05-01","mins":"2:36 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-107140","author":"chesterbelloc","post":"Louis, do you have a website where I can read your writings?.","date":"2014-04-30","mins":"4:50 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-70867","author":"chesterbelloc","post":"I think that the unauthorized tests from the early eighties(presuming they happened, and I hardly think that all of the parties involved were liars) proves one thing that the Shroud is a very difficult object to date with C 14. I imagine that if 4 pieces were cut from different parts of the cloth, each one would yield a different date. I sure would like to see some more C 14 tests done in my lifetime, since there is so much controversy surrounding the 1988 test. Happy New Year to all, even to a Passing Stranger..","date":"2014-01-01","mins":"2:26 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"}]
