[{"id":"comment-101673","author":"chesterbelloc","post":"Christ is risen from the dead! By death He trampled death! And to those in the tombs, He granted Life! from the Byzantine Divine Liturgy of Pascha..","date":"2014-04-20","mins":"11:27 am","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-129985","author":"chesterbelloc","post":"Will the presentations be available for the public to view if one is not able to attend the conference, maybe via Youtube or a set of CD’s?.","date":"2014-06-16","mins":"10:26 am","url":"https://shroudstory.com/2014/06/16/anticipating-the-conference-jack-markwardt-on-the-history-of-the-turin-shroud/","cat":"uncategorized","title":"Anticipating the Conference:  Jack Markwardt on the History of the Turin Shroud"},{"id":"comment-130268","author":"chesterbelloc","post":"Thanks for the info, Joe..","date":"2014-06-17","mins":"12:29 pm","url":"https://shroudstory.com/2014/06/16/anticipating-the-conference-jack-markwardt-on-the-history-of-the-turin-shroud/","cat":"uncategorized","title":"Anticipating the Conference:  Jack Markwardt on the History of the Turin Shroud"},{"id":"comment-101285","author":"chesterbelloc","post":"Unlike you, Dan, I am upset by the rest of it. Whether the Discovery channel claims on the Old Testament are true or not(I tend to doubt a lot of it, since in 10 years some new discovery could be made that thoroughly discredits the “latest findings”), this program’s only purpose is to try to demolish the faith of people. I find it sickening that every year, the Judeo Christian tradition is artificially “debunked” by people with an anti religious, secular agenda. If people want to know why Fundamentalism is so popular, it’s because of crap like this. Maybe people too often seek easy answers, but they also want to believe. So they seek solace in Churches where faith in God is strong and every little event in the Bible isn’t somehow trivialized or made light of. I have family members who believe all of these shows, and they come away from them believing that faith in God is stupid. I hate to get all sanctimonious, but in the words of the likely Man of the Shroud, “It would be better for them to be thrown into the sea with a millstone tied around their neck than to cause one of these little ones to stumble”. Rant over. Happy Easter to one and all..","date":"2014-04-19","mins":"11:28 am","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","title":"Happy Easter from Discovery"},{"id":"comment-114885","author":"chesterbelloc","post":"Calvin often exaggerated about relics. He made the claim that all of the relics of the true cross would form a whole ship’s cargo. The french archeologist Charles Rohault de Fleury did a study in 1870, cataloging all of the fragments of the true Cross that he could find. All of the extant known pieces of the cross didn’t even make up one third of what would have constituted the true cross..","date":"2014-05-08","mins":"5:53 pm","url":"https://shroudstory.com/2014/05/08/more-on-the-letter-from-alexius-comnenus-never-have-preconvictions-about-relics/","cat":"history","title":"More on the Letter from Alexius Comnenus:  Never have preconvictions about relics"},{"id":"comment-114998","author":"chesterbelloc","post":"Louis, yes, the article was excellent. Thanks again!.","date":"2014-05-08","mins":"8:46 pm","url":"https://shroudstory.com/2014/05/08/more-on-the-letter-from-alexius-comnenus-never-have-preconvictions-about-relics/","cat":"history","title":"More on the Letter from Alexius Comnenus:  Never have preconvictions about relics"},{"id":"comment-115013","author":"chesterbelloc","post":"Louis, I have some books by Cardinal Dulles that I haven’t read yet. Besides Chesterton and Belloc, I really like Cardinal Newman..","date":"2014-05-08","mins":"8:59 pm","url":"https://shroudstory.com/2014/05/08/more-on-the-letter-from-alexius-comnenus-never-have-preconvictions-about-relics/","cat":"history","title":"More on the Letter from Alexius Comnenus:  Never have preconvictions about relics"},{"id":"comment-114551","author":"chesterbelloc","post":"Some relics are obvious forgeries, but those associated with the Passion may well be authentic. If some accounts are accurate, the Jews would keep everything associated with a violent death in order to preserve the life’s blood for the general resurrection. So the crown of thorns, the Shroud, the cross, etc. May have been preserved. That may be why St. Helena found the cross and other relics in the Holy Sepulchre they were buried with Jesus on Good Friday..","date":"2014-05-08","mins":"8:09 am","url":"https://shroudstory.com/2014/05/07/the-letter-from-alexius-comnenus/","cat":"history","title":"The Letter from Alexius Comnenus"},{"id":"comment-72424","author":"chesterbelloc","post":"Agree with the others who say that the Shroud made it’s way to Edessa, though the letters are likely forged. Didn’t Max Frei find pollen from Urfa on the Shroud(and before Ian Wilson’s Mandylion theory was public)? Or is he not considered reliable anymore?.","date":"2014-01-06","mins":"3:37 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"}]
