[{"id":"comment-63437","author":"chesterbelloc","post":"I happen to be a Catholic of the traditionalist bent ie, I prefer the older form of the Mass, like traditional catechisms like the Baltimore and I can tell you that even most “trads” think that Freddy Dimond(that’s the real name of the fella who runs the monastery) is a kook. A well meaning and sincere kook, but still a kook. And Merry Christmas to all!.","date":"2013-12-20","mins":"2:39 pm","url":"https://shroudstory.com/2013/12/20/fan-mail/","cat":"news_&_views","title":"Fan Mail"},{"id":"comment-131345","author":"chesterbelloc","post":"That is nauseating. When they quote the Apocalypse about the “women riding the dragon” and then focus on a statue of the Mother of Jesus, that makes me sick..","date":"2014-06-19","mins":"1:32 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"id":"comment-57035","author":"chesterbelloc","post":"I can understand why, from the point of view of science, some Shroud experts are uncomfortable with what Gary Habermas has to say. But the reality is this: if the Shroud is authentic(and I am reasonably certain that it is), it has enormous religious significance for the world. Here we have the only burial shroud(that I know of anyway) in existence with an enigmatic and mysterious imprint on it, and that shroud most likely wrapped the body of the one man in history who is said to have risen from the dead. That’s amazing, and why many scientists who are just as rigid in their bias against religion as religionists are in their fervor for religion will never accept the Shroud, even if it’s proven to be from the 1st century A.D. Because the implications of what it may mean are staggering..","date":"2013-12-06","mins":"11:48 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-57122","author":"chesterbelloc","post":"“Scientists who are just as rigid in their bias against religion as religionists are in their fervor for religion.” What about “Scientists who are rigid in their fervour for religion” and “Religionists who have a bias against Science”? They’re much nore interesting, don’t you think?<< I think that the world is full of people who don't want their worldview challenged. Just as a religious person who takes the Bible literally doesn't want to hear that the Genesis account isn't literal history(though I subscribe to the \"age day\" theory and think that Genesis and science can be reconciled), there are many scientists who will not believe in a miracle, even if they see one before their eyes. The Shroud is interesting to scientists because it's so enigmatic and unexplainable. But to someone who believes that Jesus of Nazareth really rose from death, there are only two conclusions that can be drawn 1)it's a forgery meant to fool people into thinking it's the Shroud of Christ, 2)or it really is the Shroud, and something that science cannot explain is probably the cause for the mysterious imprint. Dr. Habermas takes the latter alternative, mainly because he's as much a theologian as he is an historian. I tend to agree with him, though I have no idea if the Shroud was caused by \"a burst of radiation\". But whatever caused the image, it seems to have been a unique phenomenon. I'll leave it to the scientists to figure out what this phenomenon was; it could be something completely natural. But, even if natural, we have to ask ourselves why this has only happened to one particular burial cloth in history. As I'm sure everyone has deduced, I'm no scientist, but I do love this site. Keep up the excellent work!.","date":"2013-12-07","mins":"1:42 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-57690","author":"chesterbelloc","post":"Vermeer was also the inventor of the time machine..","date":"2013-12-10","mins":"11:43 am","url":"https://shroudstory.com/2013/12/10/maybe-vermeer-made-the-shroud-of-turin/","cat":"humor","title":"Maybe Vermeer Made the Shroud of Turin"},{"id":"comment-77807","author":"chesterbelloc","post":"As someone who participates in the Byzantine Divine Liturgy on a near weekly basis(and I live in Philly, though I haven’t been to the Cathedral in years), I can only say that I’m stunned by the ineptitude of this article. This, for example: “Ukrainian Catholics read from the Divine Liturgy of Saint John Chrysostom during services, instead of the Bible”. The Divine Liturgy of St. John Chrysostom, like all liturgies of the Catholic Church, has an Epistle and Gospel reading. Just as the Traditional Latin Mass and the Rite of Paul VI in the Western Church have their distinctive ceremonies, but also have scripture readings. Do reporters do any research anymore, or have even a rudimentary understanding of what they write about? Otherwise, I’m happy to see that there’s a replica of the Shroud there. I didn’t know that, and I plan to go see it at the first available opportunity. Thanks for the link, Dan..","date":"2014-02-09","mins":"1:31 pm","url":"https://shroudstory.com/2014/02/09/the-shroud-of-turin-replica-under-the-dome-in-northern-liberties/","cat":"news_&_views","title":"The Shroud of Turin Replica Under the Dome in Northern Liberties"},{"id":"comment-77863","author":"chesterbelloc","post":"Thanks for the info, Kelly..","date":"2014-02-09","mins":"5:39 pm","url":"https://shroudstory.com/2014/02/09/the-shroud-of-turin-replica-under-the-dome-in-northern-liberties/","cat":"news_&_views","title":"The Shroud of Turin Replica Under the Dome in Northern Liberties"},{"id":"comment-79158","author":"chesterbelloc","post":"Isn’t it possible that angels really did appear at Jesus’ tomb? All 4 Gospels record it, and if a man can rise from the dead, I don’t see how any of the other miracles of the Bible are unreasonable..","date":"2014-02-13","mins":"8:21 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79390","author":"chesterbelloc","post":"Annette Cloutier : Mike M : Annette, Most these Monks have little contact with civilization. Within the community of monks they usually act stupid/mentally retarded or dumb to avoid glorification by other monks. They are extremely humble and wear dirty rags. They are usually discovered by accident ( bright light coming out of their dwellings at night, sounds of people praying together where there is only one person in a room, situations where someone showed up in a place far away from where he lives with no explanation how he got there etc.) these people intentionally avoid detection so I think it’s almost impossible to get evidence for this. They get the energy from the word of God. The father of Monasticism “Abba Antonious” was a very rich man and he heard the bible read in church, the verse where Jesus told the rich man “if you want to be perfect sell what you have and give the money to the poor, and you will have treasure in heaven. Then come, follow me.” He took that verse personally and followed the commandment and started Monasticism in the whole world. So the energy is in the word of God, but how many people are willing to follow through? Hi Mike… Speaking of Anthony the Great… the rich young man who started desert monasticism ca 285, I read somewhere he wasn’t as saintly as you make him out to be… he had a pedophiliac relationship with Athanasius of Alexandria (the monk who authorized the canonization of the NT). Athanasius was no prize either… he had a wicked temper. So I don’t know about relying on past information. How can we be sure of anything really… we can’t test it empirically. But today, in our Information Age, we ought to be able to take pictures, videos, and create documentaries of these phenomenon. Just like we do of deep sea creatures of the ocean which are seldom seen (e.g., giant squid), we should be able to make a documentary of the Rainbow Body Phenomenon. Annette, I don’t want to take this too far off topic, but do you have any links about what you’re saying about Anthony the Great’s relationship with Athanasius?.","date":"2014-02-14","mins":"2:02 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79091","author":"chesterbelloc","post":"Elvis was also reportedly found with a book on the Shroud of Turin when his body was discovered(Wilcox’s book, if I’m remembering correctly). That makes it official, Kelly!.","date":"2014-02-13","mins":"4:20 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-73231","author":"chesterbelloc","post":"Relics have a sound Biblical basis. Courtesy of the EWTN Library and Fr. William Saunders: “In 2 Kings 2:9 14, the prophet Elisha picked up the mantle of Elijah after Elijah had been taken up to heaven in a whirlwind. With is, Elisha struck the water of the Jordan, which then parted so that he could cross. In another passage (13:20 21), some people hurriedly bury a dead man in the grave of Elisha, “but when the man came in contact with the bones of Elisha, he came back to life and rose to his feet.” In the Acts of the Apostles we read, “Meanwhile, God worked extraordinary miracles at the hands of Paul. When handkerchiefs or cloths which had touched his skin were applied to the sick, their diseases were cured and evil spirits departed from them” (19:11 12). In these three passages, a reverence was given to the actual body or clothing of these very holy people who were indeed God’s chosen instruments—Elijah, Elisha and St. Paul. Indeed, miracles were connected with these “relics”—not that some magical power existed in them, but just as God’s work was done through the lives of these holy men, so did His work continue after their deaths. Likewise, just as people were drawn closer to God through the lives of these holy men, so did they (even if through their remains) inspire others to draw closer even after their deaths. This perspective provides the Church’s understanding of relics.” As far as the ownership of the relics in the Angilcan Churches of England, I’ll be blunt: those Churches were stolen from the Catholics who built them for Catholic worship, so technically the relics still belong to the Catholic Church. Since it was such a long time ago, and modern day Anglicans can be no way held responsible for the sins of their ancestors(anymore than modern day Catholics can be responsible for the regrettable acts of other Catholics, past or present), the relics should stay where they are as long as the custodians of those relics treats them with the respect and reverence they are due. As far as the ownership of the Turin Shroud: my personal opinion is that it was stolen from the Eastern Church, and still belongs to them. However, many members of the Orthodox Church seem to regard the Shroud as a fraud because they don’t recognize it’s provenance with either the Edessa cloth or the full figured Shroud Robert De Clari described, so they might not want it. And Eastern Christians who are in communion with the See of Rome probably don’t care whether the custodians of the cloth are Western or Eastern Christians, so long as it treated with respect..","date":"2014-01-13","mins":"12:22 pm","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","title":"When is a relic not a relic?"}]
