[{"id":"comment-163212","author":"chesterbelloc","post":"I think the article goes off the rails when it mentions among the “loin cloth” as being among the details no longer seen today. Does Charles really believe that painted images of the loincloth were somehow rubbed off the Shroud, only to reveal buttocks underneath? Adding to that that other early paintings show circular crown of thorns, nail wounds in the palms,and other details that we know aren’t there, this is a fairly unconvincing article..","date":"2014-10-17","mins":"4:35 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163219","author":"chesterbelloc","post":"I certainly don’t think it’s a “deliberate attempt to deceive”; Dr. Freeman I’m sure believes what he writes. But the idea that St. Charles Borremeo had someone paint a loin cloth on the Shroud, and now it’s gone, is silly. I’m sure the Shroud that St. Charles saw had the same naked figure that it always has had, but an artist copying the Shroud painted the loincloth on for modesty’s sake. Likewise the circlet crown of thorns, and wounds in the palms, because this is what people expected to see based on the depictions of the Crucifixion in their own parish Churches..","date":"2014-10-17","mins":"5:02 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163510","author":"chesterbelloc","post":"I also read Picknett and Prince’s book. In fact, I devoured it, more than once, because it was such a sensationalistic good read. But they rely on the Priory of Sion, phone calls from mysterious anonymous people, and that kind of nonsense to come to their conclusions. I can’t believe anyone would take their book seriously, other than as darn good fiction..","date":"2014-10-18","mins":"12:40 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-79867","author":"chesterbelloc","post":"Didn’t the Roman historian Tacitus say that an earthquake occurred(along with worldwide darkness) in what we would today call 33 AD? I’m not saying that an earthquake caused the image on the Shroud(that seems absurd), but there are extra Biblical reports of seismic activity(as well as an eclipse) in April of the year 33..","date":"2014-02-16","mins":"6:00 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism"},{"id":"comment-80057","author":"chesterbelloc","post":"Hugh Farey : In a word, no he didn’t. And no there aren’t. Jim Bishop mentions it in his book THE DAY CHRIST DIED. I guess that anyone who actually believes that some of the events of the Bible are true are untrustworthy, or biased. At least that’s the impression I get from a lot of the folks on this blog..","date":"2014-02-17","mins":"11:47 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism"},{"id":"comment-101676","author":"chesterbelloc","post":">> they had better be prepared to stand their ground against the critics. For the 100 facts in the shroud’s defense, Linse says, “we can counter with 1 million that show it’s a fake.<< I'd like to know what those million facts are that show it to be a fake. I know of two: The D'Arcis Memorandum, and the 1988 C 14 test. Both are very problematic(the C 14 more than the memorandum), but I would think that the rest of the evidence is in favor of authenticity, or at least that it's not a work of art in any conventional sense..","date":"2014-04-20","mins":"11:33 am","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","title":"Wayne Phillips:  Hopes to create a small “Shroud Army”"},{"id":"comment-145835","author":"chesterbelloc","post":"Why was Frei used as an expert on the “Hitler Diaries” when they were discovered if his name was mud in his native country? Surely Der Spiegel knew his past history when he was asked to help authenticate them. Nickell and the other Shroud critics always bring up Frei’s part in the Hitler diaries fiasco, but not his past checkered history. It’s all very strange to me..","date":"2014-08-24","mins":"11:58 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-145652","author":"chesterbelloc","post":"Do people really seriously believe that Frei manipulated his findings? I read Mc Crone’s book(which I enjoyed thoroughly), but the chapter by Steven Schafersman on Frei was character assassination on the same level as those who claim that the C 14 labs intentionally manipulated the tests. Especially since Frei is no longer here to defend himself..","date":"2014-08-23","mins":"11:48 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-75019","author":"chesterbelloc","post":">>“All other evidence suggests it is 1st c.” I know of only one piece of evidence, the Pilatus coins. Try looking at a good photo of the Shroud: can you see the coins and the letters of the inscriptions?<< I've always seen them ever since I saw the PBS special with Fr. Filas in the eighties, and I can't not see them now. Too many coincidences right around the eyes with the apparent lepton and inscription for me to think they're not there, but who knows? Lots of other evidence suggests 1st century 3rd century: the accuracy of the wounds due to crucifixion, the weave being similar to what was found at Masada, etc. But I'm just an amateur who is really enjoying this site. I love reading what is said by the experts, pro and con..","date":"2014-01-28","mins":"7:14 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75119","author":"chesterbelloc","post":">> The Masada textiles are mostly wool and are not the same as the weave of the Shroud – those that are twill are largely 2.2 not 3/1 (the Shroud herringbone) that apparently needs a different kind of heddle on the loom when being woven.<< Wilson got this information from Fleury Lemburg, who he seems to rely on a lot, even to the point of dismissing Rogers theory about the reweaving being the cause for the C14 date. So if she's wrong about the Masada textile, maybe she's also wrong about the evidence that came from Sue Benford/Joe Marino/Ray Rogers as well..","date":"2014-01-29","mins":"6:55 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75172","author":"chesterbelloc","post":"You’re correct, I haven’t read Fleury Lemburg’s paper on the reweave. At this point, I’m confused. The Pray manuscript is(in my opinion) pretty strong evidence that the Shroud dates back to at least 1190. It doesn’t seem to be a painting. It’s anatomically accurate.The Shroud face seems to have influenced Byzantine art since at least the 7th century. The contamination from sweaty hands theory doesn’t seem to pass the smell test to me. There’s no way, in my opinion, that this would be enough to throw the C14 date off by 1300+ plus years, and dating it to the exact time the Shroud popped up in Lirey. If it’s a fraud, it’s an astonishing piece of work. If it’s not, what is it? The crucified Templar? Or a miracle created in the Middle Ages(as Blessed Anne Catherine Emmerich seems to hint in some of her visions)? I’m more perplexed than ever..","date":"2014-01-30","mins":"12:54 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75184","author":"chesterbelloc","post":"If it’s not an “out and out fake”, what else could it be? I have read Joe Nickell’s book, and it wasn’t a bit convincing, but on the other hand if it’s not the true Shroud or an authentic portrait “not made by hands”, I can’t imagine it being anything other than an attempt to deceive..","date":"2014-01-30","mins":"2:14 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75186","author":"chesterbelloc","post":"But what about the negative and 3 D properties of the image? It just seems unbelievable to me that someone created such a convincing image in the Middle Ages..","date":"2014-01-30","mins":"2:33 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75203","author":"chesterbelloc","post":"Hugh and Colin(and anyone else who might know), is there any evidence that Jacques de Molay was tortured in the same manner as Our Lord? Did he look like the Shroud Man? How could his image form on a linen cloth? Thanks for any info..","date":"2014-01-30","mins":"8:39 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75224","author":"chesterbelloc","post":"Daveb, I believe in the Shroud as belonging to Our Lord(either at His burial, or through some miracle at some later stage), and being His true likeness. Having said that, it seems that there is a lot more skepticism than usual about the Shroud lately, and I’m trying to work out the theories that say it’is a forgery, or some unintended natural phenomenon unconnected to the historical Jesus. Believe me, I’m on your side on the issue of the Shroud, but I want to know what the alternative theories are, and why those who hold these theories believe them. From everything I’ve seen, the only thing that negates the authenticity argument is the C14. And I’m inclined to believe something went terribly wrong there, but I’m still interested in what skeptics have to say..","date":"2014-01-30","mins":"9:01 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-158639","author":"chesterbelloc","post":"Looks like a great book. Will a print edition be available too?.","date":"2014-10-02","mins":"12:38 pm","url":"https://shroudstory.com/2014/10/02/new-book-the-coming-of-the-quantum-christ/","cat":"books","title":"New Book:  The Coming of the Quantum Christ:"},{"id":"comment-120775","author":"chesterbelloc","post":"Isn’t it possible that the artists who copied the Shroud were just adding their own “improvements”? After all, some artistic renderings of the Shroud have loincloths and a circlet crown of thorns..","date":"2014-05-17","mins":"10:00 am","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","title":"Paper Chase:  The Effects of Douse Water"},{"id":"comment-77819","author":"chesterbelloc","post":"I remember reading a book about the Shroud being created by Pilate. It was by Professor Robert Drews, if I’m recalling correctly. I don’t remember his arguments for how the image was created..","date":"2014-02-09","mins":"2:26 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-80160","author":"chesterbelloc","post":"My favorite scene from JESUS OF NAZARETH is also the telling of the parable of the Prodigal Son. Robert Powell is incredible, as is James Farentino as Peter. A great movie. I also like THE PASSION OF THE CHRIST and De Mille’s silent THE KING OF KINGS..","date":"2014-02-17","mins":"8:39 pm","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-80061","author":"chesterbelloc","post":"Isn’t this a reedit from the New Testament section of the History Channel’s series on the Bible from last year?.","date":"2014-02-17","mins":"12:22 pm","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"}]
