[{"id":"comment-4549","author":"michele","post":"Do we believe God comprises all of these things? http://christianity.about.com/od/biblefactsandlists/qt/biblefactsgod.htm How can we accept God as Love, Light, Peace, alive, omnipresent, omnipotent, and omniscient AND exclusive, distant, divisive, judgmental, spiteful, and downright cruel? God is Love. God is All That Is. God is Truth. God is alive. God is everything and always has been. One Love is all that exists. There is no separation from God. God lives and breathes everything in our world. Period. Truth lives within us and can only be revealed through experience. Truth does not exist in any book, even one as historic and compelling as the Bible..","date":"2011-11-04","mins":"1:10 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4999","author":"michele","post":"Dear Annie Cee, please see post #187 below in reply to your Nov 4 post on this thread as my response did not associate here. With much love and blessings ...","date":"2011-11-24","mins":"5:35 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3624","author":"michele","post":"I do not attend “church” nor am knowledgeable enough to quote the Bible, yet after an NDE a few years ago following a near fatal accident, I “came back” experiencing an indescribable peace and knowing there was no “death”. I was agnostic/atheist prior to the accident, yet have since known without doubt the Divine realm exists and it launched me on a spiritual path. While I have not read Colton’s book, I have seen his interviews and scanned the book at the store, and fully believe all that he experienced and described as true. I purchased both of Akiane’s paintings of Jesus for my home. It does not concern me if they represent *exactly* how Jesus looked when he walked the Earth 2000 years ago. I believe the Bible even says that when Jesus re appeared following his “death” that he looked different each time, such that His disciples and Mary Magdalene did not recognize him? Since God lives, breathes, and assumes all forms of life in the Universe, what I see when I look at these images is simply the amazingly kind, patient, sweet, inspirational, and beautiful face of God. Love! ♥.","date":"2011-08-18","mins":"8:56 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4998","author":"michele","post":"Dearest Annie Cee, oh goodness. I am someone who found this site as I have the two paintings of Jesus by Akiane Kramarik and I also had a near death experience. Somehow I think we are closer in our love of God than you think. And I truly admire your choice to be a passionate advocate for God :) This forum is obviously not optimal for a conversation like this, but just to briefly respond to your latest note in this thread .. Personally experiencing God does not result in “interpretation” of Truth as that is not the way of God. God IS faithful, gracious, and unchanging, not misleading or capricious. Although interpreting the words of God in the Bible, or any other text or thought, without direct conversation with God does result in infinite interpretations! Also, God is neither passive nor distant as many believe, and spans all of the religions, philosophies, and sciences of this world. The amazing beauty of God is everywhere, yet historically, most of us have been unable to see this. Jesus happened to be one of the few human beings who walked this world as God without any veils. While we are “in” this world, we are advised in the Bible to not be “of” this world. Who knows what this really means? I personally had no idea until God began revealing its meaning. And believe me, the reality of God is beyond our wildest dreams. Nothing of this world is what we ‘think’. Anyway, you, and others here, may be interested in an infomentary called “The Star of Bethlehem” as well as the accounts documented in this film: http://bit.ly/oz8 L1o. They provide further expansions to our notions of God, from the Christian perspective, and I hope they bring further enlightenment, or at minimum, greatly add to the mystery ;) My deepest prayer is for all to experience who they really are. Until then, Mark 12:28 34. In love and gratitude ♥.","date":"2011-11-24","mins":"5:28 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3696","author":"michele","post":"Cody, you are not nuts, and what a cool dream. It sounds to me like God dropped a beautiful breadcrumb for you. My advice is to take a really close, quiet look inside yourself and ‘see’ what you see. God is living much closer to you than you might think. ♥.","date":"2011-08-26","mins":"6:02 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5154","author":"michele","post":"Michelle, I can relate to much of what you describe about your life and had that same thought (why did I come back?). My experiences included disfigurement and impairments from childhood injuries, uninvolved parents, dysfunctional relationships and abusive marriage, and a near fatal accident resulting in amnesia, brain injury, and long term cognitive, nervous system, and structural damage. I did have “near death experiences” with the last injury, yet seeing beyond the physical impairments was very difficult. At 40, I too felt 100 — alone, successful career terminated overnight, extremely frail and weak with little understanding about why I returned and what this (seemingly) crazy life here was even about. After seeking healing from nearly every traditional, alternative, and spiritual treatment possible, God graciously began revealing to me what true healing, and life, is about. And suffice to say, what is being revealed is far and away beyond anything I could have ever imagined. The best advice I could offer is to continue trusting your truth, and go deeper within yourself for all the answers you seek. Massive shifts in our world and human consciousness have been happening for the past few decades and God is revealing to EVERY one right now. And while many share similarities in experiences and resonate with similar messages, each of our paths to Truth are unique. As you are already sensing, if/when you experience Truth, you will definitely know it beyond any doubt. Love .. Thy Will Be Done ♥.","date":"2011-12-02","mins":"2:52 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5204","author":"michele","post":"Michelle, my heart SO goes out to you right now. Independent of purpose, the perceptions I held of my former “hard” life story have completely shifted, and I pray that very soon you too will shift from feeling you are “trudging forward” to feeling like you are dancing! The great news is, absolutely nothing is “wrong”. We are all being perfectly guided and we have never, ever been alone. While the words in Footprints in the Sand imply there could be two sets of footprints, that is not the case. We are never separate from Love, from when we arrive to when we depart, and perceiving the time in between as a special and unique adventure can be most helpful! Love ♥.","date":"2011-12-03","mins":"3:13 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
