[{"id":"comment-52721","author":"michele","post":"I’m the silly Michelle quoted, and thanks Annie for trying to decipher my silliness. When I said, my brother has female blood, I should have said CHROMOSOMES, as in xx, not related to the blood type neg. My brother now produces my blood. He was sent for comprehensive testing, and they did a chromosone study, which showed he had female chromosones, but, the lab report said, ”male”… so, they kept faxing the doctor asking for the right patient, since, they were unable to process this report, since it showed a female, not a male. When they found out he was a blood marrow recipient, they were all surprised. Even they never saw that before. THAT was the source for our original discussion, i have to add that my brother is very antichristian, and has always been antagonistic towards my conversion. When he was getting his transfusion of my harvested bone marrow, everyone teased him that he would become me. So, they gave him a Bible and a LED ZEPPELIN CD. It was my way of trying to appeal to his vanity, when I tried to convince him that he was like Jesus, if our blood was related, because, like Jesus, he only had a female set of chromosomes in his blood, since Jesus had no human father. I didn’t mean to offend anyone, or imply we are Merovingians, or royalty, however, I have been extensively genetically tested, because, in addition to having A Bneg blood, I was born with a rare disorder. I even was sent to the Mayo clinic, who were doing research, and they said I showed a genetic trait common in European and Russian royalty. I told them that was unlikely, knowing my relatives were common peasants, Jewish peasants, at that. It’s very fascinating to me these stories of reptiles, and aliens, etc. Since my blood has sometimes been flawed enough to make me vulnerable to ailments, and ironically strong enough to save my brother’s life, it is a topic that makes me say foolish things, or maybe they’re wise… who’s to say… we all have a certain vanity, and hope that we’re special. I DON’T feel special, so, that’s something that probably is overcompensated for, by my tangeantial romps into these things. It’s nothing that serious in my life, but, I have gotten more people contacting me over this one blog post than everything else I’ve ever written. Thanks, i think, for the interest, and repost. I am happy if I made people smile, or laugh, or think about things. Take care.. ,.","date":"2013-11-24","mins":"10:36 pm","url":"https://shroudstory.com/2011/07/25/tales-of-blood-type-ab-negative/","cat":"other_blogs","title":"Tales of Blood Type AB Negative"},{"id":"comment-52722","author":"michele","post":"No, no, not female blood type… female chromosomes. I am the original author, quoted, and my brother has the genetic chromosomes in his blood cells of a female, xx, instead of xy. Even the lab, who was testing his blood, never saw this before, but, that’s what made me tease him about how, like Jesus, who only had one set of chromosomes, Mary’s, since he had no human father, my brother had the same blood..","date":"2013-11-24","mins":"10:46 pm","url":"https://shroudstory.com/2011/07/25/tales-of-blood-type-ab-negative/","cat":"other_blogs","title":"Tales of Blood Type AB Negative"}]
