[{"id":"comment-192830","author":"giorgio_hsg","post":"About the Quad Mosaic photo. Was there a reference exposure guide (AIM POINT) for the densimetric readings for the three filters exposing the black and white films? Does anyone see gray balance in the quad mosaic image in any area of the exposure? Can someone please explain to me how this image can be used for chemical analysis in a serious discussion if exposure alone can cause color cross overs as seen in the quad mosaic image..","date":"2015-03-08","mins":"4:35 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192851","author":"giorgio_hsg","post":"Http://motion.kodak.com/motion/uploaded Files/H 1 2238t.pdf The aims of measurements are: Red: 1.10 Green: 1.40 Blue: 1.50 These figures are used to achieve gray balance. This concept is used today for G7 and Fogra printing standards. The three point wedge scale was also used to determine if the internegative emulsion had inherent cross overs that would make it impossible to balance transparencies for C printing. My responsibility was to inform Kodak and report the batch number to stop production of the film. If we were to follow the logic of the Blue Quad Mosaic process any subject I photograph (Tri Exposure) will basically reflect, transmit and absorb light based on the chemical elements pertaining to the subject resulting to an imperfect color corrected image using the above aims. So without any calibration standards, I concur OK, it adds little to our knowledge..","date":"2015-03-08","mins":"8:06 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-209816","author":"giorgio_hsg","post":"Louis, I think we had this discussion once before. But let me begin with this analogy, to the Italians it’s a Gioconda and to the rest of us, it’s the Mona Lisa. To put it more bluntly, The Shroud of Turin is very Italian and very Catholic. Any other perspective requires a high social intelligence that intrinsically we haven’t yet achieved as a species. The sociology to any group has its own structure. Regardless if we’re discussing street gangs, cosa nostra, academia, or any other group, you play by their rules. You respect their protocol. The first two groups you would because it’s a matter of life and death. Academia, and others who are deemed to possess a higher social order, still have a threshold and metaphorically speaking if you pass it, your dead with them too. As well intended STRUP was, some members did cross that threshold. Their intensions were noble, but they lost sight of the cultural difference especially when dealing with ordained priests who had ownership of the Shroud. My advise, When in Rome do like the Romans………………We may disagree with the C14 protocol, however, preservation was the Church main priority, not authenticity. Allow me to go a step further. Let’s suppose the the Shroud is proven to be an man made artifact manufactured for veneration ( a passage was found on the Shroud and it clearly states, “dry clean only”). A wonderful scientific achievement of its time that was superbly crafted and used to evoke spiritual inspiration. To Italians and Catholics it will still be revered as a great achievement and embraced as one of theirs. And what of the other faiths, and other nationalities? How will they accept the Shroud? would it be considered Idolatry? Personally to me, its authenticity is irrelevant, its existence itself, is the miracle..","date":"2015-09-07","mins":"9:57 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-194199","author":"giorgio_hsg","post":"Can it be fair to say that these images have more to do with differential analysis vs. Chemical analysis. And if so, any conclusion derived from this analysis, is speculative. However,in fairness, it may have merit with further studies..","date":"2015-03-23","mins":"8:19 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-209821","author":"giorgio_hsg","post":"Dear Joe, allow me to clarifying ownership: it is meant in the business sense you own the task. “The objective”. That is what I meant by ownership. In reality, the Italian state owned the Shroud up until 1983. Here lies another example by playing by the rules. Compare the Italian’s 1973 studies to STURPS. The sensationalism that occurred after the STURPS studies were not warmly received by Turin nor the Vatican. Legally, The Shroud was owned by the State. The Turin authority feared that Mc Crone, Father Filas, and all the other sensational press releases could have started a confrontation between Italian State and the Church for ownership of the Shroud. I agree with Louis assertion that there won’t be another examination in our life time. What’s the gain for the Vatican..","date":"2015-09-07","mins":"10:47 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209857","author":"giorgio_hsg","post":"“Nevertheless Umberto II as head of Savoy but in self imposed exile, clearly continued to assert his claim of ownership of the Shroud until his death in 1983, when his will bequeathed it to the Pope and his successors. As far as is known, the Italian government as such has never asserted any claim of ownership, nor did the Italian government ever challenge the terms of the will making this bequest”. The Italian Government never made claim but they could have at any time. My hats off to the government appreciating the importance this relic means to many throughout the world. As for Umberto’s self imposed exile? I believe you mean his fathers. The Italian constitution forbade male descendants of the House of Savoy from entering Italy. This provision was removed in 2002 after 55 years upon numerous years of pleading by Vittorio Emanuele, Son of Umberto. Umberto himself, was not even granted access to return to Italy for burial. As for Vittorio, in order to achieve a return to his homeland, Vittorio had to renounce any claim to the throne and to Italy’s crown jewels. He publicly assured the Italian government that the nation and the crown properties, confiscated by the State in 1946, “are no longer ours”, referring to the House of Savoy. “For that matter we have no claim on the Crown jewels”, he said. “We have nothing in Italy and we are not asking for anything. And it was for this reason, why the Turin authority was concerned about the Mc Crone and other issues being printed in the press. As far as ownership, as I explained to Joe, the meaning is a jargon we use for leadership in business. The “Turinese guardians” had ownership meaning to meet their objective and not be influence by external forces. I did not mean to suggest that they own the Shroud..","date":"2015-09-07","mins":"9:47 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209661","author":"giorgio_hsg","post":"Were there other fibers found in 1 EB and 6 BF in Roger’s examination?.","date":"2015-09-05","mins":"11:52 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209664","author":"giorgio_hsg","post":"Of course the answer was yes. Excerpts From Dr. Nitowsk’s Criteria for Authentication: A Procedure for the Verication·of Shroud Samples ” In September of 1982, Rogers gave Joseph Kohlbeck the Mylar tapes which he had gotten back from Mc Crone, minus the 22 which Adler has. Kohlbeck began photographing them, and lifted several samples from the tapes for experimentation with Rogers’ permission. His tests included the remounting of red particles, which turned black in oil, and the identication of calcium from the “bloody foot” area as aragonite”. Observations by Dr. Kohlbeck and Dr. Nitowski 1 EB Slide 37: Flax and other fibers Slide 38 39: Particle (blood?) Slide 41: Flax fibers: 1 half image and half non image, burned; contaminating fibers. Slide 45: Flax and contaminating fibers. Slide 47: Flax fibers and red silk. Slide 48: Flax fibers and chunk of aloes. Slide 49: Particle (blood?) encrusted fiber and calcium. Slide 53: Flax and contaminating fiber. 6 BF Slides 417 419: #417 after 3 months of being remounted in Cargille type A immersion oil 1.515. The red particles have turned to black and exuded a yellow substance. Slide 431: Particle encrusted fiber. Slide 434: Variegated red contaminating fiber..","date":"2015-09-05","mins":"1:50 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209676","author":"giorgio_hsg","post":"Hugh, I’ll be happy to answer your questions but will need some time to respond. What I do know, I’ll answer. But believe me when I tell you, I’m as confused as you. In the mean time, take a look at this page (slides two and four)…..http://www.holyshroudguild.org/dr nitowski images.html These are images I scanned form the Nitowski slide library. (I do have the full collection of Dr. Nitowski and Kohlbeck’s slides). You can see in slide two how Dr. Mc Crone adhered the sticky tape to the slide with cover. Slide four I believe shows the remounting by Dr. Kohlbeck. (two sets were made) According to Dr. Mc Crone, Page 78, “Judgement day…….” Mc Crone split them into two; “One for Ray and one for me”. On page 124 Mc Crone discusses the return of his tapes. “Among other things, remarks were made inferring that I had kept the best of the two sets”. Mc Crone further continues how he gave Rogers back his set of slides with the assurance he would be able to pick up the other set already in Rogers possession when he returns to Los Alamos in two weeks. Mc Crone was never able to retrieve them. (Why no mention of the other two) If you search the SSG archives for Rogers statement about Dr. Nitowski, your answer will be found. As far as Dr. Kohlbeck, he was only to perform top quality photomicrographs; Nothing more. But it was Kohlbeck’s research that gave light to the invisible weave threat simply by using caragille oil. I remember the days I too used it for drum scanning..","date":"2015-09-05","mins":"4:59 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209677","author":"giorgio_hsg","post":"Theory not threat.","date":"2015-09-05","mins":"5:00 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209685","author":"giorgio_hsg","post":"Hugh writes “Furthermore, the three slides sent to Rogers were, according to Nitowski, 3 BF, 3 EF, and 6 AF. Is that three original tape samples (six slides) or three of the half samples prepared by Mc Crone”? Paul Maloney from ASSIST asked if he could look at some of the sample sticky tape Nitowski and Kohlbeck received from Rogers. Dr. Kohlbeck sent 3 BF, 3 EF, and 6 AF to Paul. However, when Ray was notified by the transfer he demanded them back from Paul. Hugh writes “And how did Kohlbeck remove his samples for remounting”? I don’t know the answer. All I can state is what sticky tape Kohlbeck personally photographed by Nitowski’s slide catalog from which I couldn’t tell you which slides were in fact remounted. Hugh writes “Even more extraordinary is Dr Nitowski, writing years before Rogers claimed to have carried out his observations on his Raes sample, finding, with Dr Kohlbeck, lots of starch and a heavy coating which came away from the fibres beneath. These findings are exactly what Rogers found eight years later, and were communicated to him, but he makes no mention of that at all in his Thermochimica Acta paper, nor of the fact that this thread had been soundly denounced as a fake”. I couldn’t agree with you more about why these observations by Nitowski and Kohlbeck wasn’t mentioned. The absent of mentioning there findings was always problematic for me..","date":"2015-09-05","mins":"7:46 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209694","author":"giorgio_hsg","post":"No mention that there was two sets of slides in any of Nitowski’s note. My best educated guess, one set of slides were given and it was from the original set Mc Crone possessed..","date":"2015-09-05","mins":"11:49 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209733","author":"giorgio_hsg","post":"Hugh if you can make sense of all this, you’ll be chief of Scotland Yard. Thibault and I shared many notes together and we both came up with different conclusions about the validity of Thermochimica Acta. Personally, I concluded that cognitive bias is why Thibault and I walked away with different conclusions. As I stated before, there was never due diligence in securing chain of custody or procedural documentation done to the sticky tape once released to other researchers..","date":"2015-09-06","mins":"10:08 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209695","author":"giorgio_hsg","post":"Notes.","date":"2015-09-05","mins":"11:50 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209754","author":"giorgio_hsg","post":"Charles to your point about Gove, In 1978 the cardinal directed Mons. Caramello to give Gonella several threads from the two samples available since the exposition in 1973. However, much resistance from Baima and others to cooperate with STURP makes it feasible what threads were given to Father Rinaldi who transferred one thread to Jackson to be given to Rogers might have been in fact samples from the Princess Clotilda’s collection that Baima had in his possession. It was a very contemptuous relation between the two parties anything is possible. HSG archive December 6, 1979 Dear Father Rinaldi: I hereby certify that today I have received from you (l fragment of a thread from the Holy Shroud of Turin. It is my understanding that said fragment is to be entrusted to Ray Rogers~ of losa Alamos, N.M., as per request of Prof. Luigi Gonella, of Turin, Italy. John P. Jackson.","date":"2015-09-06","mins":"1:41 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209745","author":"giorgio_hsg","post":"Hugh, I believe most of Rogers belongings are with Barrie, but please allow him to confirm that. About the Aragonite I think it’s good science however I don’t believe Levi Setti voiced his opinion on the matter (See below abstract and conclusion). My understanding is he provided the finger prints of the positive and negative Secondary Ion Mass Spectra (SIMS) of the fibers of the Shroud and the limestone of tombs near the Damascus Gate in Jerusalem to Kohlbeck. It was Kohlbeck (Nitowski) who determined that there was a correlation between the tomb and the trace of aragonite found on the linen not Setti. Based on Setti’s conclusion from his paper, it seems he would have been more cautious without further studies. Does anyone have any evidence to show that Setti was behind Kohlbeck’s conclusion? I have not found any in the Guild’s archives. PROGRESS IN HIGH RESOLUTION SCANNING ION Ml CROSCOPY AND SECONDARY ION MASS SPECTROMETRY IMAGING MICROANALYSIS R. Levi Setti.* G. Crow and Y.L. Wang Abstract The performance of a new high resolution scanning ion microprobe (SIM) is elucidated with regard to imaging capabilities using the ion induced secondary electron (ISE) or secondarv ion (I Si) signals, and the mass resolved signal from a seco;dary ion mass spectrometry (SIMS) system. The new instrument focuses a beam extracted from a liquid metal ion source (LMIS) to a range of spot sizes reaching the 20 nm level. The probe current (1.6 p A) available at this level of lateral resolution. Which approaches the theoretical resolution limits of the SIMS method, is still adequate to obtain detailed isotopic maps for surfaces rich in the elements of low ionization potential (positive ISI), or high electron affinity (negative I Si). In addition to examples of high resolution ISE and I Si images of objects displaying sufficiently small topographic detail, mass spectra and isotopic maps are shown, testing both the lateral and depth resolution attained. The latter results belong with a program of interdisciplinary research applications of the new microprobe, which include studies of e.g., the monolayer lateral distribution of intercalant in Sb CI5 intercalated graphite and of silicate minerals and iron distribution in sections of Chondrules and their rims (components of chondrites. A class of stoney meteorites). In the biomedical field. The new microprobe finds application in e.g., the srudy of human renal calculi and bone. Most promising is the use of stable isotope tracers (e.g. , C:.44 ) to unravel the dynamics of bone mineralization, as thus far shown with the in vitro culture of the skull bone of neonatal mice Conclusions Within the limiiations of our initial exploration of high spatial resolution SIMS imaging microanalysis. Several novel structural features in a variety of materials have been brought to light which had escaped detection by other microanalytical methods. A combination of factors. Including high spatial resolution and low probe intensity have contributed at times unexpectedly. One cannot refrain from the overwhelming desire to observe many more old objects with new eyes. At the same time it is felt that such observations need be accompanied by a new generation of systematic SIMS studies. In which the peculiarities of the interaction and implant of metal ions used as probes may be understood and quantified..","date":"2015-09-06","mins":"12:38 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-173822","author":"giorgio_hsg","post":"Dan these questions and the content of the reading has yet to be approved by my mentor. I’ll will let everyone know when the survey is ready. Until then, please if you can remove this post until further notice hopefully in two weeks. Thank you Giorgio.","date":"2014-11-30","mins":"10:56 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"id":"comment-173842","author":"giorgio_hsg","post":"It’s best that we leave it as it is. I’ll just place a password on the survey so no one can gain access until it’s ready. Thanks Gio.","date":"2014-11-30","mins":"12:10 pm","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"id":"comment-173829","author":"giorgio_hsg","post":"A statistician, and business professor. I’m submitting the survey to two cluster groups, One group such as the Shroudies, the second who are knowledgeable with GMO’s. This assignment is in preparation for my master degree in business. Nothing more should be read into this. This assignment will require individuals to answer according to the readings. (yet to be approved by my two mentors) I picked these two subjects because I had already done research on them and it saved me five weeks of journal entry and I have only 15 weeks to compile my data and write the research paper. I would really appreciate that anyone interested in taking the survey wait until it is ready and answer according to the readings..","date":"2014-11-30","mins":"11:27 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"id":"comment-173836","author":"giorgio_hsg","post":"Connivence not confidence, sorry.","date":"2014-11-30","mins":"11:47 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"id":"comment-173835","author":"giorgio_hsg","post":"That would be an excellent idea; however, in all honesty, the final data analysis will be a result of confidence sampling just targeted to two groups..","date":"2014-11-30","mins":"11:47 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"}]
