[{"id":"comment-211370","author":"giorgio_hsg","post":"Charles you may want to come in contact with a few of my Eastman Kodak peers who will contest that all films comes with anomalies. And in fact, color films has more. Especially if you think your E 4 film processing technician gave two hoots about the chemistry plot indicating leuco cyan..","date":"2015-09-27","mins":"4:07 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211409","author":"giorgio_hsg","post":"I agree with Hugh’s assertion. I like to add that photography is a great tool for documentation of supporting evidence. As for the Ernie’s image, I think it’s exceptional. His understanding of lighting and the film’s characteristics is evident in his images. He was able to compensate for the film’s inherent blue green sensitivity by increasing his exposure and by formulating his own developer. His first generation prints can clearly distinguish between the blood and the charred scars left from the fire. With the original plate still in existence, pan masking techniques can be employed that can further increase the films gamut. But the fact remains, it’s still silver haloid..","date":"2015-09-28","mins":"5:50 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211420","author":"giorgio_hsg","post":"Hello Louis, I agree with Barrie’s assessment completely. Cyan dyes are the most unstable and will be the first to fade. Light source itself are also problematic. Every light source is not equally balanced in Kelvin temperature. If I am not mistaking, Barrie had only three light sources to work with. 2 were 500 watts and 1 was 1000 watts. He positioned them at 45 degree angle or so with the set of 500’s at one end of the Shroud and the 1000 watt source at the other. The poor guy had to work with time constraints and the material he had on hand. It’s a miracle he was able to capture technically sound images with the tools he had. Also keep in mind, shooting with tungsten film that diverges or converges certain light waves to achieve white light balance becomes problematic in fine research because it’s either discards or absorbs certain light waves. As for your second question, I do have a copies of the Durante’s image but not of Hal. As far as Enrie’s images, it’s unfortunate that the Guild didn’t have anyone that understood film. And as a result, the Guild passed along many poor Enrie duplicate copies that I wish they didn’t. In one such example, Dr. Jackson announced in the 1977 Shroud Conference hosted by the Guild, that the 1973 color photos obtained by Battista and Cordiglia were far superior than the Enrie’s images. Of course that was not the case, however Dr. Jackson was never privy to the original 16×20 glass plates and would have know idea of the resolution and the actual contrast of the film. As a result, the Enrie image was condemned from that moment by many Sindonologist from this side of the Atlantic..","date":"2015-09-28","mins":"10:14 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"}]
