[{"id":"comment-200708","author":"giorgio_hsg","post":"“the Christians from various denominations, whether Catholic, Anglican, Protestant, Orthodox, even non Christians who believe in Jesus, also have the right to feel they “own” the relic … because it is believed it once wrapped the body of Jesus” Louis, I am in total agreement with your statement as long as it is the true burial cloth of Jesus, however, to many of the Italians who are primarily Catholics, the Sindone is their artifact. Even the wonderful Father Rinaldi showed his national pride in some of his correspondence between the Turin authority speaking out against American scientists who he felt stepped out of line by challenging the Holy Sea’s decision on the C14 protocol. What would you expect a loyal priest to do? His first obligation is his dominated faith. As you stated in this link, the problem is human nature. As far as King Umberto donating the relic to the Holy Sea, It was a respectful gesture allowed by the Italian government since all of the Savoie’s belongings were confiscated making them property of the Italian State including the Shroud of Turin. You can find a brief explanation in Relic, Icon or Hoax?: Carbon Dating the Turin Shroud By Harry E Gove..","date":"2015-05-31","mins":"7:07 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"id":"comment-200716","author":"giorgio_hsg","post":"Louis I still have to stand by my statement. After 1946, all of the Savoys possession were confiscated and he was exiled. It’s hard to claim ownership when you have no possession of an article in question..","date":"2015-05-31","mins":"8:40 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"id":"comment-200701","author":"giorgio_hsg","post":"Louis I can tell you this much, I wouldn’t have wanted to be a member of the Episcopal faith the day when Cardinal Anastasio Ballestero received a letter from an ASSIST member pleading with him to return to the original C 41 protocol..","date":"2015-05-31","mins":"5:18 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"id":"comment-200704","author":"giorgio_hsg","post":"Yes, The Turin authority was not pleased with “outsiders” criticizing the Holy Sea’s decision pertaining to the C 14 protocol. Truth be told, the Sindone is an Italian and Catholic artifact. Emphasis on Holy Sea..","date":"2015-05-31","mins":"5:49 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"id":"comment-213582","author":"giorgio_hsg","post":"Https://video iad3 1.xx.fbcdn.net/hvideo xtf1/v/t42.1790 2/1302577 10201833918752323 39539 n.mp4?efg=ey Jyb H Ii Oj Mw M Cwicmxh Ijo1 MT Is In Zlbm Nv ZG Vfd G Fn Ijoib G Vn YWN5 X3 Nk In0%3 D&rl=300&vabr=80&oh=64f9f214545f1b5582e675f0cdb0dace&oe=562 D7 F87 Frank Zappa’s?.","date":"2015-10-25","mins":"5:11 pm","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-191240","author":"giorgio_hsg","post":"He’s alive! Interesting rebuttal to Eric Jumper https://www.dropbox.com/sh/6n94cjnvp18hawh/AAB1k3 X Jy8 Xmt RMLTT8 Q0v Wpa?dl=0.","date":"2015-02-16","mins":"9:44 pm","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"id":"comment-191261","author":"giorgio_hsg","post":"Joe that was a pun. Of course he’s past away. However, the letter brings him back to life. I too was at Dallas in 2005 selling his book, Judgment Days” for the Holy Shroud Guild to finance the event. The death threats I received at the event was the reason why Mike Minors had hired two state troopers to protect me. LOL another pun!.","date":"2015-02-17","mins":"6:09 am","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"id":"comment-191273","author":"giorgio_hsg","post":"Yes I did, all but one book I brought to the event. I had a wonderful conversation with a military chap in the wheel chair (his name escapes me) about Mc Crone. Also Fr. Kim had me rolling on the floor with his antics about Mc Crone..","date":"2015-02-17","mins":"9:12 am","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"}]
