[{"title":"Of Google Doodles and Other Coincidences","post":"its called Providence\n\n","date":"March 10, 2014 at 7:24 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-86900","author":"John Klotz","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"… or a conspiracy by the Catholic Church to remove marks which clearly demonstrated the more obvious signs of fakery …\n(Fantastic fraud theories work in both directions, it seems…)\n\n","date":"March 10, 2014 at 8:09 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-86911","author":"Hugh Farey","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Mike this is an amazing reconstruction from your insight into Dr. Jackson’s research!  Thank you for making us realize how lucky we are to view the Shroud more true to form!  (Just wondering, if you could help me out on answering if the patches and the Holland Cloth backing sewn on after the fire in 1532 were of cotton or of linen. I read conflicting reports.)\nThanks again, Mike!\nI’m not too sure what Hugh means by the Church removing (burn) marks showing signs of fakery.  How does cleaning up the Shroud show signs of fakery?\n\n","date":"March 10, 2014 at 8:41 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-86919","author":"clublu22014","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"I know that the Holland cloth was made of linen (simple 1 on 1 weave) I think the patches were linen too but I am not sure. I used to respond to Hugh’s remarks with a knee jerk before. I’ve become more used to them now, I think that one was tongue in cheek related to the conspiracy theory thread on the other post.\n\n","date":"March 10, 2014 at 8:56 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-86922","author":"Mike M","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Thank you so much Mike… (You’re amazing!)  You’ve help me so much in understanding the Shroud better!  Do you have any insight into the slight image formation found after the Holland Cloth was removed?  Was it only surface fibers affected and was it an image suggesting the face?\nAnd, what do you think of Sr. Blandina’s theory of multiple funerary cloths used at the time of this burial, cf:  Sr. Blandina Schlöemer:  Website: SudariumChristi.com/uk/tomb/compare.htm,  Barrie doesn’t relate well to this.  He thinks the Shroud was the only burial cloth used.  What is your opinion?   Again, I am deeply grateful for any and all of your insights, Mike.\n\n","date":"March 10, 2014 at 9:29 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-86930","author":"clublu22014","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"It has been suggested that the shroud was modelled from a life size crucifix figure, whose arms had to be broken off to place them in the position we see them, so the shoulders were clearly not attached to the arms. The carefully placed burn holes destroyed this evidence. While I have little time for that particular hypothesis, the story of the 1532 fire is fraught with inconsistencies which (rather like the irregularities surrounding the taking of the C-14 samples, to be fair) open the door to legitimate doubts about the conventional understanding of the event.\n\n","date":"March 10, 2014 at 11:38 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-86961","author":"Hugh Farey","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Clublu22014, thank you for the nice words, I don’t think I deserve them. The image on the back of the cloth is still debated. A poor photograph of the backside of the shroud is available in the following link (hat tip to Hugh)\nhttp://shroud.wikispaces.com/PROPERTIES\nAs you can see, ( or can’t see) it doesn’t look that there is an image there. G. Fanti believes there is, and has published a paper describing that image. He used filters to decrease background noise and increase contrast, according to him the image on the back is:\n1- superficial (i.e doubly superficial)\n2- only for the ventral figure not the dorsal one.\n3- three dimensional.\n4- corresponds to the front image location.\n5-slightly different from the front image (e.g. the nose on the back presents “the same extension of both nostrils, unlike the front side, in which the right nostril is less evident.”\nI believe the church has in its posession high definition images for the backside that has not been published yet, lets hope they release it sometime in the future.\nI personally believe the veil of Manoplello to be a painting. There is clearly brush strokes evident around the lips and the eyes. To me, it looks like a work of art. However, I believe the Sudarium of Oveido to be the facecloth that was mentioned in (John 20:7) “and the face-cloth which had been on His head, not lying with the linen wrappings, but rolled up in a place by itself.” Mark Guscin has done a great Job bringing the sudarium to light. This video from YouTube explain a lot about the sudarium.\nhttp://m.youtube.com/watch?list=PLbBbBRYEFBb3hPo_cSF-9eikve1pENm5k&v=_ojyZX5_iyU&feature=plpp\n\n","date":"March 10, 2014 at 6:05 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87077","author":"Mike M","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Hugh, this is a most interesting theory!  I’m wondering what’s the source… Picknett & Clive?’\nAnd, what then about the blood being placed first on the Shroud precluding the rendering of any artistic manipulation of the image?\n\n","date":"March 10, 2014 at 11:57 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-86967","author":"clublu22014","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Correspondents who may not be aware of it, can find and download an interesting and authoritative paper on the repairs carried out by the Poor Clares in 1534:\n“Report of the Clare Nuns of Chambery who mended the Shroud in 1534” from the book ‘Le Sainte Suaire de Chambery a Sainte-Claire-en-Ville (Avril-Mai 1534) par M. l’Abbe Leon Bouchage 1891:\nhttp://www.shroud.it/CLARES.PDF   [PDF is secured and so cannot be directly copied and pasted, version is in English]\n\n","date":"March 10, 2014 at 3:57 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87042","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Daveb, thank you for that paper. The nuns described the shroud with amazing attention to detail. It’s interesting to see that “all the counts and barons” “nobles, Ecclesiasticus and priests”…”after diligently examining it on one side and on the other” testified that it was the same shroud they saw before the fire”. So much for the “carefully place burn holes destroyed the evidence” conspiracy theory. Those people have seen the complete figure on the shroud before the fire, just like the copies made before the fire that also had the complete figure with no arms broken off. You are right Hugh, I don’t think I should waste anymore time on it either.\n\n","date":"March 10, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87066","author":"Mike M","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Hi, Clublu and welcome to the blog. Many of the aspects of the shroud get discussed quite frequently, and you can find out what’s been going on by hunting through the Categories on the right hand side.\nThe ‘blood first’ theory is one of them. If the image is that of a dead body, then there is an a priori assumption that the blood oozed, seeped or blotted itself onto the shroud first, and the image was formed (by some process as yet unknown) afterwards. If, on the other hand, the image is artificial, then there is an a priori assumption that the image would be applied first, and then the blood.\nHowever, actual studies of the shroud are inconclusive. Although most of the bloodstains have eroded away to the point of a few encrustations clinging to the interstices of threads, the material underneath them, even in relatively dark image areas, does not seem noticably paler. Some commenters have claimed that this discolouration is due to blood-serum though, not to pre-existing image.\nAlan Adler concluded that the image was due to chemical corrosion or degradation of the surface of the fibres, and claimed that the surface of image bearing fibres was corroded, while the surface of non-image bearing fibres and the surface of fibres under bloodstains, was not. However his microscope photos are far from clear, and the evidence is not as conclusive as he may have hoped. Ray Rogers, on the other hand, eventually claimed that the image was not made of degraded fibres at all, but on a thin coating on top, in which case Adler was wrong about the degradation altogether, and the blood fibres should have the same coating as the rest of the shroud, just not discoloured.\nIf the image is artificial, and formed by some sort of contact with a model or bas relief, either covered with a colourant or heated to make a scorch, then it is possible that blood was applied not to the shroud but to the model, in which case the blood would obscure the image making process, so that even artificially made, the blood could have preceded or at least occluded the image.\nAs for the account of the Abbess of Sainte Claire, well, I’m just not sure. The book from which this was taken was written 350 years after the event. I should like to know the source of both this account and the one about the fire itself, with all its details about the blacksmith Guillaume Pussod and the famous drop of silver. And who translated it it, somewhat clumsily, into English? There are a number of anomalies I find difficult to accept as read.\nWhat is one to make of the abbess’s very precise description of the marks of the scourging: “the bruises and the scourge blows on the stomach are so thick that a pin-head large zone free from blows could hardly be found.” Strange that she should focus on the stomach (twice), which is almost free of scourge marks, rather than the chest which is covered in them. Then we have: “In the middle of the body, you can notice the signs of the iron chain tying him to the column so tightly that he appears all stained with blood.”\nFinally, after fifteen days of painstaking effort by four carefully chosen nuns, we were left with a set of the clumsiest and most ill fitting patches it is possible to conceive of, only four of the sixteen large holes being completely covered.\n\n","date":"March 10, 2014 at 6:25 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87079","author":"Hugh Farey","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Hi Hugh, sorry for jumping in. just to clarify some points:\n1-Alan Adler, Baima Bollone and Ray Rogers all independently confirmed that there is no image under the blood stains (even under the clear serum stains)\n2-if human blood was placed on a hot statue it won’t be blood anymore. & if the blood was placed on a cold statue then how was the image etched on the cloth?\n3-nobody said their description was perfect especially as you have indicated, the translation was clumsy. the blood on the small of the back may look like a stain from a chain. That’s because they didn’t make the connection with the side wound producing blood in two different (vertically when the body was on the cross and horizontally in the tomb).\n4- I don’t see the connection between the quality of the patches and their account of the shroud? They were nuns not tailors.\n\n","date":"March 10, 2014 at 7:28 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87099","author":"Mike M","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Right… I get your point Hugh… someone in the patchwork department back then had a case of bad nerves.  The blood being on the model first before the shroud is also interesting.  But what about the case of rigor mortis that so many medical doctors determined was apparent when studying the TS.  Would you say that was cause and effect of a statue or of a dead man?\n\n","date":"March 11, 2014 at 7:24 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87316","author":"clublu22014","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Clarification of above in addressing Hugh’s gracious explanation of the TS image formation:  I meant to ask:  Would you say the image formation was the cause of a statue or of a dead man?\n\n","date":"March 11, 2014 at 7:45 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87321","author":"clublu22014","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Mike M:\nHalava, I think we have a working hypothesis for the direction of the image process (up) not in all directions equally.\n\n","date":"March 10, 2014 at 6:36 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87085","author":"John Klotz","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"John, (Halava, you make me hungry now)  I agree. The direction of the image process was up. Orthogonal to the horizontal plane.\n\n","date":"March 10, 2014 at 7:17 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87092","author":"Mike M","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"\nMike M :\nClublu22014, thank you for the nice words, I don’t think I deserve them. The image on the back of the cloth is still debated. A poor photograph of the backside of the shroud is available in the following link (hat tip to Hugh)\nhttp://shroud.wikispaces.com/PROPERTIES\nAs you can see, ( or can’t see) it doesn’t look that there is an image there. G. Fanti believes there is, and has published a paper describing that image. He used filters to decrease background noise and increase contrast, according to him the image on the back is:\n1- superficial (i.e doubly superficial)\n2- only for the ventral figure not the dorsal one.\n3- three dimensional.\n4- corresponds to the front image location.\n5-slightly different from the front image (e.g. the nose on the back presents “the same extension of both nostrils, unlike the front side, in which the right nostril is less evident.”\nI believe the church has in its posession high definition images for the backside that has not been published yet, lets hope they release it sometime in the future.\nI personally believe the veil of Manoplello to be a painting. There is clearly brush strokes evident around the lips and the eyes. To me, it looks like a work of art. However, I believe the Sudarium of Oveido to be the facecloth that was mentioned in (John 20:7) “and the face-cloth which had been on His head, not lying with the linen wrappings, but rolled up in a place by itself.” Mark Guscin has done a great Job bringing the sudarium to light. This video from YouTube explain a lot about the sudarium.\nhttp://m.youtube.com/watch?list=PLbBbBRYEFBb3hPo_cSF-9eikve1pENm5k&v=_ojyZX5_iyU&feature=plpp\n\nMike M:  You well deserve many kudos!  Thanks for responding and answering to all my neophytic questions.\n\n","date":"March 11, 2014 at 7:30 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87318","author":"clublu22014","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"1-Adler came to his ‘blood first’ hypothesis by observing the corrosion on the surface of the fibres, which he thought increased in proportion to the darkness of the image, and did not exist on non-image fibres, nor on ‘blood-stain’ fibres. As far as I know Rogers did not independently corroborate this, and indeed, it directly contradicts his own subsequent decision that the fibres themselves were not affected by the image formation, which formed entirely on a purported “surface coating.’ I can’t find a reference to Bollone’s opinion on the subject; can you supply one for me?\n2-I suppose it depends how much the template is heated. I wasn’t suggesting blood was dripped onto an incandescent sheet. However I agree that a warm statue would take a very long time to make much impact on a cloth. Actually, I was thinking more of a paint in a slightly acidic medium, and blood dripped onto that, and the cloth placed on top.\n3-I have now found the original 1891 book! It’s very interesting, but will take a while for me to be sure I have correctly translated the French.\n4-Nuns in general were often renowned for their exquisite sewing – after all they had little else to do – and this team was personally selected to do the job. There is something very odd about what they actually produced.\nThe rigor mortis discussion is another interesting one on philosophical rather than scientific grounds. For most of the shroud’s history the body has been described as perfect in every way, and only when critics began to point out irregularities was it necessary to try to explain them, either in terms of distortion of the body on a flat surface (rigor mortis) or conformity of the body to a contoured surface (such as a pillow of some kind), or the distortion due to the way the shroud was draped over the body, or some combination of all of these. Again, it used to be said that it was impossible for a painter to achieve such stunning anatomical accuracy – now it turns out the body isn’t that anatomically accurate after all, and so maybe a painter got bits of it wrong.\nFor what my unsubstantiated opinion is worth, I am not keen on either the body or the statue, or even the bas relief. I think I’m plumping for a thick acidic paint at the moment, as thick as toothpaste, which would not seep through the cloth but would damage the topmost fibres of the threads. However, I wouldn’t put money myself on this hypothesis yet, so don’t push me for details!\n\n","date":"March 11, 2014 at 8:28 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87338","author":"Hugh Farey","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Hi Hugh, with regards to Bollone indicating the absence of image under the blood stains. Kelly Kearse has quoted Bollone saying this on a previous post here( I just took his word for it). Please read post#44 on this thread\nhttps://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/#comment-79107\nRogers also mentioned the same observation in his book “A Chemist’s Perspective on the Shroud of Turin” even though as you say it goes against his hypothesis which is another reason (beside reconsidering the patch hypothesis) to respect Rogers as truth seeker rather than dogmatic.\nRigor Mortis was identified by experts who have a “trained eye” in forensic pathology. Medical examiners who have performed thousands of autopsies overwhelmingly confirmed these observations. Your philosophical consideration is well taken but I don’t think it explains that fact away.\nI realize you don’t want to  give more details about your toothpaste thick paint. I just want you to try something for me, I happen to paint from time to time, with oil, acrylic and water colours. I want you to try to paint anything with a toothpaste and see what will come out of it. You will soon discover how impossible it is to replicate the photographic details and realism of the shroud image.\n\n","date":"March 15, 2014 at 9:09 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-89200","author":"Mike M","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Hi, Hugh …\nIf I am right Garlaschelli  worked using an acidic paint\n(= a wrong hypothesis) …\nBut Thibault Heimburger and Giulio Fanti\ndenied the validity of that way …\n——————————–\nHere another question …\nI have just found an interesting article (on microdrops) :\nMicrodrops Evaporating on AFM Cantilevers\nby\nElmar Bonaccurso \nProgress in Colloid and Polymer Science Volume 134, 2008, pp 57-65 \nAbstract\n>The kinetics of evaporation or drying of microscopic, sessile drops from solid surfaces is relevant in a variety of technological processes, such as printing, painting, and heat-transfer applications, besides being of fundamental interest.\n>Drop evaporation has been commonly observed by means of video-microscope imaging, by ultra-precision weighing with electronic microbalances or with quartz crystal microbalances (QCM). Abundant information was gained over the years with these techniques, so that the evaporation of macroscopic drops of simple liquids from inert surfaces is nowadays well understood. The same techniques are, however, not applicable to microscopic drops. Furthermore they do not directly provide a measure of the interfacial stresses arising at the contact area between liquid and solid, which are known to play a key role in the evaporation kinetics of small drops.\n>Here I show how the use of atomic force microscope (AFM) cantilevers as sensitive stress, mass, and temperature sensors can be employed to monitor the evaporation of microdrops of water. Starting drop diameters are always below 100 μm. The foremost interest lies in exploring the last stages of the evaporation process\nSee also :\nAtomic Force Microscope Cantilevers Used as Sensors for Monitoring Microdrop Evaporation\nElmar Bonaccurso, Dmytro S. Golovko, Paolo Bonanno, Roberto Raiteri, Thomas Haschke, Wolfgang Wiechert, Hans-Jürgen Butt \nApplied Scanning Probe Methods XI\nNanoScience and Technology 2009, pp 17-38 \nLink :  http://link.springer.com/chapter/10.1007/978-3-540-85037-3_2\nAbstract\n>For studying the evaporation of millimetre-sized drops of liquids techniques such as video-microscope imaging and ultra-precision weighing with electronic microbalances or with quartz crystal microbalances have been employed in the past decades. Similar techniques are, however, hardly applicable to microscopic drops. Moreover, they do not provide a measure of the interfacial stresses arising at the contact area between liquid and solid.\n>Here we demonstrate the use of atomic force microscope (AFM) cantilevers as sensitive stress, mass, and temperature sensors for monitoring the evaporation of microdrops of water from solid surfaces.\n>Starting from considerations on drops in equilibrium, we will further discuss evaporating drops and details of the experimental technique. We will show how the evaporation of water microdrops on a hydrophobic surface differs from the evaporation on a hydrophilic surface, and how this difference becomes more pronounced towards the end of evaporation.\n>We further show that one-side metal-coated cantilevers, acting as bimetals, allow measuring the average temperature of an evaporating microdrop.\n>Finally, we will discuss two further applications of microdrops evaporating on cantilevers, namely testing the local cleanliness of cantilevers’ surfaces and calibrating cantilevers’ spring constants\n— — —\nPerhaps there is the possibility to do the controls about solutions of\nSaponaria officinalis (and then, see also : the behavior of Saponaria\non linen fibrils = concentration-evaporation phenomena, etc.) and/or starch\n(hot) solutions … or water …\nwith dissolved radioactive salts (… !?!?!?).\nSo … the possible next contamination from ukrainian nuclear reactors,\nduring the turmoils, is not an unsolved problem …\n… because under :\nhttp://www.ivanhoe.com/science/story/2011/08/896a.html\nWe can read :\n>… The earthquake in Japan raised an even bigger\nissue– radioactivity. But NC State physicist, Dr. Joel Pawlak\nmay have the solution: biodegradable foam. It works\nlike a gooey sponge to pull salt, heavy metals and\neven radioactive materials like potassium iodide\nthat don’t dissolve out of water.\n> … … … …\n>… One liter of the foam can turn a hundred liters of\ncontaminated water into safe drinking water. It’s physics and\nmaterial science that could save lives. The foam may also\noffer a new option for turning salt water into water that’s safe to drink. …\nWhat is your opinion ?\n— — —\n>The soil in Kashiwa city, Chiba, is heavily contaminated by fallout from Fukushima\n>… … …\n> … … … ..\n>… Peaks for 134 Cs and 137 Cs were extremely prominent,\noverriding all other data. The activity of the radio-cesium\ncaused Compton scattering covering half of the entire spectrum\neffectively hiding any NORM or other potentially detectible\nradio-isotopes. Further tests will need to be performed\nusing extended testing times, perhaps 48 hours, and\nno lead shielding, reducing the Compton scatter. As a\nsecondary precaution, given the levels of radio-cesium\nfound, a sample of 137 Cs with an approximate activity\nof 37,000 Bq was compared to the J-A peaks\nto fully validate the results.\nLink :\nhttp://fraughtwithperil.com/cholte/2012/05/22/soil-samples-near-tokyo-kashiwa-in-chiba/\n—————————————–\nThen the argument to investigate seems to be\nthe following :\nFlax retting in contaminated (radioactive) environment …\n—– —–\nBut I don’t believe in “this explanation” … for the results obtained in 1988 …\nSee also :\nthe book by Carlos Evaristo\n(Fatima, Portugal) titled :\n“The Untold Story of the Holy Shroud”. \nHave you read that particular book ?\n\n","date":"March 11, 2014 at 10:12 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87362","author":"piero","site":"shroudstory"},{"title":"Of Google Doodles and Other Coincidences","post":"Garlaschelli did indeed use an acidic paint, and his results were interesting but inconclusive. I should like to pursue his mechanisms a little more systematically. Thibault was quite correct in his specific criticisms, but even he was impressed by many of the characteristics of the “acid-burnt” image.\n\n","date":"March 11, 2014 at 11:46 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","id":"comment-87378","author":"Hugh Farey","site":"shroudstory"}]
