[{"id":"comment-4590","author":"john_watkins_jr","post":"I just watched Heaven is 4 real and thought it awesome and Akiane’s picture is amazing, Last year I built a 8′ cross with a 2′ crown of thorns over it and one night about 11 PM I was reading my Bible and asxked the Lord for the words to testify and three hours later woke up at 3 AM and could not sleep and went to the kitchen and looked outside to see a full moon and I was moved to take photos of the cross with the moon and ran out to the barn, it was Oct 23rd and clear and cold outside and took it out and snapped 6 photos 10 to 15 seconds apart the first being clear the second a fog dropped into the picture, the third and forth a thickening fog started to swirl around the cross and in the fifth photo it formed into a pillar of cloud coming up from the ground behind the cross perfectly over the cross heading towards heaven “Beautiful” and the sixth photo it dissapeared, I use the photos to testify now and people are amazed as so am I still, if anyone would like a set write me and I will send you a set, just put “the cross” for the headliner for me to open it and you can use them for testifying too as I have given hundreds of copies for people to use in many churches, the chances of this happening at that moment over a cross no less is astranomical so it is very powerful. My address is all one word….. Fortheking2010@aol.com God bless!.","date":"2011-11-04","mins":"11:49 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4591","author":"john_watkins_jr","post":"I only wish I could put the pictures of the cross here. Fortheking.","date":"2011-11-04","mins":"11:54 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4689","author":"john_watkins_jr","post":"Srs, as far as coltons mention of the markers being on his hands or wrist you have to acount to the fact that he was almost 4 years old and the word wrist may not have been embeded in his vocabulary as much as his hands which are the closest part of the body to the wrists short of the arm? maybe the best way he knew how to describe the markers was the hands, but I do think they may have hung people back then through the wrists as they didn’t have to wory about people working there way free by ripping thier hands through or just by their wieght they would fall away from the nails. I dont think with all the other comments colton made that we need to disect a word or two coming from a nearly 4 year old anyway..","date":"2011-11-09","mins":"7:06 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7810","author":"john_watkins_jr","post":"I got the same red flag Annie.","date":"2012-01-31","mins":"8:36 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7812","author":"john_watkins_jr","post":"Annie for months I have been trying to put a comment on here and finally it will let me? anyway if you or anyone else wants to see 6 genuine pictures I took of an 8′ cross and 2′ crown of thorns I took in the middle of the night I would be glad to send them, what happened is at 11pm at night after reading my bible I raised my hands and said, Lord I would like to bring some more souls into your kingdom but you have to give me the words or tell me what to say because nobody is listening to me, 4 hours later at around 3am I awoke and could not go back to sleep so got up to make coffee and looked outside and there was a full moon with all the stars out and the area was lit up nice with no smoke, clouds, fog or anything out, something told me go take pictures of your cross with the full moon, so I ran down to the barn with my camera and took the cross outside and started to snap the photos, 6 in a row about 15 seconds apart or as long as it takes to recharge the flash and the first was perfectly clear and the next 3 a glory cloud “the holy spirit of God desending upon the earth in the form of a cloud” the fod swirled around the cross and then in the fifth photo it formed into a pillar of cloud coming up from behind the cross and over heading towards Heaven and its perfect, its a true sign from God that he is with us and approves of what his son did for us on the cross, and suddenly in the sixth photo it was totally gone again, I went up to the house and poured a cup of coffee and started to go back and forth through the photos and realized what I had, you see I didn’t see any fog with my naked eyes out there and it just kept coming up on my camera, I was stunned, God sent me the pictures to show people and if a picture is worth a thousand words these are worth 6 thousand words, he gave me the words to testify as now it is so easy to just lay out the pictures and say look what happened whaen I took these photos of a cross I built…what do you think of that..and the conversation about Jesus must ensue, lol, he is so wise, anyway anyone that would like me to send them to you just write me at fortheking2010@aol.com and I will send them FREE lol I don’t know what that other guy is selling but lookes awefully suspitious, God bless everyons and I am glad to finally get through here I have been reading all your letters and wanted to say so much but it just wouldnt go through right.with.","date":"2012-01-31","mins":"9:07 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7978","author":"john_watkins_jr","post":"I have 6 pictures of a 8 foot cross with a 2 foot crown of thorns I built and the Lord called me out in the middle of the night to take photos of the cross with a full moon and a glory cloud settled down on it and formed a pillar of cloud behind it, anyone that would like to see the photos just write me at fortheking2010@aol.com as far as the color of his skin” Jesus” I really don’t care if he is purplle, last week I showed the photos to a 25 year old African american man in the middle of the food court at targfet and he asked Jesus into his life right there in front of everyone as the Lord asked us to do “if you will not acknowledge me in front of other me I will not acknowledge you in front of my father: so the way I look at o it one more wonderful soul for the kingdom. Again anyone that want to see a real sign from God in the form of a glory cloud behind a 8 foot cross write me and I will send it…….God bless, John the Baptist.","date":"2012-02-06","mins":"7:33 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8352","author":"john_watkins_jr","post":"Hello Annie, my mail has been flooded with comments on here lately so I thought maybe there are a few new people that would like to see the Glory cloud that setteled down behing my 8′ cross in the middle of the night into a pillar of cloud in a time lapsed 15 seconds apart 6 photo series, to see them you would have to e mail me at fortheking2010@aol.com and put Glory cloud as the headliner for me to open it and send you the pictures, God blees everyone. John, AKA Randy John….long story, lol..","date":"2012-02-16","mins":"7:23 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8514","author":"john_watkins_jr","post":"Ola, Awesome testemony !.","date":"2012-02-20","mins":"6:57 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8515","author":"john_watkins_jr","post":"Te amos !.","date":"2012-02-20","mins":"7:00 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
