[{"id":"comment-16872","author":"ncalibey","post":"Translated from google translate: Have you ever seen the piece of cloth that was cut for the C14 dating? Flury Lemberg not participate in the election of the piece that was cut, so I could hardly know that area before. See the before and after on my blog: http://lasabanaylosescepticos.blogspot.com.es/2006/01/la zona de donde se cort.html [Photo of BEFORE is little known, I asked Dan to take it down to your blog but have not done] They are high resolution pictures you can see the dramatic deterioration in the cut for the C14, in addition to finding that was much higher than indicated NATURE (1 × 7 cm). There may be patches and anything you can think of ……….. We know also that the exact parts cut sample were sent to laboratories. Almost all the damaged part is no longer observed after cutting the sample, and badly so he could see Flury Lemberg. Bad choice on the court! Carlos Otal.","date":"2012-09-24","mins":"2:22 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16918","author":"ncalibey","post":"I know that a lot of people roll their eyes at the re weave theory because of the idea of experts somehow missing it. However, Marino responded to Madame Flury Lemburg (who claimed this herself) and explained that unless one was specifically looking for a French Invisible Re weave they were unlikely to find it. He backed this up with multiple authorities who explained the technique and how it is difficult to spot. I can’t seem to find it on Shroud.com, but I have it on my laptop so I’ll be able to link it to you at some point..","date":"2012-09-25","mins":"9:46 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16957","author":"ncalibey","post":"Thanks, Carlos!.","date":"2012-09-26","mins":"5:02 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"}]
