[{"title":"Does thermally-induced scorching of linen ALWAYS produce fluorescence under uv, rendering it invalid as a model for the Turin Shroud? Answer: most definitely NO.","post":"Jan 1st 2016: New year’s progress report on the fluorescence issue.\nI have been deliberately holding back on producing the third and final instalment of the uv series. Why the delay? Well, it was to be focused on the preferred Mark 2 imaging system, the one that is boldly promoted in this blog site’s banner, i.e. the white flour imprinting model. I’ve been deliberating on how the methodology can be presented more as physical and chemical science, less as cookery, and think I have the answer.\nthere are three and only three ways of delivering thermal energy to linen and any acquired image imprint: conduction, convection and radiation. The last of those has been ruled out of contention in any number of previous postings. Sorry John Jackson, Paolo di Lazzaro etc.\nConduction? The Mark 1 technology, imprinting off a hot metal template, bas relief or fully 3D, relied on heat conduction. I persisted with it, despite (or because of) a lot of misleading or ill-informed criticism that need not concern us now, and only shelved it (temporarily to start with) when following up Joseph Accetta’s ideas on wet-imprinting with acidic dyes, mordants etc.\nThat finally led to the current Mark 2 model, using dry flour on human skin, imprinted onto wet linen. It’s the details of the oven-heating stage that are now under the spotlight. Thus far, the wet imprinted linen has been laid flat on a metal baking tray before being placed in a fan oven (supplying blown/convected hot air). I  suspect that the metal actually protects the linen (conducting away heat) while allowing the hot air to gently toast the flour imprint (via Maillard reaction etc). What’s needed, before testing for presence or absence of uv fluorescence, is a control system that dispenses with thee metal tray, which suspends the linen in the oven such that heat is supplied by hot air alone. That system might be described approximately as “thermal energy transfer via convection (natural or forced) alone”.\nThat’s the practical side of the programme. There’s also, as mentioned earlier, a “blood” posting in preparation. Admittedly with the wisdom of hindsight, or so it may seem, it will detail how the blood testing should have been done to get a less equivocal answer. Miniaturized tlc separation of methyl-esterified porphyrins, visualized by their pink or red fluorescence under uv, and run against authentic porphyrin standards, will be the proposed technology. This retired biomedical scientist was seeing those attractive porphyrin bands on tlc (thin layer chromatography) back in 1972 when analysing phototherapy bile for bilirubin photo-derivatives. Bilirubin and other bile poigments are closely related to porphyrins needless to say, being linear (ring-opened) tetrapyrroles rather than cyclic closed loop variety.  Both the porphyrins and the bile pigments retain the two propionic acid side chains that can be methyl-esterified to render  the molecule less polar and more mobile on tlc. \nThe technology is/was not difficult. What a pity that Rogers, Heller and Adler didn’t employ a chromatographic separation of any kind, being content to look for fluorescence in the entire extract, and thus scarcely qualifying as qualitative chemical analysis, far less quantitative or even semi-quantitative.\n","date":"January 1, 2016 at 6:30 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/16/does-thermally-induced-scorching-of-linen-always-produce-fluorescence-under-uv-rendering-it-invalid-as-a-model-for-the-turin-shroud-answer-most-definitely-no/","cat":"turin_shroud","id":"comment-6630","author":"Colin Berry","site":"colinberry"},{"title":"Does thermally-induced scorching of linen ALWAYS produce fluorescence under uv, rendering it invalid as a model for the Turin Shroud? Answer: most definitely NO.","post":"Things are moving at a rapid pace (when not engaged in seasonal obligations) Hugh, especially after reading (a) the wiki entry on G. de Charny and (b) the splendidly detailed pdf from Dorothy Crispino (“Why did he change his mind?” – about wanting to be buried immediately outside the walls and foundations of his church instead of inside as originally planned). I think I know why (think below-ground level out-of-sight workshop/laboratory)  and while the idea that the TS was someone else’s ransom payment to Geoffroi, I think it far mare likely that it was designed at least partly to be a cash cow, allowing reimbursements to those who time and again stumped up the necessary to free G. from his captors (he being serially prone to being captured in battle and held to ransom). Indeed I’m beginning  to think that the 100 Years War, at least to begin with,  was less about grabbing French territory, and more about grabbing Geoffroi de Charny and holding him to ransom. We  English got so good at it, that when G. was appointed bearer of the Royal standard (“Oriflamme”) , we knew exactly where to find King John, capturing and holding the monarch himself – one of G’s deeep-pocketed benefactors –  to ransom at Poitiers, and proceeded to top the hapless Geoffroi,  he having outlived his usefulness to Ransoms-We-Like Ltd.\nI have a first draft prepared, and will deliberating some more today on the key details, especially if I get held up in traffic today while delivering prezzies. Expect a new posting in a day or two. Fluorescence Part 3 will have to go on the back burner. The bit’s between the teeth, such as are left after NHS vandalisation.\n","date":"December 20, 2015 at 6:44 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/16/does-thermally-induced-scorching-of-linen-always-produce-fluorescence-under-uv-rendering-it-invalid-as-a-model-for-the-turin-shroud-answer-most-definitely-no/","cat":"turin_shroud","id":"comment-6572","author":"Colin Berry","site":"colinberry"},{"title":"Does thermally-induced scorching of linen ALWAYS produce fluorescence under uv, rendering it invalid as a model for the Turin Shroud? Answer: most definitely NO.","post":"I’m a bit confused about the ransom thing. If the Shroud were made to ransom de Charney, then it would have ended up with his capturers, not with himself. If it were a ransom, then perhaps it was given to de Charney by someone he captured (an Englishman from the 100 years war?) in order to effect his release.\n","date":"December 20, 2015 at 12:31 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/16/does-thermally-induced-scorching-of-linen-always-produce-fluorescence-under-uv-rendering-it-invalid-as-a-model-for-the-turin-shroud-answer-most-definitely-no/","cat":"turin_shroud","id":"comment-6569","author":"Hugh Farey","site":"colinberry"},{"title":"Does thermally-induced scorching of linen ALWAYS produce fluorescence under uv, rendering it invalid as a model for the Turin Shroud? Answer: most definitely NO.","post":"Now here’s a thing, which could explain all. The other day I took some cloth to our local blacksmith, who kindly heated an iron bar (about 8 x 5 x 0.5 cm) to 1000°C – which you can tell partially by the sudden loss of magnetism at the Curie point (770°C) and partially by the colour, and then dropped it on the cloth. The first sample caught fire and burnt to shreds quite quickly, even in a tin with the lid only allowing a tiny amount of air in, but the second, which was from a different sample, behaved beautifully shroud-like, and although we threw a bit of water in after 10 minutes, the chars were restricted to the area of the bar. All 32 layers were neatly scorched in decreasing sizes, just like the Shroud.\nSo far so good, but now comes the interesting bit. Having dried out the cloth and laid it on the floor, I set up a camera to photograph a good sample burn area, and then brought my UV lamp up to check the fluorescence. In all my previous experiments, I have had the lamp on, and brought the samples to it to be photographed, but this I think must be the first time that I have observed the fluorescence from the moment the lamp was switched on, as it were. To my amazement, the first thing to see was a thin red fluorescent border around the char holes, and none around the various nearby scorch marks, just as described on the Shroud. You may remember that I have never observed the red fluorescence, in spite of determined attempts to scorch cloth in an oxygen-free environment. However, while I was getting excited about this, the lamp continued to heat up – it takes about 5 minutes to reach full power – and the red fluorescence disappeared, and the familiar greeny-yellow fringe took its place, around the chars, and around the scorches, just as I have observed before, as seen in your posting of 19 Dec 2012, “Guest posting from Hugh Farey (yipee – another science bod!): here’s a snapshot of his current studies of scorching and uv fluorescence.”\nSo, it seems to me that neither your UV source, nor that of the STURP team, is/was powerful enough to detect the fluorescence around the scorches, although it may have produced a red fluorescence around chars. The implications are that, yes, scorches always fluoresce, but only at high power. There is thus no reason why the ‘image’ of the Shroud is not a scorch!\nI’ll be writing all this up, with photos, in the December BSTS Newsletter.\nCheers,\nHugh\n","date":"December 19, 2015 at 10:44 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/16/does-thermally-induced-scorching-of-linen-always-produce-fluorescence-under-uv-rendering-it-invalid-as-a-model-for-the-turin-shroud-answer-most-definitely-no/","cat":"turin_shroud","id":"comment-6565","author":"Hugh Farey","site":"colinberry"},{"title":"Does thermally-induced scorching of linen ALWAYS produce fluorescence under uv, rendering it invalid as a model for the Turin Shroud? Answer: most definitely NO.","post":"Fascinating Hugh. I’ll need to do a lot more reading before commenting in detail. First thought, however: have you considered interposing a sheet of plain glass to get a partial filtration of UV-A from UV-B?\nFrom wiki:   Ordinary window glass passes about 90% of the light above 350 nm, but blocks over 90% of the light below 300 nm.\nOne wonders if your uv source emits mainly longer wavelength UV-A initially, and then progressively more UV-B as it heats up (?). If  that were the case, the glass might prevent, or at any rate attenuate the progression from red to green-yellow fluorescence. It may be something to do with pyrolysis producing more or less polycyclic aromatic hydrocarbons (PAH) with increasing scorch or char temperature, the PAH fluorescing red under UV-A, the less-pyrolysed products on the fringes needing higher energy UV-B to fluoresce yellow-green. But don’t let any of my “musings”  (thanks Jim Carney) cramp your style…\nYup. To that other matter: any thoughts on my latest de Charny/ King John “ransom” idea? Have you seen the latest postscript on the current posting? I was well and truly gobsmacked on getting those Google returns just two hours ago…\n","date":"December 19, 2015 at 11:30 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/16/does-thermally-induced-scorching-of-linen-always-produce-fluorescence-under-uv-rendering-it-invalid-as-a-model-for-the-turin-shroud-answer-most-definitely-no/","cat":"turin_shroud","id":"comment-6566","author":"Colin Berry","site":"colinberry"},{"title":"Does thermally-induced scorching of linen ALWAYS produce fluorescence under uv, rendering it invalid as a model for the Turin Shroud? Answer: most definitely NO.","post":"175W! Wow. That is amazing, Hugh. The biggest tungsten filament light bulb I ever bought for the home was 120W as I recall, and that was far too bright except for the largest room in the house.\nMy own uv  bulb is a tiddler – a mere 4W. But it does show up fluorescence in all sorts of things, as stated. So any fluorescent chromophore in a scorch has to be an exceptionally weak one, surely, in which case that weakens any case made on the basis of those “1532” burn holes. Note the quotation marks btw. Are you intending to surprise us all in the New Year?\nSorry about my settings having defaulted, holding up your comment. I’ll check them when I get home (am using someone else’s laptop right now).\n","date":"December 17, 2015 at 6:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/16/does-thermally-induced-scorching-of-linen-always-produce-fluorescence-under-uv-rendering-it-invalid-as-a-model-for-the-turin-shroud-answer-most-definitely-no/","cat":"turin_shroud","id":"comment-6558","author":"Colin Berry","site":"colinberry"},{"title":"Does thermally-induced scorching of linen ALWAYS produce fluorescence under uv, rendering it invalid as a model for the Turin Shroud? Answer: most definitely NO.","post":"Very interesting, Colin. My old experiments still fluoresce as cheerfully as ever. Could it be anything to do with the power of the lamp? Mine is an old “Black Magic” 175W bayonet fitting from either Thorn or Osram, if I remember correctly. They don’t seem to be made anymore: I can’t find them on the internet anyway.\nCheers,\nHugh\n","date":"December 17, 2015 at 6:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/16/does-thermally-induced-scorching-of-linen-always-produce-fluorescence-under-uv-rendering-it-invalid-as-a-model-for-the-turin-shroud-answer-most-definitely-no/","cat":"turin_shroud","id":"comment-6557","author":"Hugh Farey","site":"colinberry"}]
