[{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"Such a splendid posting – beautifully explained and surely correct in its conclusions. It has to be the  best ‘why do things look the way they do? think- pieces since Hugh Farey’s on banding (had to say that to preserve balance).\nEven if  there was a single shred, nay fibre, of scientifically-based validity to the flaked-off paint assumption (which there’s not) it could easily be discarded by reference to another aspect of the TS image that I don’t suppose our tunnel-vision historian friend has given a moment’s consideration (that’s assuming he even knows about it). \n I refer to the image’s so-called non-directional character. To be painted as such, the artist would have had to abandon any idea of directional light casting the light and shade that gives form to images. It seems scarcely possible he could do that, or even have a reason to do that. So what if he painted a conventional image employing different gray-values of pigments to achieve contrast between light and dark. For flaking to have produced the present non-directional image, there would not only have to have been selective flaking off of the darker pigments that represent shade but their subsequent migration and  attachment to the lighter zones to achieve some kind of equalization effect, and somehow manage to evade chemical detection. The term I believe for all of that is wild fantasy.\nEver so slightly more realistically (so as to match those boring old facts)  the process of shedding flakes would have needed to somehow ‘cook’ or chemically etch the underlying linen fibres to achieve the right chemistry that resulted not only in chemical dehydration and superficial yellowing of the carbohydrates, as deduced by STURP from spectral and chemical properties, but also their mechanical weakening in image-bearing zones (recalling the greater ease of stripping off image fibres with the Mylar sticky tape). The sorcerer’s apprentice in Disney’s Fantasia could maybe have done that, but it’s hard to think of other candidates.\nTime maybe to close the file on painting, and return to the various -ographies already on offer – Jackson and others’  radiography (*), Fanti’s ionocoronography (**) Rogers’ chemography(***), Garlaschelli’s powder-assisted tactilography (****), oh, and as a last resort, there’s always that tedious thermography (*****) that no one on this site bar one wants to know about .\nSome might detect the tiny degree of subjectivity that crept into this comment towards the end. We scientists have to do this you realize – if only to demonstrate we’re human, same as everyone else.\n\n","date":"November 10, 2014 at 2:15 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170293","author":"Colin Berry","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"I have to say to preserve balance: read the discussion on banding (https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/) and the prequel of Hugh’s confusing post.\nBut why don’t you write a pdf about thermography Colin?\n\n","date":"November 10, 2014 at 6:05 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170356","author":"anoxie","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"Pdfs are for those who have arrived at some firm conclusions. This blogger rarely arrives at firm conclusions. It’s more a case of slowly evolving ideas, with occasional crystallization on matters of detail. It’s soft, not hard science, best confined to blogs – my own and other people’s, especially web forums. like this one for instant feedback. Having said that I may do a short posting soon, summarising the “sweat imprint” hypothesis, playing down the high-temperature scorch mechanism (others being possible if chemically-assisted) and probably stripping out the 1314 Templar reference point, me not being a historian.\nI’ve responded to your question anoxie. Please try to give a civil reply. I shan’t be offended if you wish to remain silent.\n\n","date":"November 10, 2014 at 6:50 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170364","author":"Colin Berry","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"Thank you OK for your very informative article. Thank you Dan for publishing it. To get an idea about grey scales historians must learn/study digital imaginary. Short course in remote sensing applications helped me to understand about grey scales and digital images.\n\n","date":"November 10, 2014 at 2:15 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170294","author":"Sampath Fernando","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"drum roll please……………\n\n","date":"November 10, 2014 at 2:21 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170295","author":"Thomas","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"Exellent article,, once more my sincere congratulations to O,K,.\nAfter reading such an informative paper only dishonest people with an hidden agenda to discredit the Shroud could state  that old crap that a medieval forger did indeed achieve to produce a negative body image on a linen sheet, whith ALL GREY SCALE GRADATIONS AS THE SHROUD IMAGE.\nNevertheless one question remains to be explained\nIF WE’RE TALKING ABOUT A PHOTOGRAPHIC NEGATIVE ON THE REAL SHROUD THEN THE HAIR SHOULD APPEAR WHITE (as in real black & white photographic negatives) unless the Man of the Shroud was an old man with white hair or he was ALBINO\nI think the answer is straightforward; THE IMAGE ON THE SHROUD IS NOT A REAL NEGATIVE ALTHOUGH  IT SEEMS SO(and behaves like a negative)\nTHE COLOR ON GREYSCALE IS FUNCTION OF THE DISTANCE OF THE ANATOMICAL BODY AREA RELATIVE TO THE SHEET COVERING THE BODY-NOT THE GREYSCALE TONE OF THE ANATOMICAL BODY AREA,,\nThis is one more reason to discard the photographic image theory namely the infamous Leonardo’s photographic negative crucified corpse image .\nThe only word that comes to my mind when I read people stating that it’s very easy to obtain a body negative image on a linen sheet is   NAIF     (more accurately dishonest,,  trying to fool people who reads them…)\n                                                                                           regards\n                                                                            Antero de Frias Moreira\n                                                                     Centro Português de Sindonologia\n\n","date":"November 10, 2014 at 5:07 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170335","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"Bravo!\nThis is an amazing post in that it deals quite substantially, and scientifically, with the issue at hand. One of the problems I see is that we have too many “experts” in one field spouting-off in areas in which they are not expert.\nCharles Freeman is an art historian. That does not make him an expert on physics. His “learned” opinions on things such as negativity are simply not in his area of expertise. His opinions are really speculations.\nNow a word for the hated class of humanity – lawyers, especially litigators. Evaluating expert testimony is a part of what we do on a regular basis. I have one case where representing a plaintiff, I recently used an expert accountant to assess a damage issue. Whether that expert was appropriate is now an issue on appeal by the losing (so far) side.\nI once remarked that an expert is someone with a point of view and a library card. My son Michael corrected me: “an expert is someone with a point of view, a library card and a check.”\nIn writing my manuscript, I had the advice of a PhD in physics who advised me on the image issues.  He was adamant about one thing: the image is not a holograph because it lacks a “phase” component. He also understood what Jackson and Pete Schumacher have written: the VP-8 creates a brightness map. (Actually, my adviser preferred   a “darkness” map which is the other side of the same coin. His tongue may have been slightly in cheek.)\nPoint is, that when dealing with the image, reference must be made to physics, not the speculations of an art historian publishing in a history journal, peer reviewed, I expect by other historians, if at all.\nOne more point, although I have occasionally twitted Colin (really without malice, it’s a Yankee thing I guess) his latest contributions have been remarkable and productive although we differ on the ultimate issue.\nOK’s post is physics. It must be rebutted, if at all, on the basis of physics.\n\n","date":"November 10, 2014 at 6:07 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170357","author":"John Klotz","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"In 2000, I brought in a fiber base print of the  Enrie’s collection along with a digital file to Eastman Kodak. Eastman Kodak’s engineers along with Phil Larock Kodak digital imaging photographer concluded that the banding was the attributed  to the cloth’s converting mirror frequencies. (I believe that was Hughs’ assertion too).\nGuest posting by OK, is a sound article, however, questions of human’s ability to create a negative image (Thermomechanical process for example) can be argued.  \nAnother interesting factor discussed a few years ago from my LinkedIn “science group of color specialist” asserted that the cloth hemming-bone weave pattern was crucial to the image if lennsing was attributed to the formation. If the Shroud was made from a traditional 2-1 weave, apparent edge sharpness would be lost. Human observation may have played a roll in selecting a  3-1 weave pattern to create the image.\nSo many mysteries, and when all said and done, we may never know.\n\n","date":"November 10, 2014 at 9:09 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170392","author":"HSG","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"what do you mean by “lensing”?\n\n","date":"November 10, 2014 at 9:20 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170397","author":"anoxie","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"HSG, your 3rd paragraph is very intriguing. If one prefers the medieval provenance theory then you are saying the artisan chose the 3-1 weave perhaps after much experimentation. It would be no accident then that this weave was chosen. Certainly the artisan was beyond diligent in forming this ‘exquisite’ image. An unknown master of masters, really.\nIf one prefers the 1st century provenance theory, then we may have an inkling as to why no such other burial images have been found over time. The 3-1 weave was not, likely, the usual type of linen used for burials. The TS may be unique this way, it may be, as some have hypothesized, a linen meant for use as a altar cloth or some other more luxurious usage. It was utilized as a burial shroud out of haste and/or reverence for the deceased. The use of this 3-1 weave then was providential, with of course no human observation that it would provide for an image at all.\nMystery.\n\n","date":"November 10, 2014 at 9:34 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170401","author":"David Goulet","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"Good point David, “If one prefers the 1st century provenance theory, then we may have an inkling as to why no such other burial images have been found over time. The 3-1 weave was not, likely, the usual type of linen used for burials”.\n\n","date":"November 10, 2014 at 10:07 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170404","author":"HSG","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"Vertical imaging. Parallel to the cloth.\n\n","date":"November 10, 2014 at 9:26 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170399","author":"HSG","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"“Parallel to the cloth”… and the cloth flat i guess?\n\n","date":"November 10, 2014 at 10:11 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170405","author":"anoxie","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"In photography the light source would be the same degree as the subject in this case a flat art. In Thermal, a receptor would have been applied; possibly by a flue mechanism (Draft) or transfer.\n\n","date":"November 10, 2014 at 10:16 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170407","author":"HSG","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"I don’t understand what you mean. But thinking the cloth was flat during the image formation is already a gamble.\n\n","date":"November 10, 2014 at 10:30 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170411","author":"anoxie","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"Lensing from the herring-bone weave?  Interesting possibilities for further investigation maybe.  I have often been fascinated with the wavy interference patterns from the folds in gauze curtains.  You can even see them in a doubled-up air-filter from a clothes dryer.  I’ve explained to young folk that it demonstrates the wave properties of light.  I wonder if there’s some association with the way that the TS image was formed.  Could it be something to do with the pitch of the weave?  The physics of light can yield some interesting surprises.\n\n","date":"November 11, 2014 at 3:29 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170565","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"Hello OK,\nYour paper is very interesting.\nI have the HaltaDefinizione pictures and I would like to verify your claims using GIMP.\nYou wrote for example :”Here we have the graph of default greyscale of it”\n“It” being the COLOR Durante photograph.\nI do not understand: what do you mean by “default greyscale” of a color photo.\n\n","date":"November 10, 2014 at 4:30 pm","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170458","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"I do not understand: what do you mean by “default greyscale” of a color photo.\nThe histogram of greyscale values rigth below first Shroud image.\n\n","date":"November 10, 2014 at 4:32 pm","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170459","author":"O.K.","site":"shroudstory"},{"title":"Guest Posting by O.K. on the Shroud as a Negative","post":"Hi Thibault,\nYou have the HaltaDefinizione digital photograhs or you have some (or entire!) screenshot extracts from the HaltaDefinizione Web 2.0 app?\n\n","date":"November 10, 2014 at 8:19 pm","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","id":"comment-170501","author":"Mario Latendresse","site":"shroudstory"}]
