[{"title":"How do we know? No directionality of light.","post":"“we have no solid reason for thinking the image represents reflected light on a man’s body”\nGood point. Now I know it’s greatly frowned upon by some designated pro authentication gatekeeprs here, but dare we suggest that the light represented on the shroud is not reflected off the body because rather it came from the body? Imagine that — the shroud visually documents an exotic phenomenon predictable by both OT and NT texts and heavily hinted at in the very narrative surrounding the burial/resurrection of Christ where the shroud would have been during such an event! Hmm, that’s too obvious, let’s just call it a metaphor and quickly move on from this predetermined dead-end without looking deeper into it first!\nFor those who can suppress the emotional knee-jerk and want to scientifically investigate the possibility — is there some documented phenomenon in nature that could at the very least hint at light emitting from the human form? If so, could it under some unusual circumstance be increased to a high enough degree to be seen by the naked eye or physically alter material like the shroud? Are there any leads in the scientific literature of such a strange phenomenon existing?\nBiophotons – The Light in Our Cells\nFrom: http://transpersonal.de/mbischof/englisch/webbookeng.htm\nWhat are biophotons ?\nBiophotons, or ultraweak photon emissions of biological systems, are weak electromagnetic waves in the optical range of the spectrum – in other words: light. All living cells of plants, animals and human beings emit biophotons which cannot be seen by the naked eye but can be measured by special equipment developed by German researchers.\nThis light emission is an expression of the functional state of the living organism and its measurement therefore can be used to assess this state. Cancer cells and healthy cells of the same type, for instance, can be discriminated by typical differences in biophoton emission. […]\nAccording to the biophoton theory developed on the base of these discoveries the biophoton light is stored in the cells of the organism – more precisely, in the DNA molecules of their nuclei – and a dynamic web of light constantly released and absorbed by the DNA may connect cell organelles, cells, tissues, and organs within the body and serve as the organism’s main communication network and as the principal regulating instance for all life processes. The processes of morphogenesis, growth, differentiation and regeneration are also explained by the structuring and regulating activity of the coherent biophoton field. The holographic biophoton field of the brain and the nervous system, and maybe even that of the whole organism, may also be basis of memory and other phenomena of consciousness, as postulated by neurophysiologist Karl Pribram an others. The consciousness-like coherence properties of the biophoton field are closely related to its base in the properties of the physical vacuum and indicate its possible role as an interface to the non-physical realms of mind, psyche and consciousness.\nThe discovery of biophoton emission also lends scientific support to some unconventional methods of healing based on concepts of homeostasis (self-regulation of the organism), such as various somatic therapies, homeopathy and acupuncture. The “ch’i” energy flowing in our bodies’ energy channels (meridians) which according to Traditional Chinese Medicine regulates our body functions may be related to node lines of the organism’s biophoton field. The “prana” of Indian Yoga physiology may be a similar regulating energy force that has a basis in weak, coherent electromagnetic biofields.\nBackground\nFirst discovered in 1923 by Russian medical scientist Professor Alexander G.Gurvich (who named them “mitogenetic rays”) and in the 1930s widely researched in Europe and the USA, biophotons have been rediscovered and backed since the 1970s by ample experimental and theoretical evidence by European scientists. In 1974 German biophysicist Fritz-Albert Popp has proved their existence, their origin from the DNA and later their coherence (laser-like nature), and has developed biophoton theory to explain their possible biological role and the ways in which they may control biochemical processes, growth, differentiation etc. Popp’s biophoton theory leads to many startling insights into the life processes and may well provide one of the major elements of a future theory of life and holistic medical practice based on such an approach. The importance of the discovery has been confirmed by eminent scientists such as Herbert Froehlich and Nobel laureate Ilya Prigogine. Since 1992, the International Institute of Biophysics, a network of research laboratories in more than 10 countries, based in Germany, is coordinating research in this field which promises rapid development in the next decade. […]\nFull report:\nhttp://transpersonal.de/mbischof/englisch/webbookeng.htm\n***\nMatthew 17:1-2 And after six days Jesus taketh with him Peter, and James, and John his brother, and bringeth them up into a high mountain apart: and he was transfigured before them; and his face did shine as the sun, and his garments became white as the light.\nMark 9:2-3 And after six days Jesus taketh with him Peter, and James, and John, and bringeth them up into a high mountain apart by themselves: and he was transfigured before them; and his garments became glistering, exceeding white, so as no fuller on earth can whiten them.\nLuke 9:29 And as he was praying, the fashion of his countenance was altered, and his raiment [became] white [and] dazzling.\nLuke 24:3-4 And they entered in, and found not the body of the Lord Jesus. And it came to pass, as they were much perplexed thereabout, behold, two men stood by them in shining garments\nMatthew 28:1-4 In the end of the sabbath, as it began to dawn toward the first day of the week, came Mary Magdalene and the other Mary to see the sepulchre. And, behold, there was a great earthquake: for the angel of the Lord descended from heaven, and came and rolled back the stone from the door, and sat upon it. His countenance was like lightning, and his raiment white as snow: And for fear of him the keepers did shake, and became as dead men.\nRevelation 21:23 And the city had no need of the sun, neither of the moon, to shine in it: for the glory of God did lighten it, and the Lamb is the light thereof.\nEphesians 5:14 Wherefore he saith, Awake thou that sleepest, and arise from the dead, and Christ shall give thee light.\nPsalm 17:15 As for me, I will behold thy face in righteousness: I shall be satisfied, when I awake, with thy likeness.\nMalachi 4:2 But unto you that fear my name shall the Sun of righteousness arise with healing in his wings; and ye shall go forth, and grow up as calves of the stall.\nDaniel 10:5-6 Then I lifted up mine eyes, and looked, and behold a certain man clothed in linen, whose loins were girded with fine gold of Uphaz: His body also was like the beryl, and his face as the appearance of lightning, and his eyes as lamps of fire, and his arms and his feet like in colour to polished brass, and the voice of his words like the voice of a multitude\nRevelation 1:14-16 His head and his hairs were white like wool, as white as snow; and his eyes were as a flame of fire; And his feet like unto fine brass, as if they burned in a furnace; and his voice as the sound of many waters. And he had in his right hand seven stars: and out of his mouth went a sharp twoedged sword: and his countenance was as the sun shineth in his strength.\nExodus 34:29-35 And it came to pass, when Moses came down from mount Sinai with the two tables of testimony in Moses’ hand, when he came down from the mount, that Moses wist not that the skin of his face shone while he talked with him. 30 And when Aaron and all the children of Israel saw Moses, behold, the skin of his face shone; and they were afraid to come nigh him. […] And till Moses had done speaking with them, he put a vail on his face. 34 But when Moses went in before the LORD to speak with him, he took the vail off, until he came out. And he came out, and spake unto the children of Israel that which he was commanded. 35 And the children of Israel saw the face of Moses, that the skin of Moses’ face shone: and Moses put the vail upon his face again, until he went in to speak with him.\nNumbers 6:24-27 The LORD bless thee, and keep thee: The LORD make his face shine upon thee, and be gracious unto thee: The LORD lift up his countenance upon thee, and give thee peace. And they shall put my name upon the children of Israel; and I will bless them.\nDaniel 12:2-4 And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and everlasting contempt. 3 And they that be wise shall shine as the brightness of the firmament; and they that turn many to righteousness as the stars for ever and ever. 4 But thou, O Daniel, shut up the words, and seal the book, even to the time of the end: many shall run to and fro, and knowledge shall be increased.\netc etc..\n\n","date":"October 18, 2013 at 12:40 pm","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","id":"comment-47903","author":"EGM","site":"shroudstory"},{"title":"How do we know? No directionality of light.","post":"Fascinating! Whether it has any bearing on the Shroud or not.\n\n","date":"October 18, 2013 at 2:38 pm","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","id":"comment-47912","author":"David Goulet","site":"shroudstory"},{"title":"How do we know? No directionality of light.","post":"Many years ago I did a course in Parapsychology and heard the professor saying that the body was transformed into light.\n\n","date":"October 19, 2013 at 8:45 am","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","id":"comment-48015","author":"Louis","site":"shroudstory"},{"title":"How do we know? No directionality of light.","post":"Perhaps we could state why we think the Shroud is authentic then challenge those views?\nIt will become a skeptic’s site.\n\n","date":"October 18, 2013 at 4:22 pm","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","id":"comment-47928","author":"ChrisB","site":"shroudstory"},{"title":"How do we know? No directionality of light.","post":"If we can’t answer the questions then something is wrong.\n\n","date":"October 19, 2013 at 4:08 am","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","id":"comment-47986","author":"Dan","site":"shroudstory"},{"title":"How do we know? No directionality of light.","post":"There is an alternative explanation: The artist would not make a portrait of Christ, but the imprint of a body on the canvas. The faces of Veronica circulating in the fourteenth Century were only painted portraits. Here the artist was more original. But he could not paint a real trace of a body in a cloth because the image would be distorted like this:http://sindone.weebly.com/uploads/1/2/2/0/1220953/8859260.jpg. Then he imagines invert the tones of a portrait in which the volume does not depend on the stray light, but making with darker shades the parts closest to the fabric and making clearer the farthest ones. Note that the same idea would be used in the Jumper and Jackson interpretation, obviously with another different conclusion. I have performed the same experiment taking a Renaissance portrait and it has turned this:  http://imageshack.us/photo/my-images/21/bonaiuti3ampliadocopia.jpg/ . And  Craig did this drawing directly with the same idea: https://lh4.googleusercontent.com/-o9HJXZWP5RQ/UOp81Di1ZbI/AAAAAAAABMo/qpSoqkFQygI/s407/craig%20shroud.jpg . Not bad. \nWhat is nonsense is to compare the image of the Shroud with a Baroque portrait (Rembrandt) that models the volume with stray and hard contrasted light. Or more nonsense: I’ve seen in a movie Mr. Schumacher comparing the image of the Shroud with a Leonardo’s (three quarters view!) ink drawing. These are absolutely different pictorial techniques and concepts!\n\n","date":"October 19, 2013 at 3:23 am","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","id":"comment-47980","author":"David Mo","site":"shroudstory"},{"title":"How do we know? No directionality of light.","post":"I wasn’t comparing. I was illustrating the point about reflected light. Sorry if there was some confusion.\n\n","date":"October 19, 2013 at 3:49 am","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","id":"comment-47983","author":"Dan","site":"shroudstory"},{"title":"How do we know? No directionality of light.","post":"There’s no directionality in the image produced by the ancient pastime of brass rubbing. See this one of Sir Robert de Bures in 1310:\n\nNote too the date. Forming images this way (which could be conceived as light/dark reversed negatives when compared with conventional artists’ portraits or modern photographs) was well known in the period immediately prior to the first public display of the TS in Lirey (1357). Note too the knightly connection.\nOne wonders why it is only (to my knowledge) Luigi Garlaschelli who has explored the capturing of a negative facsimile copy of a real person (or bas relief representation or parts thereof) via frottage (a rubbing method using dust as distinct from crayon but essentially the same technology, albeit with a final baking stage to fix the image onto fabric.\nLack of directionality implies imprinting by direct contact, instead of representation via the appearance when seen in reflected light. There would have been no mystique whatsoever attaching to negative images lacking directionality where your 14th century pilgrim was concerned. What the latter lacked to reward all those foot blisters was a Secondo Pia to show the dramatic effect that can be achieved by light/dark inversion, in which the positives, still with no directionality, look eerily like real people, or photographs thereof. Ring any bells? Should do – an entire peal thereof…\n\n","date":"October 19, 2013 at 4:06 am","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","id":"comment-47985","author":"colinsberry","site":"shroudstory"},{"title":"How do we know? No directionality of light.","post":"And as for biophotons, a few very tenuous and still contentious findings of photons emitted by non-luminous bodies have escalated into an entire speculative science involving brain holograms and other more or less meaningless concepts. This passage, from EGM above, illustrates the point. It is wildly speculative, wholly unconfirmed by experiment, and largely scientifically incoherent.\n“The processes of morphogenesis, growth, differentiation and regeneration are also explained by the structuring and regulating activity of the coherent biophoton field. The holographic biophoton field of the brain and the nervous system, and maybe even that of the whole organism, may also be basis of memory and other phenomena of consciousness, as postulated by neurophysiologist Karl Pribram an others. The consciousness-like coherence properties of the biophoton field are closely related to its base in the properties of the physical vacuum and indicate its possible role as an interface to the non-physical realms of mind, psyche and consciousness.”\n\n","date":"October 19, 2013 at 9:32 am","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","id":"comment-48020","author":"Hugh Farey","site":"shroudstory"},{"title":"How do we know? No directionality of light.","post":"True but someday on this site also claimed that cutting edge\nscience is necessarily controversial.\n\n","date":"October 19, 2013 at 5:19 pm","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","id":"comment-48056","author":"David Goulet","site":"shroudstory"}]
