[{"title":"Is it true that the Shroud image (“unlike a scorch”) ceases to be visible when backlit and viewed with transmitted light? A reader comments…","post":"Hello Hugh\nPrompted by your comment, I’ve just added another picture on the end of my posting. One gets the impression that there is a single bright spot that is illuminating the dorsal side from behind. That may be OK for illustrative photography, but can hardly be a basis on which to base a major claim re one kind of image being different from another.\nEven if the lighting had been ideal, I would still have grave reservations about the kind of argument/logic  that says: the 1532 scorch marks do this, the body image does that, therefore the body image cannot be a scorch. The body image might not be scorch (if not then what?) but one needs more robust evidence than the above upon which to dismiss it. \nThe key feature of the body image has surely to be  that is is a light/dark reversed image. That unusual and crucial characteristic is explained as a thermal imprint from a hot template. Until Barrie Schwortz and others can provide an alternative explanation for that negative image with robust evidence, then I for one am sticking with the scorch hypothesis …\n","date":"November 3, 2012 at 2:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/02/is-it-true-that-the-shroud-image-ceases-to-be-visible-when-backlit-and-viewed-with-transmitted-light-a-reader-comments/","cat":"adrie","id":"comment-1109","author":"colinsberry","site":"colinberry"},{"title":"Is it true that the Shroud image (“unlike a scorch”) ceases to be visible when backlit and viewed with transmitted light? A reader comments…","post":"Are we looking at much more than noise, I wonder? The method of backlighting the shroud was almost certainly extremely crude. Is it not the case that only a very small section of the seam connecting the backing cloth to the shroud was unpicked, in which case it would have been difficult to insert anything like a uniform lighting unit between shroud and backing, or was the light behind both shroud and backing cloth together? Do we know? If the latter, and some kind of light-box was used, how uniform was the light? Without this information I’m not sure the appearance/non-appearance of the image is in any way significant; it doesn’t even indicate or contra-indicate any method of achieving it, let alone prove anything.\n","date":"November 3, 2012 at 11:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/02/is-it-true-that-the-shroud-image-ceases-to-be-visible-when-backlit-and-viewed-with-transmitted-light-a-reader-comments/","cat":"adrie","id":"comment-1107","author":"Hugh Farey","site":"colinberry"},{"title":"Is it true that the Shroud image (“unlike a scorch”) ceases to be visible when backlit and viewed with transmitted light? A reader comments…","post":"Barrie Schwortz said “When the panels of the table were removed for the transmitted light photography, the light passed ONLY through the Holland backing cloth and the linen of the Shroud.” (http://www.shroud.com/vanhels2.htm , Caps by Van Haelst)\n","date":"November 3, 2012 at 2:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/02/is-it-true-that-the-shroud-image-ceases-to-be-visible-when-backlit-and-viewed-with-transmitted-light-a-reader-comments/","cat":"adrie","id":"comment-1110","author":"Adrie","site":"colinberry"}]
