[{"title":"My immediate response to a comment on “Did the bloodstains really precede image formation on the Shroud of Turin?”","post":"As I expect you know, Matt, John Heller and Alan Adler produced evidence for blood before body image, using protein-digesting enzymes. One can nitpick if not liking that conclusion, given it makes life a little more difficult for forgers if they can’t simply paint blood onto the linen after imprinting the body image. For my part I provisionally accept the blood-first ‘dogma’ since it does not present an insuperable problem to a forger. Why not?\nThere are at least two ways round the problem, maybe more, which can be used if imprinting with powdered white flour onto wet linen (my Model 10!). The first is to sprinkle the flour onto the oil-smeared subject first, then paint or dribble the blood (or “blood”?) onto the flour-coated skin, then imprint onto the wet linen. The blood goes onto the linen first, meeting the Adler/Heller claim. But there’s a problem – the blood would look nothing like blood after the oven-roasting stage for image development!\nThere’s an alternative means which I strongly suspect was used for the site (at least) of the lance-blood. One uses an offcut of linen to protect a sizeable patch of skin from being coated with flour.  One then does the oven-roasting stage, and then and only then one paints blood onto the blank area of the linen. That could explain how the area is said to show water as well as blood, as required for strict biblical ‘authenticity’.  Of course, it’s not really “water” one sees mixed in with blood, evaporated water being invisible but small patches of blank linen, free of yellow body image! Clever these medievals!  \nI’m not sure if the masking technique would work with all the blood stains, especially the more intricate ones like those on the arms etc.\nUv fluorescence? Nope, I doubt if the intensity of uv light is a major factor, though wavelength might be. Personally I think it was a mistake on the part of Barrie Schwortz and others to make statements like “all scorches fluoresce under uv” when based purely on the weak pinkish-red fluorescence of the charred edges of the 1532 burn holes. Those edges are not experimental scorches, using the term in its broadest sense to mean linen that has acquired a thermal imprint by one means or another. Those edges have been exposed to far higher temperatures (800 degrees of more) if the molten silver reliquary narrative is correct, compared with the temperatures required for my flour-imprinting model (180 to 200 degrees C) or the slightly higher ones used in my now abandoned direct contact Model 2 using a heated bas relief.\nNone of my thermal imprints, whether one-stage “scorches” or two-step flour imprints show any fluorescence whatsoever under uv, so the attempts by promoters of authenticity to dismiss thermal imprinting out of hand via fluorescence simply don’t stand up to experimental test. It’s simply empty propaganda if the truth be told.\nI hope that helps. Don’t hesitate to keep the the questions flowing. It’s good to see some interest being shown out there!\n","date":"April 2, 2017 at 11:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/03/my-immediate-response-to-a-comment-on-did-the-bloodstains-really-precede-image-formation-on-the-shroud-of-turin/","cat":"abrasion","id":"comment-8787","author":"Colin Berry","site":"colinberry"},{"title":"My immediate response to a comment on “Did the bloodstains really precede image formation on the Shroud of Turin?”","post":"Thanks, it just seems suspicious the evidence for painted stains and painted stains where there is hair. If these “blood” stains were painted first it wouldn’t take that much effort to align the bas relief. As for Adler and Heller, I’m skeptical of the results any STURP member given some of their pseudoscientific methods and claims. Shroudies are just saying that the blood-first is slam dunk evidence that it is the real thing. As for the fluorescence your post “Most definitely no”, was very good. I was just reading what Hugh said “The implications are that, yes, scorches always fluoresce, but only at high power. There is thus no reason why the ‘image’ of the Shroud is not a scorch!”. I guess used a different wavelength of UV.\n","date":"April 2, 2017 at 11:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/03/my-immediate-response-to-a-comment-on-did-the-bloodstains-really-precede-image-formation-on-the-shroud-of-turin/","cat":"abrasion","id":"comment-8788","author":"Matt","site":"colinberry"},{"title":"My immediate response to a comment on “Did the bloodstains really precede image formation on the Shroud of Turin?”","post":"So did the “blood” come first? Or image. The stains aren’t realistic and look painted.\nAlso just another question, I read your post about scorches and fluorescence. So the reason the 1500s burn fluoresced red (and the image didn’t) was because they didn’t use a strong enough UV light? The same one as yours which didn’t make fluorescent images? Just a little confused.\n","date":"April 2, 2017 at 10:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/03/my-immediate-response-to-a-comment-on-did-the-bloodstains-really-precede-image-formation-on-the-shroud-of-turin/","cat":"abrasion","id":"comment-8786","author":"Matt","site":"colinberry"}]
