[{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"I’ve decided to delete my original comment  here – not for anything that you said, Hugh. I had strayed yet again onto matters to do with copyright – but have decided on reflection to keep my thoughts to myself.\n","date":"January 20, 2013 at 12:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1753","author":"colinsberry","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"Yes you did; that’s why I tried it. I’ll have another go tomorrow to find out how repeatable it is.\nBrain Teaser: There appears to be a similar unconformity (unless its a disconformity or a nonconformity) in the thread above the one you indicate, a double warp thread three threads down, and a strange tuft of broken fibres sticking out vertically below the thread below that. Is it all something to do with one reel of thread running out and another one being threaded in beside it to continue the weave. There are several references to this happening with weft thread, but I suppose, on a continuous weave loom, it must happen with the warp as well.\n","date":"January 19, 2013 at 10:25 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1751","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"Have just spotted your comment on TOS, Hugh, i.e. “The 3D quality of the image is a more long term goal, as my software is currently not up to it.”. Is that because your laptop will not run ImageJ?  Yes, it’s certainly heavy on RAM and processors- it can have my cooling fans running at top speed.\nYou might be interested to know that I put your dragon imprint into ImageJ a few days ago. There was a little 3D effect, as one would expect of a scorch, but nothing to write home about (or post!). But I seem to recall that you draped cloth over template, right?  Might I suggest that you try doing it my way – lay the linen over a soft underlay, then press the template in from above, the idea being to get as sharp an imprint as possible under heavier contact pressure between linen and cloth. I could then put the result into ImageJ – and/or tell you what keys I pressed.\nI’m busy right now, planning (or thinking about planning)  a new site. It will pick up on a previous interest, briefly addressed back in 2006 on a long-abandoned blog – namely the contribution that the Anglo-Saxons made to our ancestry. Major or minor? In what sense? Language, genetic, physiognomy, social organization?\nhttp://dreams-and-daemons.blogspot.co.uk/2006/11/discover-your-inner-basque-part-1.html\nPS: Thibault has just posted this to The Other site:\n“Colin has now a microscope.\nWhy does he not write a paper about his observations at fabric, thread and fiber level?”\nThere is much that could be learned from microscopy, even light microscopy, despite the ever-present risk of artefacts that Thibault has himself warned against. Maybe light microscopy needs to be done in parallel with scanning electron microscopy at the same levels of magnification, and with transverse as well as longitudinal sections to guard against the artefacts in each. But that’s for research institutes, not for the likes of me.\nThe most immediate priority is to have more close-up pictures of the weave in image-areas and blood-stained areas. Thibault used 4 such (copyrighted) pictures from the Mark Evans/STERA archive for his anti-scorching pdf. Could he not use his contacts to get the entire archive of those pictures released into the public domain? (Why are they not available anyway?) \nAgain, I have just deleted a large section on the issue of copyrighted Shroud photographs that already exist, but few have seen.\n","date":"January 20, 2013 at 5:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1755","author":"colinsberry","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"Dear Colin,\nRegarding microscopy you are right. There are many risks of misinterpretation mainly at fiber level. However, I would like to see some photographs of your own scorch experiments at fabric and thread level through your microscope. I guess you will see what I have described in my “paper” on the other site.\nThat’s why I did not answer to your rebuttal.\nI was and I’m still waiting for a rebuttal based on your own observations.\nRegarding the ME/STERA photographs, I can say that you have already seen the most interesting photographs.\nIf you want the entire collection, you just have to ask to the owner.\nIs it so difficult ?\nThibault.\n","date":"January 21, 2013 at 9:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1762","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"There is a term for people like you, Thibault, and it is none too flattering – “control freak”. You have no right to demand results that I may or may not have, making it sound as if I am withholding something. As far as I’m concerned there was little in your photographs of model scorches that aroused my interest (see below). If there had been, I would have said so in my 3-part rebuttal. It is what I choose to publish that you should respond to – not what you imagine (mistakenly) I have chosen defensively to withhold. (Oh, and let’s not forget that I have displayed pictures of my scorched linen fibres , stressing the difficulty of focusing).\nOh, and if you want to get me interested in YOUR scorches, then choose a proper bas relief template – with a detailed relief pattern- not some bit of old metal from your toolbox or scrap yard.\n","date":"January 21, 2013 at 9:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1764","author":"colinsberry","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"“freak” = “anormal, taré” (Harrap’s dictionary).\nSo, it seems to be an insult (in French).\nAnd “I have no right to demand results”.\nYes I have. \nA light scorch is a light scorch. A very light scorch is a very light scorch.. Whatever the template.\nI must conclude that you are unable to demonstrate your hypothesis and that you failed to use your microscope even at fabric and thread level.\nIn fact you don’t want to provide your observations on your own samples at fabric and thread level through your microscope.\n","date":"January 21, 2013 at 10:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1767","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"As I have said, Thibault, you must content yourself with what I have chosen to research and publish. It is not for you to dictate what I research or publish, especially as you have failed to respond to my 3-part rebuttal of your paper, published last November. One thing at a time…\n","date":"January 21, 2013 at 10:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1768","author":"colinsberry","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"Amazing – the finding with the snow that is. Is it telling us something profound we did not know about linen – like maybe the thermal conductivity of its threads is much greater than one might have imagined? Maybe the heat is rapidly conducted to the snow, which melts, and then liquid water is quickly wicked away to the top surface where it then prevents scorching? Or maybe it is steam initially driven from the linen (8% moisture) that quickly melts the snow, or just expanded hot air.\nI seem to recall speculating once that snow could have been used as an underlay to prevent excessive scorching. RIP idea that snow could have been used as an underlay etc etc…\n","date":"January 19, 2013 at 8:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1750","author":"colinsberry","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"More investigation with threads, fibres and technicalities on its way.\nMeanwhile – SNOW!!\nAnd guess what? A real disappointment. My lovely Bhutanese dragon, heated for twenty minutes over a Bunsen Burner and plunged immediately onto a piece of linen atop a 20cm bed of snow, and then pressed down with tongs and… Nothing. Nothing at all. Not a scorch, not a char, not a UV fluorescent patch, just pure unadulterated cloth, as pristine as before it was tested. Oh well..\n","date":"January 19, 2013 at 7:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1749","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"If my fibres are technical fibres (which I happily accept), then so, presumably, are the fibres of the shroud, but I don’t think I have ever seen one photographed or heard one mentioned. In three other photos I have emailed to Thibault, indisputable fibres, indisputably charred on the outside, are clearly uncoloured in the middle (just like the shroud fibres), as you can see the coloured ‘sheaths’ peeling or broken away from the core, presumably the SCW. Thibault thinks this coloured exterior may be the pectin glue which cements the fibres together in the living plant, and I wonder if it is this glue which is actually the ‘impurity layer’ we hear so much about. Either way, the fact that a scorched fibre can have the same characteristics as a shroud image fibre I believe is demonstrated.\n","date":"January 17, 2013 at 12:18 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1744","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"Sorry Colin,\nThe above photo from Hugh is NOT a fibre. It is a so-called” technical fibre”, i.e. a bundle of fibers;\nI have just written an email to Hugh about that.\nYou wrote in the caption: “Scorched linen fibre showing internal cellulose fibrils (x1000 mag.). Note the fractures.”\nNot at all. What you see is a bundle of several fibers (easily recognizable) still embedded in the rests of the middle lamella (mostly pectin). \nTherefore, all your above comments have nothing to do with the question.\nI have not the time to comment that right now;but Hugh is  free to quote my email (and the attached picture)\nMore later, as usual …\nThibault.\n","date":"January 16, 2013 at 10:27 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1743","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?","post":"Hey, guess what Thibault? On this occasion I agree with you  ;-).\nThat’s after doing a side-by-side comparison of Hugh’s picture with another x1000 photograph from one your compatriots (Christophe Baley). See the new section I have just this minute added onto to my posting.\n","date":"January 17, 2013 at 7:33 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","id":"comment-1745","author":"colinsberry","site":"colinberry"}]
