[{"id":"comment-4222","author":"jabba","post":"– What Yannick says makes a lot of sense — but then, I still HOPE that the coins and flowers are real, and I agree with Chris that human logic is very often misguided. Most good ideas don’t work. – I’ll look on Shroud.com, but does anyone have evidence or arguments FOR these items close at hand? – Adrie, if you’ve provided some, I’ve missed it..","date":"2011-10-19","mins":"10:56 am","url":"https://shroudstory.com/2011/10/19/comment-promoted-of-coins-and-flowers-and-more-on-the-shroud-of-turin/","cat":"image_theory","title":"Comment Promoted: Of Coins and Flowers and More on the Shroud of Turin"},{"id":"comment-3745","author":"jabba","post":"– My comment here is based upon only a “light” reading of the debate so far, so no one should take it too seriously. But then, for what it’s worth… – I tend to think that a corona discharge type of event accounts for the image better than does any other explanation (though, I need to study that further). – And then, while I wouldn’t be surprised if the image is the product of totally “natural” events, neither would I be surprised if at least part of the image formation is what we would call “supernatural.” Though also, I halfway suspect that what we currently call “supernatural” (ESP, Precognition, etc.) is just not currently understood, and will someday be considered quite “natural” — quantum mechanics may be pointing the way. – But also, I doubt that “faith” needs to be blind. In fact, I suspect that it should NOT be TOTALLY blind. (Not to dismiss their claims out of hand, but if blind faith were all that were needed, we could easily be tied into the Quran, or The Book of Mormon, instead of the Bible.) I sort of suspect that faith always requires something of a “leap,” but some of us can leap further than can others of us. For me, being a short leaper, the Shroud (whether natural, or supernatural) has been of significant help. I am “naturally” drawn to the other side, and since I began seriously studying the Shroud, my possibility of actually making that crossing has grown by LEAPS AND BOUNDS. (Trying to be cute, that last sentence was stretching a little, but the Shroud does seem to have added significantly to my suspicion that Jesus really was the prophesied Jewish Messiah.) – You’ve gotta admit — this is exciting stuff!.","date":"2011-08-31","mins":"9:12 am","url":"https://shroudstory.com/2011/08/30/the-ron-and-yannick-shroud-of-turin-image-discussion/","cat":"image_theory","title":"The Ron and Yannick Shroud of Turin Image Discussion"},{"id":"comment-2408","author":"jabba","post":"– It seems to me that 1. The “DIRECT” evidence – the unofficial, but highly probable, history of the Shroud, as well as the vast majority of scientific testing that’s been done on the Shroud – greatly supports Shroud authenticity… 2. The evidence against (as illustrated(?) by Mc Crone’s attitude/approach in his emails to Marino) is actually much weaker than the “ANALYTIC” — but casual — reader will generally assume. 3. It is the “INDIRECT” evidence that causes the analytic reader to insist that the Shroud is fake. 4. (Ironically enough, analytic readers tend to place too much FAITH in Sherlock Holmes. They believe that they have “eliminated the impossible” (the supernatural), and consequently believe that we are stuck with fakery — “however improbable” such a conclusion is, given the DIRECT evidence. See what I mean?) 5. I have a way to expose these analytic, but wrong headed, readers to the world, and SHOW the world that the Shroud probably is the authentic burial cloth of Jesus. 6. This would be a very good thing. – If I can get anyone interested, I’ll be happy to go on..","date":"2011-02-07","mins":"10:35 am","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”"},{"id":"comment-2418","author":"jabba","post":"– I still don’t understand this blogging stuff, but apparently SOM Eone (I assume Epscopalian?) was interested in what I had to say, so I’ll continue. (I probably would have continued anyway…) – Anyway, I think that I know how to set this particular record straight on a world wide basis, and that that would be a very good thing. – I’m not sure that the Shroud is authentic, but I sure THINK that it is, and that the VAST PREPONDERANCE of evidence supports that authenticity. I think that all the skeptics have to offer is highly suspect: Walter Mc Crone, Joe Nickell, the radio carbon dating and misled elimination of the supernatural. (Not that the supernatural is necessarily involved (or even real), just that the skeptics aren’t taking any chances.) – Anyway, what we need in order to set this record straight on a world wide basis is VERY public and EFFECTIVE debate between 2 leaders of the field. – This of course, would be on going, on line and written (certainly, not oral). – By my calculations, there are two real ‘tricks’ involved in doing this: 1) Getting a leading skeptic to participate. And even more difficult, 2) Making the debate EFFECTIVE! (When was the last time you read or listened to an effective debate?) – This will sound rather foolish, but … I THINK THAT I HAVE A WAY TO ACCOMPLISH BOTH. – I’ll be back..","date":"2011-02-08","mins":"12:23 pm","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”"},{"id":"comment-2419","author":"jabba","post":"– I’m coming here because I need help with my plan..","date":"2011-02-08","mins":"12:25 pm","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”"},{"id":"comment-2424","author":"jabba","post":"– However improbable this may sound … I think that I have a way to expose the foolishness of Shroud skeptics to the world. – And again, I think that would be a very good thing. – Since I think that the vast preponderance of evidence favors Shroud authenticity, I think that all we need do is develop EFFECTIVE and VERY public debate with one (or more) members of the skeptical leadership. – But then, actually effective debate hardly ever happens… – I claim that there are two basic reasons for the typical ineffectiveness of debate: 1) We humans are not nearly as smart, as objective or as conscious as we think we are. And, 2) Controversial issues tend to be “exponential.” – Put these together and we humans are almost always given to going in circles when debating. – (I’ve written several (unpublished) treatises on this problem. To see one of them, you can go to http://messiahornot.com/Treatise.php.) – Luckily, I think that we can ignore the first problem for now, and focus exclusively on how to deal with the complexity of our controversies. – By “exponential,” I’m referring to the tendency for 1) The basic controversial issue to have multiple sub issues. For, 2) Each sub issue to have multiple sub sub issues. And, 3) Etc. – And then, human reflexes simply were not designed to deal with this complexity. – Once into a debate, we “zone out” and slip into a fight/flight mode, where our awareness and objectivity go to Hell. Consequently, we need to extract debate from our natural reflexive handling of it… – In other words, we need to “wake up.” We need to slow down and “zoom in.” We need to muster our patience and keep narrowing our foci. – The rest is easy – albeit, possibly quite tedious. – If anyone else is still reading this crap (just kidding), I should probably give you a breather. – But, I’ll be back..","date":"2011-02-09","mins":"11:25 am","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”"},{"id":"comment-2459","author":"jabba","post":"– That was a long breather. – Sorry — it took me awhile to figure out where I could find my last post (above). I’m an old dog and a slow learner. – Anyway, the basic idea is to try to get Joe Nickell, or someone else representing the Skeptical Enquirer, to debate with you (and the rest of us) on line, in writing, in real time. – If you know of other prominent “shroudoclasts,” we could try them — if Joe and the Enquirer didn’t accept our invitations. – We would have just one spokesperson, but a lot of knowledgable consultants. And consequently, out of our antagonist we should knock the crap. (Sorry about my language.) – As you know, I think that their side of the story is really very weak, and showing just how weak it is should be a cinch — GIVEN AN ACTUALLY EFFECTIVE DEBATE. Then, whatever website (or blog) would host this debate would soon become where parties interested in hearing both sides of the Shroud controversy would be sent. And soon, the whole world would know the truth (IMO). – We could start with just a small piece of the controversy — say, “Is there real blood in all the right places?” – Again, I’ve written several unpublished treatises on this debate idea. You can find one of those at http://messiahornot.com/Treatise.php. – Please make a comment, or ask a question. – Thanks, again..","date":"2011-02-14","mins":"12:46 pm","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”"}]
