[{"id":"comment-3467","author":"jabba","post":"Dan, I figured it out. A little late, but better than never. Back on 2/7/11, I claimed on your blog that I had a way to expose (to the world) the “wrongheadedness” of the notable detractors of the Shroud — and that such would be a very good thing. I went on to say that I would happily explain my approach if anyone was interested… You were the only one interested, but clearly that was plenty, so I wrote back trying to explain. You didn’t respond, so I figured that you weren’t particularly impressed, but that you were too kind, and busy, to explicitly say so. Or maybe, you just don’t have time to personally read all your email… In truth, you’ve always been especially rational and friendly, so I figured that I just wouldn’t bother you for awhile. But then, I have continued to think about what seems to me an excellent opportunity for helping people with their Christian faith. (I don’t think that faith needs to be blind.) And, while showing up the skeptics to the world wouldn’t necessarily prove anything, it would surely help. So anyway, my approach was to challenge any, and all, notable detractors of the Shroud to a public (on line) written debate. I figured that our side would surely win an EFFECTIVE debate — and most importantly, that I KNEW HOW TO HOLD SUCH A DEBATE. And the first step in developing such debate would be putting it into writing. So anyway, I think that we (you, with us fans helping) should accept a debate, but not in an oral format. You should tell your adversaries that you would WELCOME a live, on line, debate, but that it has to be in writing — as, ORAL debates tend to be little more than side shows… I’ll try again to lay out the parameters of my alleged solution in a minimal way, and put it on this blog. If I can’t abstract it sufficiently, I’ll send my best effort by email. If anyone is interested, one of my “treatises” regarding this plan can be found on my website at http://www.Messiah Or Not.com/Treatise.php. To see that I’m probably not a kook, you can check out my brief autobiography at http://www.Messiah Or Not.com/Biography2.php. Otherwise, I’ve been arguing with a bunch of atheists re the Shroud beginning with http://debate.atheist.net/showthread.php?t=3891. That’s Part I — I’m now on Part IV. I’m probably forgetting something critical..","date":"2011-07-29","mins":"6:59 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."}]
