[{"id":"comment-9600","author":"angel","post":"Still it make’s me think for a few days, what better then use a child to keep us all from Jesus away? Many would come in his name and allot follow. While Jesus warned us all don’t believe it because its not me. Of cause this is a beautifull story, but that is how satan works. Talks smoot and in a mean while believers are mislead. Follow the scriptures..","date":"2012-03-24","mins":"7:11 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9728","author":"angel","post":"I’m not only sceptical but I don’t believe it eather, cause you see also the apostles didn’t even saw that it was Jehoshua Messhiach. I still believe in God and Jehoshua, but not in a world showing. Children are easy mislead by the devils tricks..Sorry that’s me..the shroud of Turin I can believe…still I remember what Jesus told us..some should say I am here or there, but don’t believe it, cause its not me. Ans those are not my words, but the words of Jehoshua. And his words I believe 100% !!!!.","date":"2012-03-28","mins":"12:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9729","author":"angel","post":"Maria, its crisis all over the world and people do need the money. Also allot of people want Jesus to come back. And yes by that time, the whole world will see him. For Free Maria!!! Jesus his words, ar for Free, but as you know allot of people want to make money out of Jesus his name his face, everything. While the word is already in you, and the bible to read in. The rest Jesus will tell us by that time..","date":"2012-03-28","mins":"12:12 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-18056","author":"angel","post":"Yet, notice the lips and the swelling under the right eye, specifically. The artist clearly used the Shroud of Turin as his model..","date":"2012-10-22","mins":"3:36 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18230","author":"angel","post":"Ron, I saw two images of the Edessa cloth on google images yesterday. I enlarged one of the images and it looked as though there was a is a blood 3 above the left eyebrow. Maybe this is not the case, but from the image, it looks to be so. I just copied the information on the picture and it was from the shroudofturinblogspot. Website for this image theshroudofturin.blogspot.com Full size image – Same size Size:600 × 380 Type:87 KB JPG This image may be subject to copyright. ***I just looked at the image, enlarging it. I did not go to the website. On this google image the nose does not look exactly as the long nose on the TS image. Best,.","date":"2012-10-24","mins":"4:41 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18165","author":"angel","post":"Correction in Paragraph 3. On the coin image featured above, we see on the right side of the head (left on the photo), that the hair continues down from the inverted “v,” to the lighted area that looks as though it is a script version of the letter “Y,” at the neck..","date":"2012-10-24","mins":"12:46 am","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18164","author":"angel","post":"I don’t see any difference in the length of Jesus’ hair on either side of the coin image, nor is there any difference in length on the Shroud image. There is; however, a difference in length on the Edessa Cloth. On the coin image featured above, we the right side of the head (left on the photo). That the hair continues down from the inverted “v” to the lighted area that looks as though it is a script version of the letter “Y,” at the neck. Then two broad lines continue outward from the neck. One of the broad lines is an elongated upside down “Y” and the other broad line is straight. Both broad lines continue to the shoulder and are obviously the artist’s rendition of Jesus’ hair. On the left side of the head (right looking at the image), the hair is wavy to the neck, and then there is a double broad line that falls to the shoulder. All the broad lines on both sides of the head project outward from the shoulder, clearly indicating the broad lines are hair. Therefore, on both sides of the head the hair is symmetrcal and falls to the shoulder. The artist failed to include the Trinity (3) blood spot above the left eyebrow, evidenced on the negative of the Shroud image, just to the right of the nose. The artist, as well, failed to include the blood intermingled with Jesus’ hair. The blood “3” was obvious on the Shroud and certainly would have been included on the coin, if the Shroud image was used as the model. I don’t believe it was. The nose on the Edessa cloth (King Abgar) does not look as straight as the nose on the Shroud image, and the hair on the Edessa cloth is shorter on the left side of the head. One thing amazes me though. If Jesus rubbed his face on the Edessa cloth and gave it to King Abgar for healing, then why would the Edessa cloth have the blood “3” at the forehead and also the blood spots intermingled through Jesus’ hair? This blood should not have been on the Edessa cloth, as Jesus was alive when he sent the cloth to King Abgar for healing. With that in mind, the “Edessa Cloth,” (King Abgar) had to be pressed to Jesus’ face, either after his death or on the road to the cross; otherwise there would be no visible blood on the Edessa cloth image. And there does appear to be the blood “3” above the left eyebrow on the Edessa cloth and a few blood spots in the hair. There must be another cloth, still not found, that would have been used for King Abgar’s healing and this must be the cloth used as a model for the coin. When Jesus pressed his face to the cloth, the nose would have been distorted on the cloth as pushed to the side or not straight, and there is no blood on this image, as well. Just my opinion!.","date":"2012-10-24","mins":"12:41 am","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18234","author":"angel","post":"Ron, I found the article for the Edessa image. [Above (click to enlarge): The Image of Edessa (11th century), Sakli church, Goreme, Turkey: Wilson, I http://theshroudofturin.blogspot.com/2012/08/my critique of charles freemans turin 23.html ***Maybe the markings above the left eye are not the blood “3,” yet it certainly looks to be. Also note there are spots in the hair that appear to be blood, as well. Don’t know if this is a true Edessa image, but is the one I looked at on Google. Best,.","date":"2012-10-24","mins":"4:47 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18242","author":"angel","post":"Max, Yes, I took out my magnifying glass, and I could see it more clearly. The clothes line runs horizontally and is a squiggly line that extends across the front to the left shoulder. Where the horizontal line meets the left shoulder there is an arched broad line and adjacent to the broad line is a smaller arched line. This, to my mind, would be the clothing and this would be the case if there was no veil over the head of Jesus. Yet, if Jesus was wearing a veil over his hair, then this may account for what Ron sees as clothing, and this may be correct, as well. I am viewing the picture without the veil, and in this case the hair projects out from the clothing, or more simply put, the hair lays on the clothing. Just an opinion though..","date":"2012-10-24","mins":"5:32 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18255","author":"angel","post":"Ron, no problem! Your account, with respect to the deterioration, is thoroughly convincing. Yet, it is ironic the flaking occurred exactly where the Epsilon or Trinity blood “3” is located on the TS. To my eye, the nose on the Sakli image appears to be broken. The base of the nose is flattened out. Do you know if the nail mark on the left foot of Jesus’ (TS) is centered and if the nail mark on the right foot is to the left of center, more toward the instep? Is there any picture that could be enlarged that would show the nail marks clearly?.","date":"2012-10-25","mins":"12:19 am","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18244","author":"angel","post":"Yes, Max. I can see it too, without rotating 90°; however, the Epsilon is mislocated..","date":"2012-10-24","mins":"6:25 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18317","author":"angel","post":"Yes, this looks to be no more than a few strands of hair that have fallen down onto the forehead. Actually, an impressive observation on your part. Max, below (link) is the most believable of the Justinian coins; the flowers depicted on the coin image are an exact variety as those on the TS. Click on the first picture with 4 flowers and the excerpt is displayed on the same page. Scroll down to the black and white coin image “Flowers on Justinian II coin (692–695 AD).” http://www.people.fas.harvard.edu/~brach/Jerusalem Flowers/ This Whanger coin image has been around for a while, so you’ve probably already seen it..","date":"2012-10-26","mins":"12:05 am","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-198054","author":"angel","post":"Hi, Sampath Fernando! Was 3 D imaging ever performed on the Sudarium of Oviedo for the purpose of comparing both sets of data (Sudarium and Shroud, VP8 analyzer)? Do you have a link to this comparative study? Best,.","date":"2015-04-30","mins":"7:47 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-207294","author":"angel","post":"Aside from the Shroud and even more importantly, the Sudarium is documented as having been in Oviedo, Spain since the 7th century. If both cloths (Shroud and Sudarium) covered the same face, how was it possible for Da Vinci to paint the Sudarium?.","date":"2015-08-02","mins":"8:51 pm","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-207295","author":"angel","post":"Edit: how was it possible for Da Vinci to have painted the Sudarium?.","date":"2015-08-02","mins":"8:54 pm","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-207409","author":"angel","post":"What a joke! :) If Da Vinci painted the Shroud, I’m the Queen of Spain..","date":"2015-08-04","mins":"11:31 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-207491","author":"angel","post":"A Must see on the Shroud If you recall, a while back, I mentioned the image on the Neutron Star, (Chandra telescope, B1509) titled “The Hand of God” was (to my eye) the same face as that of the Shroud of Turin. Please see the comparative fluorescence study of the Shroud of Turin against the Chandra telescope image B1509. The Sudarium is also included. The images are detailed on the following link: I have dial up with slow download and I’m unable to see the bottom half of the images, but you may have better luck. What I don’t get or see is the “Star of David” image. Will someone please explain? http://home.kpn.nl/britso531/.","date":"2015-08-05","mins":"12:23 pm","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-16628","author":"angel","post":"People are streaming in from all over the world and are paying the church to see this restored painting. ABC News with Diane Sawyer just reported that the church made millions off the restoration and the artist is suing. Apparently she wants her fair share of the money..","date":"2012-09-20","mins":"7:06 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","title":"Please keep her away from the Shroud of Turin"},{"id":"comment-15459","author":"angel","post":"Looks like an image of the “Snow monkey” on Internet Explorer images. I didn’t mean to laugh, but it’s hysterical. I feel badly for the restorer, as well. Best, Angel.","date":"2012-08-24","mins":"10:06 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","title":"Please keep her away from the Shroud of Turin"},{"id":"comment-15672","author":"angel","post":"Look at the scenario through another lens. You have a single, old, photograph of your father that you want to be restored, and with a tremendous amount of hesitation you give it to a restorer. The restorer then restores the photo and returns it to you. Yet, the original image of your father has now become the restorer’s version of how he or she believes your father should look. Would you be content? Since your photo is irreplaceable, I think not. I’m certain this restorer had all the best intentions, but she should not have deviated from the original image on the portrait. How easy it would have been for her to buy her own canvas and paint her own original Picasso like masterpiece. What she did, whether deliberate or not, is tantamount to restoring the Mona Lisa and turning her smile into a sneer..","date":"2012-08-31","mins":"8:12 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","title":"Please keep her away from the Shroud of Turin"},{"id":"comment-15958","author":"angel","post":"Daveb of wellington nz, Your restored photo probably made your family very proud. Genealogy is a tremendous amount of work, so it’s great you have a nice cover for your family’s history. This story made me think of the original artist’s family. Surely they must have been devastated at the result, although unintentional. Certainly, it was an accident; unfortunately, a very costly one. Regards,.","date":"2012-09-06","mins":"8:08 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","title":"Please keep her away from the Shroud of Turin"},{"id":"comment-134543","author":"angel","post":"Dear Colin, A question from a purely scientific point of view. Approximately two decades ago, I attended two seminars given by Dr. Alan Adler, the Porphrin Chemist, who was initially a member of STURP. He performed the blood studies on the Shroud. I distinctly remember Dr. Adler stating. “I am so good in my field that had the shroud not been exposed to a flood, causing water damage, I could have told you if Jesus was circumcized or not.” Obviously, he was referring to that private area. With that in mind, some researchers have stated DNA studies determined a trisomy (XXY) on the sex chromosome, indictative of Kleinfelter Syndrome, while other scientific researchers determined this chromosome to be XX with a Y embedded into one of the Xs or de la Chapelle Syndrome, referred to as XX male. Further, I have read de la Chapelle mimics Kleinfelter and, as well, de la Chapelle syndrome is often misdiagnosed. Regardless, as to what is finally determined (Kleinfelter Syndrome or de la Chapelle Syndrome), the salient feature of both are female traits in the male. Now, observe the full body image of the Shroud of Turin and then look closely at the upper portion of the body and then compare this image to the image posted on this site (link below) Comment Promoted: The Stavronikita Epitaphios https://shroudstory.com/2014/06/28/comment promoted the stavronikita epitaphios/#comment 134352 Now compare the two images mentioned above to that of the Hungarian Pray Codex. As a woman, I am clearly able to see female breasts on all three images, indicating either Kleinfelter Syndrome (XXY) or de la Chapelle Syndrome, (XX male). Men diagnosed with Kleinfelter Syndrome are very tall, as a rule, and have female breasts. Jesus was tall, compared to other Jewish males, at that time. I realize, as well, most believe Ron Wyatt was a fake, but surprisingly, back in the 70s or 80s, he found blood beneath the cross hole, after engineering a a dig into Zedekiah’s cave and supposedly, he had that black blood reconstituted and scientifically analyzed. The lab analysis also revealed the trisomy XXY. This study was done prior to any of the more recent studies on the sex chromosomes. Finally concluding, what are your thoughts concerning the relationship of female traits, found in men with an extra X chromosome, to the three images I’ve mentioned in the paragraphs above? Are you clearly able to see what appears obvious to me or do I need an opthalmologist? :) And if you are able to make the connection of the female traits on the shroud image to the other images, would you consider this to be a type of proof, considering sex chromosome studies verify the images? Thanks in advance. Best,.","date":"2014-06-30","mins":"4:57 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134574","author":"angel","post":"P.S. I failed to mention, if you look at the gospel accounts, you will notice Jesus was not only attuned to the feelings of women, but He was considerably sensitive Himself. This would confirm, I would think, with Jesus having an innate trait for high sensitiviy, either Kleinfelter or de la Chapelle syndrome. What say you? Jesus wept – Luke 19:41 Jesus cried – John 7:37 Jesus wept – John 11:35 Best,.","date":"2014-06-30","mins":"9:08 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134732","author":"angel","post":"Thanks, Louis. I’ll check out your reference. I absolutely agree with you that there are men who weep or have a tendency to show a more sentimental side of their personality. My response; however, was more aligned with the detection of a trisomy (XXY). If, in fact, Jesus had Kleinfelter Syndrome, as an example, that would more precisely explain His masculine/feminine traits, like long slender hands/fingers, along with the fact He was exceptionally tall, in comparison to other Hebrew men of the time. Men with Kleinfelter syndrome are generally tall. There have even been some who believe Abe Lincoln suffered from Kleinfelter syndrome. I; however, never researched that matter. :) Best,.","date":"2014-07-01","mins":"2:11 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134737","author":"angel","post":"Dear Colin: Thank you kindly for your response. Yes, you are correct! Many of the men today are significantly overweight (a causal factor for producing *moobs*) and this may be the result of an hormonal imbalance, breast cancer, bending of the elbow or merely the tilting of the beer stein. :) However, Jesus was not overweight and the genetic studies that were performed did confirm the trisomy, whether if be XXY or XX male. I’m looking forward to your posting, especially since it will enlighten us further on what we see, what we don’t see or what we think we’re seeing. :) Thanks again, Colin, for your time and effort. Best,.","date":"2014-07-01","mins":"2:56 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134986","author":"angel","post":"Louis says: “Let us know more about your research.” ***Angel says: Hi, Louis. I continue to wonder how the researcher that appeared on the video, submitted by Joe Marino, (on this website) was able to distinguish between Kleinfelter Syndrome and de la Chapelle Syndrome, especially since de la Chapelle is sometimes mistaken for Kleinfelter. I’ve also found Kleinfelter syndrome is a genetic disease, more common in Jewish males, and if the Shroud blood analyzes as XXY, then that would at least prove the man on the Shroud was/is Jewish. Two links: Genetic Diseases http://www.tomorrowachild.org/resource list.php?cat=diseases “Males with two or more X chromosomes have Klinefelter Syndrome. …. It is a common genetic disease among the Jewish population in the US (central and …” http://faculty.clintoncc.suny.edu/faculty/michael.gregory/files/bio%20101/bio%20101%20lectures/genetics %20human%20genetics/human.htm Yet, I do have a friend who heads up a Jewish ancestry DNA site and I will email him for some clarity on what distinguishes one syndrome (de la Chapelle) from the other (Kleinfelter). Best,.","date":"2014-07-02","mins":"10:09 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134738","author":"angel","post":"Edit: Line 8: whether it be.","date":"2014-07-01","mins":"3:03 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"}]
