[{"id":"comment-36252","author":"angel","post":"Yannick states in Quote 38 “1 the fact that these stains are dry. 2 the fact that they were made of exudates of blood clots instead of whole blood. 3 the historical fact that the Shroud has almost always been kept in some kinds of containers, which prevent the stains to be exposed to open air and sunlight, which could have seriously degraded the bilirubin over time.” ****Angel says: Yannick, wouldn’t the color of the blood be determined by the oxidation state of Iron in the hemoglobin molecule? In Iron’s reduced state (deoxygenated, Ferrous, Fe^2+) blood is dark red in color; however, in the oxygenated state, Ferric, Fe^3+) blood is bright red. Therefore, oxygenated blood would be bright red only because it has been kinetically oxidized by oxygen in the AIR. In a sealed glass container, free of oxygen, where the shroud was held, the blood would appear as a dark red or brownish color. So, if one were to look at the Shroud, where it is displayed under a vacuum seal, within a glass container, the blood stains would appear to the observer as dark red or brown, but when the Shroud is removed from this glass casing, and exposed to air, the blood would appear bright red in color. The color of the blood is dependent on oxidation state of Iron. With ultraviolet blood irradiation, known as photoluminescence, there is an increase in oxygenation of the blood, and therefore the iron in hemoglobin would be in the oxygenated state (Fe^3+) and would appear as bright red in color. Just my opinion though. Best,.","date":"2013-06-06","mins":"1:42 am","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36492","author":"angel","post":"Understood and thank you, jesterof, for a fine explanation. I found this older article (discourse) on the color of the Shroud blood. Here is an excerpt: “Don’t you think the blood on the Shroud seems too red to be so old?” ‘When a person is cruelly tortured, the blood undergoes a terrible haemolysis, when the haemaglobin literally ‘breaks up’. In thirty seconds, the reaction reaches the liver, which doesn’t have time to deal with it, and discharges a volume of bilirubin into the veins. Alan Adler has discovered a very high quantity of this substance in the blood on the Shroud. It is this substance that, when mixed with methemoglobin of a certain type, produces that vivid red colour. The colour of the blood belonging to the ‘Man of the Shroud’ is chemical proof that, before dying, he suffered terrible torture.’ http://www.british israel.ca/shroud.htm ***Therefore, bilirubin mixed with methemoglobin is responsible for the bright red color of the Shroud blood, otherwise the blood would have oxidized. Is this correct? Best,.","date":"2013-06-08","mins":"9:35 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37027","author":"angel","post":"I just saw a paragraph attached to an article on Kleinfelter (Kleinfelter’s) where it was stated it would be interesting to test Lincoln for Kleinfelter’s, since he was tall and lanky. I also saw another link on Marfan’s, associated with Lincoln, but that wasn’t mentioned in the initial paragraph inclusion on the article I was reading. It’s Down syndrome, but is it Kleinfelter or Kleinfelter’s. I’ve seen it spelled both ways. Which of the two is correct? Best,.","date":"2013-06-14","mins":"9:04 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37028","author":"angel","post":"Kelly, a Geneticist who attends Ron’s church gave this analysis on the chromosome count Ron presented. A Scientist Analyzes Mr. Wyatt’s Chromosome Theory Dr. Eugene Dunkley, Geneticist August 1999, England http://www.arkdiscovery.com/chromosomes.htm Best,.","date":"2013-06-14","mins":"9:08 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37030","author":"angel","post":"Jesterof, I don’t care if Abe Lincoln has Kleinfelter/Kleinfelter’s or Down Syndrome. That was a remark by someone at the bottom of an article I was reading and it was in reference to Abe being tall and lanky. Males with Marfan’s syndrome are also tall and lanky and the connective tissue is weakened, which causes other problems. From what I’ve read there is a defect, with reference to the production of the protein fibrillin. Lincoln could not have had Marfan’s syndrome because his hands were not long and thin and he couldn’t have had Kleinfelter’s, because he didn’t have enlarged breasts. Now, Jesus was tall. Jesus’ arms and legs were longer than normal and His hands were long and thin. As well,Jesus had a long, narrow face, like Senator John Kerry and He had breasts, as is clearly seen on the Shroud frontal image. Therefore, excluding the chromosome count, Jesus’ symptons align more with Kleinfelter’s than Marfan’s. Best,.","date":"2013-06-14","mins":"9:36 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37034","author":"angel","post":"Yes, that was the Shroud study. DNA aside, Jesus had the symptoms associated with Kleinfelter’s. Long hands and thin fingers are associated with both Kleinfelter’s and Marfan’s, but enlarged breasts in the male is associated with Kleinfelter’s, and that defines the shroud Jesus. Did you look at the enlarged Shroud frontal image? Did you notice the male breasts? As well, there is a high risk for breast cancer in males with Kleinfelter’s, so these men must also have inherited the mutant BRCA1 or BRCA2 gene. Best,.","date":"2013-06-14","mins":"9:49 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36562","author":"angel","post":"Hi jesterof, With respect to methemoglobin, the excerpt below details Alan Alder’s analysis, not mine. Discourse excerpt: “Don’t you think the blood on the Shroud seems too red to be so old? “When a person is cruelly tortured, the blood undergoes a terrible haemolysis, when the haemaglobin literally ‘breaks up’. In thirty seconds, the reaction reaches the liver, which doesn’t have time to deal with it, and discharges a volume of bilirubin into the veins. Alan Adler has discovered a very high quantity of this substance in the blood on the Shroud. It is this substance that, when mixed with methemoglobin of a certain type, produces that vivid red colour. The colour of the blood belonging to the ‘Man of the Shroud’ is chemical proof that, before dying, he suffered terrible torture.” http://www.british israel.ca/shroud.htm See the other links below, as well. ***Hemolytic anemia is the result of severe blood loss due to trauma. Excerpt: “Excessive Destruction of Red Blood Cells (hemolytic anemia): Anemia may also develop related to hemolysis due to trauma, chemical agents or medications (toxic hemolytic anemia), infectious disease, isoimmune hemolytic reactions, autoimmune disorders, and the paroxysmal hemoglobinurias.” http://medical dictionary.thefreedictionary.com/hemorrhagic+anemia Excerpt: “Chronic hemolysis leads to an increased excretion of bilirubin into the biliary tract, http://en.wikipedia.org/wiki/Hemolytic anemia Best,.","date":"2013-06-09","mins":"3:58 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36588","author":"angel","post":"Jesterof, isn’t Methemaglobin a product of severe liver damage? I’ve seen methemoglobin also referenced with regard to nitrates and nitrites, found in soil and contaminated drinking water (well water). The bacteria in contaminated well water convert nitrates to nitrites. Doesn’t nitrite exposure cause liver damage? Perhaps there is a correlation. Jesus may have been subjected to contaminated soil or water. Methemoglobin is also mentioned on Dr. Ed. Uthman’s site, but he doesn’t expand on the subject. Looks like he’s a pathologist and a practicing physician. Excert from his site: “Look for erythrocyte detritus We have previously discussed the fate of destroyed red cells and their component catabolites, such as free hemoglobin, methemoglobin, methemalbumin, bilirubin, and urobilinogen, as well as the specific binding proteins for these catabolites, such as haptoglobin and hemopexin. Laboratory measurement of some or all of these assists in the diagnosis of hemolysis.” http://web2.airmail.net/uthman/hemolytic anemia/hemolytic anemia.html ***Ed Uthman’s homepage states you can email him with specific questions. Http://web2.airmail.net/uthman/index.html I would imagine Dr. Uthman could easily answer this question. Best,.","date":"2013-06-09","mins":"9:02 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37055","author":"angel","post":"Jesterof, I know the facial features of Down syndrome. I’ve seen enough Special Ed children during my life. Sarah Palin’s little boy has it. What I was stating is a female researcher posted the article on the web years ago. She was the person who made the claim about Down syndrome and Jesus and referenced the Down syndrome trisomy. Jesus DID NOT have the features of people with Down syndrome nor did He have it. The two replies on Down syndrome that I posted were from people in the UK and the urls I included were only to show you the article had to have been posted on the Internet or those people would not have referenced it or asked if Jesus had it. The article has since been pulled from the Internet. Since the woman mentioned a trisomy, I figured she may instead have meant the Klinefelter trisomy, because Ron had found the XXY. I don’t want to continue debating the subject. Additional blood testing would have to be performed if anything conclusive is to be presented. Best,.","date":"2013-06-15","mins":"1:23 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37046","author":"angel","post":"Then you are obviously unaware males with Kleinfelter’s syndrome have an increased risk for breast cancer: it’s actually 20 times higher than healthy men. At any rate, I do not wish to argue with you further. Take care! Best,.","date":"2013-06-14","mins":"11:00 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37049","author":"angel","post":"Kelly, you’re welcome and I will certainly search out your papers and books. Best,.","date":"2013-06-14","mins":"11:13 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37048","author":"angel","post":"Kelly, I agree with you and look forward to reading your paper. Good luck with your research. :) Best,.","date":"2013-06-14","mins":"11:09 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37057","author":"angel","post":"Kelly, I will check out Pubmed tomorrow. I did see some of your articles when I searched scientific publications with your name in quotes. Apparently your expertise is in the biomedical field. Years ago, back in the 80s. I attended two of Dr. Alan Adler’s seminars. One was at Seton Hall University in New Jersey and the other was a dinner seminar at a restaurant in downtown Manhattan. Dr. Adler made a statement, referencing his expertise in the field of Porphrin chemistry, that I’ll never forget. He said, “I am so good in my field that had the Shroud not been exposed to a flood, I could have told you if Jesus was circumcized or not.” Best,.","date":"2013-06-15","mins":"1:34 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37071","author":"angel","post":"Kelly, is this true? I don’t know what to believe anymore, but if this is true, it confirms Creation. Science Message From God Found Hidden Inside DNA Sequence Feb. 01, 2013 Excerpt: “Researchers at Harvard University announced today that they have found what appears to be a message from God written inside the human genome. The message was discovered when researchers noticed strange mathematical patterns appearing within a certain section of the genome. Stunned by its discovery, the team contacted language experts familiar with Aramaic – the language Jesus Christ spoke in daily life. Message reads. “Hello my children. This is Yahweh, the one true Lord. You have found creation’s secret. Now share it peacefully with the world.” http://dailycurrant.com/2013/02/01/message god hidden dna sequence/ Best,.","date":"2013-06-15","mins":"3:23 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37073","author":"angel","post":"PS It’s cruel hoax.","date":"2013-06-15","mins":"3:39 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37123","author":"angel","post":"Kelly, I searched on Amazon and saw one book on T cells, but its a little out of my price range. A friend of mine has an abundance of T cells and states he never gets sick. Is there any truth to the statement, “The more T cells, the less chance of sickness or the more T cells the better the immune system?” I’ll’ check your online publications later today, but my interests, with regard to the shroud, lie in the areas of shroud DNA and blood chemistry. With respect to the God message, “The Daily Currant,” I’ve found, is a satirical magazine, similar to “The Onion.” Therefore, a hoax. Best,.","date":"2013-06-15","mins":"6:32 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37133","author":"angel","post":"Louis, yes I know. It went viral on the internet and there are videos, as well. I got suspicious when I saw, “Hello, my children.” Yet, are posters able to post under the Harvard science veil? I would think Harvard could bring a law suit against that online paper. Not certain though. Maybe the site is making money on a per click basis. Pretty sad to be that desperate. Best,.","date":"2013-06-15","mins":"9:32 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36589","author":"angel","post":"Kelly, yes, but in the oxidized state, blood is dark brown and the blood on the shroud was bright red, wasn’t it? Or did the oxidized blood (brown) turn bright red ONLY on irradiation with UV light? Best,.","date":"2013-06-09","mins":"9:07 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37134","author":"angel","post":"Kelly, I am awaiting your follow up, Shroud DNA manuscript. I’ve read about 40 books on the Holocaust in the last two months, including many of the personal survivor accounts. I’m halfway through Himmler and at present, I’ve two remaining. Joking with the other labs is fun. When I was in school, taking Advanced P Chem, while also doing independent research for an Organic Chemistry professor, our jokes, with respect to solving the Schrodinger equation triple integral, ( dr d\\theta d\\phi), were similar to “Enough is enough, dpizza, dpie.” In short, time for dinner. :) Best,.","date":"2013-06-15","mins":"9:54 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37168","author":"angel","post":"Kelly, I’ve read most of your article (Blood/DNA) and it was thorough, well researched, and an excellent source of information. I’ve still to read the remainder of the article on “Cloning.” A question that comes to mind, from what I’ve read; thusfar, is you’ve stated the blood of Jesus is AB, but it hasn’t been determined if it was/is AB+ or AB. When I attended Dr. Alan Adler’s seminar, he specifically stated the blood was AB. The reason I remember that Jesus’ blood was negative is because my mother had AB+, and when Adler stated, AB , I immediately thought it was opposite to my mother’s blood, and that’s how I remembered the blood type of Jesus all these years. Adler stated it was AB negative. In conclusion, I would ask, when, since Adler’s seminar back in the mid 80s, was it determined the blood on the shroud was not AB ? Just wondering! Best,.","date":"2013-06-16","mins":"5:07 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37169","author":"angel","post":"Kelly, I forgot to add this to my reply. Was a Radioimmunoassay performed on the Shroud blood to determine if there was kidney or liver damage? When I was an undergrad, studying Radioimmunoassy in our Analytical Chemistry class, the entire class had to give a urine sample and each student was required to write a report on the instrumentation as well as the result of his or her individual urine test. A peak for albumin or perhaps it was the amplitude of the albumin peak, if I recall, indicated kidney disease. Best,.","date":"2013-06-16","mins":"5:15 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37179","author":"angel","post":"Thank you for the reply Kelly. I’ve just finished reading the remainder of your article and I have two questions. Why is it not possible to test the Shroud blood for the S antigen? Wouldn’t this determine the Shroud blood was, in fact, human blood? Siemens offers a test for the S antigen. Http://healthcare.siemens.com/news and events/news/healthcare news 2012 08 29 1 I’ve read D’Adamo’s papers on ABO blood and initially he stated AB blood was first introduced in 700 AD. I often wonder if knowing the Sudarium of Oviedo had C 14 dated to 700 AD and was found to contain AB blood type, if this was the reason D’Adamo stated the oldest AB blood was found to be 700 AD. As well, I’ve seen type “A” blood was found in ancient Egyptian mummies, and why Egyptians state, this find proves they are/were Caucasian, but have not seen type AB found in Egyptians. Is there a paper that details which Egyptian mummy had type AB blood? Lastly, if the Shroud is found to date from the first century, then Jesus was responsible for introducing type AB blood, unless AB was found in one of the Egyptian mummies. Otzi the iceman had type “O” blood. Yes, I’m honored to have met Dr. Adler. His seminars were wonderful and he was a comic, as well. Best,.","date":"2013-06-16","mins":"8:19 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37226","author":"angel","post":"“are the only place on earth” – typo: “are the only places on earth.”.","date":"2013-06-17","mins":"3:57 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37225","author":"angel","post":"Kelly, Thanks, Kelly. I missed the Ballone (MNS) line. When I returned to the internet to finish reading the article, I picked up at King Tut, missing the Ballone line (MNS). Ron Wyatt stated the blood he found beneath the cross hole, possibly the same blood as that of the shroud, was dried and black in color. This would have been aged, oxidized blood. He mentioned it was tested in a lab in Israel, but did not state the name of the lab.. All Ron’s US chemical testings, specifically analyzing for sulfur in the sulfur balls that God rained down on Sodom and Gomorrah, were done by Galbraith Laboratories in Knoxville, TN. Galbraith is a very reputable lab for Carbon, Hydrogen and Nitrogen (CHN) analysis. Most major pharmaceutical companies use Galbraith Labs. The sulfur tested by Galbraith gave a result of 96% pure monoclinic sulfur. The 5 cities of Sodom and Gomorrah are the only place on earth where one is able to find this pure form of sulfur. When atheists question the existence of God, the sulfur found and analyzed from the five Sodom and Gomorrah cities is direct proof God, in fact, that does exist. Http://www.arkdiscovery.com/sodom & gomorrah.htm I’m hoping direct proof the Shroud dates to the first century will soon be found. Best,.","date":"2013-06-17","mins":"3:55 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36648","author":"angel","post":"Jesterof, Thank you. Do you know if the increased levels of bilirubin in the Shroud blood weredefined as conjugated bilirubin or unconjugated bilirubin? And if Dr. Adler found high levels of bilirubin, wouldn’t there be jaundice and wouldn’t the liver be responsible for the jaundice?.","date":"2013-06-10","mins":"4:30 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37037","author":"angel","post":"Jesterof, the catabolite reference was made by Dr. Ed Uthman, not me. Thank you for including the information on rhabdomyolysis. Best,.","date":"2013-06-14","mins":"9:59 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36655","author":"angel","post":"Understood! jesterof, I would imagine a significant amount of Nitric Oxide was released into the bloodstream to counteract the effect of Jesus’ massive blood loss. As well, Nitric Oxide is known to be released with any type of physical exertion, as would have been the case with Jesus carrying the crossbeam. Inhaled Nitric Oxide reacts with hemoglobin to form Methemaglobin, but if severe stress or physical exertion causes an elevation in Nitric Oxide in the body, wouldn’t such an excess also react with hemoglobin to form methemoglobin? What are your thoughts? Best,.","date":"2013-06-10","mins":"5:52 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36660","author":"angel","post":"Yeah, isn’t hyaluronic acid found in those who have osteoarthritis in the knee? Not certain though. Best,.","date":"2013-06-10","mins":"7:11 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36326","author":"angel","post":"Dr. Alan Adler is deceased; therefore, it would be wiser to direct your questions on blood and hemoglobin to Professor Albert Zink, who has found the oldest blood in Otzi the Iceman, (5300 year old mummy) to be *real* blood. Zink used a new procedure to verify Otzi’s blood and perhaps this test or something similar could be performed on the Shroud of Turin blood. Here is an excerpt from the link below: “Feeling for blood Zink and his colleagues took tissue samples from Ötzi’s arrow wound and from an earlier wound on the mummy’s hand. Using a light microscope, they identified round objects that looked a bit like red blood cells, Zink said. But to be sure, the researchers needed more advanced technology. They turned to a device called an atomic force microscope, which works by “feeling” rather than “seeing” an object. The minuscule probe, itself invisible to the naked eye, runs over the object like a needle on a record player. As the probe bumps up and down along the object’s contours, a laser measures the movement. The result is a three dimensional “tracing” of the object. In the case of the mysterious Ötzi contents, an exciting picture emerged: The roundish shapes were indeed red blood cells.” Read more: http://www.foxnews.com/scitech/2012/05/02/iceman mummy holds world oldest blood cells/#ixzz2 V Tszq6 WH Found this information on Professor Albert Zink Prof. Albert Zink Tel: +39 0471 055 561 Fax: +39 0471 055 579 e Mail Main fields of activity – biological and biomolecular anthropology – nanotechnologies – paleopathology – paleoepidemiology – forensic studies http://www.eurac.edu/staff/azink/default.html Best,.","date":"2013-06-06","mins":"7:28 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36651","author":"angel","post":"Jesterof, See hemolysis and high unconjugated bilirubin https://ahdc.vet.cornell.edu/clinpath/modules/chem/tbili.htm Best,.","date":"2013-06-10","mins":"5:09 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36663","author":"angel","post":"Jesterof, With respect to the bright red color of the Shroud blood, under uv light, it should be noted, porphrin is a tetrapyrrole, just like chlorophyll, and in its oxidized state, it is red and it flouresces. When it is placed under long wave UV light (UV A), it appears as an intense red color. Best,.","date":"2013-06-10","mins":"9:05 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36658","author":"angel","post":"Jesterof, you’re the expert! I am referencing Methemaglobinemia. Jesus may have been exposed to nitrites or nitrates found in either contaminated soil or drinking water. Under these circumstances, iron in the hemoglobin molecule is alterted (Fe^+2, ferrous to Fe^+3, ferric). This is an oxidation process where the color of blood is changed from red to brown. Methemaglobin and hemolytic anemia (acute) would result from exposure to nitrates and nitrites, right? And don’t Nitrates irritate the liver? When the liver is irritated, isn’t there an increase in bilirubin? Didn’t Dr. Adler find an increase in bilirubin? Nitrates and Nitrites http://www.atsdr.cdc.gov/toxfaqs/tfacts204.pdf Best,.","date":"2013-06-10","mins":"7:06 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36743","author":"angel","post":"Look at the scientific evidence and you will deduce the brutal beating and the enormous loss of blood. As well, remember Jesus was being brutalized by TWO Roman soldiers, each with a flagrum. See the link http://www.frtommylane.com/homilies/holy week/shroud of turin.htm Here is my post, “significant amount of Nitric Oxide,” and “Jesus’ massive blood loss.” You have conflated the two statements I made to “and where would that MASSIVE nitric oxide come from? I never stated massive Nitric Oxide, but rather massive blood loss. Best,.","date":"2013-06-11","mins":"8:19 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36740","author":"angel","post":"Jesterof, While I respect you and agree with a majority of what you’ve stated, all possibilities must be considered, including nitrites, nitrates and nitric oxide, if specific scientific problems related to the Shroud are to be solved. Remember, as well, all things were not recorded in the Gospels. Certainly the Gospels did not mention Jesus had a sex chromosome trisomy (XXY), nor did the Gospels mention, in regard to maternal DNA (mt DNA), Jesus had a mutant genetic marker at 150 T. What specific genetic disease is associated with that marker? While it is probable Methemaglobin was the result of trauma and stress, we are not certain Jesus was deficient in producing the diaphorase enzyme, nor if Jesus had an abnormal hemoglobin variant (Hemoglobin M). Methhemoglobinemia would be the result of either of those mentioned abnormalities. Since, Leoncio A. Garza Valdes was only able to obtain fragmented DNA, there are many things NOT listed in the Gospels that may, in fact, define Jesus. Best,.","date":"2013-06-11","mins":"7:53 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36750","author":"angel","post":"Jesterof says: “Why do you think He had a massive blood loos? from where? at the most He lost not more than half a liter of blood, which is not severe blood loss, though it would be a contributing factor to dehydration and shock. ***Angel says: “jesterof, in regard to the scourging, Jesus received 60 lashes (120 wound marks) that are detailed on the Shroud of Turin. Below is an excerpt from Doug Leatherman, MD, on Jesus’ massive blood loss: “There is much disagreement among the authorities as to the scourging. This was a Roman, not a Jewish, custom. The hands were tied high to a tree or post. A whip was made of a short wood handle and heavy leather straps bearing usually the sharp bones of sheep knuckles or lead balls on the ends. The Jews forbade more than forty lashes (thirty nine was the maximum allowed), but the Romans did not have this limit. The scourging was usually carried out by a Roman soldier. The whip was brought down upon the bare back, cutting the skin first; then as the beating progressed, the muscles were laid bare, bruised and bleeding with marked loss of blood. In a significant number of instances this was enough to kill a man. Ribs were broken, nerves exposed. Again and again, down came the whip until either death or unconsciousness occurred. Both venous and arterial bleeding occurred. Large deep, dark, bruised surfaces began to appear. Finally the skin of the back is hanging in long shreds. The whole area is an unrecognizable mass of torn, bleeding tissue.” http://www.churches of christ.net/tracts/job004u.htm Here is an image of the flagrum that was used on Jesus’ scourging. Note the metal balls attached to the leather whip. Http://www.indyprops.com/pp flagrum.htm Therefore, a massive blood loss from 60 lashes would be an understatement. As well, Jesus’ scourging was thoroughly detailed in Mel Gibson’s movie, “The Passion of the Christ.” Best,.","date":"2013-06-12","mins":"12:03 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36751","author":"angel","post":"Jesterof, I’m elated you agree with me on something. :) Best,.","date":"2013-06-12","mins":"12:11 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36810","author":"angel","post":"Jesterof, When you state Jesus lost, at most, one liter of blood, you are assuming only external bleeding, as seen with the naked eye, and failing to recognize blood loss from internal bleeding. I would conclude Jesus lost, at least, half his blood supply. Excerpt: “What is internal bleeding? While the general public understands that internal bleeding means bleeding that can’t be seen on the outside of the body, medical personnel tend to use terms that describe precisely where inside the body the bleeding is found. The internal bleeding may occur within tissues, organs, or in cavities of the body including the head, chest, and abdomen. Examples of other potential sites of bleeding include the eye, lining tissues of the heart, muscles, and joints. Http://www.medicinenet.com/internal bleeding/article.htm.","date":"2013-06-12","mins":"4:19 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36809","author":"angel","post":"Hugh Farey, Then I disagree with you and jesterof. You’ve both failed to recall Jesus was also bleeding from the nose and mouth, as evidenced on the Sudarium of Oviedo (head napkin.). Comparative study: See top of page 3 http://www.shroud.com/heraseng.pdf Best,.","date":"2013-06-12","mins":"3:53 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36396","author":"angel","post":"I found the link, downloaded the PDF file and then got the message, “The file is damaged and could not be repaired.” With that in mind, I was unable to read it, but thank you. Best,.","date":"2013-06-07","mins":"4:21 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37038","author":"angel","post":"Seriously, I would be extremely interested in reading a paper, journal article or a book authored by Kelly Kearse. Best,.","date":"2013-06-14","mins":"10:07 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36392","author":"angel","post":"David Mo, Yes, I understand what you have stated concerning the difference in the colors of the blood of Otzi and the Shroud. The dark brown color seen with blood; however, is due only to the oxidation state of iron in the hemoglobin molecule. When iron is deoxygenated, Iron (II) the blood appears as a dark red color. When blood hemoglobin is oxygen rich, Iron (III) the blood is then seen as bright red in color. Now, there may be a difference with aged blood, such as Otzi’s or the TS blood, or the way it was preserved over time. Perhaps, and this is only an opinion, the Shroud was kept in a sealed casket for decades, and then when it was taken out for public viewing, and exposed to air, the color became a brighter red. I don’t believe the Otzi mummy was placed in a vacuum type environment, but he was preserved in ice. Another thought came to mind. When red blood cells are placed in fresh water, they burst, so I would wonder, since the Shroud was exposed to a flood, would the red blood cells still be intact? Carbon dioxide and Carbon monoxide, as well, have an effect on blood cells. A Porphrin chemist would be able to expand on the topic. With respect to the new method, even if it isn’t scientifically accurate, Professor Zink may, at least, be able to resolve the problem of the Shroud blood being actual human blood, rather than a painter’s dye. The Shroud scientists will have to research the subject. Best,.","date":"2013-06-07","mins":"3:49 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36808","author":"angel","post":"(LOL)…or a Freudian slip. Just kidding! Best,.","date":"2013-06-12","mins":"3:45 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36811","author":"angel","post":"Internal hemhorrage. Excerpt: “Exsanguination is a relatively uncommon and dramatic cause of death in humans. Blunt force trauma to the liver, kidneys, and spleen can cause severe internal bleeding as well, though the abdominal cavity usually becomes visibly darkened as if bruised. Similarly, trauma to the lungs can cause bleeding out, though without medical attention blood can fill the lungs causing drowning, or in the pleura causing suffocation, well before exsanguination would occur. In addition, serious trauma can cause tearing of major blood vessels without external trauma indicative of the damage.” http://en.wikipedia.org/wiki/Exsanguination Internal bleeding was evident when Jesus was pierced with the sword (blood and water poured out). Excerpt: “A number of forensic pathologists have examined the descriptions (and, in some cases, information on the Shroud of Turin). They all agree that there is no way water could have come out. But, they agree that the heart is surrounded by the pericardium, which contains a watery fluid and a lance thrust would have extracted this fluid, which would look like water. The thrust would also have pierced the heart, drawing accumulated blood. Even if Jesus didn’t die of asphyxiation and even if He didn’t die of congestive heart failure and even if He didn’t die of hypovolemic shock and even if He didn’t die from the internal hemorrhaging itself, He had a large, deep, open chest wound through at least one lung and probably the heart, with internal bleeding. This would have caused internal infection and in a few days He would have died of sepsis, i.e., infection.” Best,.","date":"2013-06-12","mins":"4:47 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36812","author":"angel","post":"Link to last excerpt above. Http://herculescummings.wordpress.com/tag/how did jesus die/.","date":"2013-06-12","mins":"4:51 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36824","author":"angel","post":"Forgot to include the Sudarium, Shroud comparative study link. The massive blood loss is obvious. Http://www.shroud.com/heraseng.pdf Best,.","date":"2013-06-12","mins":"9:05 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36816","author":"angel","post":"Question: If a person has a nosebleed, as a result of trauma to the nose, he or she is able to stop the bleeding by applying pressure (pinching the two nostrils together). Correct? Assuming the above scenario, how would Jesus have been able to stop the nosebleed if his hands were nailed to the cross? Best,.","date":"2013-06-12","mins":"6:09 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36883","author":"angel","post":"Firstly jesterof, I do read the Gospels, and I am aware Jesus was pierced with the sword after death. Secondly, If one had pleurisy and at the moment of death a sword was thrust into this person’s pleural cavity, fluid (water) would immediately seep out. Here is an excerpt of “Pericardial Effusion” the link below: “Those who were flogged would often go into hypovolemic shock, a term that refers to low blood volume. In other words, the person would have lost so much blood he would go into shock. The results of this would be 1) The heart would race to pump blood that was not there. 2) The victim would collapse or faint due to low blood pressure. 3) The kidneys would shut down to preserve body fluids. 4) The person would experience extreme thirst as the body desired to replenish lost fluids. There is evidence from Scripture that Jesus experienced hypovolemic shock as a result of being flogged. As Jesus carried His own cross to Golgotha (John 19:17), He collapsed, and a man named Simon was forced to either carry the cross or help Jesus carry the cross the rest of way to the hill (Matthew 27:32–33; Mark 15:21–22; Luke 23:26). This collapse indicates Jesus had low blood pressure. Another indicator that Jesus suffered from hypovolemic shock was that He declared He was thirsty as He hung on the cross (John 19:28), indicating His body’s desire to replenish fluids. Prior to death, the sustained rapid heartbeat caused by hypovolemic shock also causes fluid to gather in the sack around the heart and around the lungs. This gathering of fluid in the membrane around the heart is called pericardial effusion, and the fluid gathering around the lungs is called pleural effusion. This explains why, after Jesus died and a Roman soldier thrust a spear through Jesus’ side (probably His right side, piercing both the lungs and the heart), blood and water came from His side just as John recorded in his Gospel (John 19:34). Http://www.gotquestions.org/blood water Jesus.html And below is an excerpt on the subject of the blood and water. “One view concerns the pericardium, the sac which surrounds the heart, and which contains a small amount of watery fluid. When the body undergoes great stress, as crucifixion would certainly entail, the amount of fluid increases and the sac expands. The Roman lance would then have passed through Jesus’ pericardium and into the right side of his heart, which is filled with blood even after death. As the lance was withdrawn, it would draw out the blood from the heart and the watery fluid from the expanded pericardium.” And there is a second view is as follows; “Anthony Sava, an American physician, has a different explanation for the water flow. He believes that the severe scourging caused internal hemorrhaging in Jesus’ chest, and the pleural cavity filled with blood. The blood settled on the bottom of the chest cavity while a clear liquid was left on top. Sava says that the Roman lance entered the chest and, upon being withdrawn, released the blood and the water from the chest.” Either of the two views gave the conclusion: The explanations for the blood and water flow are closely related at several points. All physicians who have examined the question agree that Jesus was already dead when the chest wound was inflicted. The blood and water most probably flowed from both the heart and the chest cavity. Http://www.godonthe.net/evidence/forensic.htm Best,.","date":"2013-06-13","mins":"5:26 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36899","author":"angel","post":"Jesterof, not fantasy, but reality. As I mentioned, nitrites and nitrates are found in soil and contaminated drinking water, which was common in ancient Jerusalem. Soil Properties Affecting Formation of Nitric Oxide by Chemical Reactions of Nitrite A. M. Blackmer and M. E. Cerrato Excerpt from abstract: NO = Nitric Oxide “These findings indicate that NO is formed by reactions of nitrite with the organic fraction of soils as well as by self decomposition of nitrous acid.” https://www.agronomy.org/publications/sssaj/abstracts/50/5/SS0500051215?access=0&view=pdf Contamination – soil – water Nitrate and Nitrite in Drinking Water – The National Academies Press http://www.nap.edu/openbook.php?record id=9038&page=13‎ Nitrate and Nitrite in Drinking Water To cause methemoglobinemia, nitrate must be converted to nitrite. The conversion is performed by bacteria in the mouth and .. At any rate, take care, Best :).","date":"2013-06-13","mins":"8:49 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36884","author":"angel","post":"Jesterof, your comments indicate you may also be of the opinion prisoners who are beaten with a rubber hose, do not experience internal bleeding. I disagree with your assessment, but that doesn’t mean I do not respect your opinion. Best,.","date":"2013-06-13","mins":"5:29 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36885","author":"angel","post":"Jesterof, the coagulation cascade to which you refer does not occur in persons who have esophageal varicies and the condition is life threatening, as well. I’m not stating Jesus had esophageal varices, but this is one case, a result of cirrhosis of the liver, where bleeding does not stop of its own accord. Best,.","date":"2013-06-13","mins":"5:46 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37039","author":"angel","post":"Well, jesterof, since it is your field, you would know better than I. Best,.","date":"2013-06-14","mins":"10:09 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36895","author":"angel","post":"Jesterof, I would agree with you about minimal blood loss (500 m L), if it werent for the fact Jesus bled one hour before the Sudarium was even placed on His head. The Sudarium of Oviedo is the cloth (head napkin) that was in direct contact with the head of Jesus. The Shroud was placed on Jesus AFTER the Sudarium was removed. See Page 4. ” At the bottom of the back of his head, there is a series of wounds produced in life by some sharp objects. These wounds had bled about an hour before the cloth was placed on top of them.” There is a forensic scientist on the Sudarium team. José Delfín Villalaín Blanco DM, Ph D. Professor of Forensic Medicine at the University of Valencia, Spain. Vice President of the Investigation. Spanish Centre for Sindonology (CES). Member of the Investigation Team of the Spanish Centre for Sindonology (EDICES). Jorge Manuel Rodríguez Almenar http://www.shroud.com/heraseng.pdf You state there was minimal blood, but did you include the blood found beneath the cross hole in your total? And if Jesus bled for one hour before the Sudarium of Oviedo was placed on His head, how are you including that blood loss in your total (500 m L, at most)? ***Sigh*** Take care! Best,.","date":"2013-06-13","mins":"7:56 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36888","author":"angel","post":"Catherine, it must have been awful for you. I knew a man who suffered from esophageal varicies, liver damage, and I saw several of his nosebleed episodes (gruesome) and the only way to stop the flow of blood was to get him to the Emergency Room. At the ER some type of endoscoptic treatment was performed, where something similar to a carrot stick was placed into the esophagus, putting pressure on the bulging varicose veins and bleeding stopped. The ER doctors stated this man had lost half his blood supply. Best,.","date":"2013-06-13","mins":"6:45 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36417","author":"angel","post":"Interesting! Yes, more than likely anemia (blood loss), as a result of severe stress, would also have contributed to the hemolytic episode experienced by Jesus, the man on the shroud. Best,.","date":"2013-06-08","mins":"12:38 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36886","author":"angel","post":"No, I do not consider a liter of blood to be half a man’s blood supply. Half a man’s blood supply would be approximately 3 liters. I found your inital post and you did state not more than half a liter, but I am of the opinion Jesus lost more than 500 m L, and that is because of the blood loss from the head, nose and mouth as evidenced by the comparative study of the Sudarium of Oviedo and the Shroud of Turin. The Sudarium was in direct contact with Jesus’ head and it was noted by the Sudarium scientists how much blood Jesus had lost from the head, mouth and nose. Since the Sudarium sopped up most of the blood, what blood is displayed on the Shroud is not indicative of Jesus’ total blood loss. My statement was Jesus lost approximately half his blood supply. A man’s total blood supply is anywhere from 5 to 6 liters; therefore, 2.5 to 3 liters is what I predicted. Best,.","date":"2013-06-13","mins":"6:06 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37041","author":"angel","post":"Jesterof, how much blood do you believe Jesus lost as the result of the following: 1. Initial scourging – 70 lashes as opposed to the usual 39/40 lashes? 2. Embedding the crown of thorns? (Head wounds produce much blood) 3. Intraocular bleeding (eye was completely closed).? 4. Walking through the Via Dolorosa, bleeding, while carrying the exceptionally heavy cross beam and falling to the ground two or three times, until Simon the Cyrenian was ordered to help carry the beam? 5. Bleeding from the head wounds, mouth and nose on the cross? 6. Internal hemhorraging as evidenced by the Roman sword thrust seepage of blood and water, after immediate death? Totaling all these various bleeding incidences, how much blood do you state was lost? Best,.","date":"2013-06-14","mins":"10:28 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36912","author":"angel","post":"Jesterof, I hope you’re not “MO” on another board. Are you? In my post, I stated I did not attriibute varicies to the blood loss of Jesus, but was just giving you an example of a nosebleed that does not stop of its own. Varicies are varicose veins and the bleeding would be equivalent to someone who has slashed his or her wrists (a venal bleed). Best,.","date":"2013-06-13","mins":"10:59 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37043","author":"angel","post":"Line 6 should read, Internal hemhorraging as evidenced by the Roman sword thrust into Jesus’ side resulting in the seepage of blood and water. This blood flow occurred immediately after death..","date":"2013-06-14","mins":"10:31 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36908","author":"angel","post":"Jesterof says: “As far as I remember the bits and peices of DNA were so fragmented that there was no possibility to draw ANT conclusions fro that. XXY is Kleinfelter syndrome. While there is always a possibility in someone who never had children of their own that such a male has Kleinfelter’s ( unless they are unusually short), there is no reason except the fantasy of a filmmaker to think Jesus Christ had that particular syndrome.” *** Angel says: “Yes, I know that particular trisomy (XXY) is Kleinfelter’s syndrome, an extra chromosome on the 23rd pair of sex chromosomes, 47 (XXY) Yet, males with this particular trisomy, contrary to your statement, are tall, not short, and have long arms and legs (like the Shroud Jesus) and those males with that particular trisomy may show female characteristics, due to a lack of testosterone. Look carefully at the frontal image of the shroud. Do you notice the breasts and the long arms and legs? Go to google images and get a clear frontal image and enlarge it. I have a clear picture in my book and the breasts are obvious. Now compare the breasts on the Shroud image to the male with Kleinfelter’s on this link. Http://en.wikipedia.org/wiki/Klinefelter syndrome Further, female DNA was found on the Shroud of Turin and although most don’t believe in the research of Ron Wyatt, the blood analysis performed on tblood from the crosshole also detailed an XXY trisomy, although Ron found only a haploid 24 (XXY). Scientists now believe Abe Lincoln also had Kleinfelter’s syndrome. You state my ideas are wild or crazy; yet, a picture is worth a thousand words in this case. Take care! Best,.","date":"2013-06-13","mins":"10:44 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37019","author":"angel","post":"Jesterof, you may have misunderstood my post. I did not state varicies were in the nose. Varicies line the esophagus in patients that have liver damage (cirrhosis), but when these varicose veins rupture, the patient bleeds from the nose and the mouth. I’ve had to take a man to the ER with this condition, at least, four times and believe me there was massive bleeding from the nose. Blood was not only all over the bathroom floor, but on the walls as well. It is one of the most gruesome sights, with respect to blood, a person will ever encounter. Best,.","date":"2013-06-14","mins":"7:38 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37025","author":"angel","post":"Jesterof, You are making much of nothing. My point was people with esophageal varicies hemhorrage from the nose. Whether the bleeding is similar to an arterial bleed or a venal bleed is irrelevant. Let’s just say it is a nose hemhorrage that doesn’t stop bleeding of it’s own accord. :) Best,.","date":"2013-06-14","mins":"8:56 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37024","author":"angel","post":"The blood Ron Wyatt tested was blood from the crucifixion cross hole and that blood revealed a haploid (24 chromosomes), with the XXY trisomy. Years ago, when the blood from the Shroud was tested by Leoncio Valdes, a female researcher posted an article on the web that has since been removed. She stated Jesus had Down syndrome and mentioned a trisomy. People must have written in about the article, because it was pulled from the internet. She was either from the University of Texas or Arizona and she may even have been on the Valdes team. And that article did appear on the internet as evidenced by these two post links in 2011 from people from UK – Ireland. >>>Link one: Is there truth in the “trisomy 21” of Jesus? – Yahoo! UK & Ireland … uk.answers.yahoo.com › … › Society & Culture › Religion & Spirituality Jul 27, 2011 – Trisomy 21 means that Jesus would have suffered from Down Syndrome. There is no records, at all, that document Jesus having any traits of Down … >>>Line Two: Is there truth in the “trisomy 21” of Jesus? – Yahoo! UK & Ireland … uk.answers.yahoo.com › … › Society & Culture › Religion & Spirituality Jul 28, 2011 – Well i doubt that. Assuming he was an actual person (i believe there is a high possibility he was an actual person even though i am an atheist. Therefore, since Ron found the XXY and the female who reported a trisomy, as well, my conclusion was the trisomy was Kleinfelter’s as opposed to Down, as the female researcher reported. Kleinfelter’s is on the 46 chromosome and instead of an XY there is an XXY which is noted 47 XXY Since Ron found a haploid, 23, instead of a full 46 the sex chromosome would have been on the 23 chromosome, instead of the normal chromosome 46 and the trisomy reported as 24 XXY as was reported. Therefore, one researcher stated Down syndrome and the other indicates Kleinfelter’s sydrome. If you look at Jesus’ height (very tall), the long arms and fingers, the long legs, then Kleinfelter’s more aligns with Jesus over Down syndrome and Ron got a chromosome count of 24 XXY from the blood beneath the cross hole. Ron further stated dead blood will not give a chromosome count, but he had the lab keep the blood at room temperature with gentle swirling for 48 hours and the blood came to life. Some scientists disagreed with his chromosome count and others believed. Here is the account of a Geneticist who attended the same church as Ron. Http://www.arkdiscovery.com/chromosomes.htm Best,.","date":"2013-06-14","mins":"8:49 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-88449","author":"angel","post":"I see your point, Hugh. The two step process would not produce the dorsal image on the bottom section of the cloth, unless the rays of light from the back of His body were directed vertically downward; however, as you stated, instead it would produce two images on the front of the cloth. Yet, strangely a second image was found on the back of the cloth and wouldn’t this verify a two step process, similar to your hypothesis that two images would have formed on the front of the cloth? Excerpt: “It is now discovered by two Italian scientists this same cloth now depicts the face of a man that can be seen on the reverse side of the Shroud, and it matches the front, although much fainter. It also shows in faint detail that of a nose, eyes, hair, beard, and moustache. The hands of the man in the second image on the Shroud were also noticeable, but very weak. The shoulders or back could not be produced. In 1978, when the Shroud was examined, the backside of the cloth was not accessible because at that time, it was sewn to a backing cloth.” http://www.allaboutarchaeology.org/second image on the shroud of turin faq.htm Anyway, it was just a passing thought. Best,.","date":"2014-03-13","mins":"8:06 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88792","author":"angel","post":"PS. Hugh, I failed to mention, if Jesus did turn His body 180 degrees, as I suspect, while He was levitating, as introduced by Isabel Piczek in her “Event Horizon” theory, then that would explain the missing side strip of the Shroud, since it would have torn at the seam, during the process of Jesus turning from front to back. As well, there were two missing panels that enabled Him to turn and levitate, without the pressure from the cloth (top and bottom). See paragraphs 1 and 2. Http://www.shroud.com/adler2.htm Isabel Piczek’s “Event Horizon” theory sounds plausible, but it is my belief it occurred via a 2 step process, rather than all at once. The 2 step hypothesis would account for the missing panels, the side strip, the lack of a crown image (head) and more importantly, the second image that was seen on the cloth. The “Event Horizon” theory alone does not account for the second image on the cloth. Just an idea, Hugh. Best,.","date":"2014-03-14","mins":"1:48 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88826","author":"angel","post":"“If Jesus was floating in space as according to Piczek, he wasn’t even touching the cloth, let alone ripping it neatly down the side.” Hugh, I understand your conclusion, but with respect to Piczek’s theory, Jesus’ body was touching the cloth, prior to the side seam splitting and the levitation. The constraint of the cloth, enfolding His body, would be the causal factor for Him freeing Himself by opening the top and bottom panels and the side strip. Yet, it matters not, since it was just an idea. Thanks, Hugh. Best,.","date":"2014-03-14","mins":"3:17 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88912","author":"angel","post":"Daveb, you are such a wise man. I love reading your posts. Yet, Isabel Piczek never claimed Jesus rotated or turned 180 degrees. Isabel only introduced levitation between the two upper and lower sections of the cloth. I wouldn’t want Isabel to be blamed for my wild and crazy 2 step process. Hugh made me realize the impossibility. My thought was if Jesus were constrained by the Shroud, fitting tightly around His body, and He wanted to transform from the mortal to the spiritual (celestial) body, He would break free of the cloth in some manner, perhaps raising the top half of the cloth. The two missing panels and the missing side stream would have certainly given Him the room to maneuver during the transformation. Then, after transforming completely into His spiritual bright white garment, He left the Shroud on the marble slab, inside the tomb, as an historical record of His brutal flogging and , as well, a verification for His resurrection. Thanks daveb! Best,.","date":"2014-03-14","mins":"6:47 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-86363","author":"angel","post":"Just a Thought! Is it possible the Turin Shroud image formation was produced via a two step process, similar to obtaining a sunburn at the beach? One would lie on his or her back and the front of the body would be burned and then he or she would turn over onto the stomach and the back of the body would be burned. There would be no burning on the crown of the head or the soles of the feet as the sun’s rays beam down vertically. Prior to Jesus leaving the tomb, His body may have produced the frontal image, while He was lying on His back and He may have turned just once, onto His stomach, to produce the dorsal image, before leaving the Shroud. Perhaps the image on the Shroud was accomplished with a photon release that occurs with bioluminescence. Isn’t it true Madam Flury Lemberg, after removing the backing of the cloth, found the side strip fluoresced? See Article excerpt from the link below: “Humans glow in the dark Ultra sensitive cameras reveal that our bodies emit tiny amounts of light that are too weak for the human eye to detect. Bioluminescence is a side effect of metabolic reactions within all creatures, the result of highly reactive free radicals produced through cell respiration interacting with free floating lipids and proteins. The “excited” molecules that result can react with chemicals called fluorophores to emit photons. Human bioluminescence has been suspected for years, but until now the cameras required to detect such dim light sources took over an hour to capture a single image and so were unable to measure the constantly fluctuating light from living creatures.” http://www.theguardian.com/science/blog/2009/jul/17/human bioluminescence.","date":"2014-03-08","mins":"9:04 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88921","author":"angel","post":"Yannick, maybe Fanti was so disillusioned by the erroneous C 14 dating of the Shroud that his research goal was to find something so unique and so incredibly difficult to produce that the non believers would eventually stop trumpeting, “The C 14 dating proves the Shroud is a fake” or “The image, according to Mc Crone, is the result of tempera paint containing red ochre and vermilion.”.","date":"2014-03-14","mins":"7:14 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-15961","author":"angel","post":"Confusing: I attended two seminars given by Dr. Adler, the Porphrin Chemist (now deceased), who performed the initial blood work on the Shroud of Turin. These seminars were given at Seton Hall University, in New Jersey and a restaurant in downtown Manhattan, after the release of Ian Wilson’s book, “The Shroud of Turin.” The year may have been either 1978 or 1979. Dr. Adler stated, at that time. The blood on the Shroud was real blood and the blood type was AB negative. I specifically remember the AB negative blood type, because my mother’s blood type was AB positive. What year was it decided the blood type on the Shroud was not AB negative?.","date":"2012-09-06","mins":"8:44 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-87509","author":"angel","post":"Thank you for answering my post. No, Hugh, I wasn’t suggesting the Shroud moved with the body. Instead, in this 2 step process, Jesus was placed on His back inside the tomb, after crucifixion and enfolded in the Shroud. So, the process to which I refer would be tantamount to going to the beach and lying on a beach towel. After receiving a sunburn on the front of the body, the person would turn and the back of the body would then be burned. The beach towel, equivalent to the Shroud, in this case, would remain stationary. Yes, the CCD camera took 20 minutes to produce an image, but Jesus was in the tomb for 3 days. As well, the photons released in bioluminescence may be the reason why, when the backing of the cloth was removed by Mechthild Flury Lemberg, the side strip fluoresced. Since the linen side strip was added at a later date, the half life may have been longer than the older linen of the Shroud. If Jesus was able to rise, place the folded Shroud and head napkin onto the marble slab, don His celestial/spiritual garment of bright white, prior to leaving the tomb, then He certainly would have been able to turn His body from back to front, just once. And doesn’t laying the Shroud and the folded Sudarium on a marble slab, and exiting the tomb, also defy science? :) Just a different slant, Hugh. I appreciate your input. Best,.","date":"2014-03-11","mins":"8:34 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-16074","author":"angel","post":"Kelly Kearse: Yes, you are correct! The Dr. Adler seminars were given very early on, either late 1978 or early 1979. I remember attending both seminars not too long after the release of Ian Wilson’s book, “The Shroud of Turin,” Adler did say it was real blood at his seminars, as well. He went on to state that he was so good in his field (Porphrin Chemistry) that had the shroud not been exposed to a flood, he could have told us whether Jesus was circumcized or not. The flood damage must have covered that private area of the image I also seem to recall reading sometime later on the web, but do not know if this is correct, that if the blood sample was taken from one side of the cloth, the blood type was AB negative, but if the sample was taken from the reverse side of the cloth, the blood type was AB positive. Obviously, this cannot be true. Yet, I’m elated to receive your detailed information. Thank you..","date":"2012-09-09","mins":"8:59 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-88822","author":"angel","post":"Kelly, congratulations on an extremely interesting paper, but it may be challenging for you in the future, if your studies find Jesus’ mitochondrial DNA (mt DNA) places Him in the Katrine haplogroup (European origins). Enjoy the research! Best,.","date":"2014-03-14","mins":"3:00 pm","url":"https://shroudstory.com/2014/01/21/paper-chase-dna-analysis-and-the-shroud-of-turin-development-of-a-shroud-codis/","cat":"blood_studies","title":"Paper Chase:  DNA Analysis and the Shroud of Turin: Development of a Shroud CODIS"},{"id":"comment-16075","author":"angel","post":"Actually, I calculated back and Ian Wilson’s book was released in 1978 or 1979 and the conferences I attended given by Dr. Alan Adler were about 1985 and he was associated with STURP..","date":"2012-09-09","mins":"9:24 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"}]
