[{"id":"comment-197123","author":"angel","post":"Colin says: “…apart from an appreciative word for Paolo and his laser beams.” ***Angel says: Laser irradiation! Ha, Ha, Ha! You’re good Colin. I’ve noticed in many of your posts, you certainly make use of all the poet’s tools, including philosophical (religious), Horatian and Juvenalian satire. Referencing your effort, obviously, only the top fibrils of the linen were scorched (colored), since you repeated the process on the back of the cloth? Correct? If that be the case, good job. :) Best, PS Typo: You might want to correct “funigate to “fumigate” on your blog page..","date":"2015-04-21","mins":"11:48 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197590","author":"angel","post":"Hi Louis, And that is about the time I saw the Shroud was contaminated with thymol or maybe it was even stated by someone on this site. Supposedly, worms were found and thymol was used to disinfect the Shroud’s reliquary. I would love to see the chemical procedure for either neutralizing or eliminating the thymol contamination from the linen. Best,.","date":"2015-04-25","mins":"7:47 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-126191","author":"angel","post":"Yannick, you are correct! In fact, most of the atheist scientists, who oppose the Shroud image being that of Jesus, are of the belief the real man on the Shroud was the tortured Jacques de Molay. On another forum, one scientist stated, “After his torture he was wrapped in a linen cloth that was used in Templar inner initiation rituals.” And the other scientists on that thread, also agreed the image was the tortured Jacques de Molay. Best,.","date":"2014-06-01","mins":"10:25 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-197573","author":"angel","post":"Hi Hugh, If contamination by Thymol is ruled out, why not just cut a piece of the Shroud the size of a postage stamp from an uncontaminated area and throrougly clean this sample? Then perform the non destructive tests (microscopy, spectroscopy, etc.) prior to C 14 dating the cloth. Then a textile expert could perform a re weave on the space left in the cloth where the sample was removed. Seems easy enough. :) Best,.","date":"2015-04-25","mins":"4:47 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-197581","author":"angel","post":"If only a thread is required for dating the cloth, what is the hold up? I don’t believe this to be the case or the Shroud would already have been re tested. It’s been close to three decades since the initial results. My thoughts are either Thymol contamination ruined any chance for further testing or a second sample was, in fact, secretly re tested and another erroneous date resulted. In the latter case, since the dating was performed in secret, the church would be reluctant to submit the cloth publicly to scientists for a second C 14 dating (knowing the outcome), but instead would trumpet the importance of faith over authenticity. Seems perfectly logical :) Best,..","date":"2015-04-25","mins":"6:31 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-197589","author":"angel","post":"Hi John, Yes, Rogers did proclaim the Maillard reaction was doubtful; yet, the image formation is (more than ikely) as Di Lazzaro postulates, some type of radiation that is unknown to science that produces a supernatural flash of light. Best,.","date":"2015-04-25","mins":"7:33 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-197600","author":"angel","post":"No problem, John. I do it all the time. Usually, I want to spell it Mallard, instead of Maillard. At least you didn’t write “profit: instead of “prophet.” :) Best,.","date":"2015-04-25","mins":"9:09 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-197352","author":"angel","post":"Louis, was the Shroud sufficiently cleaned of Thymol contamination? If not, there would only be a repeat of an erroneous C 14 date. Post from Larry Schauf, on this site, dated April 30, 2012 at 1:19 pm “Ray Rogers (Senior STURP Chemist) was ADAMENT that the Shroud could never be cleaned sufficiently of the Thymol (natural carbon) it was stored in to carbon date it accurately. Therefore, ONLY if all scientists agree and prove that it’s clean of the thymol should it ever be carbon dated again.” Best, PS I deleted one “accurately” from Larry’s post. He used the word twice..","date":"2015-04-23","mins":"5:47 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-15458","author":"angel","post":"Guess you never saw the article, “The Great Holy Shroud Dating Fraud of 1988, by D. J. Mc Donnell http://www.ewtn.com/library/ISSUES/STURP.TXT A new Italian documentary titled “La Notte de la Sindone” or “Night of the Shroud,” was shown at the Shroud Conference in Spain recently and will be out on DVD sometime in September 2012, https://shroudstory.com/2012/05/04/the night of the shroud premiered in spain by rai in valencia/ Best, Angel.","date":"2012-08-24","mins":"9:54 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-1214","author":"angel","post":"Uncle duke is all over the place. He needs to go back and read the bible. ALL THE PROPHECIES WERE FULFILLED. GOD DOES NOT MAKE MISTAKES. IF HE WANTED US TO KNOW WHAT JESUS LOOKED LIKE THEN WE WOULD KNOW. OH, AND SCIENCE IS WRONG WE DIDN’T COME FROM APES. READ GENESIS, WHERE GOD SAID LET US MAKE MAN IN OUR OWN IMAGE, HE WAS TALKING TO JESUS, NOT ADAM, BECAUSE ADAM WASN’T CREATED AS YET. SCIENCE WILL NEVER ERADICATE GOD, HE IS THE CREATOR. BAD THINGS HAPPENS IN OUR LIVES BECAUSE OF OUR OWN MISTAKES WE WERE BORN WITH FREEWILL, BLAME ADAM. THIS IS WHY GOD HAD TO SEND JESUS SO WE DON’T HAVE TO LIVE WITH SIN, NO MATTER WHAT WE HAVE DONE. WE WILL BE FORGIVEN IF WE ASK GOD GOD BLESS YOU.","date":"2010-04-01","mins":"12:50 am","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","title":"New Shroud Documentary To Air On Discovery Channel In December"},{"id":"comment-126196","author":"angel","post":"What about this new study on the Shroud published in Injury Magazine and featured in the Vatican Insider, La Stampa? Perhaps the Vatican is allowing new testing to be performed. 05/ 7/2014 New study shows Man of the Shroud had “dislocated” arms http://vaticaninsider.lastampa.it/en/world news/detail/articolo/sindone shroud sudario 33948/.","date":"2014-06-01","mins":"11:12 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","title":"The Collapse of the Fraud Theory"},{"id":"comment-126393","author":"angel","post":"Daveb, I’m sorry your father had to experience such excruciating pain, especially in his golden years, prior to Winter’s call. With reference to the “Vatican Insider” article, if the question of dislocated arms has been discussed for decades, why was it even referenced in the title? The double nailing of both Jesus’ hands and feet to the cross certainly validate a major mistake was made by the Romans or perhaps the grisly act was deliberate, Best,.","date":"2014-06-02","mins":"11:38 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","title":"The Collapse of the Fraud Theory"},{"id":"comment-15509","author":"angel","post":"Http://jrsm.rsmjournals.com/content/99/4/178.full THE DEFECTS OF PEER REVIEW “So we have little evidence on the effectiveness of peer review, but we have considerable evidence on its defects. In addition to being poor at detecting gross defects and almost useless for detecting fraud it is slow, expensive, profligate of academic time, highly subjective, something of a lottery, prone to bias, and easily abused.”.","date":"2012-08-27","mins":"4:38 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15673","author":"angel","post":"What you state was true years ago, when honesty prevailed. Unfortunately, now with rampant corruption on a global scale, you might want to take a peer reviewed article with a grain of salt. The Pharmaceutical industry is an example. Quote from article (link below). Http://articles.mercola.com/sites/articles/archive/2010/05/18/how corrupted drug companies deceive and manipulate your doctor.aspx Bias #1: Unwanted Results are Not Published “But drug companies publish only a fraction of the studies they fund — the ones that promote their drugs. If a study does not have findings that are favorable to its product, it is unlikely it will ever make it into a journal for publication.” In contrast, studies that have favorable findings almost always make the cut. Further, even the Better Business Bureau was accused of taking money (selling its grades). Wolfgang Puck, Celebrity Cheft was given an “F” rating, because he refused to pay the BBB, as was the Ritz Carlton http://abcnews.go.com/WNT/video/better business bureau sell grades bribe corrupt brian ross 12136209 Now that we know corruption exists in this cross section of our global society, why would the dating of the Shroud be an exception? Money, the root of all evil, unfortunately still talks. The question remains, was money exchanged for an unfavorable Shroud date?.","date":"2012-08-31","mins":"9:05 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"}]
