[{"id":"comment-206218","author":"angel","post":"Daveb of wellington nz says: ” Normal matter cannot pass through walls; Nor can normal matter spontaneously “appear” and “disappear”; nor can it normally levitate itself into the clouds as the apostles saw at the Ascension. Therefore the matter that comprised Christ’s resurrected body must be some kind of matter, as yet unknown to us. That can be the only logical conclusion!” ***Angel says: Or, known to us, as the transition metal Cooper pairs (superconductors). I mentioned the transition metal Cooper pairs to Colin Berry a while back, referencing levitation, but he refused to believe. Since that time physics has found the transition metal superconductors to perform exactly as I stated to Colin. The superconductors levitate, lose weight, etc. Levitation and Magnetism associated with superconductors Superconsuperconductors.htmlductors http://www.explainthatstuff.com/ As well, the combination of 5 quarks would be referred to as an “octaquark,” rather than an “octoquark.” See the following: Thermodynamics with density and temperature dependent … by XJ Wen – ‎2005 – ‎Cited by 49 – ‎Related articles Jun 6, 2005 – … with an anti strange quark, such as the pentaquark (u^2d^2\\bar{s}) for baryon nmber 1 and the octaquark (u^4d^3\\bar{s}) for dibaryon etc. Http://arxiv.org/abs/hep ph/0506050 With that in mind Jesus may have levitated at the resurrection with the aid of a metal superconductor. I love your in depth and thorough thought processes :) My younger sister just died of pancreatic cancer. Best,.","date":"2015-07-20","mins":"12:55 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-206223","author":"angel","post":"P.S. There is also a relationship between Magnetic Resonance Imaging (M Ri) and superconductors. Perhaps this is how the Shroud image was formed. Uses for Superconductors http://www.superconductors.org/uses.htm Just a thought! Best,.","date":"2015-07-20","mins":"2:16 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-150602","author":"angel","post":"Pierro, may be referencing the following: “Analysis of m state elements has disclosed that their physical weight can be decreased to a negative value at specific high temperatures. Incredible as it seems, these elements actually levitate! What’s more, they can also be coaxed into becoming superconductive…” These transition elements are explained in Z P Tech Science http://zptech.net/science.html ORMUS or “M State” ” The electrons in monatomic minerals exist in what is called a “high spin state.” http://www.americanbluegreen.com/ormus.html See also What Are Natural Monatomic Minerals https://www.experts123.com/q/what are monatomic minerals.html Perhaps monoatomic gold made it possible for Jesus to levitate out of the shroud. :) Best,.","date":"2014-09-12","mins":"11:46 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-206295","author":"angel","post":"Dear Dave, Thank you for your condolences regarding my younger sister’s death and you’re welcome. I do love reading your posts! Yes, I completely comprehend Fibonnaci numbers, as this topic was included in one of my undergrad chemistry courses. After the Higgs Boson (God particle) was isolated by CERN, I began researching Cooper pairs, Bose Einstein Condensates (BE Cs) and the Meisner effect, Specifically, referencing Cooper pairs or BE Cs, I believe metal superconductors, in the solid state, can lose weight and can emit light in the form of waves (like laser beams).. There is a link below that has scientifically confirmed both forms of light (particle and wave). Perhaps this antigravimetric process (Cooper pairs/superconductor) was utilized by Jesus at the resurrection, during levitation, which would be in agreement with Isabel Piczek’s Event Horizon theory, I wonder if iron was in the tomb? As well, the same would have been responsible for the fast pulsed laser light that may have produced the image on the Shroud, as theorized by Fanti. The garment composing Jesus’ spiritual body would, more than likely, have been composed of bright white light, as seen by Mary Magdalene when she viewed Him as the gardener, on the side of the road near the garden tomb. If superconductors are antigravity, then that would explain Jesus entering through the walls when He visited the disciples after His death. There are a few scientists working on superconductors, warp drives, induced gravity propulsion and antigravity space craft, etc., that may be utilized for space travel in the not too distant future. Some, like Dr. Boylan state, the Lockheed X 22a (two man discoid with onboard laser weaponry) is an antigravity craft, but it is a secret military project, and who knows if it is true. The photo of the Lockheed X 22a on google images is impressive though. I’m not a physicist, but perhaps Isabel Piczek could shed some light on the subject of superconductors, with respect to transition metals (those that fill d orbitals). Referencing light or antigravity propulsion using superconductors, see the links. First Ever Photograph of light behaving as both a particle and a wave https://richarddawkins.net/2015/03/first ever photograph of light as a particle and a wave/ Synopsis: A Cooper Pair Laser http://physics.aps.org/synopsis for/10.1103/Phys Rev B.90.020506 Cooper pairs https://en.wikipedia.org/wiki/Cooper pair Best,.","date":"2015-07-21","mins":"3:06 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-210001","author":"angel","post":"***Angel says: Hi, Hugh! Atheists, trumpeting the work of Walter Mc Crone, the C 14 date, 1260 1390, attributed to the Shroud and its lack of provenance (prior to the medieval period) are directing faithful Christian believers to Joe Nickell’s book, “Inquest on the Shroud of Turin,” Unless questions (presented by Nickells) are addressed by sindonologists, including his reconstruction of the Shroud face, utilizing a rubbing technique that incorporates iron oxide and calcining green vitriol (medieval artist’s techniques) atheists will continue to view the Shroud as a fake. Nickells also concluded the pollen from Palestine was introduced onto the cloth by an outsider and the blood was painted on. Have you read this book (copyright 1998)?.","date":"2015-09-09","mins":"6:28 pm","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-150603","author":"angel","post":"Edit first line: Piero.","date":"2014-09-12","mins":"11:50 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151014","author":"angel","post":"“This question is of extreme importance because gravitational repulsion between matter and antimatter is inconsistent with the theory of general relativity.” ***Angel says: Faster than light speed is also inconsistent with Einstein’s theory of relativity; however, the universe continues to expand and galaxies are moving away from us at a rate that is faster than the speed of light. Correct? Best,.","date":"2014-09-14","mins":"6:36 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-150872","author":"angel","post":"I stated Piero was probably referencing the articles in the links I provided. Yet, with respect to chemistry – See this link: http://skeptics.stackexchange.com/questions/5963/what is monoatomic gold Quote from link: Journal articles from the Cornell Library Electronic structure and dimerization of a single monatomic gold wire L. De Maria (1 and 2), M. Springborg (1) ((1) Universitaet Konstanz, Konstanz, Germany, (2) Centro Internacional de Fisica, Bogota, Colombia) http://arxiv.org/abs/cond mat/9904181 The Puzzling Stability of Monatomic Gold Wires J. A. Torres, E. Tosatti, A. Dal Corso, F. Ercolessi, J. J. Kohanoff, F. D. Di Tolla, J. M. Soler http://arxiv.org/abs/cond mat/9812369 Stiff monatomic gold wires with a spinning zigzag geometry Daniel Sanchez Portal, Emilio Artacho, Javier Junquera, Pablo Ordejon, Alberto Garcia, Jose M. Soler http://arxiv.org/abs/cond mat/9905225.","date":"2014-09-14","mins":"1:24 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-150880","author":"angel","post":"The monoatomic gold wire from another site references atomic gold bonded to Carbon and this is, more than likely, the same as the Cornell library abstracts. Quote: The Au–Au spacing at breakage can be as long as ∼4.5 and 6 Å for the wires incorporating atomic (Au–C) and molecular carbon (Au–C2), respectively..","date":"2014-09-14","mins":"2:16 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151070","author":"angel","post":"Hugh, I value your judgment. I have just located David Hudson’s patent on monoatomic gold, but it’s too late to read it entirely. I’ll read it tomorrow. The article details the following: “Process of forming a non metallic, orbitally rearranged monoatomic form of an element selected from the group consisting of cobalt, nickel, copper, silver, gold, palladium, platinum, ruthenium, rhodium, iridium, and osmium from the corresponding element in metal form comprising treating said metal form by forming a salt thereof, exhaustively solubilizing and evaporating said salt in an aqueous medium until a diatom of said metal form is obtained; and thereafter treating said diatom with an alkali metal in the presence of water to form said orbitally rearranged, stable monoatomic form of said element.” According to Hudson’s patent he was able to isolate a stable form of monoatomic gold. Http://www.subtleenergies.com/ORMUS/patents/Ozpatent.htm Don’t shoot the messenger! Best,.","date":"2014-09-15","mins":"12:24 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151234","author":"angel","post":"Daveb, I look forward to reading the article from you link, but I have had many of my own personal experiences, referencing Jesus, that appear to be directing me to find the truth. Enjoy your dinner! When I was researching the relationship between science and evolution, God’s voice came to me and stated, “It is similar to the Einstein equation.” I had always believed the Holy Spirit was male, but I was given a dream, where the Holy Spirit was walking through the trees in the Garden and I heard a swishing sound as the Spirit walked by, stating to Adam and Eve, “Who told you you were naked.” What I saw moving through the trees was a long skirt, similar to a stiff silk that had an elongated (east to west), ivory colored, brocade “V” at the top (waistband of the skirt). Yet, the waistband of the gown was at sky level and I was standing on the ground. And no matter how far up I looked, I was never able to see the face of the Holy Spirit, only the waistband of the gown, the black shoes (similar to a penny loafer, without the penny slots) and the beige cotton stockings that were slightly rolled at the ankles. The entire top half of the Holy Spirit was above sky level. And she moved in a manner that was quite awkward, as if there were too much height or weight for her frame. Scaliing down to the size of an average woman, I would say her size was about a woman’s 14. The gown (skirt) was almost Victorian in style. At this point, after having this dream, I researched to find the Holy Spirit was female gender, according to the Hebrew, Ruach Ha Kodesh. Http://www.wattpad.com/1096411 who what is the ruach hakodesh And then the dove (feminine representation) made sense, and the statement, “This is my beloved son, in whom I am well pleased” represented the mother speaking of her son, and not the father. I don’t know if this is antithetical to Catholic doctrine, but my dream was confirmed by finding “Ruach Ha Kodesh.” This may be considered heretical, I’m not certain. I then started bleeding from a mole that suddenly manifested on my right side, ironically the same area where Jesus was pierced with the sword. The bleeding wouldn’t stop, so I visited my physician. My doctor sent me to a specialist and the dermatologist took a biopsy of the mole and told me to leave the band aid on for 24 hours. The next day, when I removed the band aid the complete facial image of Jesus was detailed, including the “3” on the forehead. The image was sharp and detailed; however, I waited a week and the blood had oxidized slightly. At that time, I placed the band aid in a cellophane bag and scanned it next to the Barrie Schwortz facial image. The only difference is in my image the head is turned about 10 degrees to the left. After that the nail marks appeared on both my feet. They were raised, red, and about a centimeter in diameter. I took a picture of these as well. And the last incident was another mole that started bleeding on the inner side of my left knee. After the biopsy, the scar healed in the shape of a perfect cross. I also took a picture of that. The scar has almost healed at this point, but luckily I took a photo. I would like to post my blood Shroud image that is positioned next to Barrie’s shroud image (for comparison) on this thread. Next to the “3” on the forehead, on my image there is also a “6” and the Hebrew for “6” is vav, which means a connection, similar to our word “and” in English. The explanation of vav is shown on the website below. Http://webpages.charter.net/yarahministries/alphabet.html If Dan would allow me to post the image, I will send it from my gmail account, since it allows the receiver to scan the image, thereby preventing viruses or malware attachments on photos. As well, I was researching whether or not Jesus died in 33 AD or 36 AD. Both had Friday passovers, but most scholars dictate 33 AD for His death, forgetting that 36 AD would also qualify. If Jesus was born April 17th 6 BC and died in 36 AD his age would be 42. This makes sense, since the Pharisee stated to Him, “You are not yet 50 years old, but you have seen Abraham.” If Jesus was died in 33 AD His age would be 39, so the statement made by the Pharisee, would not make sense. The Pharisee would have said, “You are not yet 40.”.","date":"2014-09-15","mins":"3:48 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151009","author":"angel","post":"Hi Hugh, Thanks for the advice, but there’s an alternate scenario. Scientists at reputable research universities stated it was impossible to obtain anything from dinosaur fossils, since they were merely rock and when one crushes rock, he or she obtains only dust. :) Yet, Dr. Mary Schweitzer, was able to isolate soft tissue and heme from dinosaur fossils by merely dissolving the bones in vinegar (softening them). Even Hawking referred to one of the particle pairs (referencing the annhilation of a positron electron) as a twin, when, in fact, they have opposite charges. Hardly a twin. Scientists have often been wrong. Piero only asked if it were possible to use a nano heating probe to test the white powder (heating and cooling). This experiment would take less than an hour. Yes, monoatomic gold, as I’ve further researched, is mystical, yet it could easily be tested. Http://www.halexandria.org/dward469.htm My personal belief is Jesus walked on water and resurrected using the elements of nature. The levitation would had to have involved a natural process or some type of metal acting as a superconductor and a current that would generate a magnetic field? Perhaps lightning striking the the earth vertically during the storm produced a magnetic field that allowed Jesus to walk on water. Lightning was never mentioned in the bible, with respect to the storm or the resurrection. The tomb guards may have been placed in a coma by Jesus. With regard to anti gravity, is your belief Lockheed’s anti gravity unmanned spacecraft, X 22 A, with onboard laser weaponry, also an untruth? Or is the anti gravity, Boeing and Grumman, collaboration on a warp drive false, as well.? Nothing is believable on the internet anymore. Thanks again! Best,.","date":"2014-09-14","mins":"6:14 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151065","author":"angel","post":"Daveb of wellington nz, Yes, daveb, you are correct. Initially CERN found neutrinos traveled faster than light’s speed, but at a later date, after having carefully measured their speed, concluded they did not travel faster than light. Yet, have you ever wondered what lit the earth, prior to the formation of the sun and moon, enabling plant life to exist on the planet? Well it is my belief it was the Holy Spirit (Ruach Ha Kodesh), responsible for the light. The first force was God the Father (Genesis 1:1 and 1:3) and the second force was the Holy Spirit, (light), Genesis 1:2. And it may very well be the Holy Spirit traveled faster than the speed of light, since there was an expansion of the universe. God did not create the sun, moon and stars until Genesis 1:14, yet abundant plant life carpeted the earth’s land mass. Hugh will probably not agree. Although I have been called an heretic for this hypothesis, I believe the following: The Trinity ( 3 separate or interchangeable entities under on Godhead) is similar to Einstein’s theory, E = mc^2 E = Energy (God the Father) m = mass (Jesus Christ, the Son) c = speed of light ^2 (Holy Spirit, the Mother) c in that formula is determined by the speed of the Holy Spirit (perhaps the speed of the Holy Spirit is equal to or faster than the speed of light, and is dependent on the circumstance. Expansion of the universe, as an example, would require the speed of the Holy Spirit to be faster than light’s speed. Father, Mother, and Son are a family unit. God’s desire was for mankind to propagate the earth and to be representative of a family. As well, God stated, Let US make man in OUR image, after OUR likeness in Genesis 1:26. The reference is to God, the Father and the Holy Spirit, the Mother. This is the reason for the “us” and “our.” And the dove is representative of the feminine, so it was the Holy Spirit (the Mother) who stated, as Jesus was being baptized by John, “This is my beloved son, in whom I am well pleased.” A mother can speak of her son, as well as a father. And further, the Ruach Ha Kodesh is the femine gender in Hebrew, but was translated to “it” and “he” in the Latin and Greek. My conclusion is the Holy Spirit is the Mother and the Holy Ghost is the resurrected Jesus. I believe there was no way to distinguish between spirit (soul or breath) and ghost (apparition) in the Greek, so the words (spirit and ghost) were interchanged erroneously. Referencing the white powder referred to as monoatomic gold, I still believe there is no harm in testing Piero’s theory. I wonder what the molecular structure and the chemical formula of this white powder might be or if a nuclear magnetic spectrum (NMR), or an Infrared spectrum (IR) is available. It would be interesting to find out what this powder really is through chemical analyses. I wonder if there’s an article on the chemistry? Best,.","date":"2014-09-14","mins":"11:46 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151223","author":"angel","post":"Daveb of wellington nz, What is sold on ebay is NO Tmonoatmic gold. I’ve read half of the experimental procedure on the patent. Hudson’s final compound has no inorganics, as you’ve detailed above. Hudson removed all salts and inorganics. If any remained in his final product, the purification had to be repeated from step 1 in the synthesis. What ebay is selling is a fake. A mere Infrared spectrum would determine if ebay’s product was authentic as there should be a doublet (two splits) in the 1450 cm^ 1 region. This would be similar to having an isopropy group on a compound and seeing the isopropyl split on the NMR (Nuclear Magnetic Resonance). This split confirms one has the isopropyl group. I’ve only read to page 21 on the patent, but Hudson appears to be extremely intelligent. Similar to two of the professors I did independent research for as an undergraduate on Nitrogen and Phosphorus chemistry. Hudson spoke of d orbital overlapping and I doubt those selling the product on ebay would even understand d and s orbitals. Please don’t make a decision on monoatomic gold until you have read Hudson’s patent. Http://www.subtleenergies.com/ORMUS/patents/Ozpatent.htm Best,.","date":"2014-09-15","mins":"2:47 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151217","author":"angel","post":"Hugh, I’m not certain if you saw my reply to you in a post above. I found the original patent by David Hudson on monoatomic gold, with the experimental procedure (extremely difficult). The IR spectra detailed two splits at approximately 1429 and 1490 cm^ 1. I doubt what is being sold on ebay is the same as that synthesized by Hudson. Take a look, if you have the time. I’ve read up to page 21, and there are about 45 pages. The experimental procedure is extremely complicated, working, at times, under an inert atmosphere and using extremely corrosive compounds, some that will oxidize right down to the bone. The glassware set up alone, in Figure 2, leads me to believe those on ebay are not selling what was synthesized by Hudson as his produce was free from all inorganics. What’s sad is Hudson did not have access to the latest spectroscopic methods of testing we have today. I would have like to see a Nuclear Magnetic Spectrum (NMR) of his product. Read the experimental section. I’m certain what is sold on ebay is not monoatomic gold, as prepared by Hudson. Patent – http://www.subtleenergies.com/ORMUS/patents/Ozpatent.htm.","date":"2014-09-15","mins":"2:32 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151245","author":"angel","post":"Hugh, I don’t believe what is being sold on ebay is the same white powder prepared by Hudson. The experimental procedure is extremely cumbersome and quite detailed. This experiment was also performed on other metals, such as, cobalt, nickel, silver, palladium, platinum, ruthenium, rhodium, iridium, and osmium DATED this 19th day of June 1989. Obviously, Hudson has worked many years on this project. One must first reproduce the experiment, before claiming the results are fraudulent. Looking at the temperatures alone and the glassware set up, I would conclude only one or two people have ever made an attempt at the synthesis. Best,.","date":"2014-09-15","mins":"4:27 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151235","author":"angel","post":"Colin Berrys says: “Hudson’s so called patent application is anything but. Try reading some real patent applications, ones that focus on the practical patentable detail, which don’t try to bamboozle with superfluous so called electron orbital theory (the latter padding out being meticulously contrived bullsh*t designed to overawe the gullible with pretentious waffle).” ***Angel says: Hi, Colin. T There is no reply link next to your name, so I’ve included your statement. Did you notice the year of the patent? Over 5 decades ago. (COMMONWEALTH OF AUSTRALIA Patents Act 1952 1969) You may be comparing his patent with the more modernized versions of today, and further you are probably accustomed to reading patents detailing organic chemistry, not inorganic chemistry, which focuses more heavily on molecular orbitals. Best,.","date":"2014-09-15","mins":"3:57 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151277","author":"angel","post":"Colin, I quoted that 1989 date in my reply to Hugh. I know from my own inorganic chemistry courses, the professors spent a significant amount of time on molecular orbitals. I found this to be the case with Advanced Physical Chemistry, as well. What you find boring is extremely exiciting to inorganic chemists, especially with respect to those metals whose electrons share or fill the d and f orbitals. Inorganic chemists concentrate on both Molecular Orbital Theory and Crystal Field Theory. Since many inorganic compounds are highly colored, a great deal of time is also spent on where these compounds absorb and transmit light on the color spectrum, crystal field splitting, high spin, low spin and the filling of d and f orbitals. These compounds absorb anywhere from 300nm to 700nm on the electromagnetic spectrum. The site details 400 700 nm; however, in truth, it is 300 to 700 nm. Notice on the color of inorganic compounds link, how the d orbitals are featured. Http://chemwiki.ucdavis.edu/Inorganic Chemistry/Crystal Field Theory/Colors of Coordination Complexes With that in mind, Hudson would naturally write about filling d orbitals, since his research is specifically targeting metals or metal compexes (inorganic compounds). Hudson’s experimental section is very detailed. Best,.","date":"2014-09-15","mins":"7:49 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151238","author":"angel","post":"Edit: Colin Berry says: ***Angel says: Hi, Colin..","date":"2014-09-15","mins":"4:00 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151291","author":"angel","post":"Hugh, yes, gold nitrate is currently sold by “American Elements,” but may not have been available years ago. You stated, “It might mean that we now have more or less pure Sodium Nitrate, with the odd single gold atom relacing the sodium here and there. At least it explains the white colour. We have reached page 21 and embark on pure alchemy. First we check that a pile of dirt contains no gold. How? Then we mix it with salt, bromide, sulphuric acid and anything else handy and electrolyse it. The result is gold. ***Angel says: Hugh, Hudson’s starting material WAS Gold Chloride (Au Cl3). With respect to Sodium Nitrate, it is highly soluble in water; therefore, Hudson would have rid the crude product of Sodium Nitrate. As a result, some form of gold should still have remained. Hudson’s experimental procedure states, “Thereafter, the just dry material is diluted to 80 ml with deionized water. The solution will have a p H of approximately 1. This step causes the nitrate to dissociate to obtain Na Au in water with a small amount of HNO3 remaining. ***Angel says: Yes, the p H would be 1, because the nitrate is still attached prior to the addition of water. Nitrates are very acidic. So, this step, adding water, dissociates the nitrate and it is indicated a small amount of nitric acid still remains. Therefore, the solution should still be acidic to some degree. And Hudson increased the p H of this acidic solution to neutral p H with Sodium Hydroxide. That is correct.. And then Hudson states, “The Na Au hydrolyzes with the water and dissociates to form H Au. This is also correct, since if Na Au was replaced with Na Cl, after hydrolysis you woud isolate H Cl and Hudson isolated H Au. This step is correct. And then he specifies getting a light grey precipitate of the gold that is hygroscopic (H Au XH2 O). He did not mention how many molecules of water were attached, meaning it varies. The last step Hudson describes,”The monoatomic gold is placed in a porcelain ignition boat and annealed at 300 C under an inert gas to remove hydrogen and to form a very chemically and thermally stable white gold monomer.”. I fail to see where you are getting a pile of dirt on page 21. This is the purification procedure, There is no dirt and there should be at least a gold atom, since Hudson started with gold. There is no alchemy, since Hudson is not creating gold. Hudson started with gold and ended with gold of some form or another (monoatomic gold). The remaining pages in the experimental section are where Hudson performed the exact experiment with different metals, Palladium, Platinum, etc. You are able to buy these compounds from chemical supply companies today, but they weren’t available during the time he began his research. Unless I’m missing something, the experimental procedure appears to be correct. One would have to repeat the experiment to see if the final product is obtained. Best,.","date":"2014-09-15","mins":"8:47 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151295","author":"angel","post":"PS I don’t believe Hudson was practicing alchemy, because he worked with cobalt, iridium, as well as many of the other transition metals..","date":"2014-09-15","mins":"9:01 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151512","author":"angel","post":"Hugh, I was speaking of transition metal nitrates, when I stated all nitrates are acidic. The entire Hudson paper was referencing the different transition metals and d orbitals. And all the nitrates of these metals would be acidic. The reason is the transition metal ion acts like a bronsted acid, and it is for this reason the nitrates are acidic. Copper Nitrate has a p H of 4. Common garden fertilizers do not contain transition metals. I said, “So, this step, adding water, dissociates the nitrate and it is indicated a small amount of nitric acid still remains.” – You replied: What does this mean? There was no acid to start with, and there will be no acid remaining. My response: Yes, there was nitric acid. ” 5 ml concentrated nitric acid are added to the crystals and again boiled to where the solution goes to just dry. Again it is essential not to overheat or bake. Steps (11) and (12) provide a complete conversion of the product to a sodium gold nitrate. No chlorides are present.” At any rate, I do not wish to continue further, but the thread started with a question on monoatomic gold, a superconductor, and so my reply was with reference to piero’s question. Don’t let me divert you from you shroud study, but always keep in mind “With God, anything is possilbe.” :) Peace!.","date":"2014-09-16","mins":"2:35 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-152743","author":"angel","post":"Colin Berry says: “I too learned about transition elements, degenerate d orbitals and crystal field field theory in Prof Ron Belcher’s inorganic chemistry department, University of Birmingham, England, 1963 66, while studying for a first degree in biochemistry.” ***Angel’s response: Sorry, I missed your post, Colin. Well, I must say that disclosure is impressive. Dr. Belcher was also the mentor of T.S. West. I have also worked for a few giants in the chemistry field. One was the late Dr. Ross C. Terrell (anesthetic pioneer). Ross was our Vice President for 10 1/2 years, although my research project was the synthesis of novel and innovative neuromuscular blocking drugs. (neuromuscular junction nicotinic receptors). Dr. Ross C. Terrell http://journals.lww.com/anesthesia analgesia/pages/articleviewer.aspx?year=2011&issue=08000&article=00029&type=Fulltext Colin Berry says: “Before and after that, I also learned to spot deliberate deceit by snake oil merchants, albeit cleverly and laboriously disguised as “science” (University of Life, 1944 present). Nuff said.” ***Angel’s response: Colin, it may be the fact you view everything with a jaundiced eye that you either overlook the obvious or disregard, without hesitation, some process that may or may not be feasible: Meissner effect, Cooper pairs, etc., referencing monoatomic gold. I’m actually surprised you haven’t researched out Kerala’s red rain (#4 on the link), in support of your own “Blood on the Shroud Theory. Yet, I digress. :) http://www.oddee.com/item 91568.aspx With respect to the Shroud of Turin, all avenues, for and against, should be investigated, including those of Piero. IMHO! Best,.","date":"2014-09-20","mins":"12:54 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-152814","author":"angel","post":"Colin, I’ve seen your images previously, including that of nutella. I am not stating you haven’t spent an enormous amount of time and energy attempting to recreate a likeness that would disprove the Shroud image. That is commendable, although antithetical to Christian belief. Yet, it is your right, as a scrutinizing scientist. The viewing, on your part, with a jaundiced eye referred to *everything* that might prove the Shroud authentic. With regard to trolls, most of the posters on this forum (according to the definition of internet trolling,) would fall into that category, including you. And some posters go far beyond what I would consider civil behavior. I’ve not called anyone derrogatory names on this thread. Arguing a point is not trolling, just because others (who are of a different opinion) disagree. Actually, this is human nature and it is a characteristic of anyone who thinks outside the box. Why should posters feel that any form of intense questioning, beyond what is considered the norm, is ignorance or to be taken as insult to their intelligence? Speaking of the Shroud, iron and strontium were found in trace amounts. See link below: More on the Dirt of the Shroud of Turin | Shroud of Turin Blog In fact analysis of particles of limestone also found adhering to the Shroud … found particles of aragonite with small amounts of strontium and iron on the Shroud … https://shroudstory.com/2011/09/16/more on the dirt of the shroud of turin/ Well, iron based systems containing strontium and other elements (as new research details) are also found to be superconductors. Check out “Magnetism in Fe based superconductors” And Jesus’ feet would have picked up iron from the soil on the path to the cross; therefore, since iron too is a superconductor, this element may have contributed to His levitation at the resurrection. Don’t shoot the messenger! Best,.","date":"2014-09-20","mins":"6:32 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-153797","author":"angel","post":"Colin, I don’t begrudge your research, mainly because I know for a fact the man who is featured on the Shroud (Yehoshua) is authentic. And if you eventually find a method to reproduce the image you would have to subject your creation to the same chemical testing the Shroud underwent. I’m a free radical, Colin; therefore, terra firma is meaningless in my world. :) With reference to science and levitation, how was it possible for St. Joseph to levitate? Transition Metals – Superconductivity – Meisner Feild – Zero Point Energy Field (ZPE). There is increasing scientific research into the area of anti gravity, including NASA, and it is not beyond what would have been available to Jesus at the resurrection, aside from warp drives. Human Levitation to Anti Gravity http://curezone.com/forums/fm.asp?i=276210.","date":"2014-09-22","mins":"6:47 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-157371","author":"angel","post":"Colin, thought you might like this article,. “Scientists find economic process for creating gold from base metals” “LIVERMORE, California — Scientists at the Lawrence Livermore National Laboratory have discovered a process for inexpensively converting base metals into gold, the lab announced Tuesday night at a hastily called news conference. Pidasso said the lab, a division of the U.S. Department of Energy, first achieved the transformation by borrowing protons from copper and nickel and adding them to bars of iron. But when copper and nickel supplies ran out, the lab began using protons from calcium, which is abundant in seashells along the nearby California coastline. According to Pidasso, using proton borrowing and high quality varnishes, the lab will be able to manufacture about 1,500 metric tonnes of gold per year…” http://www.gata.org/node/5272.","date":"2014-09-28","mins":"1:59 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-152819","author":"angel","post":"Edit: derogatory taken as an insult.","date":"2014-09-20","mins":"6:53 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-157417","author":"angel","post":"Hugh, I was reading the book on “The Rise of the Alchemist” and it was reported a team of researchers at Harvard transmuted lead to gold; however the three gold isotopes obtained were radioactive and would, more than likely, decay back to lead, due to instability. Looking for that specific Harvard link, I found the article from Dept. Of Energy story, didn’t read the byline or the details. That aside, the transmutation of lead to gold has already been done. Link: Transmutation of lead into gold isn’t just theoretically possible – it has been achieved! There are reports that Glenn Seaborg, 1951 Nobel Laureate in Chemistry, succeeded in transmuting a minute quantity of lead (possibly en route from bismuth, in 1980) into gold. There is an earlier report (1972) in which Soviet physicists at a nuclear research facility near Lake Baikal in Siberia accidentally discovered a reaction for turning lead into gold when they found the lead shielding of an experimental reactor had changed to gold. Today particle accelerators routinely transmute elements. A charged particle is accelerated using electrical and/or magnetic fields http://chemistry.about.com/cs/generalchemistry/a/aa050601a.htm.","date":"2014-09-28","mins":"5:38 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-157420","author":"angel","post":"Daveb, I did see that link article previously, but I bought the book “The Rise of the Alchemist,” and there were two references on transmuting lead to gold. The first was the team of researchers at Harvard, mentioned in the reply to Hugh. And there was another that stated, the German, Johann F. Bottgher, worked for “Augustus the Strong of Saxony” and he was able to produce what was referred to as two button like “reguli,” one of nearly pure gold and the other nearly pure silver. Supposedly they are on exhibit at the Dresden Porcelain Museum. There is a picture of both in the book. Bottcher started making gold, but ended making beautiful porcelain for Augustus. Yet, if this is a true account, his procedure was similar to that of David Hudson, since he used 1 grain of a tincture, along with lead and copper. Best,.","date":"2014-09-28","mins":"6:06 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-157492","author":"angel","post":"Daveb, thank you for your reply! Yes, it sounds difficult, but transmutation of metals was accomplished by Glen Seaborg, the Nobel Prize winning chemist who worked on the “Manhattan Project.” Seaborg was also the “Chairman of the Atomic Energy Commission and it was he who developed Americium, Curium and Berkelium (Periodic Table). The Wiki article confirms Seaborg succeeded in the transmutation. “In 1980, he transmuted several thousand atoms of bismuth into gold at the Lawrence Berkeley Laboratory. His experimental technique, using nuclear physics, was able to remove protons and neutrons from the bismuth atoms. Seaborg’s technique would have been far too expensive to enable routine manufacturing of gold, but his work was close to the mythical Philosopher’s Stone.” http://en.wikipedia.org/wiki/Glenn T. Seaborg My wish is for some scientist (any scientist) to finally confirm the authenticity of the Shroud and the method for Jesus’ levitation at the resurrection. Best,.","date":"2014-09-28","mins":"1:59 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-157421","author":"angel","post":"Edit: Johann F. Bottger..","date":"2014-09-28","mins":"6:07 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-157552","author":"angel","post":"Daveb, that is quite the story. Ernest Rutherford (another Nobel prize winner) was a giant in the field of radiochemistry, although he was trained as a physicist. We studied his discoveries of alpha and beta rays, as well as radioactive decay as undergrads. He, along with J. J. Thompson and Marie Curie were admired for their contributions to the field.of nuclear chemistry. Many years ago, I was exposed to alpha, beta and gamma rays, while working with positron emitters. This was one of the reasons I decided to pursue a pharmaceutical career instead. Yet, I’ve been away from chemistry for almost two decades now. Did you grandmother have a picture of Rutherford? Best,.","date":"2014-09-28","mins":"8:16 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-159254","author":"angel","post":"Daveb of wellington nz, thank you for the information. What an honor to be featured on either a stamp or paper currency. Your country contributed significantly to those giants in the field of science who are now deceased. I’m afraid to offer links anymore for fear they may be bogus, but I just found an archaeology site where it was stated a glass plate from the 4th century was found in Spain and it featured one of the earliest images of Jesus. Strangely, He is beardless and according to the report He is wearing a philosopher’s toga. 3 October 2014 Beardless Jesus’ found in Spain “The plate is believed to have been used to hold Eucharistic bread as it was consecrated in early Christian rituals. It measures 22cm in diameter and fragments of it were unearthed outside the southern Spanish city of Linares, ABC newspaper reports.” http://www.bbc.com/news/blogs news from elsewhere 29480874 I’ve not looked through the articles on this site, so you may already be aware of this plate if, in fact, it is authentic. Best,.","date":"2014-10-04","mins":"11:35 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151308","author":"angel","post":"Hugh, I see why you believe Hudson’s work to be alchemy. You believed Hudson was attempting to isolate pure gold from a gold complex and after reading his personal story, I see why you mentioned “dirt.” Hudson hired chemists to perform the tests on a black compound he initially found in dirt, I don’t believe he is a chemist himself. With regard to his patent, he states the following: “Any patent involving superconductivity has to be approved by the Department of Defense before it can be issued….. So it was sent to the Department of Defense. They refused to let me file world wide.” He speaks of the Middle East and the Egyptians and this monoatomic gold powder that is a superconductor and may have been how Jesus levitated. At any rate, Piero might be out of luck, if what is sold on ebay is not what Hudson isolated. Best,.","date":"2014-09-15","mins":"10:29 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"}]
