[{"id":"comment-207502","author":"angel","post":"Daveb says: “There are in particular two striking Shroud like facial images of Jesus dating from about the 7th century. The first of these is on a hammered silver vase, found among church ruins in the Syrian city of Homs, formerly Emesa, a late 6th century centre of Byzantine Christianity, this vase now being in the Louvre. The second Shroud like facial image is on a coin issued by Justinian II in 692,” ***Angel says: Exactly! Daveb, you are such a wise man. And the third is the Chandra B1509 telescope image. Please note, the Chandra telescope hand and facial image B1509) align perfectly with the and Shroud of Turin image (face and hands). Link: The Ultimate Proof ! This is the Face of Our Lord Jezus Christ on the Shroud. Cloud Formation “the Hand” Shroud Hand and Cloud Hand Enhanced Pelvis Spine UV Fluorescence photo The Sudarium of Ovida Notice the Same Red Spot on Nose and Swollen Eye The Hand Of God (enhanced and flipped vertical – neutron star known as PSR B1509 58 ) The Shroud face is also found on the http://home.kpn.nl/britso531/.","date":"2015-08-05","mins":"3:58 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207587","author":"angel","post":"Yanick, do you have a link to the Christ Pantocrator icon?.","date":"2015-08-06","mins":"11:21 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-150090","author":"angel","post":"This is off topic, but a great research find. Leave it to the Germans! German Scientists Prove There is Life After Death http://worldnewsdailyreport.com/german scientists prove there is life after death/ Best,.","date":"2014-09-11","mins":"1:28 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-207710","author":"angel","post":"Daveb says: “So possibly the Homs vase might even be as early as this. The images on the vase and the 692 solidus are quite similar.” ***Angel says: Indeed they are and it is apparent both artists (vase and gold solidus coin) must have seen the Shroud up close. The images of the “Pantocrator” icon Yannick referenced appear to be from a later point in time and although there are similarities to the Shroud, they are not as striking as those depicted on the vase and gold solidus..","date":"2015-08-07","mins":"7:37 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207715","author":"angel","post":"I’ve looked at the Mandylion numerous times, comparing it to the negative Shroud image. And just to be unbiased in my analysis, I’ve even stood on one foot and turned my head 45 degrees, while squinting my right eye for a more detailed view. :) In truth, I fail to see the same resemblance that I do, when comparing the Shroud to both the Justinian II gold solidus Pantocrator coin and the silver vase. Yet, I haven’t made the comparison of the Mandylion to the positive image on the Shroud..","date":"2015-08-07","mins":"8:13 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207815","author":"angel","post":"So, daveb, which of the two is it, crown or helmet? What I have found is the New Testament writers used the word στέφανος (stephanos) to describe Jesus’ crown of thorns or more precisely a plaited or braided wreath. Yet, I have seen some in the Shroud community refer to it as a “cap” of thorns. Origin of the Word στέφανος (stephanos from stephó (to encircle) Definition that which surrounds, i.e. A crown http://bibleapps.com/greek/4735.htm http://www.spiritandtruth.org/teaching/Book of Revelation/commentary/htm/topics/crowns.html.","date":"2015-08-09","mins":"4:12 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-16755","author":"angel","post":"Although not acceptable doctrine, “The Gospel of Philip” (Gnostic scripture) states Mary Magdalene was the companion of Jesus and that He would often “kiss her on the lips.” Within the pages of the Gnostic text, “Pistis Sophia” (G.R.S. Mead translation), Mary Magdalene was exalted above all the disciples of Jesus and He recognized her as being completely in tune with His thought process. In Canonical scripture Jesus appeared to Mary Magdalene first, and we all know she wasn’t a prostitute, but rather Pope Gregory was responsible for this slander. Whether Mary Magdalene was wife or companion, Jesus considered her to be more special than any of the others..","date":"2012-09-22","mins":"3:05 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"id":"comment-16786","author":"angel","post":"Quote from Yannick Clement: “This could well be an hidden reference about the fact that she was really a prostitute or some kind of nymphomaniac. Or this could be taken at first degree and interpreted literally, i.e. That she was really possessed by 7 demons. The bottom line is this : We can’t be certain if she was or not a prostitute.” ****Obviously there was Biblical evidence that Mary Magdalene was not a prostitute or the church would not have removed the label. An excerpt from the link below states the following: “As a follower, Mary was one of many women that accompanied Jesus during his travels, most of whom are believed to have been wealthy. During his journey, he was visited by two women, the unnamed sinner in Luke 7 and Mary of Bethany, both of whom anoint his feet and dry them with their hair, similar to the way Magdalene anointed him shortly after his death.. In 591, Pope Gregory the Great stated that all three were in fact one woman, Mary Magdalene, and this is how she became labeled as a prostitute, or the unnamed sinner. However the Second Vatican Council removed the prostitute label in 1969 after much debate and Biblical evidence that there was more than one Mary and that Mary of Magdalene and the unnamed sinner were two different figures.” http://departments.kings.edu/womens history/marymagda.html.","date":"2012-09-23","mins":"12:03 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"id":"comment-16808","author":"angel","post":"I failed to further mention women with the same first name were distinguished from each other by the town from which they originated. With this in mind, how are Mary of Magdala and Mary of Bethany the same woman?.","date":"2012-09-23","mins":"5:08 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"id":"comment-16876","author":"angel","post":"Yannick, I will agree with you when Mary confronted Jesus, concerning sin, her life was changed. This would be the case with any of us, considering Jesus’ remark, “Let he who is without sin cast the first stone.” I was reading a Greek Orthodox blog on this subject and I saw these two comments by Mr. Niko T (Greek Orthodox USA) on the subject of Magdalene with demons. Http://www.monachos.net/forum/showthread.php?6721 Mary Magdalene and the seven demons The following life of St. Mary Magdalene in Greek (http://www.impantokratoros.gr/C92 EE7 A9.el.aspx) includes a whole section on the misconception that she was the sinful woman in the Gospel. Here is a pertinent quote from there by St. Modestus of Jerusalem (from a work of his: “On the Myrrhbearers”) and my translation: “Και στον άγιο Μόδεστο, Πατριάρχη Ιεροσολύμων (α’ ήμισυ ζ’ αιώνος) διαβάζομε: «Τον συμβολικό αριθμό επτά και όταν πρόκειται περί της αρετής και όταν πρόκειται περί της κακίας, βλέπομε να χρησιμοποιή η Αγία Γραφή. Ευλόγως, λοιπόν, διαλέγει ο Σωτήρας την Μαρία την Μαγδαληνή, από την οποία εξέβαλε επτά δαιμόνια, για να εκδίωξη μέσω αυτής, τον άρχοντα της κακίας (διάβολο) από την ανθρώπινη φύση. Διότι οι ιστορίες διδάσκουν την Μαγδαληνή αυτήν δια βίου παρθένον. Και αναφέρεται μαρτύριον της Μαρίας Μαγδαληνής, όπου γράφεται ότι για την άκραν παρθενίαν και καθαρότητά της, φαινόταν στους βασανιστές της, σαν καθαρό κρύσταλλο».” “And according to St. Modestus, Patriarch of Jerusalem (1st half of the 7th Century), we read: “The symbolic number seven we see used in the Holy Scriptures indicating virtue and indicating evil. Most likely [Ευλόγως], therefore, it is said that Mary Magdalene, from whom [Christ] cast out seven demons, that the Savior drove out from her the prince of evil (the devil) from the human nature. For the stories teach that this Magdalene was a virgin through her life. And it is mentioned that [at] the martyrdom of Mary Magdalene, as is written, that on account of her utter virginity and purity, she appeared to her torturers, as a pure crystal.” And Niko’s second comment on the subject “The same view is presented on the seven demons by Theophylactos of Bulgaria in his Ermenia on the Gospel according to St. Luke: “As there are seven spirits of virtue thus there are against them seven spirits of evil. As there is a Spirit of fear of God, thus there is against it a Spirit of a lack of fear of God. There is a Spirit understanding, there is against it a Spirit of a lack of understanding, and the same with the rest of them. Unless, therefore these seven spirits of evil leave from the soul, it’s not possible for one to follow Christ. For first Satan must be removed from him, and then Christ will inhabit him.” ***It was mentioned that Mary Magdalene was a virgin. If God has 7 spirits (indicating goodness), then He would necessarily have to cast out 7 demons (indicating evil) on any mortal He may have chosen to be His follower or carry His message. Blinding Paul, on the road to Damascus, might also have been a way of casting out demons or a refining process..","date":"2012-09-24","mins":"4:06 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"id":"comment-16535","author":"angel","post":"Some scholars believe the papyrus fragment is a forgery. Http://www.dailymail.co.uk/news/article 2205673/Jesus Wife papyrus Proof Jesus married declared forgery unconvincing experts.html?ITO=1490.","date":"2012-09-19","mins":"6:51 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"id":"comment-21401","author":"angel","post":"Thank you, Louis. I appreciate your effort, with respect to all the information you have provided. I only glanced over the article, but was surprised to see there were fragments from Jesus’ manger. Further, I thought if the church had blood samples, why haven’t they compared that blood to the blood on the Shroud or the blood on the Sudarium of Oviedo? At any rate, enjoy the New Year holiday. Best,.","date":"2012-12-31","mins":"3:38 pm","url":"https://shroudstory.com/2012/12/23/paper-chase-the-conspiracy-against-the-shroud/","cat":"history","title":"Paper Chase:  The Conspiracy Against the Shroud"},{"id":"comment-21366","author":"angel","post":"Hi everyone! You may have seen this archaeological unearthing, but I’m posting the link for those who may not have read the article. Tomb Exploration Reveals First Archaeological Evidence of Christianity from the Time of Jesus. Link below or google title. Http://www.sciencedaily.com/releases/2012/02/120228102137.htm Hope all of you had a Merry Christmas and I wish you a very happy year ahead. Best,.","date":"2012-12-30","mins":"4:28 pm","url":"https://shroudstory.com/2012/12/23/paper-chase-the-conspiracy-against-the-shroud/","cat":"history","title":"Paper Chase:  The Conspiracy Against the Shroud"},{"id":"comment-143278","author":"angel","post":"Colin Berry says: “Creativity is about presenting new angles that no one has previously thought of.” ***Angel says: I agree, Colin. What about this new angle, referencing the resurrection of Jesus? First, think in terms of Einstein’s “Unified Field Theory,” as opposed to his “Theory of Relativity,” where he attempts to conflate the electromagnetic and gravitational fields into one mathematical reference frame. Next move to Germany’s “The Nazi Bell Project,” and then on to Russia’s, (Dr. Podkletnov’s) experiments on antigravity. Http://gizadeathstar.com/2014/06/update podkletnovs antigravity research high octane speculations/ And then fast forward to Lockheed Martin’s antigravity discoid spaceship with onboard laser technology, X 22 A. The “A” stands for antigravity. Yet, there was the denial of Lockheed that they were NOT working on such a spacecraft. And finally Boeing’s admittance in the research and development of antigravity (notice the use of the word “may in the statement below.” “It is also possible, Boeing admits, that “classified activities in gravity modification may exist”. Http://www.ufoevidence.org/documents/doc1064.htm And finally Obama’s “GRASP” briefing (see following statement). Remember Russia’s Dr. Podkletnov mentioned earlier? “The GRASP briefing document reveals that BAE Systems and Lockheed Martin have also contacted Podkletnov “and have some activity in this area”. The Lockheed X 22 A space disc uses antigravity technology, avoiding radar, and is able to disappear and then re appear in the sky. With all this in mind, I believe Jesus used “antigravity” when He resurrected. And for this reason, (controlling gravity), He was able to appear, (entering through the wall) to visit the disciples after the resurrection and then disappear after His visitation. This is a wild and crazy theory, Colin, but I believe electromagnetism (Einstein’s Unified Field Theory) was utilized by Jesus at the resurrection, allowing Him to control gravity, as He left the tomb without a trace. For this reason, the Roman guards would not have seen Jesus leave the sepulchre. Best,.","date":"2014-08-10","mins":"6:35 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-21372","author":"angel","post":"Louis, I understand! One question, why is the church suddenly releasing relics of Jesus? Supposedly, these items will be placed on display in Chicago. In one example there are fragments, believed to be from Jesus’ manger and in another case the photo image shows a gold encased vial with the label “Blood of Jesus.” Do you know what year the Church acquired this blood? https://shroudstory.com/2012/12/23/paper chase the conspiracy against the shroud/#comment 21366 Best,.","date":"2012-12-31","mins":"12:41 am","url":"https://shroudstory.com/2012/12/23/paper-chase-the-conspiracy-against-the-shroud/","cat":"history","title":"Paper Chase:  The Conspiracy Against the Shroud"},{"id":"comment-16753","author":"angel","post":"I also note that Jackson’s video (doesn’t seem to be on the web any longer) distinctly showed a fold mark at the one eighth point from the centre, which I thought seemed very significant, and supported the view that the Shroud was at one time very likely folded into eight layers. *****Did you try the Wayback Machine, as Dan mentioned on another post? http://archive.org/web/web.php You may or may not be able to access Jackson’s video at that site..","date":"2012-09-22","mins":"2:23 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16751","author":"angel","post":"Exactly! All that was necessary, because it was a sin in Biblical times to look on a naked man (Jewish custom), was to fold the cloth in such a way that only the face appeared within the frame. Now, even today, most people would fold the cloth either horizontally or vertically in sections of 2, 3 or 4, in an attempt to detail the facial image alone. Yet, very few people would even contemplate folding the cloth diagonally to achieve the same result. We fail to think outside of the box, because we limit ourselves to viewing only its walls..","date":"2012-09-22","mins":"2:02 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-150287","author":"angel","post":"Thanks, Colin. So “World News Daily” is similar to “The Onion”? I’m surprised, since the article was also carried on the “Jews News.” site. Unfortunately, it’s difficult to be able to differentiate between articles that contain truth and those that contain satire. Best,.","date":"2014-09-11","mins":"5:50 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"}]
