[{"id":"comment-210005","author":"angel","post":"***Angel says: Joe Nickell presents this forgerer in his book, “Inquest on the Shroud of Turin,” but nowhere is the name of the forgerer mentioned. The claim was made, according to Canon Chevalier, who located Pierre d’Arcis report to Pope Clement VII and an investigation at Lirey uncovered the artist who created the Shroud. Who is this forgerer? Who? No name is ever mentioned. I would think if the forgerer were that good, he, like Colin Berry, would be trumpeting his artistic talent to anyone who cared to listen, during the medieval age. How was this forgerer able to paint “The Shroud of Turin,” with such intricate detail, as his first painting? And if, in fact, the Shroud was painted by this (forgerer with no name) then where are all his other paintings? He must have painted at least one other masterpiece, aside from the Shroud, just like Colin’s attempts at duplicating the image. Colin certainly has more than one reproduction and he hasn’t even completely finished with his work. Doesn’t make sense! An artist with no name and no other paintings, except the famous “Shroud of Turin,” denounced the image as a forgery. Go figure! My response: Baloney! :).","date":"2015-09-09","mins":"7:28 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-210053","author":"angel","post":"***Angel says: Thanks, daveb. I look forward to reading the article you referenced; yet, there were many people living in European countries (during the Middle Ages) that did not believe in Jesus as the Almighty, as is the case today. Therefore, it would have been to their advantage to shed doubt on the authenticity of the Shroud. Joe Nickell’s reproduction, along with Garlaschelli’s, never produced the dorsal image on the Shroud, only the frontal image. What medieval artist would have gone to that extent, copying every single flagrum wound? Seems beyond reason to me..","date":"2015-09-10","mins":"1:18 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-210072","author":"angel","post":"Daveb, thanks again, I read the article you referenced. So, the forgerer’s story WAS a case of corruption. Why am I not surprised? What I continue to find disheartening are the steps men take to cast doubt on the validity of anything that may verify the existence of Jesus. Peace!.","date":"2015-09-10","mins":"4:47 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-210056","author":"angel","post":"Hi, Hugh, Firstly, I was referring to the dorsal image, when I stated “intricate” detail, regarding the flagrum wounds. No artist has reproduced the dorsal image of the man on the Shroud, at least to my knowledge. Secondly, when I posited “famous” forgerer, I was thinking in terms of fame or success by proxy. Every atheist refers to this forgerer, when speaking of the Turin Shroud. So,this unknown artist has gained fame as the forgerer. Since both the Shroud and Sudarium predate the artists or sculptors who might have been capable of this type of forgery, like Da Vinci, then I stand by my comment. Even Da Vinci who was a master of anatomy, would not have painted an image that appears somewhat distorted. What WOULD explain the distortion of the Shroud image is a physical change in the body of Jesus at the point of resurrection or His transformation from matter to the Holy Spirit (the bright, white spiritual body that confronted Mary Magdalene). This is my opinion only. :).","date":"2015-09-10","mins":"1:57 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-210051","author":"angel","post":"David Goulet says: September 9, 2015 at 8:52 pm “Colin has never proposed a painting forgery, but a contact image. And the forger in this case would not want to reveal his secret because that would ruin the whole project.” ***Angel says: I know. Colin proposed a rubbing technique that may have been utilized to produce the image on the Shroud of Turin, but just as Colin is proud of his work and has tangible proof of his failures, a forgerer would also have copies of his/her failed attempts, prior to the completed Shroud image. Anyone can say he or she is or was a forgerer, but without proof (perhaps an earlier attempt of the art in question) or even producing another original painting, the person is not to be believed. Just an opinion, since I have not yet read daveb’s reference. Until I do, I will stick with “baloney.” :).","date":"2015-09-10","mins":"1:03 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-210075","author":"angel","post":"Sheona, we are referring to the Shroud in its entirety, including the blood images as the work of a forgerer, regardless of whether it was a painting like Garlaschelli’s or a rubbing like that of Joe Nickell and Colin Berry. In short, we speak of a reproduction of the man by a human hand, rather than an image formed by Jesus Himself, at the resurrection, perhaps utilizing quick and successive short pulses of light (non ionizing radiation). I believe De Lassandro performed a few experiments with short pulses of laser like light. See the last paragraph on the link with respect to contact image formation, unless something has changed since 2011, Link: Scientists Suggest Turin Shroud Authentic http://www.sci news.com/physics/scientists suggest turin shroud authentic.html.","date":"2015-09-10","mins":"5:16 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-210061","author":"angel","post":"***Angel says: David, I am not referring to Colin’s reproductions as baloney. I’ve seen his work and I am aware he spent many long hours in his home lab on various techniques. As well, I have always given Colin credit for his attempts, as a scientist, to either prove or disprove the Shroud. Joe Nickell’s has also produced similar results in 1998, featured in his book “Inquest on the Shroud of Turin,” referenced, along with the work of Mc Crone, by many atheists. My use of the word “baloney” refers to the forgerer. Although these materials were available to create an image in the Middle Ages, doesn’t prove the Shroud is a forgery. A forgerer would certainly have produced similar attempts of his work that were failures. Where Colin has been fairly successful with his “rubbing” technique, he is also able to verify his work with previous reconstructions that weren’t successful. Therefore, when I say “baloney,” I am referring to the work of the supposed forgerer of the Shroud. If the C 14 dating was repeated and the cloth dated to the 1st century, would non believers continue to state the Shroud is a fake? Best,.","date":"2015-09-10","mins":"2:32 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-134988","author":"angel","post":"***Angel says: No, it was hydrochloric acid. And this was an undergrad lab. The error was not the result of a dilution, but the order of addion, water to acid, not acid to water. The undergrad added in the reverse order. The same thing would happen if you added sulfuric acid to water instead of adding water (slowly, a drop or two at a time) to sulfuric acid. It is the order of addition that many people are not aware of. Fischer Scientific used to sell products to people that weren’t chemists. If they’re still in business, there are many chemicals and supplies you can purchase from them. Best,.","date":"2014-07-02","mins":"10:32 pm","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-134992","author":"angel","post":"Therefore, if you add water to concentrated sulfuric acid instead of sulfuric acid, slowly and dropwise to the water, the same thing would happen, as with the case of hydrochloric acid, except the reaction would be even more exothermic./ So, the correct order of addition is to slowly add one drop at a time of the acid (hydrochloric, nitric or sulfuric ) to the water..","date":"2014-07-02","mins":"10:49 pm","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-134990","author":"angel","post":"Colin, I reversed my order of addition, in error. Acid must be added to water (slowly), not water to acid. The undergrad added 10m L of water to 100 m L of hydrochloric acid and it heated up and splashed..","date":"2014-07-02","mins":"10:41 pm","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-134998","author":"angel","post":"Colin, I used to buy p H paper from Fisher Scientific, after leaving chemistry, and I see they are still in business. You may be able to purchase from them. Fisher used to be much cheaper than any of the other chemical supply companies. Here’s the link. Http://www.fishersci.com/ecomm/servlet/cmstatic?href=index.jsp&store=Scientific and there is also a toll free number listed on their website..","date":"2014-07-02","mins":"11:08 pm","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-135024","author":"angel","post":"Colin, other than dilutions, I remember performing acid – base titrations (neutralization reactions) to determine the end point using, as an example, a certain normality of base titrated against the same normality of an acid. Included was a p H indicator, that turned a certain color at the endpoint. However, this was my first job as an analytical chemist, after graduating, and it was decades ago. Today, removing the elements of water is referred to as either a condensation or a dehydration. I worked with sugars and remember they had to be protected as an acetonide and then when several synthetic steps were completed in the synthesis, the sugars had to be deprotected. Actually, I’ve been out of the field for decades now, and don’t keep up with scientific journal articles much anymore, unless there is something I am interested in, I wish you luck with your research. And even though I know in my heart of hearts if you do succeed in obtaining the scorched image on linen, it will not pass the tests, such as 3 D imaging, that the shroud underwent. Just sayin’ :) Best,.","date":"2014-07-03","mins":"2:00 am","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-135132","author":"angel","post":"Thanks, Louis. I have been saturated with the de Molay theory from atheists on other sites and have determined it to be erroneous, at best. My belief is the “Shroud of Turin” did not cover de Molay, for one reason solely. The Sudarium of Oviedo predates de Molay and testing has determined both cloths (Sudarium and Turin Shroud) covered the same man. Blood experiments determined the AB blood type on both cloths and the spots aligned perfectly. . Remember too, there were 70 points of coincidence and each of the cloths contained pollen from Jerusalem. If the Sudarium has been in Spain since approximately 745 AD (BCE) and it was C 14 dated to the 7th century by Professor Baima Bollone (although he could not vouch for the test’s validity), how is it possible the Turin Shroud covered de Molay or was the genius of Da Vinci? Therefore, if the Sudarium predates de Molay and Da Vinci, then so does the Shroud. And if further DNA testing proves the XXY trisomy (Kleinfelter Syndrome), then it also proves the man on the Shroud was Jewish. I doubt either de Molay or Da Vinci were Jewish, but I may be incorrect. Just an opinion though. Best,.","date":"2014-07-03","mins":"1:51 pm","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-135101","author":"angel","post":"You’re welcome, Colin. You must admit there have been hundreds of paintings of Jesus during medieval times; however, there are less than a handful depicting the feminization. Most medieval painters would not have seen the shroud image, as evidenced by their paintings portraying nails through the hands, rather than the wrists. With that in mind, the few painters who actually had exposure to the shroud, all depicted the feminization. Enrie was the photographer; therefore, what was captured on film was a reality and not the result of some artist’s imagination. If proven, through genetic studies, that the sex linked gene is determined to be XXY, then the image is more likely to be that of a Jewish male, since Kleinfelter Syndrome is prevalent in Jewish men. This increases the probability the shroud was enfolded about Jesus, as opposed to de Molay. At any rate, only time will tell, but truth will always prevail. Best,.","date":"2014-07-03","mins":"10:28 am","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-135385","author":"angel","post":"Thanks for the link Louis. I was unable to view the article in pdf format, since I recently uninstalled Adobe Reader 9. I have dial up and the newer version of Adobe Reader is too many MB to download with dial up. I did make an attempt to access the article through other google UR Ls, but all were pdf files. At any rate, I have asked a friend (who heads a genetic testing lab) to give me some detail on XXY (Kleinfelter Syndrome) vs. XX male (de la Chapelle Synsrome) and I received an email from him stating he would check into it. You may not think the XXY gene is important, but I do, since it would prove the man featured on the Shroud of Turin was a Jewish male. Atheists claim the Shroud image is representative of a Caucasian male from Europe and further state he is too tall and his hair too long to have been a Hebrew man in biblical Jerusalem. We shall see. Best, PS Happy July 4th to all patriots..","date":"2014-07-04","mins":"6:55 pm","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-135436","author":"angel","post":"Thanks Louis. No I’ve not tried Moshe Dayan, but I have found, with research, that men with de la Chapelle Syndrome are small in stature, as opposed to those with Kleinfelter Syndrome, who are tall and tend to have long arms and legs. Some men with Kleinfelter have no symptoms at all and other men have only a few of the symptoms. The man on the Shroud appears to have long arms and legs as well as being tall in stature, therefore, it is quite possible de la Chapelle Syndrome (video on this site) is a misdiagnosis for Kleinfelter Syndrome. Yet, I am not certain. Thanks again and happy July 4th. :) Best,.","date":"2014-07-05","mins":"1:54 am","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-134972","author":"angel","post":"Dear Colin, Wow! “Elemental bromine, sodium metal, nitrates, chlorates, concentrated acids etc.” You were lucky, Colin. When I had my own home lab, before I enrolled in chemistry, I added Logwood and acetic acid (vinegar) and one other compound to a test tube and heated it. The reaction mixture turned to a beautiful burgundy color and the entire test tube filled with golden threads. I actually thought I had synthesized gold. Yet, it was just some side product that had crystallized out as long golden needles. My chemistry professor, when I told him about my experiment and how I had synthesized gold, had a good laugh. Yet, after seeing so many accidents in the chemistry labs, as a result of someone heating a closed system, or instead of adding water to acid (dropwise and slowly), the person added acid to the water too quickly. I had a German professor that punched one of the male students in the back, when the student, in error, added 10 m L of concentrated hydrochloric acid to 100 m L of water as a bolus (all at once). The contents, from the heat of the reaction, splashed all over the lab table. Another time while working in the pharmaceutical industry, where many of the Phd chemists work in the labs until the wee hours of the morning alone, there was a death. One Phd working at night, with no one around, dropped an entire bottle of Methyl Iodide on the floor and proceeded to clean it up with either a sponge or paper towel. When the scientists came to work the next morning, they found him on the floor dead. Methyl Iodide alkylates all the amino groups on the DNA chain. Although my views are antithetical to yours, referencing the Shroud (I believe it is authentic), I wouldn’t want you to have an accident that could have been prevented. Just be careful. :) Best,.","date":"2014-07-02","mins":"8:40 pm","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-134915","author":"angel","post":"Colin, are you a chemist or biochemist? The reason I ask is your photo, detailing the melting of the polyethylene container, sends out a red flag. As a rule, polyethylene containers are used (when an ice bath is required) for the purpose of cooling down an exothermic reaction (in an Erlenmeyer flask) as an example. The flask, containing the heated reaction mixture is placed into either ice or dry ice that is held in the polythene dish (container). Pyrex is always used for reactions that give off heat (exothermic), especially when there is a chance of a runaway reaction. This appears to be the case in your photo, evidenced by the melted container. Yet, I’m not certain if you realize, polyethylene (polythene) also contains phthalates (plasticizers) that ameliorate the physical properties. When your polythene container melted, you actually inhaled a significant amount of the plasticizer and this is, in reality, is dangerous to your health. Http://www.reference.com/motif/science/are fumes from melted plastic poisonous See the following link. What Is Polyethylene? Quote. “Polyethylene is a type of polymer that is thermoplastic, meaning that it can be melted to a liquid and remolded as it returns to a solid state. Http://www.wisegeek.org/what is polyethylene.htm For future experiments, where heat is given off (exothermic), I would suggest purchasing a *Pyrex* container, especially if you are unaware there may be a chance of a runaway reaction. *Pyrex* is cheap enough on Amazon and is also sold at Walmart. Http://www.amazon.com/s/?ie=UTF8&keywords=amazon+pyrex&tag=mh0b 20&index=garden&hvadid=3480167995&ref=pd sl 5poey00se e You, more than likely, know this, and as is the case with chemists, may have just become careless. In all sincerity, I am concerned about your health, especially if you continue with future experiments. There is always a possibility of an out of control or runaway exothermic reaction occurring; therefore, go with *Pyrex.* Take care of yourself! Best,.","date":"2014-07-02","mins":"1:57 pm","url":"https://shroudstory.com/2014/06/28/colin-berry-has-some-preliminary-results/","cat":"image_theory","title":"Colin Berry has some preliminary results"},{"id":"comment-207627","author":"angel","post":"“Hence we have the following hypothesis. Both images were created by solar rays when and because the Shroud containing the body was exposed to the Sun, first face up, then face down (or the other way around” ***Angel says: No, unfortunately this could not have occurred. I mentioned this 2 step theory about a year ago, similar to getting a sunburn, first frontal area, then turning over where the rays hit the back and Hugh Carey gave an excellent reply that clearly detailed why this couldn’t have occurred. Hugh may be able to elaborate, but I recall him stating something to the effect, if the front part of the body was exposed to the sun, the frontal image would have appeared on the top half of the Shroud. Yet, if the body were turned over, where the back was exposed to the sun, then the dorsal image would also have appeared on the top half of the Shroud, because the sun’s rays would be hitting the back, not the front. If you are lying on your stomach, under the sun, your back will be sunburned, not your front. Both frontal and dorsal images would appear on the top half of the Shroud (like a double image) and nothing would appear on the bottom half of the Shroud. With that in mind, Jesus’ body had to have given off uv pulsed light (laser light) from both the front and rear of the body simultaneously. The only way this could have happened is if the body were suspended between the top and bottom sections of the cloth, like Isabel Piczek detailed in her “Event” Horizon theory. The other scenario for image formation is a Maillard reaction. Colin Berry has continued to trumpet an acid fumigation (rubbing) technique..","date":"2015-08-06","mins":"5:02 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207632","author":"angel","post":"Colin Berry says: “Miracles take a little longer (like putting the blood stains UNDER the body image – but rest assured – we have the technology).” ***Angel says: Blood stains under the body image is merely a confirmation of what occurred initially and then finally in the real life of Jesus. He was first beaten (scourged) – blood image on the Shroud and then He resurrected – Shroud’s body image The Shroud was meant to be an historical record for all of mankind, trumpeting the events in the order of their occurrence..","date":"2015-08-06","mins":"5:39 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207628","author":"angel","post":"Edit: Hugh Farey, not Carey. I’ve been watching Carey on TV for the last few days..","date":"2015-08-06","mins":"5:06 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207782","author":"angel","post":"I failed to include the alternate scenario and I believe this is the one that was outlined by Hugh Farey. If light was projected from the front of Jesus’ body, it would produce the frontal image on the top portion of the Shroud. Yet, if Jesus then turned over, the light emitted from the front of His body would produce the frontal image on the lower half of the Shroud. With that in mind, there would either be a double image on the top half of the Shroud, according to my first post or a frontal image on both the top and bottom halves of the Shroud as detailed by Hugh Farey. Either of the two scenarios mentioned; however, would not give both the desired frontal and dorsal images on the cloth..","date":"2015-08-08","mins":"9:23 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207766","author":"angel","post":"Colin, what you state, concerning science, is truth. Even accepted theories are disproven each day, as new technology is made available. Experimentation by dedicated scientists, such as yourself, will result in a series of failures, before success is finally achieved. So, don’t give up! Heck, if we didn’t have people like you, who continue on despite the setbacks, we’d still believe the world was flat. And either way, it will be of great reward to finally comprehend how the image was formed through a natural process. Thanks for claifying the fact you were not attempting to disprove the Shroud. :).","date":"2015-08-08","mins":"3:33 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207706","author":"angel","post":"Colin says: “Our quest is to understand a new and possibly previously unrecognized effect or phenomenon that the model might be revealing, one that may well be obscured initially by background “noise.” ***Angel says: Colin, your views are antithetical to many on this forum; however, as a scientist, you are performing exactly as you were trained. Proving or disproving an hypothesis is and has always been the scientific method. With that in mind, you should continue with your experimental research. Yet, as strongly as you wish to prove the Shroud is a fake, there are those of us (with an opposing view) that will work just as hard as you have done to prove it is authentic. Don’t give up though! In the end, the truth will prevail. Best,.","date":"2015-08-07","mins":"7:07 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207719","author":"angel","post":"Yes, Max, what you state is true. :) Imagine, those who trumpet the Shroud’s authenticity, with no one to argue with but themselves. Same holds true for atheists. At least there is an honest discourse, whether one believes in what the other side posits or not. We just can’t afford to be thin skinned..","date":"2015-08-07","mins":"8:35 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207769","author":"angel","post":"Paul says: “All I can say is must have been truckloads of linen cloths available in the 13th century.” ***Angel says: Have you found one such linen cloth with a 3:1 herringbone weave? Are you confident witht the C 14 dating results, as they related to the linen cloth? My belief is the C 14 dating WAS correct, but ONLY correct for the contaminated samples. Had the linen Shroud samples tested been pure, the cloth would have analyzed to the 1st century, rather than the 13th 14th centuries..","date":"2015-08-08","mins":"3:54 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-208277","author":"angel","post":"David Goulet says: “BTW, an image of the dead Christ imprinted in his own blood — now there’s a relic that would pack the house.” ***Angel says: What about an image of the dead Christ’s face imprinted in someone else’s blood? If the image was exact, including the reverse epsilon or blood “3” on the forehead, would that be convincing enough to prove the Shroud is, in fact, authentic?.","date":"2015-08-14","mins":"3:19 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-197784","author":"angel","post":"Hi Max, Great point! No forger would have known that fact. Who was found to be correct eventually, referencing the reason the thumbs turned inward, Barbet or Zugibe? http://www.crucifixion shroud.com/Barbet.htm Best,.","date":"2015-04-27","mins":"6:59 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197877","author":"angel","post":"Hi Max, Agreed! Both hypotheses seem plausible. As well, too much credit is given to the medieval artists/forgerers. There is no way any of them would have duplicated each of the flagrum wounds sustained by Christ on a painting. Artists, from the beginning of history, have never painted Christ’s wounds in such detail, but instead their paintings depicted only nail marks through the hands and feet. Even Da Vinci was not that thorough. And how would a medieval artist know to place AB blood type on both the Shroud and Sudarium? Quote from link: “This test is the starting point for all the others and the results are positive. Blood of the group AB is also very common in the Middle East and rare in Europe.” (Guscin, M., 1998). Http://theshroudofturin.blogspot.com/2011/03/re shroud blood types as ab aged blood.html Truth is no artist would know the information presented above and, for that reason alone, the Shroud (despite an erroneous C 14 dating) has a greater probability of being Christ’s authentic burial cloth than not. And AB positive blood type was found on both the Shroud and the Sudarium, each in a different location. How would a painter accomplish this? Further, according to the genetic studies done by Family Tree DNA on Jewish ancestry, two of the genetic markers on Jesus’ fragmented DNA (Garza Valdes), 150 T and 195 C indicate Jewish ancestry. Kelly Kearse would be more knowledgeable on the DNA. Yet, how would a painter/forgerer know this specific blood information in advance of his or her paiting? Best,.","date":"2015-04-28","mins":"4:08 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197888","author":"angel","post":"Louis says: April 28, 2015 at 4:25 pm Hi Angel, that is what I pointed out in a comment above, dated 26th, also providing the link: https://www.academia.edu/11804110/Is the Sudarium  April 28, 2015 at 4:25 pm Louis says: Hi Angel, that is what I pointed out in a comment above, dated 26th, also providing the link: https://www.academia.edu/11804110/Is the Sudarium of ***Angel says: Hi Louis. For some reason I can access your link, but there is no information included on the page. Perhaps this is a result of my dial up connection. Yes, there have been several others who have pointed out the relationship of AB blood on both the Sudarium and the Shroud. I just included it again. Yet, I was specifically referring to the genetic testing for Jewish ancestry (Family Tree DNA) by Dr. Doron Bahar of Haifa University, Israel. The DNA performed by Garza Valdes on the blood on the Shroud blood indicates Jesus had markers 150 T and 195 C. Does your comment address this question? I’ve not seen another post that referred to the haploid group or mutant genetic markers. Best,.","date":"2015-04-28","mins":"6:50 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197905","author":"angel","post":"Edit: Dr. Doron Behar, Hebrew University of Jerusalem, Haifa, Israel.","date":"2015-04-28","mins":"11:35 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197889","author":"angel","post":"PS Disregard my reply with your post duplicated. There is no edit button to make the correction..","date":"2015-04-28","mins":"6:54 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197890","author":"angel","post":"Louis, my mother had AB positive blood and when I attended Dr. Adler’s two seminars, back in the 80s, he was adament that the blood on the Shroud was AB negative. I’m still trying to figure out how AB negative has now become AB positive? Best,.","date":"2015-04-28","mins":"6:58 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197956","author":"angel","post":"Thanks, Louis, I appreciate your effort. :) Best,.","date":"2015-04-29","mins":"3:20 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197957","author":"angel","post":"Hi Hugh, Thank you for the link and the detailed explanation. :) I was hoping the genetic information Garza Valdes outlined would prove the man on the Shroud was not only Jewish, but that type AB blood originated with Jesus over 2000 years ago, as opposed to D’Adamo’s view that the AB blood type was introduced approximately 700 AD. Best,.","date":"2015-04-29","mins":"3:28 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-198040","author":"angel","post":"Hugh, I looked closely at the results on the link you provided in your post and what made little to no sense is there were about 3 or 4 haplogroups assigned to the Shroud blood and several subclades, as well. If I remember correctly there was an L haplogroup, a few Rs, and several Us. How is this possible? When mt DNA genetic testing is done, one haplogroup is assigned and with further testing, a subclade of that haplogroup is scientifically determined and finally the refined test, FTDNA, is performed giving the correct subclade for the haplogroup. In my case the first mt DNA testing (HVR1) placed me in the haplogroup K (Katrine clan), then a more detailed study, (HVR2), determined a subclade K1a3a and finally a refined study was performed (FTDNA) and that further detailed my subclade as being K1a3a1b. Notice all three results include the “K” haplogroup. Only one haplogroup (K) and not several. With that in mind, the Shroud man’s genetic test results (mt DNA) appear to be useless, since there are too many haplogroups that are assigned. There should only be one. Any explanation? :) Best,.","date":"2015-04-30","mins":"2:20 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-144408","author":"angel","post":"Another scenario. “The atheistic scientist declares to God that he can make a man and allows God to go first in the demonstration. God scoops up a handful of dirt and in a few minutes produces a perfect human being. The scientist then scoops up a handful of dirt, but God interrupts him: “Get your own dirt.” http://www.partialobserver.com/article.cfm?id=2808.","date":"2014-08-17","mins":"5:28 pm","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","title":"Scorched by God? A Hymn for this Sunday."},{"id":"comment-198098","author":"angel","post":"Hugh Farey May 1, 2015 at 9:41 am Not really my field, Angel, but I think a haplogroup is a non random collection of haplotypes, which are themselves non random collections of genes. I would guess that few people in the world are so “pure blooded” as to have only a single haplotype. I guess that when we are investigating the closeness of our relationship to somebody else, only a single haplotype need be investigated, as long as it is present in both people. Maybe somebody who knows what he is talking about could clarify? ***Angel says: Hi, Hugh. Thank you, but only one haplogroup is assigned to mt DNA (maternal line) and only one to YDNA (paternal line). I used my mt DNA K (Katrine clan) as an example. When you say we are closely related to other people, well that is true. In my case, K (Katrine) haplogroup is the daughter of U (Ursula), as an example. Therefore, my ancestors would go back beyond Katrine to Ursula’s line (U haplogroup) and Ursula’s line goes back to Africa (L haplogroup). All separated by thousands of years. Yet, these other groups, in my example Katrine, are pre Katrine. There is only one final haplogroup for the mother’s line and one for the father’s line. In my case, the ancestors of K are U and the ancestors of U are L, but I am not assigned to all three (K, U and L) , but only K. I suspect, since the DNA of Jesus (Shroud) was fragmented, the genetic scientists were unable to definitely determine His final haplogroup (FTDNA), and if one of His markers indicated Ursula (U) then U was included as a haplogroup, and if another of His markers indicated Africa, then L was included as a haplogroup and for this reason, there are both numerous haplogroups and subclades assigned to the TS mt DNA. Garza Valdez included mt DNA data only up to marker 263, where my refined mt DNA dat is in the multi thousands. As well, it matters not which genetic organization performs the DNA testing, all will give the same result for the final haplogroup and subclade. This link shows a photo of how everyone’s ancestors go back to Africa as well as the expansion times (years ago). Http://www.worldfamilies.net/mtdnahaporigins This is such an interesting field of study, but as a rule no one cares unless he/she has had his/her own personal DNA performed. There are even DNA forums, where people from each of the various haplogroups and subclades discuss their common ancestry (Vikings, Kazars, etc.). The price has come down a lot and many times these genetic testing companies have sales on their services. I paid separately for HVR1, HVR2 and finally FTDNA, but if anyone here chooses to have his or her DNA done, don’t pay separately for all three. Just pay a little more, when there is a sale, for the refined test (FTDNA). This test will include the other two. Kelly Kearse may be able to clarify the results on the TS DNA. Thanks again, Hugh. Best,.","date":"2015-05-01","mins":"4:34 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-206710","author":"angel","post":"Hi Dave, Good luck with your move to Central America. A friend of mine married a woman from El Salvador and moved there approximately five months ago. Last week I saw him at the juice bar and he informed me he had moved back to the U.S. No reason given. :) I’m fairly certain the connection to the Shroud image is related to the metal transition state superconductors. With the Bose Einstein condensates (BE Cs), superconductivity usually occurs at temperatures approaching absolute zero on the Kelvin scale. These are the low temperature superconductors. Now scientists have isolated high temp superconductors and recently room temperature superconductors (graphene). Please note, there is a difference between ionizing radiation (electron positron annihilation) and non ionizing radiation (laser light). Both forms of radiation are harmful I, since they are carcinogenic and can damage the DNA chain. However, laser light (small doses/pulses) can also be helpful too, since it is used to repair skin and/or eye damage. And while ionizing radiation is highly radioactive, non ionizing radiation is not, but there are other side effects. I did see something on the internet referencing DNA and holograms; however, there was nothing scientific to verify the findings. Keep up with your work on image formation. Anything is welcome after the Garlaschelli painting. Best,.","date":"2015-07-27","mins":"10:36 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206624","author":"angel","post":"Hi Dave, Yes, I also believed laser light could travel in any direction. The properties of laser light are quite different from that of ordinary white light. And it is known irradiation with a laser beam will disassociate Cooper pairs. Yet, I’m not 100% certain Hugh is incorrect, regarding holograms. I’m not a physicist and have just just recently began researching the Higgs Boson and superconductors in relation to the transition metals. Referencing DNA, I would think there is more of a relationship to bioluminescence in the human body and Cooper pairing. There is a publication online (pdf) titled “Fields in Electromagnetic Spectrum Emitted from Human Body:Applications in Medicine, Journal of Health, Medicine and Nursing, Volume 7, 2014 that highlights superconductors, Cooper pairing and bioluminescence. The only reason I continue to trumpet superconductors and Cooper pairs (transition metals) is there would be a relationship to levitation, antigravity, image formation and, as you state, possibly a hologram. Just a thought though. Best,.","date":"2015-07-26","mins":"7:32 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206570","author":"angel","post":"Hugh Carey says:… “but a a hologram relies on light coming from two directions in order to create an interference pattern, which is what a hologram is. One way of making a hologram is to have a single source, and the interference pattern is created by the reflection from the object coming back in the other direction. This requires a transparent film, which the Shroud is not.” ***Angel says: Hi, Hugh! Question” How about a double light source or light coming from two directions, highlighting the “Event Horizon theory of Dr. Isabel Piczek? If Jesus were suspended between the top and bottom halves of the linen, the front of His body would have emitted light vertically upward, producing the frontal image on the Shroud and the back of His body would have emitted light vertically downward, producing the dorsal image. Would there then have been a hologram created under such conditions?.","date":"2015-07-26","mins":"12:53 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206620","author":"angel","post":"Hugh Carey says: “Light does not travel vertically upwards or downwards.” ***Angel says: Thanks, Hugh. I comprehend the first part of your reply regarding holograms; however, with respect to light not traveling vertically upwards or downwards, I was referring to spin orbital coupling relating the transition metals. New research indicates the direction of light can be manipulated. See the following: Scientists have discovered a new fundamental property of light http://www.independent.co.uk/news/science/scientists have discovered fundamental property of light 150 years after maxwells famous theory 10367078.html Nanoparticles Allows Physicists to Select the Direction of Light http://scitechdaily.com/nanoparticles allows physicists select direction light/.","date":"2015-07-26","mins":"6:07 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-19167","author":"angel","post":"Daveb of wellington nz. Dave, with respect to the image formation on the TS, were the emission of biophotons (light) ruled out? Three excerpts from Philip Cunningham’s website: “The fact that the pixels don’t fluoresce suggests that the conversion to their now brittle dehydrated state occurred instantly and completely, so no partial products remain to be activated by the ultraviolet light. This suggests a quantum event where a finite amount of energy transferred abruptly. The fact that there are images front and back suggests the radiating particles were released along the gravity vector. The radiation pressure may also help explain why the blood was “lifted cleanly” from the body as it transformed to a resurrected state.” “If scientists want to find the source for the supernatural light which made the “3 D – photographic negative” image I suggest they look to the thousands of documented Near Death Experiences (NDE’s) in Judeo Christian cultures. It is in their testimonies that you will find mention of an indescribably bright ‘Light’ or ‘Being of Light’ who is always described as being of a much brighter intensity of light than the people had ever seen before. All people who have been in the presence of ‘The Being of Light’ while having a deep NDE have no doubt whatsoever that the ‘The Being of Light’ they were in the presence of is none other than ‘The Lord God Almighty’ of heaven and earth.” “It seems almost overwhelmingly apparent to me from the ‘scientific evidence’ we now have in hand that Christ literally ripped a hole in the finite entropic space time of this universe to reunite infinite God with finite man.” Best,.","date":"2012-11-17","mins":"10:03 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","title":"You shroudies and your fallacious thinking"},{"id":"comment-35058","author":"angel","post":"Angel says: Perhaps Jesus utilized anti gravity at the resurrection. The US Military has a fleet anti gravity spaceships, disk shaped and cigar shaped. That disappear. These have been mistaken by the public as UF Os. Excerpt: “The Lockheed X 22 A is equipped with Neutral Particle Beam directed energy weapons, that it is capable of effecting optical as well as radar invisibility, and that it is deployable for worldwide military operations.” Best,.","date":"2013-05-27","mins":"6:42 pm","url":"https://shroudstory.com/2013/05/23/resurrection-what-happens-with-quantum-entanglement/","cat":"science","title":"Resurrection:  What happens with quantum entanglement?"},{"id":"comment-35060","author":"angel","post":"PS Link to Lockheed X 22 A excerpt. Http://decryptedmatrix.tumblr.com/hidden technology Best,.","date":"2013-05-27","mins":"6:47 pm","url":"https://shroudstory.com/2013/05/23/resurrection-what-happens-with-quantum-entanglement/","cat":"science","title":"Resurrection:  What happens with quantum entanglement?"},{"id":"comment-177374","author":"angel","post":"Thanks, Hugh. Merry Christmas to you and your family. Best,.","date":"2014-12-17","mins":"7:14 pm","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"},{"id":"comment-177403","author":"angel","post":"Thibault HEIMBURGER says: “It means that the TS image has many properties similar to a light scorch but that it is not a light scorch.” ***Angel says: Perhaps there was a biochemical process going on inside the body of Jesus (due to oxidative stress) that formed organic or nitroxide free radicals and these were responsible for fluorescence quenching. This would explain why there was no fluorescence on the body image, while other areas of the Shroud fluoresced. Just a thought though. Merry Christmas and Happy New Year. Best,.","date":"2014-12-17","mins":"9:35 pm","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"},{"id":"comment-178517","author":"angel","post":"Thomas, and so was the death like state under which Jesus placed the guards, at the entrance to the sepulchre, as He exited the tomb. My belief is prophetic scripture is being fulfilled on a daily basis and we are currently living in the last days, prior to the second coming of Jesus or the end of the age. I wrote a poem, similar to “Now I Lay Me Down to Sleep“ that I repeat each night before going to bed. Hope you like it. For Yahoshua By Angel (board name) 2014 If tonight brings my last breath, where I am swept from life to death, guard my soul as it takes flight and lead it to eternal light. YA Hweh = YA Hoshua Alpha and Omega, the beginning and the end Merry Christmas to all on this forum. :).","date":"2014-12-22","mins":"5:33 pm","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"},{"id":"comment-177104","author":"angel","post":"Hugh, I have a question. Is it possible the linen itself may be contaminated and this impurity is the causal factor for the absence of fluorescence in the image area? This abnormality was found with #4 Whatman filter paper? My keyboard is not working, so I may be unable to respond. Quote from link: “Unfortunately, marked variations in fluorescence are often observed when identical chromatograms are run on sheets of No. 4 Whatman paper from different packets of papers or even on adjacent sheets from the same packet 4, and batches of papers are occasionally encountered on which no fluorescence at all can be observed at normal nitrogen levels.“ http://www.nature.com/nature/journal/v166/n4215/abs/166272a0.html At any rate, I shall take this opportunity to wish all of you and your families a very Merry Christmas and a wonderful and Happy New Year too. :).","date":"2014-12-16","mins":"8:42 pm","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"}]
