[{"id":"comment-34075","author":"angel","post":"Louis says: Delete the “if” in #94 as it helps to make things more clear. ***Angel says: My philosophy is the text is either correct or it’s incorrect. If there is even a word or a line that doesn’t make sense, although the majority of the text may be correct, I prefer to find the correct word or line or the omission, deletion or the insertion. What continually comes to mind is a statement Jesus made, “Seek and ye shall find.” This in no way means I am denouncing the Canon as truth, but some things just don’t add up. Genesis 1. Adam, Eve, Cain and Abel. Cain kills Abel. Therefore, there should have been three people left on earth at that time. With that in mind, how is it possible for Cain to go into the Land of Nod and take a wife? Where did she come from? These are the type of things that I question Best,.","date":"2013-05-19","mins":"7:03 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34010","author":"angel","post":"Jesterof, According to Rabbi Koniuchowsky “Wisdom is justified of Her Children, Luka 7:35 We have the Father, and the Son, but where’s Mom? In Jewish thought and literature, as well as in the nuances of the Hebrew language itself, is revealed an understanding of the personage and character of the Ruach Ha Kadosh that has for the most part been lost through translation and introduction of pagan influences into the assembly. Lost to everybody, that is, except the Jews and others learned in the Torah, and in the Hebrew language of Scripture. The Ruach is simply the femine manifestation of YHWH! Let’s begin by first stating that Hebrew, like many languages of the earth, contain both feminine and masculine tenses. The tense of the word determining the gender of the noun being described. For example, in Spanish “muchacho” means boy, and “muchacha” means girl. The “o” at the end of muchacho defining masculine tense, and the “a” at the end of muchacha defining feminine tense. In Hebrew, the word “Ruach” is feminine tense, assigning to the Spirit a feminine nature, character, gender. But when a tense (male or female) is in reference to a life form, then the tense is in reference to the “gender” of the life form. Since we know the Ruach to be a conscious, living being, the manifested power of YHWH capable of leading us, guiding us, and of instructing and teaching us in the Way of all truth; Yochanan 14:26, Luka 12;12; we can determine from the tense of the Hebrew and Aramaic words that the Ruach Ha Kadosh is feminine tense, and therefore, “female in gender. This point is entirely lost in the Greek which has no feminine tense for spirit, but only a neuter tense, which is why “Spirit” is always presented as a “He” in the Greek (neuter words are given male attributes in translation), which error has been erroneously transferred over into the English. In the Aramaic the word for Spirit is Feminine as well with the word Ruacha axwr, confirming the Hebrew understanding of the word Ruaah or …” ## I tried to include the link, but this site is not working. Research Who/What is the Ruach Ha Kodesh on your arms to Israel. Best, I.","date":"2013-05-19","mins":"12:15 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34078","author":"angel","post":"Jesterof, When was the first time you posted on this board? Have you posted anything two or three months ago? Just wondering! Best,.","date":"2013-05-19","mins":"7:11 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34076","author":"angel","post":"Louis, I see your point. Best,.","date":"2013-05-19","mins":"7:08 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34079","author":"angel","post":"Jesterof says: No, Jesus was not 4o, Jesus was 30 and for this reason the statement was made : ) ***Angel says: And you were there, of course. :) My question to you is if ancient sacred text that predates the Gospels is unearthed that proves the age of Jesus otherwise, what then will you say? :) As I’ve stated previously, what is known today is only as good as the next archaeological find. Best,.","date":"2013-05-19","mins":"7:15 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34052","author":"angel","post":"Jesterof says: Gospels were written also NOT in Hebrew, but Greek Koine. ***Angel says: The Aramaic Ruach is also feminine. Excerpt from the article – link below: “Part of the problem we have with the New Testament is that the one used by the Western Churches is a Greek translation of the original Hebrew, a language evolved within a pagan context as opposed to the Hebrew of the Old Testament which was, we believe, the original divine language and which evolved within the context of a divine theocracy (Israel). This means, in our opinion, that Hebrew is more precise and inspired than Greek. Moreover, we have good reason to believe that most, if not all, the New Testament was originally written in Hebrew and subsequently translated into Greek. Therefore in terms of defining the gender of the Holy Spirit, New Covenant Christians are more disposed to the Hebrew Old and New Testament witness of the Bible which overwhelmingly reveals the Holy Spirit to be feminine. English has three genders, masculine, feminine and neuter (i.e. He, she and it). Hebrew and Aramaic have no neuter gender. In Hebrew and Aramaic everything is either a “he” or a “she” and nothing is an “it”. Also gender plays a much more important role in Hebrew and in Aramaic than in English. In English gender is usually only an issue when dealing with pronouns. But in Hebrew and Aramaic nouns and verbs are also maculine or feminine. And while there are no true adjectives in Hebrew (nouns are also used as adjectives), noun modifiers must agree in gender with the noun. Now the Hebrew word RUACH (Aramaic RUCHA) is gramatically feminine as is the phrase Ruach ha Kodesh. This is matched by the rôle of the Ruach ha Kodesh as “comforter” (Jn.14 16) and the identifier of the “comforter” with YHWH acting as a “mother” (Is.66:13). It is very clear that the gender of the RUACH has been revised in many passages of the Aramaic to agree with the Hellenistic concept of the Holy Spirit as being either a he” or an “it”. Http://www.tektonics.org/qt/shespirit.html Best,.","date":"2013-05-19","mins":"2:45 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34073","author":"angel","post":"Jesterof, I believe you are missing the point of my statement. Just look at the two words spirit (soul) and ghost (apparition). During the transfiguration of Jesus, Simon thought he had seen a ghost (apparition). Jesus stated something to the effect, the spirit (soul) resides in each of us. Yet, the Greek uses both words, spirit and ghost, interchangeably. These words are synonymous in the Greek. There was no distinction between the two words in the Gospel. With respect to my other statement, where I believe Jesus was 40, I am aligning this to the Moses law, so to speak. Moses spent 40 days and nights on Mt. Sinai Moses spent 40 years in Midian tending his father in laws sheep Jesus was tempted of Satan 40 days and 40 nights The Israelis wandered in the desert 40 years During Noah’s flood it rained 40 days and 40 nights This is another reason I believe Jesus was 40 years old when He was crucified. And, I’m not trying to make this a great argument, and I am not disputing the entire Canon, I just have questions on a few translations. Best,.","date":"2013-05-19","mins":"6:38 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34239","author":"angel","post":"Jesterof says: And spirit is not the same as soul, I would assume in the hierarchy it is much higher than the soul. The word “soul” is a she in my native language but it does not mean that my compatriots perceive that the soul HAS gender and all the souls are female : ) ***Angel says: jesterof, when I was researching ghost (apparition) and spirit (soul), I had a little help from Jesus. I had a vision of Genesis, where the Holy Spirit was walking through the trees in the Garden of Eden. I saw a long grey, silky type skirt with an ivory/beige brocade detail around the waist band of the skirt, in the shape of a wide or elongated “V.” I was standing on the ground and I could see the Holy Spirit’s shoes and ankles and the hem of the skirt. I looked up so that I could see the face of the Holy Spirit, and no matter how far up I looked, I was never able to see the face. The waistband of the skirt was at sky level and I was standing on the ground. So, the upper part of the Holy Spirit was beyond the sky. Therefore, in my vision, the Holy Spirit was female. After this I made an attempt to find some scriptural verification of this fact. I could find nothing in the Canon, so I looked at “The Gospel of Philip” and I noticed one particular passage that verified what I had seen. Philip stated the following: “Those who believe Mary conceived by the Holy Spirit are in error. When did a woman ever conceive of a woman?” Therefore, I believe Jesus helped me to see the light, in this case, and the vision settled the fact the Holy Spirit was female, at least, to my mind. I was watching the Sunday morning talk shows a few weeks ago and one of the panel referred to the Holy Spirit as a “He,” and Cokie Roberts quickly corrected him by stating “She.” Therefore, word must be getting around in other circles, as well, the Holy Spirit is a “She.” Yet, I can see your point in regard to your mother tongue and the various languages you speak. Best,.","date":"2013-05-21","mins":"5:22 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34502","author":"angel","post":"Louis says: “The account in Genesis can not be taken literally, the Pentateuch is a composite document.” ***Angel says: Yes, I understand. I was told on the Jewish forum that Rashi stated the word “bara” in the Torah is the noun meaning “creating” as opposed to “created,” the verb. And this verse(Genesis 1) doesn’t teach an order of creation, but a point during the creation process, when the world was… Yet, I was not speaking of an order, per se, but rather the Holy Spirit is the female aspect of the Godhead. Best,.","date":"2013-05-23","mins":"3:40 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34243","author":"angel","post":"PS With that in mind, Mary, the mother of Jesus, was the virgin or the young maiden no power defiled. The seed that was placed inside Mary was the seed of God the Father and the Holy Spirit, the Mother (Light and Truth). These are the two powers. Mary was neither defiled by power #1 (God the Father) or power #2 (Holy Spirit, the Mother). These two powers are the same powers that formed the world in Genesis. Why do you think the world was lit, prior to the sun’s formation in Genesis?; Why? Power #1 God the Father. In the beginning God created the heaven and the earth and the earth was without form and void; and darkness was upon the face of the deep. Power #2 And the Spirit of God (Mother) moved upon the face of the waters. God said, “Let there be light” and there was light. So, the Light, which is the Holy Spirit was the light that lit the world. Power #1 and Power #2 are the same two powers that formed the seed inside Mary. Therefore, Jesus was formed of God the Father and the Holy Spirit, the Mother (truth and light) and that accounts for the divinity of Jesus. On the cross Jesus stated, “Woman this is you son.” Jesus did not state “Mother, this is your son.” Best,.","date":"2013-05-21","mins":"5:50 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34503","author":"angel","post":"Jesterof says: “I can not dispute with visions : )” ***Angel says: The statement was not meant to be a convenient way for me to show I alone am correct. I always believed the Holy Spirit was male. Yet, what I am stating concerning the vision is truth, and it wasn’t until I had the vision that I searched the scriptures for the Holy Spirit being the female aspect of the Godhead. Leoncio A. Garza Valdes did find female DNA in the blood on the Shroud of Turin, but this could also be attributed to those nuns who repaired the Shroud or some other female who handled the cloth. We’ll know for certain when Jesus returns. Best,.","date":"2013-05-23","mins":"4:14 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34527","author":"angel","post":"Jesterof, Yes, I understand your sentiment and except for my vision I would agree with you. What do you think the massive circular object, weighing approximately 60,000 tons, just found in the Sea of Galilee might be? Excerpt: “Yitzhak Paz, an archaeologist with the Israel Antiquities Authority who is involved in the project, said that based on sediment buildup, it is between 2,000 and 12,000 years old, a vast range that tells little about it. Based on other sites and artifacts found in the region, Paz places the site’s origin some time during the 3rd millennium B.C., or about 5,000 years ago, although he admits the timeframe is just a guess.” http://www.foxnews.com/science/2013/05/23/massive submerged structure stumps israeli archaeologists/ Best,.","date":"2013-05-23","mins":"7:48 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34530","author":"angel","post":"Jesterof, Just a thought! Have you considered the statements made by God in Genesis when you came to your conclusion? You claim humans have gender, but God does not, and if this is truth, why would God specifically use the words “image” and “likeness?” God in Genesis 1:26 ‘And God said, Let us make man in OUR image, after OUR likeness… Genesis 1:27 So God created man in his own image, in the image of God created he him, male and female created he them. Best,.","date":"2013-05-23","mins":"8:09 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34654","author":"angel","post":"Jesterof says: “Because God was referring not to the body but to the spirit in therms of Image and likeness. Spirits do not have gender as gendernis just there for procreation necessity. Spirits do not procreate, therefore they do not NEED gender” ***Angel says: “God’s purpose was procreation, where the male and female (Adam and Eve) were directed by God to populate the earth. (‘Be fruitful and multiply’). While God, the Father, is Energy, the Holy Spirit, the Mother, is Light, Jesus, the Son is representative of God’s intent on earth for mankind, the family unit. I am not stating God is a physical man and the Holy Spirit is a physical woman. My vision showed the Holy Spirit was the female aspect of God and this is why no matter how high up I looked, I was never able to see the upper half, or the face, of the Holy Spirit. The vision was meant only to show the Holy Spirit was the female aspect.” Excerpt: “GOD IS FEMALE TOO! There is a female aspect of God that has equal standing with the male aspect of God. God has many names and titles which, when understood, shed light upon His nature and also upon His purposes in creation. EL SHADDAI (fem.) is translated ‘Almighty God’ in most versions. The actual meaning of the Hebrew words, when translated, is THE MANY BREASTED ONE or THE FULL BREASTED ONE depicting the maternal ability to feed, succour and enfold each new life. By contrast, JAHWEH(or Jehovah) is the ‘Father Image’ and one can readily see the commanding figure that such a name produces as He gives His no nonsense directions, deals with enemies and also knows how to spank the wayward to bring them back into line! God made a spiritual man (Gen.1) out of Himself in the Image and Likeness of Himself. The Hebrew word for ‘image’ is masculine in gender, while the word for ‘likeness’ is feminine. When God formed man of the dust of the earth, he was made up of both male and female parts. This readily seen when God later separated these two parts. The Hebrew word TSELAH, translated rib’ in the KJV, actually means FLANK, SIDE, HALF. God brought Adam’s other half to him and declared,t hey shall be one flesh (Gen.2:24). . . No longer duality TSELAH flank has the same root meaning in Hebrew as does ‘image’. As God created male and female, He placed both soul and spirit in each human vessel. Thus we could put ‘image’ as the male — spirit and ‘likeness’ as the female — soul. God called their name Adam (Gen. 5:1). Adam later declared that Eve was bone of his bone and flesh of his flesh. If she was just a ‘rib’, then he could only have said, Bone of my bone.” http://www.godfire.net/rayknight/70 Male Female.pdf Therefore, when God created man in OUR image and OUR likeness He was referring to His male and female aspect, soul and spirit. And Adam and Eve (male and female) were representative of the “flesh” or body of mankind. As a result, male and female were created with the purpose of being representative of both soul and spirit (God, the Father, Holy Spirit, the Mother) and the flesh, the mortal body (Adam and Eve). Best,.","date":"2013-05-24","mins":"2:33 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34841","author":"angel","post":"Louis says: “There is absolutely no reason to interpret everything in the Bible as metaphor and the objection is against the fundamentalist approach, something like saying “Everything is true or nothing is true.” That is the biggest mistake and clashes with what we learn from science today, but not that science alone can determine what we can know about existence.” ***Angel says: “Louis, the bible contains symbolism and metaphor, but a significant portion is literal. The book of Daniel, as an example, contains prophetic metaphor and Revelation is purely symbolical. Jesus used the parables to insure the important points of His message were received and comprehended by even the least intelligent of His followers. And all people understood the “Ten Commandments” were the laws of God. As well, Jesus expanded on these laws with the two great commandments, ” Thou shalt love the Lord thy God with thy whole heart, and with thy whole soul, and with thy whole mind, and with thy whole strength” and”Love Thy Neighbor as Thyself” It matters not whether one is able to interpret the metaphor or symbolism that exists in many of the books of the bible, since following God’s commandments alone is what is required for mankind’s salvation and the eternal kingdom. If the entire world abided by the laws of God, there would be neither greed, corruption nor hatred and war. What Jesus visualized would finally come to fruition: heaven on earth. Louis says: “I have a lengthy six page interview on the Bible ( Finkelstein, Exodus, Wellhausen and JEDP, Albright, John P. Meier, Helmut Koester, Revelation and Inspiration in the Bible, Dead Sea Scrolls, Father Roland de Vaux, Geza Vermes, Father Émile Puech, Father Justin Taylor, Essenes, Qumran excavations, “Jesus family tomb,” the Messiah, Jesus of history/Christ of faith etc.) with one of the world’s foremost biblical scholars and hope to be able to post it soon.” ***Angel says: “I look forward to that post. Best,.","date":"2013-05-25","mins":"11:45 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34655","author":"angel","post":"Louis says: “The Bible was not dropped from heaven to be taken literally in everything that is stated, it was a slow development involving inspiration and revelation, myths, legends, history. Genesis shows how Mesopotamian myths crept into the text and therefore also how neigbouring nations influenced Hebrew culture.” ***I am not taking the entire Bible literally. For certain there have been omissions, deletions, insertions and presumptions, specifically by Pope Gregory, who propagated a theory Mary Magdalene was a prostitute, despite this not being recorded in either of the four Gospels. Yet, a major portion of the Bible is God’s word and was meant to be easily understood by the masses and taken literally. God would not have encrypted His word to mankind. And if the word of God was altered by man, God would still reveal his intent to those who follow Him, without doubt, through visions and dreams, as He did with Abraham, Daniel, Joseph and Moses. Jesus stated in Matthew 11:25, “I thank thee O Father, Lord of Heaven and Earth, because thou has hidden these things from the wise and prudent and hast revealed them unto babes.” Therefore, whether some or a majority of the Bible is metaphor, God will still reveal its meaning to the faithful through dreams and visions. Best,.","date":"2013-05-24","mins":"2:45 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33290","author":"angel","post":"Hi, Louis and thank you. Is it possible the two turtle doves offered by Jesus’ mother, Mary, covered Jesys’ Essene animal sacrifice, as well? Why would Pope Benedict XVI make this statement in the following article, dating back to 2007? Pope suggests link between Jesus and mysterious Essene sect “In addition, the pope said Thursday, Jesus celebrated Passover “without a lamb, as did the Essene community,” which did not sacrifice animals. “Instead of the lamb he offered himself, he offered his life,” Benedict added.” http://ejpress.org/article/15698 Best,.","date":"2013-05-08","mins":"9:54 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33286","author":"angel","post":"With respect to long hair, has anyone considered the possibility Jesus was a Nazarite from the Essene sect? See the Jewish encyclopedia article: http://www.jewishencyclopedia.com/articles/11395 nazarite As well, please note the following: Excerpt: “Munk says that the “Nazireate was an institution established before the laws of Musah.” This is evident; as we find this sect not only mentioned but minutely described in Numbers (chap. 6). In the commandment given in this chapter to Moses by the “Lord,” it is easy to recognize the rites and laws of the Priests of Adonis. The abstinence and purity strictly prescribed in both sects are identical. Both allowed their hair to grow long, as the Hindu cœnobites and fakirs do to this day, while other castes shave their hair and abstain on certain days from wine. The Prophet Elijah, a Nazarene, is described in II Kings and by Josephus as “a hairy man girt with a girdle of leather.” And John the Baptist and Jesus are both represented as wearing very long hair” http://www.wisdomworld.org/additional/christianity/Jesus A True Nazarene.html Best,.","date":"2013-05-08","mins":"7:56 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33350","author":"angel","post":"Hi! You may be correct, David. I haven’t researched the Essenes to any great length and thought, because of their purification/baptismal rituals, this may be a possibility. On the other hand, I have researched the birthday of Jesus. There is much evidence Jesus’ birthday was April 17th, 6 BC (BCE). See the ancient coin found and an explanation of the star/planet alignment on the link below: The Star of Bethlehem: The Legacy of the Magi http://www.eclipse.net/~molnar/ Remembering, Aries is the sign of the Ram and Jesus was the sacrificial lamb; therefore, there may be truth in this date. As well, this would place the age of Jesus at approximately 42 and the question to Jesus by the Pharisees “You are not yet 50 years old and you have seen Abraham?” would verify the age of Jesus as being in his 40s. Had Jesus been in his 30s, the Pharisees would have said, “You are not yet 40 years of age.” Even the facial image on the Shroud looks to be a man in his 40s, not 30s. What are your thoughts? Best,.","date":"2013-05-09","mins":"3:22 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33291","author":"angel","post":"Typo. 3rd line should read “covered Jesus’ Essene animal sacrifice….","date":"2013-05-08","mins":"9:55 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33450","author":"angel","post":"David, I tried to post this in the reply to your post, but was unable. I see your point, but with respect to Jesus’ age, I gathered this information from a site a few years ago, similar to the site I linked. Using historical data on the site I visited, the age of Jesus was calculated to be about 42 years. Here is an example, although this is not the site I saw originally. Yet, the man on the TS surely looks to be in his 40s, not 30s. Historical Data “The best way to date the death of Christ is to look for the key players in his death drama, about whom there is considerable information, and to establish the context surrounding Jesus’ death. We begin by acknowledging that Jesus’ death followed the death of John the Baptist, and occurred while Caiaphas*was High Priest and while Pilate*was Prefect. We*have reason to believe*that John the Baptist met his gruesome death in 35 A.D.*[1], Caiaphas was deposed by Lucius Vitellius, the legate of Syria, in 36 A.D. And Pilate was recalled to Rome at the end of 36 A.D [2]. Ipso facto, Jesus must have been crucified in the year 36 A.D. Having been born in 6 B.C. And having died in 36 A.D. Means that Jesus was in his 40s when he died, probably 42 years old. * The Gospel Record * Further proof that Jesus was in his 40s when he died comes directly from the Gospel of John. Jesus is discussing the destruction of the temple and he says: ‘Destroy this temple, and in 3 days I will raise it up.’ The Jews then said, ‘This temple has been under construction for 46 years, and you will raise it up in 3 days?’ But he was speaking of the temple of his body (John 2:20 21).’ John points out that later, when he is crucified, Jesus’ disciples remembered his prophecy of the 3 days; however, no one seems to recall the 46 years. Taken at his word, Jesus is clearly saying that he is 46 years old, and that when he dies, he will resurrect in 3 days. If Jesus was 46 years old when he died in 36 A.D., it means he was born in 10 B.C., which is theoretically possible, although 6 B.C. Is a more probable date. * We find further proof that Jesus is in his 40s from the Gospel of John. Jesus is in a Temple, close to the Mount of Olives, talking to the Scribes*and Pharisees. The subject turns to Abraham, and the ‘Jews’ ask Jesus: ‘You are not yet 50 years old, and have you seen Abraham? (8:57).’Jesus answers: ‘…before Abraham was, I am’, but the important thing to observe here is that the questioners describe Jesus as not yet being 50. Were he in his 20s or 30s, they would have chosen a different year, but by saying that he is not yet 50, they clearly identify him as being in his forties. * Other Christian Sources * The noted Christian Irenaeus*(130 202 A.D.) in Against Heresforc* �gainsins7�D.) ind have you inple of his bodeo old when he died. * All this evidence shows a significant divergence from the commonly accepted idea that Jesus was in his 30s when he died. All three methods indicate Jesus died in his 40s, between 42 and 46. It also suggests that Jesus’ ministry was significantly longer than the 1 to 3 bodeo that are traditionally attributed to it, because if he began his ministry when he was about 30, and he died between 42 and 46, his ministry was 12 or more years, not 1 or 3.” httpins//www.biblewheel.com/forum/showthread.phpin F1071 Date of Jesus Crucifixion Best..","date":"2013-05-10","mins":"7:05 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33561","author":"angel","post":"Thank you, Luis. There certainly is much to research. Luis says: “How is it that that there is no mention of the Essenes in the New Testament? Did Jesus know about the Essenes? To understand what Jesus thought about all this you must first understand why he hovers in the New Testament. That is the key to unlock the mystery.” ***Angel says: If, in fact, Melchizedek (Torah) and Jesus (NT) were one and the same, then there would be a relationship between Melchizedek and one of the orders of the Essenes. JESUS AS HIGH PRIEST IN THE LETTER TO THE HEBREWS http://www.mycrandall.ca/courses/ntintro/Melch8.htm There were several subgroups under the Essene umbrella. THE DIFFERENT BRANCHES OF THE ESSENES http://www.communityofpeace.net/Britxt/Bessenen.htm The Mandaean doctrine mandated short hair and Jesus wore His hair long. Would this be a form of rebellion to which the Mandaeans referred, in regard to Jesus? This group of Essenes rejected Jesus as the Messiah. Excerpt: “The Mandaeans, themselves hold the belief that both Yeshua (Jesus) and the Baptist were Nasurai, but that Yeshua (Jesus) was a rebel, who betrayed the secret Qabbalistic doctrines and made religion easier.” http://www.essene.com/B%27nai Amen/Essenes And Nasurai Mandaens.htm Whether or not Jesus was an Essene may be determined at some future point in time through archaeological digs. Best,.","date":"2013-05-12","mins":"2:26 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33563","author":"angel","post":"Louis says: “How is it that that there is no mention of the Essenes in the New Testament?” Angel says: “There was no mention of Mary Magdalene being a prostitute either, and yet she remains one to this day.” :) I left out the “o” in your name in the previous post. Please forgive me. Best,.","date":"2013-05-12","mins":"2:31 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33572","author":"angel","post":"Jesterof says: “The other logical mistake – from one saying “you are not yet 50 years old” does not the conclusion that he is in his 40s logically follow. The same might be said to somebody in his 30 and in his 20s as well – if the mark 50 has it’s own meaning. But it clearly can be told to the person in his 30s as to somebody in his early 40s as well – without any clear distinction.” ***Angel says: jesterof, I replied to your question, but I just found the results of the scientific analysis on the Shroud of Turin. Excerpt:. “The tradition of the Church and the results of scientific research affirm with the highest probability that the lifeless body impressed upon the linen of Turin is that of Jesus. In fact, the fabric reveals an adult man, about 40 years of age, strong, about six feet tall, who shows the marks of scourging and crucifixion and who was paid an honorific burial.” http://www.aleteia.org/en/article/who is the man of the shroud Best,.","date":"2013-05-12","mins":"7:05 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33557","author":"angel","post":"Jesterof says: “The other logical mistake – from one saying “you are not yet 50 years old” does not the conclusion that he is in his 40s logically follow. The same might be said to somebody in his 30 and in his 20s as well – if the mark 50 has it’s own meaning. But it clearly can be told to the person in his 30s as to somebody in his early 40s as well – without any clear distinction.” Angel says: “Firstly, I was not the author of the link article, but it is my belief Jesus was in his 40s. As well, Irenaeus ((2nd century – c. 202 CE), places the age of Jesus closer to 45. Here is an excerpt. “However in Demonstration (74) Irenaeus expressly states “For Herod the king of the Jews and Pontius Pilate, the governor of Claudius Caesar, came together and condemned Him to be crucified.”[13][14] which by two of the rulers presented would put the crucifixion between 42 and 44 CE making Jesus at least 45.” http://en.wikipedia.org/wiki/On the Detection and Overthrow of the So Called Gnosis As for the Shroud facial image, this is not the face of a 30 year old man. This is the face of a man in his 40s. Check out “google images” of the 40 year old Shane Shuyler, as an example. Best,.","date":"2013-05-12","mins":"1:10 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33571","author":"angel","post":"Louis says: “it does matter when we try to find out the relationship between Jesus and the Essenes. They are two very different things and one can, when dealing with the Essenes, be misled by Allegro or Wilson.” ***Angel says: What about Eisenman? Yet, we will not know with any degree of certainty if Jesus was affiliated with the Essenes, until the remaining translations of the Dead Sea Scrolls (over 400) are made available. Grant Jeffrey, with reference to Jesus and the Essenes, states the following: “The Crucified Messiah Scroll In 1991 the world was astonished to hear that one of the unpublished scrolls included incredible references to a “Messiah” who suffered crucifixion for the sins of men. The scroll was translated by Dr. Robert Eisenman, Professor of Middle East Religions of California State University. He declared, “The text is of the most far reaching significance because it shows that whatever group was responsible for these writings was operating in the same general scriptural and Messianic framework of early Christianity.” Although the original scroll team still claimed that there was no evidence about early Christianity in the unpublished scrolls, this new scroll totally contradicted their statements. This single scroll is earth shaking in its importance. As Dr. Norman Golb, Professor of Jewish History at the University of Chicago said, “It shows that contrary to what some of the editors said, there are lots of surprises in the scrolls, and this is one of them.” Geza Vermes, translator of “The Dead Sea Scrolls” has died at the age of 88. Hopefully, there are additional translators in the wings. Best,.","date":"2013-05-12","mins":"6:46 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33622","author":"angel","post":"Jesterof says: “The face on the Shroud can belong to ANY aged man – from 20 to 60 ***Angel says: Yet, not according to the scientific investigation. See below: EXCERPT “scientific research affirm with the highest probability that the lifeless body impressed upon the linen of Turin is that of Jesus. In fact, the fabric reveals an adult man, about 40 years of age…” http://www.aleteia.org/en/article/who is the man of the shroud Best,.","date":"2013-05-13","mins":"9:23 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33627","author":"angel","post":"Louis says: Angel Will you mind if I say you are on the wrong track? Robert Eisenman is not taken seriously by most DSS scholars, he was by the sensationalist writers Baigent and Leigh. The same can be said about Norman Golb, although he is serious, only his theory being flawed. I did learn about Geza Vermes. RIP. There were flaws in his translations and he, too, is controversial. Tell me what you feel about his scholarship and, depending what you say, I may have some news for you. ***Angel says: I never stated Eisenman’s deductions were set in stone. Perhaps I have not articulated my viewpoint thoroughly. My point is Melchizedek and Jesus (God in the flesh) were one and the same. And there is a connection between Melchizidek and the Essenes. Genesis 14:18,19 And Melchizekek, King of Salem, brought forth bread and wine, and he was the priest of the most high God. And he blessed him and said, “Blessed be Abram of the most high God, possessor of heaven and earth. In the following two scriptural verses Jesus states the following: John 8:56 “Your father Abraham rejoiced to see my day: and he saw it and was glad. John 8:58 “Jesus said unto them “Verily I say unto you, Before Abraham was, I AM. Now John 8:58 may very well be Jesus referring to His appearance as Melchizedek speaking to Abram. This statement Jesus made may be read “Before Abraham WAS….I AM” which is interpreted as before Abraham’s existence was I AM or before Abraham’s existance was God. Yet, the statement may also be read, “Before Abraham…. WAS I AM, which is interpreted by me to mean (standing before Abraham was I AM). And Melchizedek or God in the flesh was standing before Abraham. No matter which way the statement is interpreted, I read it as Melchizedek is God in the flesh. Jesus is also God in the flesh. And if there is an association of Melchiedek to the Essenes, there would also be an association of Jesus to the Essenes. I used Eisenman’s reference to verify, but there may be Essene sites that also verify this scenario. Just my opinion though. Best,.","date":"2013-05-13","mins":"10:45 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33727","author":"angel","post":"Jester says: “It is not my BELIEF. It is what is written in the Gospels. I tend to apply the Occam’s razor principle and not to split the hair in 4 parts in order to prove a dubious point – if it written Jesus was in his 30s, he WAS in his 30s. Shroud image in no way disputes that age meacham does not dispute the age ff 30 35 at all” ***Angel says: “WHERE is the TRUE birth date of Jesus written in the Gospels? Without ABSOLUTE truth, there is no way to determine the age of Jesus. Therefore, you may continue to believe Jesus was 30 and I will not falter from my belief that Jesus was approximately 40. Peace!.","date":"2013-05-15","mins":"7:13 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33630","author":"angel","post":"Jesterof : This is NOT a scientific investigation. This is an article in the internet, without ANT proof to it’s assumptions. Some of the information is supported by the known science, some is a total fiction. But it does not in any dimension provide any evidence, or scientific proof, that man in the Shroud is in his 40s. The man of the Shroud could as well be in his 20s as in his 60s. ****Angel says: The Authentication of the Turin Shroud: An Issue in Archaeological Epistemology by William Meacham – Archaeologist http://www.shroud.com/meacham2.htm Meacham gave a more varied age range for Jesus in his scientific article (30 45 years of age). Yet, if you are of the opinion Jesus was in his 20s or 30s, well, that is your belief. Best,.","date":"2013-05-13","mins":"11:14 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33821","author":"angel","post":"I posted my reply three times, but it is not showing up..","date":"2013-05-16","mins":"7:39 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33840","author":"angel","post":"****Angel says: “Agreed, Louis.” Best,.","date":"2013-05-16","mins":"9:57 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33824","author":"angel","post":"Jesterof says: “you can believe whatever you want, even in green UFO : )” ***Angel says: “Your statement is laughable, considering the Vatican’s binocular telescope (LUCIFER) located in Mount Graham Nevada, may be searching for not only distant stars, but alien life, as well. :) http://www.ecumenicalnews.com/article/vatican astronomers are searching for alien life say auhors 22068.","date":"2013-05-16","mins":"7:43 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33839","author":"angel","post":"Jesterof, I choose not to argue the point; however, Dr. Michael Molnar, Professor at Rutgers University, is considered credible. Http://partners.nytimes.com/library/national/science/122199sci archaeo jupiter.html Best,.","date":"2013-05-16","mins":"9:52 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33883","author":"angel","post":"Jesterof says: where does mid 40s come from, only Angel knows : ) ***Angel says: Never said mid 40s. I referenced an age of 42 (early 40s) and gave you a link to the research of Dr. Molnar, who is a Physicist and Astronomer. Yet, there is also the difference in the Gregorian calendar vs. The Jewish calendar. As has been noted: “The Gregorian calendar was an attempt to begin the new date (A.D.) based upon the year that Jesus was born. In the end, the calculation was incorrect by a number of years due to missed historical facts. It is now known that Herod the Great died in the year 4 B.C. Since he was alive when Jesus was born, that already puts Christ’s birth earlier than the year 4 B.C. And not A.D. 1. Furthermore, we also know from Matthew two that Jesus was two years old at the time the wisemen and Herod met. If we put these things together, we can determine that Jesus was born between 7 and 6 B.C., which is why the Gregorian calendar is off by that many years.” http://www.ariel.org/qna/qjewcal.htm?iframe=true& RECOVERED CUNIFORM SCRIPT “This leads to consideration of a series of prior astrological events that occurred in 7 BCE. Four copies of an ancient Babylonian astronomical text, written in 8 BCE in cuneiform script on clay tablets, have been recovered. This text predicts a triple conjunction of the planets, Jupiter and Saturn, in the constellation, Pisces, on what are now known as May 27, October 6 and December 1, 7 BCE. “The. . . Conjunction of 7 B.C.E. . . . Was special in that the planets met three times in succession in the same constellation. . . .” http://www.worldviewpublications.org/outlook/archive/article.php?EDITION=078 Further, regardless of which of these scholars makes a claim as to any type of authenticity on an hypoethesis or theory, the proof or truth remain ONE archaeological dig away. And unfortunately, without actual proof, nothing is set in stone. Yet, even though gnostic text has been excluded from the Canon, if an archaeological dig unearthed an ancient gnostic text that detailed the Shroud of Turin as originating in 1 BC, the fact it was gnostic scripture would be conveniently ignored and would be used as proof of the shroud’s authenticity. So, we choose whatever verifies our beliefs. Best,.","date":"2013-05-17","mins":"1:22 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33914","author":"angel","post":"Jesterof, The link I gave you was an alternate view on the age of Jesus. Yet, Jesus was born April 17, 6 BC and King Herod the Great died in 4 BC, which means Jesus (who was living with His family in Egypt) was two years old when Herod met his death. One of the scholars to which you refer, Dr. Martin, used the word “probably.” And “probably” is indicative of not being certain. You are actually quite funny and would make a great spokesman for the women’s anti aging campagne. Afterall, there would be no need for women to undergo a lifestyle lift, if one was able to view them through your lens. I’m still laughing. You would have no problem telling 40 year old women they were 30, regardless of whether or not their birth certificates indicated otherwise. :) At any rate, the age of Jesus saga is tantamount to beating a dead horse. You have your beliefs and are entitled to them, as do I. We’ll just wait for the next archaeological dig to confirm Jesus’ age either up or down. Best,.","date":"2013-05-17","mins":"10:50 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33986","author":"angel","post":"Louis says: Obviously it was a way of rounding up the age, 50 if Jesus was 30, and it could have been 100 if he was seventy. They were talking in terms of fifties and hundreds because the context was the reference to Abraham who had lived more than 2000 years earlier. If 50 was used, therefore, that was due to the fact that Jesus was below 50, not because he was in his forties. ***Angel says: “If” does not define truth or certainty, but merely speculation.” Best,.","date":"2013-05-18","mins":"8:19 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33985","author":"angel","post":"Patrick Hamon says: “Wrong. Ethnoculturally speaking, the sentence shall be read: “You are not old enough (to grow a white beard) to be fifty (i.e. To be a zaqen, Heb. For “a (white) beard” or “a wise man”. This is no “proof” at all they “clearly identify (Yeshua) as being in his forties”. ***Angel says: Well, fortunately, I have the “Jewish New Testament,” which is a translation by Jewish author, David H. Stern. The Jewish translation of the New Testament expresses its original and essential Jewishness. Yochanan (John) 8:57 is translated ” Why you’re not yet fifty years old,” the Judeans replied, “and you have seen Avraham?” Yeshua said to them, “Yes, indeed! Before Avraham came into being, I AM!” At this, they picked up stones to throw at him, but Yeshua was hidden and left the Temple grounds. As to your scholars, they continue to translate the “Holy Spirit” as a “he,” when in fact the Holy Spirit is a “she.” The Ruach Ha Kodesh is the female gender, and why the dove, which symbolizes the feminine was flying above Jesus when he was baptized by John. The statement, “This is my son, in whom I am well pleased” can be made by a mothe, as well as, a father. The Trinity (three separate or interchangeable entities under one Godhead) is comprised of a family unit (Father, Mother, Son). The Father (God) heads the family unit and the Mother is the Ruach Ha Kodesh (Holy Spirit). Yet, I choose not to continue arguing the point. You may believe as you will and I will continue to believe Jesus was approximately 40 years of age when He was crucified and that His birthday is April 17th, 6 BC. Peace!.","date":"2013-05-18","mins":"8:17 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33997","author":"angel","post":"Max, I stated Jesus was approximately 40 years of age when he expired and this was the reason the Pharisees made the 50 year old statement. Now, dependent on whether this recently translated 1,200 year old Coptic manuscript – clay tablet (The Pilate diaries) is authentic or not, it is stated Jesus was crucified in 43 AD. Http://www.dailymail.co.uk/sciencetech/article 2293301/Shape shifting Jesus spent supper Pontius Pilate claims just deciphered 1 200 year old Egyptian manuscript.html There are several links to this find, I just gave one. I’m not stating the manuscript is authentic, but it also correlates to the age I have determined Jesus to be. Regardless, the truth will eventually come to light as to the age of Jesus. Best,.","date":"2013-05-18","mins":"10:04 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34005","author":"angel","post":"Max Patrick Hamon says: To infer this is a “proof (sic)” they “clearly (sic) identify (Yeshua) as being in his forties (sic)” is to be totally ignorant of the Hebrew word nun, “fifty”, used in conjunction with the figure of a Second Temple period “Elder “. ***I am not inferring anything. Jesus was not 30, Jesus was 40 and for this reason the statement was made, “You are not yet 50 and you have seen Abraham?” You may, as I’ve stated previously, believe as you choose. The truth will be made manifest with new archaeological finds. As well, I am not asking you to believe Jesus was 40. I am stating that is my belief. Best,.","date":"2013-05-18","mins":"11:56 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-17127","author":"angel","post":"Louis, with current archaeology digs in the Middle East, additional “original” parchments may eventually be unearthed. The Isaiah scroll, found in the Dead Sea Caves is an example, not to mention The Nag Hammadi Library. I would venture to guess Syria and Saudi Arabia hold many archaeological treasures, yet the turmoil in that area prevents any type of exploration. The photo of Jabal al Lawz, the real Mt. Sinai found by Ron Wyatt in Saudi Arabia, certainly looks authentic, with respect to being the mountain on which God descended to give Moses the Ten Commandments. The scorched, blackened area on the top of the mountain appears to verify biblical history and Moses. Ron Wyatt was arrested and held captive by the Saudis for crossing over into their land to take photos. This story appeared on American TV. Have you seen the images on google? Best,.","date":"2012-10-01","mins":"12:43 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17171","author":"angel","post":"Thank you, Ron. Sounds extremely interesting and informative; yet, I hope it’s not a video. I’m unable to watch them on my computer. Best,.","date":"2012-10-02","mins":"7:17 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17060","author":"angel","post":"And be aware the statement Ice Angel made concerning the sandals, “[I]t’s like somebody finding a pair of shoes or sandal that date back as far as 1260 AD and 1390 AD, and taking long trips to see these sacred shoes and praying over them ! I have nothing but respect for all religions but this cloth thing is way too much! is a subliminal message referring to the date ascribed to the Shroud by Tite and others, claiming it to be a fake (1260 to 1390 AD). Doesn’t Ice Angel comprehend the linen cloth belonged to Joseph of Arimathea, a wealthy man who purchased it for his own burial? More than likely Joseph traveled to Egypt to obtain this particularly expensive 3:1 herringbone weave. Just look at an image of the Caiphas ossuary. Notice how detailed this box is compared to others of the same time period. Both Joseph of Armathea and Caiphas were wealthy and bought what was equivalent to today’s “Designer” labels..","date":"2012-09-29","mins":"1:17 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17061","author":"angel","post":"PS. The Caiphas ossuary is the family ossuary, so Caiphas himself, more than likely, did not purchase the box, but rather his family did. This ossuary has been authenticated, as well..","date":"2012-09-29","mins":"2:37 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17070","author":"angel","post":"Louis, the belief system of the time, concerning some Sadducees, is not surprising. More than likely many of the Jews held such beliefs. Weren’t Judaism and Christianity influenced originally by Zoroastrianism and Mithraism? And later in time, Paulian doctrine appears to incorporate a certain amount of Gnosticism. Doesn’t Gnosticism predate Christianity? I recall one of Paul’s statements, “I will give you a mystery.” To my mind, this sounds as though Paul had some Gnostic beliefs, as well..","date":"2012-09-29","mins":"9:25 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17068","author":"angel","post":"Daveb wrote: “There is a quaint irony in the Caiaphas family ossuary, in that Caiaphas was a Saducee who did not believe in the general resurrection of the body. The ossuary custom arose in late Judaism because of the development of a resurrection doctrine among the Pharasaic sect from about 200 BC. Did Caiaphas come to believe that there might be something in the doctrine after all? There are apocryphal writings suggesting that he may have done. Or was his family merely following the current social custom? The ossuaries of Simon of Cyrene and his two sons have also been found. The ossuary custom abruptly terminated in 70 AD folowing the Roman destruction of Jerusalem.” ***I am not current on the beliefs of Caiaphas, but the ossuary is certainly an original and the etchings, as compared to other ossuaries of the time, make it appear to be a very costly item. I’ve not seen the Simon of Cyrene ossuary, and will check it out on google images. Thanks for the information. Have you figured out what these strange “V” shaped markings, found in the City of David, represent? I had a dream with all types of Hebrew, Greek or Latin symbols, similar to those on the link. Two symbols I can recall from the dream were an upside down V and an upside down V with a line under it, similar to the Hebrew Patach. Http://www.biblicalarchaeology.org/daily/biblical sites places/jerusalem/what are these strange markings found near jerusalem%E2%80%99s gihon spring/ Best,.","date":"2012-09-29","mins":"8:51 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-36397","author":"angel","post":"Barrie, I sent you something toward the cost. Best,.","date":"2013-06-07","mins":"4:27 pm","url":"https://shroudstory.com/2013/06/04/the-high-price-of-success-at-stera/","cat":"kelly_kearse","title":"The High Price Of Success at STERA"},{"id":"comment-46731","author":"angel","post":"Max, how was it possible for the 9th c. CE miniaturist to know Jesus was beaten by TWO MEN, since this only became evident when the TS was subjected to medical forensics, performed by the Pathologist on the STURP team?.","date":"2013-10-09","mins":"11:12 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-36418","author":"angel","post":"You’re welcome, Barrie! If every person who visited this site, your Shroud of Turin site and the various other Shroud sites donated a measly dollar, you’d have more than enough. I can almost hear Jesus stating, “You honor me with your lips, but your heart is far from me.”: Best,.","date":"2013-06-08","mins":"12:50 am","url":"https://shroudstory.com/2013/06/04/the-high-price-of-success-at-stera/","cat":"kelly_kearse","title":"The High Price Of Success at STERA"},{"id":"comment-199361","author":"angel","post":"Louis, if an artist from the Middle Ages produced the Shroud image on linen, according to Colin’s Nitric Acid fumigation method, then he/she would had to have used Cypress Vitriol, Salt Peter and Alum, since Nitric Acid (Glauber’s Salt) was not in existence in the 1500s (Glauber was born 1604 AD) A brief history follows: Aqua Regina (Royal Water) discovered by a Persian, Jabir ibn Hayyan (born in Persia c. 721). He distilled Cyprus vitriol, a pound and a half of Saltpetre, and a quarter of a pound of alum. He was the first to write about the synthesis of Nitric Acid. Interesting that Hayyan states, if this mixture is reacted with sal ammoniac, it will dissolve gold, silver and sulphur.” Dutch Chemist, Johann Rudolf Glauber (1604 1670) distilled sulfuric acid and salt peter to make Nitric Acid and he called it “Glaubers Salt.” Vitriol is one of or a combination of three chemicals: copper, iron or zinc sulfate … http://nitricacidlc.weebly.com/history.html Yet, the fact Vitriol contains iron would certainly have produced a sepia or reddish color on linen. Interesting Vitriol is used for etching as well. Check out Rembrandt’s self portrait, 1620 AD. :) Etching The Intaglio Printing Process http://www.csun.edu/~lmp99402/Chemistry Art/Etching/Etching.html Best,.","date":"2015-05-17","mins":"2:34 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","title":"Yannick Clément on Colin Berry’s Latest Hypothesis"}]
