[{"id":"comment-196871","author":"angel","post":"William, with the new scientific data provided by Professor Giulio Fanti, dating the Shroud to the time of Jesus, Christians are now beginning to believe in the authenticity of the Shroud of Turin and many are of the opinion it not only proves the resurrection of Jesus, but that He left an historical record of the brutal beating He endured for the sins of mankind. This sacred cloth, although held by the Catholic church, was deliberately left behind for all mankind to see, regardless of their religious denomination. The Shroud is merely a record of truth that Jesus did exist and experienced all the brutality depicted in the Gospel accounts, despite what non believers may say. No worshipping or idolizing is necessary. Below is a quote from a Christian site: “To state my own convictions and background, unless and until the weight of scientific evidence proves otherwise, I will remain convinced that the image on the shroud was left behind when the body of Jesus Christ was raised from the dead. And though I am a Baptist pastor and the son of a Baptist pastor, and though the shroud may presently rest in a Catholic cathedral, this relic – if genuine – is catholic in the larger sense of the word: of universal Christian significance. Http://thechristians.com/?q=node/198 Best,.","date":"2015-04-19","mins":"10:44 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196972","author":"angel","post":"Hugh, I enjoyed your counter argument, although (like Whanger), I believe in the Shroud’s authenticity. You did succeed in trumpeting a few salient points, against the authenticity of the Shroud, giving believers something to contemplate. Yes, with such an analytical mind, you should definitely be working for Scotland Yard. :) Best,.","date":"2015-04-20","mins":"4:51 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-197100","author":"angel","post":"Elaine Pagels (Christian scholar from Princeton) in her book “Beyond Belief,” referencing the dates for the gospel accounts, wrote the following: “In 64 C.E a great fire devastated Rome. The Gospel of Mark, written around this time, makes it clear that Mark’s faith community may have suffered…” “Matthew written (about 75 C.E.), then roughly ten years later, Luke’s (about 85 C.E.).” “The Gospel of John, probably written between 90 and 120 C.E…” http://www.extremelysmart.com/yankee/03i beyond%20belief.php.","date":"2015-04-21","mins":"6:51 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196950","author":"angel","post":"William’s reply to Sampath Fernando. April 20, 2015 at 9:18 am –Sampath, all one needs to do is read the biblical account from the eyewitnesses. The description of the burial clothes of Jesus is nothing like the shroud. That is all the investigation I need. ***Angel says: William, the biblical account to which you refer also mentions the head cloth (napkin) was placed in an area by itself. Considering the head napkin in the Gospel account, John 20: 5 7, is the Sudarium of Oviedo and the blood on both the Sudarium and the Shroud are type AB and the blood spots on the two cloths align exactly, if the Sudarium (head napkin) is true, then the Shroud is as well. The science performed on both the Sudarium and the Shroud verify both cloths covered the same man. Best,.","date":"2015-04-20","mins":"2:43 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-86426","author":"angel","post":"Mike, I agree, especially since the first picture of the Hungarian Pray Codex depicts the body image of Jesus with the right hand over the left with both thumbs missing, exactly as that displayed on the Turin Shroud. The second drawing of the manuscript details the unusual weave that is representative of the 3:1 herringbone linen twill on the Shroud. Thomas De Wesselow, who has written a wonderful book titled “The Sign,” stated the Pray Manuscript was produced 1192 1195 AD and this certainly predates the C 14 result obtained from the three labs (1260 – 1390 AD). Best,.","date":"2014-03-09","mins":"12:32 am","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-86370","author":"angel","post":"The Shroud is authentic! Thus far, the most important scientific evidence for the erroneous C 14 date is the absence of vanillin. Since the Shroud has lost ALL its vanillin, then obviously it is over 1,300 years of age. With that in mind, the reported C 14 dating of the Shroud (13 14th century) cannot possibly be correct, leading one to conclude the testing samples acquired by the three labs were contaminated in some manner or form. The only way to obtain a correct C 14 date is with a pure sample of the linen. Best,.","date":"2014-03-08","mins":"9:34 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-143152","author":"angel","post":"David Goulet says: “With the right experts, advanced instrumentation and protocols a non destructive examination may find the smoking gun both sides of the debate are looking for.” Angel says: Question: Has the Shroud been subjected to this method of microscopy? 4 D multiple cathode ultrafast electron microscopy Best,.","date":"2014-08-09","mins":"6:57 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-87527","author":"angel","post":"Hi Hugh, Thomas De Wesselow’s book, “The Sign,” (P. 111 112) gives a detailed description of the scientific tests for lignin (lignin produces vanillin) that were performed by Ray Rogers and Stanley Kosiewicz of Los Alamos National Laboratory. What was stated (quoting from De Wesselow’s book) is the Shroud contains no vanillin and was calculated by Rogers that in order to lose 95% of its vanillin, a piece of linen would have to be 1,319 years old, if stored at 25 degrees C and the same piece of linen would be 3,095 years of age, if it was stored at 20 degrees C. The conclusion was the Shroud is unlikely to date from after 700 AD, since it is vanillin free and that the Shroud is more than 1,300 years of age and may very well have been produced in 1st century Judaea, like cloth found with the Dead Sea Scrolls. “The Sign,” by Thomas De Wesselow is extremely informative and a great read; similar to Ian Wilson’s, “The Shroud of Turin.” Best, Tamara.","date":"2014-03-11","mins":"9:20 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-143270","author":"angel","post":"David Mo, you stated, ” Is the “invisible mending” visible with a microscope handled by experts. Flury Lemberg said yes.” Angel says: My point is why not use the new 4 D multiple cathode ultrafast electron microscope to scan the entire Shroud? This is a non destructive technique that would not damage the Shroud. If this procedure were followed, researchers would be able to see the “clean” areas of the cloth and would be able to take a small sample from one of those uncontaminated sections for C 14 dating. Of course, that is under the assumption the linen is Thymol free. Best,.","date":"2014-08-10","mins":"5:29 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"}]
