[{"id":"comment-206302","author":"angel","post":"God in the flesh (Jesus) appeared to Abraham as Melchizidek (High Priest) in the Old Testament. Abraham made a tithe to Melchizedek and the tithe was passed down the line from father to son. Melchizedek blessed Abraham, as Jesus did with the disciples (bread and wine). Http://www.cgg.org/index.cfm/fuseaction/Library.sr/CT/HWA/k/745/Mystery Melchizedek Solved.htm God in the flesh (Jesus) of the Old Testament appeared to Abraham at Mamre, prior to destroying Sodom and Gomorrah. If you recall, there were three men in the OT who visited Abraham, two were angels, who went ahead to save Lot and his family and the third man was God in the flesh (Jesus) who continued on to destroy Sodom and Gomorrah. Yes, it is for these reasons, when Jesus was questioned by the Phaisees and they stated to Him, “You are not yet 50 years of age and you have seen Abraham?” Jesus replied, “Before Abraham was, I AM.” “I AM” not only references the name of God (I AM that I AM) in the Old Testament, but Jesus’ reply to the Pharisees, “Before Abraham was, I AM” can also be read as, standing before Abraham…was I AM. The Jews may not have considered Jesus as the suffering servant in Isaiah 53, but the passage represented both the suffering servant and Jesus’ fulfillment of the suffering servant. For this reason Jesus cleaned the disciples feet, making the statement to the disciples that He was here as a servant, not a master. Prophecy (OT) and Fulfillment (NT) What was prophesied in the Old Testament was fulfilled by Jesus in the New Testament. God in the flesh (Jesus) was there from the beginning (OT) and He will be here at the end (NT). This fact was verified by the statement Jesus made, “I am alpha and omega, the beginning and the end.”.","date":"2015-07-21","mins":"9:21 pm","url":"https://shroudstory.com/2015/07/17/a-reflection-on-the-shroud-and-zechariah/","cat":"article","title":"A Reflection on the Shroud and Zechariah"},{"id":"comment-206346","author":"angel","post":"There are prophecies in the Old Testament (aside from Isaiah 53) that predict Jesus as the Messiah. If Isaiah 53 referred to a suffering servant or Israel, how would these scriptures apply? – Born of a Virgin – Born in Bethlehem – He will come out of Bethlehem and be called Mighty God, Everelasting Father, Prince of Peace – Micah 5:2 – Pierced my hands and feet, cast lots for my garments – Psalm 22: 16 18 – Riding into Jerusalem on a donkey – Zechariah 9:9 – Daniel’s 70, 7s prophecy (Daniel 9: 24 27) predicted the exact date Jesus would be cut off. Http://www.jesusplusnothing.com/studies/online/Daniel9c.htm Best,.","date":"2015-07-22","mins":"8:08 pm","url":"https://shroudstory.com/2015/07/17/a-reflection-on-the-shroud-and-zechariah/","cat":"article","title":"A Reflection on the Shroud and Zechariah"},{"id":"comment-198099","author":"angel","post":"Colin, you’re doing an excellent job in your attempt to reproduce the Shroud image chemically, using scientific methodology. This is a difficult project and you are to be congratulated. Good luck! Best,.","date":"2015-05-01","mins":"4:50 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198314","author":"angel","post":"You’re welcome, Colin. Wish I could accept your posters; however, I just shredded 20 years of pharmaceutical research notes. I’ve no more room in my condo for papers and books. Take care! :) Best,.","date":"2015-05-04","mins":"6:46 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-208461","author":"angel","post":"Hugh Farey says: Feel free? Isabel Piczek is not a scientist. John Jackson is a scientist. Joseph Accetta is a scientist. Colin Berry is a scientist. Daveb is not a scientist. Ray Rogers’s was a scientist. Luigi Garlaschelli is a scientist. Paolo di Lazzaro is a scientist. ***Angel says: Although I am not a regular on this board, I am a retired research and development chemist. I have performed pioneer research on non depolarizing neuromuscular blocking drugs (those that relax or paralyze skeletal muscle). I’ve also worked in a particle accelerator or cyclotron (Hot Cell) on positron emitters like Fluorine 18; specifically 2 fluorodeoxyglucose (2 FDG), used for Positron Emission Tomography (PET scanning). I’ve researched and developed Nitric Oxide Synthase (NOS)inhibitors and have synthesized novel and innovative compounds in the therapeutic areas of diabetes and osteoporosis. My research involved the presentation of posters at National Chemistry Seminars and I am published in peer reviewed scientific journals, such as, Tetrahedron Letters, Journal of Organic Chemistry and Synlett. Further, I hold a U.S. Patent for a cancer antiemetic. Why do you state Isabel Piczek is not a scientist? Isn’t she a particle physicist?.","date":"2015-08-17","mins":"10:43 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208514","author":"angel","post":"Gracias, Carlos. Back in the 50s and 60s, I was able to speak and write spanish fluently, but I have been away from it for too many decades and, as a result, I have forgotten many words. In fact, too many to respond with a meaningful paragraph. Comprende espanol un poquiito, pero no mucho. I believe I am interpreting your reply to be verifying the history of Jesus through Pilate, Tiberias, Flavius Josephus, etc. There are some sources you quote that are considered by today’s scholars to be either forgeries or later Christian additions to the text. See the link: Josephus on Jesus – Wikipedia, the free encyclopedia … includes two references to the biblical Jesus Christ in Books … (meaning the testimony of Flavius … to be a total forgery, the majority of modern scholars … en.wikipedia.org/wiki/Josephus on Jesus Although I thank you for such an extensive post on the history of Jesus, I am unable to give you a comprehensive reply in Spanish, nor do I know for certain the texts you have quoted are considered to be legitimate sources of information or later Christian additions. Thank you, Carlos..","date":"2015-08-18","mins":"2:53 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208502","author":"angel","post":"Thank you, Hugh, for such a detailed explanation. I’m not as qualified as you guys. I don’t hold a Ph D and as a matter of fact, I only have 6 graduate credits toward my Master’s Degree. I had to drop out of the graduate program when my mother was diagnosed with breast cancer, followed by my father’s liver cancer. Yet, I’ve achieved quite a bit for someone who didn’t have a Ph D, like Colin or you. I was in line for another patent on a neuromuscular blocking drug, but our company was sold, prior to patent issue. That really hurt, since I had worked on that particular compound for such a long period of time, in an effort to reduce the duration of the drug. Although Colin’s experiments may seem ridiculous to a person not familiar with scientific technique, all avenues leading to image formation on the Shroud must be explored and for this reason alone, I give credit to and appreciate the effort Colin Berry has expended, referencing his research methodology. I may be incorrect, but I seem to recall either a documentary or a DVD on the “Event Horizon” that introduced Isabel Piczek as both an artist and a particle physicist. When I posted this information on an Amazon atheist site, in defence of the Shroud and Jesus, as God, all the scientists on that forum informed me Isabel Piczek was not a physicist, since they had thoroughly researched her background. As well these scientists asked me to link them to Isabel’s university credentials. I couldn’t find that specific information on the internet. Those scientists, who are atheists, can be extremely brutal at times and even today, they not only refer to the Shroud as the MIT (Magic Italian Tablecloth) but they trumpeti the work of Garlaschelli. And since they don’t believe Jesus existed at all (there’s no historical record) they have come to the conclusion the entire biblical story was merely fantasy. It’s hurtful for a true believer to read such negative comments, concerning Jesus. For this reason I am hoping scientists will either find some archaeological evidence for His existence or perform a novel type of scientific test on the Shroud that proves, without a doubt, the linen cloth dates to the first century. Regarding non scientists, my belief is anyone is capable of presenting an hypothesis that eventually proves fruitful, in respect to the image on the Shroud. It really matters not whether he or she is a scientist or not. :).","date":"2015-08-18","mins":"11:35 am","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208579","author":"angel","post":"Doc Andy, I appreciate the information you have included in your post; however, I need something that is completely factual, with no ambiquity or possible Christian insertions into the text that is proof positive and serves as an historical record of Jesus’ existence. The links provided by Carlos will be thoroughly investigated. :) Thanks again!.","date":"2015-08-19","mins":"1:15 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208578","author":"angel","post":"Louis says: “Although most people are unaware of it… in all probability this extra biblical evidence not only provides evidence of Jesus’ existence, but, as I shall try to show, includes a number of salient facts about his life that confirm the basic outlines of the four canonical Gospels.” For more on biblical studies: https://www.academia.edu/4700001/What do we know about ***Angel says: Thanks, Louis. I was including what was being disputed by atheists. I could find no information on the historicity of Jesus, one way or another. Best,.","date":"2015-08-19","mins":"12:59 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208504","author":"angel","post":"Daveb, I knew your training included science, judging from your exceptionally detailed replies, deductive reasoning and excellent analyses of the various topics, pertaining to the Shroud. I love reading your posts. :).","date":"2015-08-18","mins":"11:45 am","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208505","author":"angel","post":"Yes, Hugh, daveb is a scientist and judging from his replies, a darned good one as well. :).","date":"2015-08-18","mins":"11:57 am","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208581","author":"angel","post":"Daveb, I knew you were a scientist from the start,since I clearly recall on one of your posts (possibly on another thread) you mentioned you were an Engineer. During my years in chemistry, I worked with many engineers, (including chemical engineers) and they were always considered scientists. Best,.","date":"2015-08-19","mins":"1:37 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-197787","author":"angel","post":"Yeah, but they changed the shape of his face from long and narrow to oval as a young man. John Kerry’s face is long and narrow and it was long and narrow when he was young. Go to Google images and type in John Kerry, age 20 You will see the shape of his face was the same as a young man. He’s now 71. Best,.","date":"2015-04-27","mins":"7:18 pm","url":"https://shroudstory.com/2015/04/27/computer-generated-young-jesus-from-image-on-shroud/","cat":"press_coverage","title":"Computer Generated Young Jesus From Image on Shroud"},{"id":"comment-198055","author":"angel","post":"Jim, Akiane Kramarik is as talented as Isabel Piczek. Yet, the image to which you refer (painting at age 8) reminds me more of a Brad Pit type photo…too handsome. If Isaiah 53 references Jesus, the Shroud image would be more representative than Akiane’s painting. Isaiah 53:2 King James Bible “For he shall grow up before him as a tender plant, and as a root out of a dry ground: he hath no form nor comeliness; and when we shall see him, there is no beauty that we should desire him.” I showed the Shroud facial image to two five year old little girls and only asked one question of them, “Who is this man?” The first little girl said “George Washington” and the second girl (who was Latino) said Jesus. Therefore, I will equate George Washington to the Isaiah 53 verse, “…and when we shall see him, there is no beauty that we should desire him.” This is only my opinion. :) Best,.","date":"2015-04-30","mins":"8:07 pm","url":"https://shroudstory.com/2015/04/27/computer-generated-young-jesus-from-image-on-shroud/","cat":"press_coverage","title":"Computer Generated Young Jesus From Image on Shroud"},{"id":"comment-198056","author":"angel","post":"Edit: girl = Latina.","date":"2015-04-30","mins":"8:09 pm","url":"https://shroudstory.com/2015/04/27/computer-generated-young-jesus-from-image-on-shroud/","cat":"press_coverage","title":"Computer Generated Young Jesus From Image on Shroud"},{"id":"comment-198057","author":"angel","post":"Edit: Oops, Brad Pitt.","date":"2015-04-30","mins":"8:14 pm","url":"https://shroudstory.com/2015/04/27/computer-generated-young-jesus-from-image-on-shroud/","cat":"press_coverage","title":"Computer Generated Young Jesus From Image on Shroud"},{"id":"comment-197603","author":"angel","post":"Hugh, but you are aware Avinoam Danin has expertise in the grains and flowers of Jerusalem and would have been able to distinguish between those grown in Israel and those grown in South America or East Asia. Some of the plants bloom only at Passover in Jerusalem as you well know. See numbers 3 5 Flowers of the Shroud of Turin http://www.patheos.com/blogs/prayergardens/2014/04/flowers of the shroud of turin 2/ Best,.","date":"2015-04-25","mins":"9:58 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197604","author":"angel","post":"You speak the truth. When will people wise up? Joe Nickell (self proclaimed atheist with a heart) is using the psychology of Joseph Goebbels. “If you tell a big lie often enough and keep repeating it, people will eventually come to believe it.” Best,.","date":"2015-04-25","mins":"10:20 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197112","author":"angel","post":"You are correct, Paul. This is referred to as Taqiyya and Kitman http://www.thereligionofpeace.com/Quran/011 taqiyya.htm.","date":"2015-04-21","mins":"9:21 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-197237","author":"angel","post":"Louis April 22, 2015 at 9:40 am “Hi Angel Actually the problem has gone beyond ISIL and is getting worse as each day goes by. Read this:” http://www.pakistanchristianpost.com/ and this: http://www.archdioceseofbombay.org/ This is extremely serious. ***Angel says: Yes, Louis it is deadly serious, but remember, as well, there today, here tomorrow. What I find to be exceedingly abominable is Christians neither destroy the holy places of other religious groups, nor the historical holy artifacts held within. Yet, the prophecies trumpeting the end of the age are being fulfilled on a daily basis. And what exists currently (on a global scale) are only the forces of evil, greed and corruption. If others, aside from Christians, would practice the command laid down by Jesus: “Do unto others as you would have them do unto you,” light would surely outweigh the darkness. Take care, Louis! Best,.","date":"2015-04-22","mins":"5:43 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-197245","author":"angel","post":"***Angel says: Hi Hugh, I stated, others, aside from Christians. Meant to mean, other religious groups should do unto Christians, as Christians do unto them. In short, we Christians do not desecrate their mosques or temples and they should not damage our holy sites. Best,.","date":"2015-04-22","mins":"6:27 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-197338","author":"angel","post":"Louis, I do not mean revenge. What I stated is the Muslims should place themselves in the shoes of Christians and realize or understand we show love and respect for their religion and they should do the same with regard to ours. This is mutual respect and an example of both groups following the Golden Rule. Treat others as you would like to be treated. :) Best,.","date":"2015-04-23","mins":"3:49 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-197246","author":"angel","post":"Hugh, Oh, I see how it reads now. Initially, I had the last paragraph directly under the paragraph you quoted, and I switched it before posting. Previously: What I find to be exceedingly abominable is Christians neither destroy the holy places of other religious groups, nor the historical holy artifacts held within. If others, aside from Christians, would practice the command laid down by Jesus: “Do unto others as you would have them do unto you,” light would surely outweigh the darkness. Funny! Best,.","date":"2015-04-22","mins":"6:33 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-197354","author":"angel","post":"Sadly, that is the case Louis. Best,.","date":"2015-04-23","mins":"5:55 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-197452","author":"angel","post":"Hi Hugh, Yes, my point was if everyone, regardless of their religious beliefs, followed the Golden Rule posited by Jesus, we would not have chaos and unrest in the world. And that would equate to heaven on earth. Correct? :) Best,.","date":"2015-04-24","mins":"6:23 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-197599","author":"angel","post":"That will never happen Louis, since the powers that be desire a one world religion. Last I heard it was referred to as Chrislam..","date":"2015-04-25","mins":"9:00 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-197101","author":"angel","post":"John Klotz says: “The story is this: a group of Moslems visited the current exposition of the Shroud in Turin as a gesture of unity of all humanity.” See https://shroudstory.com/2015/04/21/the imams who came to see the shroud/ ***Angel says: Nah! The story referred to the group as “Muslims.” Wouldn’t want J.K. Rowling to be angry with you, as she was with the Rupert Murdoch tweet with his use of the word “Moslems. Just kidding with you. :) Why J.K. Rowling is so incensed about Rupert Murdoch’s tweet about ‘Moslems’ http://www.washingtonpost.com/news/morning mix/wp/2015/01/12/why j k rowling is so incensed about rupert murdochs tweet about moslems/.","date":"2015-04-21","mins":"7:21 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-197113","author":"angel","post":"Yes, Louis, blasphemy is considered to be a crime in the Muslim religion, but the act, in my belief, does not equate to chopping off the head of the perpetrator. Quite the opposite with Christianity. When Jesus is defamed, many of the so called Christians are tongueless. Turn the other cheek, I would imagine. The artwork of Andres Serrano’s Christ is an abomination; yet, it is considered avant garde by much of today’s society. Best,.","date":"2015-04-21","mins":"9:44 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-199139","author":"angel","post":"Colin Berry says: “If that’s Nicodemus, then note that he’s not carrying a “winding sheet” or 100lbs of aloes etc. They would have been delivered to the tomb, and used (probably) after J of A’s linen had been removed for final cleaning of the body, application of spices, ointments etc. ***Angel says: Funny! According to the artist’s rendition, Jesus’ body was not in need of a cleaning. Notice no blood, not even in the location of the nail mark on the right foot or the piercing mark from the Roman sword on His right side. There is also no blood on the face from the crown of thorns..","date":"2015-05-14","mins":"10:57 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-199225","author":"angel","post":"Colin Berry says: “…they did not need to be reminded of it each time they viewed devotional art…” ***Angel says: I wonder why, Colin? Guilt, perhaps! Yet, what you have posited may have been the case for artists, but not so for man, in general. Since Jesus died for the sins of mankind, we should always be reminded of the extent of the brutality Jesus experienced for our salvation (including the wounds and their flow of blood). This is the reality of His death, enabling us to more fully comprehend repentance. What comes to mind are the following scriptures: Zechariah 12:10 “…and they shall look upon me whom they have pierced…” John 19:37 “…They shall look on him whom they pierced.” Rev 1:7 “…and every eye shall see Him, and they also which pierced Him…” The paintings send the subliminal message, Christ’s suffering wasn’t as horrific as has been detailed in the Gospel accounts.. As well, Colin, I know you are an atheist, but I am merely giving an alternate perspective from the Christian viewpoint. There is one other thing I fail to understand. After reading other Gospel accounts (aside from the Canon) the view was a wreath of gold was to be placed upon saintly heads, rather than a halo, as is usually depicted. A wreath sits atop the head, where a halo is positioned high above the head. Yet, I have never seen a wreath of gold on any of the paintings. Wonder why? Maybe this is another that falls under the category “Give to Caesar what is Caesar’s and to God, what is God’s. :) Take care! Best,.","date":"2015-05-15","mins":"2:20 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-199378","author":"angel","post":"Hugh Farey says: :Here’s something new. We are often told that the ‘crown’ of thorns was cap like rather than a circlet, as if this gave some credence to the antiquity of the Shroud. Does anyone know what a 1st century crown looked like? Is there a coin with a picture of Herod, or Pilate, or anyone, with a crown on? Or a sculpture? Anybody?…” ***Angel says: Hi, Hugh! Try Julius Caesar with – “Laurel Wreath Crown.” Check out the image. Http://theweddingtiara.com/archives/julius ceasar and emperor napoleon laurel leaf crowns Best,.","date":"2015-05-17","mins":"8:32 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-199380","author":"angel","post":"Max patric Hamon says: “Yeshu’a, after his resurrection, is High Priest “after the order of Melchizedek” in other words he is a Sage par excellence.” ***Angel says: And there are some who say He WAS Melchizedek (God in the flesh), who visited Abraham on the desert and blessed him. Some also say He WAS the God in the flesh, who appeared before Abraham and Sarah at Mamre. Three men visited, two went on to save Lot and his family and the 3rd (God in the flesh) destroyed Sodom and Gomorrah. And then there was God in the flesh, Yeshu’a (Yahoshua). All three men were God in the flesh. Seems logical, alpha and omega, the beginning and the end. :) Best,.","date":"2015-05-17","mins":"8:48 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-199474","author":"angel","post":"Hi Max, Yes, I am familiar with the scriptures you have mentioned in the New Testament. I was referencing the Old Testament and speaking more along the lines of what was included in Genesis 14:18 20, Psalm 110, and the Dead Sea Scroll (11 Q13, Column 2). See the Dead Sea Scroll entry on the link below: http://www.ad2004.com/Biblecodes/Hebrewmatrix/melchizedek.html.","date":"2015-05-18","mins":"7:25 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-128288","author":"angel","post":"Walid, I’m certain you are correct, but until there is another scientific method of Carbon 14 dating the Shroud to the 1st century, most people (especially scientists) will adhere to the “Shroud is a fake from the Middle Ages” theory. Regarding the Shroud image, there are many atheists who believe the cloth wrapped the tortured body of Jacques de Molay. And with reference to your life, I have listened to you numerous times on the Micahel Savage radio talk show (99.7 FM). There have been many instances, when you’ve exposed the real Muslim agenda to the American audience, that I have actually feared for your life. Take care of yourself, Walid. Best,.","date":"2014-06-10","mins":"5:36 pm","url":"https://shroudstory.com/2014/06/09/walid-shoebat-on-the-shroud-of-turin/","cat":"article","title":"Walid Shoebat on the Shroud of Turin"},{"id":"comment-16884","author":"angel","post":"You’re welcome, Louis. Professor Bovon must have been thoroughly humiliated. Imagine the countless hours of writing, proof reading (both draft and final copy), and then the time consumed in preparation for the interview. Unfortunately, “shock value,” is a marketing ploy, often used by the media to increase ratings. The documentary producers may either mislead, edit out, sensationalize or take words out of context to increase viewership. The feelings of others don’t even enter into the equation, because it’s a business (nothing personal) and producers know with certainty, Ratings = Money..","date":"2012-09-24","mins":"10:47 pm","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-16962","author":"angel","post":"Louis, the documentary is a skeleton in a locked closet now and those producers hold the key. If Proressor Bovon was to present something on that subject in the future, the documentary that caused him so much pain would suddenly emerge, opening, once again, an old wound. Unfortunately that’s the nature of the media business..","date":"2012-09-26","mins":"8:46 pm","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-16968","author":"angel","post":"Yannick, what you state is true. We all live in corruptible bodies on this earth, but even with our corruptible bodies, we should still be able to choose between God and money. A condensed version of what Jesus stated on this subject is we are all given the choice to worship either God or mammon. Yet, we should never fail to remember, the one we choose becomes our God. When Jesus made the remark, “Give to Caesar what is Caesar’s and to God what is God’s, I believe He was stating, we should use money to pay bills, taxes, etc., but we should call on the name of God the Father for or food, clothing, shelter and other necessities. Jesus confirmed this when He spoke, concerning the clothing of the lilies of the field. This statement signifies God the Father, if asked, will take care of our basic needs (food, clothing, shelter). And, didn’t God drop manna (bread) and quails (meat) from heaven to the Israeli children in the desert? Therefore, God will providesto those who ask and believe..","date":"2012-09-26","mins":"9:59 pm","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-16964","author":"angel","post":"Dave, this detailed discussion is excellent. And note too, those who have wealth desire more and more money. Enough is never enough! I’ve found many, not all, who have excessive wealth tend to be extremely arrogant; refusing to humble themselves before God. Yet, God demands humility. Those that denounce God, by not obeying His laws or denying His existence, do this only to rationalize their own bad behavior. Therefore, I believe arrogance (lack of humility) is also a sin in the eyes of God. When Job questioned God, as if God was his equal, God replied, “Where were you when I laid the foundation of the earth?”.","date":"2012-09-26","mins":"9:26 pm","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-16998","author":"angel","post":"Yes, Yannick, Jesus certainly stated something similar to “There are none righteous; no not one,” and Isaiah 64:6 states, “All our righteousnesses are as filthy rags…” Perhaps Jesus wants us to continuously reflect on his statement, “You honor me with your lips, but your heart is far from me.” ..","date":"2012-09-27","mins":"5:47 pm","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-17100","author":"angel","post":"Yannick stated: On the spiritual level, this statement of Christ applied to ALL and EVERY ONE of us ! We’re ALL spitirually sick (meaning sinners). It’s like the lost sheep or the prodigal son. On the spiritual level, we’re ALL this lost sheep and we’re ALL this prodigal son. ***Yes, we are all sinners and none of us are righteous, but we are NOT lost sheep. We’ve heard the word of God and we may either keep it or denounce it. Of the 99 sheep, only one was lost. So, those in the most remote places of the world may be considered lost, since they have not been exposed to the Gospel of Jesus. You are not lost, because you have heard His word. Why did Jesus state to the Pharisees, “You did not recognize the time of your visitation?” Jesus made this statement, because the Pharisees had seen the miracles Jesus worked and still denounced Him. Since no one in the world is righteous and all of us have sinned, we are to repent and ask forgiveness for our sins. This was preached by not only John the Baptist, but Jesus and His disciples, as well. The majority of us are NOT lost. We know Jesus’ preachings and we know what we must do when we have sinned. The choice is ours alone. The determining factors, concerning the Kingdom, center on humility and arrogance, love and hate, money worship and spiritual worship. Those who denounce Jesus and His message, worship money over God and are greedy and hateful are labeled cursed and arrogant. Those who are lowly in heart, poor in spirit, love their neighbor and follow Jesus’ words (as sheep follow the shepherd), are considered blessed and humble. There is a difference in the two, like the thieves on the cross. If it were not so, there would be no reason for Jesus to separate the sheep from the goats. For we’d all be sheep. Best,.","date":"2012-09-30","mins":"11:59 pm","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-17101","author":"angel","post":"PS. We have ALL sinned, but we will NOT all be saved. One the Day of Harvest, there will be a separation of wheat and chaff..","date":"2012-10-01","mins":"12:07 am","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-17102","author":"angel","post":"There’s no edit button, but it shoud read “On” and not “One.”.","date":"2012-10-01","mins":"12:09 am","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-16804","author":"angel","post":"Joe stated: “First of all, Matthew and Mark do mention a sindon. Secondly, since Jews were traditionally interred with burial clothes, is he trying to convince us that Jesus was buried without any burial cloths in order that his interpretation carries weight? Apparently so, which is just downright stupid.” Angel replied: Pilate washed his hands, so the blood of Jesus would not fall upon him. Pilate did not believe Jesus was worthy of death and ordered the sign “King of the Jews” be placed on the cross. The Jews were adamently opposed to this sign, yet Pilate, in direct opposition to the Jews stated, “What I have written, I have written.” With this in mind, Pilate released the body of Jesus to Joseph of Arimathea, the rich man, with knowledge that Jesus would have a proper burial. As to the comments on the burial clothes of Jesus, I believe in the “Word of God,” but have found mistranslations, in a few New Testament scriptures that were translated from the original Hebrew, Greek and Latin into English. Just recently, I purchased a copy of “The Jewish New Testament” (Translation by David H. Stern), where the original Jewishness is clearly expressed within its pages. In this New Testament Jewish translation, the versions of Matthew, Mark, Luke and John, concerning the linen and how the body was wrapped are detailed. The first two books, Matthew and Mark show the following: Matthew: 27: 57 59 “wrapped it in a clean linen sheet. Mark: 15: 45 46 “he wrapped him in a linen sheet. (referring to Joseph) ***Yet, both versions, Matthew and Mark, fail to mention the “linen sheet” upon the disciples’ entrance into the tomb after the resurrection. Luke and John read as follows: Luke: 23:53 “wrapped it in a linen sheet. (referring to Joseph) John: 19:40 “wrapped it up in linen sheets.” (referring to Joseph and Nicodemus) After the resurrection, on entering the tomb, Luke: 24:12 Stooping down, he saw only the burial clothes. (referring to Peter) John: 20:5 The other disciple outran Peter and reached the tomb first. Stooping down, he saw the linen burial sheets lying there, but did not go in. In conclusion, Luke’s version started with a linen sheet (singular) and ended with burial clothes (plural). And John’s version started with wrapped in linen sheets and ended with linen burial sheets. Yet three books, Matthew, Mark and Luke clearly indicate Jesus was initially wrapped in a single linen sheet (sindone). And the burial clothes (plural) in Luke, after the resurrection, may refer to the single linen sheet and head napkin. This would account for the plural (burial clothes) outlined in Luke. Obviously, according to the Hebrew translation, Jesus was given a traditional burial..","date":"2012-09-23","mins":"3:06 pm","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-16873","author":"angel","post":"Louis, I agree with you. An excerpt from your referenced article follows: “King’s announcement about the fragment, which she called the Gospel of Jesus’s Wife, came after the school released details in advance to The New York Times and The Boston Globe, which gave the story prominent play. The Smithsonian Channel is planning to debut a program about it at end of the month. Text on the papyrus fragment, written in the language of early Egyptian Christians, records Jesus referring to a woman, Mary, as “my wife,” and later saying, “She can be my disciple.” ***Even if the papyrus was authentic, the translation never mentioned which of the Marys was his wife. Jesus also loved Mary of Bethany, the sister of Lazarus, and there were three Marys at the cross; Mary the Mother, Mary wife of Clopas and Mary Magdalene. By eliminating Mary the mother and Mary the wife of Clopas, only Mary Magdalene and Mary of Bethany remain. Jesus loved both of the remaining two Marys. Why are people assuming the wife in the papyrus was Mary Magdalene and not Mary of Bethany? This is how falsehoods originate. Look at the article link below and the assumption Mary Magdalene was the wife of Jesus although Magdalene is mentioned nowhere in the papyrus translation. Jesus was married! ‘Proof’ God spoke to his wife and Mary … http://www.dailymail.co.uk/news/article 2205235/Jesus married Proof God... A recently uncovered fragment of ancient papyrus makes the explosive suggestion that Jesus and Mary Magdalene were man and wife, … This is why it is important, with respect to scripture, to check, double check and look to other sources, as well..","date":"2012-09-24","mins":"2:54 pm","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-16969","author":"angel","post":"Darla, you may want to view Ron Wyatt’s summary with pictures, and how he believes Jesus is positioned at the right hand of God. Here’s an excerpt from the link below. “The temple in Jerusalem was situated on the north part of the city. Judgments of God’s people would come from the north, e.g., Babylon attacking Jerusalem, the future prophecy of Ezekiel 9 of angels coming to slaughter also come from the north. “He comes from the north as golden splendor; with God is awesome majesty” Job 37:22. Ron Wyatt has said that the blood of animals is on the right side of the ark, as you face it, and the blood of Jesus is on the left. It has been theorized that Jesus, in the sanctuary in heaven which is spoken of in Hebrews, is standing behind the Ark with His blood in front of him and with God next to Him. This would place Jesus on the right hand of God.” http://www.arkdiscovery.com/aoc tabernacle diagram.htm.","date":"2012-09-26","mins":"10:23 pm","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-147590","author":"angel","post":"Are holograms unreliable, as well? Two quotes from article: “One of the important steps in producing the holograms is the conversion of the 2 D grayscale information in the body image of the Enrie photographs to 3 D. This is possible because we know that the grayscale in the image contains distance information, which is normally not found in photographs.” “Observing the images of plants in the same locations on photographs produced by different photographic techniques and on the linen of the Shroud itself proves that they are real and not artifacts created by one photographic method or another.” Shroud of Turin in 3 D Prof. Avinoam Danin HOLES” IN THE 3 D IMAGE OF THE BODY ON THE SHROUD http://shroud3d.com/findings/prof avinoam danin Best,.","date":"2014-08-31","mins":"4:35 pm","url":"https://shroudstory.com/2014/08/30/emanuela-marinelli-fantacies-non-existent-objects/","cat":"books","title":"Emanuela Marinelli: Fantacies! Non Existent Objects"},{"id":"comment-21567","author":"angel","post":"Louis, this is off topic, but I wonder if the connection that Jesus = Melchizedek was noted anywhere on this site. I could find no reference in the search section. Read these scriptures and then Hebrews 7 1 28. Then check the link for more detail. Gen 12:7 The Lord appeared unto Abram Gen 14: 18 Melchizedek King of Salem brought forth bread and wine and he was the priest of the most High God. Gen 14:19 And he blessed and said “Blessed be Abram of the most high God, possessor of heaven and earth Psalms 110:4 The Lord hath sworn and will not repent. Thou are a priest for ever after the order of Melchizedek. Psalms 110:5 The Lord at thy right hand shall strike through kings in the day of his wrath Hebrews 7:1 28 Details exactly Jesus is Melchizedek. Explained more thoroughly on the following link. Http://www.cgg.org/index.cfm/fuseaction/Library.sr/CT/HWA/k/745/Mystery Melchizedek Solved.htm Therefore, Jesus is Alpha and Omega, the beginning and the ending.","date":"2013-01-03","mins":"6:26 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-21576","author":"angel","post":"Thanks, Louis. One thing to note about Melchizedek, there is no genealogy found anywhere in scripture. Melchizedek simply appears and then disappears. And since Melchizedek appeared in the first few chapters of Genesis, surely his genealogy would have been included. If you have an interest the link below details how Melchizedek has no genealogy and is greater than Levy and finally, he (Jesus, Melchizedek), is the high priest. This article also indicates the new priesthood implies a new law, guaranteed by an oath. Therefore, Jesus did not have to fulfill the Hebrew prophecy of being from the Aaronic tribe of Levy, as he is a priest after the order of Melchizedek. He is King of Kings. Http://www.gci.org/bible/hebrews7.","date":"2013-01-03","mins":"10:16 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-21406","author":"angel","post":"John Klotz wrote: Furthermore, we now are in possession of intrinsic data from coin imprints, dating the cloth to around 30 AD.” ***Hi and Happy New Year! John, would you please give me a link, so that I may access the information concerning the 30 AD date. Thanking you in advance.. Best,.","date":"2012-12-31","mins":"7:27 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-36825","author":"angel","post":"Daveb of wellington nz, On a serious note, I admire your knowledge and enjoy all your posts, but couldn’t resist the “hearts” remark. I was just joking with you. Best,.","date":"2013-06-12","mins":"9:13 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?"},{"id":"comment-36752","author":"angel","post":"Oh, you guys are so funny! What immediately comes to mind is each man views an object through his or her own lens. I, on the other hand, see a series of “hearts” and perhaps they were placed on the Shroud to symbolize Jesus’ great commandment, “Love thy neighbor as thyself.” :) Best,.","date":"2013-06-12","mins":"12:26 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?"},{"id":"comment-36826","author":"angel","post":"Max, I’m not underestimating your knowledge on the subject. My mother, throughout my life, always stated I was contrary and I suppose I am to a certain extent. When I saw the “L” statement, I just had to comment, but “I see hearts” was only a joke. :) Yet, when I have a strong belief on a particular subject, my viewpoint will, in fact, be antithetical to those of others and I will fight to the death to defend it. My nature too. Best,.","date":"2013-06-12","mins":"9:47 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?"},{"id":"comment-34658","author":"angel","post":"We’ve been waiting for approximately one year. My belief is Francesca Saracino may be able to persuade “Trinity Broadcasting Network (TBN)” to run the documentary on one of their TV channels here in the US. As well, TBN has opened a massive structure, similar to Disneyland, called “The Holy Land Experience” in Orlando, Florida, complete with a reconstruction of the Temple and many other biblical sites. Check out the link and look at it on google images. Http://www.holylandexperience.com/ Surely this Christian conglomeration would run Francesca’s DVD. Best,.","date":"2013-05-24","mins":"3:17 pm","url":"https://shroudstory.com/2013/05/23/the-night-of-the-shroud-to-air-on-italian-television/","cat":"video","title":"The Night of the Shroud to Air on Italian Television"}]
