[{"id":"comment-212512","author":"hugh_farey","post":"That’s not the point I was wondering about. I was wondering what the evidence was of any foreign textile being used in Judea at the time. It is easy to say what might have been, but it is more convincing if we could say that it was common, or even occasional, rather than the Shroud being the sole example. If so it be..","date":"2015-10-14","mins":"5:24 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212561","author":"hugh_farey","post":"Yes, I know there’s lots of things wrong with me, Louis, but I was asking about you. I don’t wish to denigrate you, and nor do I take for granted that most of your publications are not available via the internet. I don’t even know who you mean by “an Oxford scholar”. I’m afraid I recognise people by their names, not the places where they work. Nor am I judging you, on behalf of amateurs or anybody else. I’m merely wondering the basis upon which you, often, assume an authority over us amateurs simply by virtue of being a ‘professional.’ And now I know. Thank you. You’re a professional journalist. I should be delighted to submit a paper to which ever journal you’re a journalist for, if you feel able to reveal it..","date":"2015-10-15","mins":"9:21 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212546","author":"hugh_farey","post":"On behalf of all the amateurs whose professionalism is often denigrated by ‘professionals’, may I be so bold as to enquire how professional Louis actually is? An handful of self published essays, book reviews and interviews are all I can find on the internet, and of those, only the ones advertised at length in his comments on this blog have been read more than a few dozen times. Entering “Louis C. De Figueiredo” on Google seems at first to produce about 880 results, but clicking on the last page of this we find that there are in fact only 25, none of which tell us more than we have read here. I wouldn’t have raised the issue, except that placing oneself on a professional pedestal (“writing as a professional journalist with expertise in history and religion”) in order to give oneself authority, especially if that position is used to denigrate the opinions of others not so elevated, cannot but invite some curiosity from the denigrated..","date":"2015-10-15","mins":"6:00 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212499","author":"hugh_farey","post":"Does anyone know how much of the material found at Masada has been identified as of non Israeli/Palestinian origin?.","date":"2015-10-14","mins":"4:20 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-1907","author":"hugh_farey","post":"Well, who’d have guessed? On your most recent post (14:47), quoting #43 on Shroudstory’s “That is not what one would expect to see” posting, did you notice my own comment (#34) demonstrating that since the “serum” covers large areas of the fibres, while the “image” covers hardly any, any random “serum” stained fibre would be most unlikely to have anything underneath it, whether or not the image was formed before the bloodstain? Consequently Heller and Adler’s findings are entirely irrelevant to the question of which came first..","date":"2013-02-28","mins":"4:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/28/shroudie-alert-day-10-a-newish-take-on-a-very-old-amulet/","cat":"barbecue","title":"Shroudie-Alert: Day 10. A new(ish) take on a very old amulet"},{"id":"comment-1902","author":"hugh_farey","post":"Clearly Pipistrellus pipistrellus, after an accident with a rolling pin, after which, as some wag notes, an animal loses not only its life, but also its third dimension….","date":"2013-02-28","mins":"8:59 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/28/shroudie-alert-day-10-a-newish-take-on-a-very-old-amulet/","cat":"barbecue","title":"Shroudie-Alert: Day 10. A new(ish) take on a very old amulet"},{"id":"comment-1910","author":"hugh_farey","post":"I haven’t got a copy. I imagine the Canadian Society of Forensic Science could send one, but it’s not on their website, which only goes back to 1995. “The Orphaned Manuscript,” which seems to be a collection of Adler’s papers, is unavailable (although most of it is published via Google Books). The best I can do is find bits quoted by other people, which is never very satisfactory..","date":"2013-02-28","mins":"5:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/28/shroudie-alert-day-10-a-newish-take-on-a-very-old-amulet/","cat":"barbecue","title":"Shroudie-Alert: Day 10. A new(ish) take on a very old amulet"},{"id":"comment-194003","author":"hugh_farey","post":"Diana Fulbright is recorded as a student of Birger A Pearson in the latter’s book ‘Nag Hammadi Codices IX and X’ (1981), and Pearson is (Wikipedia) “Professor Emeritus of Religious Studies at the University of California, Santa Barbara and Professor and Interim Director of the Religious Studies Program at the University of California, Berkeley.” In 2002 Fulbright is recorded (in her paper ‘Forelocks in Early Christian Tradition’) as Instructor of Sacred Scripture and Biblical Languages at the Mary Mother of the Church Abbey, Richmond, VA, where I think she can still be found..","date":"2015-03-22","mins":"4:03 am","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-193957","author":"hugh_farey","post":"There was a decayed body in the shroud, and there was material associated with much of it. However the biggest shred was only 16cm along its longest axis, so it is impossible to say if there was really a shroud at all, let alone its shape, or if, as Diana Fullbright suggests, he was buried in clothing. If the material had been assembled into a single sheet, it must have been a patchwork rather than uniform, which is perhaps odd as other findings suggest that although the dead man had leprosy, he was nevertheless well cared for in life and death. I don’t think that this finding can be taken as any kind of ‘typical’ or ‘regular’ shroud from which the Turin shroud is an exception, or indeed, vice versa..","date":"2015-03-21","mins":"2:49 pm","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-193958","author":"hugh_farey","post":"And as for “a distinctive 1st century weave,” that is, of course, nonsense. All the fragments are of simple over and under weave, typical of every century since weaving was invented..","date":"2015-03-21","mins":"2:52 pm","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-212599","author":"hugh_farey","post":"“I will not repeat over and over again what and where I have published.” Yes you will. You will direct our attention towards your interviews with Giulio Fanti and Paolo di Lazzaro, and your paper on Jung, again and again, as you have so many times before. What you will not do is explain how your professional expertise gives you more authority to speak on anything than Daveb, Sampath, myself or anybody else who comments on this blog. And who is this “man I defend”? I defend nobody. I defend ideas, not people, regardless of their source, if they seem to me reasonable inquiries into the Shroud of Turin. As for “He must remember that there are people who want him dismissed as editor of the BSTS newsletter,” I dare say you are correct. My email address is openly available, and my editorship transparent to the world with every update of shroud.com. If anybody wants me dismissed they are very welcome to let me know, but nobody has yet, even though the vast majority of the BSTS are authenticists, and know very well that I am not. Why do you think that is? I hope is it because they trust me to present all aspects of research into the Shroud impartially, and to treat everybody generously and respectfully, as I think the founder of my religion would approve. Forgive me if I do not have a lot of time for all your secrecy and innuendo. If it was really important you wouldn’t go on, and on, and on, about it. You would keep it secret, and not try to impress us with “a very important institution” and “a highly qualified Oxford scholar” and “privacy is a necessity” and all that cloak and dagger stuff. I say forgive me because for all I know, you may indeed have all this secret professionalism you claim. It’s just that I take as I find, not as I am told. Anyway, I think these three posts have said what I feel needed to be said, so I’ll stop now..","date":"2015-10-15","mins":"5:29 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"}]
