[{"id":"comment-191515","author":"hugh_farey","post":"Good point, renny. Not only has Paul conflated all the various marks on the Shroud into a single event in time and space, but he has down the same with both the original effigy and the various damages it has sustained over the years, including chips, cracks and discolourations..","date":"2015-02-21","mins":"5:54 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-191628","author":"hugh_farey","post":"Hi Paul. I think a good introduction to the Shroud, with sources, would be Ian Wilson’s most recent book (2010) entitled The Shroud; Fresh Light on a 2000 year old Mystery. However the best way of seeing that the various marks on the Shroud are not contemporaneous would be Aldo Guerreschi and Michele Salcito’s papers at shroud.com, “Photographic & Computer Studies Concerning the Burn & Water Stains Visible on the Shroud” and “Further Studies on the Scorches and the Watermarks.” If after that you are still convinced that everything that disagrees with your hypothesis is the result of a Vatican conspiracy, then I’m not sure we can help you further. There is no evidence at all that “the Vatican” (whoever they are) is convinced of the authenticity of the Shroud anyway..","date":"2015-02-23","mins":"5:49 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-191502","author":"hugh_farey","post":"How very unkind. I have no evidence that Paul Gell is a desperate sceptic; have you? He comes across as someone who has discovered a coincidence, explored it further, but ended up drifting further and further from likelihood. There are indeed eerie similarities to some people’s interpretation of the Pray Codex. I hope he reads past your unhelpful comments and gets to mine! Hi Paul, thanks for bringing the sarcophagus of Pierre de Corneillan to our attention. I have not seen it before, and wonder how it fits in with other contemporary sarcophagi. It does indeed have some resemblance to the Shroud, particularly, as you say, in terms of the slightly parted beard and the crossed hands. However, I’m sorry to say that I disagree with every single one of your alleged correspondences. In keeping with my practice of taking every posting on the blog with consideration, I set off to write a detailed explanation of why, but – and I do apologise if I’m wrong – I fairly soon came to the conclusion that this is indeed, as suggested, above, a joke. Am I right? Just in case you’re serious, here are a couple of things you need to check. 1) Late 1355 is very much the extreme edge of a credible manufacture date for the Shroud. I don’t know when the bas relief was made, but it may not have been until the following year, which I think would pretty well rule out the possibility of the Shroud having been made in Rhodes and then hurriedly rushed to Lirey for its first display. Furthermore, Pierre de Corneillan was a Hospitaller, while Geoffroi de Charny was probably (if he was related to the earlier Geoffroi who was burnt at the stake), very much of Templar stock. If the Shroud was made by Hospitallers in Rhodes, it would more likely have been sent to a Hospitaller in France for display, no? 2) Your claim that various bits of one image match various bits of the other depends on your knowing exactly how big the two images actually are. As you seem simply to have superimposed two pictures in photoshop, how do you know that the measurements match in actuality? 3) The Shroud has a) its famous image, which appears to be made of mildly oxidised linen, b) the marks of a serious scorching from a fire in 1532, which produced the dark lines and patched holes on either side of the image, c) the marks of a serious wetting, not associated with the fire, which made the big diagonal patches up and down the cloth, and d) the marks of some other burn damage from another time. The shroud can be demonstrated to have been folded in different ways for each of the last three incidents. You seem to think that all these marks were of similar manufacture made at the same time. (This was where I decided you had to be kidding, and were writing a deliberate parody!). 4) And finally – what about the back image? Was that modelled on the sarcophagus too? I look forward to your next video!.","date":"2015-02-21","mins":"1:44 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-18129","author":"hugh_farey","post":"Really? I’m afraid I’d never heard of Kamuliana till I read Breckenridge’s article. Is there a picture of it on the internet?.","date":"2012-10-23","mins":"2:16 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","title":"A good question about Justinian II coins"},{"id":"comment-18122","author":"hugh_farey","post":"In view of the interest in Justinian’s coins I thought I’d try and answer my own question and came across “The Numismatic Iconography of Justinian II” by James Breckenridge on scribd.com. He, interestingly, suggests that the first Pantocrator image may have derived from a statue of Zeus (removed from Olympia in 394 and finally destroyed in 462), which was roundly condemned by various church fathers (particularly Theodores Anagnostes), not because of its pagan origins, of which they were ignorant, but because it looked nothing like Jesus, who had short “frizzy” or “woolly” hair, as shown in various acheiropoietai, such as the one in Jerusalem described by the 6th century Anthony of Placentia, or according to a description in a (later) letter by John of Damascus, saying that the emperor Constantine had had images made “as the old authorities had described, with eyebrows that joined, fine eyes, a long nose, frizzy hair, a black beard…” Breckenridge discusses why Justinian might have reverted from one tradition to the other, and, to a certain extent, why the long bearded Christ eventually returned, during the reign of Michael III. It certainly appears that there were at least two early traditions as to the appearance of Jesus, both based on miraculous images (epitomised by the Mandylion of Edessa – long haired – and the Image of Kamuliana – short haired), which struggled for universal acceptance until after the great iconoclasm, when Edessa won..","date":"2012-10-23","mins":"1:17 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","title":"A good question about Justinian II coins"},{"id":"comment-18499","author":"hugh_farey","post":"I think that’s a really good answer. Thank you. And while I’m here, I found some of the crooked noses you found, but am not really convinced they are intentional. I agree some look as if the crook might have been in the die, but given the fairly haphazard stamping technique, I guess at that scale the odd imperfection didn’t bother the minters much. No one could claim that crooked noses were characteristic of the Christ face as it appeared on coins in general..","date":"2012-10-29","mins":"9:02 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","title":"A good question about Justinian II coins"},{"id":"comment-18511","author":"hugh_farey","post":"First time I’ve seen Castex’s site. What a remarkable set of pictures. The nose on the banner makes me feel quite ill! Slightly off topic, he also explains why the apparently straight back image is actually longer than the apparently convoluted front image, with his ‘bit folded over.’ Very clever indeed..","date":"2012-10-29","mins":"10:58 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","title":"A good question about Justinian II coins"},{"id":"comment-119859","author":"hugh_farey","post":"Sounds heart felt, but is it in fact, true? Iconography has been remarkably consistent, and images of the infant Jesus and his mother are almost always recognisable as such without any label. Type “icon” and the name of a holy figure into Google and dozens of very consistent similar images appear for almost anybody. Moses has gaunt cheeks and white hair, Andrew’s hair is white and slightly unkempt, John the Baptist has darker, longer and wilder hair than anybody, and Peter has a very full beard and looks like Zeus. In icons of the Last Supper almost all the apostles are instantly recognisable. In short, there most certainly are stock types for all the holy figures, and Jesus is just one of them. No doubt if I gave examples of twenty St Johns, OK would find an exception and say I was wrong; but if he finds twenty Christs and I find an exception, then for some reason that doesn’t count. Special pleading, if you ask me….","date":"2014-05-15","mins":"7:31 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features"},{"id":"comment-119915","author":"hugh_farey","post":"But this, for some reason, doesn’t count…..","date":"2014-05-15","mins":"9:07 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features"},{"id":"comment-119966","author":"hugh_farey","post":"I thought so. I think we’ll just have to disagree. Cordially, of course..","date":"2014-05-15","mins":"10:47 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features"},{"id":"comment-136224","author":"hugh_farey","post":"I have identified “The iconography of the Abgar cycle in Paris, ms. Lat 2688 and its relationship to Byzantine cycles,” by Isa Ragusa, which is described: “Studies the illuminations illustrating the story of the mandylion, the image of Christ’s face given by Christ himself to Abgar of Edessa, in MS lat. 2688 of the Bibliothèque Nationale, Paris (Pseudo Matthew, Infancy of Christ and history of the sudarium); and compares these, the only known Western Abgar cycle, executed probably in Rome in the second half of the 13th c., with surviving Byzantine examples, in order to identify sources and relationships.” I cannot find a copy to download, but it is referenced in “The Abgar Legend Illustrated: The Interrelationship of the Narrative Cycles and Iconography in the Byzantine, Georgian,and Latin Traditions,” by Irma Karaulashvili, which can be found at https://www.academia.edu/6711329/ The Abgar Legend Illustrated Interrelation of the Narrative Cycles and Iconography in Byzantine Georgian and Latin Traditions . in Interactions Artistic Interchange between the Western and Eastern Worlds in The Medieval Periods ed. C. Hourihane. Princeton 2007 pp. 220 243 Another interesting account of the nature of the Edessa image is in http://www.jaas.org/edocs/v18n1/Sebastian%20 Brock mandili Final.pdf The image itself, in colour, is at http://veronicaroute.com/1285/01/07/1280 85 ca 3/.","date":"2014-07-08","mins":"8:37 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-40234","author":"hugh_farey","post":"These bubbles seem to be called “pellets” by numismatists. Try Googling “pellet on the chin” for a few examples of a similar technique from Britain. D.M. Metcalf’s “Byzantine Scyphate Bronze Coinage in Greece” (http://numis01.zxq.net/Numis10/PDF/Metcalf11.pdf) is also relevant, I think..","date":"2013-08-01","mins":"5:41 am","url":"https://shroudstory.com/2013/07/31/a-question-from-giulio-fanti-about-a-byzantine-coin/","cat":"art","title":"A Question from Giulio Fanti about a Byzantine Coin"},{"id":"comment-101916","author":"hugh_farey","post":"It is a pity that Dayvault’s Isa tile appears to be wholly without provenance or authentication, and that the only picture of it is the one one his website. Still, taking it at face value, and using as guide marks the centre of the eyes and the lower margin of the lower lip, it is clearly longer and thinner than the Akiane picture. Not a lot, it is true, and it is difficult to see on the video as one image fades into another, but it’s perfectly clear if you try to merge them in a document (http://imgur.com/kivu30 L)..","date":"2014-04-21","mins":"7:01 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-101935","author":"hugh_farey","post":"Ah, yes. Thank you..","date":"2014-04-21","mins":"8:25 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-101973","author":"hugh_farey","post":"I think I’d like to see the 180 “points of congruence” listed or marked on an image before I thought any two images of a face were irrefutably derived one from the other..","date":"2014-04-21","mins":"10:57 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-160451","author":"hugh_farey","post":"Extraordinary methodology. Assuming the patient was comatose, wouldn’t placing a sign on his chest do just as well, or were they trying to find out how high the NDE flyer could reach?.","date":"2014-10-08","mins":"1:56 pm","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-42863","author":"hugh_farey","post":"But have you got Nitowski’s paper, Max? Does it say whether she actually measured the temperature inside some tombs and what her measurements were?.","date":"2013-09-04","mins":"6:16 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem"},{"id":"comment-42596","author":"hugh_farey","post":"Have you got Nitowski’s paper, Max? Does it say whether she measured the temperature inside some tombs and what her measurements were?.","date":"2013-09-01","mins":"1:08 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem"},{"id":"comment-190274","author":"hugh_farey","post":"Interesting. One of a series of vast paintings decorating a cathedral in Madrid. The figures are much taller than life size. Interesting too is the slightly incongruous round stone upon which the angel is perched. Perhaps surprisingly, given the biblical justification, round stones are very rare in Quem Quaeritis iconography, both ancient and modern..","date":"2015-02-08","mins":"7:09 pm","url":"https://shroudstory.com/2015/02/08/art-for-this-sunday-a-kiko-argello-icon-showing-jesus-burial-shroud/","cat":"art","title":"Art for this Sunday: A Kiko Argüello Icon Showing Jesus’ Burial Shroud"},{"id":"comment-195821","author":"hugh_farey","post":"It’s a Guardian article, at “http://www.theguardian.com/artanddesign/jonathanjonesblog/2015/apr/08/jesus christ tomb family church will not accept”.","date":"2015-04-09","mins":"5:29 am","url":"https://shroudstory.com/2015/04/09/art-scholars-on-scientific-evidence/","cat":"art","title":"Art Scholars on Scientific Evidence"},{"id":"comment-195833","author":"hugh_farey","post":"Ah! Thank you. I’ve often wondered… As for the tesseract, perhaps you built a three dimensional model of the four dimensional figure, just as one might draw a two dimensional image of a three dimensional cube. In a true tesseract, as in a square or cube, each of the 32 edges is of unit length. Had you achieved one aged 17, your Nobel Prize would not have had to wait so long….","date":"2015-04-09","mins":"6:34 am","url":"https://shroudstory.com/2015/04/09/art-scholars-on-scientific-evidence/","cat":"art","title":"Art Scholars on Scientific Evidence"},{"id":"comment-195841","author":"hugh_farey","post":"According to Google maps the quickest way from the Church of the Holy Sepulchre, which reputedly contains Golgotha, to Gethsemane, is 1.3km and takes 15 minutes to walk..","date":"2015-04-09","mins":"8:11 am","url":"https://shroudstory.com/2015/04/09/art-scholars-on-scientific-evidence/","cat":"art","title":"Art Scholars on Scientific Evidence"},{"id":"comment-18074","author":"hugh_farey","post":"The coins of Justinian II’s first reign (685 – 695 AD) are indeed remarkably shroud like, and it is difficult not to think it was indeed the model. However, when, after a period of exile, Justinian returned to the throne (705 – 711 AD), the same sort of coins (with the same designation – Christus Rex Regnantium) have a closely shaven Christ with tightly curly hair. Can anyone suggest why the changed their mind about Christ’s appearance?.","date":"2012-10-22","mins":"7:54 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-133299","author":"hugh_farey","post":"Good comment, but since the only image reference to this epitaphios comes from Dan’s 2011 posting, can he remember where he found it? Is it even from Stavronitika? Googling Stavronitika epitaphios brings up a different one altogether..","date":"2014-06-28","mins":"9:27 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","title":"Comment Promoted:  The Stavronikita Epitaphios"},{"id":"comment-134284","author":"hugh_farey","post":"Zigzagging embroidery seems quite a common way of filling space in these silk and gold epitaphioi. Shrouds – which may be indicative – dresses, halos, even just background are often filled with it. There is even one epitaphios in which the shroud is almost the only thing not zigzagged..","date":"2014-06-29","mins":"6:54 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","title":"Comment Promoted:  The Stavronikita Epitaphios"},{"id":"comment-133308","author":"hugh_farey","post":"That was quick! Thanks, Tristan. I’m confused though. If the ‘linen coth’, the ‘second border’ and the ‘figure of Christ’ were not part of the original design – then what was in their place when it was first made? Slightly odd..","date":"2014-06-28","mins":"10:02 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","title":"Comment Promoted:  The Stavronikita Epitaphios"},{"id":"comment-134352","author":"hugh_farey","post":"You did help. The Byzantine herringbone pattern is another chip on the pile on the authentic side of the balance. It’s still not enough for me, as you predicted, but it’s more evidence. I like evidence!.","date":"2014-06-29","mins":"4:30 pm","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","title":"Comment Promoted:  The Stavronikita Epitaphios"},{"id":"comment-205224","author":"hugh_farey","post":"Funny that he didn’t notice Jesus’s moustache….","date":"2015-07-11","mins":"4:28 am","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","title":"Dirk Bouts’ The Entombment"},{"id":"comment-205271","author":"hugh_farey","post":"“…easily mistaken for lips…” !!! I think this is grasping at straws. The moustache is one of the most prominent and distinctive features of the Shroud, and cannot possibly be mistaken for anything else. Its representation is a good way of checking whether any alleged copy is really anything of the sort – alleged Byzantine copies always have thin pointed down turned moustaches, and other alleged eye witness reproductions, in spite of spotting minute details of the blood flows, completely miss the big, bushy, prominent, moustache of the Shroud. And in Turin, under the blue light which brought out the contrast to its maximum, the moustache was, of course, the most prominent feature of the face, along with the nose and beard. (Exit the villain, twirling his moustache….).","date":"2015-07-11","mins":"2:16 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","title":"Dirk Bouts’ The Entombment"},{"id":"comment-144968","author":"hugh_farey","post":"Rebecca has a point, but is unnecessarily defeatist. “I don’t know, and nether do you.” “It is something no one can explain.” “One thing I am sure of though, you can’t claim anything based on a fake scientific method like points of congruence. There is no such method for matching faces.” The second two quotations are simply untrue. I don’t know about cartoons, but across the world people are allowed into and out of countries on the basis of a computer comparison of their appearance in a camera and their photo on a passport. Algorithms for identifying faces have been devised, are being continually refined, and are sufficiently good at their job to be used at immigration control. They are no doubt biased to avoid false positives, which is why they throw up so many false negatives, but they are there and on the whole they work..","date":"2014-08-20","mins":"10:36 am","url":"https://shroudstory.com/2014/08/20/face-matching-methods-questioned/","cat":"art","title":"Face Matching Methods Questioned"},{"id":"comment-145052","author":"hugh_farey","post":"“It’s perhaps not surprising that computer algorithms for image recognition cannot cope with cartoons.” Not yet, perhaps, but it’s being worked on quite seriously. In a year or so not even Donald Duck will escape recognition...","date":"2014-08-20","mins":"5:22 pm","url":"https://shroudstory.com/2014/08/20/face-matching-methods-questioned/","cat":"art","title":"Face Matching Methods Questioned"},{"id":"comment-198125","author":"hugh_farey","post":"David Hines’ views, as an artist attempting to copy a picture, are interesting, if subjective. However, my own view is that the person who produced the Shroud did not really know what his finished work would look like when he started it. He was clearly, I think, not attempting to paint a picture. He was attempting to create an image which looked as if it might have been left by a sweaty body in a tomb. I think that changes some of Hines’s basic parameters..","date":"2015-05-02","mins":"2:05 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198166","author":"hugh_farey","post":"Some interesting ideas from both Daves, if somewhat misguided, as it will not surprise either of them to hear me say. I think Dave Hines overstates the complexity of producing a reversed image. A statement like “If the artist did not understand that as a result of a contact image rights and lefts are reversed the side wound would have been illustrated on the left side, not right side,” seems to me extraordinary. Why should an artist not understand that? It is not an intellectual challenge of any severity, I think. The question “Artist did not use plain weave white linen as used in Jewish Burial?!” is relevant. A burial shroud was never going to be seen again, but a ritual liturgical object was intended to be displayed publicly, and with solemnity and deep respect. An elaborate and expensive cloth makes more sense in the liturgical scenario than the burial one, although the bible’s rich man Joseph of Arimathea’s buying of a shroud offers a counterbalance to that argument. As for the other questions, they miss the point. The creator of the Shroud was not aiming at a picture of Christ as such, but at a ‘realistic’ depiction of the kind of image that might have appeared had the Shroud covered a dead man. Daveb misrepresents me completely. “To my mind Hugh is too locked in to the results of the radiocarbon dating, and is unable to concede that they might be incorrect, or irrelevant.” This is nonsense, as he well knows. I have repeatedly conceded that the radiocarbon dates might be incorrect. I am also able to consider any evidence for the authenticist argument dispassionately and on its merits. On balance, as I have repeatedly explained, I think that the evidence for a medieval date is more convincing than the contrary evidence, but to claim that I am locked in to my opinion is scurrilous. As an example, I fully appreciate that both the negativity, and its corollary, the 3 D quality of the image, would seem to be remarkable accidental consequences of an artist attempting to simulate a sweat induced image. However, Colin is working on a possible procedure that might do just that. “It is stretching the laws of unintended consequences to claim it as an accident” may be true, or perhaps not. Time may tell..","date":"2015-05-02","mins":"5:45 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198193","author":"hugh_farey","post":"“I find Hugh’s response as extraordinary as he seems to find mine.” I do not find daveb’s response extraordinary at all. It is entirely typical of most authenticists, who like firmly to divide opinions on the shroud into two entirely separate and antagonistic camps, categorising those who do not think the shroud is genuine as anti rather than non authenticity, and usually as fanatical atheists desperate to bring about the downfall of Christianity. These people, we read, “ignore” all the evidence, are “locked in” to their point of view, “unable to concede” any possible alternative. They are usually infantile morons as well. The truth, of course, is that many people, who hold both authenticist and non authenticist opinions, are nevertheless able to understand and appreciate the views and evidence of those of the opposite opinions, and can engage in constructive debate about all of them. I agree with daveb, for example, that an Epitaphios serves its purpose as a metaphorical transposition of Burial Cloth to Altar Cloth, with its elaborate embroidery and clear and distinct image of Christ, and usually some people and angels as well. I pursued the idea that the Shroud itself might be an early version of such a function myself, but abandoned it for exactly the reasons daveb suggests. However, the Byzantine rites of the early centuries of the Church are far removed from those of medieval Europe, for whom a more realistic acting out of the discovery of the empty tomb, the angels and the Shroud, became encapsulated in the Quem Quaeritis ceremony. Real people represented the three Marys, others represented the angels, a real box represented the tomb and a real sheet represented the Shroud. The Shroud was brought to the altar and displayed to the people. If it bore an image (and to be fair, we have no evidence that this was customary), it was only a vague impression of the body which had lain in it, so as not to confuse it with the living presence of the risen Christ at the altar (a point made by OK some months ago). In this respect I differ from Charles Freeman, who thinks that the image was originally much brighter (but to be fair to him, pictures of the public exhibition of the Shroud do show a much clearer image, and descriptions of them seem to concur, which is why I postulated that there might have been two shrouds, one for veneration and one for exhibition). Just as non authenticists differ in their interpretation of the evidence for a medieval provenance, so authenticists are also at considerable odds with each other, although they usually fragment into different camps which refuse, ignore, and are unable to accept, or at least unwilling to discuss the opinions of the others. The process by which the Shroud was formed, the attitude of the body and the Shroud itself, the events leading up to the covering of the body and, more philosophically, the meaning and possibility of a supernatural occurrence are all matters of dispute, and could fruitfully be matters of debate, if only people didn’t characterise those of a different opinion so negatively..","date":"2015-05-03","mins":"3:37 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-197850","author":"hugh_farey","post":"If something has happened to the Shroud to remove virtually all of the original pigment, it is sure not beyond the bounds of credibility that the outline was removed too, especially if it was in, say, charcoal, with no medium or binder to keep in in place..","date":"2015-04-28","mins":"11:43 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-41080","author":"hugh_farey","post":"The DNA of God might not consist of any peculiar genes, but rather a particular combination of ordinary genes, just as a particular combination of genes might predispose a child towards an excellence, given appropriate education, in Science, Athletics or the Arts..","date":"2013-08-12","mins":"12:28 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41109","author":"hugh_farey","post":"Chose.","date":"2013-08-12","mins":"6:14 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41264","author":"hugh_farey","post":"Individual threads. The labs wanted 40mg, the shroud has a density of about 25mg/cm2, and the warp/weft numbers are about 40/30 per cm. Therefore in a square cm of shroud there are about 70 threads, each weighing about 0.36mg. To make up a lab requirement Riggi and Gonella would have had to cut about 110 1cm threads per lab, maybe making each one 3cm long and cutting it in three so that each lab could have exactly the same make up of its samples. 110 threads, each 3cm long. Is that what you had in mind?.","date":"2013-08-14","mins":"12:47 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41252","author":"hugh_farey","post":"Yannick, suppose you had been responsible for delivering the C 14 samples to the labs. How would you have done it? Would you have taken three 1cm square samples from different areas of he cloth, one for each lab; or would you have taken three 3cm square samples, and divided them so that each lab received three samples, one from each area? And whereabouts on the cloth would you have taken the samples from? This was presumably the problem that Gonella faced, and I should be interested to know how somebody else would have tackled it..","date":"2013-08-14","mins":"8:36 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41331","author":"hugh_farey","post":"Yes, he was. See http://www.shroud.com/pdfs/n67part8.pdf..","date":"2013-08-15","mins":"7:55 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41430","author":"hugh_farey","post":"So why didn’t they do that? Setting aside deliberate dishonesty, I don’t think we can dismiss Gonella, Riggi or the others present as stupid. Gonella, especially, had been in contact with the leading researchers in the field for months. Gove, Meacham and others had indeed been listened to, and their views considered. I think there were two main reasons for not using pieces from under the patches, and although neither of them hold much water today, they were major factors at the time. The most important I think was that at the time they really thought there was a good chance that combustion could skew a C 14 dating. I don’t know whether that was based on evidence or just suspicion, but it does seem to have been a serious consideration, and even before the dating was carried out, would have had proponents of both sides claiming that if the date was not what they wanted, it was because of changes to the C 14 content due to the circumstances of the 1532 fire. Neither Gove nor Meacham could guarantee that this was impossible, or even unlikely. The second reason is that taking pieces from under a patch would have meant unpicking a long section of the backing cloth and folding the shroud back to find suitable spot. By 2002, of course, this wasn’t a problem, but even in 1988 the aura of ‘holiness,’ not just around the shroud but around every religious object – and person for that matter – was much stronger than it is today. It was verging on sacrilege for anyone other than a priest even to touch the cloth, and to pull it about quite so drastically may have seemed a secularisation too far. I always used to enjoy Stephen Jay Gould’s defences of various utterly discredited 19th century scientists because, although they were overtaken by progress, he never dismissed them as idiots but tried to explain what it was that made them think as they did. We should do the same here..","date":"2013-08-17","mins":"3:03 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41450","author":"hugh_farey","post":"No, I really meant that Gove and Meacham’s ideas had been listened to and rejected. In particular, I imagine Meacham’s paper “Radiocarbon Measurement and the Age of the Turin Shroud” was most carefully considered. Apart from the fact that the paper is almost wholly devoted to the unreliability of any carbon date from wherever taken, Meacham’s final, “tentative proposals” are as follows: 1) a single thread from between the images. It’s hardly surprising this was rejected. It would not have had sufficient mass to be tested on its own, so would have to have been mixed in with another sample. If the two were of the same date, then it would make no difference whether the thread were present or not, and if they were different, then it would not be possible to distinguish them anyway. 2) a small piece just in from the edge next to the Raes site. That’s what was finally taken. 3) a piece of the charred cloth. Why? Meacham had spent an entire section of his paper explaining why such a sample could be more unreliable than all the rest. 4) a piece of the side strip. Again, why? It might determine whether or not the side strip was the same age as the ret of the cloth, but whatever its date, it would not confirm the age of the main body of the cloth. 5) a piece of the backing cloth. This was to be used as a control, and as it was three other controls were used instead. To be honest, having decided to carry out the C 14 test, Meacham’s very negative opinions regarding the accuracy of any such test at all hardly makes him a useful advisor. Gove, on the other hand, had suggested 3 20cm (eight inches?) weft threads and 2 or 3 warp threads of 63cm (probably 2 feet – was he working in old units?). It is not clear if he wanted each laboratory to be given these, or if they were to be divided by seven. If the former, then he actually wanted 21 weft and 14 21 warp threads to be extracted for the seven labs then postulated. (If the latter then there wasn’t enough material). It is easy to be wise after the event, but I do understand Gonella’s reluctance to cut dozens of threads out of the shroud, or to bother with pieces of contaminated charred material. It was clear from the science labs that added contaminant such as oils, soot or extraneous fibres was removeable beforehand. In 1977 a few inches of the backing cloth had been tentatively unpicked by nuns, and equally tentatively sewn back up again. To unpick the whole of one end and some distance up one or both sides may have been, as i suggested before, a sacrilege too far. One more thing: nobody at all, that I can find, considered the possibility that undetectable interweaving was a possible source of contamination, neither STURP not anybody else. Incidentally, did anybody else in STURP, apart from Meacham, suggest a sample site, or did they just complain about it afterwards?.","date":"2013-08-17","mins":"11:16 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41545","author":"hugh_farey","post":"I think there is a problem with mixed samples. I think you’re correct that dating different samples from different areas gives the best estimate of the date of an artefact, but mixing them up before testing is a dangerous procedure. It assumes that there is no possibility of an outlier; if there is, then the entire sample is compromised and the date is meaningless. The more threads extracted from different areas and mingled, the greater the possibility of an outlier. This too may have been a significant factor in deciding to take the sample from a single area only. (Ironically, therefore, it may have been in order to exclude the possibility of interweaving that the single sample was taken.) You’re right that Otlet didn’t think much of sampling the charred areas, which makes you wonder why Meacham suggested them. It’s no surprise that his suggestion was rejected. I think the only viable alternative to taking the test material from where it came from was to extract a minimum of three 3cm x 1cm samples from different areas of the cloth, and dividing them into three sets of three 1cm x 1cm squares for the three labs to test independently. I don’t think anybody at all, not even Meacham, considered that this level of damage to the cloth was acceptable..","date":"2013-08-19","mins":"3:29 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41601","author":"hugh_farey","post":"I think you’re confusing “listen to” and “agree with.” Meacham’s general point was fine, but his actual suggestions (a thread from here, a charred section there) were confused. If that was the best he could do, it’s no wonder they didn’t agree with him..","date":"2013-08-19","mins":"3:52 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-75955","author":"hugh_farey","post":"Fascinating. I wonder if any of it is true? Incidentally, one of my several etymologic/cryptographic findings in 2014 comes just now, from Googling ‘seder plate’ and ‘Hebrew,’ where I find it is universally called “Ka’ arah.” If adding “el” on the end makes it “divine,” then some etymological connection with “grail” would be plausible, if there weren’t more substantiated alternatives relating it to the Greek for “bowl.”.","date":"2014-02-02","mins":"9:26 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","title":"Ian Wilson Responds to a Posting in This Blog"},{"id":"comment-47203","author":"hugh_farey","post":"Can anyone anywhere explain why Isobel Piczec is referred to as a physicist?.","date":"2013-10-12","mins":"8:54 am","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-47354","author":"hugh_farey","post":"There is a philosophical sense in which the term “event horizon” could make sense without gravity being an essential part of it, but there is no scientific or mathematical model of one which could apply to a limited horizontal plane through a body suspended in midair. This is not physics, not even speculative physics. It requires nothing more than a vague idea that “nothing can go through an event horizon.” I studied general relativity as part of my degree and am certainly not a specialist, but I am sufficiently familiar with the concepts to be able to reject Piczek’s ideas unreservedly. I am also sufficiently familiar with the concepts to understand anything you may be able to say to explain how such an event horizon is possible. (After all, you managed to explain Jackson’s 2% C14 contamination perfectly!).","date":"2013-10-13","mins":"6:32 am","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-47382","author":"hugh_farey","post":"I agree wholeheartedly with your re write of my definition. The “event horizon” is indeed the place [B]beyond[/B] which no information is possible, rather than the place [B]at[/B] which this occurs. It has nothing whatever to do with the shroud, however..","date":"2013-10-13","mins":"1:46 pm","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-47248","author":"hugh_farey","post":"No, no, you misunderstand me. There are any number of references to Ms Piczek being a physicist, and even a particle physicist. But she isn’t, is she? She is and has been an artist all her hard working life. None of her papers on shroud.com are physics based, and a question and answer article entitled “Isobel Piczek, Artist and Physicist” makes no mention at all of any science. A paper entitled The Event Horizon of the Shroud of Turin on shroud3d.com shows no understanding of particle physics or quantum theory, or even of the meaning of event horizon. Weird..","date":"2013-10-12","mins":"1:33 pm","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-47303","author":"hugh_farey","post":"I do indeed. An event horizon is the radius from a point at which gravity is so intense that nothing at all can escape from it, and hence cannot effect anything outside it, and therefore cannot be detected. Although Piczek copies this definition fairly faithfully, she ignores the bit about gravity, which is by all known physics the only cause of an event horizon. It is clear she does not really understand it at all. By all means study Piczek’s article carefully. You will find that rather than using any kind of known physics to explain the image on the shroud, she speculates that a wholly unknown process is responsible. That’s not physics, that’s guesswork. Finally, you will note that her idea is rooted in the idea that the shroud must have been completely horizontally flat throughout the image making process, and the the image lacks anatomical distortion when viewed in than light. This is wholly contrary to your understanding of the 3 D nature of the image as explained to me with the help of a video only a few days ago..","date":"2013-10-12","mins":"6:30 pm","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-191191","author":"hugh_farey","post":"This is, no doubt unintentionally, a little disingenuous, if I may say so. The words above do not appear in Schiller’s book, although the illustration does. Schiller, in fact, makes no mention of the Shroud of Turin at all. Nor is she so naive as to say that a large Shroud in art was a sudden appearance of the 11th century, as this is clearly not true. What Schiller does is to trace the first appearance of various scenes leading to the entombment in iconography. The earliest representations, dating from the 9th century, depict the ‘Bearing Of the Body’ (in which the body is invariably shrouded in a long cloth or strips of bandage). Next appears the ‘Entombment’ itself (10th century). Here again, Christ is usually fully shrouded. A century or so later we begin to find the ‘Annointing’ and the ‘Lamentation.’The former, of course, requires an at least partially exposed body, and nearly all the Lamentations I have seen show Christ in a loincoth, lying on a slab or table, which is often covered in a cloth, which may not be a shroud at all.. Schiller says that the origin of this scene, which has no biblical justification, “may derive from funeral customs in east and west.” She is also very conscious of the role that the Easter liturgy, and the paraphernalia associated with it, played in the development of entombment iconography..","date":"2015-02-16","mins":"9:10 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"id":"comment-47298","author":"hugh_farey","post":"They do indeed, and she is. But a physicist?.","date":"2013-10-12","mins":"6:00 pm","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-191331","author":"hugh_farey","post":"Hi John, Good of you to write. I felt that the Shroud Guild’s Facebook selection (not your fault) from your History somewhat exacerbated an impression that Gertrud Schiller, whose eminence in Christian iconography is undisputed, endorsed the idea that its evolution may have been in part derived from the ‘sudden’ appearance of the Shroud after centuries of obscurity, which she didn’t. Schiller did have ideas, but I have to say that she does not express them very clearly and her oeuvre is much more descriptive than explanatory. Essentially I think she sees the expanding liturgy as the prime mover, with the Anointment and Lamentation scenes (scenes particularly associated nowadays with the Shroud) being relatively late comers both liturgically and artistically. The Lamentation in art seems to have begun life at the foot of the Cross, before the body was enshrouded, and the Anointment seems to have begun just outside the tomb, necessitating at least a partial unwrapping. Later the sites of these scenes became both less well defined and more confused with each other, but I think that between them they account for the arrival of the uncovered body without the necessity of the sudden discovery of the Shroud. Sadly Schiller’s Volume 3, which covers the Resurrection and subsequent events, has not been published in English, but as we have examined in some detail on this site, the Three Marys scene, another particularly associated with the Shroud, shows a continuous development, without any surprises, from the 5th century or so onwards. In order to justify an influence on art of the Shroud, we really need to specify a date of revelation and what, precisely, was revealed (just the head? just one body? both bodies?). I don’t think this has been sufficiently defined, but if it ever were, I don’t believe that a comprehensive review of paintings and sculptures before and after that watershed would be sufficiently distinctive to justify it. If the arrival of the Mandylion in Constantinople in 944 is taken as the start point, then that presupposes that the Mandylion and the Shroud were the same, which is by no means generally accepted. Oh, and by ‘bad argument’, I’m sure Dan was not being rude. I think he was using the word technically, to mean ‘unjustified.’ Misattributions (or misquotations) do not lead to sound conclusions..","date":"2015-02-18","mins":"9:30 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"id":"comment-144774","author":"hugh_farey","post":"I commend your ingenuity, OK, but I think I could do much the same with Rasputin. I just don’t think the Manoppello veil face looks anything like the Shroud face, and apparent congruences of one sort or another (abeit not the same ones) can be found on almost any pair of faces. I was hoping that by using facial recognition software rather than an overlay technique, it might be possible to get a more objective comparison..","date":"2014-08-19","mins":"11:51 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144828","author":"hugh_farey","post":"It is claimed to be from the Catacomb of San Callisto (or Callixtus) which was built after 150 AD, but I can’t find any corroboration of that. It looks like Johnny Depp to me….","date":"2014-08-19","mins":"5:07 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144915","author":"hugh_farey","post":"I’m afraid I think that all this matching up of pictures is too subjective to be valuable. Here are various Fresco/Shroud/Lennon/Depp combinations which all work satisfactorily for me. Http://imgur.com/DP Pp TT1.png. All I did was make sure that the eyes were the same level and enlarged/reduced the overlay until the lower lips matched. No two portraits, even of the same person, match perfectly, so the question is how much distortion of various features is permitted before identity is rejected. The value of using a computer algorithm is that whatever arbitrary tolerances are assigned, its accuracy can be checked and measured, which is why I suggested the e Passport machine (although the rejection rate of that was remarkably high as I re entered the UK last week – about 10% I would guess). I have done experiments with i Photo, and it is pretty poor, offering non matching people as possible matches and not recognising matching people more often than not..","date":"2014-08-20","mins":"2:57 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144929","author":"hugh_farey","post":"Still too subjective for me, I’m afraid..","date":"2014-08-20","mins":"5:14 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144992","author":"hugh_farey","post":"No, the aspect ratio was not altered at all. In each case the image is exactly as I pulled it off the internet. They were simply enlarged or reduced in order to make the vertical distance between the line of the eyes and the lower lip the same..","date":"2014-08-20","mins":"12:26 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145164","author":"hugh_farey","post":"It was the first frontal portrait to appear on a Google image search for “Johnny Depp.” it appears at http://www.phootoscelebrities.com/celebrities/johnny depp/.","date":"2014-08-21","mins":"4:07 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145143","author":"hugh_farey","post":"Fascinating stuff. It’s wonderful how many avenues of research the Shroud opens doors to. The bottom line, however, is that the remarkable portrait from the Callisto Catacomb was largely unrecognizeable by 1898, and that the only reproduction we have is a painting made in 1860 – from which, presumably, the images discovered by David Hines were derived. It is no longer possible to say how closely Thomas Heaphy’s portrait adheres to the original. To me, the distinctive upper outline of the moustache free upper lip is particularly 19th, rather than 1st or 2nd, century..","date":"2014-08-21","mins":"1:56 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144749","author":"hugh_farey","post":"See my comment when this video was first posted: “In fact, of course, exactly the same effect can be achieved using almost any two full face portraits of anybody at all, so is useless as a diagnostic identification tool. However, it provokes a thought. I have recently returned to my country through an e Passport facial recognition machine, which is able to make fairly reliable identifications of people using only their passport photos and their actual appearance at the booth. Their skin tone, hair length, clothes and other variables do not seem to matter. It would be interesting to try to ‘smuggle’ portraits of Christ, Depp, O’Toole, da Vinci, Durer and various others past such a machine, using the Shroud as their passport photo. I wonder how they’d get on.”.","date":"2014-08-19","mins":"9:28 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145162","author":"hugh_farey","post":"Believe me, I live for it too. Not recognising the Shroud in paintings cuts both ways. Although I don’t think any of the early portraits can convincingly be shown to be derived from the Shroud, I am still taxed by the problem that if it is 13th century, then why does it not conform better to conventional portraits of the time? As you know perfectly well, I do not have any scientific dogma. If the Shroud is 1st century then of course it is not impossible that it was copied. However, to claim that any early portraits are sufficiently similar as to prove that they were derived from it is, I think, so far unjustified..","date":"2014-08-21","mins":"4:00 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145188","author":"hugh_farey","post":"I have no doubt that Heaphy’s depiction is as accurate as he could make it. I have also no doubt that it must differ from the original in small ways. What they are, and whether they are important or not is now impossible to check. I must say I’m sorry if the impression given by this and other discussions is that wave after wave of irrefutable evidence of authenticity is being piled up in a huge mountain of incontrovertibility, while petty men snipe and quibble over trivial inconsistencies. I don’t see it like that. I see wave after wave of increasingly fanciful persiflage being stuffed hurriedly into the breach, which simply doesn’t stand up to any kind of scrutiny. There are major objections to a 13th century origin for the Shroud, and significant arguments in favour of a 1st century one, and I have never denied that. The comparison of paintings, however entertaining, isn’t one of them..","date":"2014-08-21","mins":"6:02 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144761","author":"hugh_farey","post":"Thanks Dan. I also notice (from the wikipedia article on facial recognition) that things like i Photo, Photoshop Elements and so on have some kind of program which attempts to identify faces on newly uploaded photos on the basis of previously identified ones. I’ll be experimenting….","date":"2014-08-19","mins":"10:33 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145809","author":"hugh_farey","post":"The sound of special pleading is, not for the first time, slowly getting louder and louder in the defence of the identity of two images, one of which is that of the Shroud. The argument, this time as in the past, follows a well worn route, and goes like this: 1) These two images are identical in so many instances that anyone can see one must be directly derived from the other. 2) Tiny detailed congruences are more significant than broadly obvious differences, such as the overall shape of the head and distribution of hair. 3) Of course the artist did not copy the Shroud exactly, as he did not want to portray a dead body. 4) The image on the Shroud shows such a battered face it is hardly surprising that the artist cleaned it up for his portrait. 5) Although we now admit that the two images don’t look anything like each other, we still think it is perfectly obvious that they must be related. Well, it won’t do. Either the two images are an ‘exact match,’ (by some definition of ‘exact’) in which circumstance a case for identity can at least be claimed, or they are not, in which case it can’t. Of course, it’s not impossible that an artist, seeing a rectangular face, vertically falling hair, bushy moustache and prominent lower lip should nevertheless convert this to a triangular face, moulded hair, minimal moustache and prominent upper lip, but such a hypothesis cannot be defended on the strength of the images alone..","date":"2014-08-24","mins":"8:15 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-191832","author":"hugh_farey","post":"No, Carlos. I agree that the length under discussion is about 11cm, and that 11cm on the Shroud goes from the end of the phalanx to the wound, and that the 11cm on your hand goes from the end of the phalanx to the wrist. However, your hand is considerably smaller that than that of the Shroud man, as I showed in my own comparison of it. I do not believe that the knuckle of the finger under the ruler is under the 60cm mark (compare it to the knuckle of the thumb as a quick comparison). If, as I showed earlier, I enlarge your hand so that your phalanges match the Shroud’s phalanges, the wound is now more in the metacarpal than the carpal zone. And daveb, everything you have said about the medial and distal phalanges, and the tips of the fingers, is perfectly correct. They are difficult to see, possibly because they were not in contact with the cloth, and maybe the cloth was orthogonal to their plane. They are impossible to measure. That is why is have not mentioned them at all in my comments or calculations until this very moment. And yes, the wound does look as if it is in the wrist. I do not think that the generations of scholars who have supposed it to be in the wrist were blind or stupid. It does look as if the hand narrows at that point, just as hands do narrow at the attachment to the arms. However, the measurements suggest that our perception is faulty at this point. Just above the blood stain is a severe crease, and a deceptive line of blood which appears to define the edge of the arm, but actually doesn’t. This is my take on the actual outline of the arm: http://imgur.com/Fa YARPG. And yes, hands do vary in size (which is why they have to be scaled for comparison), and to a certain extent, in proportion, but the metacarpals are invariably considerably longer than their proximal phalanges..","date":"2015-02-25","mins":"4:29 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-191841","author":"hugh_farey","post":"Here is the link: http://i.imgur.com/Fa YARPG.png.","date":"2015-02-25","mins":"6:52 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-191905","author":"hugh_farey","post":"Max, and David G, you both make a similar point in different ways. I cannot identify the exact point of the nail wound because there isn’t one. There is a big oval mark (my N2) but it does not seem to be directly associated with any flow. Then above it there is the end of a distinct trickle (N1), but the trickle does not seem to be associated with the oval mark below. Between these, and a little further out from the thumb is a third mark, a sort of irregular sigmoid, one end of which could also be the wound site (N3). Curiously, between these three there is a tiny spot where the cloth is completely unmarked..","date":"2015-02-26","mins":"12:59 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-191916","author":"hugh_farey","post":"If the blood was deliberately added to the shroud to impart verisimilitude, I would say that it had been trickled on with some kind of pipette. The flows on the hair, the arms, from the chest and across the back all show similar characteristics – the trickles are roughly the same width, density and zigzag with a similar regularity (although I confess I have not done detailed measurements on them, it’s just how it seems to me), suggesting that they were all applied more or less at the same time by the same person in the same way. Of course, if the Shroud is genuine then the blood arrived in a different way – or, fairly obviously, in different ways. Some appears to have been a flow from a living person, which dried on the body but when remoistened made a contact with the cloth, some may have seeped directly from the dead body onto the cloth from an open wound, and some may have simply been contact stains from moist excoriations or abrasions. I do not know how different these methods of transfer should look, but suspect that it should be more apparent in the final appearance than it actually is..","date":"2015-02-26","mins":"2:32 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-191816","author":"hugh_farey","post":"We really do need pictures here, don’t we? Carlos has lined up a bump on my hand with the end of the ulna (with a long thin rectangle), and we see the Space of Destot about a centimetre further forward. It is still about a centimetre behind any of my possible wound sites, showing that Barbet was wrong (as Dr Zugibe also described). However, the situation is actually worse than that, as the bump in my hand is not the end of the ulna, but the pisciform carpal, and the Space of Destot even further up the arm. The three possible wound sites are thus well within the metacarpal area. And, sadly, Kelly, the image of the other hand is rather deformed and it is impossible to get sensible measurements off it..","date":"2015-02-25","mins":"12:44 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-18413","author":"hugh_farey","post":"There are a handful of Justinian II coins on the http://www.wildwinds. None of them show a crooked nose. Entering ‘regnantium’ as a search produces a few more long haired, bearded Christs. None of them have a crooked nose either. On http://www.forumancientcoins.com there are five pages of them, and a few have seriously wonky noses, but they are wonky in different ways. Entering “Justinian II” and ‘coins’ on Google images gives you enough to ransom an emperor, all different, and the only thing they have in common is the straightness of their noses..","date":"2012-10-27","mins":"8:37 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","title":"More from Fanti on the skewed nose"},{"id":"comment-18420","author":"hugh_farey","post":"Gracias, Carlos. More and more of the straightest noses known to numismatics….","date":"2012-10-27","mins":"11:28 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","title":"More from Fanti on the skewed nose"},{"id":"comment-18426","author":"hugh_farey","post":"Are they on the internet?.","date":"2012-10-27","mins":"2:06 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","title":"More from Fanti on the skewed nose"},{"id":"comment-18446","author":"hugh_farey","post":"It’s a shame that the BSTS reproduction isn’t clearer, but I concede that the emperor’s nose looks broken. Not particularly crooked though. Interestingly, it also shows Jesus’s hair as flowing behind his clothes on both sides. Breckenridge speculates that later minters misread the folds of cloth around the neck as hair, which is why later coins (such as Fanti’s) show the hair coming forward of the clothes, usually on the right hand side. Given the large number of coins found (and published), it might not be impossible to find other examples of Fanti’s coin incontrovertibly stamped from the same die. Then it would be easier to compare blemishes, and find out if the nose is invariably as crooked..","date":"2012-10-28","mins":"6:02 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","title":"More from Fanti on the skewed nose"},{"id":"comment-124830","author":"hugh_farey","post":"Who is the little fellow sitting on the bottom of the river underneath John the Baptist?.","date":"2014-05-26","mins":"1:17 pm","url":"https://shroudstory.com/2014/05/24/more-on-the-dislocated-shoulder/","cat":"art","title":"More on the Dislocated Shoulder."},{"id":"comment-124000","author":"hugh_farey","post":"This is a fascinating paper, and sent me back to Barta & Carrascosa’s paper: The Shroud of Turin and its Ancient Copies. Http://www.academicjournals.org/article/article1380797649 Barta%20and%20 Carrascosa.pdf The illustrations in both papers are not always as clear as one would like, but would anyone like to refute, with clearer illustrations, the following generalisation regarding all pre fire copies of the Shroud: “If there are no burn marks on a copy of the shroud, there are no blood trickles down the arms either.” This has obvious corollaries.. Or am I “denying demonstrated facts by suppositions which have no basis in fact”?.","date":"2014-05-24","mins":"8:40 am","url":"https://shroudstory.com/2014/05/24/more-on-the-dislocated-shoulder/","cat":"art","title":"More on the Dislocated Shoulder."},{"id":"comment-73981","author":"hugh_farey","post":"Well I can’t agree with any of that. Yes, I suppose all but one of the samples preserved their integrity. This is on the basis that one sample which did disintegrate was mentioned in the Nature paper, although it is not specifically recorded that the others did not. Suppose is a perfectly valid word to use in this context. The sample that fell apart did so specifically because of its ‘loose weave,’ not because it was glued together with a water soluble glue. If any of the other samples had been held together by water soluble glue, they would have disintegrated as well. “No likelihood” does not mean 100% certainty. If I had meant there was no doubt at all, I would have said so. I have studied Robert Brown’s SEM paper carefully for months. His first (optical) photo appears to show an orange brown thread with little white patches on it which he says represent the places where warp threads cross over it. However the first white patch appears on the crest of a wave, not in the trough, the second occurs on one side of a trough only, and the last trough shows no white patch at all. In a 3/1 twill weave, the underside of this thread would show the opposite – it would appear to be a white thread (being covered with three adjacent warp threads) little orange brown patches where it was exposed to the air. This is not apparent from the photo. I do not find his paper conclusive. Next, is it not a little disingenuous first to suggest that peer review is a “starting point” for some degree of reliability, and then dismiss all the papers you disagree with as silly. Is it not a little biased to dismiss a paper published in his own journal by Jull, but not another paper published in his own journal by Rogers? And no, there is no evidence that the cotton fibres identified among the Oxford samples were ‘intertwined.’ Where did that idea come from? Obviously as fundamental to physics, all experiments are ultimately quantum science based, but there is no application of any current understanding of QED that is relevant to the Shroud. I don’t think it was particularly observant of Truzzi to declare that disputing one idea is not the same as proving its opposite. I’m so glad I don’t fall into that trap though! Can you name any of the “numerous articles” published in a peer reviewed journal that demonstrate that the carbon tests were flawed? And finally, can you quote the artifact that carbon dated further into the future than the current date? Because if so, then you will also know why..","date":"2014-01-21","mins":"3:58 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","title":"Most Scientists . . . Don’t You Just Love It"},{"id":"comment-74029","author":"hugh_farey","post":"I’m preparing an article on the radiocarbon dates for the June edition of the BSTS Newsletter. However, for a lot of fun, get onto Ox Cal Project (it’s free but you have to log in), and enter the Radiocarbon BP dates, for instant conversion into calendar dates via the latest calibration curve..","date":"2014-01-21","mins":"7:12 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","title":"Most Scientists . . . Don’t You Just Love It"},{"id":"comment-73836","author":"hugh_farey","post":"“Rogers point was not that the cotton in the Shroud was a major impact on the carbon date, it’s that the gum arabic was used to bind cotton into the threads because the cotton could be died and the linen does not dye well or at all.” If the threads that were radiocarbon dated were from about 1300 AD rather than 30 AD, they would have given a date of about 1300 AD rather than 30 AD. They were, and they did. Any Gum Arabic, being soluble in water and destroyed by Sodium Hydroxide, was completely washed away in the cleaning process, and had no effect on the dating process at all, whatever date it was. If the Gum Arabic had been used as a glue to bind cotton to linen threads, the samples would have fallen to pieces as a result of the cleaning process and been impossible to use for radiocarbon dating..","date":"2014-01-20","mins":"2:29 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","title":"Most Scientists . . . Don’t You Just Love It"},{"id":"comment-73876","author":"hugh_farey","post":"As you know, I tend towards the idea that the radiocarbon dating was an accurate assessment of the age of the piece of the shroud that was tested. As such, all contamination was effectively removed, leaving the basic material to be tested. It is not impossible that gum arabic (and rose madder) was present on the shroud for some purpose or other, but I do not think it had anything to do with interpolated weaving. The entire ‘splice’ hypothesis and the evidence which supports it is inconsistent, from the relative amount of cotton to linen, to the nature of the ‘splices.’ Some have said that the interpolated threads were an intimate blend of cotton and linen (Fanti), others that separate threads of linen and cotton were twisted together (Benford), and others that two pieces of cotton were glued together end on (Villarreal). Even if some sort of ‘glue’ had been considered necessary to hold the shroud together, gum arabic would have been a silly choice as it goes very sticky under any kind of moisture, such as a bishop’s fingers, which would have ended up covered in shreds of mended shroud! All the labs cleaned their material remarkably thoughoughly. Vacuuming or ultrasound were used to remove loose foreign bodies, ether, ethanol or dertergent for fats, waxes and oils, and then various acid (hydrochoric), alkali (sodium hydroxide) and distilled water washes. One of the Zurich test samples (one from the mummy wrapping) did fall to shreds under the treatment and was lost. The rest of the samples, I suppose, preserved their integrity. There is no likelihood that any coating of any kind managed to survive this treatment..","date":"2014-01-20","mins":"7:36 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","title":"Most Scientists . . . Don’t You Just Love It"},{"id":"comment-73993","author":"hugh_farey","post":"Good question. The control for this was to clean and date the three control samples in exactly the same way at the same time. They all came out reasonably correctly correlated with their known dates, so there is no reason to suspect that the cleaning process itself distorted the dating..","date":"2014-01-21","mins":"4:59 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","title":"Most Scientists . . . Don’t You Just Love It"},{"id":"comment-121573","author":"hugh_farey","post":"I emailed Annig Raley, who simply sent me a Google images search page of “agemian paintings” saying “This is the portrait of Christ which my father painted. I hope this info helps you.” I think she means “these” as there are a few, but none of them is the disputed one. On the other hand the image above is also certainly not the Sai Baba image, which in fact resembles the Ariel Agemian image rather more than it resembles the painting above, although, like the painting above, it is often overlaid by a shoud transparency. After burrowing about, I might suggest Heinrich Hofmann (1824 1911), whose paintings of Christ resemble the one above quite closely, although I cannot find an exact copy..","date":"2014-05-19","mins":"5:42 pm","url":"https://shroudstory.com/2014/05/19/name-that-picture/","cat":"art","title":"Name that picture"},{"id":"comment-121459","author":"hugh_farey","post":"Ariel Agemian (Knight of St. Gregory) 1904 1963. Remarkably, painted in 1935, before even the Enrie photos. See Shroudstory Dec 11, 2011. Often copied, so this particular one may not be original..","date":"2014-05-19","mins":"9:32 am","url":"https://shroudstory.com/2014/05/19/name-that-picture/","cat":"art","title":"Name that picture"},{"id":"comment-121495","author":"hugh_farey","post":"Not what?.","date":"2014-05-19","mins":"12:40 pm","url":"https://shroudstory.com/2014/05/19/name-that-picture/","cat":"art","title":"Name that picture"},{"id":"comment-121508","author":"hugh_farey","post":"“…the one by Ariel Agemian…” Did he only paint one? There are several differences between this and the one most often reproduced on the internet, but it has an obvious resemblance, don’t you think?.","date":"2014-05-19","mins":"1:53 pm","url":"https://shroudstory.com/2014/05/19/name-that-picture/","cat":"art","title":"Name that picture"},{"id":"comment-130691","author":"hugh_farey","post":"Daveb’s point is certainly pertinent. If, however, later “Three Marys” derived from the Pray picture, their artists clearly understood the skewed rectangle as a lid, not a sheet. However I don’t think the iconography of the Three Marys does stem from this picture. Queen Ingeborg’s Psalter is contemporary and shows a very similar scene, including a skewed lid, and there are earlier versions from the 10th century onwards with some of the relevant elements: from Italy, in Met Mus Art (10th Cent – ‘house’ style tomb with shroud, angel sitting on skewed surface), the Pontifical of Westminster (10th Cent – San Baudelio, Spain (no lid or shroud), San Miguel, Estella, Spain (two angels lifting the lid, shroud in tomb), Aachen (1020, Antependium of Otto II, including skewed platform for angel, but a ‘house’ style tomb with shroud inside), the Bamberg Apocalypse (11th Century – angel sitting on sarcophagus, no lid, shroud in ‘house’ style tomb) and several others. Thomas’s points are also valid, and I have not failed to address them. My response to the little circles is really “I don’t know.” I agree that they do not seem to be purely decorative, but I disagree that they are anything to do with some accidental chars in the shroud. I do not think that my ignorance should be taken as supportive of any hypothesis, however. On the Pray drawing of the seated Christ an acolyte also has rather clumsily placed little circles on his clothes, and it looks as if the artist started to fill the central strip and then gave up. I differ from Charles here in that I don’t think they represent the oculi, which if present always play a more prominent part in the design..","date":"2014-06-18","mins":"7:59 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130696","author":"hugh_farey","post":"Lots of stuff posted while I was writing that. Thomas: I’m not sure why, if the number of holes (4 or 5) is irrelevant to the Pray tomb being the Shroud, it really matters about the number of oculi drilled in the tomb. Max: It’s no use reminding us of evidence that doesn’t (yet?) exist. Produce it. Daveb: http://www.pinterest.com/pin/543528248748686042/ and http://imagesonline.bl.uk/index.php?service=search&action=do quick search&language=en&q=%235996.","date":"2014-06-18","mins":"8:14 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131745","author":"hugh_farey","post":"I don’t think that not believing the same as somebody else can be fairly described as looking for a pretext for a brawl. I think that’s unfair. As you know I agree with Charles, but I am not looking for a pretext for a brawl. I want to know what makes people think differently from me – there may be aspects I hadn’t considered which will make me adjust my stance. I had not really considered the polystaurion design in relation to ecclesiastical vestments before, for example, and Daveb’s challenge to find earlier examples sent me scouring the internet most fruitfully. Overall, I do not find the Pray Shroud connection sufficiently convincing for me to chamge my mind yet, but if the promised papers from Max and OK are as definitive as they say they will be, perhaps I will!.","date":"2014-06-20","mins":"12:57 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131815","author":"hugh_farey","post":"I look forward to it. Meanwhile, you’re quite right that the Pray manuscript has been discussed many times. In my first comment to this post, above, I made various other points. One that seems worth raising again, because it concerns ‘the herringbone weave’ again, is Pam’s suggestion that the pattern of dots joined by lines in the shape of a diamond ‘trellis’ might also be related to the Shroud. Any ideas about that?.","date":"2014-06-20","mins":"4:15 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129137","author":"hugh_farey","post":"Wrong? Me? How very dogmatic of you. Have you any actual evidence for your confidence? Or must we rely entirely on your paleoiconocriptographic authority? Because I don’t..","date":"2014-06-13","mins":"12:12 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129338","author":"hugh_farey","post":"Repeating things doesn’t make them clearer. But “Actually, I do have iconographic evidence for my confidence,” sounds more hopeful. What is it?.","date":"2014-06-14","mins":"3:42 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129398","author":"hugh_farey","post":"More repetition. Still no evidence. Just telling me I’m wrong is hardly likely to persuade me or anyone else otherwise. I still think the rectangular slabs are the tomb not the shroud, and that the pattern on them, and the holes, represent aspects of the tomb not the shroud. My evidence for this can be found by typing “Three Marys” into Google images, where you will find images such as this: http://taylormarshall.com/2011/05/three marys at empty tomb saintes.html or this:http://www.wikiart.org/en/duccio/the three marys at the tomb 1311 or this:http://www.journeywithjesus.net/Essays/20090406 JJ.shtml or this:http://roughplacesplain.tumblr.com/post/46746360194/easter the three women at the tomb, all of which show a clearly angular patterned stone tomb and crumpled cloth grave clothes. If you have any evidence to the contrary, what is it?.","date":"2014-06-14","mins":"8:41 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129035","author":"hugh_farey","post":"It is indeed a fascinating and well researched paper, and in Pam’s usual style, couched as a series of suggestions for other scholars to ponder rather slammed in your face as an indisputable fact, which is always refreshing. Her ideas about the Varangian guard are particularly interesting to me. However, a pointed rebuttal! 1) I think Pam is probably correct about the poker holes – they are not deliberate. However I cannot see anyone insensing a picture of half someone’s naked back. I think the scenario would work just as well if the cloth were folded inwards rather than outwards, so that there was no visible image at all. 2) The Pray manuscript has been discussed too many times to warrant it being brought up again. The rectangular blocks are clearly the tomb, not the cloth; the zigzag decoration looks nothing lke herring bone and the little circles are either mere decoration or some feature of the construction of the tomb and its lid. 3) The pictures of the Manylion are quite specific and show a smallish cloth with fringes round the sides and a diamond pattern of dots connected with lines. This seems to have been a popular pattern – Pam shows a lectern covered with it as well. However it looks nothing like herring bone, and I do not agree that it is an artistic representation of it. If anything it argues against the Mandilion being the Shroud. 4) Pam implicitly wonders if the long purple cloth that accompanies the letter, the Mandilion and its box in various illustrations could be a reference to the Shroud. I think not, as it is found just about everywhere when a functionary carried something important. It is not impossible that the length of cloth used to carry something reflected its importance, which would give some kind of relevance to the term tetradiplon. 5) The ‘Varangian’ guard illustration shows a man, probably an Emperor, being carried by his arms and legs. I do not agree that this is a reference to the Shroud, however odd or misplaced the picture may be..","date":"2014-06-13","mins":"5:18 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129417","author":"hugh_farey","post":"That’s perfectly true, Max. However, having established from my examples that the rectangular slabs are the tomb not the shroud, then it is a logical inference that the marks on them are marks of the tomb, not the shroud. Now what about some evidence for your flight of fancy about monks double entendres? Not repetition, evidence. I wish I could jump about shrieking The True Fact Is, You Haven’t Any, but every now and then, given enough goading, you do eventually come up with something. What about it, eh?.","date":"2014-06-14","mins":"9:41 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129627","author":"hugh_farey","post":"I think this is another occasion when we’ll just have to differ. I think the shroud is the crumpled thing on top of the rectangular slab, that the zigzag lines look nothing like herringbone, and that the holes are part of the tomb, not the shroud, and you think differently. Nothing wrong with that. Max, however, claims he has “crucial iconographic evidence” to substantiate your belief and to undermine mine. If it exists, it would be very helpful. Perhaps it would persuade me, and Charles Freeman for that matter, that the Shroud is indeed older than the 13th century. But there’s no sign of it….","date":"2014-06-14","mins":"7:36 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129446","author":"hugh_farey","post":"Max, everything I have is clearly expressed here so that everyone can understand my thinking. Paintings of marks on a box are intrinsically more likely to represent marks on the box than on a putative cloth lying in a crumpled heap on top of it. If you really have any evidence to contradict this, why not tell us what it is?.","date":"2014-06-14","mins":"10:55 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129715","author":"hugh_farey","post":"Are we getting a liitle extreme? (He says, fastening a pretty ribbon in his coat, pocketing his silver (!!! – if only) and opening the door marked “Hornéd Ones Only”) 1) Yes, I’m a practicing Catholic and it matters not a whit whether the Shroud was made 2000 years ago or 500 years ago or yesterday afternoon. 2) If I had an emotional preference, I’d like the Shroud to be authentic. I like “real” things so much better than “artificial ones” and old things better than new, in principle. Mike’s comments are absurd. “Hugh won’t believe because he doesn’t want to believe.” For a start he knows nothing of what I will or won’t do, and for a second, belief is not a matter of personal preference! And “Recently, he seemed to know more forensics than Zugibe, Barbet and Bucklin.” This is nonsense too, as you all know. In recent posts Mike has repeatedly named this holy trinity of pathologists as a unified bulwark against all possibility of fraud, but has yet to cope with the fact that Zugibe, in particular, thought Barbet incompetent. I did not, as you have read, disagree with either of their medical opinions, but they cannot both be correct. For his own reasons Mike shovelled a major diagreement among anatomists about the position of the nerves of the hand into a convenient cupboard marked “detail” in order to emphasise that they all agreed that the shroud was a picture of a dead body. 3) I have never swallowed a camel. 4) The BSTS as usual, like shroudstory.com and shroud.com, has got a fair minded, generous and kindly editor who represents everybody’s point of view impartially and does not let his personal incllnations intrude upon his editorship. 5) Thomas de Wesselow is a very persuasive art historian with many sensible things to say about the Pray manuscript. His comments on the polystaurion, in particular, seem relevant, although I disagree with his interpretation. In particular, he has homed in on the five little circles on the lower, cross covered rectangular shape. He does not comment on the fact that there are five, rather than the four of the shroud, and he does not even notice that there is a line of diagonal crosses interrupting the more rectilinear pattern at the same place. 6) Don’t we all look forward to Max’s “crucial iconographic evidence”!.","date":"2014-06-15","mins":"4:28 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129757","author":"hugh_farey","post":"Sorry, Mike, that’s what we scientists do. Overall conclusions are based on accumulations of detail, and one irritating little detail can throw a beautiful theory completely awry. Number of holes – well, it’s only a detail, pyramidal zig zags looking nothing like herringbone – trivial distinction, big line of three diagonal crosses – sorry, not relevant at all! Well, I’m afraid I disagree. What bothers me a little, if I may express a personal opinon, is not that some people make a connection between the Pray manuscript and the Shroud. There are unexplained marks on the manuscript, and I can understand how the connection is made. I just disagree. No, what bothers me is that unless I wholeheartedly concur with these opinions, I am a bigoted non believer, selling out to the devil. Is that what you really think? Thank goodness the BSTS Newsletter is in the hands of someone more evenhanded!.","date":"2014-06-15","mins":"10:09 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129777","author":"hugh_farey","post":"Sorry, Mike; I wasn’t continuing to refer to you specifically in my second paragraph. It was daveb who said (albeit somewhat tongue in cheek, I hope) that I had gone over to the Dark Side. However you have been at pains to suggest that I am simply adhering to pre existing beliefs in the face of more or less incontrovertible evidence (bigoted non believer). This isn’t true. I came to the Pray manuscript with an open mind, and have come to a different opinion from you. It’s not ridiculous, or a refusal to believe in the obvious truth, it’s as valid a position as your own. You did say that it was “ridiculous to claim that an artist can draw the weave and the image at the same time.” Ridiculous, note. What about the Lirey Pilgimage Badge? I think that artist has achieved the ridiculous, don’t you? And OK, it’s OK. I too often been called fool, not least by eminent commentators on this very blog, let alone others. I spent a very entertaining couple of months with randi.com at one point, and and well aware of the vituperation permitted on less enlightened sites than this! And sporadically I have been – as when I misquoted Fanti about the propensity of bleached and unbleached linen to darken or lighten in sunlight. What fun Max had with that. Incidentally, if you’re reading this, Max, what about your “crucial iconographic evidence”? Is it unfair to begin to think it doesn’t really exist?.","date":"2014-06-15","mins":"11:37 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130261","author":"hugh_farey","post":"On the “please show me” line of thinking. I agree that some aspects of the Pray manuscript do not appear to have contemporary parallels. However that does not necessarily relate it to the Shroud. In common with lots of similar scenes, it shows a rectangular box, an awkwardly placed lid, an angel posed on the lid, and a crumpled cloth. There are so many of these that to suppose the Pray manuscript shows something different requires a leap of imagination that I am not prepared to take. Max’s idea that the rectangular shapes are indeed the tomb, but with symbolic representations of its contents, make better sense. I do not think I have seen another picture of a sepulchre covered in crosses, although there are examples of scuptured ones, but it became a decorative feature of Byzantine textiles – specifically priestly garments – in the 11th century. The pattern seems to indicate ‘priestly contents’, as it were, and would apply just as well to a tomb containing a ‘priest.’ It need not indicate the shroud. Most of the similar tomb scenes show one side and one end of the tomb. The end wall mostly angles upwards, but in some cases only the top edge is angled and the bottom edge is as horizontal as the side wall. It’s a bit of an artistic challenge. This painting shows a very similar shape to the Pray picture (http://www.journeywithjesus.net/Essays/20090406 JJ.shtml) and I think the diagonal line of crosses on the Pray picture may be meant to indicate the corner of the tomb..","date":"2014-06-17","mins":"12:16 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130369","author":"hugh_farey","post":"Well, I agree with two thirds of that, Max. What more could you hope for?.","date":"2014-06-17","mins":"5:20 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130391","author":"hugh_farey","post":"Well, with your permission I’ll just carry on squirming! I do not nor have ever compared the Pray Manuscript to Burial or Lamentation scenes. “The Three Marys” has a very strong iconographic tradition of its own, and in almost every case the depiction shows a rectangular tomb, an oddly placed lid, a posing angel and a rumpled shroud – and three Marys, usually carrying ointments. There is absolutely no tradition of a stiff shroud replacing the oddly placed lid (although either the lid or the shroud or both are occasionally omitted altogether). Jesus himself is an occasional invisible presence (we can see him, though), and guards, either asleep or in panic, are an option. The decoration of the tomb is highly variable, and the decoration of the lid is often different from that of the tomb itself. Were it not for the little circles, no one would have thought it associated with the shroud for a moment. Ah, but the little circles….","date":"2014-06-17","mins":"5:55 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-207318","author":"hugh_farey","post":"“Hugh cannot make a single positive point in favour of the proposition that is not easily refuted.” Hugh doesn’t want to make any such point. Hugh has been at considerable pains to agree with every point against Leonardo da Vinci painting the Shroud. Hugh doesn’t think that Leonardo did paint the Shroud. Hugh wonders why the anti Leonardo faction are so desperate to prove him ‘wrong’ when he has never supported the da Vinci hypothesis from its very inception. Hugh wonders why authenticists of the Shroud in general spend so much time denying and refuting non existent non authenticist arguments. If the Shroud as we know it today is not the Shroud of 1350, then it is far more likely to have been made as a replacement after the 1532 fire, which, as reported, would have destroyed the original. But before daveb leaps in with da Vinci’s death in 1519, such a scenario denies the 1350 radiocarbon date, unless there were bolts of the cloth lying around for hundreds of years just in case. That date, incidentally, is also by far the best reason why Leonardo didn’t paint the Shroud even during his lifetime, although noticeably missing from the anti Leonardo arguments above..","date":"2015-08-03","mins":"3:39 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-207326","author":"hugh_farey","post":"Oh, yes. So it was..","date":"2015-08-03","mins":"5:22 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-207233","author":"hugh_farey","post":"There are many good reasons why the Shroud as we know it was not painted by Leonardo da Vinci, but the fact that he was born in 1452 is not one of them. Not one proponent of the da Vinci hypothesis is ignorant of the discrepancy between the dates, and the first thing they invariably do, before any consideration of how much the Shroud looks like Leonardo or his style, or opportunity or reason to create it, is to try to reconcile the problem, usually by claiming that the original was destroyed and had to be replaced. This being so, why does every critic of the Leonardo hypothesis invariably produce this old chestnut as their first (or even only) comment? Some deep seated insecurity there, I reckon….","date":"2015-08-02","mins":"4:08 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-207245","author":"hugh_farey","post":"Wriggling, daveb, wriggling…. I agree with everyone of the points you made above, but you didn’t start with them, did you? You started with the old joke that the Shroud existed before Leonardo was born, and that therefore he couldn’t have done it. That’s what they all start with. It’s only when it’s pointed out that nobody on the Leonardo side is unaware of the respective dates that any real attempt to discredit it is made. First the Straw Man, then the reasoned argument. I wonder why..","date":"2015-08-02","mins":"4:50 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-207255","author":"hugh_farey","post":"More very good reasons why Leonardo probably didn’t paint the Shroud; my first comment began with the fact that there were many such. Strange that authenticists (It’s not just daveb) begin with a spurious one, don’t you think?.","date":"2015-08-02","mins":"6:24 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-140092","author":"hugh_farey","post":"Is this ‘gammadion’ as widespread as is implied by some of the above? There do seem to be some references to the Trinity, which I think have more to do with the letter’s third position in the alphabet rather than the number of points. Pictorially, a delta is far more frequently found as a reference to the Trinity. Overall, it seems to me, the gammadion nearly always refers to an L shape with equal length arms, often four at a time, either with their ends touching, forming a svastika, or with their angles almost meeting at the centre of a cross, which may be upright or diagonal. Ecclesiastically, the chief examples seem to be found in a single church, in Ravenna, where they are found in conjunction with Ns, Zs, Is, Hs, Rs and various other symbols adorning the the togas of holy people. It is not obvious that the gamma has any special significance of its own. In modern times, the gamma as a corner shape is often found in conjunction with the polystaurion worn by Byzantine clerics, where it may be a fortuitous reference to the Trinity. As for why the ‘poker holes’ weren’t repaired, was this because there was simply no need, as they have well defined edges, so not in danger of fraying. They are sometimes described as being fringed with a pitch like substance (insense?) which might act as some kind of glue..","date":"2014-07-24","mins":"3:44 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-121089","author":"hugh_farey","post":"This is a fascinating exercise and I thoroughly congratulate OK on his work, although I have to say I think his explanation for the ‘wrong’ positioning of the side wound (or bloodied foot) is weak. If the image on the shroud was thought of as a painting, then the side wound is on the left and the footprint is a left foot, so the right foot is on top. If the shroud is thought of as a mirror transfer, then it is the other way round. Post 13th century crucifixes almost invariably (according to OK’s research) have a right side spear wound and a right foot atop. Contrary to what OK suggests, I think the position of the side wound should be considered prime, in that it could not have changed between crucifixion and enshroudment. The feet, of course, could have been placed differently after Christ was taken down from the cross. I don’t agree that a miraculous image taken directly from the saviour was considered less truthful than a vague metaphorical Old Testament reference. Not unless the artists knew that the shroud was not a miraculous image but a human painting. However, the uncertainty leads to an interesting dichotomy. If artists followed the 1st century shroud, then they almost uniformly got some major aspects of it wrong (foot and palm nails, for example) – but if the 13th shroud followed earlier artists, then its author worked in distinct opposition to what was to become the norm. As usual, I guess, we’ll all have to keep our own counsel. As I work in a Catholic school, we have a number of crucifixes around the house. Although they all have the wound in the right side, about 25% have left feet atop. I would like to suppose that although earlier crucifixes were not derived from the shroud at all, as most people considered it unlikely to be genuine, the publicity given it since the turn of the 20th century means that increasingly, modern crucifixes have been based on it. I predict that by 2100 all crucifixes will be left atop!.","date":"2014-05-18","mins":"7:44 am","url":"https://shroudstory.com/2014/05/18/paper-chase-a-revolution-indeed/","cat":"art","title":"Paper Chase:  A Revolution Indeed (with revised PDF file)"},{"id":"comment-174295","author":"hugh_farey","post":"Whatever Colin’s expertise in biblical exegesis, he is clearly echoing the interpretation of a large number of artists, considering how many paintings there are of large areas of cloth draped around the corpse as it was lowered. If Colin’s interpretation of scripture is unjustified, he is nevertheless in good company..","date":"2014-12-02","mins":"7:37 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174456","author":"hugh_farey","post":"Google “deposition” “Christ” into images, and see how many paintings include a large sheet, in addition to the almost universal loincloth. It is certainly not rare to see such a thing in a depostion scene. It may even be the norm..","date":"2014-12-03","mins":"7:58 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174305","author":"hugh_farey","post":"I don’t think the word deposition originally included a suggestion of where the subject eventually ended up. De position meant the moving of something from somewhere, not to somewhere, if you see what I mean. The current meaning of the word deposit, where the place where the subject ends up is more important than where it comes from, is relatively modern..","date":"2014-12-02","mins":"9:15 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-143500","author":"hugh_farey","post":"I’m told by some people that if you look closely at Leonardo da Vinci’s Last Supper, you can make out what appear to be the faces of 13 people above coloured blobs that, viewed in the correct light, look almost as if they resemble bodies around a dining table. I mean, pareidolia or what?.","date":"2014-08-12","mins":"5:20 am","url":"https://shroudstory.com/2014/08/12/you-would-think-someone-at-livescience-would-know-better-by-now/","cat":"pareidolia","title":"You would think someone at LiveScience would know better by now"},{"id":"comment-72591","author":"hugh_farey","post":"Louis, I’ve had a detailed look at the link you posted above, and find it a little confusing. Before we get into the Shroud, we get a brief survey of some typical Israeli plants: Phoenix dactylifera, Olea europaea, Anastatica hierochuntica, Anemone coronaria, Capparis aegyptia, Cistus creticus, Chrysanthemum coronarium, Hippocrepsis unisiliquosa, Ridolfia segetum, Rhamnus lycioides and Ziziphus spina christi. Next we get some of the plants ‘identified’ as having left marks on the Shroud: Gundelia tournefortii, Pistacia sp. And Zygophyllum dumosum, Rhamnus licioides, and Anthemis bornmuelleri or Matricaria recutita, as well as the Capparis aegyptia, Chrysanthemum cononarium and Cistus creticus previously mentioned. Of these 17 plants, only 7 left their pollen on the shroud, according to Max Frei, and he identified a further 51 plants which do not appear on Danin’s list at all. Phoenix dactylifera and Olea europaea, (the date palm and olive tree) are prolific wind blown pollinators, so it is strange that Frei did not identify any pollen at all from them, nor from either Anthemis bornmuelleri or Matricaria recutita, whose flowers are identified as clustered thickly around the head. Neither of these plants is found near Jerusalem anyway. Spines of Rhamnus lycioides, Gundelia tournefortii and Ziziphus spina christi are suggested, implying that the crown of thorns was a most elaborate affair carefully composed of strands of three different bushes. Max Frei only identified pollen from Gundelia, although the other two also flower at the same time. Finally, Danin considers Zygophyllum dumosum as a particularly indicative plant (and its pollen was identified by Frei), which would be more convincing if the plant grew in Jerusalem, which it doesn’t. Looked at as a whole, the whole plant identification issue looks more like a cross between pareidolia and simple wishful thinking than any systematic analysis..","date":"2014-01-08","mins":"10:15 am","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","title":"Pareidolia Again"},{"id":"comment-188483","author":"hugh_farey","post":"How strange. I see the frontal image as being on the left, as we look at it, and the head and shoulders dark shape on the right as the back of the head and the hair spread out over the shoulders. The feet at the left end of the cloth look to me like the top of the feet, and the dark feet at the right end look like footprints. I see no indication of the seam at all. I also don’t think it’s fair to say that it could be upside down, even if the images were the opposite of the conventional. I don’t think it matters which way up it is! Finally, any depiction of the shroud being held by holy people is to a certain extent impressionistic, as of course anybody holding the shroud can’t actually look at it. All those bishops and priests perched at the top of the display platforms that we see in all those engravings could not have been engaged in contemplation of the face of their God. Perhaps they all had private viewings inside the church later..","date":"2015-02-02","mins":"1:55 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-188108","author":"hugh_farey","post":"How very odd. Firstly, the almost complete disappearance of the ventral image, in contrast to the dorsal, and not only the image itself, but even the burn patches from 1532. It is not even possible to make out which arm crosses over which, and there are absolutely no blood flows. Secondly, the picture has been restored. Why did it need restoring? Was it because the faithful, touching the frontal image with lips or fingers, had more or less eroded it away? (The painting, I mean, not the Shroud itself) And thirdly, the feet are spread apart and outwards, very unlike the Shroud, which makes us wonder how carefully the artist really observed it. Very interesting..","date":"2015-02-01","mins":"2:24 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-192075","author":"hugh_farey","post":"Do you know, the more I see pictures like this (the Black Madonna one was another), the more I become convinced that there must have been two distinct shrouds of Turin, in the same cathedral, at the same time – the one we know, from which the various ex origine copies were made, and the exhibition one, which appears in every single engraving and painting of the Shroud being held up. The two traditions are too identical in themselves (faint image, no loincloth, feet together, distinctive blood belt versus bold image, loincloth, feet apart, no bloodbelt) to be independent painterly interpretations of the same thing. It seems that the exhibition copy was either made after the 1532 fire, or had the marks of the fire added to it (not particularly correctly). Slightly tongue in cheek corollary: this being so, the Shroud we know was not held at the corners by countless grubby fingered ecclesiastics, was not contaminated by episcopal grime, and did not fray such as to require mending, invisible or otherwise….","date":"2015-03-01","mins":"4:30 am","url":"https://shroudstory.com/2015/03/01/picture-for-today-fresco-in-pinerolo/","cat":"art","title":"Picture for Today: Fresco in Pinerolo"},{"id":"comment-192101","author":"hugh_farey","post":"The trouble is that it’s not just the loincloth. The posture of the arms, legs and feet and the lay of the hair are pretty consistent across the ‘exposition’ pictures, and completely different in many of the ‘ex origine’ pictures. Furthermore, unless they kept popping the loincloth on and off, these two series of pictures are more or less contemporaneous over years and years. Fossati’s list of copies (http://www.shroud.com/pdfs/ssi12part4.pdf), has non loinclothed versions from 1516, 1571,1634, 1643 and finally 1898, and loinclothed versions from 1620, 1646, 1652, 1653, 1678, 1697, and 1708. In the non clothed versions the feet are crossed or point straight down, in the others the feet splay outwards. He has cropped his images too tightly to see whether the loinclothed ones are in fact cropped from exposition pictures. Fossati also lists some less specifically dated copies. 1588 – no loincloth, 1649 – no loincloth, 1652 – no loincloth. I agree that the idea that there were two Shrouds in the same place at the same time is unsupported by any other evidence though!.","date":"2015-03-01","mins":"10:04 am","url":"https://shroudstory.com/2015/03/01/picture-for-today-fresco-in-pinerolo/","cat":"art","title":"Picture for Today: Fresco in Pinerolo"},{"id":"comment-124766","author":"hugh_farey","post":"What a brilliant set of pictures. If I have one caveat, Russ, it would be to suggest that the selection of a single much handled corner for radiocarbon dating was not the choice of the radiocarbon labs, as you imply. (“Apparently, the carbon dating labs didn’t know that” “cutting one sample into three pieces is not the same as cutting three different samples.”) Such protocols as had been decided by the labs’ representatives had specifically argued against that. They were overruled by the scientific advisors to the bishop of Turin, who are reported as having argued among themselves for a hour or so before finally picking on the area anyone could have predicted years previously. One wonders very much whose the final decision was (Riggi), and why..","date":"2014-05-26","mins":"9:25 am","url":"https://shroudstory.com/2014/05/26/pictures-of-ostentations/","cat":"art","title":"Pictures of Ostentations"},{"id":"comment-132512","author":"hugh_farey","post":"Under appropriate magnification, the step pattern is apparent. Without a microscope (see Shroud Scope or Shroud 2.0) it is not. However, even assuming microscopic eyesight, the Pray Manuscript looks nothing like the shroud. If the photo above covered a greater area, and was rotated 90° we would see these steps going up one side and down the other and then up and down again, in a sort of zigzagged zigzag. What we would not see, but what the Pray artist very clearly intended, is a series of concentric zigzag ‘semi circles’ radiating outwards from at least six centres. This looks much more like a representation of red marble (see The Burial Lamentations by Theophanes the Cretan for a similar attempt) than any weaving pattern..","date":"2014-06-23","mins":"9:34 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132552","author":"hugh_farey","post":"That’s a bit of non sequitur there, OK. Whether the lines behind the angel are a building, a fence, or even a chair does not invalidate the overwhelming probability that the angled slab is the same angled slab as appears in countless similar depictions of the Three Marys scene..","date":"2014-06-23","mins":"3:02 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132585","author":"hugh_farey","post":"Behind the angel there are three lines, two more or less horizontal and one more or less vertical. How you can be so dogmatic about what they represent is beyond me. But suppose it is a bench, and the angel is sitting on it, so what? He’s still got his feet on the marble slab. I really don’t see how interpreting the ‘thing’ as a bench automatically refutes the possibility that the slab is a slab. It’s a complete non sequitur..","date":"2014-06-23","mins":"6:51 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132097","author":"hugh_farey","post":"No. Absolutely not. OK has demonstrated, quite succesfully, that the Pray manuscript is probably unique in many ways; he has not in any way demonstrated that it is derived from the Shroud. Speculations such as the probability of finding wavy lines, or zigzag patterns, or even patterns of dots, mean absolutely nothing unless he can demonstrate that these must indicate some sort of relationship with the Shroud, which, as the previous blog and comments have shown, is far from accepted. Even the nudity, crossed hands and four fingers, which really are present on the Shroud, are not necessarily derived from it. As usual, he does not see the importance of a control. Let’s take the Giovanni Battista della Rovere painting as a comparison. Below the section of the angels holding the Shroud, we have a section showing the Shroud actually being laid on Jesus. 1) The Shroud shows a naked man, the Rovere shows a man with a loin cloth. 2) The Shroud shows a man with feet crossed, the Rovere shows them straight. 3) The Shroud shows each hand with four fingers, the Rovere shows five. 4) The Shroud legs are covered in scourge marks, the Rovere has none. 5) The Shroud arms are covered in rivulets of blood, the Rovere arms are not. What are the chances that a painting of the dead Jesus which is “wrong” in all these respects owes anything to the Shroud? Astromomically unlikely, I think anyone would agree. And yet there is a painting of the Shroud on the very same canvas! An attempt to list the similarities between the Pray manuscript man and the Shroud is not worthwhile unless a similar attempt is made to list the differences. 1) The Shroud man lay on one end of the cloth, the Pray manuscript has the man in the centre. 2) The Shroud man has a big beard, the Pray manuscript man does not. 3) The Shroud clearly shows wounds, the Pray manuscript man none. And the similarities the Pray manuscript picture has to similar “Three Marys” scenes. 1) What proportion of Three Mary’s scenes show a box like tomb? 2) What proportion of Three Mary’s scenes show an angel sitting on an angular slab? 3) What proportion of Three Mary’s scenes show a crumpled Shroud? If you see a Three Mary’s scene containing all these elements, what is the chance that in fact none of them correspond to their conventional significance – that the box is not a box but the bottom of a sheet, that the slab is not a slab but the top of the same sheet, and that the crumpled shroud is a repetition of that same sheet, with wavy lines to represent blood? Chesterbelloc says something interesting: “I don’t know how anyone couldn’t at least wonder about these things, instead of dismissing them out of hand.” Well neither do I. I have wondered, tracked down endless versions of the Three Marys, and attempted to explain the anomalies without trying to hide them or explain them away. I have considered the possible significance of the zigzag pattern, the polystaurion pattern, the line of diagonal crosses and the little holes on the top surface. I have wondered about the design of the shroud crumpled on top, the sharp horizontal line that apears to slice it in two, the little Xs that appear all over it and the wiggly lines at the bottom. I have wondered why the figure of Christ is so unconventionally stubble bearded and why the shroud he is lying on has a little pleat under his buttocks. Most of these wonders I have commented upon on this very website. May I rephrase Chesterbelloc’s comment: “I don’t know how anyone couldn’t at least wonder about these things, instead of instantly accepting them without reserve.”.","date":"2014-06-21","mins":"11:49 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132987","author":"hugh_farey","post":"Me again. A) “May naked Jesus on the HPM be be derived from TS? Yes.” No. A figure derived from a supposedly genuine image of Jesus must look a bit like him. Specifically, it must have a full beard and a moustache. If it doesn’t have those fundamental identifying characteristics, it cannot be considered the same man, regardless of the pose or the nudity. B) “May 4 fingers, without thumbs on both hands of Jesus on the HPM be derived from TS? Yes.” No. Byzantine pictures often show people with no thumbs, but it was not until I studied David Mo’s selection that I realised how many. A third or so of his images show Jesus, and often others, with no thumbs. If the Pray manuscript may derive from the Shroud, then so may all the other Byzantine people with no thumbs, which is absurd. C) “May cropped Jesus legs on the HPM be derived from TS? Yes.” No. For a start we don’t even know if the image is cropped, and for a second the fact that both shroud and feet are cropped does not demonstrate any kind of connection between the Shroud and the Pray image. I consider this very far fetched indeed. D) “May zigzag patern on HPM represent herringbone weave on TS? Yes.” No. I’ve explained why not, and do not need to go into it further. E) “May two red smudges on the rectangle on HPM represent blood belt on TS? Yes.” No. The blood belt on the shroud shows interlacing lines, the Pray lines are alongside each other. It is inconceivable that an artist would represent interlacing lines with parallel ones. F) “May the four L shaped circles on the HPM represent poker holes on TS? Yes.” No. They are not on the Shroud but the Tomb. “Can you prove the opposite, to any of the point A F? No.” No, nor can I prove that Timothy Linick was not a Soviet spy, or that Jesus wasn’t abducted by aliens. OK is confusing probability with proof. “The crucial question is: what is a chance of finding all those elements at random on a single card of a Codex?” Well the answer is: absolute certainty. Because there is such a page. That is not the crucial question at all. The crucial question is: are the two images sufficiently similar, or do the images contain sufficient similar allusions, to make it likely that one derives from the other, and that they do not both derive from a different common source This is not a matter of mathematical calculation, as the weight of each feature is largely subjective. OK and daveb think the matter conclusive one way, Charles and I think their conclusions are wrong. So it goes. “I am not interested what the artist actually wanted to depict.” That is a pity, because I think the intention of the artist is a fascinating question. Does the polystaurion pattern reflect the Jerusalem staircase? Are the radiating zigzagging semicircles depictions of the marble of the Stone of Unction? Why is the Shroud shown as if it were almost transparent? And what are those little holes on the slab? These are much more interesting questions than inquiries about the supposed similarity between the Pray image and the Shroud..","date":"2014-06-26","mins":"5:25 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132994","author":"hugh_farey","post":"I do indeed, and to be frank I do not think the figure in the Pray manuscript can derive from the Shroud. I have been trying to imagine myself as a Benedictine monk who had seen the Shroud, setting off to illustrate a liturgical text. The most important aspect of the Anointing scene would not be the furniture or even the pose of the body, it would be the depiction of he dead Christ. It is inconceivable that someone who thought he knew what Christ looked like at the very moment he was attempting to paint would not attempt to depict him accurately, complete with moustache and beard. So yes, I deny the possibility that the Pray man derives from the Shroud. Is that not reasonable?.","date":"2014-06-26","mins":"6:05 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132999","author":"hugh_farey","post":"That’s not a fact. Three of your identities depend on a conviction that the Shroud and the Pray manuscript are related in the first place (herringbone, cut off feet and blood chain), and another depends on a denial that the rectangular blocks on the Pray manuscript are what they are in dozens of similar scenes (holes). One derives directly from the biblical situation (nudity) and the last is true of many completely unrelated Byzantine figures (four fingers). Your original collection of probabilities simply demonstrates that there is only one Pray image, not that it has any relationship to the Shroud. There are not “six major, independent peculiar details shared between HPM and the Shroud.” That is simply wishful thinking..","date":"2014-06-26","mins":"6:33 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133054","author":"hugh_farey","post":"I think daveb’s comment above is excellent, which I why I left the topic for a while before popping back in. The Pray illustration is certainly a bit of a puzzle, and among others I have been grateful to Max for sending me off to find out more about polystaurion patterns, to Charles for reminding me of the Jerusalem pilgrim steps, to David Mo for his astonishing collection of images (I tried, but although Three Marys are two a penny on the internet, Lamentations seem hard to come by), and to the inspiration from others that drove me to inquire about the architecture of the buildings around the Sepulchre and the marbling pattern on the Stone of Unction. I have wondered why so many artists, seeking to preserve Jesus’s modesty, have done so with cloth which is clearly transparent, and I have sought books on the iconography of gestures (without any useful success). Anything I found which I thought was relevant I have brought to the table for inspection. I am firmly of the conviction that sooner or later someone will find a smoking gun, maybe a Byzantine image of an angel holding up a sheet with a pair of full length bodies on it, or a sketch by Durer with ‘must complete by Tuesday’ scribbled in the corner. It will be hard to find, and to most people not worth the bother of looking, which is why the passion insired by this, and others of Dan’s postings, is so important to Shroud research. So I ask people reading these comments, perhaps Charles, myself, Davids Goulet and Mo, on one side, and perhaps OK, Max, Daveb, Thomas, Tristan, Nabber, Louis and others on the other, let us not simply bang our heads on our various walls in frustration and think that those who think differently from us are just being obstinate, but keep Googling! The truth is out there!.","date":"2014-06-27","mins":"3:04 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133094","author":"hugh_farey","post":"Might I suggest tooooooooooooooootaaaaaaaaaaaaaallyyyyyyyyyyyyy as an alternative spelling? It seems to capture the elongated vowels so much better, don’t you think?.","date":"2014-06-27","mins":"8:47 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133123","author":"hugh_farey","post":"I don’t believe anybody would look at a zigzag pattern on a rectangular slab and say: “I wonder if that could be depicting a cloth with a herringbone weave,” unless they were previously convinced that the depiction was, indeed, just that. Nor could anyone see the torn edge and and think: “I guess the artist wants us to realise that there are no feet on the Shroud” unless they already knew that the Shroud has no feet on the ventral image. I suppose the wriggly red lines could be interpreted as depictions of blood flows, but they are no more coincident with the Shroud blood flows than they are with hundreds of other pictures. What are the chances of finding a depiction of Jesus with blood on him? Rather better than 1/100. “Read the whole article again.” No, let’s not, I understand it perfectly and I disagree with it. Let’s try to find something new..","date":"2014-06-27","mins":"12:18 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133095","author":"hugh_farey","post":"How’s the crucial iconographic evidence coming along, Max?.","date":"2014-06-27","mins":"8:48 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133242","author":"hugh_farey","post":"“all the shroud like signs displayed on it. ” “six points of independent congruence.” “stubborn” “bias” “intransigent” “talking rubbish” “ignorance” Both the Shroud and the Pray manuscript show a naked man, with his crossed over his groin, and four fingers on each hand. There are no other shroud like signs, and no other points of independent congruence. No facial resemblance at all, no wounds, no double image or indication thereof. The Pray manuscript is cut off at the edges, has a pattern of six concentric zigzag semicircles, has two unexplained groups of circles, and a couple of parallel wavy red lnes near the hem of a crumpled, transparent cloth. Only one of these (one of the groups of circles) is “shroud like,” and none of them are “points of independent congruence.” Again I have a problem, not with those who disagree with the view above, but with those who appear not even to understand it. Scan the last 300 comments on this topic – over two posts. How many times have the authenticists been derided as stubborn, biased, ignorant rubbish talkers? And how many times have the sceptics? What does scepticism mean anyway? Denial? Refusal? Obstinacy? No, it doesn’t. It means Doubt, Questioning, Inquiring. Scepticism is good. What have we Inquirers brought to this discussion? In no particular order: the beard, the position of the arms in burial archaeology, dozens of images of the Three Marys and Lamentations, the Hookham bible, the Stone of Unction, Egyptian pyramid design, the stairs of St Helen’s, the Shroud of Cadouin. What have the true believers brought? Is there any other example of zigzags being used to represent herringbone? Is there any other example of a rectangular slab representing cloth? Is there any other example of parallel wavy lines representing blood? Who fails to understand whom here? Who is obstinate, ignorant and intransigent? I understand my opponents. I do not agree with them. Can any of them say the same of me?.","date":"2014-06-28","mins":"3:23 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133623","author":"hugh_farey","post":"I guess we’ll just have to differ. No hard feelings..","date":"2014-06-28","mins":"3:57 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133578","author":"hugh_farey","post":"Yup, that’s us, ignorant, irrelevant, uncomprehending, illogical, obsessive, absurd, desperate and poisonous. All in a few column inches. But we’re right, aren’t we? The six independent, non trivial and undisputed points of congruence are crumbling away before your eyes. Shore them up, quick! Show us where else concentric semicircles represent herringbone, or a rectangular slab represents cloth, or a fringed hem represents blood? Show that David Mo is wrong, and that his collection of Lamentations (30% naked, 30% four fingered) is unrepresentative of the whole. Show us where else a representation of the man in the shroud appears young and beardless. Or carry on telling us we’re ignorant, irrelevant, uncomprehending, illogical, obsessive, absurd, desperate and poisonous. That’s so much more likely to persuade us you’re right… (You can add ‘sarcastic’ to the list now; I can take it!).","date":"2014-06-28","mins":"3:19 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134519","author":"hugh_farey","post":"I now have a copy of Forsyth’s book. The images he refers to: “among numerous examples, the three circular holes are represented in the twelftth century on a capital at Modena [I can’t find this], a relief at Monte San Angelo (Foggia) [https://sites.google.com/site/modillonsetpeinturesromanes/Italie/monte sant angelo], the lintel over the south portal of Saint Gilles at Arles [http://www.medart.pitt.edu/menufrance/sgilles/frieze/sgscfrieze.html]; and a capital of the south portal on the west façade at Chartres [http://www.bluffton.edu/~sullivanm/chartreswest/capitals.html]. For the thirteenth and fourteenth centuries one can cite the corona of Window E of Canterbury [http://www.themarlowestudies.org/stainedglass1.html]; a Limoges enamel shrine from Cherves, near Cognac, now in the Metropolitan Museum of Art [http://www.historyandcivilization.com/Tabernacle of Cherves  made in Limoges  found in 1896  Copper  repouss    gilt  champlev   enamel  c 1220 1230  Met .jpg – left hand panel]; the choir screen of Bourges [I can’t find this]; a relief in Elne Cathedral [nor this], and some similar French ivories illustrated in Koechlin, III, pls. XIII and XIV.”.","date":"2014-06-30","mins":"2:00 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134655","author":"hugh_farey","post":"That’s a fantastic collection, David; thank you so much..","date":"2014-07-01","mins":"7:32 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134681","author":"hugh_farey","post":"I think daveb makes a worthwhile point, about the miraculous relic not being the subject of the Three Marys scenes, but if I may I would disagree about the conclusions he draws. Other commentators have suggested that had the Shroud been known about when the Gospels were written it would have been mentioned in them. I don’t I agree with that. It could even be that the fact that any burial cloths are mentioned at all is evidence of their importance. However hundreds of years later, when not only the Shroud, but its images and its poker holes were known about, it would surely have been the central focus of any iconography about the empty tomb. To omit its discovery in the Three Marys scenes would be to lose one of the most important points of the occasion (the first being the disappearance of Jesus himself). The fact that no other Three Marys scenes give any great prominence to the shroud, even those from well before and well after the Pray drawing, is an indication to me that it had no great prominence, and was, in fact, not known about. But pay no attention, as apparently now I’m a blind, ignorant, irrelevant, uncomprehending, illogical, obsessive, absurd, desperate, poisonous, dishonest, deceitful, envious, fearful, fanatical, sychophantic moron..","date":"2014-07-01","mins":"9:11 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134818","author":"hugh_farey","post":"I think this is a valid point and worth thinking about. However, I don’t think these scenes are ‘resurrection’ scenes. They are ‘what happened next’ scenes. Even if the Shroud had been omitted from the Gospels, which I think can be explained in terms of secrecy and uncleanness, I don’t think that, if it had any reliquary importance, it would have been omitted from later Three Marys scenes. Indeed, as I said above, one of the major themes of such scenes would have been the discovery of the relic, which must have been shown rather more explicitly than by a couple of wavy lines and some holes. (By the way, are we not making rather a large assumption in supposing these burns to have pre dated the Pray manuscript. They may well not have occurred until much later!). OK made the point that, even after the Shroud’s incontestable date of existence, Three Marys scenes still do not show it. The reason for this, I fear, is not that artists felt it detracted from the scene, but that they didn’t think it was there in the first place. I think it most unlikely that an artist believing that the image of Christ was left behind in the tomb after the resurrection, would not include it in any depiction of it. In my experience of medieval relics (minimal), what was important to the faithful was not what it looked like – any old sheet would have done – but its provenance, and artistic renderings of its discovery would abound, rather as all those pictures of nails, crowns of thorns, whipping stones and so on tend to resemble a supposed relic rather than any actual archaeological artifact. Or does this defy logic?.","date":"2014-07-02","mins":"2:41 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135058","author":"hugh_farey","post":"“Arrogant” now. I’m thinking of writing a thesaurus….","date":"2014-07-03","mins":"5:57 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135077","author":"hugh_farey","post":"I think daveb is right that epitaphioi may play a significant part in the Shroud story. Those who think it 13th century have a responsibility to find a context for it, and liturgical rites seem a very good place to start. Just as authenticists see cryptic references to the Shroud in pre 13th century images, so non authenticists must see some sort of reference to the easter liturgy and its traditions in the Shroud. And I freely admit this has not been well established. Yet..","date":"2014-07-03","mins":"8:16 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135152","author":"hugh_farey","post":"The Editor of the Newsletter of the BSTS will be glad to accept any submissions refuting the work of any of its members. He is unlikely to respond well to anybody who dismisses one of the most important pioneers of Shroud research ever simply by calling it “trash,” and insulting his mathematical skills. The bold words “It is really a trash, and I know what I am talking about” need substantiating or rescinding, for as they stand, they bring far more discredit to their author than they do to their subject..","date":"2014-07-03","mins":"4:15 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132154","author":"hugh_farey","post":"I don’t think we’re getting any further. I don’t think the zigzags look anything like herringbone either, but OK thinks they’re sufficiently similar to warrant a comparison. That’s fine, but it isn’t evidence. Stalemate. I also think the whole picture has been trimmed to make it fit the Codex, which explains why Jesus’s feet have been cut off, and possibly the angel’s wing the other side. I may be wrong, but it’s a far more likely reason than a secret allusion to the Shroud. Max has only given half of the fingerprint identification technique. There must indeed be several ‘points of congruence,’ but also, there must be no ‘points of difference’ at all. However similar two fingerprints may appear, and however many points of congruence there are, if there are any places where the two prints are clearly different, then they are not the same. Try applying that to the Pray man. I don’t know what that shape is behind the angel, nor do I think it relevant. The Pray manuscript picture has three prominent features in the correct configuration for it to be a fairly typical Three Marys, with rectangular tomb, oddly placed lid (if lid it truly be; I have long wondered if it is something else, misidentified, such as the annointing stone), and cloth shroud. The chance that these three elements do not, in this particular case, represent those three things is, to my mind, very remote..","date":"2014-06-21","mins":"4:18 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135177","author":"hugh_farey","post":"Not at all..","date":"2014-07-03","mins":"5:40 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135211","author":"hugh_farey","post":"I think you miss the thrust of my argument. There are various reasons why the Shroud was not mentioned in the Gospels, which could have been for reasons of uncleanliness, secrecy, or, indeed, because there was no image on it then. However, after the Shroud was known to have an image on it, that’s when I think it unlikely not to have been depicted as such. I think it unlikely that an artist would have assumed that the image was not contemporaneous with the resurrection (how could he have known?), and do not agree that the Byzantines were shy to depict their relics – the Mandylion was widely illustrated. Rabid, now. Another for the thesaurus. I’m sorry that you have decided to class me as rabid. I wonder if you, or OK or Louis, can accept that there could possibly be such a thing as a non rabid non authenticist. I don’t think authenticists are rabid. I think there is much to be said for their arguments – i just don’t think they are sufficiently convincing. Perhaps one day they will turn out to be. Does this sound rabid? Perhaps I’m old fashioned, but I would think that a group of people who describe their opponents as rabid, arrogant, ignorant, irrelevant, uncomprehending, illogical, obsessive, absurd, desperate, poisonous, dishonest, deceitful, envious, fearful, fanatical, sychophantic and complete morons, sound just a tiny bit defensive, wouldn’t you say? When you say you are “happy to debate the pros and cons of the authenticity of the Shroud, and its various enigmatic properties with those prepared to discuss it with an open mind,” do you have anybody in mind? How can you discuss pros and cons if you think anybody who disagrees with you is a rabid fanatic?.","date":"2014-07-03","mins":"8:57 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135260","author":"hugh_farey","post":"Well, that’s all much more sensible – I think I can stop foaming at the mouth now..","date":"2014-07-04","mins":"3:02 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135349","author":"hugh_farey","post":"Well, no. The iconography of the Three Marys very rarely has anything that looks as if it was carved out of rock – a cave. The earlier ones show the tomb as a building, sometimes just a big doorway, which I suppose could be interpreted as the built up entrance to a cave, but mostly they seem to be round temple like buildings, complete with domed roofs, and seem to me to be derived from the Holy Sepulchre rotunda in Jerusalem. The angel is often sitting on a squarish stone – very rarely a round one – which has sometimes been ‘turned’ to an odd angle. The modern concept of a round millwheel like stone rolling away from a hole in the hillside is wholly foreign to these pictures. If the stone the angel is sitting on is not the entrance to the tomb, then it is probably modelled, as Carlos suggests, on the Stone of Unction. Later there comes a transition stage in which the building is still there, but a rectangular sarcophagus is also illustrated, and later still the building goes completely and the the angel’s stone becomes the lid of the sarcophagus. This transition and one or two variations of it are very clearly evident if one prints out all David Mo’s, and Carlos’s examples. The architectural elements of the Pray manuscript fit very well into the tradition. The building has gone, the sarcophagus (the polystaurion block) remains, and the skewed ‘lid’ could be either the stone of Unction or the lid of the sarcophagus. Charles divides the tradition into Eastern and Western, and I think it is significant that the text above the Pray picture is in Latin, not Greek..","date":"2014-07-04","mins":"2:56 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135380","author":"hugh_farey","post":"I wonder if you have actually looked through Carlos’s links, especially the last one, which has dozens of Three Marys scenes with which we might compare the Pray manuscript picture. The architectural elements, as opposed to the decorative elements, really do fit very well into the tradition; the skewed slab, be it lid or Stone of Unction, and the “big block” which is often shown hollow – an incontestable sarcophagus – but occasionally solid, possibly representing the shelf on which Jesus’s body was laid, or simply the sarcophagus from sideways on. The likes of me can indeed get our heads around the various departures from decorative convention, but there is really very little departure from archaeological convention. Throughout this saga, the sceptics have explained carefully with numerous examples why they do not believe that the Pray drawing demonstrates the pre existence of the shroud. They have countered with dozens of similar scenes, with discussions of possible alternatives and with thoughtful suggestions as to further possible research. They have demonstrated that a large proportion of Three Marys scenes show a skewed slab over a rectagular sarcophagus, a crumpled shroud and an angel balancing like a surfer on the slab. They have pondered the meaning of the concentric zigzag ‘circles’ and the polystaurion block. They have suggested comparisons with marble and the crusader crosses. They have differed over possible explanations for the various little circles. They have researched possible connections with epitaphioi. They are not immune to the significance of the Shroud as an important Christian icon. They do not insist that authenticists instantly change their minds, but it would be nice if they could at least see some validity to their observations. Is any of this untrue? The response of those who believe that the Pray manuscript does derive from the Shroud, that the Shroud is truly the burial cloth of Christ, has been an unceasing tirade of invective and abuse. They have offered nothing new in the way of evidence, and demanded slavish acceptance of their point of view. Is any of this untrue? You think a series of concentric zigzag semicircles represent herringbone weave. I disagree. I understand your point of view, you think I’m a moron. You think the rectangular slab has sufficiently wavy edges to be considered representative of a cloth rather than a stone. I disagree. I understand your point of view; you think I’m blind. You think the wavy lines on the slab represent the blood flows on the shroud. I disagree. I understand your point of view; you think I’m arrogant. You go on and on about how you cannot bear to argue with me any more; I think that gently pointing out misrepresentations of my point of view and trying to make it clearer will enable to help undecided readers of these comments to make up their own minds; all you can say in reply is that I’m a blind, rabid, arrogant, ignorant, irrelevant, uncomprehending, illogical, obsessive, absurd, desperate, poisonous, dishonest, deceitful, envious, fearful, fanatical, sychophantic moron. Well, good for you. With friends like that, the Shroud’s rejection as a worthless shibboleth seems assured. With friends like mine, even though we doubt its authenticity, its value as a central icon of Christianity may yet be saved. Thank goodness there are so many more of us..","date":"2014-07-04","mins":"6:23 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135512","author":"hugh_farey","post":"Thank you, Carlos, for your examples, but you do not seem to have followed the progression of iconographic ideas outlined above sufficiently. Earlier representations do not have a sarcophagus, they have a temple like building, inside which is the shroud and outside which sits the angel, on the Stone of Unction or possibly the door of the tomb. All your examples are of this type. As the iconography developed, a block (possibly the burial shelf) appears, and gradually makes its way outside the building. At some stage the building itself disappears, and we are left with the block, often hollowed out to become a sarcophagus, and the angel stone, often now clearly representing the lid. The Pray manuscript is an early version of this type. Your earlier link (http://www.artbible.net/3 JC/ Mat 28,01 Women Resurrection Femmes/2nd 16th Siecle/slides/08 18%20 IVORY%20 EMPTY%20 TOMB%20 MAT%2028.html) shows the progression clearly..","date":"2014-07-05","mins":"12:51 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135592","author":"hugh_farey","post":"“Hugh suggests that the rectangle may be the door of the sepulchre.” Hi, David. There are a few of the early “temple type” Three Marys scenes in which the angel is standing on a very flat slab lying on the floor. In these few I think the slab is being interpreted as the door. In many more he is sitting on a more substantial block, which I think indicates the Stone of Unction which sits outside the sepulchre even today. The later “sarcophagus type” Three Marys scenes clearly show the angel slab as the lid of the sarcophagus. In intermediate types the angel slab is not so clearly a lid (the Pray manuscript being one such), but it is skewed, which I have interpreted either as the lid or the door of the tomb being “rolled away,” but could represent the Stone of Unction being thrown over by an earthquake, as daveb suggests..","date":"2014-07-06","mins":"3:52 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135445","author":"hugh_farey","post":"Now there’s an interesting one, I agree. The two slabs are characteristic of the genre, of course, but it is quite rare to see a tomb hovering in mid air. One of the examples in Carlos’s last link has something a little similar, with the tomb appearing as a kind of bridge, through which we can see the dresses of the women. They seem to be derived from the style which shows huddled guards in the front of the picture, sometimes in a little hollow of their own. Take away the guards and it seems some painters interpret the space left behind as a void right through. A fascinating one to add to the collection. Thank you. I’m not sure what Louis is referring to. Which of the pictures in his link shows a burial slab? If he is referring to my earlier comment, then I agree that one of the two blocks may have originated as the burial slab, the one that eventually slid out of the tomb building and became a sarcophagus. The other block, the one the angel is sitting on, which eventually became the llid, is more likely to have been originally either the Stone of Unction or the door of the tomb (the stone rolled away)..","date":"2014-07-05","mins":"3:03 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135613","author":"hugh_farey","post":"“The gospel records that the tomb was sealed by a rock and there is no mention of a door.” This is, of course, true, but the iconography of the Three Marys scenes does not derive directly from the gospels. The earliest versions, as I have described, do not show a cave sealed by a rock. They show a building, with a doorway. Occasionally the thing the angel is sitting or standing on looks like the door which might have stood in the doorway, and more often it looks like a big stone outside. It is often shown skewed, which may be a reference to the earthquake. The thing the angel sits on, and the thing associated with the tomb (first the temple alone, then the temple and included block or sarcophagus, then the temple with the block or sarcophagus outside, then the block or sarcophagus by itself) are the only two consistent architectural elements of the scene. The other elements are the angel or angels, the women, and the shroud. Very occasionally one or more of these elements is omitted, but where they are included, they are prominent. It is inconceivable that the angel block would ever be reduced to a couple of lines. Perhaps if the picture was complete we would be able to see more – the entrance to the tomb building perhaps – but as it is, they’re just lines..","date":"2014-07-06","mins":"5:41 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132172","author":"hugh_farey","post":"The chap anointing Jesus also has no thumbs. Missing thumbs are remarkably common in Byzantine art. I wonder why..","date":"2014-06-21","mins":"5:23 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135638","author":"hugh_farey","post":"We can. We do. We are. 1) We not not accept OK’s six congruences as congruences 2) We do not accept their probabilites 3) We do not agree that the methodology of probability is applicable to icons. We agree that the picture shows a naked man, and that he has four fingers on each hand. We agree that this combination is unusual, athough a few examples have been mentioned above. 1) We do not agree that the lack of feet in the two images is a congruence. OK has not shown that it is. We have suggested that the Pray drawing has either been trimmed or was continued on another, now missng, page. We do not agree that the zigzag pattern represents herringbone weave. OK has not shown that it does, other than by personal conviction. We do not agree that the red wavy lines represent blood flows. OK has not shown that they do, other than by personal conviction. We do agree that the patterns of little circles is a congruence. We do agree that one of the patterns is L shaped, like the pattern of holes in the shroud. We think this is coincidence. 2) Over 20% of the Three Marys images posted on this blog show a naked man, and over 20% show a man with four fingers on each hand. The chances of any randomly selected Three Marys showing a naked man with four fingers is better than 1/25, not 1/10000. 3) When deciding congruence by probability, we must consider the principal features of an image first, not carefully selected details. We must also consider points of uncongrence. The Mona Lisa has two hands crossed at the wrists. So does the Shroud. Does it make sense to ennumerate the probability that one was derived from the other? “approach that no sceptic has been able to undermine.” I beg to differ. “sceptics want to deny this but they can’t.” I beg to differ. “They are not interested in arriving at the truth of the matter.” I beg to differ. “simply in DENIAL.” I beg to differ. “they talk nonsense about lids.” I beg to differ. “their approach is faulty.” I beg to differ, but look forward to changing my mind after reading OK’s next post. “they cannot undermine my conclusive reasoning.” I beg to differ. “the truth gets dissolved in numerous irrewlevant discussion.” Well at least we can agree on something!.","date":"2014-07-06","mins":"8:24 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135643","author":"hugh_farey","post":"OK’s ‘next post,’ and the one after that, seem to have come in while I was writing my last. Sadly I’m not persuaded to change my mind, and quoting lists of possible ‘logical faults’ doesn’t help. Over the last few comments, i have outlined the development of the Three Marys icon. The subject is not an individual whim; most religious pictures illustrate particular, often well known gospel incidents, and cannot be considered in isolation from their pictorial forebears. Any picture, or sculpture, of the Crucifixion, the Deposition, the Lamentation, the Anointing, the Resurrection, the Three Marys, the ‘Noli Me Tangere,’ and many others, is to some extent derivative from what has gone before, and the Pray manuscript does not, to me, appear to be an exception. Of course, an image cannot be considered to belong to a class of images unless there are some generalisations which connect it to its genre. These are not sweeping generalisations or logical faults, they are the constituents which determine the nature of the image. We see that the Three Marys (or Quem Quaeritis) image has several fundamental constituents, which are common to the vast majority of the individual members of the class. There are at least three women, and at least one angel, and an angel block and a tomb block, and a shroud. Where these can be observed, then that is what they are. Occasionally one or two of the constituents are omitted, but where they are present, they are important parts of the composition. The Pray painting shows all of them. It is not therefore a sweeping generalisation to assume that the artist was depicting them. It would be a bold leap of fancy to suggest that one of the major constituents of the icon had been omitted or marginalised, and then replaced with something very similar which actually represented something else. If these arguments are faulty, then I would be grateful if someone could point out where, with appropriate references, as I have done, rather than simply re iterate opinions I disagree with..","date":"2014-07-06","mins":"9:28 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135688","author":"hugh_farey","post":"Oh dear, this sounds very like the Vignon markings discussion all over again. In that case, the appearance of Vignon markings across Byzantine portraiture was a coincidence, but when they appeared on a portrait of Christ they were derived from the Shroud. In this case, the similarity between dozens of Three Marys scenes is all very well, but does not in apply in this one case. The opposite of “faulty generalisation,” I guess, is “special pleading” and here it applies to excess. The argument that a large number of depictions show rectangular lids on which an angel is sitting, so a similar rectangle in one particular depiction is most likely to be another lid is not a faulty generalisation, it is a mathematical inevitablility. I do not use the words ‘must be’ – for all I know it could be a plastic picnic table drawn by aliens – I say it is most likely to be. If this argument is faulty, then I would be grateful if someone could point out where, with appropriate references, as I have done, rather than simply re iterate opinions I disagree with..","date":"2014-07-06","mins":"2:34 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135707","author":"hugh_farey","post":"That doesn’t seem to me to explain the previous statement, but I do understand it. For reasons I have explained I disagree with it. But never mind. I do not wish to pound unnecessarily. I also disgree with Louis’ summary, for which no evidence has been adduced. But let’s leave it pending new ideas or new illustration. Or Max’s blockbuster..","date":"2014-07-06","mins":"3:38 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135694","author":"hugh_farey","post":"“In short, large frequency of congruences in a population indicates a model. Small frequency of congruences found in one particular example, shows that it is unlikely to be derived from anything else but this model.” Yes, I remember. The statement literally didn’t mean anything then, and it still doesn’t mean anything now. Can anyone clarify it?.","date":"2014-07-06","mins":"2:47 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132169","author":"hugh_farey","post":"Just found this: “The Burial Lamentations by Theophanes the Cretan.jpg” Although Theophanes the Cretan was centuries later than the Pray artist, it appears that he was trying to convey the same surface to the slab. Some time ago I speculated that its pattern was geological rather than textile. The Stone of Unction is a red marble slab. There is also this: http://www.bl.uk/manuscripts/Viewer.aspx?ref=add ms 49598 fs001r which is an early Three Marys, showing the angel sitting on the stone outside the tomb, and this, from the early 12th century, showing the same – and look, red marble patterning again….","date":"2014-06-21","mins":"5:19 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135855","author":"hugh_farey","post":"I think you’re quite right, David. In the Pray manuscript the twisted block is most likely the lid and the other block most likely the sarcophagus. My discussion was really about how this “lid and sarcophagus” design evolved from the “stone and temple” design. Placing exteme examples of each genre next to each other one could think the evolution absurd, rather like putting a whale next to its dog like forebear, but by showing all the intervening links (easier with the Three Marys than with the whale!) the connection becomes clear. The Pray manuscript is an intermediate form, when the precise designations of the two slabs were often indistinct. I’ve no idea what any original rock or stone might have been. The gospels stay “stone” so a stone was drawn. A stone shaped a bit like an altar might actually have been there (many are drawn with a larger surface area on top than at base and trapezoidal sides), and it may have been replaced by the current stone, which is rectangular but I dont know how thick (It seems to be 60cm or so, but it might just be a thin slab lying on somerhing). I have called these slabs the “Stone of Unction” more for ease of nomenclature than because I thought they were actually used for annointing. If there was any annointing not done in situ on the burial shelf, it could have been on another shelf or the floor or a wooden table for all I know..","date":"2014-07-07","mins":"3:13 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192361","author":"hugh_farey","post":"Hi Skeptic and thank you for the Morgan Library images, which I was not familiar with before, but which all fit nicely into the general evolution of the Three Marys iconography, as I have discussed above. Also above, if you haven’t found them yet (David Mo on July 1, 2014 at 2:30 am) is another superb collection of links by David Mo. Looked at as a whole, it is fascinating to watch the various architectural features of the scene gradually alter over the years. In particular, the rectangular element usually placed at a ridiculously odd angle across the sarcophagus may have begun life as the door of a temple, the blocking stone of the tomb or the anointing stone before taking up its familiar job as the lid of the coffin itself. Often it is sufficiently indistinct to suggest several interpretations at once. (The Shroud itself, of course, is not one of those interpretations). In an interesting form of atavism, I have seen some recent Three Marys icons in which, although there is no cave, temple or tomb, the angel is sitting on a round stone, right next to a rectangular sarcophagus. Anyone unfamiliar with the gospel narratives could have no idea why it was there. And finally, why is the slab often at such an absurd angle? I suspect it harks back to an actual stone slab somewhere, just as most of the earlier temple tomb depictions seem to hark back to Constantine’s Holy Sepulchre building, but what and why I have no idea..","date":"2015-03-04","mins":"5:58 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132260","author":"hugh_farey","post":"Not at all. It just isn’t very relevant..","date":"2014-06-22","mins":"4:50 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192595","author":"hugh_farey","post":"“Nabber, Dave B and anyone. I would like to ask you for one thing: don’t respond to ‘Skeptic’ anymore. You are dealing with a psychopath, who wants to show his superiority in this topic over me (and the more over you).” Intemperance has been a feature of both sides of this debate lately, and in the past I myself have been called a stupid, blind, unintelligent moron. Psychopath is a new one. However, I believe Skeptic, whoever he be, is correct about the nature of the architectural elements of the Pray Codex, and I believe that there is ample evidence to demonstrate that. The squabbles over whether the markings are ‘texture’ or ‘design’ seem to me slightly petty – OK and Nabber are correct in that the zig zags on the tomb lid are not random squiggles, while the markings on most of the other Three Marys depictions usually are, but I believe that all of them are attempts to depict the actual nature of a specific slab of stone, through direct observation, imitation of others, or report, which probably consisted of veined marble. I do not think that four or five concentric ‘circles’ of zig zag lines look anything like herring bone weave; I do not believe that anybody attempting to depict herring bone weave would come up with concentric circles as a method of depicting them, and I do not believe that anybody attempting to illustrate the Shroud of Turin would plant it as an irregularly placed rectangle, across a tomb, with an angel standing on it, in exact imitation of generations of ‘tomb lid’ depictions from similar scenes over the previous few centuries..","date":"2015-03-06","mins":"2:52 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192621","author":"hugh_farey","post":"Yes, true, they’re not really ‘circles’ as such, more like triangles, but they are concentric and they’re nothing like herring bone!.","date":"2015-03-06","mins":"9:30 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192620","author":"hugh_farey","post":"“Your presumption that the herring bone weave is asserted as being represented by concentric circles is I think a distortion.” Imagine yourself, with a blank rectangle and a pen, and a wish to represent a uniform herringbone weave across the surface of the rectangle. Is this what you would do?http://i.imgur.com/c Nq F2 OZ.png This is not just a zig zag pattern. It is a series of concentric circles (semi circles to be precise) done in zig zag lines. I do not believe that these irregular ‘stepped pyramids’, emerging from various centres around the perimeter, look anything like herring bone weave, and I do not believe that anybody attempting to depict herring bone weave would come up with this as a way of depicting it. So, fair enough, we beg to differ. So come ye angels to our aid! Who else thinks that, given the task, they would sketch herring bone as concentric zig zag circles? OK? Nabber? Pick up a pen and give it a try….","date":"2015-03-06","mins":"9:27 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132265","author":"hugh_farey","post":"The Scene is also called “Quem quaeristi” which seems to be a paraphrase of Luke’s “Why do you seek the living among the dead.” There are some interesting aspects of its iconography. Firstly, in almost all the versions I can find, the angel is not inside the tomb, but outside. Earlier versions’ tombs are always depicted as buildings of some kind, and the angel is usually sitting on a stone outside. Later on, the building becomes a horizontal sarcophagus, and is nearly always clearly outside, not in a building or a cave. There are a few paintings which show both the vertical building and the horizontal sarcophagus, but not many. The angel is usually sitting or standing on or posed by a very oddly angled slab, which I think is artistically and culturally derived from the stone he sat on in the earlier versions. Very rarely, but occasionally, there are angels actually sitting or standing in the sarcophagus. Possibly the key to the odd stone is in the word “revolvere” which is now almost universally translated as “roll.” In fact, any kind of stone that could be rolled is extremely rare in these medieval representations. The big mill wheel thing that we have become used to is virtually unknown. It would perhaps be better to think of it as meaning “turn away” (there is certainly a turning element to it), which might account for stones swivelled horizontally across the tomb, which occurs quite often, or hinged upwards on end, which also occurs, or just twisted into any weird angle, which is common too..","date":"2014-06-22","mins":"5:36 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192652","author":"hugh_farey","post":"Have you looked at my link, daveb? Not concentric circles, then; concentric triangles if you like. Six irregular concentric designs. But is that how you would portray herring bone? If so, then that’s fair enough, as I said before, but I bet nobody else would..","date":"2015-03-06","mins":"3:04 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192702","author":"hugh_farey","post":"Hold hard, Skeptic. Stiff upper lip and turn the other cheek and all that. Although you will find that 90% or more of the personal abuse on this site is directed from authenticists to non authenticists (and sometimes to themselves), we damage our reputation by stooping to their level. I’m certain that OK and Nabber are pillars of their communities, and if they lack the cold unemotional rigour of non authenticist analysis, perhaps they are more fun to be with at a party. It may be instructive to explore why this one way abuse should be the case. We must remember that most authenticists begin with a belief and work from there to the evidence, whereas most non authenticists begin with the evidence and work from there to determine the truth. This is not invariably true – Barrie Schwortz and Ray Rogers are shining examples of those who came to their convictions from the evidence, and (beg pardon if I malign him) I think Joe Nickell was convinced the Shroud was a fake long before he investigated it in any depth. But being generally so, I think it the case that authenticists have convictions, whereas non authenticists have conclusions, and it is more emotionally upsetting to have one’s convictions challenged than one’s conclusions. This is why authenticists are more passionate, less logical, and more abusive. My advice is to forgive them; they know not what they do. Nor must we deny that there are peculiarities in the Pray Codex pictures which we cannot explain. The stepped pyramids (yes, alright, ‘circles’ was an oversimplification) and the polystaurion tomb are reasonably enough derived from Constantine’s Holy Sepulchre, but the three diagonal crosses are anomalous and were clearly not a mistake. They mean something, and so do the little circles which accompany them. Just because we reject their identity with features on the Shroud does not mean that we can ignore them altogether..","date":"2015-03-07","mins":"11:26 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192831","author":"hugh_farey","post":"I think your explanation is ingenious, Thibault, and respect it. However I don’t think it’s correct. For a start I can’t agree that the painter wasn’t an amateur. His pictures are clumsy and appear unfinished. But chiefly I agree with Gian Marco that this is in many ways a typical Three Marys scene, which demands certain traditional elements, including (by this time) a sarcophagus and a lid, more or less rectangular, and a shroud, more or less crumpled into a heap. These elements are present. If the artist wanted to show the shroud more clearly, he would have added it to the composition, not substituted it for one of these elements, and if he had wanted to create a new icon altogether, he would not have made it so similar to the previous icon that it could easily be mistaken for it..","date":"2015-03-08","mins":"4:51 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192710","author":"hugh_farey","post":"Wise words, as ever, daveb, wise words….","date":"2015-03-07","mins":"1:50 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192899","author":"hugh_farey","post":"Yes, Thomas. The architectural elements of Three Marys iconography have varied in meaning over the long history of the icon. See above at June 21, 2014 at 5:19 pm, June 22, 2014 at 5:36 am and July 7, 2014 at 3:13 am..","date":"2015-03-09","mins":"5:14 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132275","author":"hugh_farey","post":"The Pray angel has both feet on the slab (you might like to look at the painting at http://greatshroudofturinfaq.com/History/Greek Byzantine/Pray Codex/pray3.html, which shows rather more than your crop). I think he is standing on it. He may be sitting on something else (your green arrow) but resting his feet on it, but I don’t think so. He is, as I carefully said, “sitting or standing or posed by” an oddly angled slab, just like dozens of others in similar scenes..","date":"2014-06-22","mins":"7:24 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132279","author":"hugh_farey","post":"Sorry, OK, I see the point you’re making, but I still think the angel is standing on the slab and the thing in the background is irrelevant. His clothes are awkward because of the angle of the slab and the incompetence of the artist..","date":"2014-06-22","mins":"8:05 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132308","author":"hugh_farey","post":"This will all, no doubt, be a lot more persuasive when we see your “crucial iconographic evidence.” Until then, it’s all makebelieve..","date":"2014-06-22","mins":"12:15 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132324","author":"hugh_farey","post":"Am I persuaded that the artist of the Pray manuscript knew of the Shroud? No, I’m not. EVIDENCE FOR Some of the ‘evidence’ is sufficiently common not to require the Shroud as an explanation (the naked body, the crossed hands) – Some of the ‘evidence’ I disagree with and have (at least to my mind) a more satisfactory explanation for (the angled slab and the pattern on it, the polystaurion pattern, the diagonal row of crosses, the cut off feet). – Some of the ‘evidence’ I cannot explain completely but do not think it relates to the shroud (the little holes, the wiggly lines, the thing behind the angel, the letter ‘a’). – The cryptological evidence I think remains pure speculation in the absence of anything more convincing than Max’s enthusiasm. EVIDENCE AGAINST (based entirely on the Shroud and the Manuscript) – The lack of a beard or wounds on the body. – The positioning of the body on the shroud (top picture) – The failure to relate the top shroud to the bottom shroud in any way. – The failure to give the Shroud more prominence (it’s a crumpled heap). As with most sindonological studies, different people assign different weight to various pieces of evidence, even when they agree on the evidence itself, and different people attribute different meanings to patterns, designs or symbols. It’s a subjective exercise, and no evidence should be accepted or rejected without consideration. I think I fully understand OK’s and daveb’s point of view, and think they have every right to hold it. It’s just not my point of view, which I hope they understand too..","date":"2014-06-22","mins":"1:25 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-175730","author":"hugh_farey","post":"I can’t say I’m keen, I’m afraid. I do not see an oriental eyed Jesus with curly Nubian hair. The finished image does not look good in Imag J either, as the enhancement of the cheeks makes them appear higher than the nose – just as they do in ordinary photographs, in fact. And I disagree completely with the conclusion that the orginal image “immediately brings to mind a scene of horrific brutality … a reminder of suffering and brokenness … seemingly without expression”, while the enhanced image “reveals more specifically a definitive expression on the face … immediately pleasing, even divinely sweet.” It just doesn’t do it for me. There is some milage in attempting to identify places on the image where there “ought to be” some discolouration but there isn’t, and to try to correct the failure, but this must be a highly subjective task, and one man’s interpretation may not fit anothers. To call this a definitive likeness is pushing the value of this research too far..","date":"2014-12-11","mins":"2:03 pm","url":"https://shroudstory.com/2014/12/11/roger-bassetts-clarifying-art/","cat":"art","title":"Roger Bassett’s Clarifying Art"},{"id":"comment-43834","author":"hugh_farey","post":"Pushing your luck, I think, Charles. Earlier on in this blog I mentioned these holes, inserted by Constantine VI after the sepulchre was covered in marble. My hypothesis was that the zig zags on the lid represented opalesque swirls in the marble, and the red crosses were a variant on the holes in the sepulchre. Although we are told there were three round ones, they are often transmuted into more holes and different shapes in medieval illustrations. Some of them are quatrefoil shaped, which I thought could have been the inspiration for the red crosses on the Pray manuscript. It’s a very long shot, but I think a better hypothesis than the L shaped holes being the apertures..","date":"2013-09-11","mins":"6:18 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43926","author":"hugh_farey","post":"What about this then? The Holy Sepulchre in Jerusalem, from which all these medieval sarcophagi appear to have been derived, was lined with marble slabs. As was most of the masonrywork round about. These slabs were attached to the stone with dowels, and such meagre remains of the 11th century buildings as remain have numerous dowel holes. If, as I supposed earlier, the diagonal line of crosses was a primitive attempt to depict a corner of the sepulchre, then the little holes on either side might just possibly represent the pegs holding the marble slabs in place on the stone. Googling “marble” and “dowel” in connection with the holy sepulchre of Jerusalem brings up a variety of more or less interesting archaeological information..","date":"2013-09-12","mins":"10:03 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43952","author":"hugh_farey","post":"Thank you, Max. Although your interpretation says nothing at all about the diagonal line of crosses illustrating a corner of the tomb. And, since you ask, marbling takes on all sorts of patterning, including interfering concentric circles that could be represented quite well by those zig zags. There is an important quarry of exactly the stone I mean very close to Constantinople. Try http://www.nugastone.com..","date":"2013-09-12","mins":"1:14 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44097","author":"hugh_farey","post":"Firstly, I’m extremely interested that the “diagonal lines of crosses can also be seen amid panels of the cross graffiti cut in the walls on both sides of the stairs leading down to the church of St. Helen (Holy Sepulchre Entrance).” Can you link me to a picture that shows them? or reference a book with an illustration? Secondly, I’m not suggesting that the the patterning on the lid of the Pray shroud is photographically accurate – just that to me it is very suggestive of those irregular concentric loops that we see on the onyx slabs. I think a professional stone cutter would recognise it immediately; do you have Mr Berdiboz’s email address? And finally, why should I see Giorgio Tessiore’s drawing? Is it because it shows the herring bone pattern as stepped pyramids? Sorry to keep repeating myself, but have you got a reference? I should like to see it for myself..","date":"2013-09-13","mins":"2:11 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44334","author":"hugh_farey","post":"No, sorry, Max, I still can’t agree. I’ve been looking at the zig zags, and they are in the form of at least six (visible) concentric semi circles. They look nothing at all like Giorgio Tessiore’s drawing (thank you for the reference), in which all the stepped pyramids are going in the same direction. Unlike Charles Freeman, I don’t think the small holes are the oculi of Constantine Monomarchus. I think the big red crosses represent those. To me, the most interesting part of your first comment was the bit about the diagonal lines of crosses on the way down to the chapel of St Helena. Have you any pictures you can suggest for that?.","date":"2013-09-15","mins":"2:42 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44346","author":"hugh_farey","post":"Pursuing this theme, I have entered “holy sepulchre” “crosses” and “pilgrims” on Google, and been rewarded with a number of photos which I hope show the wall Max was referring to, covered in small crosses. Unfortunately none of them show a diagonal line. However, considering them, and considering the arms of the Order of the Holy Sepulchre (five red crosses), formed in about 1100, I now wonder if the crosses on the Pray illustration refer to that..","date":"2013-09-15","mins":"5:55 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44431","author":"hugh_farey","post":"Ah, Max! Let me bow to your erudition. I tried looking up “in iconic reduction” on Google, but sadly, the only times it appears among the entire corpus of internet information is in another post of yours at the end of 2011, and your post above. So you’re correct, I had no idea what it meant. Now, I do, and I still disagree with your interpretation. I think it is an iconic reduction of the concentric irregular semicircles one frequently finds on onyx slabs. I’m sorry I can’t help you with my interpretation of the red wiggly lines at the hem of the cloth lying on the coffin lid. I certainly do not think they are random, but for the life of me nothing comes to mind. They look nothing like bloodstains and may simply represent a decorated hem. As for the “red blood like spot,” I’m afraid I can’t see one at all; can you point it out? (There is a black spot above one eye of the figure in the upper picture – is that the one?) As for the crosses in a diagonal line among the hundreds of horizontal ones; forgive me but could you find an appropriate picture among the few on the internet and give me its reference? I’m sure it could be very important. Many thanks!.","date":"2013-09-16","mins":"12:32 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44556","author":"hugh_farey","post":"Perish the thought that anything I have suggested has refuted Max’s ideas, any more than he has refuted mine. I have followed what he says, I have understood it perfectly, and I think it’s wrong, and have produced an alternative hypothesis. Look at http://www.marmistone.com/wp content/files mf/cache/th c1298f73aff7b37d937a44ba578d6921 1282318034onice striato MG 5653.jpg, which shows a piece of onyx characterised by irregular concentric bands around at least three different centres. Further searches for “onyx” on Google images will demonstrate dozens of similar illustrations. Two hypotheses, more or less supported by illustrative evidence. I wonder which the interested bystanders consider more credible, or if there are other hypotheses even more compelling of which we so far know nothing..","date":"2013-09-17","mins":"5:47 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44564","author":"hugh_farey","post":"Yes, I really think my onyx idea beats your herringbone idea hands down. No I don’t think my idea refutes yours; it merely provides a more reasonable alternative, supported by easy to access illustrations which other readers may find convincing or not, as they see fit..","date":"2013-09-17","mins":"7:16 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44625","author":"hugh_farey","post":"Well, fair enough. 1 0 to Max, then, so far….","date":"2013-09-18","mins":"1:10 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44643","author":"hugh_farey","post":"Thanks for your consideration, Max. I agree that I am totally unfamiliar with an “Empty Tomb Angel scene Byzantine and Medieval iconographic corpus including a head band or skull cap.” Would you be so kind as to give me a reference to an illustration I could learn from? On the other hand I have demonstrated that I am familiar with “Factual reality of marble onyx patterning” by myself giving references to appropriate examples. I am also familial with the difference between the warp and weft sides of twill. Not only do i have my own sample, but the excellent photos of a piece of the shroud by Barrie Schwortz (at http://www.shroud.com/pdfs/arizona.pdf) illustrate the two sides perfectly. And. I do not think that an idea can be justified solely by the provision of illustrations, but it certainly makes it easier to understand. I look forward to yours..","date":"2013-09-18","mins":"5:51 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44703","author":"hugh_farey","post":"Splendid, Matthias; the evidence for evolution of resurrection iconography is a bit like that for human evolution, a gradual accumulation of archaeological bits and pieces that slowly fits together into a coherent pattern. I was familiar with the Buoninsegna, which may show two separate aspects of the holy sepulchre, the annointing stone and the tomb itself (the next frame of the sequence) with tip tilted lid and five large square inset panels. Your second illustration is new to me. One thing that immediately suggests itself is the transparency of the cloth. The Pray cloth also seems to show transparency, as you can see the edge of the coffin lid through it, and some of the pattern of X’s also seem to be seen through other layers. The Cypriot church roof is fascinating. Look at the design on the tomb – just like lots of interlocking crosses, no? It’s a pity there is no resurrection or ‘three Marys’ scene. The Russian one shows a typical mummy wrapped body, which comes from a different tradition, and the last one – well, what on earth is the angel sitting on? Anyway, it’s all grist to the mill, and well worth sharing every new example we come across. Thank you..","date":"2013-09-19","mins":"9:10 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44850","author":"hugh_farey","post":"You’re right, Matthias, in that I too cannot find a decorated or patterned shroud in contemporary images. And as I say, I can’t account for the wiggly red lines, nor the Xs that occupy the cloth immediately above them except by unfounded speculation. I’d like to find evidence of a patterned cloth or vestment, allegedly derived from the shroud, which had these markings, but haven’t done so far. (The sort of thing I had in mind was a ceremonial cope of the Order of the Holy Sepulchre, but there’s no evidence for any such thing!).","date":"2013-09-20","mins":"10:45 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44892","author":"hugh_farey","post":"I do hope not. I wasn’t referring to your comment this time, but simply agreeing with Matthias that there are aspects of the illustration that I haven’t come up with any good explanation for. There are other aspects, of course, that I have provided good explanations for, even if they are yet to find universal acceptance….","date":"2013-09-20","mins":"5:40 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44851","author":"hugh_farey","post":"PS. Re: David Goulet’s comment above. Does that make it one all?.","date":"2013-09-20","mins":"10:47 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-42703","author":"hugh_farey","post":"Oh shame on you! Winston Churchill adored history, and won the Nobel prize for literature largely for his History of the English Speaking Peoples. It was Henry Ford who said “History is bunk.” I take your point though..","date":"2013-09-02","mins":"6:25 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43065","author":"hugh_farey","post":"Charles, I’m shocked! Please don’t think “no one, other than Yannick, seems to want to listen to people who have been working in this very field for many years using and interpreting original sources.” I’ve spent many happy hours this summer tracking down the earliest representations I can find of Byzantine iconography that seem to parallel the shroud. The Pray manuscript, and the Verdun Altar, and that wonderful little champlevé resurrection ring all seem relevant. I’m fascinated by the gradual introduction of the ‘suffering Christ’ and variations in the representation of the holy sepulchre, which must surely owe more to Constantine than to the Gospels. The hands crossed over the genitals, the nakedness, the shape of the shroud, all these images drift in and out of the iconography of the 10th 13th centuries in complex ways, and I very much enjoy reading the work of scholars which touches on this whole aspect. It’s not so much the chronological as the contextual associations of the shroud which specifically interest me, but all research in the approximate area is well worthwhile..","date":"2013-09-06","mins":"8:45 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43080","author":"hugh_farey","post":"I agree that the zig zag pattern on the lid of the Pray manuscript tomb, and the crosses all over the body of it, are nothing to do with the shroud. Did you see my discussion with Matthias about it? I think the illustration derives, second, third or fourth hand, from the marble surround of the holy sepulchre, and the apertures in it. The peculiar diagonal line of crosses might even be an attempt to depict a corner. My arrival on the Byzantine scene was in connection was an attempt, supposing the shroud to be a 12th or 13th century creation, to find an artistic context for it. I was at one of Thomas de Wesselow’s lectures, and found his rejection of any such context compelling, but his alternative hypotheses unconvincing. Having now found several naked, crossed wristed, long fingered Jesuses from the period, I’m not so sure about the image as an image, although the method of representation is still a mystery..","date":"2013-09-06","mins":"12:54 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43189","author":"hugh_farey","post":"I suppose, Matthias, that on its own, the Pray illustrations could be interpreted in various ways, none of which could easily be contradicted. However, they are not on their own. They are part of a well represented illustrative tradition, and thus, like all the others of their genre, conform mostly to type. Where they differ, one may speculate as to why, but where they are similar, then I think the genre describes their features adequately. So: let me draw your attention to three other pictures. 1) The Psalter of Queen Ingeborg, and its page showing two illustrations, one of the anointing and one of the “Three Marys.” It dates from about 1195 and the chosen illustrations are exactly the scenes of the Pray page. 2) The champlevé armlet currently in the Louvre, showing the resurrection. Date c.1175. 3) The entombment and resurrection scenes on the altar of Klosterneuberg monastery by Nicholas of Verdun. Date 1181. These three are particularly contemporary with the Pray pictures, but then Google variations on Byzantine, Romanesque, Entombment, Resurrection and Three Marys, and you begin to get a feel for what the Pray artist was trying to be part of. In particular, the box like tomb, with holes or depressions in it, the absurd angle of the lid of the tomb, the perched angel, holding a very thin wand, the abandoned grave cloths and so on. It then becomes impossible to suppose that the rectilinear features of the Pray pictures are anything other than the tomb, zig zags, crosses, “poker holes” or whatever..","date":"2013-09-07","mins":"2:26 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43459","author":"hugh_farey","post":"I think that’s fair enough. I have no good reason for the 5 dots around the crosses on the sepulchre, or for the 4 dots on the lid, nor for the wiggly red lines bordering the cloth. I don’t think they are representative of the shroud, but admit that’s probably no more than a gut feeling. However, in agreeing with your statement further above; that “There are several examples of entombment scenes around 1100 1300 where Christ is being laid out over a cloth with a pattern on it, sometimes with diagonal lines forming diamond like shapes, sometimes comprising little black fleck like lines and markings,” I have to point out that the Pray manuscript illustrates exactly that scene, but without any pattern at all on the cloth, flecks, diamonds or what have you. To me, it stretches credibility to suggest that the rectangular stone blocks below are an attempt to be more representative of the shroud than the obvious cloth with Jesus lying on it above. I don’t mind if you don’t agree, but you must surely see my point, no?.","date":"2013-09-09","mins":"8:15 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43632","author":"hugh_farey","post":"I feel the credibility gap increasing here. There are a number of roughly contemporary depictions of the shroud showing large quantities of extra cloth held in the hands of an attendant at the head of the dead Christ. In every single such case that I have seen, similarly large quantities of extra cloth are also held in the hands of another attendant at his feet. As it happens, I don’t think the Pray codex shows this, but if it, as Matthias says “extends up under the halo to the bearded bloke on the left,” then he must agree that it also extends up under the halo of the bearded bloke on the right. In other words, these illustrations place the dead body right in the middle of the shroud. Next, I think the attempt to explain away the absence of pattern on the top shroud, and the concomitant attempt to identify the zig zag pattern on the sharply cornered rectilinear coffin lid as the weave is becoming more and more desperate. “The two images are entirely different in a stylistic sense, so it makes little sense to compare one with the other,” says Matthias. This is patently untrue. Both images are entirely consistent with dozens of contemporary illustrations of the scenes they depict, and appear, together, in almost exactly the same format, in one of the illustrations I quoted above. Cloth, in both illustrations, looks like cloth, and rigid stuff, in both illustrations, looks like rigid stuff. The two illustrations “might have even been drawn by different artists!” No. Absolutely no. “Is the blood like spot above the right eye in the Pray Manuscript and similar marks in the hair – reminiscent of the Shroud – just another strange coincidence?” Yes. And not that strange. And it’s not a blood like spot. If the wiggly lines bordering the cloth underneath are blood, then the spot above the eye should be red. What is strange is that the bushy moustache and prominent bifurcate beard are conspicuously absent. And, no thumb. It has been noticed before that the anointing father also has no thumb, but I ask you to look closely at the angel below. The pointing hand also has no thumb, but it does have five other fingers! And the hand holding the staff only has three fingers. Then there’s the man above with the curly hair, scratching his cheek. How many fingers has he got? However, I grant you, as I did before, the wiggly red lines, the ‘X’s on the wrinkled cloth, and the two groups of holes. They beat me completely..","date":"2013-09-10","mins":"1:37 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-40590","author":"hugh_farey","post":"I imagine someone dies horribly, probably in a welter of blood, before we get to the opening credits….","date":"2013-08-06","mins":"3:11 pm","url":"https://shroudstory.com/2013/08/06/speaking-of-crowd-funding-shroud-of-turin-projects-should-we-laugh-or-cry/","cat":"art","title":"Speaking of Crowd Funding Shroud of Turin Projects:   Should We Laugh or Cry?"},{"id":"comment-148546","author":"hugh_farey","post":"Durer, da Vinci, Manoppello, Emperor Justinian, various catacombs, mosaics, the Pantocrator, even the Cistine Chapel and Prince William. All these have been hotly defended as uncontrovertibly, and sometimes exclusively, derived from the Shroud (or vice versa). The greater the cast of possibles, and the more vehement the defence of each one, the less objective the whole business seems to be. I still vote for Rasputin, with no fear of contradiction… (oops…).","date":"2014-09-04","mins":"1:18 pm","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","title":"Speaking of Matching Faces"},{"id":"comment-184089","author":"hugh_farey","post":"I suppose it depends on how exact a resemblance one is looking for: simply dribbles of blood (as shown in post 1300 works) versus no blood at all (as shown in pre 1300 works), or an exact copy of the epsilon, fork and other recognisable bloodstains of the shroud. I don’t think Charles means that if we count the drips they are exactly the same in number and shape on the Shroud and the Holkham bible, but simply that the abundance of liquid blood indicates a similar artistic development. However, I agree that Charles’s term “almost identical” is pehaps a little too enthusiastic….","date":"2015-01-17","mins":"2:46 pm","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?"},{"id":"comment-121411","author":"hugh_farey","post":"Here we go, then; a huge blow up of the wiipedia image. Http://imgur.com/m Vlq Eck Although the forehead mark looks to me like a ringlet of hair rather than blood, it is indeed in roughly the right place and of roughly the right design for a valid comparison to be made with the epsilon. I think it’s a coincidence, because it is surely very odd that no other portrait has a ringlet of hair (or an epsilon of blood) which could plausibly have come from the shroud, but I understand Stephen’s point of view. But not the one about the neckline. Surely we’ve scotched that….","date":"2014-05-19","mins":"6:33 am","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","title":"Stephen Jones’ New Discovery"},{"id":"comment-25635","author":"hugh_farey","post":"I think a question we ought to ask of a knowledgeable art historian is “Can you think of any example of a piece of art that appears unrelated to any other work of its time and region?” If every other masterpiece known to man fits at least somewhat into a context, then the exceptional quality of the shroud would be truly exceptional, but if there are other examples, from other times and places, of works without an artistic context, then the mere fact of exceptionality becomes… er… less exceptional, if you see what I mean!.","date":"2013-02-25","mins":"11:44 am","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","title":"The Art of the Impossible?"},{"id":"comment-180264","author":"hugh_farey","post":"Google’s characteristic problems with negatives at its most misleading. “¡No dejes de verlos!” means “Do not fail to look at them!” Both are well worth the study. For English speakers, do not click on the link, but type it into the Google search box and then click on ‘Translate this page,’ which gives you a reasonable translation (give or take a negative or two!)..","date":"2014-12-31","mins":"5:07 am","url":"https://shroudstory.com/2014/12/30/the-awesome-shroud-based-art-of-juan-manuel-miarro-lopez/","cat":"art","title":"The Awesome Shroud-based Art of Juan Manuel Miñarro Lopez"},{"id":"comment-32091","author":"hugh_farey","post":"I just want to say that reading Max expatiating on the inherent possible meanings of this picture is an absolute joy. I’ve no idea if there is a shred of truth in them (although I do hope there is), and I would be prepared to lay a small bet that Daniel Milberg hadn’t thought of half of them, but as a flight of cryptographical interpretation I’m sure it is literally peerless..","date":"2013-04-27","mins":"7:24 pm","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-77026","author":"hugh_farey","post":"Putting “Jesus was lame” into Google suggests that the idea first appears in the Talmud. There is also a Greek tradition (e.g. Odysseus) of the crippled hero. Other interpretations of the suppedaneum is that it is a balance (sheep up – goats down). This site has a bit to say about it: “http://www.sacredmint.com/wall hanging byzantine cross.htm.” For what it’s worth I don’t think one leg looks longer than the other anyway. Being crossed left over right simply means that one foot is missing, which is not the same as having a shorter leg, and I don’t think that iconographers would think any different. What’s more, as the frontal image shows the bloody top of the left foot, but no right, and the dorsal image shows the bloody bottom of the right foot,but no left, a different leg appears longer on each image. Finally, what happened when rigor mortis wore off? Had the image formation finished by then, or did the feet just naturally stay balanced on top of each other?.","date":"2014-02-06","mins":"11:18 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77028","author":"hugh_farey","post":"What’s more, a quick review of early Byzantine crucifixes suggests that the suppedaneum got its shape not because it was tilted, but because it was an attempt at perspective, so that the feet could be shown flat. Most early crucifixes have a rhomboid or trapezoid suppedaneum, with the longest edges horizontal. Only later did the long edges acquire a slant of their own, and the shorter edges, sometimes but sometimes not, become vertical..","date":"2014-02-06","mins":"11:33 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77043","author":"hugh_farey","post":"It starts with a minor differerence; horizontal lines become slanted. It only much later becomes an element in the “what did Christ look like?” debate..","date":"2014-02-06","mins":"12:40 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-190080","author":"hugh_farey","post":"Little of your last three posts is true, and what is true is unimportant. If Michel Lamy or Guy Tarade have any evidence of Verne’s Rosicrucianism you have failed to say what it is. They are not Verne specialists, unlike William Butcher, who has not only translated many of Verne’s works but written a definitive biography, or Timothy Unwin, Professor of French Language and Literature at Bristol University, neither of whom mention Rosicrucianism. The dense wreath above Verne’s tomb enclosing a small equal armed cross is unlike any other Rosicrucian emblem, and may have nothing to do with it. I can’t even tell if the wreath is of roses from the photos I have looked at. Evidence, Max, evidence….","date":"2015-02-07","mins":"5:12 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190097","author":"hugh_farey","post":"On the contrary, Max, I pointed out the wrist nails, and said I thought that they derived from the pathological details revealed to the world by the publicisation of the Shroud. What these details do not prove is that the Shroud itself was any part of de Brito’s design for his sculptures. I must say I’m sorry you think I’m in “bad faith” or any of the other abuse you have seen fit to bestow upon me just because I don’t take your every word as holy writ without any necessity for any kind of justification. Actually I’m neither blind nor stupid, but a big fan of your wonderful flights of baroque gallimauphry. However you ought to understand that none of it can be taken seriously unless you connect it to history with some kind of verifiable evidence, which you persistently fail even to attempt, relying instead on jumping up and down yelling insults. I won’t give up on you, Max. If you remember I did once squeeze a genuine piece of evidence out of you – and then agreed with your conclusion. Why not try it again? What exactly is ufologist Guy Tarade’s evidence that Jules Verne was a Rosicrucian?.","date":"2015-02-07","mins":"6:17 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189058","author":"hugh_farey","post":"Long hair spread out over the shoulders, loincloth, feet well apart and pointing outwards. Did every painter who hadn’t seen the Shroud come up with these ideas independently, or were they all copying from an original? Perhaps not the actual Shroud, but surely something closely associated with it….","date":"2015-02-04","mins":"6:00 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190181","author":"hugh_farey","post":"“Cyrus Smith is the PERFECT anagram of M. Yesu Christ.” Well done for spotting that Smith has got an M in it, Max. Shame you haven’t noticed that Yesu has got an E in it though. Did you know that ‘True Fact’ is a perfect anagram of ‘Wild Guess’..","date":"2015-02-08","mins":"4:35 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190108","author":"hugh_farey","post":"Not up to your usual quality, Max. Cyrus Smith (often called, as you yourself did above, Cyrus Harding) does not contain an anagram of Yesu Christ, and he does not die in The Mysterious Island..","date":"2015-02-07","mins":"7:09 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190186","author":"hugh_farey","post":"“I never in this blog, referred to Cyrus Smith as Cyrus Harding.” See February 6, 2015 at 6:14 am, above, repeated at February 6, 2015 at 6:34 am..","date":"2015-02-08","mins":"4:50 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190197","author":"hugh_farey","post":"Strange. If I type the exact phrase: February 6, 2015 at 6:14 am into my Find Box, your comment appears instantly. It contains parts (e) and (f) of a list of comments about The Mysterious Isle, including the following: Then a short intriguing dialogue: “Nevertheless, I know you!” replied Cyrus Harding. Perhaps our computers give different time readings, but if you were to type some of that extract into your find box, I’ve no doubt it will appear for you. No Rosicrucian games, no false references, no Fraudo Malfoy, just a plodding scientist who wants a teeny bit of evidence to confirm whether your deliberations are rooted in any kind of reality. However, you’re quite right about one thing, Max. I am really wasting your time. It’s a good job we enjoy it so much, isn’t it?.","date":"2015-02-08","mins":"6:23 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189309","author":"hugh_farey","post":"You get vaguely indicative suggestions, Max, not proof, intrinsic or extrinsic..","date":"2015-02-05","mins":"5:51 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189706","author":"hugh_farey","post":"This is marvellous! I have to say I really enjoy these etymological labyrinths that Max concocts: the Mysterious Island one is great, and I dare say the Harry Potter Heptalogy is but waiting in the wings. Needless to say, however, there is no evidence whatever that any of them were intended by, or even known to, their respective authors, an observation that applies particularly to any “true fact” or “proof” regarding a pre medieval existence for the Shroud. Hey guess what, Holy Shroud is an anagram of Hourly Dosh. So that’s the reason for all the expositions we’ve been having recently….","date":"2015-02-06","mins":"10:00 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189756","author":"hugh_farey","post":"There’s no need to repeat everything; if I disagreed with it the first time there’s a fair chance I would disagree with it the second time as well. What you need to do is substantiate things. With evidence. The fact the Verne was a Rosicrucian does not mean that he was “initiated into the secrets of the Turin Shroud.” For what it’s worth I don’t believe there are any secrets to the Shroud. Do my homework? Why? You make a claim; you substantiate it, or it’s no more than wild speculation. In the unlikely event that the book whose Amazon blurb you quote even mentions the Shroud, or gives some evidence that the submarine Nautilus was intended as an anagram of Linus Tau, perhaps you’d like to give us the page number, and then I’ll do some homework to demonstrate the spuriousness of the claim, or to be convinced that you are in fact correct..","date":"2015-02-06","mins":"2:12 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189795","author":"hugh_farey","post":"1) “These are FACTS.” If you have any evidence for any of them, please present it. Otherwise they are nothing but speculations. 2) “The Etymology of Rosecroix is Roscrucis, ‘The Dew of the Cross’.” If you have any evidence for this, please present it. Otherwise it is nothing but a speculation. 3) Now Manna comes from the Hebrew sentence “Man Hu? “What is it?” This is one of many possibilities. So what? 4) “Are you really a Christian?” Yes. Nothing you say has either evidence or authority. If it had, I would investigate it further. As it hasn’t, there is no need. Jules Verne knew nothing about the Shroud and did not incorporate it into his works, consciously or unconsciously. If you have an evidence to the contrary, present it. Are you really an archeocryptologist?.","date":"2015-02-06","mins":"5:45 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189805","author":"hugh_farey","post":"“vraisemblablement”? “Rien ne nous interdit de penser”? This isn’t evidence, Max; it’s guesswork..","date":"2015-02-06","mins":"6:15 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189953","author":"hugh_farey","post":"Still no evidence, Max. Lamy’s suppositions are as unsupported as yours, and the design of Jules Verne’s tomb does not look like a Rosicrucian emblem. There is no evidence that it is one. I can’t even see the letters RC you say are engraved on it, although it’s not a very clear photo. As for that “to learn all that which G d hath suffered Man to know” you are so keen on, it seems to be a part of an extraordinarily prolix hermetic peroration beginning “Wisdom (saith Solomon) is to a man an infinite Treasure, for she is the Breath of the Power of God, and a pure Influence that floweth from the Glory of the Almighty.” A noble sentiment, no doubt. If it means that we should all be better off if we were wiser, then I agree. I don’t think trying to “learn all that which G d hath suffered Man to know” is a particularly Rosicrucian aspiration, and I do think it could be encouraged generally..","date":"2015-02-07","mins":"3:55 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189986","author":"hugh_farey","post":"This is all guesswork, Max, and the more etymological connections you make the less I feel that Jules Verne made any of them himself. The etymology of Rosicrucian is most unlikely to be Ros Crucis, and the etymology of Persona has nothing to do with the Etruscan Phersu. Have you any primary evidence at all that Jules Verne was a Rosicrucian? If so, present it; if not, your speculations are no more than immensely entertaining..","date":"2015-02-07","mins":"6:44 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190044","author":"hugh_farey","post":"You’re not really getting my point, are you, Max? Elaborate etymological prestidigitation, however learnedly constructed, is not the same as evidence. Evidence is a letter to Jules Verne saying “Dear Sir, welcome to the Rosicrucians,” or a diary entry “Today I became a Rosicrucian”, or a list of members from 1880. The fact that Nautilus is an anagram of Linus Tau is not evidence, nor the idea that Nemo = Personne = Shroud image. These are castles in the air. Now for Persona. Your evidence for its derivation from Phersu is a quotation from Wikipedia? Oh, really. Surely we should expect better than that, especially as the sentence mentioning it is followed by [citation needed]. No cigar there. Let me give you a hand, shall I? You are no doubt familiar with Oswald Szemerényi, the Hungarian linguist, but perhaps not with his article in Hermes, the international, peer reviewed journal on Greek and Roman antiquity, ‘The Origins of Roman Drama and Greek Tragedy’ (Hermes 103. Bd., H. 3 (1975), pp. 300 332). There, from page 308 to page 312, he discusses the possible derivation from Phersu. He gives quotations from Festus, Plautus and Tacitus to establish the meaning of the Latin word Persona, and he discusses at length two Etruscan tomb paintings of long bearded, conical hatted masked men which are labelled Phersu in the inscription. This, Max, is what scholars do. They present evidence and they derive conclusions from it which others can analyse from themselves, making up their own minds as to whether they agree. If you want to establish any kind of credibility in your own arguments, you have to do something similar. Oh, and what does Szemerényi conclude? “To sum up, Lat. Persona has nothing to do with Etr. Phersu.” Do some homework, Max, and give us some evidence. Jules Verne wasn’t a Rosicrucian at all, was he?.","date":"2015-02-07","mins":"2:04 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-191576","author":"hugh_farey","post":"Yes, of course. Brian Lai knows what a negative image is, and has a positive in front of him to ‘invert.’ It’s a clever party trick, but not really related to the image on the Shroud. If the Shroud was painted as it is, it was not because the artist wanted to produce a negative, but a deliberate attempt to depict the image that might have been left by a moist body on a covering cloth, with closely pressed parts more dense and less firmly contacted parts less dense. John Jackson, you will recall, got police artists to attempt exactly this, with moderate success. What we must ask ourselves is: Is the resulting image too good to be true? And, by way of clarifying what we mean by that, is the resulting 3 D image as produced by Image J or the VP 8 analyser too realistic to be credibly the work of an artist? If the answer is yes, then non authenticists must abandon the straight painting hypothesis and go for the bas relief powdering, smearing or scorching method, when, it might be supposed, a more realistic ‘negative’ might be an inevitable consequence of the process, as demonstrated by Garlaschelli or Colin Berry..","date":"2015-02-22","mins":"2:27 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191594","author":"hugh_farey","post":"“But what is the probability that a medieval forger could paint a ‘negative’ image that matches the accurate ‘photographic’ negative properties of the TS image? The fact is that the painters who tried to reproduce the TS image itself failed to reproduce the negativity.” I couldn’t disagree more. Both the negativity and the 3 D qualities have been reproduced many times by many people, not least myself. The police artists commissioned by John Jackson, the artist the BBC commissioned to copy the Shroud face, and even Walter Mc Crone himself have all produced images which produce excellent negatives and translate reasonably well into 3 D. The Shroud itself is nothing like as fabulously accurate as most people suppose, requiring a considerable amount of manipulation to attempt to make it look anything better than a very flat intaglio. The objection to these copies is not that they are not as good as the Shroud, but that they are based on what they already knew and images they had already seen. Some time ago I suggested that a better experiment would be to recruit good artists in a non Christian country with no knowledge of the Shroud, and ask them to produce a monochrome painting as if left by a body in a sheet, and see what that looked like..","date":"2015-02-22","mins":"6:40 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191595","author":"hugh_farey","post":"And Sampath, the Shroud does not show that the nails were not banged in through the wrists. Enlarge the crossed hands area on Shroud Scope and decide where the extremities of the proximal phalanges (the clearest of the visible finger joints), and measure them using the online tool. Then decide whereabouts on the blood stain marks the centre of the nail hole (there are several possibilities) and measure the distances from the ends of the phalanges to your wound spot. Transfer these eight measurements to your own hands. On my hands the resulting point is well within the area of the metacarpals, and not within the area covered by the wrist bones..","date":"2015-02-22","mins":"7:11 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191635","author":"hugh_farey","post":"Isabel Piczak is certainly not a noted theoretical physicist, and her prognostications on the physics of the resurrection are unlikely to make her one. She is undoubtedly a noted artist, and has had useful things to say regarding the projection of the image on the cloth. I do not know what her experience is of medieval paintings..","date":"2015-02-23","mins":"8:08 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191676","author":"hugh_farey","post":"Sampath: I have attempted to explain why the nail wound of the Shroud man is not in the wrist at: http://i.imgur.com/LH4rm E9.jpg. Perhaps you and daveb would like to point out the flaws in it! Thibault: Your point is very valid. All the copies of the Shroud I have seen have been done by people with at least some idea of what they were aiming at. If there was a medieval painter, he would have had a good idea of what he was doing (something like producing a sweatstain), but no real idea of what the end product was likely to look like. Whether it was impossible for him to achieve the Shroud as we know it is a matter of conjecture. Kelly: “Initially dismissing someone without even considering what insight they might provide tells of insecurity.” Indeed it would. I would never do such a thing. See the discussion on this site on October 12, 2013, “In case you missed Isabel Piczek’s wonderful paper.” As an artist, Isabel Piczek (Piczak was a typo, I do apologise to the good dame) may well know useful things about pigments, although as I say, I do not know of her expertise in the medieval history of art. However she has no background in physics, and, if her papers about event horizons are anything to go by, no chance of becoming a ‘noted’ scientist..","date":"2015-02-23","mins":"4:37 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191685","author":"hugh_farey","post":"Sorry OK, but a single measurement is insufficient to discredit my paper. The middle of my N2 position on the Shroud is clearly defined. If you measure 58mm from this point towards and beyond P2a, you reach a possible position for the knuckle. Fair enough. However, if the knuckle is in that position, then the length of the phalanx is reduced to about 45mm, one of the shortest, when in fact it should be the longest. As for your metacarpal being only 58mm long, then it is considerably shorter than mine, and probably shorter than that of the man in the Shroud. If you’re going to pursue this idea, you need to measure all your proximal phalanges, find out whether they are bigger or smaller than those of the man in the Shroud, and make appropriate corrections before you can assess the position of the wound on the back of your own hand..","date":"2015-02-23","mins":"5:40 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191688","author":"hugh_farey","post":"The position of the hand wound is exactly the same in both positive and negative images. I have mentioned the X Ray hypothesis in my paper, but do not believe that there is any justification for it. If there is, then it should be an easy matter to point out the exact positions of all the joints on a photograph of the hand, and to measure them to see if they are physiologically compatible. This has not been done..","date":"2015-02-23","mins":"6:00 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191693","author":"hugh_farey","post":"“The length from the wrist to the basis of the knuckles should be about the same as the length from the basis of the knuckles to the end of proximal phalanges.” I’m not sure I get that. The yellow bones are longer than the green bones. A comparative study of Hand Segments (http://www.scielo.cl/pdf/ijmorphol/v28n3/art15.pdf) gives every metacarpal as at least 15mm longer than its connected phalanx..","date":"2015-02-23","mins":"6:29 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191682","author":"hugh_farey","post":"Fair enough. Have you read “The Event Horizon of the Shroud of Turin”? Elevating stuff….","date":"2015-02-23","mins":"5:26 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191686","author":"hugh_farey","post":"I am absolutely certain that if Dr Barbet had had the same access to the internet as you or I, he would have been considerably less confident about a number of his conclusions. In the only illustrations of his dead bodies that I have seen, there is no retraction of the thumbs because the bodies were dead when he nailed them..","date":"2015-02-23","mins":"5:45 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191680","author":"hugh_farey","post":"“The thumbs are missing from the Shroud image because their natural position both in death and in the living person is in the front of and slightly to the side of the index finger. Therefore, it would be next to impossible to have impressions of the thumbs because the Shroud would not be in contact with them.” I don’t think I can improve on Dr Zugibe’s thinking. He also didn’t think much of the ‘median nerve damage’ hypothesis. Googling ‘median nerve damage’ one can easily see why..","date":"2015-02-23","mins":"5:23 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191692","author":"hugh_farey","post":"Try Googling “barbet cadaver.” Not a pretty sight, but no retraction of the thumbs..","date":"2015-02-23","mins":"6:23 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191699","author":"hugh_farey","post":"No. Your total length now, from the wound to the far end of the phalanx is 59.0 + 51.7 = 110.7mm. My hand being bigger than the Shroud’s, I multiply this by 1.1 to get 121.8mm. On my hand, this takes me exactly to position N3, and not the wrist. As I said before, a single measurement here or there cannot be used to define a position, because an overall match is needed. You need to measure all your own phalanges, compare them to the Shroud’s, multiply the Shroud measurement by any necessary correction factor, and then find the position of the wound on your own hand. I very much doubt you will find your positions very different from mine..","date":"2015-02-23","mins":"7:19 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191731","author":"hugh_farey","post":"If your hands are smaller than those of the Shroud man, then of course the wound will appear over your wrist, unless you use a correction factor. As my hands are larger than those of the Shroud man, then I also had to apply a correction factor or the wounds would have, quite improperly, have ended up right in the middle of my palms. You really do need the complicated method..","date":"2015-02-24","mins":"9:14 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191728","author":"hugh_farey","post":"“No one knows what the angle of the hand is to the surface of the cloth.” While this is true, we can make some valid approximations. If the cloth follows the contour of the hands, or if the hands and cloth are in the same plane, then the absolute measurements are valid. If the hands are in one plane, and the cloth in another, then either a) The measurements are shorter than real life if the ‘radiation’ is perpendicular to the cloth or b) The measurements are longer than real life if the radiation is perpendicular to the hand. But by how much? To increase any of these measurements by a single millimetre requires that the cloth be in contact at one end and about 10mm higher than the cloth at the other end. This is wholly impracticable. It is simply not enough to say, we don’t know this or that. Nor does it matter if the hands are cupped, as only two bones of each finger are under consideration here. The positions of the thumb and outer joints of the fingers are irrelevant to these calculations. I would indeed be very grateful for any evidence that I’m wrong. Please do send over the forensic slides. I may disagree, but will give sincere reasons for disagreeing, and not just be disagreeable!.","date":"2015-02-24","mins":"8:12 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191740","author":"hugh_farey","post":"All I can say is that I beg to differ, OK. You might like to post a photo of your hand so that we can match it to the Shroud and see how it fits..","date":"2015-02-24","mins":"1:17 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191747","author":"hugh_farey","post":"That’s kind of you OK. I hope I have not misrepresented your finger joint positions in the image below, where I have done exactly the same with your hand as I did with mine. I think that even your hand demonstrates that the wound is in the metacarpal region, not amongst the carpals..","date":"2015-02-24","mins":"4:43 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191756","author":"hugh_farey","post":"They do, don’t they. I think they’re wrong and I’ve explained with evidence why. If you can find fault with my explanation, then please say what it is. If you cannot find a fault with it, then maybe it is correct..","date":"2015-02-24","mins":"7:06 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191755","author":"hugh_farey","post":"The good thing about some aspects of the Shroud is that they are open to experimentation rather than mute acquiescence to accepted opinion. Anybody at all can mark their finger joints with dots, mark a photo of the Shroud with dots, superimpose the two and see where the Shroud wound actually is. You have all seen my work on my hand, and now my work on OK’s hand. Can anybody produce an overlay in the same style which shows the Shroud wound in their wrist? Or explain in any detail where I have gone wrong? Daveb at least made an attempt in supposing that the shroud was not in contact with the back of the hand, but at an angle to it, so that the length of the back of the hand on the Shroud is much shorter than it was on the body. This at least makes sense geometrically, although we would then have to ask why the image density of the hand does not fall off as we move from knuckles to wrist, and why the blood mark, which must have been made with the wrist in contact with the cloth, is not much further up the arm than it is..","date":"2015-02-24","mins":"7:04 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-64106","author":"hugh_farey","post":"Various people have commented on this. It is often attributed to a dislocation of the shoulders either during crucifixion or as the arms were forced down into their current position from the position they were in when rigor mortis set in. It is also quoted as evidence that the Shroud is a fake. It is occasionally mentioned as evidence that Jesus had one or other skeletal abnormality such as Marfan’s syndrome. Forensic pathologists tend to remark that the image is perfectly proportioned..","date":"2013-12-21","mins":"8:14 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","title":"What Did Jesus Look Like Throughout History?"},{"id":"comment-63064","author":"hugh_farey","post":"“There is no doubt whatever that the carbon dating does not represent the date of the Shroud itself, but of a potential unknown repair.” Really? I’m quite skeptical about that… Skeptics are people who don’t accept sentences that begin: “There is no doubt whatever that….” It doesn’t really matter whether the rest of the sentence is: “… the shroud is authentic” or “… the shroud is a forgery.” What is the opposite of “Skeptic,” I wonder? Dogmatist? Thesaurus.com gives Believer, Optimist, Devotee and Disciple. It is true that those who describe themself as “Shroud Skeptics” are usually not merely skeptical of authenticity, but fanatically convinced of the “fake it and flog it” school of thought. That’s deeply offensive to us real skeptics….","date":"2013-12-20","mins":"6:35 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","title":"What Did Jesus Look Like Throughout History?"},{"id":"comment-45630","author":"hugh_farey","post":"This http://queritedominum.blogspot.co.uk/2010 05 01 archive.html was specifically modelled on Robert Buckin’s ideas, I believe. Here’s another: http://anglicancontinuum.blogspot.co.uk/2011 04 01 archive.html, and, somewhat different: http://www.cmstatic1.com/299/c/hand carved crucifix from shroud of turin–UDU2 Ny0y O Tku Mj U4 Nw==.jpg.","date":"2013-09-27","mins":"12:11 pm","url":"https://shroudstory.com/2013/09/24/what-did-jesus-look-like-2/","cat":"art","title":"What did Jesus look like?"},{"id":"comment-184238","author":"hugh_farey","post":"It is a point worth making. However the Besançon Shroud, which no one disputes was a painting, was in use for at least 200 documented years before being destroyed. I wonder how that was stored?.","date":"2015-01-18","mins":"4:51 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186344","author":"hugh_farey","post":"Right and wrong, Thomas. There are holes in Charles’s arguments, as I have clearly pointed out above, but there are also coherent pieces which cannot be swept aside with the holes. That the Shroud today is not exactly as it always has been is surely not in doubt. Most of each bloodstain has disappeared, leaving only a few flakes jammed in the interstices of the threads, and the entire cloth has yellowed with age, possibly reducing the contrast. That is not to say that it was once a full colour painting of a dead man covered in blood, and I agree that the Lier copy (even though that too has no doubt deteriorated in detail) is probably a fair illustration of the Shroud as it ever was. However, as Charles, points out, engraver after engraver produced images of the shroud which, although very similar to each other, are nothing like the Shroud as we know it. Unless extensive repainting and unpainting is invoked, it is difficult to explain why. The particular aspect that intrigues me is that the feet are usually seen widely separated and pointing outwards, whereas the Shroud has them close together (overlapping) and pointing inwards. In this instance, it does not matter whether the Shroud is authentic or medieval. Here are two styles of copy; they are very different; they both need explaining. I don’t think this is being either cute nor a smart ass. If you, or anybody else, has already satisfactorily come up with an explanation, then I have yet to read it. I look forward to it….","date":"2015-01-26","mins":"5:24 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186374","author":"hugh_farey","post":"Yes; I deliberately avoided the word ‘crossed’ and put ‘overlapping’ in brackets so as to try to fudge the description! Whatever their precise position, they are clearly different from way they are depicted in most of the engravings, well apart and pointing outwards..","date":"2015-01-26","mins":"8:04 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186743","author":"hugh_farey","post":"Thanks for introducing us to those quaint little woodcuts, with which I was not familiar. I believe the actual Kornelimunster relics lack any images, except for a blur in the schuztuche which is sometimes interpreted as the dirt from Judas’s feet. However, as you point out, the 15th century woodcuts show them covered in drops of blood, which they clearly don’t have. Quite possibly the engraver had never even seen them. I agree with you that the relics never had any more marks than they have now, so perhaps you would like to speculate as to why the engraver (deliberately?) misrepresented them. It may shed light on the Shroud of Turin..","date":"2015-01-27","mins":"6:52 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-184291","author":"hugh_farey","post":"Pam also speculates that the limestone may have come from the dust of a newly hewn tomb. In that case one might suppose that the back of the dorsal image would have become quite dusty, but not, especially, anywhere else. The next densest accumulation would be the back of the ventral image, which was exposed to dust drifting from the ceiling for some hours, but I would not expect ‘relatively large’ concentrations on the image face of the cloth at all. Over the years much or all the dust would no doubt have been brushed/washed off, and maybe a little diffused, but surely any remaining would still be concentrated on the back of the dorsal image. There is no suggestion, among the various investigations into the hooverings from between the Shroud and the backing (applied after the fire of 1532), that this is so..","date":"2015-01-18","mins":"11:19 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185121","author":"hugh_farey","post":"“To picture Yeshua’s elusive DEAD naked body on his burial cloth would have confused the Visitatio spulchri message (“HE IS NOT HERE but is risen”).” If the shroud was made for the Quem Quaeritis rite, it was important that it did not depict a dead body for exactly that reason. But that is exactly why the Shroud does not depict a dead body. It depicts the imprint and bloodstains left by the body, and that is why it had to be monochrome, to resemble an imprint left by sweat or decay, and to have the negative quality that would result from such an imprint. Primitive though it was, the Besançon shroud had similar features, I believe, and Bergier indicates that these two were far from alone..","date":"2015-01-21","mins":"10:40 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185132","author":"hugh_farey","post":"Historiosophers, please..","date":"2015-01-21","mins":"11:23 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185405","author":"hugh_farey","post":"Nineteenth (and earlier) century enthusiasts for other shrouds were happy to accept that they were all genuine, and did indeed give the Turin shroud the role of transport sheet, while their own favourite (Cadouin, Besançon) was the actual burial sheet..","date":"2015-01-22","mins":"11:41 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185928","author":"hugh_farey","post":"I think we’re going round in circles. Charles is certainly correct that most of the pictures of ostentations, of all ages, are clearly defined full length portraits, and his critics are certainly correct that most of the actual copies of the shroud, of all ages, are as faint or nearly so as the Shroud itself. (Carlos’s picture above being a notable exception) The problem is to reconcile these two different styles of representation. There are several approaches, technical and cultural. Firstly, almost all the illustrations of ostentations in Beldon Scott are of engravings or woodcuts or prints, which do not lend themselves to indistinct representations of anything, while the copies in cloth mentioned above are paintings, which can be as faint as you like. Secondly, on those rare occasions when colour appears, it is invariably monochrome. Of course an engraving could hardly be anything else, but the della Rovere paintings show a monochrome image, and a poster for the 1684 exposition, which is mostly engraved but had a woodblock insert just for the images, has that wood block print in sepia. Thirdly, the USP power of the Turin Shroud was that it held the two fold image of Christ, not that it was just longer than its rivals in France, nor even that it had blood on it. Even if the pilgrims who came to see it never actually got close enough to observe it directly, they could buy a souvenir showing what they would have seen if they had had the chance. Fourthly, as I have argued above, if the Shroud was originally made for a Quem Quaeritis ceremony then it was essential (as OK picked out) that it was not a painting of Christ lying in his shroud, but a representation of what he might have left behind. This makes more sense to me than a forged miracle, when in general the more “miraculous” it looked the better. Fifthly, by the time the shroud reached Chambery, let alone Turin, it had ceased to have any connotations of ‘realism’, and had become a ‘my relic is more magnificent than your relic’ status symbol, so advertisments, before or after, of ostentations not only showed a more magnificent representation of the shroud image, but also the magnificence of the management of it, with dozens of clerics and soldiers in serried ranks. There is an interesting comparison to be made between the Tempesta engraving of 1613 and the Bolkmann painting of 1686. Both are crammed with the same sort of people, but the impression in the earlier one is of chaotic enthusiasm, with soldiers rather vainly squashed up against the ostentation dais as the populace crush forwards, while in the Bolkmann, there is very clear military order, the crowds being firmly kept in place behind regiments of cavalry. In the first, the image on the Shroud is very visible, in the second, wholly hidden behind a silk cover. I’m interested in Bolckmann. He is wholly unknown to the internet other than for this one painting, which is described by Beldon Scott as “a unique visual document recording with remarkable accuracy the appearance of one of these events.” However, I’m not sure I agree with Beldon Scott’s rationale for his painting “the climactic moment when the attending bishops pull back the red silk covering.” I don’t think it had anything to do with the moment. I think the reason his painting doesn’t show any more than the bottom few inches of the shroud under its red silk covering was because he was honest enough to know that there was actually almost nothing to see, and that from the viewpoint of the painting it would have been a blank white sheet..","date":"2015-01-24","mins":"5:58 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186234","author":"hugh_farey","post":"But Charles does have a point. However indistinct, the man in the shroud has his feet together and is wearing neither a loincoth nor a crown of thorns, whereas the engravings nearly all have separated feet and are wearing a loincloth and a crown of thorns. It’s as if they were copying a standard, and if it was not the Shroud itself, I wonder if there was a statue, or painting, of the man in the shroud, now lost, which was there for pilgrims to see if they came when no exposition was going on. I believe nowadays there is a reproduction of the Shroud hanging above the altar in which it lies, for just such people to see. That statue perhaps had all the characteristics we see in the engravings, separates feet, loincloth, crown of thorns or whatever, and the engravers then copied that onto their pictures, even though they knew that the real thing was nothing like it. In some cases they may never have seen the real thing at all..","date":"2015-01-25","mins":"5:20 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185988","author":"hugh_farey","post":"Either the Shroud looked much as it does today, in which case we must explain why the engravings are so clear with their loincloths and crowns of thorns, or it was much better defined, with loincloths and crowns of thorns, in which case we must explain why the paintings are so faint and tenuous. I have tried to see both points of view, but cannot help finding the engravings easier to ‘explain away’ than the paintings. Rather like souvenir postcards of Roman ruins, they were created to show what was ‘meant’ to be there rather than what actually was there. I have only heard a couple of arguments the other way – one that the faint paintings were as bright as the Shroud but they too have faded with age, and the other that they were copies of something else. Neither of them ring true with me. Charles is quite correct that we ought to try to imagine what the Shroud was like when it was first created, and no doubt the cloth has yellowed and the blood largely rubbed off, but the earliest Ab Originale copies are too similar to its present appearance for me to think it was very different. However, I do not see that having a fainter appearance detracts from Charles’s Quem Quaeritis hypothesis at all, quite the reverse; it strengthens it, as I have explained above..","date":"2015-01-24","mins":"12:31 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"}]
