[{"id":"comment-154783","author":"hugh_farey","post":"Sorry, anoxie, it’s a ‘you can earn marks for your working even if your premises are wrong’ approach often used by examination markers! The two statements made by the paper which ‘fit the bodily Resurrection of Christ’ do indeed just that, even though I think one of them to be incorrect..","date":"2014-09-24","mins":"3:26 am","url":"https://shroudstory.com/2014/09/23/a-bold-conclusion-the-blood-the-image-the-man/","cat":"blood_studies","title":"A Bold Conclusion:  the Blood, the Image, the Man"},{"id":"comment-154466","author":"hugh_farey","post":"“This fits the bodily Resurrection of Jesus Christ.” I’m not quite sure what anoxie is saying. Is he disagreeing with this statement? It refers to: – “no signs of putrefaction of the dead body” which could be explained by the disappearance of the body before putrefaction set in, which fits the Gospel accounts of the Resurrection within 40 hours or so. – “the dumbbell shaped scourge marks on both halves of the Shroud are not smeared.” If one were to accept that the body left the inside of the Shroud while the blood stains were still damp (not something I go along with personally), then it could be thought miraculous that they were not smeared, which fits in with the miracle of the resurrection referred to in the Gospels. On its own merits the concluding sentence of the abstract is perfectly reasonable, although the Resurrection is not mentioned anywhere else in the paper, which devotes itself mostly to explaining the pink colour of the bloodstains..","date":"2014-09-23","mins":"5:12 pm","url":"https://shroudstory.com/2014/09/23/a-bold-conclusion-the-blood-the-image-the-man/","cat":"blood_studies","title":"A Bold Conclusion:  the Blood, the Image, the Man"},{"id":"comment-35222","author":"hugh_farey","post":"Bilirubin bilirubin bilirubin… Bilirubin is orange. It is not red. Or carmine. Or mauve. Miller and Pellicori described the blood under UV light as “highly absorbing. No colour.” The bloodstains do not fluoresce under ultraviolet light. This either means that as a ‘brightening agent’ bilirubin is not present, or that bilirubin, if present, is not a ‘brightening agent.’ Barbet, Yannick’s blood expert, immediately identified the bloodstains as blood, but of a very special colour. This suggests that although the colour was not distinctive enough to outweigh the other evidence leading to a conclusion of blood, it was not ‘normal.’ This may have been because centuries old blood doesn’t look like the ‘normal’ blood he was used to, or that the blood has had something else added to it. Barbet, I am sure, had he been pressed to say what the cause was of the distinctive colour, would have been happy with a vague hope that under some circumstances blood can stay red for longer than ‘normal.’ Subsequent investigation has yet to demonstrate that that is the case for blood which is hundreds of years old..","date":"2013-05-29","mins":"10:35 am","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35240","author":"hugh_farey","post":"Not bilirubin. Bilirubin isn’t red. It can’t make things “more red.”.","date":"2013-05-29","mins":"11:56 am","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35451","author":"hugh_farey","post":"I’m familiar with the quote, Yannick, but Adler did not, as far as I know, actually attempt this rather wishful experiment, and am certain that if he had, he would not have arrived at a red mixture. He was clutching at straws at this point, and I think hoped that the red colour would somehow arrive by a colour additive process rather than the subtractive process with actually occurs..","date":"2013-05-31","mins":"9:00 am","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35250","author":"hugh_farey","post":"Miller and Pellicori (Ultraviolet fluorescence photography of the Shroud of Turin, Journal of Biological Photography, 1981) say that the the blood does not fluoresce. UV exposure makes no difference to the colour of the blood. It isn’t bilirubin..","date":"2013-05-29","mins":"12:31 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35269","author":"hugh_farey","post":"Yes, I follow that. However, anybody with a paint pallette can discover that adding something yellow or orange to something brown doesn’t make it red. If the brown blood stains really do change colour to bright red after exposure to bright light, then although UV radiation may be responsible, the change is not a purely optical one but a chemical one, which must be explained in terms of one of the components of the bloodstains, possibly bilirubin, turning into something else. This has not been explained satisfactorily..","date":"2013-05-29","mins":"1:41 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35262","author":"hugh_farey","post":"Thanks for mentioning that, Jesterof. I’m not sure what paper Louis was referring to but http://www.ohioshroudconference.com/papers/p04.pdf describes an experiment involving blood with extra bilirubin added, which turned bright red after six hours of exposure to ultraviolet light. It is suggested that UV radiation turns bilirubin into lumirubin and isolumirubin, but these are both yellow. I should like to know what chemical change makes bilirubin bright red before I found this paper wholly convincing..","date":"2013-05-29","mins":"1:20 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35276","author":"hugh_farey","post":"A later article, at http://xoomer.virgilio.it/bachm/BRILLAN2.PDF by Brillante, Fanti and Marinelli, tends to discount bilirubin in favour of carboxyhaemoglobin. I don’t know how stable carboxyhaemoglobin is, but at least it’s red. I’m sorry I can’t state that colour becomes “bright red.” May I assume that Goldoni et al. Couldn’t state it either, as my words are taken directly from their paper, and quoted by you in the post above this one..","date":"2013-05-29","mins":"2:20 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36967","author":"hugh_farey","post":"I always get suspicious when a sentence begins: “Scientists now believe….” It is almost exclusively used to suggest that there is general scientific acceptance of something, when invariably the contrary is the case. The only people who have any hope that Lincoln had Klinefelter’s Syndrome (not Kleinfelter) are The American Association for Klinefelter Syndrome Information and Support, and their evidence is almost entirely that he was tall and thin. Other ‘scientists’ have suggested Marfan’s Syndrome and multiple endocrine neoplasia, both of which have been discredited by other ‘scientists.’ As almost all adults with Klinefelter’s Syndrome look no different from any other adult, it is difficult to say categorically that any historical figure didn’t have it, but the figure on the shroud does not, in my opinion, show the enlarged breasts that occur in a few percent of cases, nor the nipples which would accompany them, and whether, or by how much, his overall proportions differ from those of ordinary people has been the subject of endless inconclusive debate. As for the alleged discoveries of Ron Wyatt, not only do these remain unproven, but there is no evidence at all that he discovered any blood on any ark down any crack under any crucifixion cross socket. For any serious consideration of his ‘trisomy’ theory, at least the laboratory which allegedly carried out the work might be identified..","date":"2013-06-14","mins":"12:47 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37236","author":"hugh_farey","post":"Even a cursory look at Ron Wyatt’s Sodom and Gomorrah pages are enough to demonstrate that his ashen cities are nothing more than wind eroded lake deposits typical of the entire area. His satellite photographs have been superseded by Google Earth’s extremely detailed aerial photographs which show no sign of his city streets. The geology of the entire area has been extensively studied and none of it demonstrates any extreme volcanic activity (although a fair amount of seismic activity is clear). His chemistry, suggesting that the deposits of limestone and gypsum are the products of vulcanicity rather than aquatic deposition, is eccentric in the extreme. All his photos of “crystals of sulphur” are actually “desert roses” of gypsum. Pure sulphur balls are not exclusive to the Dead Sea but relatively common in similar conditions across the globe and may be caused either microbiologically or due (more likely in this case) to the reduction of gypsum by hydrocarbons. They are not direct evidence for, let alone proof of, the existence of God. For further details you could try Googling Lake Lisan Geology, or the name of the scientist who went out to check Ron Wyatt’s claims, Elizabeth H. Gierlowski Kordesch..","date":"2013-06-17","mins":"6:30 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37278","author":"hugh_farey","post":"“Scientists and historians have dismissed Ron Watts, in the same way that they ignored Jacobovici who claimed to have found “Moses’ footsteps”, so to say, in Sinai.” Although I agree with the general tone of your post, Louis, the sentence above could have come straight from an extremist tract, and could be misleading. Scientists and historian have not “ignored” Jacobivici, not did they “dismiss” Wyatt in the same way. The claims of both these men were examined closely, and simply did not live up to the interpretation put upon them. The claims were therefore rejected. No doubt if more convincing evidence were adduced, that too would be examined carefully, with the possibility of accepting the claims after all. It is all to common for people with extreme ideas to declare that their views have been completely ignored, when in fact they have been carefully assessed, and found wanting..","date":"2013-06-18","mins":"4:17 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-61169","author":"hugh_farey","post":"Well I certainly agree that Baima Bollone’s findings should be considered in conjunction with the STURP team, but I guess I’ll have to continue to plough my own furrow regarding the Soret band. Heller & Adler in “Blood on the Shroud of Turin” clearly say “All these fibrils showed intense Soret (400 450nm) absorption indicative of a regular porphyrinic material.” Pellicori in “Spectral properties of the Shroud of Turin” clearly says “The Shroud curve shows […] no suggestion of a Soret band.” These two statements are directly contradictory. Furthermore, Heller & Adler (Figure 2) show spectra from two blood samples that are totally different, and Pellicori (Figure 4, comparing only ‘Mean Blood Stain on Shroud’ and ‘Linen after 7.5h @ 60°C’) also shows two spectra which do not resemble each other at all. I’ve even discovered another discrepancy (http://patentimages.storage.googleapis.com/EP2220249 B1/imgf0001.png). Notice the steep absorption trough at 700nm, followed by an equally steep rise. This is very different from the Gilberts’ spectrum, which continues to drop towards 750nm. If we compare the Gilberts’ spectrum, from 0nm to 759nm, to the spectrum of methemoglobin over the same range, the conclusion that the two are the same cannot, in my opinion, be sustained, even allowing for convenient hypothesised distortion due to age. I do take Kelly’s point about other old blood. Sadly, although blood seems to have been found on Aztec sacrificial knives, Utzi the Iceman, and on paleolithic stone tools I cannot find a spectral analysis of it. The blood seems to have been chiefly identified because of the survival of erythrocytes – which are sadly lacking on the Shroud..","date":"2013-12-17","mins":"6:58 pm","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-36780","author":"hugh_farey","post":"The dorsal image of the shroud by itself utterly refutes the idea that Jesus was flogged to the extent that “the skin of his back is hanging in long shreds” or anything like it. Nor does crucifixion result in massive blood loss, as the nails effectively block the holes they make. Scalp wounds bleed quite well, but nothing like enough to provide a “massive blood loss.” I agree with jesterof..","date":"2013-06-12","mins":"10:49 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-61203","author":"hugh_farey","post":"Well I think I agree with most of that..","date":"2013-12-17","mins":"8:52 pm","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-61713","author":"hugh_farey","post":"Julie, it seems that Garlaschelli used two different techniques, both of which produced some shroud like characteristics but not others. The first was rubbing with dry powder. This produced a good image with the requisite 3 D and negative characteristics, but was a flop microscopically, as it depended entirely on the powder, which easily washed off, leaving an unmarked cloth. The second was rubbing with a dry powder mixed with 1% sulphuric acid into a paste. The powder washed off, as before, and the acid left a superficial degradation of the cloth which was enhanced by heating. However the marks produced by this method lacked the 3 D and negative quality of the Shroud. It is not clear to me the proportions in which the powder and the acid were combined (pastes can be thick or thin), and think that further investigation of this method, using different thicknesses of paste, would be worth carrying out. Piero, the “bioplastic coating hypothesis” of Leoncio Garza Valdez was largely discredited when it was recognised that the coating would have to be twice the weight of the shroud itself in order to affect a 1st century cloth so much that it appeared 13th century when carbondated. It suffered more when some supposed filamentous bacteria pointed out by Garza Valdez were reclassified as ultimate threads from the linen fibrils, and more still when it was realised that bacteria and fungi are heterotrophic and, since all their carbon would be derived from what they ate (the shroud), the radiocarbon date would not be affected by them anyway. However it is not impossible that some bacterial contamination of the shroud may have affected its chemical composition..","date":"2013-12-18","mins":"2:48 pm","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-62473","author":"hugh_farey","post":"Thanks, Jos. I’m familiar with Lucotte’s book and have corresponded with him regarding aragonite. The provenance of his samples has been criticised, but his microphotographs, coupled to the elemental analyses below, consitute a fascinating examination of the various particles he (or anyone else) has encountered. Of the 2000 or so particles catalogued, he identified 9 as human erythrocytes, although somewhat cautiously as they seemed rather smooth and undamaged compared to much of the other material. It would be good to see further investigations along these lines..","date":"2013-12-19","mins":"1:22 pm","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-60957","author":"hugh_farey","post":"Thank you, authors, for your comparisons, although I should be grateful for one clarification, if I may. I simply cannot agree that the absorbance spectrum obtained by the Gilberts correlates to the spectra obtained by Cameron and George (1969), or Afromowitz and Callis (1992), or any of the others one can find on the internet. The spectrum of methemoglobin is characterised by three distinct peaks, at 400nm, 500nm and 630nm. Only two of these are shown on the Cameron and George diagram (500nm and 630nm), and also, albeit oddly shifted, on the Afromowitz and Callis diagram (520nm and 650nm). The Gilberts’ Shroud spectrum not only does not have a peak at 630nm, nor a peak at 500nm, but most importantly of all no peak at all at 400nm. This is wholly characterisitic of all types of hemoglobin, and it’s missing. The Gilberts’ spectrum is definitely not typical of methemoglobin, nor of blood of any description, and its very partial resemblance to a blood spectrum over a small range of wavelengths is entirely coincidental..","date":"2013-12-17","mins":"12:32 pm","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-995","author":"hugh_farey","post":"So, if I chop one of my fingers off (suddenly, so I haven’t had time to panic or stress) and collect the blood, screaming in pain, and then chop off another (when the pain and stress has increased my bilirubin levels) and collect that… Sorry, school laboratory science does have its limitations…. And I wouldn’t know how to measure the bilirubin levels anyway!.","date":"2012-10-24","mins":"2:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?"},{"id":"comment-60990","author":"hugh_farey","post":"A Chemical Investigation of the Shroud of Turin, J.H. Heller and A.D. Adler, Canadian Society of Forensic Science Journal, Volume 4, No 3 (1981). I’m afraid it’s not available free online but can be ordered from http://www.tandfonline.com/doi/abs/10.1080/00085030.1981.10756882#.Ur CO Ia V2e Xs..","date":"2013-12-17","mins":"1:48 pm","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-29740","author":"hugh_farey","post":"Except I didn’t use blood, I used paint, but unless some funny chemistry is involved, the result should be the same..","date":"2013-04-07","mins":"7:50 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29941","author":"hugh_farey","post":"The serum haloes are another of the phenomena of the shroud that owe more to overexcited reporting than they do to actual observation. I have before me Miller and Pellicori’s paper with its comprehensive coverage of the shroud in UV. There are seven photographs covering the whole shroud. Starting with the big bloodstain of the foot (dorsal image) there is a clearly fluorescent serum fringe around the base of the instep which is not easily visible in ordinary light. No other part of the bloodstain has a visible serum fringe. None of the scourge marks on the dorsal image has a serum fringe, nor the rivulets of blood across the back, and if the marks of the crown of thorns have any, they are very faint indeed. None of the bloodstains on the front of the head (including the famous epsilon) show any fringe at all. The spear wound has a slight border on its top and top left ‘shoulder’ only. The wrist wound has a nice little halo around the upper ‘finger,’ but nowhere else, and the arm rivulets have no halo at all. It is not impossible that this might be explained by the stains of the foot wound, spear wound and wrist wound being derived from reopened injuries, while the rest were derived from the remoistening of dried blood..","date":"2013-04-08","mins":"6:48 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30094","author":"hugh_farey","post":"Has anybody read “Age estimation of blood stains by hemoglobin derivative determination using reflectance spectroscopy” by Bremmer et al., in Forensic Science International, Volume 206, Issues 1–3, 20 March 2011, Pages 166–171? I thought not, otherwise it would surely have been mentioned bv someone. An abstract and its diagrams can be found by Googling, and there is a slideshow resume at http://www.slideshare.net/rolfok/ageing bloodstains. In it we can find four simple reflectance spectra of blood at four different ages (1 hour, 1 day, 7 days, 63 days), which can be compared to the Gilberts’ reflectance spectra from the shroud, which can be found at http://www.shroud.com/pdfs/rogers5faqs.pdf, with the proviso that the Gilbert’s blood spectrum is an average of, I think, four different stains and may not exactly represent any particular one. The “Redness” of a stain appears to be related to a steep rise in reflectance between 500nm and 600nm, the closer to 600nm the better. The Gilberts’ bloodstain spectrum shows the steep rise, but it begins at about 520nm, and would probably be better described by ‘orange’ rather than ‘red.’ Maybe I should give Billy Reuben another chance, although it could be argued that the Gilberts’ spectrum is sufficiently different from any of Bremmers as to suggest that the shroud stains are not in fact blood at all. “Brown ness” seems to be indicated by a steady and gradual rise in reflectance from about 500nm to about 800nm. This pattern is followed by Bremmer’s 63 day old blood, and also by the Gilberts’ “image” spectrum. All in all the contrast between these two sets of spectra seems to me to warrant all the discussion that has so far appeared on this blog, and probably a great deal more!.","date":"2013-04-09","mins":"7:25 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30166","author":"hugh_farey","post":"The areas scanned were 6mm x 3mm, so I think were representative of each blood area decided upon. To confirm this, each individual spectrum has roughly the same shape, it is merely higher or lower up the y axis, indicating that the blood is all the same colour, just lighter or darker according to various factors, such as intensity of application or subsequent erosion. Surprisingly, the foot area tested was the brightest, followed by the forehead and wrist more or less the same, and the lance being the darkest. As I would have said the foot area represents quite a deep stain, this suggests that any particular gross stain area could have quite a variation of intensity. Interestingly, the average spectrum is listed as being taken from: wrist F3 E, side F6 B, forehead F8 C, and back B3 C, while the individual spectra are listed as: wrist F3 E, lance F6 B, forehead F8 C and foot B1 A. Why one diagram includes the foot and the other includes the back is not explained. Since there is overall consistency in the shape of all the individual spectra, we are entitled to ask for an explanation for a distinct spike at about 610nm on all four bloodstains, which does not correspond with any kind of blood. It could be from the addition of a red pigment to touch them up, I guess, although materials such as iron oxide or vermilion don’t have such pronounced peaks in their spectra..","date":"2013-04-10","mins":"5:22 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30193","author":"hugh_farey","post":"Sorry, Colin, I should have continued to make it clear. My first post used the word ‘reflectance’ four times, my second one not at all, but it did refer to the same spectra..","date":"2013-04-10","mins":"7:50 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30323","author":"hugh_farey","post":"Kelly, I do have Pellicori’s paper, and I’m afraid it reads a little like the special pleading of the kind Colin so abhors. All blood spectra, whether derived at random from the internet, specifically related to forensic investigation like Bremmer’s paper, or even those in Pellicori’s paper, show a small reflectance bump (absorption trough) at about 500nm, twin reflectance troughs (absorption bumps) at about 525nm and 575nm, and a steep reflectance increase (absorption decrease) from about 600nm to 700nm. The type of blood, its brightness, substrate or its age produce variations on the theme, but the general description above appears to apply to it all. The shroud stains, by Pellcori’s own admission, exhibit none of these characteristics except the steep 600nm 700nm slope. And they do have that most uncharacteristic reflectance peak (absorption dip) at 600nm. Neverthless, Pellicori concludes that “there is, however, sufficient correlation in the spectrophotometry to decide that the material on the shroud is blood.” He reinforces his conclusion by saying that “the resemblance to blood as seen in the photomicrography in these areas is strong.” He finally decides that the shroud spectrum “suggests denatured met hemoglobin” to which all I can say is; not to me, it doesn’t..","date":"2013-04-11","mins":"6:13 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29464","author":"hugh_farey","post":"With the greatest respect for all you blood specialists, but don’t we need archaeological pathologists here? We’re not observing blood which is a few weeks or even a few years old, but (unless it has been touched up) some 700 or even 2000 years old. Has anybody reading this blog had access to bloodstains on battlefield relics (for example) of genuine antiquity? I’ve been trying to find out who first claimed that the stains were “too red” to be real blood – possibly Walter Mc Crone – without success, but several observers of the shroud itself, rather than photographs, describe them as looking “fresh” which would be unlikely for ancient blood, I think. I have never seen the shroud itself, but do think that almost every photo I have ever seen, including the excellent shroudscope, misrepresents both the colours and contrast of the actual material, so that perceptions of colour, however professional, from photos alone are likely to be unreliable. Those who have observed it sometimes remark how the bloodstains appear to change colour according to whether it is inside or outside, or lit by various different light sources..","date":"2013-04-05","mins":"5:39 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29473","author":"hugh_farey","post":"I’ve been Googling… Enter “Charles I” and “Vest”, and you will be presented with an array of photos of a garment held at the Museum of London, reputedly worn by King Charles I at his execution (1649), and reputedly stained with his blood. What is interesting is how differently the ‘bloodstains’ show up on the photos. I had to examine some of them really closely just to check that they were of the same garment. It is even differently described as blue or green by different observers. Also interesting is the comment that attempts to prove the stains in the 1980s are described as ‘inconclusive.’.","date":"2013-04-05","mins":"7:09 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29537","author":"hugh_farey","post":"Jesterhof, that red splodge of stuff was observed on one of the sticky tape samples taken off the shroud in 1978. I imagine Colin referenced it to give you an idea of quite how red the red stuff is. Of course, its a photo, with all the limitations referred to, and it might be iron oxide, or vermilion, or cochineal, or whatever, but it is clearly something. Do you still think it’s “normal” blood?.","date":"2013-04-05","mins":"4:55 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29602","author":"hugh_farey","post":"I sense a tone of frustration in jesterhof, who apparently has considerable experience of a variety of blood spillage on a daily basis, but hasn’t seen the Shroud, as opposed to a number of people (albeit including biologists, doctors and a ‘porphyrin specialist’) who have seen the Shroud, but are not as familiar with bloodstains. However, I must return to my comment 45, regarding degradation over time and ask jesterhof: How old was the oldest actual bloodstain (rather than a photograph) you have ever seen? It seems that in your experience blood can appear quite red for some time, but can you quantify that? How familiar are you with 100 year old blood (from, say Museums of the First World War?), 200 year old blood (Napoleonic?), 500 year old blood (European wars?). My point is that an expertise of various traumas is only the beginning of an understanding of how medieval blood can be described, with or without any medical knowledge, as “fresh.”.","date":"2013-04-06","mins":"5:02 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29632","author":"hugh_farey","post":"Adult people are wondering how centuries old blood stains can be described as looking “fresh” or “carmine”. You have not addressed that point. You seem to say that if the composition of two bloodstains looks different to start with, it will continue to look different after hundreds of years, but you do not explain why either of them should look “fresh.” Do you have any ideas about that? It may be that you think the photos you have seen do not look particularly fresh (in which case you would be in disagreement with many who have observed the shroud itself) or it may be that you have experience of old blood which does look fresh (in which case we would very much like to share your experience)..","date":"2013-04-06","mins":"9:30 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29636","author":"hugh_farey","post":"I’m sorry; I think our comments crossed in the ether. Quite apart from bright television lights, those who saw the shroud under sunlight also commented that the bloodstains looked unusual, and some of them were familiar with the stuff. So it is the original colour, not just TV lighting, that we are trying to explain..","date":"2013-04-06","mins":"9:36 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-213910","author":"hugh_farey","post":"I should be grateful for elucidation of one or two things, if I may. 1) Is there sufficient Nitrogen in flax for its conversion into Carbon 14 to make any difference to the Carbon 14 percentage? 2) What would happen to the integrity of a nitrogenous compound if it were suddenly converted into a carbonacious one?.","date":"2015-10-30","mins":"5:57 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213921","author":"hugh_farey","post":"Thank you very much, Bob. A man after my own heart. If only everybody was as thorough!.","date":"2015-10-30","mins":"9:13 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213993","author":"hugh_farey","post":"Alas; if only repeating a thing often enough would make it true. As it is, of course, Ray Rogers’ findings have been disputed at several levels, from the integrity of his samples to his water soluble gum, and from his mass spectra to his overall starch coating. Words like ‘proved’ lose their meaning in such circumstances, even if Rogers eventually turns out to be correct. Detailed examination of the threads of the Shroud, including the remaining Tucson sample show no evidence of interpolation, and a number of convinced authenticists are equally convinced that there was no repair. I don’t think there really is a ‘bottom line’, but if there were, the words “most likely” would not be part of it..","date":"2015-10-31","mins":"10:13 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-200373","author":"hugh_farey","post":"I don’t that’s fair on S Tu RP, do you? The fragments of the Shroud did not belong to them, and were not lost; they were returned to their owner. Nothing wrong with that. Thibault, above has referred to some findings by Baime Bollone. These findings were made by using fragments that were removed from the Shroud by vacuuming, were kept illicitly, and tested without permission. As far as I know the subsequent owners of the Shroud do not acknowledge them..","date":"2015-05-27","mins":"5:12 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200415","author":"hugh_farey","post":"Gosh. I didn’t know that. While S Tu RP had nothing but a few fibres sucked off the surface, Baima Bollone was able to cut away whole threads? And nobody in S Tu RP even mentioned this? Curious..","date":"2015-05-28","mins":"6:20 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200334","author":"hugh_farey","post":"Various people have commented the the blood has an unexpected redness, not just Heller and Adler, but, more relevantly those who have seen the Shroud under different lighting conditions. Some have said that the blood looks “fresh” as if the redness were witness to a miracle, or to a pathological state (not as yet demonstrated), and others say that the redness is merely witness to the blood not being blood at all, but paint. Some say that the blood could have been real blood, but given its freshness with a bit of paint on top. Some observers suggest that the blood looks pinker in daylight than it does inside, which may be due to the different spectra of the illumination, or due to fluorescence derived from the sunlight, not achievable using artificial light. Miller and Pellicori’s fluorecence tests do not confirm this suggestion. My own observations on Shroud 2.0 are that the blood does look too pink to be nothing but blood, regardless of any speculations about bilirubin, methemoglobin etc. But then, it also looks too pink to be iron oxide. It does look like red madder. The identification of blood rests largely on Heller and Adler’s positive tests for porphyrins, both chemically and spectroscopically, and also bilidenes, via a conventional test kit. It has been pointed out that porphyrins are present in other materials such as chlorophyll and urine, but the field is definitely narrowed to a fairly small range of possibilities, including actual blood..","date":"2015-05-27","mins":"7:00 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200413","author":"hugh_farey","post":"Thought for tomorrow. So are authenticists..","date":"2015-05-28","mins":"6:09 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200416","author":"hugh_farey","post":"Claiming it was caused by an unknown natural process is not a whole lot more convincing than an unknown artificial one, but I agree that a miracle is an option for the authenticists but not for the non authenticist. “Non authenticists” not “Anti authenticists.” There are many of the former, but, I hope, very few of the latter..","date":"2015-05-28","mins":"6:24 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200458","author":"hugh_farey","post":"I think Aldo Guerreschi was a major influence on my interest in the Shroud, in that he took perfectly clear and obvious marks that everybody had unthinkingly associated with the 1532 scorch marks and demonstrated incontrovertibly that they were no such thing. Since then, as you know, I have attempted to track every finding about the Shroud which “everybody knows” back to its primary source, often to discover that it wasn’t anything like as clear to the scientist who discovered it as it is to his readers and adherents. I do have a copy of Heller’s book and think it gives a wonderful feeling for the atmosphere and activities of the S Tu RP team, although a little embroidered for the sake of keeping the story alive. However he does not mention Baima Bollone at all. Belief in the resurrection is irrelevant to the Shroud. Resurrection theology has moved on a long way from attempts to explain the physics of the empty tomb – which Pope Benedict referred to almost contemptuously as “the mere resuscitation of a corpse” – to what it was that enabled the early church to gain such a foothold in European culture. That’s not to say that there could not have been a miracle, just that it is not necessary for belief in the resurrection or the foundation of the church..","date":"2015-05-28","mins":"5:09 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200490","author":"hugh_farey","post":"Hi Louis. Your last paragraph, referring to Meier and Benedict XVI, puts the theological position accurately. Apart from the theologically valid but unscientific statements about the fullness of God and pointing beyond history, your key sentence is “That is a reasonable explanation without the need to go into details.” You will find Benedict’s position very well set out in Chapter Nine of his ‘Jesus of Nazareth: Holy Week’ and a somewhat sour condemnation of his theology by Donald Sanborne at http://www.traditionalmass.org/images/articles/Raz Res Art.pdf..","date":"2015-05-29","mins":"1:52 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200506","author":"hugh_farey","post":"“Does the reactionary philosophy that Donald Sanborne espoused in that article reflect your view of Catholicism?” No, it doesn’t. I’m with Benedict XVI., not Pius X..","date":"2015-05-29","mins":"6:56 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200544","author":"hugh_farey","post":"Hi Thibault. Interestingly, the exact passage you quote, in my copy of Heller’s book reads: “Then the Italian contingent went to work. Whole threads were removed from the image and blood stained areas, leaving visible marks behind. Jackson winced, for everything we had planned was non destructive.” Presumably Heller wrote in English, so I wonder how Bollone got mentioned in the French translation. Where am I going? I’m not sure. Throughout S Tu RP literature, the minutest details of investigations into microscopic fragments are covered in intense detail, while the finding of “the Italians”, who appear to have had orders of magnitude more to work on, with much more definitive results, are almost entirely ignored, their authors being grudgingly admitted to a list of references rather than highlighted in the text. Why is this? Heller makes little secret of his contempt for Italian scientists “who had no idea what X ray fluorescence was.” Did S Tu RP put no faith in Baima Bollone’s findings? Were they justified in doing so? I don’t know..","date":"2015-05-29","mins":"4:45 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200619","author":"hugh_farey","post":"I have always thought that on the whole Heller and Adler’s experiments were sufficient to persuade me that the blood was actually blood, in spite of one or two distinct anomalies. I didn’t appreciate Baima Bollone’s work, principally on the basis of the lack of S Tu RP’s enthusiasm, and am still concerned that such little respect was made to his findings by the Americans, considering he had so much more to work on..","date":"2015-05-30","mins":"4:53 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200551","author":"hugh_farey","post":"Here’s an odd thing. ‘Google translate’ translates “Baima Bollone” as “Alien Autopsy” which appears to be nonsense. However, Dr Baima Bollone is frequently mentioned in connection with the celebrated, and indisputably fictional Rockwell autopsy film, of which “Baima Bollone has declared very clearly that the technique, the times and the tools, as seen in the Alien Autopsy, are not correct. No samples are being taken and the correct instruments are missing from the room: it’s safe to conclude there are no pathologists performing the autopsy.” (http://www.ufodigest.com/news/0407/alienautopsy2.html) Or at least, he did when he knew it was a fake. Until then “Prof. Dr. Pierluigi Baima Bollone, University of Turin; Prof. Jean Pierre, University of Paris, as well as a dozen pathologists shown the film by my colleague Luc Bürgin, a whole auditorium of Mexican physicians and professors of the University of Cluj/Romania, to which I showed the film, all believed the film showed a real corpse, not a dummy.” (http://www.outtahear.com/beyond updates/Alien%20 Autopsy%20 Proved%20 Fake/STATEMENT%20 BY%20 MICHAEL%20 HESEMANN.htm) All very peculiar….","date":"2015-05-29","mins":"5:31 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-88274","author":"hugh_farey","post":"Just one tiny smidgeon of actual evidence to support any of the last 15 or so posts would go such a long way to bolstering their credibility….","date":"2014-03-13","mins":"11:07 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88291","author":"hugh_farey","post":"I’m not asking for you do my homework, Max, just some evidence that you have done yours..","date":"2014-03-13","mins":"12:00 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88348","author":"hugh_farey","post":"I should be very interested to read your paper. Perhaps it would persuade me there really are flower images. I’m sure if you email it to Dan he would pass it on. However I was thinking more about your archaeological evidence about First Century Jewish Funerary Rites. Have you a source for them?.","date":"2014-03-13","mins":"2:43 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88803","author":"hugh_farey","post":"You’ve lost me here, Angel. “A second image was found on the back of the cloth.” If this second image is really there, it is in exactly the same place as the other ventral image, as if that image had seeped through the cloth and stained the other side as well. This means that that half of the sheet covering the body’s face and arms received an image on both sides of the sheet, the lower side of this half being in contact with the body, and the upper side not. No turning of any kind would be required to achieve this. “if Jesus did turn His body 180 degrees … then that would explain the missing side strip of the Shroud, since it would have torn at the seam.” Really? We have drifted way outside physics here, into the realms of miracle. And there’s no saying what a miracle would or would not have done. If Jesus was floating in space as according to Piczek, he wasn’t even touching the cloth, let alone ripping it neatly down the side. Sadly, terms like ‘Event Horizon,’ rather like ‘Quantum’ and ‘Hologram,’ although sounding plausible to non scientists, have very specific meanings to physicists, and are wholly inapplicable to the Shroud..","date":"2014-03-14","mins":"2:19 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88432","author":"hugh_farey","post":"Thanks very much for the Hachlili reference. Very interesting and informative..","date":"2014-03-13","mins":"7:12 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88900","author":"hugh_farey","post":"Sorry, Dave; I used the word “seeped” qualified by “as if” merely to describe where the alleged image is rather than to explain it, or even agree to its existence. If it exists at all, it is reputedly as superficial as the one on the other side, though how this is known I can’t say. In that case it certainly could not have been formed by seepage, unlike the bloodstains which clearly have seeped through. But Yannick, do not be too frustrated by Prof. Fanti – even St Raymond went along with the idea that there was double superficiality, as it fitted in rather neatly with his evaporation gradient hypothesis. See Rogers’s FA Qs on shroud.com..","date":"2014-03-14","mins":"6:05 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89540","author":"hugh_farey","post":"“Changers were there to change pagan silver coins into ANICONIC brass/copper coins to be thrown into the Jerusalem Temple treasure chamber.” This is interesting, and makes a lot of sense. However, it is directly contradicted by a number of books whose authors claim that the reverse was the case. Jewish coins were only permitted to be of bronze or copper (and were all aniconic), and only silver coins were allowed in the temple. Tyrian coins fitted the bill, as they were not minted by Romans directly, and had a high and stable silver content. The money changers therefore changed Jewish bronze coins into Tyrian silver ones, not the other way round. Curiously, perhaps, Tyrian coins were not aniconic at all, but apparently gave no offence. Similarly, there seems considerable dispute about the archaeological evidence for coins in Jewish burials. Jason’s Tomb (excavated by Prof. Rahmani in 1967), as mentioned by Max above, was indeed littered with coins, and Prof. Rahmani’s categorical statement from 1980: “No coins of the period 50 BC to 70 AD were found in any tomb,” is a curious contradiction. Since then a number of coins have been found in tombs, although their occurrence is rare and they are not obviously associated with any ritual placment over the eyes, in the mouth or anywhere else..","date":"2014-03-16","mins":"7:06 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89569","author":"hugh_farey","post":"Ah, yes. Further clarification. There were, according to http://www.bible history.com/court of women/the temple treasury.htm,l no less than 13 ‘contribution chests’ collectively known as the Treasury. 4 of these were for any voluntary donations, regardless of quality (such as the ‘widow’s mite’), and 2 were for the compulsory half shekel tax paid by everybody every year. This tax was only acceptable in Tyrian silver, which was the purpose of the money changers. The other 7 chests were for various other services, but I don’t know if this had to be changed into silver as well. In the unlikely event that pilgrims already had Tyrian silver coins, they didn’t have to be changed at all. But Max seems to be correct that the use of coins in first century burial rites cannot be ruled out, which renders at least a possibility that they were used for Jesus..","date":"2014-03-16","mins":"8:35 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85466","author":"hugh_farey","post":"… I see no flowers ….","date":"2014-03-06","mins":"8:23 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89751","author":"hugh_farey","post":"“The Jews did not allowed any coins with Pagan images in the Temple. That’s why they had the money changer system. Every historian know this.” As you can see from the discussion above, not only were pagan images allowed in the temple, they were positively insisted upon. Google ‘jewish temple tyrian silver’ to find what “every historian” really knows..","date":"2014-03-16","mins":"8:27 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89908","author":"hugh_farey","post":"No; we must distinguish between the Jewish Temple Tax, for which Roman coin was unacceptable (and had to be changed into Tyrian), and the “Imperial Roman Tax” for which it was acceptable. Tyrian coins had an image of a God on them, which was apparently ignored for administrative purposes, but an image of the Roman emperor, it seems, was a step too far..","date":"2014-03-17","mins":"4:19 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89976","author":"hugh_farey","post":"I suppose the point is that a few dozen coins in a few dozen tombs is an extremly small proportion of the hundreds (thousands?) of burials examined. Although I agree that they are the exception that proves the rule, one cannot, on this evidence alone, claim that finding coins in a Jewish tomb is not very unusual..","date":"2014-03-17","mins":"7:39 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90160","author":"hugh_farey","post":"Actually, Max source, Rahel Haklili’s 2005 book on Jewish Funerary Customs, Practices and Rites in the Second Temple Period says: “Although during the past century hundreds of tombs dating from the Second Temple down to the Late Roman period have been excavated or surveyed, coins are a rare occurrence. Only a scattering of coins have been found in various Jerusalem and Jericho tombs, most of them not in situ.” After listing and discussing most of these, Haklili concludes: “Thus, placing coins in tombs does not seem to have been part of the customary burial ritual, although it is occasionally evinced. It was no doubt an even rarer occurrence among Jews.”.","date":"2014-03-17","mins":"6:47 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90305","author":"hugh_farey","post":"Alas, I can’t say. It may simply boil down to a personal definition of rarity. One in a hundred? One in ten? It may be that every few years, as another dozen graves are found, with or without coins, the ratio shifts anyway. Especially as from time to time a large amount of coins are found in a single grave – as in Jason’s Tomb, mentioned above. And it may be that Haklili was comparing Jewish tombs to Greek or Roman ones, where perhaps coins are overwhelmingly present, in his assessment of rarity. Max’x reference lists 27 tombs with coins. Maybe about fifty out of about a thousand (5%) seems about right!.","date":"2014-03-18","mins":"4:43 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90533","author":"hugh_farey","post":"My profoundest apologies to the Professor, and for misspelling her surname too..","date":"2014-03-18","mins":"7:56 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85793","author":"hugh_farey","post":"And what about areas of direct contact? The concept of radiation doesn’t really apply there, unless the radiation starts from deeper inside the body, as has been suggested, not wholly convincingly, by various commenters. The problem there is that the direction of travel becomes even more confusing, as the radiation through the body would have to travel in all directions to the body’s surface, and then suddenly switch to vertical as it passed through the skin..","date":"2014-03-07","mins":"4:15 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85894","author":"hugh_farey","post":"Your latest comment must have slid in while I was composing mine above. Again, I’m not sure I agree with you. You are supposing, I think, that if the head was titled forwards, that the top half of the shroud would be draped over the face, so the image would be the same size as the face, while the back half of the cloth would be horizontal on the bed of the tomb, so that the head, being diagonally tilted with respect to it, would produce a shorter image. So far, so good, but only if the shroud was indeed flat on the bed of the tomb, which simple measurement shows is not possible. The shroud must have enveloped the head of the man from brow to occiput without any gap, as I explained above. This means that even if his head was tilted forwards, the shroud must have followed its contours closely all the way around..","date":"2014-03-07","mins":"10:38 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85889","author":"hugh_farey","post":"No, Yannick, daveb is correct. Whichever way a head is tilted, if the distance from brow to occiput across the top of the head on the image is the same as the same distance in real life (or death, in this case), then the image must have been in contact with the head all the way round. This is not a question of physics but of mathematics. Without knowing the purported body’s actual measurements one can certainly postulate a pad, cap or cloth over the image free section, but any more substantial separation would have lengthened the image’s measurement beyond what we actually observe..","date":"2014-03-07","mins":"10:30 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85995","author":"hugh_farey","post":"Yup. That’s what I think; I’m not the victim of negative pareidola, and there really aren’t any flowers on the shroud at all. I could be wrong, of course, but so far, I’m just not convinced..","date":"2014-03-07","mins":"5:39 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-86166","author":"hugh_farey","post":"Truly sorry, Max, but after intensive scrutiny of all the postulated flower images, I do not believe they are really there. Also I have no evidence that flowers formed any part of a first century Jewish burial; have you?.","date":"2014-03-08","mins":"6:55 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-86119","author":"hugh_farey","post":"I think actually we all agree with ourselves. There is no doubt among any of us that there is no continuous image from the front to the back of the head. Its non appearance could be caused either by a lack of image mechanism in that area, or by some form of intervention, material or empty space so that it didn’t work. If the blockage was thin it would be consistent with the measured distance. The orientation of the head is irrelevant though..","date":"2014-03-08","mins":"4:04 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-86698","author":"hugh_farey","post":"Thanks for the ideas, Angel, but forgive me if I can’t give them much milage! Assuming for a moment that the body lay on the shroud radiating vertically upwards, are you then suggesting that after lying on its back for a while, both the body and the shroud, together, without changing their configuration at all, mysteriously rotated, so that the body lay face down while his back radiated the dorsal image. I think this defies science and is wholly untenable. Unless, of course, you are assuming all this cavorting is part of a miracle, in which case, why bother? You don’t need any kind of radiation to make a miracle. The bioluminescence idea is marginally more attractive, but still hopelessly insufficient to make any kind of mark on anything, even photosensitive material. Even a highly sensitive CCD camera took 20 minutes to achieve an image. The energy, and image making potential, of the heat emitted by a body, is thousands of times greater..","date":"2014-03-09","mins":"6:58 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87302","author":"hugh_farey","post":"Hi Matthias! Do I count as an elder statesman? I’m flattered! Anyway, I do have problems with all these measurements, as in spite of being told that the shroud has a resolution of half a centimetre or so, it is really very difficult to decide where exactly we are measuring from and to. Your own “the middle of the back of the head or probably a bit higher” is as good as one can get, in most cases, and it’s not at all obvious where that is. Even on ones own head, the middle of the back of it is pretty difficult to define, so I’m going for a little bump called the inion, which is different for everybody, but on my head is a well defined little bump on the back of my skull. My other point of reference will be the space between my eyebrows. This distance is about 35cm, although different heads will no doubt vary by a centimetre or two. The question is, where is the inion on the shroud? If I use shroudscope to measure 35cm from the space between the eyebrows I reach aproximately the upper edges of the ring of blood trickles, where, one might suppose, the thorns of the crown jammed against the skull. If I measure to the lower edges of the trickles – another 4cm or so, then I am assuming that the ring of piercings was much higher up the crown of the head, and, perhaps oddly, that no blood flowed down the hair below the inion, which seems odd. That’s why I think the inion was in the former place, and the eyebrow inion distance does not admit of a substantial extra flap of cloth between the two heads, although, as I have consistently maintained, it does admit of a bit of separation due to cloths, caps or something similar..","date":"2014-03-11","mins":"6:16 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87673","author":"hugh_farey","post":"I’m still confused, Angel. Remember the ‘burning’ is on the cloth, not the body. Start, as you suggest, with the body on its back enveloped in the shroud. Which image is formed, the one below or the one above? Let’s say the one above, by radiation upwards from the body. The layer below the body is unmarked. Now the body turns over without disturbing the cloth. Which image is formed now? If radiation upwards is still the mechanism, then an image of the back of the body is superimposed on the one of the front which is already there. If the radiation is now downwards, then a second image of the front of the body is formed on the cloth below the body, and we would end with two frontal images, not one frontal and one dorsal. The body lay in the shroud for a maximum time of about 36 hours; “three days” only includes a few hours of Friday afternoon and a few hours of Sunday morning. As for the “surely Jesus could defy science” idea, this is, of course, true. In which case no scientific exploration of the image forming mechanism is meaningful..","date":"2014-03-12","mins":"4:35 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-200237","author":"hugh_farey","post":"Experiments are good. Bombast is not. “Part of the Shroud Image is in fact a hologram.” Nope. “We will prove that beyond any reasonable doubt.” Nope. “Silence the voice of the skeptic once and for all.” Nope. But the results of the experiments will be fun..","date":"2015-05-26","mins":"7:04 am","url":"https://shroudstory.com/2015/05/26/fascinating-video-from-dave-hines/","cat":"blood_studies","title":"Fascinating Video from Dave Hines"},{"id":"comment-97611","author":"hugh_farey","post":"Mike, if you have an online image you’d like referenced, then all you have to do is to provide its URL for us to look it up ourselves (it avoids copyright issues as well). If you want to create your own image and upload it, try imgur.com, which is extremely easy, uploads anything you like and provides a URL which can be posted in a comment such as this. If you actually want an image to appear (like Dan’s above) then I guess it helps if it’s your own blog!.","date":"2014-04-08","mins":"8:04 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98086","author":"hugh_farey","post":"Interesting. The blood supply to the hand does indeed avoid the centre of the wrist. What’s more, even in living people (me, as I’ve just tried it!) blood drains downwards from an elevated arm, even at 60 degrees, let alone vertically. I invite anybody to hold one hand out in a “crucifixion” position, for a minute or so, and then compare its colour with the other by holding them, palms down, side by side. In a dead body I submit that there would be very little blood left to do any bleeding at all in any direction. The hypothesis that these blood flows were dribbled on later is gaining strength….","date":"2014-04-10","mins":"8:58 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-97637","author":"hugh_farey","post":"“When one knows the pain is temporary…” Who was this Jesus character again? Did he think his crucifixion was a miserable end to his worthless existence? Or not….","date":"2014-04-08","mins":"11:22 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98102","author":"hugh_farey","post":"No, I can’t, unfortunately. If the ‘blood’ actually is, or contains, blood, and if, for a moment, I suppose that the shroud is genuine, then I’m inclined towards a ‘cleaning sponge’ hypothesis, whereby the body was wiped with a wet cloth, which, during subsequent handling, dribbled on the body. Convincing? Not really. The ‘forger’ alternative is that the blood was pipetted onto the cloth over the image, but then the ‘Lavoie elbow drip’ becomes difficult to explain..","date":"2014-04-10","mins":"10:26 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98177","author":"hugh_farey","post":"“… most likely hit a main artery …” Very well. Which one?.","date":"2014-04-10","mins":"6:10 pm","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98347","author":"hugh_farey","post":"A beautifully clear image showing that the main arteries to the hand run on either side of the middle of the wrist, and would not be touched, let alone severed, by a nail through the carpals..","date":"2014-04-11","mins":"8:37 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-97364","author":"hugh_farey","post":"Well, yes and no. As an EMS worker, Paulette’s experience could be very informative. This is one of those rather few occasions when the term ‘expert,’ in terms of having experience that others have not have, may be meaningful and valuable, and I would love to know more about Paulette’s experiences. I quite understand that blood flows, gushes, squirts and sprays – but would that be from a living body with a pumping heart? Although blood in bulk can remain liquid for a while after death, it would not be expected to do a lot more than trickle (albeit copiously!) from, say, a spear wound in the side of the chest. In the case of puncture wounds in living people in general (and obviously I’m thinking specifically of a hand or wrist being fixed to a beam with a nail), how good is the implement at preventing blood loss while it is still in the wound? Those people who volunteer to be crucified every Easter in the Philippines or Mexico do not appear to bleed at all while they are being nailed, or while they are on the cross. I have not seen what happens when the nail is removed – being alive, I can imagine there is some blood loss then. But if the victim were dead, nearly all the blood in the arm would drain by gravitation, no? Also, volunteer crucifixees appear to keep quite still – perhaps the pain of being punctured is minimised like that. They certainly do not flail about or jerk or spasm. They are standing on a platform, so a hanging weight is not a problem, but some are nailed to it, so I can imagine there is a lot of pain in the feet as well as the hands. Your experiences in this field would be most informative, I’m sure..","date":"2014-04-07","mins":"7:35 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98376","author":"hugh_farey","post":"This diagram shows even more clearly the proposed sites of nail holes and the position of the main blood supply to the hands. Http://i.imgur.com/Fy36t8 B.png. No nail through the wrist will damage a major artery. Ironically, one through the palm of the hand might!.","date":"2014-04-11","mins":"11:17 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98457","author":"hugh_farey","post":"Yes, Thibault. It is currently my contention that: 1) A nail through the wrist does not sever any major arteries. Whether we follow Barbet, Zugibe or any of the other hypotheses is irrelevant. (See my http://i.imgur.com/Fy36t8 B.png above) 2) The presence of the nail embedded in the wound prevents bleeding, even when the heart is pumping. (See the crucifixion video above) 3) At any elevation, blood tends to drain from the arm, even when the heart is beating. (Hold one hand out at an upwards angle for a minute or two and then compare it with the other, as specified above) 4) After death, blood continues to drain from the arm under gravity, until it is substantially depleted. 5) After death, the cessation of the pumping heart, and the removal of the nail, there is insufficient blood in the hand to drip down the arm. (There may be sufficient blood to come out if the arm is held hand downward, but that would not drip back up towards the elbow). If the four statements above are accurate, then the apparent blood flows depicted on the shroud arms are inconsistent with a crucifixion. I would be interested to hear what experiments you carried out..","date":"2014-04-11","mins":"6:50 pm","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98613","author":"hugh_farey","post":"I’m sorry if I’m giving the impression that I’ve made up my mind about any of this. My first comment, above, was peppered with question marks, and I seem to have got more dogmatic as I’ve gone on! It would be really useful to have an A&E (ER in the US, I think) specialist who could comment on blood pressure to an elevated wound and the efficiency of an embedded ‘plug.’ An interesting, but caution advised not for the squeamish, video can be found at https://www.youtube.com/watch?v=ru G XH Wz Rx Y..","date":"2014-04-12","mins":"4:34 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98665","author":"hugh_farey","post":"If blood came out of a wrist wound while the arm was on the ground it still wouldn’t flow along the arm. The point about the plug is that on any first aid course, one is told never to try to extract an obect (such as broken glass or a bit of metal) from the wound, as while it is in place it prevents bloodloss by literally plugging the hole. Cutting yourself on a knife or protusion, or scraping your knee or bashing your head in a car crash all produce masses of blood, but driving a stake through yourself and leaving it there, perhaps counterintuitively, does not..","date":"2014-04-12","mins":"8:38 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98675","author":"hugh_farey","post":"All reasonable questions and suggestions, I agree..","date":"2014-04-12","mins":"9:16 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-21234","author":"hugh_farey","post":"For a teacher, the problem with negatives is that hardly any of his pupils has seen one. Any computer will produce a light/dark reversed image, but the photographic negative, transparent as anoxie mentions above, is practically a thing of the past. Is that why this thread is getting so convoluted?.","date":"2012-12-28","mins":"5:48 am","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","title":"Getting the Left and the Right Right"},{"id":"comment-81154","author":"hugh_farey","post":"A good question Audrey, and much discussed. Possible answers from authenticists are… 1) The shroud was more or less horizontal when the image was made because the body was packed with bags of spices or some such all around. 2) The shroud was more or less horizontal because of some unknown physics related to the resurrection. 3) The shroud was not necessarily horizontal, but whatever caused the image moved vertically up and down from the body, so didn’t impact on the more vertical planes of the shroud. Each of these has both supporters and gainsayers. There may be other hypotheses as well..","date":"2014-02-21","mins":"9:39 am","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","title":"Getting the Left and the Right Right"},{"id":"comment-41863","author":"hugh_farey","post":"De mortuis nil nisi bonum. Surely everybody commenting on the image in this blog already has a well thumbed copy of this book, or their criticism of Mc Crone’s findings cannot be as well founded as they should be. It is the only good photographic study of the shroud fibres, and there is no doubt at all, for example, that the little red blobs he identifies as iron oxide look exactly like little red blobs of iron oxide. We look back on his work through a cloud of frustration, antagonism and bitterness which prevents us from seeing the enthusiastic – and pro authenticity – researcher of 1974, when Mc Crone was first involved. It is clear from his letters (at holyshroudguild.org) that he was desperately sorry to conclude that the shroud was a fake, and waited over a year before he revealed his findings. Sadly personality differences rather than scientific ones immediately kicked in, and no collaborative discussion between, say, Mc Crone and Adler, which might have resulted in compromise, ever took place. I don’t excuse him from responsibility for this – his dismissal of Adler’s results was arrogant and his successive resignations from Sturp were petulant – but it may have been possible to work around him with more diplomacy on Sturp’s part, which could have prevented the years of inconclusive disagreement which eventually ensued. Even with things as they are, we should be grateful to him and all his subsequent following (Joe Nickell, for example), as without their continuous irritation it is extremely doubtful that as much subsequent research into the shroud would ever have taken place. RIP..","date":"2013-08-24","mins":"4:00 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41952","author":"hugh_farey","post":"I’ve spent many frustrating hours trying to interpret the text on the pictures we’re so familiar with, with the aid of assorted paleographic websites. I can say that it’s in Latin, not Hungarian, and nothing like the text of the Hungarian funeral oration, which was considered the most important part of the codex before the pictures achieved their prominence. Last March we discussed this briefly. I said, “You [that’s Max Hamon] quote M. Van Cauwenberghe, in his identification of the music at the bottom of the Christ Enthroned scene with the Easter ‘Exultet’ which even I can see now, and it is clearly in Latin. The writing above is more difficult to decipher, but I think I can make out “et dixit Lazaro veni foras” which is close to the Vulgate version of Jesus’s calling of Lazarus out of his tomb. Above it are “salvatorem mundu” (Should be mundi) and above that a definite “baptista.” Clearly not a single quotation fro the bible, but definitely Latin. There appear to be several more “salvator”s and “veni foras”s elsewhere in the text. Can anybody get any closer? Above the anointing scene it is even more difficult to make out the words. Do they begin: “In principio creavit deus caelum et terram”?” Since then I think I can make out the months of October and November on the bottom line..","date":"2013-08-25","mins":"12:24 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41958","author":"hugh_farey","post":"Er… no… See my comment above….","date":"2013-08-25","mins":"2:19 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41968","author":"hugh_farey","post":"No. The Pray codex is a collection of all sorts of liturgical stuff, probably from different places and certainly written at different times and in different languages. It’s a pity that only the four crucifixion, deposition and resurrection pictures, together with two pages of text, are available on the internet. For most historians, the most important page of the entire codex is the funeral oration in Hungarian, which is the oldest example of written Hungarian known. The pictures (found most clearly at http://greatshroudofturinfaq.com) are clearly not related to it..","date":"2013-08-25","mins":"5:00 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42007","author":"hugh_farey","post":"Be careful of the Amazon books. I believe they are nothing more than reprints of Wikipedia articles. As far as I know there are no studies of the whole thing in English. There is a comprehensive description of the Pray Codex at http://www.jstor.org, which is free to look at if you register with jstor; an article entitled ‘Liturgical Manuscripts preserved in Hungarian Libraries,’ in Traditio, Vol.19 (1963)..","date":"2013-08-25","mins":"7:37 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42073","author":"hugh_farey","post":"I’m commenting here because adding to the sub sections above gets more and more confusing! Anyway, back to the Pray codex. I think the rectangular things are definitely parts of the tomb rather than the shroud, but I do find their markings odd, and have spent some time trying to make sense of them. Overall, the sketch owes a lot to the standard “three Marys” and other resurrection iconography of the medieval period, and has much in common with them. It looks to me, however, as if it is a rather amateur copy of another image that was only half remembered correctly. For a start, most medieval resurrections show Christ’s tomb as box like rather than cave like. This is probably thanks to the emperor Constantine I’s excavations, which carved away almost the entire hillside around the opening to the cave, leaving, indeed, a door into a more or less rectangular stone box. As pilgrims kept chipping bits off it, the whole thing was covered in marble, which may explain the swirly patterns found in some paintings, and possibly the zigzag decoration in the Pray drawing. Secondly, there were apertures in this marble edifice, through which pilgrims could peer through to the tomb itself inside. These are sometimes shown as simple squares or circles, and occasionally as quatrefoils, or cross shaped with rounded corners. These could have provided the inspiration for the little crosses all over the lower shape in the Pray drawing. Finally, just outside Constantine Monomarchus’s marble covered tomb, according to François de Chateaubriand’s travel journal, “there is a stone which is a foot and a half square, and is raised a foot, which is of the same rock, and which served to support the large stone that closed off the entrance; it was from this rock that the angel spoke to the two Marys.” Of course by de Chateaubriand’s time the whole church had been destroyed and rebuilt several times, but a flat stone is usually shown in paintings, usually at an extraordinarily steep angle, with the angel perched on it somewhat awkwardly like a surfboarder. A detailed account of the development of the Three Marys design can be found in Neil Conwell Brooks, The Sepulchre of Christ in Art and Liturgy, which can be found on archive.org. He called this design the “Western coffer tomb type.”.","date":"2013-08-26","mins":"12:16 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-23043","author":"hugh_farey","post":"Does anyone know of any old bloodstain, of any age, in any artifact, anywhere, that is coloured red, apart from those on the shroud? If so, has any microscopic investigation been done on it? If not, one cannot but wonder if the red colour, at least, is artificial..","date":"2013-01-30","mins":"10:22 am","url":"https://shroudstory.com/2013/01/30/guest-posting-by-kelly-kearse-distinguishing-human-blood-from-that-of-other-species/","cat":"blood_studies","title":"Guest Posting by Kelly Kearse:  Distinguishing human blood from that of other species"},{"id":"comment-23051","author":"hugh_farey","post":"Yes, I’ve noticed that. But what about old blood? Are there any examples of any?.","date":"2013-01-30","mins":"12:12 pm","url":"https://shroudstory.com/2013/01/30/guest-posting-by-kelly-kearse-distinguishing-human-blood-from-that-of-other-species/","cat":"blood_studies","title":"Guest Posting by Kelly Kearse:  Distinguishing human blood from that of other species"},{"id":"comment-39967","author":"hugh_farey","post":"Ron, perhaps they were a mixture. Some marks on the shroud look like scratches, some like round bruises. A very few seem to have created open wounds..","date":"2013-07-28","mins":"1:36 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40507","author":"hugh_farey","post":"Well, I think we’ve come to a bit of an impasse. Next time anybody reading this blog cuts, scratches, grazes or contuses themselves, you wouldn’t mind experimenting for us, would you? I will, if I get the chance, but I don’t injure myself as often as I used. The wisdom of age I guess….","date":"2013-08-05","mins":"11:58 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40430","author":"hugh_farey","post":"No, I think you’re interpreting this in a different way from me. When you say Zugibe talks about “liquid post mortem blood” I don’t agree. His words are, as you quote “oozing of bloody material.” When a scab is pulled off a wound, it doesn’t necessarily produce fresh red blood. It does, in my experience, produce an oozing of blood derived material, which is often not red. In this case, I think pressure on the wound is a good way of absorbing this fluid, which might not otherwise flow at all..","date":"2013-08-04","mins":"12:05 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40015","author":"hugh_farey","post":"Bit by bit… It is perfectly true that Zugibe seems to attribute the bloodflows down the arms, across the back and specifically from the spear wound, to post mortem, post washing, liquid flows, resulting in a transfer of whole blood, unsmeared, onto the cloth of the shroud. He finds it difficult to understand how, from a body literally matted with blood from head to foot, only a few pre mortem trickles have managed to transfer images of themselves, very neatly and without smudging or smearing in spite of the handling the body received both pre and post mortem. Yannick hopes that some very special circumstance arose in which this was exactly the case. It is, I think, precisely this problem which led Barbet and others to suppose that the body was indeed more or less dry until shortly before being enshrouded, when, by another special circumstance, the dried blood was sufficiently moistened to permit exudations to transfer an exact pattern onto the cloth. The supposed serum rings were, to Barbet, a verification of that, although serum exudes from whole blood as well. The only real finding in favour of the exudation hypothesis is the lack of potassium in the minerals of the ‘blood,’ which Adler attributes, not very convincingly, to the retention of erythrocytes in the body. Yannick dismisses the possibility that the post washing blood may have been allowed to semi clot again before the body was enshrouded, which I think is fair. It is clear that Zugibe thinks whole blood, not serum clot retraction exudate, is on the shroud. In that case, says, Barbet, the blood would have seeped outwards across the cloth (by capillary action), and not leave those very neat edged shapes that in fact we see. I don’t think this is necessarily true. The viscosity of blood seems very variable, as evidenced by the different shapes of the wrist wound (very slow) and the arm trickles (very runny). Yannick does not seem to notice that Zugibe differentiates between the blood flows and the scourge marks, although, to be fair, the point is not really clearly made. Zugibe says that having washed and re opened the scourge wounds (which are more like contusions than cuts) there would be “an oozing of bloody material” which I think is intended to be different from a liquid blood flow. The whole subject of exudates, while apparently solving some of the problems with the blood images, is mired in complications which neither Barbet nor Yannick clarify at all well. The fact that they clearly contain a good deal more red colour (hemolysed erythrocytes) than serum is a serious objection, the neat way in which even long dried trickles suddenly produce neat images of themselves, the attempt to keep the wounds moist by bacterial infection – none of these have any basis in reality. Googling “wound dressing removal” shows what real exudates look like! Finally, I see that I “desperately want to defend at all cost Zugibe’s hypothesis.” Not only is this nonsense, but it illustrates Yannick’s mindset much better than it illustrates mine. Scientists do not desperately defend things, not become so convinced of their own hypotheses that they do not admit of any problem with them that needs refinement. As it stands, the serum clot retraction hypothesis, while possibly useful as an explanation for the scourge wounds, makes little or no sense for the blood trickles, and is directly refuted by the marks over the purported holes in the wrist, chest and feet, which look nothing like clot retractions at all..","date":"2013-07-29","mins":"4:59 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40117","author":"hugh_farey","post":"OK, Here goes… 1 If Zugibe’s hypothesis is correct, how can you rationally explain the absence of any smudge on the Shroud, especially in the back region where there was obviously an intense body weight pressure that was active on the cloth? I don’t think pressure in itself will produce smudges, if the body is not moved. If the scourge marks are not deep cuts, but contusions or grazes (even if some of the skin has been scoured off), then the surfaces would exude not liquid blood, but, as Zugibe describes it “an oozing of bloody material,” which I take to mean the seepage that you find on a healing wound after pulling off a scab. It could be quite viscous, and it may be the clarity of the marks is because of, not in spite of, the pressure. Zugibe’s wound photos are not particularly relevant here, but his upper photo does not show blood flow, only transfer from the wound to paper towel. I don’t think the scourge wounds would have been as bloody myself. His lower photos are of actual holes, and they are the ones oozing blood. 2 If Zugibe’s hypothesis is correct, how can you rationally explain that there appeared to be no scourge stain that tend to follow the herringbone weave pattern of the cloth? This depends on the viscosity of the liquid, which depends primarily on its water content. Barbet was, I suppose, dripping fresh blood directly onto a cloth. The Lavoies’ experiments on the transfer of blood from plastic to cloth after half an hour showed remarkably that the blood clots did not spread out at all, unless it was specifically moistened beforehand. Having said that, since the plasma part of the blood is invisible to the naked eye, we do not know that it has not spread out along the fibres by capillary action. 3 If Zugibe’s hypothesis is correct, how can you rationally explain the presence of distinct halos of serum around much of the scourge marks? I wish you could see Miller and Pellicori’s photos. There are NO “distinct haloes of serum” around the scourge marks. There are some indistinct fluorescent bordering areas, which are entirely consistent with some serum seeping out into the fibres by capillary action. 4 If Zugibe’s hypothesis is correct, how can you rationally explain the presence of some precise scourge marks at less than 2 cm of an evident post mortem blood flow, while you know that it was against Jewish law to remove or disturb such a post mortem blood and while you also know that if there was a washing, it would have been done rapidly (you even mention in a previous post that the washing was most probably “not done very thoroughly”)? Just for you, I have laid a trail of ketchup on my kitchen table, and then smeared more ketchup onto the table close to it. I can confirm that I can remove the entire smear, without disturbing the original trail, with a few pieces of absorbent paper towel. If there happened to scourge marks under the smear, they would have been exposed by my wiping..","date":"2013-07-30","mins":"7:58 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39955","author":"hugh_farey","post":"Ho hum, good Ol’ Yannick… First, I want to categorically state this: Pellicori and Miller were certainly not “clear about the fact that almost every single scourge mark on the cloth was showing an halo of clear serum around them.” They present seven photos of the shroud, from Dorsal Foot to Ventral Foot, and comment on the features of each one. No reference is made of fluorescence around the scourge marks is made until the third photo (the back), when they say “Many scourges have fluorescing bordering areas.” That’s all. Next, “almost all the scourge marks are showing the same precise dumbbell like shape, the same presence of halos of serum around them, the same color, etc.” This is another generalisation clearly not borne out by observation. There are at least two different marks that might be described as dumbbell shaped, and a large proportion of the ‘striated’ kind. The presence and extent of the serum haloes is even more various. Next, Yannick finds an irreconcilable difference between “Barbet, Adler, Lavoie and others” who think that the scourge marks were caused by a transfer of exudates from still moist or remoistened blod clots, and Zugibe, who thinks that the clots were dry and were re activated by washing. I don’t understand the difference. However, Yannick’s main point is that it is impossible to wash a body with an accuracy finer than 2cm. “How in the world does the person who did this rapid washing (remember that it if the Shroud man is Jesus, this would have been an hasty burial) could have dared to wash the immediate region surrounding the post mortem blood flow (including the area located at less than 2 cm.” Well, I would. In fact, if I wanted to wipe away an overall smear of blood across the entire back (as we see in those photos of Philippine flagellants), but leave a specific mass of blood in place for religious reasons, I think I could do it with an accuracy of about half a centimetre. Would I use a sponge? Probably not. I’d use damp cloths. “Seriously, does that sound credible and rational to you in the context of a Jewish burial that would have been done in a way to prevent any disturbance of the post mortem blood that was still present on the corpse because it was considered impure by the Jewish Law? One thing’s for sure: Not for me! This idea of a very precise (almost surgical) washing in this zone is quite simply ludicrous to me.” Well, that’s fine for Yannick, but it seems both possible and perfectly normal to me. “I prefer by far my own hypothesis.” Well that’s fine too, but I don’t think it’s credible. Basically you seem to accept that the image was formed from emanation from the body, through a coating of dried blood, without the blood affecting the image formation. You go to the most elaborate details in trying to find a difference between dried blood on the body, the cloth, the hair and so on, without any evidence that the image shows any such difference. Next, the discovery of a few minute fragments of stone in some parts of the shroud is given as evidence that the body wasn’t washed, whereas it could be equally good evidence, given that so little has been found, that in fact it was washed, but not very thoroughly. Overall, the bloodstains are a complex part of the mystery of the shroud, and I think any explanation for them is likely to be fairly complex itself. Even Occam would have had some difficulty in knowing exactly how to wield his razor. For me though, given the choice, Zugibe beats Clement hands down..","date":"2013-07-28","mins":"10:09 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39958","author":"hugh_farey","post":"I don’t think that’s fair to Lavoie. The paper you quote specifically excludes any reference to the scourge marks, stating “Other blood marks, such as the scourge marks and the blood flow on the dorsal image, fit into a different category regarding their formation and moisture content. Therefore, they should be evaluated separately; they go beyond the scope of this paper.” He clearly agrees with you!.","date":"2013-07-28","mins":"10:26 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-52566","author":"hugh_farey","post":"Thanks Kelly. On the whole, if possible, I like to read the words of the person who actually made the observation, rather than a second hand, or third hand (Zugibe quoting Jumper quoting Adler) reference which may unwittingly be slightly altered. And I prefer to read their observations than their conclusions. Rogers, for example, says: “It is interesting to note that where serum had flowed through the cloth in an image area, there seemed to be no image coloured fibres below it.” This is subtly, but significantly, different from “Rogers … observed no image colour under them.” I too wonder what difference there is in colour between a “serum on image” stain and a “serum on non image stain.” Perhaps someone with the i Pad shroud.app could tell us? It is certainly not obvious from shroudscope..","date":"2013-11-23","mins":"6:43 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-47764","author":"hugh_farey","post":"Hi R.H. Cahall. I often wonder who “a reader writes” is, and whether they follow up the ballyhoo their innocent inquiry can stir up! The problem with most of the evidence about the shroud is that what is unquestioned is circumstantial, and what is direct is never unquestioned. The similarities of the image on the shroud to Gospel accounts, Roman descriptions of crucifixion, or medieval paintings place one in a chicken and egg situation, and cannot be considered more than suggestive. Similarly, the fact that “nobody knows how it was done” applies equally to a natural 1st century image and a manufactured 13th century one. The main scientific points (at least to me) are whether the blood arrived before or after the image, the provenance of the pollen, and the radiocarbon date. All of these would be extremely good evidence if any of them were universally accepted, but they’re not. Max Frei’s pollen analysis is statistically very questionable, and his slides have disappeared into purdah, and the blood first hypothesis has been thrown into question mostly by the apparent discovery that the image is not part of the original flax but on some kind of coating – itself a highly disputed hypothesis. The failure of the radiocarbon date depends either on deliberate fraud, which very few people adhere to, or to the fact that the date was affected by more recent contamination, by oils, wax, sweat, bacterial plaque or patching. Sadly for me, none of the evidence of contamination bears much examination, which has tipped me in favour of a medieval provenance for the shroud. I have been both challenged and praised about this recently (depending on the stance of my commenter), as if my medievalist stance were in stark opposition to an authenticists one, but as Dan, Barrie and those others who follow the discussions on this and other blogs will know, the balance between the evidence in favour and the evidence against is extremely delicate. A single photo showing anomalous threads could tip me in the other direction, and a single new medieval find could tip somebody else from authenticist to medieval..","date":"2013-10-17","mins":"9:42 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-52565","author":"hugh_farey","post":"The densest blood stains do indeed show red particles on the top surfaces of the threads, not just in the cracks. That’s why I was careful to add qualifying words like “mostly.” However, looking at, for example, Fig.8 2, I do not agree that any of the fibres themselves are reddish brown. I think that is due to a coating of particles, possibly blood derivatives. The fibres themselves, I think, are yellow. The whitish patches are due to the overexposure of the reflective sheen of true shroud material. However, you may have a point if the yellow threads are coloured thanks to “serum” rather than “image.” They just look the same in photographs. I think if the protease tests had been carried out on threads rather than fibrils, and if, indeed, yellow blood threads had turned white, while yellow image threads remained the same colour, I would find Adler’s findings more convincing. As it is, I do not think the matter is settled..","date":"2013-11-23","mins":"6:30 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-26630","author":"hugh_farey","post":"What I find quite remarkable about this and several other videos showing ‘real’ crucifixions (usually in the Philippines) is the almost total lack of blood flow from the nail wounds. Although I dare say these people bled quite badly when the nails were removed, I wonder how much would have come out if they had been dead for a couple of hours. There are also videos of flagellants. Although they do not use Roman flagra, their backs are a mass of blood, rather than delicately pocked like the shroud. Quite thought provoking..","date":"2013-03-06","mins":"3:37 pm","url":"https://shroudstory.com/2013/03/06/john-klotz-if-not-him-who/","cat":"blood_studies","title":"John Klotz:  If not HIM, who?"},{"id":"comment-920","author":"hugh_farey","post":"I still disagree with your ultimate conclusions, but your observations and explanations thereof are really fascinating. I’m catching up on this blog with ever increasing absorption..","date":"2012-10-10","mins":"9:30 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/03/lets-take-a-closer-look-at-one-of-the-peculiar-blood-stains-on-the-shroud-the-one-in-the-hair-shaped-like-a-question-mark/","cat":"blood_stain","title":"Let’s take a closer look at one of the peculiar blood stains on the Shroud – the one in the hair shaped like a question mark"},{"id":"comment-196528","author":"hugh_farey","post":"Nope..","date":"2015-04-16","mins":"10:42 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196522","author":"hugh_farey","post":"So, let me get this straight. You’d like me to get a nailed, tetanised arm and fresh blood from someone recently tortured, arrange the arm so that the front is turned three quarters upright, and drip blood down it just to demonstrate that the flow on the Shroud is unrealistic? Well, I’m sorry, Max but if you had any scientific education at all you’d know that that simply isn’t how science works. If I say an alien painted the Shroud and you disagree, you are not required to say why, or produce lots of pictures by aliens which look nothing like it; it is up to me to produce evidence for my claim. If you think blood can turn corkscrews around arms and I disagree, I am not constrained to say why, or to produce tortured bodies which look nothing like it, it is up to you to produce evidence for your claim. Which you have failed to do. Dali’s painting would have been good except that there are no blood flows on it at all….","date":"2015-04-16","mins":"9:48 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-52574","author":"hugh_farey","post":"Thanks for that, Kelly. I was thinking of buying an i Pad specifically for the app (I don’t have one at the moment), but I’m not sure I’ll bother – unless it’s really interesting down by the C14 corner?.","date":"2013-11-23","mins":"7:42 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-196210","author":"hugh_farey","post":"Wrong again, Max. The archaeology of the blood is irrelevant. The blood on the Shroud appears in most cases to have arrived by direct transfer from blood on a body. The patterns made by blood on a body under various circumstances are worth investigating. Human circulatory behaviour not having changed in the last 2000 years or so, valid experiments can be made using modern volunteers and modern blood or blood simulants. There are valid criticisms of Garlaschelli and Borrini’s study, but yours are not, so far, among them..","date":"2015-04-13","mins":"7:03 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196238","author":"hugh_farey","post":"You’re wandering, Max.”What specifically do [I] not object to?” That doesn’t make any sense at all. However, as it happens, I don’t “swallow it whole.” I agree with Antero, below, that their conclusion was a little hasty. My reasons, however, have nothing to do with archaeology or the preparation of the cloth, but because further experiments are necessary, following OK’s guidance about sweat, dirt, fever, ‘random shivers’ and the difference in viscosity that may be due to intense suffering. Garlaschelli and Borroni are well aware of the limitations of their experiment, and in their more formal statement (http://www.aafs.org/sites/default/files/2015/abstracts/E39.pdf) twice say that further studies should be performed to try to clarify the matter..","date":"2015-04-13","mins":"1:56 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196215","author":"hugh_farey","post":"Max, you are making up things to criticise. “B & G’s allegedly ‘forensically’ and ‘archaeologically accurate bloodflow reconstruction.’ The only person alleging archaeological accuracy is yourself. Why not address yourself to the experiments themselves? What, specifically, do you object to?.","date":"2015-04-13","mins":"7:53 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196191","author":"hugh_farey","post":"An other overlap, sorry. By Piero’s ‘last link’, I meant from his previous post, namely: http://www.aafs.org/sites/default/files/2015/abstracts/E39.pdf..","date":"2015-04-13","mins":"4:02 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196216","author":"hugh_farey","post":"It is true that the blood flows on the statue above, especially the one on the right arm, look remarkably similar to Garlaschelli and Borroni’s. They appear to have been dripped on rather than painted. However, they look nothing at all like the interwoven zig zag rivulets that we see on the Shroud. Gilbert Lavoie’s exploration (http://www.shroud.com/pdfs/ssi07part5.pdf) attempts to relate the actual blood flows on the Shroud to a body, but his conclusion: “Note that the blood clots demonstrate a flow pattern consistent with the vertical position of crucifixion,” is unjustified, as both Garlaschelli and Riggi demonstrate..","date":"2015-04-13","mins":"8:07 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196244","author":"hugh_farey","post":"“I can show show photos and comments if necessary.” Yes, indeed, Thibault. They would be very interesting..","date":"2015-04-13","mins":"3:14 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196338","author":"hugh_farey","post":"Both the Garlaschelli and the Ricci (my apologies for calling him Riggi) blood flows are more or less straight, not twisting, zig zagging or intertwining. If anybody has achieved anything a bit more like the Shroud, I have yet to see it. Gilbert Lavoie simply laid a copy of the Shroud along an arm and announced that the flow pattern, which he described as ‘blood clots’, was ‘consistent with the vertical position of crucifixion.’ There was no practical or experimental justification for this. Such practical and experimental work as has been carried out has not been consistent with the Shroud..","date":"2015-04-14","mins":"2:12 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196246","author":"hugh_farey","post":"“Why waste time with this unconvincing agenda driven experiment?” Because, apart from Thibault’s, it is the only one we have. Non authenticists are forever being told that unless they can reproduce the image exactly, the Shroud must be genuine. Is it impertinent to suggest that unless authenticists can reproduce the blood flows exactly, they must be considered fake? Garaschelli and Borroni (and Thibault?) have demonstrated that blood will not flow along an arm unless it is well over 45 degree from the horizontal, and the speed of flow means that there is very little time for it to wriggle about as it flows. If the arm needs to be moist with sweat, or grimy with dirt, or the blood needs to be a little thicker to slow it down, then let these experiments commence! Antero points out that as no major blood vessels are, pierced (and I might add that with the wound level or above the head blood pressure is minimal anyway) very little blood would come out at any time, although if the wound were continuously agitated, perhaps sporadic flow could be stimulated until death, when no more blood would be expected, even after removal of the nail..","date":"2015-04-13","mins":"3:31 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196294","author":"hugh_farey","post":"Yes.This two angled argument has been around for a very long time, explained by an alternating two position posture on the cross – standing on the nails in the feet or hanging from the nails in the arms – so that the blood flowed straight down the arms when standing (humerus horizontal, forearms vertical), then poured off sideways when hanging (arms straight at 30° or so). Riggi’s crucifix provided a slightly different, asymmetrical version in which the two arm positions alternated with each other. So reasonable did this seem that as far as I know nobody has actually tried it out. Or, which is not unlikely, it has been tried out and doesn’t work. This is because it relies on quite a ‘reservoir’ of blood along the top of the arm (your longer arrows) to break into smaller rivulets which drop straight off across the arm as it becomes horizontal (your shorter arrows). It’s a good, sensible, naturalistic BPA explanation for the shape of the blood flows as we see them, and it has satisfied a number of eminent pathologists, but I don’t think it works. Not enough blood to fill the ‘reservoir’, blood pressure too low, nail preventing bleeding, blood either too viscous or too fluid, clotting time too rapid, etc. It would be good to be able to discus these points with someone with appropriate experience such as a forensic anthropologist specialising in violent death. The only one I know is the principal lecturer in Forensic Anthropology at John Moores University, Liverpool, whose recent papers at the American Academy of Forensic Sciences have included cannibalism, suicide, poisoning… oh, and two on blood flows….","date":"2015-04-14","mins":"5:33 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196303","author":"hugh_farey","post":"Yes, Max. As Antero said, and I agreed, the conclusion is rather more dogmatic than it should be. However, although crucifixion technique is relevant to their experiments, burial practices are not, and mention of them is wandering away from the subject. Garlaschelli and Borrini’s experiments did not mimic the blood flows on the Shroud, and “seem to refuse to testify in favour of their authenticity.” That is not the same as saying: “nothing is demonstrated, nothing conclusive at all surfaces” and it is also not the same as saying that they prove non authenticity. Neither the professors, nor I, not even the article leading this post, claim that they do. To suggest that they do is wandering away from the subject. When I agreed with the professors’ article, you asked me to name one specific thing with which I did not disagree. This is wandering away from rationality. I am very sorry that not only did I get Giulio Ricci’s name wrong, but in all my posts above I have referred to Prof. Borrini as Borroni and twice to Prof. Garlaschelli as Guarlaschelli. I do apologise to them all most sincerely..","date":"2015-04-14","mins":"6:39 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196396","author":"hugh_farey","post":"No, Max. I am not bothered about their qualifications, and very much doubt if a ‘second temple period historian’ would be any better at carrying out appropriate experiments involving blood flows. These experiments speak for themselves, and for me, anybody who actually tests their hypotheses is well worth their salt. Whether or not one agrees with the conclusions drawn from them,.","date":"2015-04-15","mins":"7:27 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196378","author":"hugh_farey","post":"In these descriptions, Barbet considers only the twin flows from the wrist wound, not the flows along the arm. With reference to OK’s diagram above, there are three flows from the wound, represented as two short red arrows and one long one. Barbet considers only the shorter two. In order for blood to flow down the arm towards the elbow, his angles have to be considerably steepened. He does not seem to have considered the possibility that the arms may have been bent at the elbow at all. Nevertheless, it would be interesting if Garlaschelli and Borrini were to carry out more experiments with Barbet’s descriptions in mind..","date":"2015-04-15","mins":"3:59 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196410","author":"hugh_farey","post":"A blood flow is a blood flow, regardless of any subsequent occurrence. Burial practices were irrelevant to this experiment. Perhaps either you or Max could explain how expertise in such things could have helped..","date":"2015-04-15","mins":"9:19 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196399","author":"hugh_farey","post":"“I should think it very difficult indeed for any traumatised victim to sustain a bent elbow at all.” You may be right, although a number of investigators subsequent to Barbet have disagreed, in two different ways, as I have described – either symmetrically raising and lowering the victim on the nails, or asymmetrically lurching from side to side. However, if the forearms were never more vertical than Barbet surmised, then it would be impossible for blood to flow down them. As for the blood flows being post mortem, I think Antero would agree that this is unlikely. Although blood remains liquid in quantity after death, almost all the blood in the arms would have drained downwards after the heart stopped, and the size of the blood vessels involved would make it impossible for it to drain back to the wound site, even if the body was tipped upside down. Even if it could, it would then dribble out downwards over the fingers, not back up the arms..","date":"2015-04-15","mins":"7:45 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196438","author":"hugh_farey","post":"“Hugh: Can you prove…” Don’t go on, Max; I’m a scientist, not a mathematician. Scientists don’t prove things, they demonstrate things. But they rarely demonstrate non things. If you think adding a wooden plaque to the entry place on the wrist before nailing it to a cross has some effect on the blood flow from the exit wound, thats fine. I just don’t believe you. I don’t care to demonstrate why, I just think you’re wrong, and you have absolutely no comeback to my opinion unless you can provide some smidgin of evidence to suggest you might be right. “According to UAAR, their wanted to answer the question: “Does the imprint of the body on the Shroud does match that of a condemned posted in a location similar to the classical representations of the crucifixion and that of a bloody body lying in the tomb?”.” Well, no, Max, you’ve made that up. First you demand a hypothesis, and because Colin won’t give you one, you make one up. For the benefit of our public, this is what the UAAR press release actually says: “The scope of work of Borrini and Garlaschelli was to verify – using forensic techniques of BPA (Bloodstain Pattern Analysis – analysis of the shape of the blood stains) – what should be the posture of a human body so that the rivulets of blood you have as it appears on the footprint human in the Shroud of Turin.” It really doesn’t matter whether Garlaschelli and Borrini are devoted advocates for the Shroud or fanatical atheists intent on the downfall of Christianity. They were looking for a correct posture to achieve blood flows like that of the Shroud. They narrowed their field to the arm and the side wound, and tried a variety of postures for each, none of which matched the Shroud flows well. They could try different postures, or different blood, or different conditions on the arm, and perhaps they will. To claim they have shown that the blood on the Shroud is not the result of a crucifixion would be unjustified, and they do not claim it. They do claim that their results do not match those of the Shroud, which is true, and they do add “ma piuttosto a una rappresentazione artistica o didascalica,” which is assuming too much at this stage..","date":"2015-04-15","mins":"1:15 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196405","author":"hugh_farey","post":"No, Max. You’re still not saying anything very coherent. Perhaps you’d like to suggest what a Doctor of Archaeology and Bloodstain Pattern Analysis might do in the way of an experiment to determine if the blood flows are realistic. And what does this mean – “They curiously have failed to account for the void or ‘shadow’ “? Why should they? They were not trying to imitate a forger, they were aiming for realism. The fact that they did not achieve it does not demonstrate a forgery, and they do not claim it does. They do suggest that perhaps crucifixion was more vertical than generally supposed, which implies an acceptance that the blood flows might be authentic, but they do not discus whether their experiments could be improved, the better to model the pattern on the cloth. Perhaps they will. And this: “Each of TS man’s wrists was nailed to the cross with a wooden plaque.” It is unlikely that the plaque would be between the back of the hand and the cross, as the cross itself would provide an adequate surface. Johanan’s heel was nailed with the wooden plaque on the side away from the cross. It has been suggested that Jesus was crucified facing the cross, in which case the wooden plaque could be on the back of the hand, and cause the interruption of the blood flow, or that Jesus’s hands were tied together in the tomb, and the blood under the ligature was rubbed away..","date":"2015-04-15","mins":"8:54 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196459","author":"hugh_farey","post":"I’ve no idea what you’re talking about, Max. Thanks very much for your photo, Thibault, but particularly for Fred Zugibe’s letter, which I don’t fully understand. He seems to suggest that at least two of my suppositions are incorrect, which is interesting, firstly that a crucified person’s blood may stay liquid for much longer than normal, and secondly that blood vessel contraction would also be reduced, so liquid blood could still flow out of a hand wound after death. That’s fair enough. However he also says that: “the blood in the arms would not flow backwards because the flow is governed by one way valves.” I’m not sure what he means here. Is he saying that the blood would not drain down towards the chest? Surely the one way valves in the veins of the arm prevent the blood from flowing towards the hand, not towards the chest. After all the veins are taking blood back from the extremities to the heart, the valves allow that. Or is he saying that the blood still present in the veins after death could not drain out of the wrist, even if it were lowered, because the valves would prevent it. That makes a lot more sense. However he does say that some blood might be expected to escape from the wound after the nail were pulled out. It’s not obvious to me where from. It’s all very interesting though..","date":"2015-04-15","mins":"5:33 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196465","author":"hugh_farey","post":"That’s much clearer; thanks, Max. Now all you need to do is to experiment to find a posture by which blood from the front of the hand can end up on the back of the arm, and you demonstrate your point perfectly. I don’t think you can, but at least I know what it is I disagree with now!.","date":"2015-04-15","mins":"5:55 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196485","author":"hugh_farey","post":"No, Max. Blood from either side could drip down around the arm to meet somewhere near the elbow, as the various reconstructions demonstrate, but blood from the front cannot curl over to the back to produce the pattern shown on the Shroud. But all you need to do is to experiment to find a posture by which blood from the front of the hand can end up on the back of the arm, and you demonstrate your point perfectly..","date":"2015-04-16","mins":"2:19 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196188","author":"hugh_farey","post":"Thank you, Piero. Your last link is to an abstract of the paper deriving from Guarlaschelli and Borroni’s experiments, and states: “Real human blood and synthetic blood for BPA were used with comparable results.” Max, I think you have missed the point. There was no intention in this experiment to investigate the colour or nature of the blood on the Shroud, only the verisimilitude of the blood flows. As such, consideration of what might have happened to the blood after it had flowed was irrelevant. Other experimenters, or theoreticians such as yourself, have considered how a blood flow might be transferred from a body to a cloth, and having done so, how it might, after hundreds of years, present the appearance that it does now, but science proceeds by small steps, and there is no need to try to find the answers to everything at once. There is no need to accuse Guarlaschelli or Borroni of being unable to discriminate, or to have overlooked, or (a favourite of the authenticist) to have “totally ignored” factors which were irrelevant to their experiments..","date":"2015-04-13","mins":"3:59 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196494","author":"hugh_farey","post":"I long to see a demonstration….","date":"2015-04-16","mins":"3:45 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196512","author":"hugh_farey","post":"No, Max, that’s absurd. Garlaschelli’s, Thibault’s and Ricci’s versions are all illustrations to the contrary. All this ‘demonstrate the non appearance of the elephant’ business is nonsensical..","date":"2015-04-16","mins":"8:13 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-27525","author":"hugh_farey","post":"I’m sorry, Robert, but I have difficulty with your “official historical document,” which although would have had authority in any court of law at the time, would quite rightly, like any other centuries old pronouncement, be laughed at today. The very words of the translation you use – THE PROPERTY OF JESUS OF NAZARETH – are absurd; perhaps the original Spanish was less so. An opinion does not become a fact because a King says so, however well respected. Furthermore, many of the points of congruence often cited are an unjustified extrapolation of the fact that if two cloths are covered in blood, there are likely to be several places where blood stains coincide. An appropriate control experiment might be to take a couple of randomly stained cloths and, in a similar, super imposition exercise, see how many points of coincidence there are. Various other comments leave me slightly mystified: Are you suggesting that the Shroud and the Oviedo cloth were originally table cloth and napkin? Or that the bloodstains on the Oviedo cloth look as fresh as those on the Shroud? I do not know that there is evidence for either of these. I agree that there is much in common between the Shroud and the Oviedo Cloth, and that there is evidence (albeit none of it unchallenged) to suggest their connection. However many of the comments on this site refer to “courts of law,” and “reasonable doubt,” and both pro and anti authenticists need to be aware of contradictory arguments before committing themselves too certainly one way or another..","date":"2013-03-17","mins":"5:50 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-20423","author":"hugh_farey","post":"I agree. When I read Pope Benedict’s book (all three volumes now) I was astonished and delighted by his succinctness, his scholarship, but above all his reasoning. I feel certain that if he hadn’t become a priest, he would have made a brilliant theoretical physicist!.","date":"2012-12-14","mins":"8:05 am","url":"https://shroudstory.com/2012/12/12/on-genetic-codes-and-the-shroud-of-turin/","cat":"blood_studies","title":"On Genetic Codes and the Shroud of Turin"},{"id":"comment-20292","author":"hugh_farey","post":"Or a Roman soldier called Panthera. Although that could be a sort of malapropism for Parthena, it is quite an old (if possibly malicious and unfounded) rumour..","date":"2012-12-12","mins":"1:01 pm","url":"https://shroudstory.com/2012/12/12/on-genetic-codes-and-the-shroud-of-turin/","cat":"blood_studies","title":"On Genetic Codes and the Shroud of Turin"},{"id":"comment-24858","author":"hugh_farey","post":"While I don’t find myself able to go along with all Max’s hypotheses, I do agree that for blood rivulets to wander erratically back and forth across the shroud would need a certain amount of turning this way and that, not to mention times of stasis for the blood to dry, and/or remoisten..","date":"2013-02-19","mins":"9:44 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-24862","author":"hugh_farey","post":"Matthias: I can’t believe you actually read my comment. You begin “I’d like you to explain why you think there is no blood on the small of the back,” when my entire post refers to the blood which is indeed found on the shroud at that position. You say “I can’t see why the trail on the small of the back might not be blood” when I have never disputed that point. You say “If you mimic the shroud figure’s pose like I did you will naturally see that blood would flow down the from the wrists on the underside of the forearms and collect around the hip area.” Indeed it might. You say “why do you conclude that this isn’t blood?” I conclude no such thing. Although I am truly loath to use capital letters, I beg your (and others’) indulgence if I try to make my point clearer in this way. There is no POOL of blood in the small of the back. There are TRICKLES of blood from one side to the other. It is these trickles that need to be explained. You say that a mass of blood might collect around the hip areas “possibly then trailing off across the small of the back.” Possible, I dare say, but how? Try lying down on a sheet and pouring… tomato sauce? syrup? choose your own blood substitute… wherever you feel appropriate, and then getting it to trickle across your back. Twice. Without smudging. It’s really not as simple as you imply. Go back to the shroud and look at it. You will notice that on the dorsal image, on the “spear wound” side there are a number of blood ‘wriggles’ but no apparent pool. On the “hand wound” side, almost entirely obliterated by the burn marks, there does appear to be a possible pool, much distorted by the water stains, although it is far from obvious..","date":"2013-02-19","mins":"10:10 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-25054","author":"hugh_farey","post":"Simples? If only. If the body was washed before being enshrouded, then what are those trickles doing along the arms? Are they from Jesus waving his arms about just before resurrection? it is clear that Chris B knows rather more about the biology of resurrection than I do. When the heart begins beating, for instance, does it not immediately pump out a fair proportion of the blood through the five major holes in the body? How quickly does Jesus sit up, and doesn’t he feel so faint that he immediately loses consciousness? And having re animated, does does he flip the shroud off with his arms before sitting up? Or does he slide out sideways? Or sit up with the shroud still covering his face? Although these questions sound flippant, they have direct implications for the appearance of the image on the shroud, and cannot be avoided if we follow Chris B’s line of thinking. Other resurrection experts have assumed the body simply de materialised, with or without a burst of energy of one kind or another, the shroud collapsing through the void thus created, and some non believers think the shroud was simply folded back by the Essenes, who lifted Jesus, alive or dead, away, leaving the cloth behind..","date":"2013-02-20","mins":"12:18 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-24910","author":"hugh_farey","post":"On the whole, my view is that the results of the multitudes of tests carried out on the ‘blood’ do indicate that it is real blood. I’d even go as far as to say human blood. Whether it derives from injuries to a body which lay on the shroud I think is less well demonstrated and far from proven. The standard riposte to this statement is that no forger would have done this or that, and that therefore a natural ‘dead body’ explanation is the only one possible. This dichotomous view of the shroud – that it can only be either an out and out deliberate fake or the inevitable result of a temporarily wrapped corpse – in my view ignores quite a gamut of intermediate alternatives, including the deliberate enhancement of a genuine relic, a largely accidental result of some experimentation, a replacement for a relic destroyed by fire, a backing cloth for something else, and so on. Perhaps it is mere obduracy on my part, but whenever I’m offered a choice between A and B, I usually try to find out if there might be a C..","date":"2013-02-19","mins":"4:08 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-25004","author":"hugh_farey","post":"I love it! That’s real science, and it is so much more valuable to be able to say “this is what happened” than “this is what would have happened.” An experiment like that leads on to lots of interesting follow ups – how much blood had to flow from each wrist to produce the required trickle, did it smudge or seep in to the cloth, do adjustments to the viscosity (vide daveb) make a difference and so on. Nobody, as far as I know, has explored this area at all well, so the field is wide open..","date":"2013-02-20","mins":"7:04 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-25067","author":"hugh_farey","post":"A translation of Carlos Otal’s comment: The “deliberate enhancement of a genuine relic” is impossible. No blood added [to the shroud] would have the same red colour as the blood on the shroud, nor would it have the same form, such as the edge definition. Laboratory experiments have demonstrated this. The [gospel] descriptions of the agony of Jesus of Nazareth are entirely consistent with a body suffering the onset of Disseminated Intravascular Coagulopathy (DIC), sometimes called “consumptive coagulopathy.” This could be caused by the multiple trauma of the soft tissue (from the scourging) as well as the crucifixion itself. This was noted by Bergeron in 2011 (although I have not read his work) and is further developed by Svensson and Heimburger in “Forensic aspects and blood chemistry of the Turin Shroud Man.” In DIC there is massive disorder of the normal regulation of coagulation and bleeding, as well as intense haemolysis (breakdown of the red blood cells) leading to increased ‘indirect’ bilirubin (which might have something to do with the red colour of the blood on the shroud). The pathogenesis of this serious disorder was unknown until a few years ago (I’ve seen many patients with it die in a few hours), but fortunately it is now well known and treated medically. I think this could well be studied more intensively, although macroscopic aspects of the progress of the disorder (direct observation of the behavior of bleeding, coagulation and lysis rebleeding) are very unlikely as treatment is started immediately at the first sign of CID. —ends— From my point of view, although I don’t think a little touching up is any less unlikely, I’m grateful to Carlos for introducing me to Svensson and Heimburger’s paper, which is very interesting..","date":"2013-02-20","mins":"3:09 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-25093","author":"hugh_farey","post":"I’m frustrated by not knowing what is meant by the blood was ‘not disturbed.’ I can see that it is not smudged or smeared, but once it’s dry, even if it is adhering to something, such as a wound, pulling the cloth off would not smudge or smear the bloodstains anyway. What might happen is that a lump or lumps of dried blood might flake off. And, well, I notice that most of the thickest clots, such as those at the back of the head, do indeed look as if their middles have been flaked off, and many of the trickles have sudden very pale sections, as if there has been more flaking there than at other places. Even in the bloodiest places it is clear that most of the surface of the blood has flaked or crumbled away as the pale colour of the cloth is clearly visible through it, and none of Mark Evans’s micrographs show continuous patches. None of the bloodstains looks as it did when first laid down; most of the blood has eroded away. Can someone explain what is meant by ‘not disturbed’?.","date":"2013-02-20","mins":"7:54 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-25161","author":"hugh_farey","post":"I have followed all Max’s ideas about the fairly complex procedures he thinks may have resulted in the shroud’s image with interest, and even a certain amount of humility, as they are way beyond my scope, but I think he must be careful in claiming unanimity among the pathologists. Zugibe disagrees with Bucklin, for example, to a considerable degree, and neither of them has much time for Vignon. Like all good pathologists, they all agree that their observations are “consistent with” (rather than “proof of”) their conclusions. As far as I know none of them has been cross examined by a ‘counsel for inauthenticity,’ but I suspect that they would agree that some of their observations are also ‘consistent with’ alternative conclusions. My own, inexpert, examination of the shroud shows a number of irregularities of colour even along trickles which appear otherwise regular in thickness, numerous ‘clots’ whose insides are much paler than their rims, and, through every single bloodstain the ordinary colour of the cloth is clearly visible. I believe these observations are ‘consistent with’ much of the blood having fallen, flaked or crumbled off. If that is not ‘disturbance,’ then what is?.","date":"2013-02-21","mins":"10:56 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-24857","author":"hugh_farey","post":"Yes indeed; my Point 3 addresses exactly that. It requires that the blood matted hair be completely dry, or kept conveniently out of the way for the “trickles” to register, and then for the shroud to be completely re shaped for the hair image to register afterwards. The experiment referred to does not address the very similar flows on the back of the head at all. The complexities of all these bloodstains may not be inexplicable (indeed, I think they must be explicable), but it should not be assumed that a “natural” explanation is per se more likely than a “manufactured” one. There is no Occam’s razor here..","date":"2013-02-19","mins":"9:39 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-209462","author":"hugh_farey","post":"Q. “Where did you read here that I asked you to comment on someone else’s remarks or said that you were scared to comment?” (Louis, 4:52, 1 Sept) A. “The discussion is […] about a provocative email […] leading to a comment that refers to a website. […] John Klotz and David Goulet have expressed their opinions. Would Hugh Farey and daveb please comment?” (Louis, 8:11, 31 Aug) “I can see that you unfortunately have no courage to comment, although you are editor of the BSTS newsletter.” (Louis, 9:08, 31 Aug) Forgive me if I have misunderstood you, Louis, but it seems clear enough here. If you meant something else, then what, precisely, were you so keen for me to comment on that a delay of 12 hours implied that I lacked the courage to face? Does it have anything to do with the Shroud?.","date":"2015-09-02","mins":"2:31 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208875","author":"hugh_farey","post":"“Dr. Adler told him that, no, no such test had ever been performed on the Shroud. That is very hard to believe.” To be frank, this doesn’t ring true, but then, time could have made the memory a little hazy. Alan Adler almost certainly knew very well that there is no a priori difference between pre and post mortem blood, and that consequently no differentiating test could have been performed. The blood emerging from a man who bleeds to death on a cloth does not change in composition after his heart ceases to beat, and having emerged, both pre and post mortem blood are subject to similar changes. As Helmut mentions above, early blood transfusions were successfully done using blood from dead people. However, some differentiation can be made between the shape of pre and post mortem bloodflows on the Shroud, based on the pressure with which it was expressed, and this has been recognised and commented on. The trickles down the arms are most unlikely to have been possible from a dead man, and are generally assumed to have arrived in place while Jesus was still hung on the cross, while the zig zag ooze from the chest wound seems to be from a simple gravitational process, rather than the copious squirt (sometimes depicted in medieval art) that would have been the result of a beating heart. Other bloodmarks are more ambiguous. I think the author’s suggestion that religious convictions may have led to unfounded conclusions is not, in my opinion, supported by any evidence, and is best set aside in favour of more objective observations. One is tempted to wonder whether the author’s affiliations are reflected in his comments as well. A few pathologists have considered it possible that the image and its bloodstains could only have been caused by a living person, and the point about myrrh being more of a healing unguent than an embalming one is well made. You are welcome to your doubts, and are not alone in them – ten million Ahmadiyya Muslims would agree with you – but a doubt is not, of course, a certainty, nor a comprehensive discreditation of the opposite point of view..","date":"2015-08-24","mins":"11:24 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208975","author":"hugh_farey","post":"Thanks very much for bringing the paper to our attention. I was not previously familiar with it, and agree that it offers a most interesting line of inquiry..","date":"2015-08-25","mins":"6:22 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209085","author":"hugh_farey","post":"Dr Robert Bucklin knew very well that you can’t tell from a photograph of an imprint on a cloth of a body whether the man was dead or not, and did not claim to have proved anything. He did say: “The body appears to be in a state of rigor mortis” and “This [chest] wound has all the characteristics of a postmortem type flow of blood” and “the forensic pathologist can come to a reasonable conclusion as to the circumstances of death” and clearly thinks that he has established the fact of death, but that’s not the same as proving it. The distinction is subtle, but it leaves room for others to disagree with his findings, and to come to different conclusions. In particular, I was talking to a young surgeon last week who did not believe that the blood flow from the chest wound could have come from a body which had been dead for any length of time, based on his own recent experience with traumatic deaths. In addition to this, some of Bucklin’s observations are clearly guesses. His estimate of the height of the man, confidently given as 71″, is not substantiated by the measuring tool on Shroud Scope, and his calculations about the angle of the arms appear to be based simply on the angles between the arms and the bloodflows on them, which are not borne out by experimentation such as Garlaschelli’s. He also notices “a square imprint giving the appearance of an object resting on the skin” on the forehead, and “rounded foreign objects can be noted on the imprint in the area of the right and left eyes.” None of this, of course, ‘proves’ that the eminent pathologist was wrong in his conclusions, but the statement “Dr. Robert Bucklin proved from his surface autopsy that the man on the Shroud was most certainly dead” is unjustified..","date":"2015-08-27","mins":"3:29 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209113","author":"hugh_farey","post":"I agree absolutely with everything John has just said. My ‘young surgeon’ was someone I met at the Jalsa Salana, and I did not go into details about his experience. He described himself as a ‘general surgeon’ and said he had had some experience of traumatic death. Whether he was a practicing forensic pathologist or a freshly qualified student I’ve no idea. But that’s not the point. I was not querying Dr Bucklin’s qualifications or experience; I was merely saying that his views are not “proof” of anything, and that there is room for disagreement of his findings. Dcn Andy, above, implied that after Bucklin’s ‘autopsy’ the question of the authenticity of the Shroud was settled conclusively, and I wanted to explain that that isn’t so. Of course I do realise that the word proof means something different to a lawyer than it does to a mathematician (it doesn’t mean anything to a scientist). To a lawyer, a guilty verdict is declared after proof beyond reasonable doubt. He knows only too well, however, that there is an elaborate appeals structure, suggesting that ‘reasonable doubt’ can be a variable quantity. I am certain that I could establish reasonable doubt against the authenticity of the Shroud – but then, I think John could probably establish reasonable doubt about its medieval provenance if the indictment was worded in the other way..","date":"2015-08-27","mins":"8:18 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209137","author":"hugh_farey","post":"Well, wouldn’t that be nice. How often must one emphasise the importance of primary sources. This quote comes from the National Report, which by its own description “is a news and political satire web publication, which may or may not use real names, often in semi real or mostly fictitious ways. All news articles contained within National Report are fiction, and presumably fake news. Any resemblance to the truth is purely coincidental.” In other words, Pope Francis said no such thing. Http://athanasiuscm.org/2015/06/03/more reasons to ignore pope francis quotes explores the report in more detail..","date":"2015-08-27","mins":"1:30 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209304","author":"hugh_farey","post":"Is there any evidence that the “percussio” was a recognised method of assuring death in crucifixion victims? Or that it was taught in Roman military academies? I can’t find anything so specific among the classical references at perseus.tufts, but it may be mentioned elsewhere..","date":"2015-08-30","mins":"8:59 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209343","author":"hugh_farey","post":"Thanks, daveb. I think Barbet is more confident about his conclusions regarding Roman military training than his rather disparate quotations justify, but they are not unreasonable. Quinitilian’s remark is an aside in a story about the ruthlessness of pirates, Sextus Empiricus, in his “Against Logicians” was merely giving an example of logic (If you stab a man in the heart – he will die”), and all three quotations from Caesar (and there are several others) refer to the undefended side of a military formation, which was often the right side, as soldiers carried their shields on their left, but does not necessarily define it. It certainly makes sense that soldiers were taught how to attack the undefended side of an enemy, but Barbet’s “must have become classical and have been taught in the fencing schools of the Roman armies” is not directly attested for anywhere..","date":"2015-08-31","mins":"2:36 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209351","author":"hugh_farey","post":"Yes, I think that’s more or less fair enough. On a broader note, it is almost impossible for a right handed man (particularly if he is holding a shield in his left) to inflict a stab wound to the heart on the right side of an opponent facing him. A cut across the ribs, possibly; a thrust, no, although I have seen a reconstructed sword Roman sword drill which included a diagonal thrust out to the right, stabbing an enemy who was actually fighting the man standing next to you. I suspect that the wound on the Dying Gaul had more to do with the orientation of the body and his position in the place where it was to be displayed than any military considerations. Of course that wouldn’t apply to a soldier with a lance and a crucifixion victim..","date":"2015-08-31","mins":"6:30 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209358","author":"hugh_farey","post":"“I will wait till the end of the day.” Indeed? And then what? It’s irresistible. I shall have withhold comment to find out….","date":"2015-08-31","mins":"8:39 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209368","author":"hugh_farey","post":"What piffle, Louis..","date":"2015-08-31","mins":"11:02 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209443","author":"hugh_farey","post":"Hugh will repeat what he said, in case anybody thinks Louis’ remarks accurately represent him. The Ahmadiyya belief that Jesus did not die on the cross is intimately connected with the Shroud, which could, if authentic, shed some light on the controversy. What it cannot help with is any of Jesus’s alleged further peregrinations, or whether the temple in Shrinagar is really Jesus’s tomb. A discussion about Kashmir is nothing to do with the Shroud. Where Louis was being ridiculous was in his suggestion that I might be too scared to comment on Ron Chism’s remarks. That’s ridiculous. Why was I invited to the Jalsa? Well it was nothing to do with Kashmir. Is Louis’ paper at all relevant? The first half is devoted to refuting the idea that Jesus went to Kashmir – and has nothing to do with the Shroud. The second half is devoted to the authentication of the Shroud – and has nothing to do with Kashmir. QED. And I do not advise you to look at a website. Ron Chism advises you to look at his website. I was challenged to comment on Ron Chism’s advice by Louis – who then said I lacked the courage to do so, and now condemns me for finally being brave enough to accept his challenge. Frankly, Louis, you’ve twisted yourself into knots here. I would give it a rest if I were you..","date":"2015-09-01","mins":"3:54 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209414","author":"hugh_farey","post":"I beg to disagree with Louis that a discussion about the bloodstains on the Shroud is “a waste of time” and takes “the discussion off the track.” As far as I’m concerned, the relevance of Ron Chism’s posts to this bog is entirely to do with whether the Shroud shows a man living or dead, and the bloodflow from the chest is central to that discussion. Louis’ ridiculous comment “I can see that you unfortunately have no courage to comment, although you are editor of the BSTS newsletter” is a feeble attempt to goad me into a discussion about Kashmir, which is nothing to do with the Shroud, or the BSTS, and hasn’t worked. Ron Chism’s website has a section entitled “Did Jesus survive the Cricifixion?” and lists 8 pieces of evidence, some of which have sindonological relevance. Readers are invited by Ron (“recommended” in fact) “to examine each of these in more detail.” Points 1, 2 and 3 are biblical, and do not elucidate the Shroud. Point 4 assumes that crucifixion invariably lasted days rather than hours. Such meagre contemporary evidence that we have cannot justify the word ‘invariably’. If the bible is to be believed, in this particular place at this particular time, crucifixion victims were not left alive over the sabbath anyway, even if they could have lasted much longer, but were definitively killed off by crurifragium or percussio. Point 5 claims that while the crurifragium invariably lead to death, the percussio might leave a victim alive. This is where the Shroud (assuming that it is genuine) may be evidence. For a start it seems that if there were any doubt about whether the victim was alive, the crurifragium was used, so the Roman guards were satisfied that Jesus was indeed dead before they lanced him, and secondly, the wound as it appears on the Shroud appears approximately as wide as the width of a Roman lance, implying more than a surface scratch. Some scholars have suggested that as percutio can refer to being stung by an insect or snake, that perhaps the Roman guard was part of a plot to keep Jesus alive and only scratched him. This is not borne out by the blood image on the Shroud. Point 6 looks at the “blood and water.” This has been interpreted in all sorts of ways. It has been the opinion of some pathologists that a living man stabbed in that manner would have produced copious amounts of blood and pleural fluid, squirting out and spattering both body and any adjacent material until he was dead. A dead man would simply leak the liquid contents of the heart and lungs above the wound. Assuming this is true, then the Shroud supports the second version. Other pathologists claim that only a beating heart could have produced the amount of blood blood flow as seen on the Shroud, including not only the chest wound but the streams across the back, and probably including a lot of other blood which did not mark the Shroud, either because it missed or because it was washed off, so that what remains is the result of the rather feeble heartbeat of a man close to death, but revivable. These pathologists claim that the blood of a dead man becomes too viscous to flow at all within a short time of death, and could not have oozed as claimed by the former group. As far as I know, pathologists of both kinds have been or are very rarely challenged about their opinions, or engaged in discussion. I would be a very good thing if they were. Sadly, the most quoted ones of the past – Barbet, Bucklin, Zugibe, etc. – have passed, and there don’t seem to any sufficiently bold today to have their ideas compared to those of the opposite persuasion. From ‘the man in the street”s point of view, this must remain a matter of opinion rather than fact. Point 7 says that Jesus’ body was looked after by Joseph of Arimathea and Nicodemus. This certainly seems a mark of considerable respect, but does not necessarily imply that Jesus was alive or dead. Point 8 considers the “hundred pounds” of myrrh and aloes. There is, I think, no doubt that these were used extensively in medicine (for alive people), and no doubt that the Jews, then as now, did not embalm their dead. If Jesus were alive, and his accomplices knew it, then myrrh and aloes would have been helpful in aiding recovery – although the wrapping over the head with a shroud seems a little odd in these circumstances. On the other hand, if Jesus was dead, then a hurried attempt to preserve the body until it could be properly attended to after the sabbath could also explain the myrrh and aloes adequately. I think in general that early Christianity rested on the “fact” of the Resurrection, in whatever form it took, and that therefore something occurred after the crucifixion of Jesus that must be able to be thought of as a Resurrection. A story put about by Peter, John or Mary Magdalen, or invented by St Paul does not seem an adequate explanation for this “fact,” nor a man who seems to have simply recovered after being crucified, but what, exactly, constituted it is currently further than most theologians, let alone historians, and certainly not me, are prepared to speculate..","date":"2015-09-01","mins":"4:10 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-129350","author":"hugh_farey","post":"It’s taken me a while to plough through this paper, but essentially it says nothing the authors haven’t said before, and it doesn’t even begin to “Explain the Coexistence of Bloodstains and an Image” which is the title of the report. After spending some 4 pages confirming to their satisfaction that there are blood images on the shroud, tossing out various derogatory remarks about scientists who don’t find their arguments as convincing as they do, it is firmly established that “the major part of the bloodstains are the result of a permanent contact between the corpse and the cloth.” The word ‘permanent’ is qualified as meaning remaining after the body had been left alone in the tomb. Next it is revealed that the body image is related to a very weak radiative interaction (producing a stochastic rather than a continuous discolouration pattern) whose strength is proportional to cloth body distance. It is not explained, or even understood, that ‘permanent’ contact bloodstains are found in areas of different discolouration intensity, which means areas of different cloth body distance. The authors’ conclusion: the “stochastic process is able to … resolve the apparent discrepancy that seems to exist between the formation of the bloodstains (which only happened through direct contact transfers) and both body images (which happened through direct contact and short distance types of transfers),” is wholly unjustified. This is a major problem for a natural dead body explanation for the whole picture, and it would be a wonderful thing if anyone were to solve it convincingly. This paper doesn’t..","date":"2014-06-14","mins":"4:37 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin"},{"id":"comment-22467","author":"hugh_farey","post":"Well, at enormous expense I now have the original study. Two collections of bones were studied, from Ein Gedi (4th Century) and from Jerusalem (1st Century). It would be remarkable if both collections were from the same family. From Ein Gedi, 6 of the 24 bodies were AB. From Jerusalem, 22 of the 47 were AB. The authors also mention an earlier study of Egyptian mummies, where 9 of 24 were AB. They charmingly conclude by saying “the gene frequencies of the ABO blood group system may have undergone important modifications in the course of human evolution.” Either that, or other blood types tend to deteriorate over time until they test as if they were AB. If the blood on the shroud is 1st century, and if it really tests AB, then it comes from the commonest type of blood there was..","date":"2013-01-23","mins":"2:05 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","title":"Positive for AB is not the same as AB positive"},{"id":"comment-129393","author":"hugh_farey","post":"I think that’s a little unfair. A stochastic distribution is reasonably well understood, I think. Imagine watching a patio as a rainshower begins. Although overall the patio gets wetter and wetter, the initial distribution of wetness occurs as randomly spaced splashes of approximately uniform area and volume. I think the authors are discriminating between radiation which colour an an entire area uniformly – the more the radiation the deeper the colour – and weak radiation which – due to imperfections in the target – colours single fibres here and there, so that that the depth of colour depends not on the colour of any individual fibre, but on how many fibres are coloured. They seem to argue in this and other papers that while ‘background’ radiation (unexplained) is not stochastic, the body radiation (poorly explained) does have that effect. Leaving aside the scientific jargon, this is how the STURP team almost always explains the variable colour density of the Shroud, often using terms like ‘half tone.’.","date":"2014-06-14","mins":"8:26 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin"},{"id":"comment-22549","author":"hugh_farey","post":"Sorry Charles, I should have said that “the 1977 findings suggest” that it comes from the commonest group there was. The argument that AB type blood has diminished from about 50% to its present 4% is not mine; it is implied by the slightly nervous statement (quoted above) with which the authors conclude their paper. While they were confident with their procedure, and tested each bone three times, they seem to me rather less confident with their conclusions. My own, hopelessly unqualified, view is that the huge proportion of AB they discovered is more likely due to the deterioration of the sample than either a freak double group of highly unusual people, or a very different proportion of AB then from now..","date":"2013-01-24","mins":"1:22 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","title":"Positive for AB is not the same as AB positive"},{"id":"comment-22398","author":"hugh_farey","post":"The antiquity of the ABO system does not necessarily mean that type AB blood is equally ancient. Modern Bonobos, for example seem to be exclusively type A, and gorillas seem to be mostly type O, while orang utans do indeed include A Bs. See (chimpanzeeinformation.blogspot). That fact more than half the 1977 human sample were found to be type AB is more than extraordinary, even if type AB was indeed present, as it currently does not exceed 10% anywhere in the world. Did those who tested the sample speculate about it, I wonder?.","date":"2013-01-22","mins":"3:18 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","title":"Positive for AB is not the same as AB positive"},{"id":"comment-24741","author":"hugh_farey","post":"While I wouldn’t dream of telling your famous quartet of forensic pathologists their business, I note that they have studiously refrained from telling me mine. Either they have not addressed the issues I have raised, or they have disagreed with each other in their explanations. The question of pre and post mortem bloodflows, whether the body was washed or not, the position of the hand wound, the cause of death – on no single one of these are all four scientists agreed. They are scientists, and I’ve no doubt would all attribute their varied conclusions to the fact that they were working from a photograph of a sheet rather than a dead body, but varied their conclusions are, for all that. My inconsistencies remain unexplained..","date":"2013-02-18","mins":"6:43 pm","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","title":"Stephen Jones’ New Posting on the Bloodstains"},{"id":"comment-24686","author":"hugh_farey","post":"Bloodstains. As usual, the “obvious” turns out to be almost the exact opposite. While few (perhaps none) of Stephen Jones’s observations are incontrovertibly incorrect, even fewer (perhaps all) are utterly unchallengeable. Let’s take a few, probably in no particular order. 1) The two different angles of flow on the forearms correspond to the two different angles at which they were suspended on the cross. If this is so, then that pattern was maintained after the blood dried, the body was removed from the cross, transported to the tomb and ended up being transferred to the shroud, without being rubbed or washed off… 2) unlike the dribbles of blood which would have descended from the spear thrust, which have mysteriously disappeared, to be replaced by the randomly directed dribbles we see today, zigzagging around below the wound and flowing from one side to the other of the shroud. From one side to the other at least twice, or possibly from one side to the other and back again. There is no pooling of blood in the middle, as might be expected from a shroud carrying a body – so how did it dribble across? Presumably it was before the body was placed on top, and dried so quickly that the body did not smudge or distort it all as it was laid down. 3) It is easy to find pictures of people who have suffered head traumas. Do they have clean, stain free hair, with a handful of well defined dribbles placed on the surface, as we see on the shroud? Nothing like. Blood, people seem to forget, starts at the scalp, and oozes its way through. If Jesus’s hair was matted with blood, it did not transfer to the shroud at all. Curious. Some people have suggested that the blood came from the sides of the face when the cloth was wrapped around the head (but nothing was transferred from the hair), and then the shroud was realigned to receive the image of the hair. If it is hair, and not a packing of spices. 4) There have been quite convoluted attempts to distinguish between bloodflows that occurred during crucifixion and dried, bloodflows from wounds reopening as the body was taken down, and bloodflows from wounds reopening as the body was laid in the shroud. Also between wet, dry and re wetted blood, and even venous and arterial. They are not based on the colour or appearance of the blood, but entirely on its position on the shroud, taking it for granted that the flows must be genuine and attempting to explain the inconsistencies. Nothing wrong with that, but the premise is not proved thereby. 5) The flogging marks. These are very neat and tidy, as if the body had been washed clean, and then new exudates had seeped from the wounds onto the cloth. But if it wasn’t washed (see above for ‘crucifixion’ flows), then where is all the mess? 6) The serum. The bloodstains are certainly not surrounded by neat rings of serum under UV light. One prong of the wrist stain has a kind of halo, the spear wound has a rim, and there is an interesting pattern on the big foot stain. Much of the blood is completely without serum. 7) The Oviedo cloth, to be sure, is not inconsistent with a seriously injured head. In fact it is so heavily marked it is not inconsistent with almost any assembly of serious head wounds. To claim it is a perfect match of blood and fluid stains is wholly unjustified. I could go on, but these will be enough, I hope, to encourage people who might otherwise have swallowed Jones’s article whole at least to go back to a photo of the shroud (not that absurdly miscaptioned image which graces Jones’s posting) and see for themselves whether these inconsistencies don’t need answering..","date":"2013-02-18","mins":"10:02 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","title":"Stephen Jones’ New Posting on the Bloodstains"},{"id":"comment-26551","author":"hugh_farey","post":"Yes, I thought there’d be repercussions. Daveb is, of course, eminently sensible, but Ron – if my style of argument is wrong, don’t fall into the trap of using it yourself. My figure of 100 000 crucifixions was based on 1 per day (for 200 years), which I think is a fairly mild assumption, plus, according to Josephus, 500 a day during rebellions. Is that unreasonable? Upon what do you base your “Maybe only 5000 were crucified during the whole period, for all we know” come from? That’s only 10 days rebellions’ worth. Next. You “would assume the taking down of the bodies and proper burial were NOT honoured” when Josephus specifically mentions that they were. Next: “Chances are spearing was a rare and unusual practice.” Now I’m guessing, I admit, but it’s a lot harder to smash a wooden beam against somebody’s legs than to run a spear into their heart. If a crucifixion victim were clearly already dead, the token stab with a spear seems an eminently more efficient guarantee of death than going to the trouble of breaking his legs. What makes you think spearing was rare and unusual? Next: “the excessive scourging as testified by the shroud.” The bible is quite specific in saying that the scourging was not excessive. Whatever, was excessive scourging rare? According to wikipedia (yes, I know) flagellation was used as a prelude to crucifixion, and at least four Roman authors refer to victims who died of their floggings. Next: “the crown of thorns.” What crown of thorns? The Shroud shows numerous bleedings from the scalp, not a crown of thorns. Instead of mocking a man who claimed to be king, a wreath, cap or helmet of thorns could have been inflicted on any leader of any riot, or a soldier, or anyone else who wore identifying headgear. Finally. Where are all the crucifixion victims’ skeletons? Why has only one turned up? Perhaps they have been found. Crucifixion, it seems, may well have left no damage to the bones, as the nails slid past them. The one heelbone we have with a nail right through it would be a clumsy exception to the rule. The associated armbones are undamaged (although some archaeologists claim slight abrasions to the inside edges, others don’t). Nope, I don’t think my assumptions are extraordinary at all..","date":"2013-03-05","mins":"7:13 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-27071","author":"hugh_farey","post":"Who are you to contest what the experts say? You’re a man with an inquiring mind and an ability to draw conclusions of your own from the evidence. And, judging solely by that passage I used from Josephus, you’re better read in that respect than I am. So don’t just pass on the judgement of experts. I told you how I estimated my 100 000. If you think it’s an overestimate, explain why – using the evidence of others if you like, but not merely parroting their conclusions. If you think there is no way of judging the number crucified, then you have no option but to agree that I might be right, and neither has anybody else. The spearing, the cap of thorns? Does anyone have more knowledge than you? (Or I?) Who are these experts? What is their evidence? As far as I know there is very little evidence about crucifixion at all, and even less about 1st century Judea. If I’m wrong, by all means show me where..","date":"2013-03-11","mins":"9:14 am","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-26535","author":"hugh_farey","post":"Ho hum, well, we covered this a little while ago. Look at all the comments to January 25, 2013 “Eric J. Jumper to Speak on the Shroud of Turin.” Briefly: Suppose a new Carbon test of the Shroud dates as 30 AD plus or minus 100 years, and it is demonstrably the shroud of a crucified man. To within an order of magnitude some 100 000 people were crucified in Judea at that time. One of them was Jesus. Our shroud has: marks of the crucifixion – so would all the others marks of carrying his cross – so would all the others dust from the streets – so would all the others unbroken legs and a spear wound – as might 25% of the others marks of a flogging – as might 5% of the others marks of a helmet of thorns – as might 1% of the others That gives about a dozen shrouds which could have had similar marks to ours. Or more. The fact that Jesus later achieved a fame that none of the others managed cannot be automatically connected to the preservation of his shroud. No doubt lots of other crucifixion victims had devoted friends and relations. The accumulation of facts turns out not to be overwhelming at all. A nice balance, tipping, if you like, in favour of an identification with Christ, but overwhelming? I think not. Even in the United States, I think I could instill ‘reasonable doubt’ into a jury..","date":"2013-03-05","mins":"2:37 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-25814","author":"hugh_farey","post":"Which came first, the blood or the image? Without contradicting Heller and Adler’s findings, there is another consideration. The image, it must be remembered, is confined to the topmost fibres of the topmost threads. A random collection of fibres from the image areas of the shroud might consist of 5 per cent with “image” on them. The blood (or at least the serum, as most of the red blood has worn off) covered all the surface, has seeped into the cloth and emerged the other side. A random collection of fibres from a bloodstain might consist of 90 per cent with “blood” on them. Over the years, it is clear from photos that the upper surfaces of the threads (where the image is) have been almost completely denuded of red blood, which is confined to little crystals and concretions mainly in the interstices between threads, and one might speculate that most of the serum from those locations has also been rubbed or crumbled away. It is thus deduced that, in most of the areas where there is “blood,” there never was any “image,” and in most of the areas where there is “image,” the blood, if it was ever there at all, has been eroded away. In short, whether the blood arrived before or after the image, I would expect hardly any sample tested with protease to reveal any image underneath it. I do not know how many fibres Heller and Adler tested with protease, but unless they had clearly “image free” results from well over 100 samples, their results do not demonstrate that the blood preceded the image..","date":"2013-02-27","mins":"9:25 am","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-25971","author":"hugh_farey","post":"The “blood areas” consist of many interwoven threads. Nearly all the fibres of all threads were soaked in serum. The “image areas” also consist of many interwoven threads. Very few of the fibres of these threads are marked with image. Imagine, for a moment, that there is image under the bloodstains. When a number of fibres from the bloodstains are removed with sticky tape, they are nearly all covered in serum, but very few are marked with image. I estimate 95% of the fibres testing positive for blood would show no image underneath, even if they came from an image area. Unless about 100 fibres were tested from each area, and not one of them showed image underneath, we cannot claim that the blood preceded the image on the shroud. How many fibres were tested? I don’t know..","date":"2013-02-28","mins":"7:56 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-25829","author":"hugh_farey","post":"There may be good circumstantial reasons for deciding that the blood preceded the image – I don’t dispute that for a moment, but they are outside my field. I merely point out that the absence of image on fibres which show a reaction with protease does nothing to substantiate them..","date":"2013-02-27","mins":"1:14 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-26111","author":"hugh_farey","post":"Thanks, Thibault, at least you understand my idea, even if you disagree with it. And maybe your 50% of expected “corroded fibres under the bloodstains” is closer to the truth than my 5%. Anoxie was quite right in remarking that I was speculating. Do you know how many fibres were tested? However… In my first comment (34 above) I noted that on any blood stain, the blood on the surface fibres (where the image is) has almost completely eroded away, leaving encrustations and concretions mostly in the interstices of the threads (where there is no image). I cannot say if the serum has also rubbed away, but if it has, then any blood/image coincidence would become less common than your 50%, and more like my 5%. So, I take your suggestion that “of 20 threads, 10 should be corroded,” and return it with “of 20 threads, 5 should be corroded” (which is a big concession on my part). But do you know how many fibres were tested and examined? Was it 20? Or 5?.","date":"2013-03-01","mins":"6:03 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-26183","author":"hugh_farey","post":"Well I certainly agree more investigation would be a good thing. Kelly, there are a couple of frontside/backside pictures on the internet (at shroud.wikispaces.com/PROPERTIES), which I have superimposed, and then slid an opacity filter up and down to compare the two. As far as I can see (I’m working off full length images), there is no difference in the colour of the blood stains; they are just smaller on the back..","date":"2013-03-02","mins":"4:12 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-212284","author":"hugh_farey","post":"The controversy about the washing of the blood plays into the hands of those for whom the similarity in consistency and patterning of the various trickles is evidence that the blood was applied to the image after it had been made. The blood trickles down the arms are clearly not post mortem dribbles, and have equally clearly not been washed off. On the other hand the precise indications of the scourge marks suggest that the mass of blood which covered the back and chest of the man was indeed washed off. The various dribbles down the hair, brow and spear wound, all with very similar zigzags and widths, are also somewhat contradictory from a washing point of view. I note that Stephen includes a photograph of an entirely speculative flagrum, made specifically so that its leaden weights match the marks on the Shroud, and captions it: “A Roman flagrum excavated from Herculaneum.” He must know that this is transparent nonsense..","date":"2015-10-11","mins":"6:31 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212502","author":"hugh_farey","post":"I do not believe the trickles down the arms can possibly be post mortem flows. After the death of the victim, the draining of blood downwards, and the clotting of the smaller blood vessels, prevents any flow out of an upwardly directed arm. If the arm is not upwardly directed, but pointing in any other direction, then any blood seeping out would drip straight off the arm or downwards over the fingers. If the blood pressure was low and the blood viscous even during life, there is zero possibility of anything emerging from an arm elevated at any appreciable angle. His own experiment, with an arm horizontal, produced such a tiny amount of blood after four hours than even if he had tipped the arm upwards it would not have trickled down it at all. Zugibe was wrong. Yup. With all those years of experience, he was, quite simply, wrong. Wouldn’t you agree?.","date":"2015-10-14","mins":"4:34 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212335","author":"hugh_farey","post":"It’s not impossible, Thomas, and has been considered from time to time. Even Walter Mc Crone thought the blood could have been touched up. Dyed in the wool authenticists will cling to the evidence that there is no image under the blood, so that all the blood must have arrived first, but it’s not terribly strong..","date":"2015-10-12","mins":"1:39 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212341","author":"hugh_farey","post":"On the contrary, es muy fácil. A teat pipette and a small lancet are quite sufficient to acquire and dribble the required blood wherever required; along the arms, down the hair and brow, big splodges for the hand, feet and side, and maybe a dabbing with a stencil of sponge, like a potato print, for the scourge wounds. Bloodletting of half a litre or so was a common medical procedure throughout the medieval period, so getting someone to lose a few teaspoons full was not a problem..","date":"2015-10-12","mins":"4:12 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212285","author":"hugh_farey","post":"And while I’m at it, Stephen’s ‘installments’ are what I would call ‘updates and enlargements’. Readers must not get the impression that there are ten parts to Stephen’s reply to his correspondent Daryl, as they will waste their time trying to look for them. There are in fact three: “Why would Jesus have violated the 2nd commandment regarding religious images” (28 Sept 2015) “Wasn’t Jesus wrapped like a mummy like Lazarus?” (29 Sept 2015) “Wasn’t Jesus’ body washed before putting it in the grave” (30 Sept 2015).","date":"2015-10-11","mins":"6:45 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212372","author":"hugh_farey","post":"Bit of vermillion? Bit of madder? Bit of iron oxide? Plenty of choices….","date":"2015-10-12","mins":"10:13 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212369","author":"hugh_farey","post":"Daveb’s post is a perfect example of what I described above as “a speculative extrapolation given spurious authority simply by being repeated, unquestioned, for decades.” Starting with the microscopical particle/s found on the foot, which I do not dispute, readers will note that there is no reliable source for dirt being found on a knee or the nose. Pellicori’s magazine article (1981) includes the words: “The nose area might also contain dirt or residual skin material.” This is not based on his own researches – his scientific papers contain no reference to dirt – but on speculative observation of Mark Evans’ micrographs. He does not mention the knee. John Klotz’s dependence on Heller is unsatisfactory. Here is a paraphrase of Heller’s account. Roger and Marty Gilbert dealt with reflectance spectroscopy. After measuring the background, they began at the foot and worked their way up the the body to obtain spectra. The heel spectrum was totally different from the others. When the Gilberts reached the knee, Sam Pellicori was called in to look at the foot area under the macroscope and found dirt. Actually, of course, the heel spectra look very little different from any other image spectra except in intensity, as can clearly be seen in their paper, and they never “moved slowly up the leg” or did any spectrographic tests on either knee. As they show, clearly, in their paper. So, back to my initial point. There is no evidence for dirt anywhere than on the foot, and precious little of that. See this blog’s “So Maybe it is a Painting After All” from 24 September 2014 for more details. Of course, I could be wrong, but please, gentlemen, Primary Sources, not oft repeated speculation, if you’d be so kind..","date":"2015-10-12","mins":"10:11 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212319","author":"hugh_farey","post":"The trickles down the arms are not consistent with Zugibe’s hypothesis. His very feeble post mortem ooze photograph from a wrist is also less than convincing. Hasty semi washing does seem the best bet, but has problems of its own. As for the dirt, Jones is, as ever, reliant on secondary sources which confirm his pre conceived pro authenticity commitment, and it is not always easy to find out where the original findings came from. Jones references Mark Antonacci, who mentions dirt on the knee several times, but I cannot find his primary source. Jones particularly mentions the left knee, and it perhaps significant that no tape samples were taken from either the left knee or the nose. The Gilberts did sample the heel and the nose, but neither knee, and they made no reference to any alleged dirt in their paper on their work, and none of their spectra show anything unusual. In Ray Schneider’s “Enduring Mystery” lecture series, part 2 slide 35 says: “STURP detects spectral responses of dirt on the Feet, Nose and Knee of the man in the Shroud” under the heading “STURP team Examines X ray Radiography.” However Mottern, London and Morris do not mention any of this in their paper. I, too, would like to know if this is anything more than a speculative extrapolation given spurious authority simply by being repeated, unquestioned, for decades..","date":"2015-10-11","mins":"5:54 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212397","author":"hugh_farey","post":"Yes, Thibault. Zugibe says that the body was washed. It is not possible that the trickles down the arms were post mortem issues, and they were clearly not washed. Zugibe is anxious to show that the bloodflows from the wrist and spear wounds were post mortem, but his illustration, of a tiny drip of blood taking four hours to emerge from a cadaveric wrist, is hardly justification of that. If we are to have a clean back and torso, but maintain the trickles down the arms, then a very partial wash seems to be the best explanation – or possibly a rain storm, as I first mentioned two years ago..","date":"2015-10-12","mins":"5:41 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-188841","author":"hugh_farey","post":"It looks to me as if the man with the pincers is cutting Jesus’s hamstring. I have tried to find some biblical allusion to such a possibility without success. There may have been a local tradition for such a thing, or might it be connected with the visions of Fatima? Incidentally, a quick trawl through the plaques on the other altars of the Rosary shows that in both the Crucifixion and the Resurrection scenes, the nail wounds are clearly in the wrists, so that might be some reference to the Shroud..","date":"2015-02-03","mins":"1:07 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188882","author":"hugh_farey","post":"Yes; it was a bit of a long shot. I’m not suggesting that Jesus actually did have his hamstring cut, but was looking for a quotation along the lines of “he was crippled for our sins” or some such in the Old Testament. Didn’t find anything, so I thought I’d throw the idea open to the house, as it were. There is some sort of tradition that Jesus was at least lame, if not completely crippled, I believe. I don’t accept a single word of any of Max’s linguistic jiggery pokery, so was looking for a more sensible explanation for the pincers, which I don’t think is nonsensical, even if nothing comes of it. It may be, as Daveb suggests, that the pincers are simply aspects of meanness, or possibly the instruments of the passion are deliberately dispersed among the sorrowful mysteries. The man on the other side of the pincers wielder seems to be holding the hyssop stick, and there is a man who looks as if he is about to spear Christ’s side in the picture of the crowning of thorns. The hammer and nails appear in the crucifixion scene..","date":"2015-02-03","mins":"4:09 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-189307","author":"hugh_farey","post":"No. While surely nobody can doubt Max’s ingenious talent for creating linguistic and artistic connections and relationships between almost any collection of artefacts, there is no obligation on anybody to suppose that these same connections were made by the creators of the artefacts themselves. This applies to the curious pincers above, to the curious circles in the Pray codex, and various other apparent anomalies that have cropped up on shroudstory from time to time.That fact the curve of a pincer looks a bit like a letter S does not mean that the artist meant it to refer to the word Sudario, and I don’t believe he did, and nor, in spite of all the peroration above, is there any evidence that he did. Max’s contempt for the steganocryptoarcheopanjandrological abilities for everybody except himself is tiresome, but in fact it works against his arguments. The chances of any artist being as clever as Max are, to my mind, zero. I don’t believe Martin de Brito had any such things in his mind, nor his supposed medieval Benedictine monk, nor any of the other poor toilers in the real world producing pictures with aspects which are not immediately apparent. Of course they must have had some reasons, but I don’t think Max necessarily gets any closer to them than anybody else. Apart from a general cultural awareness by 1950 of the pathological details of the image on the shroud, I agree with Colin that there are no grounds for supposing that de Brito had the Shroud in mind at all when he created his sculptures for Fatima..","date":"2015-02-05","mins":"5:48 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187271","author":"hugh_farey","post":"Daveb and his sainted pathologists are indeed powerful arguments, but I do wish they were alive to be questioned about aspects of their conviction that I don’t feel able to share. I wonder there are any living pathologists of similar eminence who are interested in the Shroud..","date":"2015-01-29","mins":"2:24 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187298","author":"hugh_farey","post":"“The Shroud is pathologically flawless.” Well sadly that is one of the opinions I find difficult to share. As for bilirubin, you can buy it, in little jars; it’s orange, or yellow – hence jaundice. How anyone can pretend that the pink colour of the shroud blood has anything to do with it is another of the mysteries I would like to resolve. However, I do have a little sachet of red madder, whose stain matches it precisely. Then there’s that curious spike in the reflectance spectrum at about 610nm….","date":"2015-01-29","mins":"4:31 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187529","author":"hugh_farey","post":"Thank you gentlemen. Yes, Thibault. If I mix brown paint and orange paint I do not get red, only, as you might expect, orangy brown. I do not know why mixing any other similarly coloured chemicals should give anything different. And no, I do not think that red madder accounts for all the characteristics of the blood stains. I am inclined to believe that they are blood, but that red madder was added to make them a bit more ‘bloodlike’ when the original faded or was eroded away. And ah, the reflectance spectrum. This was more or less where I joined shroudstory a couple of years ago. Look up “Today’s How do we know? The image is not painted” which occurred or 21 October 2013 and you’ll see the reflectance spectrum, my observations and your own reply. And thank you, OK, for your list of pathologists. I have written to those whose contact details I could find..","date":"2015-01-30","mins":"6:28 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187820","author":"hugh_farey","post":"I think the point about the cobalt blue was that after washing the cloth you could easily see that the pigment was completely removed (at least as far as the eye could see; no doubt there were flakes slotted away in various interstices) so that the image was demonstratedly only due to the acidic discolouration of the flax fibres. Had be used red ochre, it would not have been so obvious..","date":"2015-01-31","mins":"2:48 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-137711","author":"hugh_farey","post":"Interesting papers, although I think Power misses an important point. He is presumably assuming collimated radiation, when he looks for wavelengths that are attenuated by air. He has not considered radiation from a point source on a spherical wave front. In that case, the intensity of any radiation is attenuated by distance. Of course, the possibility of producing an image in such a case (when every point on the shroud receives radiation from numerous points on the body) is much reduced…..","date":"2014-07-13","mins":"2:12 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138090","author":"hugh_farey","post":"I’m getting lost here. It seems to me that the fingers of the hand which produced the image were in contact with one another so that there were no ‘gaps’ between them. I don’t think anoxie and Colin are in disagreement here? But the fingers appears well defined on the shroud. The fact that the fingers appear distinct on the shroud may be because: a) Some form of collimated radiation or gas emission which attenuated with distance was responsible for the image. B) The whole hand was in contact with the cloth, but there was more pressure on the ridges of the fingers than in the troughs between them, and the image density depends on pressure. If the image of the fingers does not depend either on the distance of the body from the cloth or on the relative pressure of the cloth in contact with the body, or a mixture of the two, then is anything else suggested?.","date":"2014-07-14","mins":"8:52 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138093","author":"hugh_farey","post":"Ps. What does everybody mean by ‘tenting’? In some cases it seems to mean that a cloth draped across an uneven surface sometimes does not follow the surface precisely, but hanging between two prominences does not make contact with the ‘valley’ beneath. Is that it? However, I think there is another draping effect which may also be called tenting. If a two dimensional cloth is draped over a three dimensional surface, then it buckles, producing whole ridges of cloth which do not hang, but stick up (like tents?) away from the surface. Draping a cloth over a uniformly painted ball, for example, results in several V shaped areas of non contact non colouration. We do not see any of this on the shroud. Has anybody addressed this?.","date":"2014-07-14","mins":"9:02 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137681","author":"hugh_farey","post":"Colin’s question brings up a fundamental issue that those who hope that natural processes from a dead body could be responsible for the shroud have to address. It is observed that there is an intensity/distance correlation, and assumed that this implies a distance/effector relationship, where the effector is some kind of radiation or vapour transfer. For this to work, it mst be assumed that the body itself is entirely homogenous in structure, so that there is no variation in effector intensity at its surface, whether it be skin, blood, hair, fingernail or teeth, and whether the underlying structure be fatty, bony, muscly or whatever. If, for example, the image is taken to be a result of some form of heat radiation, if would have to be assumed that the extremities of the body (hands and feet) did not emit less radiation than the core (chest and abdomen), or the distance/intensity relationship would fall down. If, of course, the body were indeed entirely homogenous in structure, such as a bas relief or similar, then heating it, or smearing it with some gas emitting chemical, would produce minimum surface emittor variation, and a much more regular distance/effector, and thus distance/intensity, correlation..","date":"2014-07-13","mins":"12:30 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"}]
