[{"id":"comment-86911","author":"hugh_farey","post":"… or a conspiracy by the Catholic Church to remove marks which clearly demonstrated the more obvious signs of fakery … (Fantastic fraud theories work in both directions, it seems…).","date":"2014-03-10","mins":"8:09 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-87079","author":"hugh_farey","post":"Hi, Clublu and welcome to the blog. Many of the aspects of the shroud get discussed quite frequently, and you can find out what’s been going on by hunting through the Categories on the right hand side. The ‘blood first’ theory is one of them. If the image is that of a dead body, then there is an a priori assumption that the blood oozed, seeped or blotted itself onto the shroud first, and the image was formed (by some process as yet unknown) afterwards. If, on the other hand, the image is artificial, then there is an a priori assumption that the image would be applied first, and then the blood. However, actual studies of the shroud are inconclusive. Although most of the bloodstains have eroded away to the point of a few encrustations clinging to the interstices of threads, the material underneath them, even in relatively dark image areas, does not seem noticably paler. Some commenters have claimed that this discolouration is due to blood serum though, not to pre existing image. Alan Adler concluded that the image was due to chemical corrosion or degradation of the surface of the fibres, and claimed that the surface of image bearing fibres was corroded, while the surface of non image bearing fibres and the surface of fibres under bloodstains, was not. However his microscope photos are far from clear, and the evidence is not as conclusive as he may have hoped. Ray Rogers, on the other hand, eventually claimed that the image was not made of degraded fibres at all, but on a thin coating on top, in which case Adler was wrong about the degradation altogether, and the blood fibres should have the same coating as the rest of the shroud, just not discoloured. If the image is artificial, and formed by some sort of contact with a model or bas relief, either covered with a colourant or heated to make a scorch, then it is possible that blood was applied not to the shroud but to the model, in which case the blood would obscure the image making process, so that even artificially made, the blood could have preceded or at least occluded the image. As for the account of the Abbess of Sainte Claire, well, I’m just not sure. The book from which this was taken was written 350 years after the event. I should like to know the source of both this account and the one about the fire itself, with all its details about the blacksmith Guillaume Pussod and the famous drop of silver. And who translated it it, somewhat clumsily, into English? There are a number of anomalies I find difficult to accept as read. What is one to make of the abbess’s very precise description of the marks of the scourging: “the bruises and the scourge blows on the stomach are so thick that a pin head large zone free from blows could hardly be found.” Strange that she should focus on the stomach (twice), which is almost free of scourge marks, rather than the chest which is covered in them. Then we have: “In the middle of the body, you can notice the signs of the iron chain tying him to the column so tightly that he appears all stained with blood.” Finally, after fifteen days of painstaking effort by four carefully chosen nuns, we were left with a set of the clumsiest and most ill fitting patches it is possible to conceive of, only four of the sixteen large holes being completely covered..","date":"2014-03-10","mins":"6:25 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-87338","author":"hugh_farey","post":"1 Adler came to his ‘blood first’ hypothesis by observing the corrosion on the surface of the fibres, which he thought increased in proportion to the darkness of the image, and did not exist on non image fibres, nor on ‘blood stain’ fibres. As far as I know Rogers did not independently corroborate this, and indeed, it directly contradicts his own subsequent decision that the fibres themselves were not affected by the image formation, which formed entirely on a purported “surface coating.’ I can’t find a reference to Bollone’s opinion on the subject; can you supply one for me? 2 I suppose it depends how much the template is heated. I wasn’t suggesting blood was dripped onto an incandescent sheet. However I agree that a warm statue would take a very long time to make much impact on a cloth. Actually, I was thinking more of a paint in a slightly acidic medium, and blood dripped onto that, and the cloth placed on top. 3 I have now found the original 1891 book! It’s very interesting, but will take a while for me to be sure I have correctly translated the French. 4 Nuns in general were often renowned for their exquisite sewing – after all they had little else to do – and this team was personally selected to do the job. There is something very odd about what they actually produced. The rigor mortis discussion is another interesting one on philosophical rather than scientific grounds. For most of the shroud’s history the body has been described as perfect in every way, and only when critics began to point out irregularities was it necessary to try to explain them, either in terms of distortion of the body on a flat surface (rigor mortis) or conformity of the body to a contoured surface (such as a pillow of some kind), or the distortion due to the way the shroud was draped over the body, or some combination of all of these. Again, it used to be said that it was impossible for a painter to achieve such stunning anatomical accuracy – now it turns out the body isn’t that anatomically accurate after all, and so maybe a painter got bits of it wrong. For what my unsubstantiated opinion is worth, I am not keen on either the body or the statue, or even the bas relief. I think I’m plumping for a thick acidic paint at the moment, as thick as toothpaste, which would not seep through the cloth but would damage the topmost fibres of the threads. However, I wouldn’t put money myself on this hypothesis yet, so don’t push me for details!.","date":"2014-03-11","mins":"8:28 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-87378","author":"hugh_farey","post":"Garlaschelli did indeed use an acidic paint, and his results were interesting but inconclusive. I should like to pursue his mechanisms a little more systematically. Thibault was quite correct in his specific criticisms, but even he was impressed by many of the characteristics of the “acid burnt” image..","date":"2014-03-11","mins":"11:46 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-86961","author":"hugh_farey","post":"It has been suggested that the shroud was modelled from a life size crucifix figure, whose arms had to be broken off to place them in the position we see them, so the shoulders were clearly not attached to the arms. The carefully placed burn holes destroyed this evidence. While I have little time for that particular hypothesis, the story of the 1532 fire is fraught with inconsistencies which (rather like the irregularities surrounding the taking of the C 14 samples, to be fair) open the door to legitimate doubts about the conventional understanding of the event..","date":"2014-03-10","mins":"11:38 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-21726","author":"hugh_farey","post":"That would be a most interesting paper to read (although I can’t find it on the internet) and I look forward to your book. Did you use similar photographic enhancement techniques to the ones currently being carried out on the shroud to assist in your identifications?.","date":"2013-01-07","mins":"6:59 pm","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21662","author":"hugh_farey","post":"What would be good, from the point of view of an unconvinced bystander, is for a professional numismatist/paleo whatever, to give us an example of some other situation in which the identification of difficult to see images in one photo were indisputably verified by subsequent events. I can think of Google Earth images of Roman forts in the Egyptian desert, and of Roman ports now underwater, which on exploration were indeed there, but in those cases the original images were pretty unequivocal in the first place. Identifying archeological remains in the colour of growing crops is perhaps another example, but all these are rather large scale. Can anyone give any example of the discovery of coins or other small artefacts achieved by enhancing photos which were at first view unpromising?.","date":"2013-01-06","mins":"2:11 pm","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"}]
