[{"id":"comment-206254","author":"hugh_farey","post":"I think there are two points here, namely how ‘expensive and rare’ the Shroud material is, and whether a ‘forger’ would be bothered to acquire it. I think the first must not be over hyped. It is undoubtedly true that the weave of the Shroud is extraordinarily rare, in the sense that there are vanishingly few examples of it in any century, 14th, 1st or 21st, and that it requires a four heddle loom, which is a more complicated piece of equipment than a one heddle loom. However, having set the warp threads up in the heddles, the actual manufacture of the cloth is a relatively simple and tediously repetitive affair. There are dozens of examples of more complicated weaves from before and after the 14th century involving elaborate diamond patterns that required considerably more skill. So, more expensive than ‘normal’ cloth, certainly, but not fabulously extravagant. The second point depends on what the ‘forger’ was trying to do. As a 14th century artefact, the Shroud was manufactured towards the end of the great Byzantine relics craze, and most of the alleged remnants of the time of Christ, from the manger to the cross, were already well established. The chances of an adventitious painter persuading the Dean of Lirey to try to pass off a quick monocrome brass rubbing as holy relic are, I suspect, small, and I do not think that was the Shroud’s route to fame. It is far more likely that it was made for a liturgical purpose, almost certainly connected with Easter, and acquired its relic status fortuitously. That’s why I have kept the word ‘forger’ in quotes – I do not think the Shroud was necessarily originally meant to deceive people into thinking it was authentic. And if it were created for a liturgical purpose, then selecting a rich and rare material does not seem unlikely..","date":"2015-07-21","mins":"3:31 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","title":"A Rare Piece of Cloth"},{"id":"comment-206259","author":"hugh_farey","post":"In principle yes, although there are a number of points about which we disagree, particularly concerning the appearance of the shroud when it was first displayed, and others about which I do not think we can be as certain as Charles appears to be..","date":"2015-07-21","mins":"4:27 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","title":"A Rare Piece of Cloth"},{"id":"comment-206262","author":"hugh_farey","post":"That’s fair enough. We don’t know how the Dean of Lirey acquired his Shroud. Accepted wisdom is that it was a de Charney or de Vergy possession, alhough d’Arcis does not mention them. Either way, there is a mystery about the Shroud’s whereabouts between the Sack of Constantinople (1204) and 1355. If it was an artefact, it had plenty of time to transmute into relic even if it were made at the end of the 13th century..","date":"2015-07-21","mins":"5:56 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","title":"A Rare Piece of Cloth"},{"id":"comment-2983","author":"hugh_farey","post":"This is getting quite exciting! Also see http://blogs.getty.edu/iris/meet the artist who helped launch the renaissance in florence/ for some scourge marks as well. Where is your Lawrence from, and more importantly when? I can’t find it elsewhere..","date":"2014-02-11","mins":"11:00 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/11/a-revised-flow-chart-model-for-why-the-turin-shroud-was-first-documented-in-14th-century-france/","cat":"2000_year_old_earthquake","title":"A revised flow-chart model for why the Turin Shroud was first documented in 14th century France."},{"id":"comment-207908","author":"hugh_farey","post":"“Guscin seems to do exactly the opposite…” No, he doesn’t. He gives all the sources a fair run for their money, but clearly does not identify the Image of Edessa with the Shroud of Turin himself. However, it is apparent that there are some accounts that suggest that the Mandylion was a relic of the passion, and that Yannick’s “NEVER” is unjustified. It must be remembered that this paper is a doctoral thesis, not a political manifesto..","date":"2015-08-10","mins":"5:11 pm","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-207945","author":"hugh_farey","post":"Working for the FBI is not necessarily a qualification in archaeology or art history, and Guscin’s description of Dayvault’s article as “unscholarly” is correct. Dayvault’s ‘discovery’ is without any provenance or any other confirmation, and nobody seems to have followed up his discovery. It would be strange indeed for a museum which currently boasts of holding the oldest lifesize human statue in the world did not also rejoice in holding one of the most ancient depictions of Jesus, but nothing similar appears on its website or in any reference to it. Still, as Louis says, there’s nothing wrong in asking for help, and it may have been forthcoming, as ‘The Keramion, Lost and Found: A Journey to the Face of God’ by Dayvault is due to be published early next year..","date":"2015-08-11","mins":"3:52 am","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-102070","author":"hugh_farey","post":"No, Elvish is there; it’s called Quenya..","date":"2014-04-21","mins":"5:18 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-20097","author":"hugh_farey","post":"What kind of examination of the shroud was made in 1933, and is there a formal record of it? Rinaldi quotes Dr Arthur S. Barnes: “The threads themselves are stained more or less throughout, so that the same figures, fainter in coloring but otherwise identical, appear on the other side.” How did he know? There is also mention of a “microscopic examination.” This is news to me, and I wonder what other discoveries were made at the same time..","date":"2012-12-09","mins":"10:50 am","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","title":"An Early Christmas Present from John Klotz"},{"id":"comment-210892","author":"hugh_farey","post":"I agree that the strip is a real mystery, but still think cutting the cloth in two and hemming the cut edges is so much more sensible, and elegant, than having a seam down the cloth, that I don’t think that would have happened. Perhaps, just as the weave is apparently unique, the seam is unique as well..","date":"2015-09-21","mins":"5:10 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-210870","author":"hugh_farey","post":"Stephen’s argument goes like this: 1) The side strip appears to have originally been part of the Shroud, cut off and resewn. 2) This could have been because a strip from within the sheet was taken out, and the edges resewn together, in order for the finished cloth to have a selvedge on each side. 3) The cloth could have been woven on a 3m loom, and a strip about 2m wide removed. 4) The ancient Egyptians had looms 3m wide, and medieval weavers didn’t. 5) This proves that the Shroud is authentic. Apart from No.1, none of these statements bears any scrutiny, and the conclusion is tenuous in the extreme. As usual, Stephen relies almost exclusively on secondary sources, so it is difficult to track down the truth of any of his references, but here we go. Point 2. With the greatest respect to Mme Flury Lemberg, I do not go along with the selvedge argument at all. The ancient Egyptians, 1st century Palestinians, and medieval weavers were quite capable of producing cloths of various widths, with selvedges both sides. If you wanted a 110cm width of cloth, you made a 110cm width of cloth, you didn’t get a 3m width of cloth and cut a strip off it or out of it. The only reason for such an action would be if you wanted a 110cm strip of cloth, and the only one available was a 3m wide one. However, if this was the case, you’d be in a hurry, and surely not bothered about matching the selvedges, especially if it meant putting in an ugly seam all the way down the cloth. You would cut the cloth to the required width and hem the edge, so there was no ugly seam down the length of the cloth. This would be more attractive to look at and easier to do, than cutting out a strip and resewing the edges, giving you the seam down the middle. Furthermore, all you would need to do to the remaining cloth would be to hem the single cut edge, rather than having to hem both cut edges as in Flury Lemberg’s scenario. I’m afraid I think her idea very far fetched, and would need evidence that it was a common practice, or even a rare one, before I gave it credence. Points 3 and 4. Even if the strip removal thing were granted, the cloth from which it was removed was not necessarily originally 3m wide with 1.9m removed. It could have been 2m wide and a 90cm strip removed. Although I do not know about how wide medieval looms could be, they certainly had them at least 2m wide. Viking looms are described as “typically” 2m wide. Point 5. The fact that the Shroud could possibly have been woven originally 3m wide, had a 10cm strip, followed by a 190cm strip cut off, and then the 10cm strip sewn back on, does not mean that this scenario is at all likely, let alone proof of anything. While we’re at it, few of the rest of Stephen’s facts bear much scrutiny either. The dimensions of the Shroud equate to “8 x 2 Assyrian cubits, the standard unit of measurement in Jesus’ time, even among the Jews.” There is no evidence for this at all, and some to the contrary. “The reason for such wide looms was to produce the tunica inconsutilis, or seamless tunic, which was particularly fashionable in the Roman period.” I do not know about Roman fashions, but unless a tunic is woven as a tube, or consists of nothing more than a long thin sheet with a hole in it, it has to have at least one seam to hold the sides, or one side, together. If, as I suspect, the word seamless means that it was woven from just one piece of cloth (which may have had seams at the sides), then a strip about 14 ft long and 3 ft wide would be about right, but this would not be a 3 ft length cut from a piece of material 17 ft wide, it would be a 14 ft length cut from a piece of cloth 3 ft wide. I do not think the wide Egyptian loom had anything to do with the Roman tunica inconsutilis. Is there any evidence for this? “The unusual stitching, binding and finishing of the selvedges is, like the stitching of the seam joining the sidestrip to the main body of the Shroud, known only from the first century Jewish fortress of Masada.” This statement is a familiar misinterpretation of Flury Lemberg’s opinion that the stitching at Masada means that the Shroud could have been contemporaneous, not that the stitching is not known anywhere else, or that it must have been. Curiously, although Stephen professes not to read this blog, I’ll bet a pound to a penny that a diatribe against me in response to this comment will appear on his blog within the next 24 hours… (4.41pm UK time).","date":"2015-09-21","mins":"10:42 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-43489","author":"hugh_farey","post":"Part 3 of the article introduced me to ivory carvings for the first time. I had not seen either the 11th century Lamentation from Schiller’s book (not naked, arms by sides, 5 fingers), or the 12th century Lamentation from the Victoria & Albert Museum (naked, arms crossed, 4 fingers). These spurred me on to find the 13th century Lamentation in the Metropolitan Museum of Art (not naked, arms by sides, 5 fingers). There is also a fascinating diptych on christusrex.org showing the tomb with quatrefoil holes in it. I agree with daveb, I think, in that I don’t really mind what ideas a site promulgates, however fanatically anti or pro. It is the evidence it adduces, particularly if I haven’t seen it before that interests me..","date":"2013-09-09","mins":"12:59 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","title":"Articles on the Shroud’s History"},{"id":"comment-166847","author":"hugh_farey","post":"“Double images are quite common in Byzantine art so that is one starting point.” That’s very interesting, as I don’t think I have come across any. Can you give a few examples?.","date":"2014-10-30","mins":"5:57 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-41723","author":"hugh_farey","post":"Pity you can’t carbon date a stone….","date":"2013-08-21","mins":"12:13 pm","url":"https://shroudstory.com/2013/08/21/by-that-criteria-the-shroud-should-be-worth-billions/","cat":"history","title":"By that criteria the shroud should be worth billions"},{"id":"comment-200596","author":"hugh_farey","post":"Is there any evidence for the Gruyère inheritance? Or that Lirey derives from Le Ray?.","date":"2015-05-30","mins":"8:19 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-200610","author":"hugh_farey","post":"Yes I tried that, but got nowhere. I find your blog site very difficult to work through, and “Orient Forest” does not seem to have any evidence for anything in it. Can you be a bit more specific?.","date":"2015-05-30","mins":"2:36 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-201093","author":"hugh_farey","post":"Why not put some of your evidence here? Your blog is incomprehensible to me..","date":"2015-06-04","mins":"5:11 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-201142","author":"hugh_farey","post":"No, Ray, this won’t do. 1) I don’t believe the name Lirey has anything to do with “Le Ray”. Have you any evidence to suggest that it might? 2) I don’t believe that the Chateau Magny Fouchard was the centre of the Priory de Sion. Have you any evidence to suggest that it might? 3) Ray Sur Saone castle has what looks like a bricked up crosslet loophole high on its tower. I don’t believe it has anything to do with the Shroud. Have you any evidence to suggest that it might? 4) “The wooden Shroud Casket inside is exactly the correct size of the folded Shroud.” According to Ian Wilson, the casket is 14″ x 6.5″ x 10″ high. This is a highly unsuitable size for the folded Shroud, and quite possibly too small altogether. I do not believe it ever held the Shroud. Have you any evidence to suggest that it might? 5) “You cannot deny…..” I can. I do. Have you any evidence to suggest I might be wrong? Please stop directing us to your website. It is extraordinarily cumbersome to navigate, and provides no evidence for any of the things I do not believe..","date":"2015-06-05","mins":"12:49 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-201157","author":"hugh_farey","post":"“It is obvious that Farey has a closed mind.” Farey does not have a closed mind. Farey is open to any evidence for any of his points that Ray can present. Farey wonders why Ray thinks that his evidence would not change Farey’s mind. Does Ray not have much faith in it himself? Farey is sorry that Ray’s website in impenetrable to him, in spite of considerable effort to understand it, and hopes that other commenters on this blog may be able to explain it to him..","date":"2015-06-05","mins":"6:03 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-144662","author":"hugh_farey","post":"Hi David! Good video, although I think the fresco looks more like Johnny Depp than Peter O’Toole (Lawrence of Arabia). In fact, of course, exactly the same effect can be achieved using almost any two full face portraits of anybody at all, so is useless as a diagnostic identification tool. However, it provokes a thought. I have recently returned to my country through an e Passport facial recognition machine, which is able to make fairly reliable identifications of people using only their passport photos and their actual appearance at the booth. Their skin tone, hair length, clothes and other variables do not seem to matter. It would be interesting to try to ‘smuggle’ portraits of Christ, Depp, O’Toole, da Vinci, Durer and various others past such a machine, using the Shroud as their passport photo. I wonder how they’d get on..","date":"2014-08-19","mins":"12:30 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-205116","author":"hugh_farey","post":"The twin edges to depictions of Christ’s tunic are often referred to a couple of creases in the Shroud very visible in some of the Enrie photographs of 1933. However these creases are wholly invisible in the Secondo Pia photos of 1896, and are almost certainly artefacts of the way the shroud was rolled up between the two photographs. Vignon, very wisely, does not mention them..","date":"2015-07-10","mins":"5:41 am","url":"https://shroudstory.com/2015/07/10/byzantine-coins-again/","cat":"history","title":"Byzantine Coins Again"},{"id":"comment-40672","author":"hugh_farey","post":"Well, its new to me. However, the passage goes on: “Seeing this, and being loth that an image of a man should be hung up in Christ’s church contrary to the teaching of the Scriptures, I tore it asunder and advised the custodians of the place to use it as a winding sheet for some poor person.” Doesn’t sound as if he was keen on it, or anything like it, does it?.","date":"2013-08-07","mins":"2:23 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40713","author":"hugh_farey","post":"Barberis’s calculations are as absurd now as they were when they were published. My own estimate of 1 in 10000 is much more likely and has never been refuted..","date":"2013-08-07","mins":"7:32 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40750","author":"hugh_farey","post":"Thanks, OK; a very good site. I’m working through it using Google Translate!.","date":"2013-08-08","mins":"12:00 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-924","author":"hugh_farey","post":"Well spotted! The trouble with a really well explained hypothesis is that you get drawn into it! So, several squandered (but not necessarily wasted) hours later, have you seen the photos of the Lirey badge at http://www.culture.gouv.fr, or http://www.photo.rmn.fr, or (sorry) http://www.sindonology.org, where some details are massively enlarged. I found them by Googling “Lirey Cluny pelerinage” so as to avoid English. Some aspects of your interpretation of your photo will need adjusting, I think, especially the “air hole in the barbecue” and the “bushes around the feet” ideas, which are, at least to me, quite obvious flaws or damages rather than intentional markings. Another thing I’ve noticed is the so called “instruments of the passion” which supposedly fill in the gaps between the shields below the image itself. On the far left and right we have two clearly mismatched poles of some kind, which even your photo suggests are the spear and the scourging pillar. At least one whip is very evident, and the wreath could at least be as easily of thorns as well as laurels. All that’s missing is the nails, which may have been under the box in the bit of the circle that’s broken off. Would the relic, fake or otherwise, of a man roasted on a griddle, have included these symbols? More. Looking at the “chain” I do agree that it looks helical (your word), but still dispute that it looks anything like a chain. More like a thick rope? The stains across the back, and the wriggly bits around the feet (dorsal image) do look a bit like unravelled rope, and suggest to me that whoever made this badge did not make it from direct observation, but from notes, and maybe a sketch, that he took away before making the mould from which the badges were made. As for his figures – well, I don’t know if I could do any better when each is barely an inch long. It’s not clear to me whether these badges were made of liquid tin/lead poured into a mould, or hammered like a coin. One of the websites shows a picture of the back of the medal, which may be indicative, but I don’t know of what! Anyway, it was clearly made in a workshop, and a certain amount of licence (and simple forgetfulness or ignorance) must be allowed for. A less contentious example is the depicted size of the sheet, which is held by two people standing quite close together, an impossibility if it really depicted two life size men. Now that I’ve browsed this entire blog (and I do think it’s excellent, even if reciprocal ad hominem insults don’t, to my mind, enhance the respectability of either antagonist) I gather you’re firmly on the side of the scorch mark hypothesis. For all I know you might be right, but surely to produce the shroud by heating a specially made life size image to near red heat, transfer it to a sheet, wrap the sheet around it and then unwrap it to reveal the scorch (or any variation of procedure that would produce a similar image) would have been quite unnecessarily complicated, in an age when any old wreath of thorny foliage could be, if properly attested, considered the genuine crown of thorns, and any old tunic the genuine robe of Christ? What made pilgrims flock to look at the genuine this or that wasn’t, I think, so much the object itself as the provenance, which also needed to be prominently displayed, preferably covered in big red seals..","date":"2012-10-10","mins":"10:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/24/comparison-of-lirey-badge-cluny-medal-depicting-the-shroud-of-turin-in-the14th-century-with-the-1865-forgeais-drawing-for-open-discussion/","cat":"arthur_forgeais","title":"Comparison of Lirey Badge (Cluny medal)  depicting the Shroud of Turin in the14th century with the 1865 Forgeais drawing – for open discussion"},{"id":"comment-916","author":"hugh_farey","post":"I enjoyed the exploration, but you’re surely clutching at straws here. The single blood “chain” across the back, the double image, the empty tomb – I fear the alternative explanations seem weaker than the shroudie version. I do notice that you spectacularly omit any mention of the herringbone pattern of the background – present in both medal and drawing,,,.","date":"2012-10-09","mins":"9:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/24/comparison-of-lirey-badge-cluny-medal-depicting-the-shroud-of-turin-in-the14th-century-with-the-1865-forgeais-drawing-for-open-discussion/","cat":"arthur_forgeais","title":"Comparison of Lirey Badge (Cluny medal)  depicting the Shroud of Turin in the14th century with the 1865 Forgeais drawing – for open discussion"},{"id":"comment-922","author":"hugh_farey","post":"Ah, my apologies, I did indeed misunderstand you. Moving on, I wonder if you have any ideas about why the shroud is long and thin, with the bodies end on, rather than squarer, with the bodies side by side, as would surely be the case if anyone were wrapped up nowadays. Without having a lot of other shrouds to compare it with, do we know if such a shape was more typical of the 14th than the 1st century, or vice versa?.","date":"2012-10-10","mins":"6:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/24/comparison-of-lirey-badge-cluny-medal-depicting-the-shroud-of-turin-in-the14th-century-with-the-1865-forgeais-drawing-for-open-discussion/","cat":"arthur_forgeais","title":"Comparison of Lirey Badge (Cluny medal)  depicting the Shroud of Turin in the14th century with the 1865 Forgeais drawing – for open discussion"},{"id":"comment-25392","author":"hugh_farey","post":"You do not need a very high temperature to discolour flax fibres. 200 degrees C is more than enough. Guerreschi and Salcito (http://www.shroud.com/pdfs/aldo4.pdf) show a picture of the niche in the wall where the silver reliquary was kept, secured, according to tradition, by an iron grill that needed the attention of a blacksmith before the shroud could be rescued. It is quite high in a wall above an altar, and Guerreschi speculates that the fire started in some combustible material below the niche. We know very little else about it, or how far it spread (to the roof for instance?). Assuming the temperature of the fire managed to reach the melting point of silver at all (which is far from obvious), and assuming that the reliquary was, in fact, made of silver (which is also far from obvious), the niche in the wall was effectively an oven. I do not think it necessary that the inside of the reliquary reached a uniform 900 degrees C, but at least a small part of it must have done, or the silver would not have melted through. Guerreschi demonstrates quite convincingly that the hole in the shroud could not have been made by molten silver, but more likely by a solid, such as a roof panel, fallen in after its fastening (to the rest of the reliquary) had melted or burned away. Remarkably, the water stains associated with the burn holes are extremely minor (nothing like the much bigger patches associated with Guerreschi’s ‘urn event’), and suggest an attempt to quench the heat with as little water as possible, rather than pouring buckets of it over the reliquary and in through the hole. Much important information is lost to us and remains highly speculative, such as how the reliquary (hot or cold) was removed from the chapel, and how the shroud was removed from the (burnt away? badly damaged?) reliquary. However, in view of all the above, it seems to me extraordinary, and verging on incredible, that the temperature inside the reliquary did not get high enough to make any difference to the material of the shroud at all..","date":"2013-02-23","mins":"7:52 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-25555","author":"hugh_farey","post":"Guerreschi’s experiment, which so accurately reproduced the burn patterns on the shroud, was carried out while the cloth was cold. He did not explore the circumstances of the original burn, which reputedly took place while the reliquary was engulfed by fire..","date":"2013-02-24","mins":"6:12 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-25341","author":"hugh_farey","post":"In view of Yannick’s emphasis of the uniformity of the shroud, I wonder if he has anything to say about the great fire of 1532, when the shroud, folded into 32 layers, was subjected to the temperature of molten silver in its reliquary. Is it not remarkable that the outside layers suffered no more discolouration from the heat than the inside layers?.","date":"2013-02-22","mins":"7:43 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-25381","author":"hugh_farey","post":"Isn’t 900 degrees C hot enough? Have you ever heated a cloth to 900 degrees C? I have put cloth samples in an domestic oven at 250 degrees C for ten minutes, and they have been seriously scorched. At more than three times the temperature I think some discolouration would be more than likely, wouldn’t you? Or are you implying that the cloth was not, in fact, in its reliquary, but outside the scope of the fire, and the hot silver was dropped onto it from some other source, producing the temperature gradient you describe?.","date":"2013-02-23","mins":"6:38 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-65692","author":"hugh_farey","post":"OK, what a terrific article! It will take me a while to work through it, but it seems masterly. It does seem to confirm that other shrouds were around though..","date":"2013-12-23","mins":"11:30 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-67636","author":"hugh_farey","post":"Hi David! Its bibilical equivalent would be “rending ones garments.” It refers to a state of such frustrated rage than one is reduced to foaming at the mouth, thrashing about on the floor and biting whatever covers it. Mr Kotz anticipates (probably correctly) that quasi scientific literary constructions involving quantum mechanics (also biophotons, energetics, holograms and magnetism) can reduce real scientists to jibbering incoherence. To avoid losing my chakra completely, I have started on my carpet already….","date":"2013-12-25","mins":"2:59 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-66500","author":"hugh_farey","post":"I have a mouthful of rug already… delicious!.","date":"2013-12-24","mins":"8:31 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-65611","author":"hugh_farey","post":"Matthias, your comment is very pertinent and something I have often wondered about. There are a number of possible answers. So, for a moment, just suppose…. 1) Shrouds are not long and thin. They are roughly the length of a body, and about three times as wide, for ease of wrapping. So why forge a long thin one? a) It was cut from a bolt of old cloth, and easier to keep in one piece than cut and resew. B) It was specifically designed to fit a space (behind an altar, say) which was about 4m long. 2) Most relics are so obviously fake that it seems unnecessary to create such a ‘realistic’ looking one. Why bother? a) It was a question of ‘my shroud has to be better than your shroud,’ and there were plenty of unmarked shrouds already in existence by the 13th century. B) The turn of the 13th/14th century was quite late in the relic craze era, and new ones had to be increasingly realistic to avoid the scrutiny of the Lateran Council. C) The Shroud was originally as obviously fake as any other, but the painting has deteriorated so badly that only a stain produced by its medium remains. 3) The Shroud is unique in all art (apart from art derived directly from it) in showing two images of Christ simultaneously. Why did the forger do that? a) If the dimensions of the cloth were already determined, then one image would be rather small for the cloth. If it lay in in the middle, it would beg the question “where exaclty was Jesus lying?” and if to one side it would look dreadfully unbalanced. If you decided on two, then a front and a back seem the logical design. 4) If I were laying someone out on a long thin shroud, I would keep the spare roll at the feet end, so that it could be peeled back for a last look at the face before leaving the tomb. Why are the shroud figures head to head? a) Because the two heads of Christ would then form the centrepiece, immediately above and behind the tabernacle, and not the two feet ends, which seems a little disrespectful. Does the concept of a fake make any more sense now? As usual, I can’t say that any of the above is true (or even probable), and nor do I want to, but can anybody claim that it is unreasonable?.","date":"2013-12-23","mins":"9:27 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-117219","author":"hugh_farey","post":"Does the order of the list of relics mean anything? If the shroud was the most precious, why is it only ninth in the list, after a number of apparently less prestigious artefacts such as the reed he held instead of a sceptre?.","date":"2014-05-11","mins":"6:46 pm","url":"https://shroudstory.com/2014/05/11/drop-the-alexios-i-komnenos-letter/","cat":"history","title":"Drop the Alexios I Komnenos Letter"},{"id":"comment-117645","author":"hugh_farey","post":"Good answers. So the most precious, most prominent, miraculously created actual image of their God was not the first thing, not even among the top five, that came into their heads. Interesting..","date":"2014-05-12","mins":"5:54 am","url":"https://shroudstory.com/2014/05/11/drop-the-alexios-i-komnenos-letter/","cat":"history","title":"Drop the Alexios I Komnenos Letter"},{"id":"comment-152466","author":"hugh_farey","post":"“It sounds like a human figure like the Shroud of Turin has.” I don’t follow this. The meaning of the passage seems to be that just as Jesus had been in darkness and then returned to light, so the sepulchre had been in darkness and was now exposed to light. There is no suggestion of any actual ‘human figure.’ And yes, vast areas of the sepulchre and its surrounds are covered in marble. The chances that the ‘bench’ underneath is still covered in blood are, I think, rather slim..","date":"2014-09-19","mins":"7:55 am","url":"https://shroudstory.com/2014/09/19/eusebius-on-the-discovery-of-the-holy-sepulchre/","cat":"history","title":"Eusebius on the Discovery of the Holy Sepulchre"},{"id":"comment-144402","author":"hugh_farey","post":"When did the “single most studied object in human history” claim surface, and is there any truth in it at all? Stonehenge? The Great Pyramid? Uzi the Alp Man? The Domesday Book? Shakespeare’s will? Leonardo’s Last Supper? Any other candidates?.","date":"2014-08-17","mins":"5:10 pm","url":"https://shroudstory.com/2014/08/17/evidence-of-the-resurrection/","cat":"history","title":"Evidence of the Resurrection?"},{"id":"comment-207429","author":"hugh_farey","post":"Yannick’s paper, containing 22 reasons why the Shroud is not the Mandylion, makes some valid points. Perhaps Mario would like to respond to the more obvious ones, particularly the fact that representations of the Mandylion invariably show an uninjured face with open eyes, while the Shroud shows a blood dribbled face with closed eyes. However, there is nothing in any of Mario’s sources that mentions Mandylion by name. Is it possible that it could have been transferred from Baudouin II to Louis IX without being identified by name? I think not. I do think it possible that everything Mario has deduced about the European history of the “sanctam toellam” is correct, but that the sanctam toellam was never the Mandylion in the first place. There were plenty of other possible candidates, after all..","date":"2015-08-04","mins":"1:51 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207453","author":"hugh_farey","post":"“Most historians agrees that this “sanctam toellam” was most probably the Mandylion of Edessa.” That may well be the case, but it need not be true. The Mandylion was so well known as the Mandylion that it does not seem likely that its name would get lost as the object itself was transferred from one royal relic connection to another. Constantinople had plenty of possible cloths identified as shrouds, sudarions or towels without the Mandylion necessarily being one of the transferred relics..","date":"2015-08-05","mins":"2:20 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207461","author":"hugh_farey","post":"Possibly, although I find it difficult to accept that not a single copy of the Mandylion resembles the face of the Shroud (negative, blood, eyes) at all, artistic convention notwithstanding, if the face of the Mandylion was in fact the face of the Shroud. I could understand that depictions of Christ based on such an image could be very different, but actual depictions of the cloth itself should at least pay some homage to verisimilitude..","date":"2015-08-05","mins":"4:21 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207743","author":"hugh_farey","post":"“The type of crown worn by various eastern monarchs was more like a type of helmet.” No it wasn’t. The type of helmet worn by eastern monarchs looked like a helmet, the crown was a circlet, sometimes like a child’s drawing with rays pointing up, often as a wreath of leaves, torque or twisted band. Searching for images of 1st or 2nd century coins gives us no images of cap like crowns, and paintings of king Abgar in state, rather than as a military leader on his coins, give him an ordinary circlet crown like any other king. (There is, to be fair, a 3rd century image of a king wearing a kind of fretwork cap, but it is very much the exception) I think the myth of the cap like crown may have been invented by Vignon simply to account for a few bloodstains on the top of the head, which was surely unnecessary in view of the other injuries Christ endured..","date":"2015-08-08","mins":"5:25 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207397","author":"hugh_farey","post":"You do not say what exactly is wrong with Latendresse’s paper. Which particular bits do you disagree with?.","date":"2015-08-04","mins":"8:32 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207747","author":"hugh_farey","post":"“Coins issued by Abgar VIII clearly show him wearing a helmet as a crown.” He is wearing a helmet, true, which, by virtue of his being a king, I suppose can be interpreted as a crown. This style of regal headgear is wholly unusual, as a trawl through all the other contemporary depiction of monarchs will easily demonstrate. However, I’m sorry if my bald rejection of your original comment was too abrupt. ““The type of crown worn by various eastern monarchs was more like a type of helmet.” I believe you are mistaken, as the evidence supporting this statement is so disproportionately small compared to the evidence contradicting it..","date":"2015-08-08","mins":"7:04 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207816","author":"hugh_farey","post":"For a superbly detailed exploration of the Image of Edessa, try Mark Gucin’s “The Tradition of the Image of Edessa” which was published a few months ago at https://pure.royalholloway.ac.uk/portal/files/24278014/MARK GUSCIN Ph D THESIS 05.03.15.pdf..","date":"2015-08-09","mins":"4:15 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-169171","author":"hugh_farey","post":"A neat clear exposition but… While the level of the pupil is easily recognisable on both Shroud and ones own face, the place you mark as B is not. If I measure 35cm from my own eye over the top of my head, 35cm reaches the bony prominence at the turn of the skull called the inion. A well defined point on my skull. But I am not at all sure why you think the inion of the Shroud man is only 20cm away from his pupil level. If it were, then the distance between the inion and the blood drops at the back of the head is also about 20cm. On my head, 20cm from the inion is well between the shoulderblades. It is a very imprecise science, this body measuring lark, but I do not think you have demonstrated that the two ‘heads’ on the shroud are too close together at all..","date":"2014-11-06","mins":"5:24 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168348","author":"hugh_farey","post":"“Blood flows on hair are more consistent with a “helmet of thorns” rather than a circlet.” I’ve never understood this. The top of the head is quite absent, and has no blood flows on it at all. Blood seems to be oozing from just above the hair line in front, and mostly along the lower edge of the skull at the back, although there are a couple of stains which seem to originate a little closer to the top of the head. Did the originator of the ‘helmet’ hypothesis think the two ‘heads’ were indeed not touching at all, I wonder. If we decide that by measurement that the cloth was wrapped quite closely all around the head, then there is a distinct absence of evidence for piercings all over the top of it..","date":"2014-11-03","mins":"4:10 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168410","author":"hugh_farey","post":"Wilson (1978) Plates pp 50 51 seems to show the top of the head, but a moment’s reflection tells you that it actually shows the back of the head, and that there is quite an expanse of unmarked shroud (not shown in Wilson’s photo) with no marks at all. As for the pigtail, I’m ambivalent about it really. Was it oiled or plaited? If not, how did it stay together and not spill about around the head? Like the hair, it looks as if it belongs to an upright body rather than one lying down, but I wouldn’t go to the stake for it..","date":"2014-11-03","mins":"7:43 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169173","author":"hugh_farey","post":"No need to be rude. But see my ‘November 6, 2014 at 5:24 am’ above..","date":"2014-11-06","mins":"5:31 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-79161","author":"hugh_farey","post":"Anonymous is correct in saying that early 1st century references to Middle Eastern Roman punishment regulations, Jewish burial regulations, the relationship between the two and the precision with which they were carried out are all sadly lacking, and must be inferred from later data. Even Josephus is not as informative as we would like. However, I don’t see any a priori reason why Jesus should not have buried according to the biblical description..","date":"2014-02-13","mins":"8:35 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77490","author":"hugh_farey","post":"Jesus dies: 3:00 pm Friday Burial completed before: 7:00 pm Friday (sunset) Empty tomb discovered: 5:00 am Sunday (early morning) Resurrection window: 7:00 pm Friday – 5:00 am Sunday. 34 hours. Roigor mortis can begin set in quite rapidly after violent death in hot conditions, but I cannot find out how rapidly it achieves completion. It is often (Google/wikipedia) said to take 12 hours to develop, beginning with the facial muscles and ending with the legs. How likely is it that the legs were in a state of rigor when the body was removed from the cross? Any patholgosts out there?.","date":"2014-02-08","mins":"10:43 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77491","author":"hugh_farey","post":"“patholgosts” ?? Sorry, “pathologists,” of course..","date":"2014-02-08","mins":"10:44 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77535","author":"hugh_farey","post":"There’s something called cadaveric spasm, which is very rare anyway and almost unheard of in the legs. It seems to be mostly associated with smaller groups of muscles such as the wrist or jaw..","date":"2014-02-08","mins":"3:47 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77556","author":"hugh_farey","post":"Well, that’s what I’d like to discuss with a pathologist. Although Jesus had been subjected to a lot of violence, he had not necessarily “used up” a lot of ATP. Carrying a patibulum may have been muscularly exhausting, but being pinned to a cross, however painful, may not have been, in the way that the viigorous struggles of a drowning man or someone running for his life may be. From my ignorance, I cannot deny that instantaneous paralysis of the legs may be possible, or even likely, but I’d like to know more..","date":"2014-02-08","mins":"5:37 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77539","author":"hugh_farey","post":"An entertaining volume on Google Books called “Textbook of Forensic Medicine and Toxicology” by by Nagesh Kumar Rao, gives a table of rigor mortis onset: Eyelids: 3 4 hours Face: 4 5 hours Neck and trunk: 5 7 hours Upper extremities: 7 9 hours Legs: 9 11 hours Fingers and toes: 11 12 Say everything took half as long in extreme trauma? Or one third as long? You’d still be pushing your luck to claim that rigor mortis in the legs had set in by the time Jesus was lifted down from the cross. It’s a shame that Bucklin and Zugibe are no longer around to comment..","date":"2014-02-08","mins":"4:06 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77692","author":"hugh_farey","post":"All the opinions above may be true, for all I know, but, as regular readers will understand, I would like to know how true they may be. Forensically, there is much much literature about the upper body, particularly the arms and hands, which can be diagnostic about the position and cause of death, but there is little about the legs, although the hips are the last to go rigid, and the last to relax. There is an account, in ‘Legal Medicine and Toxicology,’ by R.L. Emerson, of a railway worker who was crushed by a wagon. “Rigor mortis began in twenty minutes after the accident; it was present in the head and trunk at that time, not having reached the lower portions of the body, but six hours later the whole system was in a state of strong muscular contraction.” Any documented advance on six hours?.","date":"2014-02-09","mins":"4:56 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77748","author":"hugh_farey","post":"“Exceptional claims demand exceptional evidence.” Well, I agree with you there. Here is a sheet with an image on it. A thinks it is a medieval painting. B thinks it is the burial cloth of the Son of God. Shall we have a vote on the exceptional claim?.","date":"2014-02-09","mins":"9:21 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77736","author":"hugh_farey","post":"As usual John Klotz is so wide of the mark that it is remarkable he ever hits the wall the target is pinned on, let alone the target itself. As usual he invokes the term “pseudo skeptic,” and has claimed to adhere to Marcello Truzzi’s definition thereof. Truzzi says that scientific skepticism is the demand that ideas satisfy a burden of proof before being granted validity, whereas pseudo skepticism is a simple assertion that a belief is factually wrong without providing any proof thereof. A more easily understood definition of a pseudo skeptic, provided here by Charles Freeman, is the someone who claims that they are sceptical about something when in fact they believe it to be true. Neither of these, of course, describes my position at all. Like all good scientists, my exploration of any idea is rooted in an attempt to disprove it, so that by rejection of the null hypothesis, it can be demonstrated valid. In the case of rigor mortis, I cannot say that I can reject the null hypothesis. I have no pre existing determination rejecting authenticity (quite the reverse), and I do not refuse to accept the findings of those pathologists who say that if the image on the shroud is that of a dead body, then it looks as if it is in a state of rigor mortis. So it does. But note the conditional. The pathologists quoted above had two considerations. Firstly, could the image on the shroud have been produced in any other way than by being wrapped around a dead body, and secondly, what does the image tell us. Of their expertise as to the second I have no doubt, and neither should anybody else (even though they disagree quite markedly about things like the Space of Destot and the cause of death, which alone should make impartial observers aware that authority and experience alone are not infallible). As to their expertise on the first, of course they have none. The statement: “the shroud must be genuine because we don’t know how it could be faked” is no more valid than the statement: “the shroud must be fake because we don’t know how it was caused naturally.” Proof is a very strong word in the scientific world. So much so that scientists seldom claim anything as proved. The nearest they get is a Law, such as the Law of Gravity, but even a Law is only a consensus of opinion about a description of the natural world that seems to hold true within a sphere of investigation. Where, or when, it is found wanting, it is amended or rejected. In the Mathematical world, proof is irrefutable, provided that certain axioms are accepted. The only way to disprove a mathematical proof is to reject the axioms. If that can be done (and it often is) then the proof disintegrates. In the legal world, proof is an everyday occurrence resulting in a conviction. Whether X killed Y is not a matter of global scientific consent, but simply persuading twelve people that the evidence of guilt is beyond reasonable doubt. In borderline cases this doubt may depend as much on the emotions of the jury and the persuasiveness of the lawyers as it does on the evidence. I have said before that I think the main difference between my approach to the shroud and John Koch’s is that our ideas of what is proved and what is not are based on different methodologies. As for my “only support,” I knew nothing of Michael M Baden before this post. I do not know whether his appointment as CME, his subsequent dismissal, his successful claim for wrongful dismissal and the subsequent overturning of his claim on appeal had anything to do with his ability to decide whether a picture of a body shows rigor mortis or not. I believe John Koch is simply trying to blacken his name, in an attempt to discredit his scientific judgement. As it happens this seems unnecessary as he does not seem particularlty committed either way..","date":"2014-02-09","mins":"8:06 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77794","author":"hugh_farey","post":"Yes I do. Just a sneaky one!.","date":"2014-02-09","mins":"12:47 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77846","author":"hugh_farey","post":"Thanks Mike. I found it on Google Books. Given the specific nature of my inquiry it’s a pity Zugibe didn’t say more about it, such as how long it took to reach the legs, but its certainly indicative, if not quite your: “when he was called to the scene the victim was stiff in the running position. That means stiffness kicked in almost instantaneously.” There’s another interesting case at http://link.springer.com/article/10.1007/s00414 013 0881 0. The abstract begins: “The question of whether instantaneous rigor mortis (IR), the hypothetic sudden occurrence of stiffening of the muscles upon death, actually exists has been controversially debated over the last 150 years.”.","date":"2014-02-09","mins":"4:16 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77799","author":"hugh_farey","post":"To be honest, I’m not half as convinced that the shroud is medieval as you are that it is genuine. I hope it’s been obvious for a long time that although I currently feel that the evidence aginst the radiocarbon dating is insufficient to discredit it, and that the historical, and more especially the pollen evidence is not firm enough to substantiate a 1st century origin, I am certainly open to all ideas, from the literally biblical to the Gnostic painting and even the homage to Jacques de Molay. I am not open to them all as equally strong, of course, and the biblical is a close runner – it’s just not quite there yet, in my opinion. I do not begrudge anybody his (or her, with Paulette and Annette on board) beliefs, I am not a fanatic anti authenticist out to discredit Chrisitanity by debunking the shroud, nor any of the other things some of us are accused of, just not yet convinced that the carbon dating is wrong. That doesn’t mean it isn’t, just that I have not found sufficient evidence to say so. And, of course, my hypotheses ought to be challenged and disproved just as much as anybody else’s. My current one is that there was insufficient time between death and being taken down from the cross for rigor mortis to have a significant effect on the layout of the feet on the shroud. I have attempted to disprove it myself, but the best I can manage so far is the railway engineer whose total paralysis set in after six hours. Yes, I have read a book. I wish I could discuss the matter with a pathologist. I am interested in the suggestion that a running man could freeze solid in his running position instantly after being shot and would like to know more. Can anybody supply a reference to it?.","date":"2014-02-09","mins":"1:04 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77892","author":"hugh_farey","post":"I agree that a medieval artist would be most unlikely to have faithfully copied a body in traumatic rigor mortis. However there was certainly a Byzantine artistic tradition showing quite a distorted body, with pronounced features such as a high chest and distended abdomen. Of course, if the shroud is authentic, it could be said that their features derive from the shroud, but those art historians who think it medieval think it fits in well with that artisitic tradition. It’s a moot point, I think..","date":"2014-02-09","mins":"7:30 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78038","author":"hugh_farey","post":"Good point. There are dozens of images showing Christ naked, but nearly always there is something, even if just a wisp of material, to cover the genitalia. The shroud is not alone in preserving Jesus’s modesty by crossing his hands, but it is certainly less common. Baptism images usually cover Jesus with wavy lines (of water), and the genitalia are simply omitted, although the Ravenna mosaic is an exception even to this. Buttocks, at least before the 13th century, are even more exceptional..","date":"2014-02-10","mins":"9:12 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77993","author":"hugh_farey","post":"Adam and Eve! I wish I’d thought of that. I was trying to find Byzantine bodies of people other than Jesus, but they all tend to be clothed. A quick flick through Google shows some more or less naturalistic versions of Adam and Eve, but many which are more stylised, with unnaturally high pectorals and either a well defined six pack, or a distinct gap (often showing the ribs) between pecs and abdomen, which is more distended. Http://classicalchristianity.com/wp content/uploads/2012/04/the creation of adam monreale.jpg shows it well. Has anyone written a thesis on muscular depiction in early Byzantine Art, I wonder!.","date":"2014-02-10","mins":"4:31 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-72887","author":"hugh_farey","post":"Sadly, a close scrutiny of the relic OK judges to be genuine clearly shows a simple over under weave, nothing like the 3 1 twill of the shroud. Also, I think this is an archive entry and no longer for sale. For current offers go to http://www.russianstore.com/relics.htm. Enjoy!.","date":"2014-01-10","mins":"9:02 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-78097","author":"hugh_farey","post":"I don’t think David Mo is a troll at all, I doubt if he is very upset, and I know he does not hate the Shroud. He points out that a body in rigor mortis lying on a flat slab would not look as trim as the dorsal image on the shroud looks, as the fat of the buttocks would squash out whether there was rigor or not. He also points out that the blood trickles on the sides and back of the hair are anomalous. Some people have accounted for these anomalies to their satisfaction, by suggesting the body was not laid on a flat slab, that the shroud moved its position between bloodstains and image, and that (if I understand Max correctly), the bloodstains on the back of the head are contact prints from a circlet of rushes. If David Mo does not find these convincing, that doesn’t make him either a troll or a shroud hater..","date":"2014-02-10","mins":"2:52 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78132","author":"hugh_farey","post":"Fair enough. I find by experiment that I can hold my buttocks off the ground very easily. So the picture at the top of this post is wrong..","date":"2014-02-10","mins":"4:59 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-73240","author":"hugh_farey","post":"“The total volume of True Cross is estimated to be between 36 000 cm^3, up to 178 000 cm^3, while the total amount of the alleged relics of True Cross is less than 4 000 cm^3.” I think this is based on the researches of Charles de Fleury. First he estimated the volume of the cross based on the weight he guessed Jesus could carry and the average density of pinewood, which seems a curious way of making a wild guess, and came up with a volume of about 179 000 cm3. This would make a cross 4m high, 3m across, of planks 25 cm wide and 10cm thick, which is absurd. He then added up a handful of relics whose dimensions he also largely guessed at, and arrived at about 4 000 cm3, which seemed to him far too few, so he arbitrarily multiplied this by ten, arriving at about 40 000 cm3. To consider any of this serious archaeology is risible. (Information from http://www.catholiceducation.org/articles/facts/fm0150.htm) But undeterred, we will do the same! I’m going for a cross 3m high (including the bit in the ground) and 2m wide, of planks 20cm across and 5cm thick. That’s 50 000 cm3, which fits with the smaller volume above sufficiently well. Wikipedia gives the dimensions of six pieces, and mentions two other sites claiming to have entire ‘wings’ each. The six pieces add up to about 3000 cm3, and the two wings cannot be less than another 10000 cm3. That gives us 37 000 cm3 to account for. On ebay as I write, there are about 70 pieces for sale. They are mostly in the form of crosses made of two splinters, say 10mm and 7mm long, and cross section 1mm – say 0.01cm3, or 100 to the cubic centimetre. How can we estimate the total number of these purported relics around the world? I’m guessing 1 for every ten thousand Catholics – so a total of about 100000 relics, say another 1000 cm3’s worth. I’ve now accounted for 14 000 cm3 of my original 50 000. It seems that de Fleury was correct. But wait… Grzegorz Górny’s new book “Witnesses to Mystery” says that “the True Cross was made of Black Pine – pinus negra,” and claims that one of the ‘wings’ of the True Cross (in Spain) was found to be made of Cupressus sempervirens (Mediterranean cypress), while Wikipedia says that four of the “ten particles with surviving documentary provenances by Byzantine emperors” in Europe are made of Olive. What’s more, Black Pine does not grown in Israel. The message is that just because there aren’t, in fact, enough fragments of the True Cross to build a battleship doesn’t of itself mean that any of them are genuine..","date":"2014-01-13","mins":"3:30 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-73205","author":"hugh_farey","post":"Selling relics? Perish the thought. Sacrilege. However, relics these days usually come in reliquaries, elaborately decorated and jewelled monstrances of unique artistic and cultural value. That’s what you pay for at sites like Russian Store.com. Then there’s provenance, postage, packing, insurance… But the relics themselves? Completely free and gratis, of course….","date":"2014-01-13","mins":"4:13 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-73245","author":"hugh_farey","post":"Fantastic OK, your depth of sources never ceases to amaze me!.","date":"2014-01-13","mins":"4:42 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-120411","author":"hugh_farey","post":"I cannot find, after some searching, that κόμη means decorated hair. Normally it just means hair, and far from being a rare word, it occurs frequently, meaning the material of the hair itself rather than as a description of the top of the head generally. It found a Latin equivalent in ‘coma,’ which also just means hair, not long or decorated. In a literal translation, St Paul says that for men to have hair is a shame, while for women it is glory. As this is, as it stands, absurd, an adjective has been assumed, normally ‘long,’ but not illogically ‘decorated.’ Possibly an original adjective has been lost in copying. So although I shy away from your dogmatism, there is sense in your suggestion. Interestingly, the Latin Vulgate amends the meaning slightly. For a man: “si comam nutriat ignominia est illi”, and for a woman: “si comam nutriat gloria est illi.” ‘Comam’ here, as anywhere else in Latin, just means hair; it is the ‘nutriat’ which gives the passage sense. If a man nourishes his hair it is an ignominy, but if a woman nourishes hers it is a glory. That makes a certain sense, and could indeed apply to ‘attending’ to hair in a decorative sense, as well as applying some sort of lotion to try to make it grow. On the whole, then, I think I agree with you! But it does not pay to be too dogmatic: that plays into the hands of your critics. The reference to unkempt hair in Plutarch’s Cicero comes not from the ‘κόμης’ but from the qualifying ‘ἀνάπλεως,’ for example..","date":"2014-05-16","mins":"8:56 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-120557","author":"hugh_farey","post":"He might. But then again he might not. Evidence… evidence… evidence….","date":"2014-05-16","mins":"5:11 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-72885","author":"hugh_farey","post":"Hee hee! One of my favourite stores, as I have often mentioned before. A bit of Our Lady’s mantle? $3500. Or the Manger? $3750 (comes with assorted bits of stone from Calvary, the Sepulchre of the BVM, etc.) The True Cross? $9500 (quite a big splinter). However, this post has stimulated a thought. Given that almost every relic known to history has been chopped into innumerable fragments for dissemination among the faithful, including the crown of thorns, the nails, the cross and even the sepulchre, is it not surprising that the Shroud is so intact? The table of the last supper, everything the Holy Family ever wore – it’s all in shreds around the world. Only the Shroud remains substantially as it ever was, if it ever was, with only those two corners and a few stray threads missing..","date":"2014-01-10","mins":"8:48 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-120686","author":"hugh_farey","post":"I think that’s excellent..","date":"2014-05-17","mins":"2:23 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-120078","author":"hugh_farey","post":"Ye..es. Good idea, but is there a shred of evidence for it? One little reference is worth twenty lines of capital letters..","date":"2014-05-15","mins":"3:49 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-121358","author":"hugh_farey","post":"Thanks, Dave Hines, I appreciate your reply. I too find find daveb’s comments invariably pertinent and valuable, although I don’t always agree with him. However I hope people occasionally find my own comments worthwhile, although they may appear trivial. The shroud world is full of assertions which together lead to overwhelming conclusions, but if the assertions are unsubstantiated, then the whole edifice comes tumbling down. Now you have backed up your first bold comment (“The ancient Greek word (κόμη) that Paul of Tarsus wrote in Corinthians 11:13 means “decorated hair”. It was mistranslated as “long hair.”) with reasonable, if not conclusive, evidence, and I’ll go along with that until (unless) somebody else provides counter evidence. Incidentally, I don’t think I’m familiar with your videos. Can they be found online?.","date":"2014-05-19","mins":"3:06 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-120135","author":"hugh_farey","post":"I think the answer is simpler still. Ordinary length hair (for men) was to the shoulder, while long hair (typical of women) was to the waist. ‘Long’ is a cultural relative..","date":"2014-05-15","mins":"6:07 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"author":"hugh_farey","post":"Just read your latest Stephen. Of course I was not referring to sasquatches or anything so ridiculous, but to the term \"sleeper agent\" which I take to mean somebody who was acting clandestinely to falsify the radiocarbon date, who was part of the team and who no one suspected. This, as I understand it, describes your position perfectly. As far as I know you are totally alone in this belief. If either of the above statements is wrong, I apologise, but I was certainly not lying, nor setting up a strawman, nor poisoning your well. I wish you could see that it is possible for someone to disagree with you without bearing any personal animosity, and I wish you well in all your Shroud endeavours..","date":"2015-03-13","mins":"2:25 AM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"id":"comment-123457","author":"hugh_farey","post":"I could have a go. Mark Evans’s microphotographs show that adjacent individual fibres can be either stained or not, so the resolution of the “printer” cannot be poorer than the width of a fibre, say 50um. That’s 20 000 “dots per cm.” As the shroud is roughly 400 x 100 cm, the number of laser beams to discolour the entire shroud would be 800 000 000. I do not know how much of the Shroud is actually taken up by the body images, but if, for convenience, we said one eighth, then 100 million individual beams would be enough to produce the images. I hope that helps..","date":"2014-05-23","mins":"3:10 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-114781","author":"hugh_farey","post":"Incidentally, I notice that Stephen Jones illustrates his latest peroration with an illustration of the Byzantine Emperor Alexios I, scavenged from Wikipedia. I do recommend it, as it is cluttered with Vignon markings from three sided square to assymetrical nose to wide staring eyes. The shape of the head, framed by vertical parts of his headdress, and the fullness of his facial hair are a great deal more reminiscent of the shroud that almost any of the collection we have recently examined. Are there other examples of Vignon markings on Emperors, I wonder?.","date":"2014-05-08","mins":"2:30 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-114889","author":"hugh_farey","post":"Not sure. Theodorus Lector tells the story of the painter whose arm withered because he made Jesus resemble Zeus, and says that Jesus actually had short wooly hair. In isolation this comment doesn’t mean much, but I wonder if it reflects a time when the three centres of Christianity, Jerusalem, Rome and Constantinople, all had their own iconography of Christ, reflecting, in each case, their own characteristics. Eventually, of course, the Byzantine dominance of Christianity meant that its version of the image of Christ became the official one. Theodorus Lector goes on to say that the painter with the withered hand had it miraculouly restored by St Gennadius, suggesting that whatever Christ really looked like, the Zeus like image became first acceptble, and then compulsory..","date":"2014-05-08","mins":"6:04 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"author":"hugh_farey","post":"Hi Stephen,I'm sorry I have caused such excitement. My point about the map was not that it was incorrect; as I said you admitted it was wrong. My point was that you used an incorrect map at all. Why not draw a better one?As for the statements about the movement of the Shroud between 1357 and 1388, there are at least three sensible possibilities, one of them being yours. However, in a comprehensive encyclopaedia I think there is a duty to be a bit more precise about the reason for your choice. I tried all over the place to justify it from primary sources, including Ian Wilson's more recent books (1998 and 2010) where he doesn't mention it, and his seminal 1978 book, where he doesn't mention Anthon (Just my luck if he mentions both in Holy Places, which I haven't got with me!) I was sorry not to find M. Bergeret's paper online, as that might quote a 14th century source. Perhaps you have a specific source, or perhaps you were making an educated guess and a perfectly good one it is but I think you should make clear which.As for the date of Jeanne de Vergy's marriage to Aymon IV, I think Crispino is guessing that the indulgences granted in 1357 were in order to celebrate it. What makes you think it was in 1359? You're probably correct about Guichard d'Anthon it may well be that Anthon Haute Savoie was named after Anthon Isère, but the castle of the former is not otherwise associated with the chatelain of the latter. I'm glad you will change the photo, although I could not find one of a castle in Haute Savoie. Perhaps it no longer exists.Best wishes,Hugh.","date":"2015-02-18","mins":"2:07 AM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"id":"comment-116277","author":"hugh_farey","post":"Moses: http://commons.wikimedia.org/wiki/File:Moses Icon Sinai 13th century detail.jpg Alexios I: http://www.avtomatik.com/c c c c g/index.html Fayum Portrait: http://www.pinterest.com/pin/213709944788631610/ St Peter: http://museum.doaks.org/VIEO29589?sid=3288&x=5708&port=2609 St Andrew: http://www.shutterstock.com/pic 87917692/stock photo unesco listed byzantine mosaic portrait of saint andrew the apostle surrounded by dolphins in the.html Martyr of St Sebasteia (4th from right): http://museum.doaks.org/VIEO27113?sid=3288&x=57730&port=2609 St Nicholas: http://upload.wikimedia.org/wikipedia/commons/0/0d/Icon c 1500 St Nicholas.JPG St John Chrysostom: http://icfadumbartonoaks.files.wordpress.com/2013/05/screen shot 2013 05 01 at 1 42 20 pm.png.","date":"2014-05-10","mins":"4:58 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-117778","author":"hugh_farey","post":"You don’t think that sounds like special pleading? I do. Vignon markings on non Christs are accidental, but those on Christs are deliberate? No, you’ll have to do better than that, I’m afraid. The few Vignon markings that appear ‘commonly’ on Christs also appear commonly on non Christs. The few that appear rarely on Christs are equally rare elsewhere. The fact that some Christ portraits seem to have a greater number of these markings than non Christs is a statistical effect of the far greater proportion of Christ portraits..","date":"2014-05-12","mins":"9:31 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116174","author":"hugh_farey","post":"Hi David. I’m not too bothered about the quote facility. I rarely want to quote an entire comment, and am happy to cut and paste the bits I think I need. I agree with you entirely though, I think. Most of the so called Vignon markings are stylistic variations of earlier models dating from before the time of Christ, or reflections of contemporary hair styles. As I commented on an earlier post, some later Pantocrators do have a distinctively odd wavy brow ridge and downward nose loop which does not seem artistically relevant, and perhaps someone more au fait with Byzantine art can say what it symbolises. I do not think it derives from the Shroud, however, as the most distinctive bridge of the nose irregularity is the famous open square between the eyebrows, which is completely ignored in favour of some barely visible triangles except in one single example, the St Pontianus wall painting, whose artist can hardly have had the Shroud before him as he worked. And I’m sorry, clublu22014, that I do not see the “obvious miracle” that you do. I do not know if there are any genuine acheiropoieta, but I believe that if any exist, they were not formed by a process inexplicable (at least theoretically) scientifically..","date":"2014-05-10","mins":"12:36 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-117934","author":"hugh_farey","post":"David (Goulet)! In a word, yes. There is one interesting oddity which needs to be explained, namely the wavy line across the brows and the loop downwards over the nose (Marks 1 4 in various combinations) found in later Christs and Emperors, but I don’t think this is anything to do with the Shroud. All the other marks occur here and there across Byzantine portraiture, apart from the completely spurious ones (the 1898 crease and the change of an epsilon shaped blood mark in to two strands of hair). David (Mo)! Squirming is wriggling uncomfortably to ease oneself out of a very tight place with pressure on all sides. I am still awaiting a copy of Vignon’s 1938 book, where I hope he explains his ideas more clearly..","date":"2014-05-12","mins":"1:45 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-117641","author":"hugh_farey","post":"I think there’s a bit of squirming going on here. OK rejects portraits which do not have shoulder length hair as Shroud derivatives. And that’s fine. Supposing I said that I reject portraits which do not have divided beards, which is surely a characteristic at least as obvious as the long hair. Then at a stroke almost all the most famous “Vignon” portraits also have to be rejected. OK will no doubt say that they can be accepted because of all their other Vignon marks. But if the “non divided beards” can be accepted because of all their other Vignon marks, then surely so can the “non shoulder length hair.” Rejecting my non Christ examples of the basis of their hair length is not a reasonable attitude, I feel..","date":"2014-05-12","mins":"5:51 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-118398","author":"hugh_farey","post":"“a ‘stilyzed’ sign, perhaps of concentration and power.” You may well be correct, and it makes a lot of sense, but I have yet to see it properly evidenced, so I held back from proposing it..","date":"2014-05-13","mins":"3:18 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-114774","author":"hugh_farey","post":"I wish I knew more about iconographic traditions. The Prey manuscript is a fairly typical “Three Marys” and the ivory above is an “Entombment.” We have recently seen several examples of the “Man of Sorrows,” and there are, of course “Crucifixions,” “Depositions” and “Resurrections” among others. The general layout of these types seems fairly rigid, and sometimes a misunderstanding of the epitome give rise to absurdities, such as the ridiculously sloping coffin lid upon which the angel sometimes perches in “Three Marys” paintings. Does anybody know of a work (Belting perhaps or Shiller?) which gives a ‘family tree’ of these styles? It would be good to see whence and when each one appears to have originated. From what I gather, “Entombment” icons preceded “Man of Sorrows” icons, which seem to have derived their right sided spear wounds and crossed wrists from them. Some icons seem to have derived from sermons delivered by particularly notable worthies rather than directly from the bible, but I’m not sure about the authority there is for that. Some people, including the early church fathers, thought that the Pantocrator derived from the pagan image of Zeus, and condemned bearded, long haired Jesuses for that reason. Lots of things I’m not sure about when it comes to art, in fact!.","date":"2014-05-08","mins":"2:20 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-185947","author":"hugh_farey","post":"You’re not wrong there, Colin. Way over my pay grade, but I’m discovering a lot more about digital imaging as I go along, so I dare say I’ll get there in the end. Cutting directly to the conclusions, I note, as you probably have yourself, that: “The image area shows a strong affinity with the interstitial blood modes” and “The observation that it is hard to distinguish image pixels from interstitial blood pixels may have some image formation implications.” I think this means that where the blood has eroded away, the cloth has the same colour as the rest of the image, which implies that the image is not surpressed under the bloodstains, and therefore that there is no reason to suppose that the blood arrived before the image..","date":"2015-01-24","mins":"7:55 am","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-185919","author":"hugh_farey","post":"The powerpoint presentation from the Bari conference (in English) is here: http://www.frascati.enea.it/fis/lac/excimer/sindone/report%20arquata.pdf.","date":"2015-01-24","mins":"4:24 am","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-114829","author":"hugh_farey","post":"So a bottle of suspended chalk which anybody can go and collect by the bucketful was passed off as Mary’s breastmilk (it surely wouldn’t be kept in a reliquary if it was known to be nothing but a folk remedy). No wonder it hadn’t gone off! And any old cloth from Israel could be swaddling clothes or the robe or some other cloth sacred by contact. Nobody denies that Commenus’s collection of artifacts existed, there’s just no evidence that they were either as old, or from the people, they claimed to be. Note Calvin’s comment: “How they obtained this milk they do not say.” Why not? What had they got to hide?.","date":"2014-05-08","mins":"4:08 pm","url":"https://shroudstory.com/2014/05/08/more-on-the-letter-from-alexius-comnenus-never-have-preconvictions-about-relics/","cat":"history","title":"More on the Letter from Alexius Comnenus:  Never have preconvictions about relics"},{"id":"comment-185975","author":"hugh_farey","post":"Clout? Moi? You gotta be kidding…..","date":"2015-01-24","mins":"11:05 am","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-40804","author":"hugh_farey","post":"Update. Kevin Brodie got his information from Rick Steve’s Guidebook, “Paris 2013,” which in turn got it from the doyen of Chartres guides, Malcolm Miller. An email to Malcolm Miller said: “I am familiar with E. Jane Burns’s book “Sea of Silk,” which devotes some space to the Camisia, and says “according to an analysis in 1927, the embroidered cloth is Syrian work from the 8th or 9th century,” and also, “More recently, Annemarie Weyl Carr has identified the triraz like fabric now called the Virgin’s veil as Byzantine, dating it to the tenth or eleventh century.” However, you may know of more recent tests which date it earlier. If so, I should be very grateful for any information you can pass on.” The reply said: “Like you I have heard different estimations of the Veil’s age, varying from 1 century BC to 8th.c AD !” That’s a No, then..","date":"2013-08-09","mins":"6:43 am","url":"https://shroudstory.com/2013/08/05/no-bogus-shroud-of-turin-here-huh/","cat":"history","title":"No bogus Shroud of Turin here. Huh?"},{"id":"comment-40506","author":"hugh_farey","post":"A reporter from the Cincinnati Inquirer, shown around Chartres by a guide, Anjali Janakiraman, quotes (http://www.cincinnati.com/travel/stories/072003 travlede.html): “It’s not probable that it was worn by Mary, because the cloth has been dated to probably the 7th century,” said Janakiraman.” Novelist Kate Mosse writes (http://www.katemosse.co.uk/index.php/kates books/labyrinth/labyrinth/chartres/): “The Chartres Cathedral reliquary was opened during the French Revolution and a robe, 6.4 metres in length, was discovered. It was torn up into 6 or 7 pieces and scattered. Two pieces of the long robe were returned to the cathedral at the beginning of the 19th century. Expert examination has shown the cloth to be about 2000 years old and or Near of Middle Eastern origin.” A blogger (http://catholicismpure.wordpress.com/2012/08/30/our ladys veil two tales/) writes: “The veil itself is more than six metres long and made of silk. Scientific studies have shown that it is of Syrian design, of fine quality and can be traced to the first century. If indeed it was the original Veil of Our Lady it has probably been extended and embellished over the centuries. It had once been depicted as a tunic (Sancta Camisia) but when this was unwound it was found to be a Veil, or a long piece of cloth rather than a tunic.” The best information I can find is a book “Sea of Silk: A Textile Geography of Women’s Work in Mediaeval French Literature,” by E. Jane Burns (try Google Books) which says everything there is to be said about the relic. It’s made of silk and covered in embroidery. She quotes Yves Delaporte; La Voile de Notre Dame, and another source (which Google books won’t give me!) saying that “according to an analysis in 1927, the embroidered cloth is Syrian work from the 8th or 9th century.” And: “More recently, Annemarie Weyl Carr has identified the tiraz like fabric now called the Virgin’s veil as Byzantine, dating it to the tenth or eleventh century.” Sadly I suspect that Kevin Stuart Brodie gets his information from “The Kabbalah Code: A True Adventure” by James Twyman and Philip Gruber, which does date the santa camisia to the first century, but is, like all books entitled “a True Adventure,” really not much more than a romantic fiction. Incidentally, it appears that the single sheet in your photo above is, in fact, just a dust and light excluder. The veil itself is draped over a bar behind it – Google more pictures to see it..","date":"2013-08-05","mins":"11:44 am","url":"https://shroudstory.com/2013/08/05/no-bogus-shroud-of-turin-here-huh/","cat":"history","title":"No bogus Shroud of Turin here. Huh?"},{"id":"comment-30024","author":"hugh_farey","post":"You can buy it. Tristan examines three hypotheses, basically the fake, the miracle and the naturally formed, according to a historiographical methodology proposed by Christopher Behan Mc Cullagh. He concludes that the most probable explanation for the formation of the image is by a miracle. I disagree with his methodology, his premises (based on Fanti’s list of shroud data), and his conclusions. Others may not..","date":"2013-04-09","mins":"9:14 am","url":"https://shroudstory.com/2013/04/09/paper-chase-new-peer-reviewed-article/","cat":"history","title":"Paper Chase:  New Peer Reviewed Article"},{"id":"comment-71307","author":"hugh_farey","post":"All Pfeiffer did was to list Frei’s 58 plant types (56 species and 2 genera) in a slightly different way. He did not examine the original tapes or slides. Frei identified Carduus personata (found all over the place), but not Carduus argentata (found around the Mediterranean). Litt considered that Frei’s Gundelia tournefortii (exclusively Middle Eastern) was in fact Carduus sp. (found everywhere). Of the 8 species that Pfeiffer says are specific to the Dead Sea, at least half are insect pollinated and could not have had their pollen blown onto a cloth in in Jerusalem (or anywhere else). Nor would their flowers have been easy to collect on the afternoon of Jesus’s death. The first one, Athaea officinalis, or Marshmallow, is not specific to the Dead Sea, is insect pollinated, and does not flower until August. Curious..","date":"2014-01-02","mins":"7:02 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","title":"Paper Chase:  Z Twist Again"},{"id":"comment-71253","author":"hugh_farey","post":"There’s more to Uri Baruch’s work than that. In an appendix to “Floristic Indicators for the Origin of the Shroud of Turin,” he appears to have examined the slides that Frei himself had made, for examination, in the manner described in his Shroud Spectrum article, after extracting individual grains of pollen from the tapes. They are listed as MS01, MS02, etc., not as 6b/d or 4c/a, and are labelled with the specific pollen type Frei claimed to have identified. I think disowning Baruch was a convenient way of getting rid of the embarrassing over specificity of Frei’s original identification. Litt’s identifications, or lack of, have never been published, except for his re identifying the Gundelia as Carduus. Although Carduus thistles of one kind or another are found almost globally, one specific Israeli species (C. Argentatus) was immediately assumed to have been the source of all the “Gundelia” pollen on the notorious Slide 6b/d. It’s possible, it’s convenient, but it’s not science..","date":"2014-01-02","mins":"4:28 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","title":"Paper Chase:  Z Twist Again"},{"id":"comment-141997","author":"hugh_farey","post":"He did indeed, and very erudite it is too. However, all things considered, I believe I am swayed towards authenticity on this one!.","date":"2014-08-03","mins":"11:02 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142135","author":"hugh_farey","post":"The discussion above illustrates a wider point about the interpretation of ancient artifacts in that although the evidence about them may not be disputed, different overall conclusions regarding them depend on the weight that individuals assign to it. As I understand it the name inscribed on the Caiaphas Ossuary appears twice, but spelled slightly differently. Fr Puech has, probably correctly, explained that the two spellings can only both be correct if they indicate the name Qopha, which is sufficiently far from Qayyapha, or something similar, for identity with Caiaphas to be rejected. However, Helen Katherine Bond points out, with photographs, that the inscriptions are somewhat clumsily executed, nothing like the elaborately decorated front of the ossuary, and appear to have been added as afterthoughts, after the ossuary had been placed in its niche, as the inscriber had to jam his hand into the narrow space between the ossuary and the wall of the tomb to scratch the letters. In this case the possibility that there was a simple misspelling of one of the names cannot be easily discarded. Neither she, nor I, nor, I dare say, the museum of antiquities in Jerusalem, would go to the stake in favour of authenticity – it is, as I say, a question of the weight one gives to a piece of evidence – but that’s the reason I do not concur with Fr Puech’s conclusion, however much I agree with his linguistic interpretation..","date":"2014-08-04","mins":"12:32 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-141792","author":"hugh_farey","post":"Maier is indeed entertaining, but he takes a very long time to be informative. His interpretation of the Caiaphas Ossuary is simply wrong. When it is correctly translated – Joseph, son of Caiaphas, not Caiaphas himself – we see that it is Joseph, not his father, who merited the elaborate ossuary, and we wonder why there is no mention of his father’s rank anyway. As it happens there is good evidence from the Miriam Ossuary that Caiaphas was indeed a senior priest, but mistakes like that cast doubt on Maier’s confidence. Maier goes on to quote the usual historical evidence from Roman commenters, of which only Josephus’s is really evidence of Jesus rather than of Christians as a sect, and Maier does not see fit to mention that perfectly sensible people have queried most of his evidence on reasonable grounds. The idea that only 30 years after the resurrection there was a sufficiently substantial Christian movement in Rome either to burn to place down or to be blamed for doing so and executed in their thousands (“an immense multitude”) is a priori a little far fetched, although not of course impossible. We have to wait until the questions at the end for his opinions on the empty tomb, which as it happens I share but have no archaeological foundation, and on the earthquake which we have already examined, negatively, elsewhere. There is some good material here (I hadn’t heard of the “Horus, son of Horus” census return) but we do have to earn it!.","date":"2014-08-02","mins":"8:54 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142247","author":"hugh_farey","post":"I’m sorry that having no expertise on the matter I have to fall back on Helen Bond again. It is odd, I suppose, that any casket as elaborately carved as that should appear in such an ordinary tomb. Her explanation is that Caiaphas was the only one of five High Priestly relations of Annas not to be a descendent (having married into the family) and his own family need not have been anything special, and also that as he was dismissed from office under slightly tendentious circumstances, he may have ended his days rather less importantly than his previous eminence should have suggested. I have no idea whether these are good arguments or not..","date":"2014-08-04","mins":"12:49 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-141963","author":"hugh_farey","post":"Oh, dearie me, you’re absolutely correct. Consider me mortified. Helen Bond has much to say about the ossuary in “Caiaphas: Friend of Rome and Judge of Jesus”, including appropriate objections, but they do not amount to much. It looks as if this ossuary was indeed the High Priest’s, and (not for the first time) I rushed in like a bull in a china shop. My apologies all round..","date":"2014-08-03","mins":"6:27 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-141970","author":"hugh_farey","post":"And to make it worse I’ve posted it twice by mistake!! (Creeps away in shame…).","date":"2014-08-03","mins":"6:55 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-141968","author":"hugh_farey","post":"Oh, goodness me: I you’re absolutely correct. Consider me mortified with embarrassment. Helen Bond has a lot about the Caiaphas Ossuary in “Caiaphas: Friend of Rome and Judge of Jesus” and although she discusses the objections to its identification, they don’t amount to much. It seems that (not for the first time) I just rushed in like a bull in a china shop. My apologies all round..","date":"2014-08-03","mins":"6:54 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-143217","author":"hugh_farey","post":"I’m still away from home at the moment so can’t give chapter and verse. When Kenneth says he has come across his various methods, may I ask in what publications? There has been a great deal of speculation about Roman scourging, but most of it is not based on much. My advice, for what it is worth, is not to look at the Shroud for information about Roman scourging. Start with Roman authors, most of whom write about different contexts than 1st century Judea, but give some ideas about what happened, in different circumstances, and more particularly its cultural significance. Then look at the very few contemporary illustrations, mostly on coins, and the one single piece of archaeological evidence, which was sold on e Bay a little while ago. (The metal rod with little chains and bells dangling from it which you can find in Antiquities books, is now, I believe, thought to be a horse ornament, not a model flagrum). Finally look at what happens when modern people flog themselves, which happens every Easter in Mexico, the Philippines, and so on. Having a better working knowledge, as it were, you can then turn to the Shroud to see how it might fit in to the pattern. Fancini’s diagrams are interesting, but seem to suggest whole squads of torturers equipped with an assortment of different instruments taking turns on all sides. Vignon and one or two others actually made scourges to fit the marks, which later commenters, thinking they were based on other archaeological sources, then used to prove that the marks were clear evidence of the use of that type of scourge. There are two kinds, one with the dumb bells longitudinal with the thongs, and the other with them transverse. They can’t both be correct, if either. It is quite interesting and thought provoking to sketch in lines from the general direction of the marks as if they were radii, and find the approximate centres of the circles on either side, which have suggested to some people the different height of two scourgers. You could also make something appropriate and see how good a scourger you would be (but use a tree rather than a person…). You will find that it is remarkably difficult to flog someone while standing behind them to their right (assuming you are right handed). Perhaps the Romans employed pairs of both right and left handed experts to administer their punishments, or the right hand man used back hand. Finally Colin makes a perfectly valid point about the fact that so many of the marks are clearly distinct that they can be counted with some precision, when lumps on the end of strings tend to clump together into an amorphous contusion. Someone on the internet has made his own ‘replica’ of a flagrum looking a bit like a garden leaf rake, with the thongs attached to transverse bands to separate them, which, he declares, is the only design which could result in such distinct wounds..","date":"2014-08-10","mins":"6:48 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-207165","author":"hugh_farey","post":"“Incidentally there has been some uninformed critique of the Quad Mosaics that they were originally black and white and then colorized.” It seems that Barrie Schwortz is the origin of this uniformed critique. In “https://www.shroud.com/pdfs/quad.pdf” he makes it perfectly clear that the Quad Mosaics were indeed originally black and white and then colorised. They were indeed taken through different filters, so that each black and white original contained information relating to colour, but the colour later assigned to each photo, or combination of photos, after scanning, required extensive manipulation, as he describes. To call them multi spectral digital images is a little more generous than they really deserve, in my opinion..","date":"2015-08-01","mins":"2:28 pm","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","title":"Remembering an Earlier Posting About The Seamless Robe"},{"id":"comment-143366","author":"hugh_farey","post":"No. What I mean is that if Flagrum Model A produces a scourge pattern resembling that on the Shroud, then Flagrum Model B doesn’t. I have seen pathologists fitting both versions to the same set of marks, which doesn’t make sense. Both designs cannot produce the same pattern of prints. All the other scratches, cuts and general bashing about as suggested by Fancini could have occurred at any time, but the two model flagra are, I fear, flagrantly contradictory..","date":"2014-08-11","mins":"5:39 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143451","author":"hugh_farey","post":"There are no sources; that’s my point. The carving which turned up in the lithostrotos is a circle divided into eight, with three other marks close by, which may or may not be related; some concentric squares, an oval with lots of little lines attached, and a circle marked with the letter B. Similar, but not identical patterns turn up here and there around the Roman Empire, and they are usually interpreted as game boards. What games they were used for and how you played them is a matter of total conjecture..","date":"2014-08-11","mins":"9:17 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143370","author":"hugh_farey","post":"Primary sources are everything, I’m afraid. For what it’s worth, I do not think there is a shred of evidence for any such game as the “Game of Kings,” nor that the pattern on the floor of the lithostratus was in any way connected with such a thing. The whole concept was cobbled together from the bible after the stone was discovered. Sorry Daveb, but that’s my innate scepticism again!.","date":"2014-08-11","mins":"6:09 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-142949","author":"hugh_farey","post":"A detailed account of the Shroud’s move to Montevergine is given in http://www.bibliotecastataledimontevirgine.beniculturali.it (scroll down to “S” – La Santa Sindone Di Montevergine) but there is no mention of monks praying round the altar when the Germans arrived..","date":"2014-08-08","mins":"6:21 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","title":"Revised: The Day the Shroud Foiled Hitler"},{"id":"comment-19983","author":"hugh_farey","post":"I’d be interested to see a quotation from Adler concerning the disturbedness of the bloodstains. Have you access to it? In his first Applied Optics paper (1980) he refers to a sticky tape sample he received, in which, among “several hundred linen fibrils” and assorted other debris, he found “less than a dozen possible bloodstained fibrils and a single brownish red translucent crystal.” That seems to me remarkably little to be extracted from a ‘whole’ bloodstain. Furthermore, have you looked at, for example, the Shroud Scope image of the back of the head? All the bloodstains have a curiously bubbly appearance, whitish in the middle and darker round the outside, which I attribute to lumps of encrustation falling off, or possibly remaining on a ‘body’ when the cloth was peeled off. What do you think? Furthermore, the pale weave of the cloth is plainly visible over every one of the stains. If this is abrasion of the surface, it is far from microscopic, and if not, then where did the blood which originally covered the threads go?.","date":"2012-12-07","mins":"1:17 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","title":"Secrets of the Shroud:  What say you all?"},{"id":"comment-19963","author":"hugh_farey","post":"Do we need to clarify what we mean by ‘undisturbed’? The bloodstains as they appear on the cloth now are clearly nothing like they would be if the cloth had been stained with blood and left undisturbed for hundreds of years. The whole thing has been heated, folded, soaked and goodness knows what else, and nearly all the blood has come off. Presumably the point is that the bloodstains show no smearing, so were undisturbed as long as they were wet. After they had dried, whether they were cementing a body to the cloth or were on the cloth only, then disturbance would have resulted in flaking and crumbling, without distorting the shape. Is that correct? If a body wrapped in cloth had covered it in bloodstains, and after they had dried the doth had been rearranged to provide a suitable film for the other form of image transference, the blood stains could have retained their initial shapes..","date":"2012-12-07","mins":"5:29 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","title":"Secrets of the Shroud:  What say you all?"},{"id":"comment-20122","author":"hugh_farey","post":"Thank you so much, Yannick. I don’t have Adler’s book and your quotes are very instructive..","date":"2012-12-10","mins":"5:26 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","title":"Secrets of the Shroud:  What say you all?"},{"id":"comment-20031","author":"hugh_farey","post":"Ah, yes, sorry, I do tend to get carried away by details, but so often I feel it is the details that are most subject to generalisations and innacuracy. The shroud’s dimensions have, I think, only been taken twice, and both are different, as one was before and one after the new backing was added. What’s more, I think it most unlikely that a 1st century cloth merchant would have had either a very accurate measure, or, indeed, would have cut his cloth accurately anyway. Try buying 4 meters of cloth today, and then measuring exactly how much you get. I don’t know anything about hand weaving in the Middle East today, but has anyone actually researched whether looms are built to a specific width, and if so, how precise are they? It is clear that the shroud is about 4m x 1m, but whether that represents any particular standard I suspect would be difficult to prove beyond reasonable doubt..","date":"2012-12-08","mins":"7:59 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","title":"Secrets of the Shroud:  What say you all?"},{"id":"comment-20029","author":"hugh_farey","post":"Pursuing Dave B’s excellent ideas, I would like an exhibition/presentation actually to do some of the experiments which might confirm, deny or at least demonstrate the arguments put forth. It may not be possible to get bits of actual shroud, but microscope slides of pollen from the environs of Jerusalem can be compared to the any material presented by the “pollen men”; lumps or powder (or thin sections) of the relevant limestone can be compared to the findings of the “limestone men”; Samples of linen, subjected to various conditions of heat (even samples of ancient linen if available) can be tested for vanillin; models covered in wet paint can have cloths wrapped or draped or simply laid over them (a paint made from pure cocoa powder and water is fun if you use live models); photographs of faces, face on, with dark backgrounds and lit from in front can be analysed live in Photoshop to show brightness contours, etc. I find myself that presentations tend to be full of what ‘would have happened,’ which, however interesting, do not capture the imagination half as much as “look at this.” I have been interested in the shroud for over 40 years, but nothing has actually excited me more than just last month, and actually seeing the fluorescence produced by scorching linen with a brass ornament. Chemical experiments with real myrhh, aloes, ammonia, urea, sodium hydroxide and any other chemicals that may be relevant are possible as well..","date":"2012-12-08","mins":"7:48 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","title":"Secrets of the Shroud:  What say you all?"},{"id":"comment-209305","author":"hugh_farey","post":"Just one little inquiry… “And when one considers that ,D’Arci’s successor in the See of Troyes, Bishop Louis Ragon, believed the Shroud to be genuine and permitted its open veneration…” From the list of bishops of Troyes at wikiepedia, we find that D’Arcis was succeeded by Etienne and then Jean, before Louis took over in 1450, by which time the Shroud had long left Lirey, never to return. Have we any evidence for Bishop Louis opinions?.","date":"2015-08-30","mins":"9:31 am","url":"https://shroudstory.com/2015/08/30/show-me-prove-it/","cat":"history","title":"Show Me. Prove It."},{"id":"comment-1849","author":"hugh_farey","post":"Just checking in, so you know I’m still here. I’ve posted quite extensively on shroudstory.com about some of the things wrong with the Colorado paper, and just recently some of the problems with the bloodstains so glibly accepted by Stephen E Jones et al. His illustrative picture, I think, began life as an ordinary black and white Enrie negative, not a UV photo at all. It has been manipulated into ‘brightness contours,’ and the lightest ones have been coloured red. They could have been green or blue – indeed a wide variety have been published – but Jones chose this one. The bloodstains being the darkest parts of the shroud, they naturally coincide with the brightest contours, but the colour is entirely coincidental..","date":"2013-02-19","mins":"10:34 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/19/shroudie-alert-day1/","cat":"medieval_forgery","title":"Shroudie-Alert: Day1.Chief topic: the Lirey Pilgrim’s Badge and that enigmatic chain…"},{"id":"comment-1860","author":"hugh_farey","post":"There are some huge enlargements of the Lirey badge at http://www.sindonology.org/papers/cluny Souvenir.shtml which may help with your hunt for pincers, chains, etc..","date":"2013-02-22","mins":"10:05 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/22/shroudie-alert-day-4/","cat":"cluny_medallion","title":"Shroudie-Alert: Day 4. Mainly about the Lirey badge, the Cluny Museum, Pope Benedict XVI and the remarkable staying power of junk science…"},{"id":"comment-1853","author":"hugh_farey","post":"Until Jones’s comments on bloodstains appeared on Shroudstory, I was reluctant to comment on them in general as I don’t have access to a lot of blood with which to play on cloth. I have hopes of roadkill as the spring warms up! The fact is I don’t know what the difference would be between the appearance of a bloodstain painted onto an image of a hand, and a bloodstain formed by a wound in that hand. Would the edge of a hole in a body leave a distinctive mark on cloth? I just don’t know. I won’t, of course, post any comments on Jones’s own site as we are working from such different premises that the reconciliation of our ideas is impossible. He believes it is axiomatic that the shroud is the burial cloth of his risen Lord, a view I entirely respect, and that therefore any supposed objections are by definition false and must have a different explanation. I am reminded of the Geocentric model of the universe, every objection to which, being by definition false, had to be explained by more and more convoluted epicycles. I cannot say how likely Jones’s model is to suffer a similar fate, but, not accepting his axioms, contra principia negantem non est disputandum, as Aristotle may have said. Except he probably said it in Greek….","date":"2013-02-19","mins":"8:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/19/shroudie-alert-day1/","cat":"medieval_forgery","title":"Shroudie-Alert: Day1.Chief topic: the Lirey Pilgrim’s Badge and that enigmatic chain…"},{"id":"comment-45064","author":"hugh_farey","post":"There’s a two part article in Shroud Spectrum International by Luigi Fossati. Http://www.shroud.com/pdfs/ssi12part4.pdf.","date":"2013-09-22","mins":"6:24 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45165","author":"hugh_farey","post":"Have a look at the Psalter of Melisende (http://www.bl.uk/onlinegallery/sacredtexts/images/zoomify/melispsalterzoom.html). It is one of the earliest “Three Marys” I’ve come across (about 1130 or so), and reputedly made in Jerusalem, for the Queen of Jerusalem. As such, the illustrator had a better chance than many accurately to depict the holy sepulchre as it then was. Following the earliest traditions, the tomb is shown as an upright door, and the “stone rolled away” is presumably the square block upon which the angel is sitting. Later (Western, apparently) tradition adopted the box like tomb, and the tilted lid for the angel to sit on. Where this came from I don’t know, but the illustration before the Three Marys in the Melisende Psalter shows the Harrowing of Hell, where the dead are emerging from boxes rather than doors. Points to note are the appearance of the marble tombs – reddish, and with irregular Xs to depict the marbling; and the shroud and headband, which appear to be transparent. There is also the pointing angel (with a sensible four visible fingers) and the white grid under the cloths, which appears in one or two 12th century images before disappearing for ever. Also relevant, but not terrible helpful so far (to me anyway) are the “Angel’s Stone” and the “Stone of Unction” which are in the church of the Holy Sepulchre to this day, which may be the origin of some aspects of the illustrations. I think that out of context, the similarities mentioned in so many posts might lead me too to suppose that the Pray manuscript is evidence of the contemporary existence of the shroud, but the more I find new (to me) illustrations of medieval psalters the less I am convinced. Neither side has yet found the smoking gun that “proves” things one way or the other, but as Matthias says higher up this thread, it’s fun exploring!.","date":"2013-09-23","mins":"5:39 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45069","author":"hugh_farey","post":"Sorry; pressed Post too soon! The second part of Fossati’s article is not yet published online. The best known (the only one?) copy from before the 1532 fire is the Lierre one, which is discussed in http://www.shroud.com/vanhels2.htm, but without a picture, although there are plenty on the internet if you Google them..","date":"2013-09-22","mins":"7:06 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-215725","author":"hugh_farey","post":"I cannot find that lead is ever alloyed with silver. Mostly it’s copper. Indeed, Wikipedia tells us that the medieval world went to considerable lengths to remove lead from silver, using cupellation. There is no mention of putting it back again..","date":"2015-12-06","mins":"10:30 am","url":"https://shroudstory.com/2015/12/06/ssg-member-wants-to-know/","cat":"history","title":"SSG Member Wants to Know"},{"id":"comment-44994","author":"hugh_farey","post":"What exactly “is clearly a shroud”? I’m a bit lost here. If you mean that the sepulchre lid, which is shown in almost identical orientation in dozens of similar images before and after the Pray manuscript, and which bears a number of concentric zig zag patterns emanating from at least six centres around its perimeter, “is clearly a shroud,” then I beg to differ. If you mean the untidy pile of cloth dumped on the lid, which spreads out towards the angel’s feet and is marked by ‘X’s and two wiggly red lines along the hem, then I concur. However, I have to say that neither of these is sufficiently similar to the Turin Shroud to “prove the carbon date is wrong.”.","date":"2013-09-21","mins":"2:26 pm","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-43290","author":"hugh_farey","post":"Good to see provincial newspapers catching up. See http://www.nytimes.com/2002/09/14/arts/was old map faked to tweak the nazis.html..","date":"2013-09-08","mins":"9:35 am","url":"https://shroudstory.com/2013/09/08/so-is-the-vinland-map-fake-after-all/","cat":"history","title":"So is the Vinland Map fake after all?"},{"id":"comment-215814","author":"hugh_farey","post":"I mean, “He suggests silver is not generally alloyed with lead, nor ever has been”..","date":"2015-12-07","mins":"1:29 pm","url":"https://shroudstory.com/2015/12/06/ssg-member-wants-to-know/","cat":"history","title":"SSG Member Wants to Know"},{"id":"comment-215799","author":"hugh_farey","post":"Hugh is, of course, entirely correct. Hugh does not say that a silver/lead alloy is impossible, nor that such an alloy is wholly unknown, nor that no lead has been found on the Shroud. He suggests silver is not generally alloyed with silver, nor ever has been, which I challenge Louis to refute, if he thinks I am mistaken. If, in fact, there is a secret alloy known only to a few cognoscenti, including Louis, of course, about which, of course, he is sworn to secrecy, then I do not think my opinion has been discredited. I do not believe that the damage to the Shroud was the result of the fire in Chambery chapel… And some Bhutanese coins are made from a silver/lead alloy, so maybe the Shroud is Himalayan….","date":"2015-12-07","mins":"9:14 am","url":"https://shroudstory.com/2015/12/06/ssg-member-wants-to-know/","cat":"history","title":"SSG Member Wants to Know"},{"id":"comment-39013","author":"hugh_farey","post":"Sorry to be a spoilsport, but as usual Stephen E. Jones relies rather too strongly on secondary sources which don’t always match up to primary evidence. 1) “When examined under a microscope, each scourge mark reveals a slightly depressed center and raised edges.” Not to me it doesn’t. The excellent Shroud Scope is available to everybody, and the Shroud app to those with an i Pad, and I simply can’t find any “depressed centres” or “raised edges.” Can anybody else? 2) “Under ultraviolet light each scourge mark can be seen to have a “halo” of lighter colour surrounding it.” The only UV photos I have are from Miller and Pellicori’s paper, but their photos blow up very well. The whole of the back of the image shows general background fluorescence, and the scourge images do not show any particular extra brightness around them. Does anyone find that there are? 3) “These halos were chemically tested and found to be blood serum which is left behind after a blood clot forms.” Really? Who by? 4) “This is further evidence that the Shroud could not have been created by an artist in the Middle Ages because that knowledge about blood clot structure, let alone a microscope and an ultraviolet light source to see them, did not then exist for many centuries into the future.” Dripping blood onto a cloth does not require any knowledge at all. Children with nosebleeds do it all time. 5) “Each one of the over 100 scourge wounds on the Shroud matches exactly what would have been caused by a type of Roman flagrum buried in the eruption of Mt. Vesuvius in AD 79.” I cannot find any evidence at all that the reconstructions of Roman flagra, of which there are two main modern versions and several interpretations from the 19th century, are based on any archaeological artefacts. Has anyone seen any? Rich’s “Dictionary of Greek and Roman Antiquities” (1874) has an illustration “copied from an original found in Herculaneum” which appears to be made entirely of metal and looks nothing at all like more modern versions. Where is it now? The words “flagrum” and “plumbatum” bring up nothing in the Archeological Museum of Naples or British Museum websites. In the absence of anything to compare them with, it cannot be said that any of the marks on the shroud “matches exactly” any original flagrum. 6) “So a fourteenth century or earlier forger would have had to possess a faultless archaeological knowledge of a first century Roman scourging with a flagrum.” As it happens, the flagrum held by one of the scourgers in the 14th century Buoninsegna painting in Jones’s article is an almost exact copy of his reconstruction of a flagrum just above it, only with four thongs instead of three. Faultless archeological knowledge. 7) “But the scourge marks on the Shroud are depicted with a realism that is unknown to the art of any period.” For “realistic” scourge wounds, try “Philippines” “flagellation” on Google images. The marks on the shroud bear no comparison..","date":"2013-07-15","mins":"7:30 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-39039","author":"hugh_farey","post":"Hi Jesterof. No I’m not a physician, but I am a biology graduate, so perhaps gave that impression. The point about my nosebleed remark was not that any of the marks were made by a nosebleed, but that if any of the blood was added by a forger for verisimilitude, he would not need any technical knowledge, just a sponge. Jones’s claim, which attempts to refute the possibility of a Medieval artist on the grounds of lack of microscopical or ultra violet knowledge, doesn’t make sense. Regarding your point about the difference between blood from a dead body and a live one, the picture is extremely complex, and the shroud is not clear enough for an apples/oranges distinction to be made. As I mentioned, it is possible that the body was washed clean shortly before being laid on the shroud, and that the scourge marks on the back are the result of wounds reopening, or simply seeping. These might be characterised by a lack of red blood cells and an excess of plasma (as you might find by removing a dressing from an open wound before it heals). On the other hand, a forger with a bowl of blood (maybe from a patient who had recently undergone bloodletting) would find he too would have to use it quickly before it too became more plasma than red cells. My own experiments indicate that blood is not at all an easy medium to paint with….","date":"2013-07-15","mins":"7:15 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-39060","author":"hugh_farey","post":"I think the body was probably not washed very thoroughly, and I agree that remoistened blood could make a mark. I have problems with the pattern, however, thinking that the back of the body was probably coated in blood, which, even if it had dried in the meantime, would also come off when remoistened. As for the medical experts, they all disagree with each other to some extent, and surely cannot be treated as Gospel. Fred Zugibe, for example, wrote an entire paper entitled “The man of the shroud was washed.” I don’t want to get into a “My medical expert is better than your medical expert” squabble, but, as I say, they do disagree, sometimes profoundly..","date":"2013-07-16","mins":"4:01 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-39021","author":"hugh_farey","post":"Thanks, David. I think the point about the Philippines chaps is that it doesn’t take long for the back to be an overall mass of blood, not a delicate collection of blobs, regardless of implement. It is, of course, possible that the body of the shroud was washed, and began to seep again, which might produce patterns like those on the shroud, but to claim that we “know” that the image on the shroud is “realistic” is pushing things, I think. And, no, I’ve no idea how the blood came to appear on the shroud, but I do claim that you don’t need any technical expertise to put it there. And finally, I agree that the marks look as if they were made by two people, of different statures. In fact I don’t recall ever seeing a painting where that wasn’t the case, so I don’t think it requires a leap of imagination such that the pattern of the marks on the shroud, in themselves, constitute evidence against forgery. There is an interesting discussion of this at http://naturesdesignsonline.com/Cat of nine tails.htm, where Joel Donahoe, in an otherwise rather over imaginative essay to my mind, says that unless one of the scourgers was left handed, the man to the right of the victim would have to stand with his body turned away and use his whip back handed. Maybe that would explain some of the asymmetry..","date":"2013-07-15","mins":"10:38 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-113636","author":"hugh_farey","post":"Yes.There is an obvious corollory, I suppose, which is that Man of Sorrows iconography emerged from epitaphios art in the 13th century, and having achieved a style, was relatively slavishly copied, certainly as to the position of the side wound and the inclination of the head, and the shroud was simply a part of this tradition, modified to represent a reposing rather than an arising Christ, as it was intended to be laid flat rather than elevated. Are we beginning to find the artistic context I have been hunting so assiduously? Incidentally, all the examples of the Man of Sorrows illustrated above post date the shroud, and if not derived from an independent tradition (which I think they were) could as easily have been derived from a 13th century painting as a 1st century relic..","date":"2014-05-07","mins":"6:49 am","url":"https://shroudstory.com/2014/05/06/ten-reasons-to-believe/","cat":"history","title":"Ten Reasons to Believe"},{"id":"comment-32144","author":"hugh_farey","post":"Blimey Max! A run of 27 posts (16 in a single succession) doesn’t half make it difficult to notice anything else! Can’t you jot all your thoughts for one evening on a word document and then send us the whole lot just before you go to bed?.","date":"2013-04-28","mins":"10:46 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"id":"comment-113713","author":"hugh_farey","post":"Yes, well, it’s a bit of a work in progress!.","date":"2014-05-07","mins":"8:50 am","url":"https://shroudstory.com/2014/05/06/ten-reasons-to-believe/","cat":"history","title":"Ten Reasons to Believe"},{"id":"comment-214209","author":"hugh_farey","post":"Thanks, OK; very interesting..","date":"2015-11-04","mins":"2:13 pm","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214106","author":"hugh_farey","post":"I see that the original correspondents were designing “a map of Europe with all the seamless clothes” they could find. How many more are there, apart from those of Argenteuil and Trier? And what about the lendentuch of Aachen?.","date":"2015-11-02","mins":"5:54 pm","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-27699","author":"hugh_farey","post":"Thanks, Max. I see this was quite well covered before I joined in this blog, in a post called “A Pointless Discussion of the Hungarian Pray Manuscript.” There, you quote M. Van Cauwenberghe, in his identification of the music at the bottom of the Christ Enthroned scene with the Easter ‘Exultet’ which even I can see now, and it is clearly in Latin. The writing above is more difficult to decipher, but I think I can make out “et dixit Lazaro veni foras” which is close to the Vulgate version of Jesus’s calling of Lazarus out of his tomb. Above it are “salvatorem mundu” (Should be mundi) and above that a definite “baptista.” Clearly not a single quotation fro the bible, but definitely Latin. There appear to be several more “salvator”s and “veni foras”s elsewhere in the text. Can anybody get any closer? Above the anointing scene it is even more difficult to make out the words. Do they begin: “In principio creavit deus caelum et terram”?.","date":"2013-03-18","mins":"5:45 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-27621","author":"hugh_farey","post":"The whole Codex seems to consist of a variety of unrelated papers which came together some time between the first one being written/drawn and Gyorgy Pray finding them in 1770. All the writing I have seen seems to be in fairly conventional Latin style (even if the language is sometimes Hungarian) rather than the runic referred to above. The famous Funeral Prayer, however, is written in a much neater and clearer hand than the writing on the pictures, which is almost indecipherable. And although the Funeral Prayer is in Hungarian, I think the writing on the pictures is in Latin. Although the whole codex is clearly an important collection, I cannot find any books or online articles which treat it as a whole, which I find extraordinary. Wikipedia tells me it also contains a missal, a mystery play, songs, laws and a list of kings. Any or all of these might have some relevance to the interpretation of the pictures. (Could, for example, the pictures be illustrations of the mystery play?) I doubt if the lowercase ‘a’ is a reference to Alpha (as a symbol of godhead or resurrection), which is invariably capitalised..","date":"2013-03-18","mins":"6:44 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-27769","author":"hugh_farey","post":"I agree it’s nothing like the ‘a’ in the body of the text – but to me it’s still an ‘a’ of sorts, probably made with three strokes of the pen which didn’t coincide. I wonder if it’s a later annotation? Back on Picture 4, Christ Enthroned, the text is full of long abbreviations. Could they be numbers, or better still dates?.","date":"2013-03-19","mins":"5:54 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-73904","author":"hugh_farey","post":"No you did not read anything of the kind. You may have read: “Because it was not known to what degree dirt, smoke or other contaminents might affect the linen samples, all three laboratories sub divided the samples, and subjected the pieces to several different mechanical and chemical cleaning procedures. All laboratories examined the textile samples microscopically to identify and remove any foreign material.” (From Radiocarbon Dating of the Shroud of Turin, Damon et al. Nature, 1989).","date":"2014-01-21","mins":"3:55 am","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"id":"comment-73926","author":"hugh_farey","post":"The labs were careful to make sure that all contamination was removed, both physically, by vacuuming, ultrasound and tweezers and chemically, by solution in acids and alkalis. The cleaning process happens in a closed bath, and I do not know if any note was taken of the colour of the waste cleaning fluid to see if it had extracted anything. Probably not. They then tested pure, uncontaminated, specimens. If cotton was an intregral part of the specimen, then they tested that. If it was merely a surface contaminent, then they didn’t. They did not fail to identify contaminents. Oxford even sent a thread off to have it identified, while others mention, in particular, red silk fibres and shreds of wax. These were removed. So what was Rogers’s cotton, dye and gum arabic? The answer may lie in his Diagram 18, in Scientific Method Applied to the Shroud of Turin (http://www.shroud.com/pdfs/rogers2.pdf). Although it is labelled “UV Fluorescence photograph” it looks nothing like one, and much more like an ordinary photo, but that doesn’t matter here. What is important is that the backing cloth under the Raes sample area is bright white, while the rest of it is much darker. This suggests to me that some attempt was made to stain the backing cloth to make it ‘fit’ the shroud better, quite possibly by smearing it with a cotton pad damp with a mixture of dye and gum arabic. Such a process would only affect the surfaces in contact with the cloth (which is why the backing cloth under the Shroud stayed white) and liberally scatter cotton, dye and gum over the margins of the shroud. Needless to say, all this gunk was removed and had no effect on the C14 dating..","date":"2014-01-21","mins":"10:06 am","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"id":"comment-73976","author":"hugh_farey","post":"The raison d’etre of the BSTS is to investigate the Shroud in all its aspects. Just because one man, even if he is the editor, throws doubt on one particular hypothesis doesn’t of itself mean that the question of authenticity is solved, and even if it were, it would not detract from the fascination the image inspires of so many people, and its pre eminent position as an icon of Christianity. I don’t know how many “opponents of the Shroud” Jeff knows, or knows about. I know several, and can assure him that they are not “willfully determined to ignore any evidence favouring authenticity.” On the contrary, I often find that the reverse is the case. There are commenters on this very blog who declare something along the lines of “either the Shroud is genuine or it is the work of Satan so anybody who denies its veracity is one of his ministers.” I am inclined towards a 13th century origin for the Shroud, mostly on the basis of the C14 date which I do not think has been satisfactorily discredited. If that makes me an ‘opponent,’ I should be grateful to know if there is any evidence at all that I appear to have ‘willfully determined to ignore.’.","date":"2014-01-21","mins":"3:00 pm","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"id":"comment-114079","author":"hugh_farey","post":"No it doesn’t. Sorry, OK, I think you’ll have your work cut out to rationise even the most rational of these, let alone the nappies of the infant Jesus, or the 2000 year old rod of Moses..","date":"2014-05-07","mins":"6:14 pm","url":"https://shroudstory.com/2014/05/07/the-letter-from-alexius-comnenus/","cat":"history","title":"The Letter from Alexius Comnenus"},{"id":"comment-69507","author":"hugh_farey","post":"“Do we often enough look for alternate explanations?” Well, some us do! Mostly to be called far fetched, without merit, or fools. For instance… The Vignon ‘double crease.’ Well it doesn’t exist, does it? It appeared as an artifact of Giuseppe Enrie’s photographs (heavily manipulated in your photo above), but was not present on Secundo Pia’s, and is, of course, not present now, when the Shroud has been pulled flat. It is not very pronounced even on Enrie’s photo. Even if it ever did exist, why should it have been present a thousand years ago. There are creases, indeed, but they are more likely to have been produced by the rolling of the Shroud around a pole rather than when it was folded up..","date":"2013-12-28","mins":"10:06 am","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","title":"The Sciatica Effect"},{"id":"comment-113994","author":"hugh_farey","post":"“The more you study the topic of relics, the more convinced you are that the major part of them may indeed be authentic or “authentic” in some sense.” Er…. Not in my case..","date":"2014-05-07","mins":"4:10 pm","url":"https://shroudstory.com/2014/05/07/the-letter-from-alexius-comnenus/","cat":"history","title":"The Letter from Alexius Comnenus"},{"id":"comment-69626","author":"hugh_farey","post":"I also don’t deny that the crease did actually appear, for a while. Perhaps I should have written, “an artifact ON Enrie’s photos” rather than “an artifact OF Enrie’s photos.” My apologies..","date":"2013-12-28","mins":"4:03 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","title":"The Sciatica Effect"},{"id":"comment-74028","author":"hugh_farey","post":"Sadly, I can’t provide pat replies for every anomaly observed on the shroud, and I agree that the vanillin question certainly deserves more investigation. Also, although they did not discuss the cause, I was impressed by Riani and Atkinson’s statistical analysis of the chronological gradient along the sample strip. I don’t know where you get your age range from. The Nature paper gave 1390 1260, although I believe 1330 1260 is a better assessment. As for a 13th century creation. If the image is intended to represent Christ it is hardly surprising that it shows the marks of the wounds as listed in the Gospel. How accurate they are we cannot guess, in the absence of any archaeological evidence – they may be hopelessly wrong. And it was not necessarily a deliberate forgery by a far fetched cult. Byzantine Christianity specifically requires that mass be said on a symbolic shroud, Byzantine altars are wrapped in symbolic shrouds, and Byzantine priests are given a symbolic shroud when they are ordained. Symbolic shrouds are paraded through the streets at Easter tide. Many of these are elaborately decorated with representations of the dead Christ. There were, and are, a lot of symbolic shrouds about..","date":"2014-01-21","mins":"7:06 pm","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"id":"comment-69654","author":"hugh_farey","post":"The biggest Pia photo I can find is at http://parislike.com/ckfinder/userfiles/images/Paris Like   Holyhood   Suaire Secondo Pia.jpg. Pia’s photos can be distinguished from others by a distinctive blob close to one end of the “chin crease” which is not present in Enrie’s photos (at, say http://www.artfinding.com/images/svv/2/325/cav g. enrie turin  il santo volto le saintsuaire 109 1.jpg). By the time we get to Vernon Miller’s photos (http://media.washtimes.com/media/image/2009/10/05/ITALY SHROUD OF TURIN Lea.jpg) we seem to have lost the “top of head” crease as well as the “neck crease.” It is clear that creases come and go, and their visibility probably depends as much on the light source as anythinhg else. As you can probably guess, I’m not overly convinced of any of the Vignon markings, but this crease was the one mentioned by Dan, above..","date":"2013-12-28","mins":"5:47 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","title":"The Sciatica Effect"},{"id":"comment-27662","author":"hugh_farey","post":"Interesting speculation, Max. Are you alone in your interpretation or are there other steganographers of similar mind? I confess I myself cannot see anything corresponding to Joseph Almos except that A..","date":"2013-03-18","mins":"12:57 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-51867","author":"hugh_farey","post":"My mistake; just rushing. 8 x 2 of course, not 8 x 4..","date":"2013-11-18","mins":"7:33 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51923","author":"hugh_farey","post":"Well, if we knew that, we’d know where the shroud was made, wouldn’t we!.","date":"2013-11-18","mins":"4:00 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51931","author":"hugh_farey","post":"The only 39 inch ells I can find are in Scotland. Coupled to the fact (!!!) that herringbone weaving was more common in northern Europe than southern, or the middle east, that clearly shows the Shroud was made in Scotland…..","date":"2013-11-18","mins":"4:33 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51943","author":"hugh_farey","post":"“Here we have a linen cloth of exactly 8 x 2 Assyrian cubits.” All I meant was that here we have a cloth, four times as long as it is wide, of the sort of width cloth often was from about 2000 BC to 1500 AD. I wouldn’t dream of saying there was any conclusive proof of anything more definite to be derived from its dimensions. Would you?.","date":"2013-11-18","mins":"5:22 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51885","author":"hugh_farey","post":"Don’t you just love Mark’s “the international standard unit of measurement”? Excluding the ridiculous (Gungnae Fortress, Korea, anyone? or the Sanchi Stupa in India?), was the Colosseum built to Assyrian cubits? Or even the Roman military forts in Africa, Europe or.. Assyria? More seriously, does anyone know of any archaeologically derived dimensions of any Herodian buildings (Massada, say?) which might more sensibly be thought of as using a “national standard unit of measurement”?.","date":"2013-11-18","mins":"11:25 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51955","author":"hugh_farey","post":"I do love this site; you get to discover so many things. Such as this, from http://www.eifiles.cn/ic en.htm, “Onsite cubit measures of Temple foundation stones have been discovered at Jerusalem’s Temple Mount; the incised notches show the precise locations and orientations of the First and Second Temples on Jerusalem’s Temple Mount and reveal the exact lengths of the cubit measures. Israel’s three cubits are called ‘medium cubits’ in historic reference. The three ‘medium cubits’ are different by an approximate half digit. The shortest cubit is the first or former cubit from Moses’ time. This was the cubit of the First Temple (2 Chron. 3:3). As this is the cubit given by Moses, the Tabernacle was based on this cubit. The obtained measures are 42.857142 cm. When the Jews returned from Babylon they brought with them two measures: the small and large cubits. The second temple was built using the small cubit. The large cubit was used daily and became the standard cubit of Roman times. The obtained measures of the small cubit average 43.7 cm. The obtained measures for the large cubit average 44.5 cm.” I cannot find from where Dickinson derives his claim that there was an international standard unit at all, nor why he should think it was an ancient Assyrian one. Cubits had generally declined in length from the Royal Assyrian cubit of 700 BC. It appears that if the shroud really is 8 cubits long, it was either made before 700 BC or after 700 AD… I’m still going for Scotland, myself… a Viking chieftain, maybe… did the Vikings use leeches?.","date":"2013-11-18","mins":"8:03 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51920","author":"hugh_farey","post":"The ell was a highly variable medieval unit of distance specifically for cloth. The is no question at all that the shroud corresponds exactly to 8 x 2 ells somewhere in Europe at some time..","date":"2013-11-18","mins":"3:53 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-76420","author":"hugh_farey","post":"From the left, before the tip of the shield, an E (possibly missing an L for LE). In the middle, SVAIRE: (or SUAIRE, in Roman Letters), and then maybe Ih V and C after the tip of the second shield, which Alain Hourseau (at http://www.sindonology.org/papers/cluny Souvenir.shtml) suggests may be the Greek letters IEVS, and perhaps a cryptogram for JESUS. I’m not convinced of that, but can’t think of a better alternative off hand..","date":"2014-02-04","mins":"6:49 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76592","author":"hugh_farey","post":"Occam again, but I’m still not happy. The Greek Letters Ih V.C are not a monogram for Jesus. They transliterate to IEUS, which just isn’t right. Ih S or IHS would be normal, but the extra U is odd. Even IESU would do, but not IEUS. Ian Wilson commented that this was poor quality. Perhaps it was so poor it was never used – wrong spelling, coats of arms the wrong way round, a Friday afternoon job by a clumsy apprentice. That makes sense..","date":"2014-02-04","mins":"8:00 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76737","author":"hugh_farey","post":"Fascinating. As I said before. And I wonder if any of it is true. As I also said before. What we really need is some kind of evidence, don’t we….","date":"2014-02-05","mins":"10:12 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76826","author":"hugh_farey","post":"You may be right, of course. Or wrong. A little evidence would help..","date":"2014-02-05","mins":"5:33 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76454","author":"hugh_farey","post":"The sindonogy site does indeed render the inscription as the Shroud of Jesus. More specifically, it was Alain Hourseau who made the identification. However, his words regarding the part of the inscription after SUAIRE are “It is followed by the three greek letters iota, eta, and sigma which would be the abbreviation for “the Shroud of Christ.” This seems to me a little odd. For a start he does not seem to notice the prominent “V” which forms part of the second inscription; for a second it seems unnecessary to include an abbreviation for ‘shroud’ when it already appears in full just beforehand, for a third it seems odd to switch from French to Greek for the abbreviation, and for a fourth I cannot see how IEUS (or IEUC) can be a abbreviation for “the Shroud of Christ” in any language. Explanations for these four anomalies may be more obvious to you than to me, or does Occam’s Razor allow you to pretend they don’t exist?.","date":"2014-02-04","mins":"8:49 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-28089","author":"hugh_farey","post":"Thibault! Good to hear from you again. I appealed to you here a while ago, as I have my own problem with bilirubin. Nothing to do with its stability, but how does it make carmine? I’ve been mixing brown and orange paint (methemoglobin and bilirubin), but they just don’t make red. Can you help?.","date":"2013-03-22","mins":"4:59 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-69625","author":"hugh_farey","post":"I agree that rolling the shroud round a pole is a recent way of keeping it. I also think that the majority of the visible creases on the shroud were created by this method of storage, possibly quite recently. That’s why the “double crease” was not present on Secundo Pia’s photos (having arrived between 1898 and 1931), and nor, in my opinion, at the time of all the Byzantine paintings purporting to be copies of it. I’m familiar with all the folding patterns implied by the various scorches and watermarks, and even John Jackson’s somewhat contrived display pattern, but do not think that the “hard creases” we see in the Enrie photo can be made by folding the shroud in that fashion..","date":"2013-12-28","mins":"3:59 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","title":"The Sciatica Effect"},{"id":"comment-76844","author":"hugh_farey","post":"Something comprehensible at last, albeit still odd. IHS for the nominative and IHU for the genitive does make sense, and I’ve even found a reference for it – early editions of Chaucer’s “Prioress’s Tale.” LE SUAIRE IESU” then. The Shroud of Jesus. With a spare C at the end..","date":"2014-02-05","mins":"7:17 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-28364","author":"hugh_farey","post":"Time for me to weigh in. Like a couple of other researchers, Baimas Bollone postulated, but did not test, that the red colour of the blood might be due to bilirubin. Bilirubin, as we know, is orange, not red. The Goldonis took his idea a stage further by adding bilirubin to blood to observe the effect. Even at “5 times greater than the normal physiological concentration” no colour change was observed until a set of samples was irradiated for 6 hours with UV light, when all concentrations went “bright red.” They postulate that UV rays degrade the bilirubin into lumirubin and isolumirubin. Lumirubin is normally yellow. The rest of the Goldonis’ paper is not completely clear to me. They seem to suggest the shroud blood only looks red in sunlight (not in artificial light), as a response to solar UV, which would normally be insufficient to have an effect. However, if blood is irradiated with neutrons, it appears to become more sensitive to UV, the red colour of their samples becoming obvious after only 30 minutes instead of 6 hours. They attribute the nuclear irradiation of the shroud to the resurrection. The Goldonis’ claim, that the shroud blood is especially red by UV radiation from the sun, is in direct contradiction to Pellicori and Miller’s findings that the blood did not fluoresce under UV light at all. Proponents of the forgery theory usually quote the unnatural colour of the bloodstains as an argument in their favour, and so far, those in favour of authenticity have yet to refute their argument..","date":"2013-03-25","mins":"5:41 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28365","author":"hugh_farey","post":"Thibault has just popped in a comment while I was writing the above, in which he says that a very small amount of hemoglobin has a very red colour. That may be so, but I had understood that the possibility of hemoglobin remaining intact was zero, hence the alternative explanations. Has anybody identified actual hemoglobin on the shroud, as opposed to its breakdown products?.","date":"2013-03-25","mins":"5:50 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28448","author":"hugh_farey","post":"Hi Thibault, I know nothing about the components of recent or ancient blood, so have to rely on the observations of others for information, upon which I can build my own conclusions – or lack of them. I simply ask, what is the red colour we observe on the shroud? Some say it is bilirubin, which is orange, and even after mixing orange and brown (to mimic methemoglobin) I cannot make red. Some say bilirubin fluoresces red under solar UV after treatment with nuclear radiation, and the shroud was so treated. Others deny that the shroud blood fluoresces at all. Some say that hemoglobin is red. Others say that there is no hemoglobin on the shroud. Does anyone have a coherent explanation for the red colour that is not denied by someone else? That is my question, and the point of my post..","date":"2013-03-26","mins":"7:19 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28451","author":"hugh_farey","post":"Oh I do meditate on all these things, and the more I meditate on them, the more uncertain I become. The scourge marks, for example – we have become so used to the “dumb bell” image that it comes as quite a shock to enlarge the Durante photo and observe that they look exactly like brush strokes. The humid blood clot exudate – does this mean the blood was dry and then made wet again, or did it never dry? If the first, then how did it get wet again, and if the second, how did it stay wet for so long? The nakedness – while it is true that only Michaelangelo shows genitalia, a large number of paintings show a naked Christ whose modesty is protected by something, maybe a wisp of very unrealistic cloth, or a raised leg. Remarkably, it is the icons made before 1300 that nearly always show a properly loin clothed Christ, while the paintings after 1300 more often show a naked body. If the relative proportion of naked to clothed images alone were a true reflection of the provenance of the shroud, one would have to say that it was more likely to have appeared in mediaeval times than in antiquity. None of these, I agree, constitutes proof of inauthenticity; but all of them cast doubt, as least to my mind, about genuineness. I must remain, for the time being, undecided..","date":"2013-03-26","mins":"7:59 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28498","author":"hugh_farey","post":"A forger might create invisible serum halos if he painted the blood marks with blood, I suppose. Can dead bodies emit enough moisture to dampen dried blood, I wonder? I don’t think ammonia vapour by itself would do the trick, and am doubtful if dead bodies emit ammonia anyway. All in all, not wholly conclusive, if I may say so. And, exactly, my point, I cannot find naked images of Christ before the shroud was exposed, but I can find plenty after it. Naturally I attribute this to earlier artists not being aware that Christ himself had left a naked image of himself, while, as soon as the relic was ‘revealed for the first time’ in the 13th century, they immediately felt justified in imitating him..","date":"2013-03-27","mins":"12:26 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28393","author":"hugh_farey","post":"What I find fascinating about the shroud, Don, is that while every piece of ‘evidence’ that the shroud is a fake turns out to be readily disputable, so does every piece of ‘evidence’ that it is genuine. So far, I have not learnt enough about it to be convinced either way (or rather, I used to swing excitedly from one side to the other and have now ended up as undecided as when I first discovered the shroud in my teens). It may be that a more metaphysical approach is needed; and that the very fact that every fact is, in fact, disputable is itself evidence of the veracity, if not the provenance, of the shroud. Currently, on this level, the shroud is in a kind of quantum super position, which may, at the discovery of some new evidence, collapse into ‘burial cloth’ or ‘painting’ (or some variation), but part of me hopes that it remains forever unknown..","date":"2013-03-26","mins":"5:12 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28482","author":"hugh_farey","post":"I agree with every word, Matthias. However, the nakedness or otherwise of Jesus’s body is often claimed as an argument one way or the other (see Yannick, above), so I wanted to point out that if that were the sole criterion on which to base an opinion, one would have to go for the mediaeval rather than the ancient. Yannick nails his colours very firmly to his mast, which is quite refreshing, but it does encourage impudent attempts to shoot them down….","date":"2013-03-27","mins":"10:02 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-55563","author":"hugh_farey","post":"Very interesting. Http://www.bibal.net/04/proso/psalms ii/pdf/dlc tanakh pauls cloak b.pdf provides some intersting exegesis on the point..","date":"2013-12-03","mins":"6:15 am","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","title":"Translation: When you come, bring the Shroud of Turin"},{"id":"comment-171112","author":"hugh_farey","post":"Well, I know nothing about weaving but when did ignorance stop speculation? – as long as it is clearly flagged up as speculation. 1) “Tablet weaving”, if I’m correct, is both very old (something called the Rameses girdle springs to mind), and wholly unsuitable for making bolts of cloth with. Herringbone weave of various kinds is easy to do with it, but only in thin widths of a few inches. 2) Having removed that from the equation, I don’t think there are any examples of pre medieval herringbone twill from Southern Europe or the Middle East, nor of the four heddle loom necessary to make 3/1 twill. The earliest such twill and looms appear to be in China, and mostly used for silk. 3) In Europe, elaborate twills seem to be a northern thing, being found in Viking and Celtic excavations. Soem authenticists have suggested that the Shroud might have been an imported cloth from China or northern Europe. 4) I have not heard that there is no medieval 3/1 linen twill in European museums – only that there is no 3/1 linen twill that museums were happy to lose to act as a control for an unconnected exercise. 5) Is it being pedantic if I point out that the Shroud is not, in fact, herringbone at all? Technically it is a chevron weave ,which is not the same. Funny that nobody has commented on this before….","date":"2014-11-13","mins":"5:59 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171165","author":"hugh_farey","post":"“In textile both terms are used interchangeably.” Not by people who make herringbone and/or chevron twills, they’re not. There is a clear distinction, unrelated to the shape of the ends of flooring tiles, defined by the alternate staggers of the weft threads. However, I agree that the distinction is small, and that the word ‘chevron’ is often subsumed into the generic ‘herringbone.’ It’s still curious that nobody has noticed the distinction, don’t you think? And Louis, I know, and you know, that an accurate dating of the Shroud would be a huge step forward in our understanding of an extremely important religious icon. But it may be that the textile curators of the Louvre and V&A (fr example) don’t necessarily concur with our views..","date":"2014-11-14","mins":"2:58 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171186","author":"hugh_farey","post":"Thanks, Andrea; I agree with that. “Broken chevron” will do just as as well as herringbone. The Shroud, of course, is not “broken chevron.”.","date":"2014-11-14","mins":"6:14 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171118","author":"hugh_farey","post":"If I’ve got a sample of medieval tablecloth, I might spare a fragment for the dating of comparable cloths from a similar environment, but I might not want to send it off to act as a control for a religious relic..","date":"2014-11-13","mins":"6:31 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-214386","author":"hugh_farey","post":"Fortunately for his hypothesis, Stephen is misleading when he says the Shroud needs to be folded 20 times. It only needs to be folded in half three times lengthways in order to produce the eight layers necessary to reduce the width to 14cm, and in half widthways twice (32 layers now, length 109cm) and then in thirds once (96 layers) to reduce the length to 39cm. That’s 7 folds altogether, and it is not difficult to achieve, although it does crumple the shroud to the very limits of foldability, and leave it looking more like a flattened tube than a neatly folded cloth. For that reason the casket is not a very good box for storing the Shroud in, although, if the shroud needed a box, and that were the only box available, it would have done. A few posts ago, OK and Mario Latendresse had an interesting discussion about the sources of the story that Othon de la Roche had something to do with the Shroud, which I am not qualified to judge, but I do note that regarding “family tradition”, all Allesandro Piana had to say about it was this: “As far as the label put on the coffer, according to which the Shroud was in Ray sur Saône castle in 1206, it refers to an hypothesis guessed years ago from local historians, Dunod de Charnage and Perreciot. They stated that Othon, after appropriating of the Shroud, would have gifted it to the Besançon cathedral just in that year.” I’m not a great believer in “family tradition” at the best of times, and this isn’t even one of those!.","date":"2015-11-08","mins":"7:39 am","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"},{"id":"comment-214396","author":"hugh_farey","post":"Anybody interested can find Dunod de Charnage’s 1750 publication, ‘Histoire de l’église, ville et diocèse de Besançon’, at: http://gallica.bnf.fr/ark:/12148/bpt6k2985022. Page 401 et seq..","date":"2015-11-08","mins":"12:41 pm","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"},{"id":"comment-207549","author":"hugh_farey","post":"“Judeans prior to 50 CE were buried in a set of clothing used as shrouds (layers of clothing used as shrouds were found).” Not necessarily. Any evidence? I thought not. “Yeshua was dressed in a set of clothing …” [et seq.] I don’t believe any of that, and Max has not provided any evidence to suggest that it might be true. I agree that Diana Fulbright’s article is better in its philology than in its archaeology. Figure 1 is a piece of circular reasoning, to the effect that the Shroud is from a 1st century burial, so this must be the way 1st century burials were carried out, which is why the Shroud was wrapped around the body like this. David Mo is perfectly correct that the image on the Shroud of Turin does not match such a wrapping in any way. I think the point about Figure 2 is that the Egyptian mummy style wrapping does not seem to have emerged from Egypt at all, and that big sheets or one kind or another were typical. However David Mo is correct (again) in implying that the Khirbet Qaazone burials cannot be considered in any way indicative of normal Jewish burial practice and it is true that Fulbright misidentified the site. In my comment above I made a mistake in saying that she thought Lazarus was trussed mummy style – I misread her reference to the correct Figure for comparison..","date":"2015-08-06","mins":"4:59 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207463","author":"hugh_farey","post":"Diana Fulbright’s paper is masterly, and fairly convincingly demonstrates that the Greeks, at any rate, had no specific word which meant exclusively ‘cloth for wrapping dead bodies with,’ and that both sindon and othonia were fairly generic words for pieces of cloth, whose form and purpose were defined by their context. I am interested in her reference to Lazarus, who had no sindon or othonia, but was tied in keiria, which were definitely long and thin, like bandages (or tapeworms, suggest Liddell and Scott). Fulbright suggests Lazarus was trussed like an Egyptian mummy, which I should like someone to comment on – it does not seem to have been standard practice, judging from the few other burials we know about. Kim Dreisbach seems to think that the keiria were used to secure a sindon to the body, which leads to some interesting speculation about the contortions the risen Lazarus went through to free himself of his shroud without untying the keiria. In an astonishing piece of synchronism, I was just reading Fulbright’s section on byssus when a chapter all about it was read on the radio. It came from ‘Spirals in Time: The Secret Life and Curious Afterlife of Seashells,’ by Helen Scales. She does not think that the word byssus referred specifically to sea silk much before the 15th century. Nor, she finds, is sea silk byssus particularly diaphanous, describing the numerous samples she handled as ‘fluffy’ and ‘woolly,’ and not at all silky. A glove looks ‘thick and itchy,’ and a lady’s purse is a ‘furry’ object ‘that looks rather like a Scotsman’s sporran.’ The fibres are very light, though, such that if you hold out your hand and close your eyes you can’t tell when a clump of threads is placed on your palm..","date":"2015-08-05","mins":"5:20 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207611","author":"hugh_farey","post":"My real expertise, Max, is in identifying flim flam….","date":"2015-08-06","mins":"2:33 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-6591","author":"hugh_farey","post":"A while ago you were pondering about the burn holes, and whether they might have been designed to hide the fact that the shoulders were broken, as the figure was originally a crucifix. I’ve come across this recently: https://digilib.phil.muni.cz/bitstream/handle/11222.digilib/115545/1 Theatralia 14 2011 1 5.pdf?sequence=1 which includes some movable armed crucifixes from 1350. More grist to the mill! Happy Christmas!.","date":"2015-12-25","mins":"10:18 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-207609","author":"hugh_farey","post":"Goodness me! I think I agree with most of that!.","date":"2015-08-06","mins":"2:23 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207604","author":"hugh_farey","post":"All this philological gallimauphry is off the point, Max, even if it is true, for which you provide no evidence (what a surprise). I was asking for evidence that Jesus was wearing a set of clothing. Telling us that the Kornelimünster “Sudarium” is a big sheet is not evidence that it, or anything like it, was used for Jesus’s burial. Nor is all your dressing up, nor are any of your so called thought experiments. Methinks you should attempt to distinguish between a thought experiment and a flight of fancy. “A thought experiment is a device with which one performs an intentional, structured process of intellectual deliberation in order to speculate, within a specifiable problem domain, about potential consequents (or antecedents) for a designated antecedent (or consequent).” This does not describe anything you have mentioned here so far..","date":"2015-08-06","mins":"2:09 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207659","author":"hugh_farey","post":"No, Max. The Hebrew Ruth 3:15 contains the word mitpa Hat, which occurs only twice in the Old Testament and is variously translated veil, mantle, shawl, cloak, etc. Its size in that context is is largely a matter of guesswork. It now refers exclusively to a headdress. If it is interpreted as a headdress, then it may be translated into aramaic as sudara, but that does not mean that sudara can refer to one of the wider interpretations. And no, Max. The fact that various people thought that the soudarion was the Shroud does not mean that they thought the word was derived from the aramaic sudara. And no, Max. I never denied that the Kornelimunster cloth could be the sudarium. Quite the reverse. I said that you may be correct. However, I don’t think you are correct, and none of your evidence to suggest that it might be is the slightest bit persuasive. And no, Max. “I am not using made up words to impress anybody.” Really? Come on….","date":"2015-08-07","mins":"2:23 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207624","author":"hugh_farey","post":"Yes, Max. You explained earlier that in John 11:44, which is about Lazarus, the word “σουδαρίῳ” (soudarion) could have referred to a large sheet which could enwrap a whole body, and justified this by saying that the “ὄψις” (opsis), which was covered by the soudarion, can mean any form or shape, and was not restricted to the head. So far so good. However the soudarion of John 20:7 is specifically said to be around the “κεφαλῆς”, which can only mean the head. This calls into question your derivation of soudarion from the Arabic soudara. Your suggestion “the Johannine word “soudarion” is not derived from the Latin sudarium but from the Aramaic sudara (the latter is used several times in the Palestinian Targums of the Hebrew Bible or Tanakh and refers to an all enveloping wrap or cloak (used to sleep in too)” is ingenious, but not, as far as I know, supported by anybody else. The Jewish Annotated New Testament (ed. Amy Jill Levine, Marc Z. Brettler) thins that sudara means a male head covering, and wikipedia (yes, I know…) on Sudra thinks that “Aramaic: סודרא; Sudara, is a traditional ancient Jewish headdress” which is surely less than a full body cloth. So, Max, I think you are completely wrong about the soudarion being a large cloth, and what’s more, everybody reading this comment agrees with me. But how can this be, when you’ve spent thirty years researching this very point, and I’ve spent ten minutes on Google? It’s all about evidence, Max, which I’ve given, and you won’t. The fact is, Max, that all your posturing about archeocryptology and Christolipsology and all the other made up words you keep trying to impress us with mean absolutely nothing without evidence. Your experiments with dressing up, your thought experiments, your mountain of unpublished papers, nothing. Just guesswork, idle fancies born of familiarity with Middle Eastern linguistics, and an overweening confidence in your own authority. Flim flam, in fact. Well, maybe you’re right. Maybe soudarion does mean a large cloth. Maybe the Kornelimunster relic is evidence of your hypothesis. But without evidence, Max, we’ll never know….","date":"2015-08-06","mins":"4:37 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207729","author":"hugh_farey","post":"Aw, don’t lose it just as we were making progress. Evidence, Max, evidence. What on earth makes you think that the Kornelimunster sudarium is folded 16 times? Clearly you have never attempted it. I have. Actually, of course, to turn a 615cm x 352cm cloth into a 39cm x 22cm area takes 8 folds, not 16, but that still results in 256 layers of cloth. I challenge anybody to try it, and see if the result looks as if it could contained in the reliquary held by the priest in http://www.abtei kornelimuenster.de. For those of you who don’t have that size of cloth lying about, use four bedsheets lying on top of one another to represent the first two folds, and try folding them in half six more times. And I don’t believe it’s made of sea silk either, for that matter. Who thinks it might be, and on what evidence?.","date":"2015-08-08","mins":"2:07 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-72418","author":"hugh_farey","post":"I don’t think it is historical fact (or FACT) that the letters were the basis of the Abgar legend. I think daveb is closer to the mark in suggesting that it was the other way round – the legend stimulated the letters. The letters then become irrelevant, and what is important is the origin of the legend, which presumably was itself designed to explain how Jesus’s image came to be in Edessa at all. But really, it cannot be said to be historical FACT that the letters didn’t orginally exist. For all I know Dr Dale is quite correct, and I dare say would substantiate some of his claims further in scholarly debate, but he only offers two pieces of evidence to his undergraduate class; firstly that Jesus couldn’t write Greek, and secondly that the letters contain similarilities to the Gospel of John. Neither of these is any real objection at all. Firstly, if a person who couldn’t speak Greek wanted to write a letter to someone who did, he went to a professional translator, who wrote the letter for him. In some countries this is still quite common. Secondly, the fact that the same person sometimes says the same things in similar contexts is hardly surprising, especially if that person is a teacher. We do repeat ourselves, I find… OK is quite correct. This is scholarly opinion, not historical fact..","date":"2014-01-06","mins":"1:56 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-207681","author":"hugh_farey","post":"At last! I’ll have you eating out of my hand yet, Max. What, readers must ask themselves, has been the point of all this incessant needling? Do I really think that Max is nothing but a fantasist? Do I I care nothing for his scholarship and ability to pop out linguistic prestidigitations at the drop of a hat? Of course not – and I’ve said so above. All I’ve been trying to do is to wheedle out of him just a teeny weeny smidgin of evidence, and guess what, I think I’ve partially succeeded. Is your etymology for soudarium just a fancy? No, of course not, and look, now there’s some evidence to back up your idea. Now we can assess it. Jastrow’s ‘Dictionary of the Targumim, the Talmud Babli and Yerushalmi, and the Midrashic literature.’ The entry from which you quote has the headword ‘סודר’, which Jastrow defines as “a scarf wrapped around the head and hanging down over the neck, a turban.” After various examples, a note at the end says: “[Latin sudarium is a phonetic coincidence with our word, from which it differs in meaning.]” The next headword is ‘סודרא’, as in Ruth 3:15, which is defined as the same, and several more instances of its occurrence are given, particularly referring to being strangled with one, and to its being wound around the head to form a turban. In this case, then, Max, you have muddled things up. For a start Jastrow does not think that soudarium has anything to do with sudara, and for a second, Jastrow does not think a sudara means a full body sheet anyway. And does Bonnet Eymard agree? I can’t find his paper, but note that Domingo Muñoz León’s book, ‘Salvacion en la Palabra’ has a footnote mentioning ‘une étude de Bruno Bonnet Eymard […] qui voit dans le grec σουδάριον un décalque de l’araméen סודרא, au sens de “linceul” et non simplement de “mentonnière.” So it looks as if you’re correct there, although it must be said that Muñoz León doesn’t agree with Bonnet Eymard. I think you and Bonnet Eymard are out on a limb, frankly. The connection of sudarium to sudara is not established by Jastrow, and even if it were, sudara does not refer to a full body cloth. The hope that it might is derived from the huge quantity of corn that gets dumped in it while Ruth holds it out, but the amount “six measures” is not given an actual unit. If it corresponds to a seah or an ephah it amounts to more than anybody could reasonably carry, and is probably a deliberate exaggeration as a sign of Boaz’s generosity. Other, non biblical, references to sudara clearly deny its whole body proportions. Back to Kornelimunster, and its three holy cloths. The linteum (described as the towel with which Jesus wiped the feet of the disciples) and the sindon are about the same size, about 180 cm long and nearly as wide, while the sudarium (prominently embroidered with the word Sudarium) measures 39 x 22 cm. You appear to have muddled these up. But we did get some sources out of you, so well done; we’ll make a scholar of you yet, Max!.","date":"2015-08-07","mins":"10:17 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"}]
