[{"id":"comment-72204","author":"hugh_farey","post":"Am I unduly fortunate in not having found any hate? I have swum in very contrary waters, and come across cynicism in some measure, bafflement and frustration, but not hate. I hope we are sure of our targets before we invoke biblical curses against people who disagree with us, or we are in danger of falling into our own trap..","date":"2014-01-04","mins":"1:32 pm","url":"https://shroudstory.com/2014/01/04/what-one-single-characteristic-about-the-shroud/","cat":"uncategorized","title":"What one single characteristic about the shroud  . . . ?"},{"id":"comment-72266","author":"hugh_farey","post":"I tend to find everybody’s ideas compelling, being by nature a trusting soul, which is why I immediately look around for people with contrary evidence. So I find this review – http://www.amazon.co.uk/gp/aw/cr/r R3 FIPYKEJ9 BCUG – compelling too. The trouble is that for every Ian Wilson, there is a Davor Aslanovski, and everybody quotes passages of medieval writing out of context, making them difficult to assess objectively..","date":"2014-01-05","mins":"5:35 am","url":"https://shroudstory.com/2014/01/04/what-one-single-characteristic-about-the-shroud/","cat":"uncategorized","title":"What one single characteristic about the shroud  . . . ?"},{"id":"comment-72125","author":"hugh_farey","post":"Big problems for the anti authenticists: 1) The pollen. Is it all a lie? Surely not. 2) Blood before image. Is it, or isn’t it? I don’t think the issue is satisfactorily resolved. 3) Twin bodies on a long cloth. Why? Again, not yet satisfactorily explained. Big problems for the authenticists: 1) Carbon dating. Can two thirds of the corner of the shroud really be undetectable? 2) Cloth/body position. Straight, bent, wrapped, draped, rigor mortis, dislocated arms? 3) Early history. Not enough art historians are persuaded by the mandylion hypothesis. How convinced am I? About 55% in favour of the 13th/14th century, 35% in favour of the burial cloth of Jesus, 10% in favour of something completely different!.","date":"2014-01-04","mins":"10:02 am","url":"https://shroudstory.com/2014/01/04/what-one-single-characteristic-about-the-shroud/","cat":"uncategorized","title":"What one single characteristic about the shroud  . . . ?"},{"id":"comment-72128","author":"hugh_farey","post":"Conspiracy theory? That’s a new one…..","date":"2014-01-04","mins":"10:08 am","url":"https://shroudstory.com/2014/01/04/what-one-single-characteristic-about-the-shroud/","cat":"uncategorized","title":"What one single characteristic about the shroud  . . . ?"}]
