[{"id":"comment-78438","author":"hugh_farey","post":"Hark! The sound of a fool rushing in where angels fear to tread. Yes, ’tis I, not wholly ignorant of biblical archaeology, who finds nothing remarkable in the findings of Sapir Hen and Ben Josef, whose camel dating only confirms what had already been well established anyway, that domesticated camels only arrived in the mines of the lower Levant (south of the Dead Sea) round about 1000 years BC. Jones is wrong about the “argument from ignorance” and the “if we haven’t found it, therefore it doesn’t exist” suggestion. The site described was in continuous occupation since the late 14th century BC, and layer after layer of faunal studies show what animals were present at the site. Camels are conspicuously absent before the late 10th century, and conspicuously present after it. This is definitely suggestive of their introduction at about that time. It is perhaps worth mentioning here that Abraham is not mentioned in Sapir Hen and Ben Josef’s paper, nor is there any discussion of biblical chronology at all, but they do mention the rock art conveniently omitted from the Huffington post article. It is apparent that Jones hasn’t read their paper, although it is freely available by clicking their names on the first line of the article. It is not impossible that the story of Abraham is based on truth, but there is no archaeological consnsus about him. Some think he is wholly legendary, and others that he may represent an actual migration, but there is little suggestion that this occurred long before the first millennium BC, in spite of literal biblical chronology. The idea that the biblical contemporary of Abraham called Amraphel is to be identified with Hammurabi of Babylon in about 1750 BC is much disputed. Dr. Robert Harris, an eminent Jew, said to the Huffington Post: “This is just one of many anachronisms in the Bible, but these do not detract from its sanctity, because it is a spiritual source, not a historical one.” Jones boldly announces that this may be a Jewish view, but it is not a Christian one. Well, wrong again. There is no “Christian” position about the historical veracity of the bible. It is perfectly true that individual Christians may hold sincere beliefs, but they are only individuals, and cannot speak for Christianity as a whole. If anybody needs some kind of Christian consensus, they will have to have recourse to that massive collection of Christians, the Catholic Church (1.1 billion), or one of the larger alternatives if they can’t agree with Rome. It turns out that for the vast majority of Christians, Robert Harris’s views are wholly acceptable..","date":"2014-02-11","mins":"6:47 pm","url":"https://shroudstory.com/2014/02/11/abraham-and-his-camels-the-shroud-of-turin-how-did-we-get-here/","cat":"other_blogs","title":"Abraham and His Camels & The Shroud of Turin. How did we get here?"},{"id":"comment-96241","author":"hugh_farey","post":"Yannick, you have just taken the trouble to repeat your previous assertion several times. Please believe me that I am by now very familiar with what you think, and why. I just don’t agree with you. Now why not re read my comment, refrain from telling me how ludicrous my work is at present (again!), and suggest what I might be better employed on instead..","date":"2014-04-03","mins":"5:23 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-78450","author":"hugh_farey","post":"Finkelstein? Who he?.","date":"2014-02-11","mins":"7:44 pm","url":"https://shroudstory.com/2014/02/11/abraham-and-his-camels-the-shroud-of-turin-how-did-we-get-here/","cat":"other_blogs","title":"Abraham and His Camels & The Shroud of Turin. How did we get here?"},{"id":"comment-96430","author":"hugh_farey","post":"“Edgerton linen” was hand produced by a Kate Edgerton, from plant to woven cloth, and then, much to Ray Rogers’s chagrin, ironed, which made it go yellow, so he soaked it in hydrogen peroxide to bleach it. He hoped, and was probably correct, that this had no effect on his subsequent experiments. Although the linen is descibed as prepared “following the methods used in the Near East in Roman times,” no details are given in “A Chemist’s Perspective on the Shroud of Turin.” I have acquired some quite stiff unbleached linen, however, and am prepared to give it a try, using leaves from soapwort mashed in water as a source of saponin, and commercial dextrin (a readily available water soluble glue) as the starch. I also have ammonia and urea. The problem is “freshly dead” animals. The trouble here is to acquire enough for sufficient repeatable experimentation. However, after asking around, I find that people who keep snakes as pets feed them on frozen mice, which are available quite cheaply in bulk. This looks promising, so I’m preparing an appropriate protocol for just the experiments you suggest! Incidentally, although my linen feels quite stiff and heavy, it has an areal density of only 16mg/cm2, which is considerably less than the Shroud, which therefore appears to be considerably thicker than I had previously imagined. As such, I think it will be much easier to produce discolouration on one side of the cloth only. Other investigators (Thibault? Colin?) might be able to comment further on this, and readers of this blog might like to weigh a bed sheet themselves to confirm how flimsy it is compared to the Shroud..","date":"2014-04-04","mins":"5:04 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-96740","author":"hugh_farey","post":"Not, in my opinion, a belt or chain. Just possibly a single blood soaked cord making two marks as it moved from one position to another, but I don’t find that compelling. So perhaps a ‘reservoir’ of liquid blood at one side of the body, which leaked/trickled across to the other side and pooled, possibly twice, or possibly ‘there and back again.’ Perhaps the body was being rolled onto its side, as Max has suggested. But where could the ‘reservoir’ of blood have come from. Not, I think, the wound on the side. That would have flowed straight off. What about a blood soaked cloth or sponge, being used to wipe the body down, and held at just the correct position as it was being turned? Or an artistic irregular double dribble of a blood/madder mixture, very much in the style of all the other blood flows on the cloth, whether from the back or front of the head, the arms, the spear wound or the feet..","date":"2014-04-05","mins":"5:35 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-96504","author":"hugh_farey","post":"Yannick, do any of the above postings mean anything? I’ve done my best, but got hopelessly lost. 1) Your “Sacred cows of Sindonology.” Who are these people? I know nobody who hasn’t been thoroughly criticised on this blog and elsewhere, from Ray Rogers to Barrie Schwortz, via Marino, Heimburger, Fanti and myself. You say, “We all know who they are.” Well I don’t, and to be frank I don’t believe they exist at all. Would you care to name one? 2) Fields of expertise. I don’t follow this. You seem to be criticising Thibault (specifically) for carrying out experiments on scorching when he should be focussing on blood serum because he is a doctor. Thank goodness I don’t have a “field of expertise.” I’m just an expert in general scientific methodology – does that count, or aren’t I allowed to carry out any experiments at all? 3) Sadly the “great” Placide Gaboury doesn’t make it to the English version of Wikipedia, but even the French version does not describe him as a philosopher. It does say that he was expelled (rather than dropped out) from the Jesuit Order in 1983. I’ve no idea what the quotation you give really means. It seems to be a rather facile critique of religion and is far from original. Perhaps it sounds better in French. 4) Finally, I quite like your “pointing the finger” aphorism, but when I point one finger, only three others point back at me. My thumb doesn’t. Back to my laboratory….","date":"2014-04-04","mins":"11:16 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-96222","author":"hugh_farey","post":"I too am working on the scorch hypothesis. It is, as Yannick puts it, my freedom. This is because to me it is neither “EVIDENT” that the shroud is not a scorch, nor “ludicrous” to suppose that it is. However, I agree that there are other aspects of the image to research, and, apart from a slight difficulty with saponaria (where do you get saponaria from?), I am also attempting to duplicate Rogers’s ammonia/evaporation gradient experiment. If Yannick would like to suggest other (serious) aspects to investigate, I should be delighted to add them to the list….","date":"2014-04-03","mins":"4:34 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-97068","author":"hugh_farey","post":"“For example we would expect to see the back of forearms on the dorsal image.” I’m not sure I follow. Can you say why?.","date":"2014-04-06","mins":"8:10 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-97703","author":"hugh_farey","post":"Nobody has dared? You flatter yourself. There are many reasons why your question (actually you haven’t asked one, but I know what you mean) hasn’t been addressed to your satisfaction, but lack of courage is certainly not one of them. The findings of all the blood specialists, the highly questionable spectrum, the disagreement between the experts about whether the blood is fresh, dried, dried and remoistened, or in fact not blood at all but some kind of exudate, the bilirubin hypothesis, the iron oxide, mercuric oxide and madder root hypotheses; all these have been discussed in considerable detail on this blog. If there has been little practical experimentation, then I suggest a shortage of a ready supply of blood constitutes the most important reason, not because we’re all scared of uncovering the truth..","date":"2014-04-08","mins":"5:29 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-30194","author":"hugh_farey","post":"One for Max Patrick Hamon here? Do quantities of fresh flowers play a role in his fairly elaborate reconstruction of the burial practice of the man in the shroud?.","date":"2013-04-10","mins":"8:11 am","url":"https://shroudstory.com/2013/04/10/and-now-the-flowers/","cat":"other_blogs","title":"And Now the Flowers"},{"id":"comment-97204","author":"hugh_farey","post":"Ah, yes, I think I understand, and quite agree. If the ‘hot bas relief’ hypothesis were to be the cause of the image, I think there would have to be two bas reliefs, a front and a back, or a very flattened statue with two well defined sides.There is no way I can see the dorsal image beng made from the ‘inside’ of the ventral one..","date":"2014-04-06","mins":"6:33 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-213548","author":"hugh_farey","post":"Fair enough. Now, can anybody provide any sources for an ancient bleaching system involving hanks, not whole cloth?.","date":"2015-10-25","mins":"3:23 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"id":"comment-213505","author":"hugh_farey","post":"Primary sources, primary sources. It is often claimed that ancient linen was bleached in hanks before it was woven into cloth, while medieval linen was bleached after it was woven. The alleged ‘banding’ on the Shroud would thus suggest the ancient method. Well, I’ve been scouring Pliny the Elder and find no reference to this at all. Quite the reverse. Ancient accounts are full of mentions of bleaching cloth, not hanks. Can anybody provide any sources for an ancient bleaching system involving hanks, not whole cloth?.","date":"2015-10-24","mins":"12:03 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"id":"comment-213520","author":"hugh_farey","post":"Responding to one question with another is an evasion, not an answer. Entering “ancient linen bleaching techniques” in Google throws up a number of books, such as “Prehistoric, Ancient Near Eastern & Aegean Textiles and Dress”, ed. Marie Louise Nosch, or R.J. Forbes, “Studies in Ancient Technology”, which describe, with sources, cloth preparation including bleaching. Cuneiform tablets, tomb paintings and archaeological remains of cloth preparation vats such as the fullonica of Pompeii seem the primary sources, although there are some mentions in papyri (such as the Papyrus Lancing in the British Museum), and Pliny himself mentions a plant used in bleaching cloth, not thread or hanks. Now, can anybody provide any sources for an ancient bleaching system involving hanks, not whole cloth?.","date":"2015-10-24","mins":"5:07 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"id":"comment-207022","author":"hugh_farey","post":"“Could also CB post a diagram…” Could Max not post his ‘Does the Shroud of Turin Really Bear the Image of a Man Crucified “Under Pontius Pilate” ‘ instead? Does it really exist?.","date":"2015-07-31","mins":"6:52 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-207008","author":"hugh_farey","post":"Why not send your 2010 paper, ‘Does the Shroud of Turin Really Bear the Image of a Man Crucified “Under Pontius Pilate” ‘ to Dan? There are no finer peer reviewers than the correspondents on this site..","date":"2015-07-31","mins":"5:25 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-207049","author":"hugh_farey","post":"I think I’m reasonably familiar with your ideas; indeed, I once summarised them in an attempt to make them a little clearer, and you amended the summary to make it match your hypothesis more closely. I don’t recall it being much like Colin’s idea though; with all that wrapping and unwrapping and laying on of flowers and various bit and pieces. Anyway, I’d be very happy to correct your English if you felt it necessary – it always seems clear when you comment here..","date":"2015-07-31","mins":"9:29 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-205528","author":"hugh_farey","post":"Yes; I’m sorry, Leon, but I fear Max Frei’s attempts to characterise the pollen he found on the Shroud as Middle Eastern have not withstood scrutiny. It is unfortunate that he died before fully disclosing his findings, and perhaps indicative of his unreliability that they have not been published by those who inherited them. No subsequent investigations attempting to verify them, especially those of more experienced and qualified palynologists or botanists, are still defended even by the investigators themselves..","date":"2015-07-13","mins":"3:46 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-182157","author":"hugh_farey","post":"I have refrained from this discussion until now because it has little to do with the Shroud, but in an attempt to save OK from apoplexy I feel someone should respond directly to his question: Do you want God to make all harm impossible? I say ‘respond’ to his question rather than ‘answer’ his question because in a discussion with someone who postulates that God does not exist, the question is literally meaningless. If I did not believe in the existence of any kind of God, then I would neither need nor care to ‘want’ the entity I deny to do anything. I do not ‘want’ dragons not to breathe fire, and I do not ‘want’ Father Christmas to go on a diet, and I do not ‘want’ Bigfoot to be a vegetarian; I do not have ‘requirements’ for non existent entities. But I think the thinking behind OK’s argument is this: if I do not believe in God because the world is full of evil, then, if the world was completely free of evil, would I change my mind? The answer, of course, must be, I don’t know. There may be all sorts of other corollaries that would affect my decision. One such, which seems to be implied by OK’s question, is that a world completely free of evil could be a denial of Free Will, which, in some theologies, is an attribute of God’s love. So by making God more “all loving” by removing all evil, we at the same make him less “all loving” by his denial of free will, which is a paradox. The way out, of course, is to postulate a third scenario. Suppose that God created man in his own image etc., etc. As postulated in the bible, and gave man free will to do good or evil, also as postulated in the bible, and more, that men, from the creation until now, entirely from their own free will, and in spite of numerous temptations, chose not to commit any evil. Suppose further, if you will, that, entirely by chance, men chose not to build their homes in the paths of any natural disasters, so that nobody died of tsunamis or earthquakes or hurricanes either. And now suppose there was a discussion about whether a God who ‘looked after’ his creation existed or not. I submit that there woud be less opposition to belief in his existence than there is now. Does that answer OK’s question, do you think?.","date":"2015-01-09","mins":"7:59 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-205477","author":"hugh_farey","post":"I think that Colin has thought further into the actual functions of the various cloths associated with the burial of Jesus than either the Gospel writers or most medieval artists ever bothered with. Transporting a dead body from cloth to tomb, even if the tomb was so extraordinarily close to the execution site as the Church of the Holy Sepulchre would have us believe, must surely have involved some kind of covering, if just to protect the carriers from the blood and grime, and such a cloth may or may not have been used as a shroud, or just left in the tomb with the shroud. I don’t think the painters who showed a cloth being used to lower the body from the cross, or to carry it to the tomb, gave any thought to whether it was the same one as ended up covering the body. Whenever the burial cloths are shown in medieval iconography there are nearly always two, one big and one small, as suggested by the Gospel. If the Turin Shroud is a medieval fabrication, it is relevant to ask ourselves if it was meant to be a ‘realistic’ representation of what the holy women found on Easter morning, or an image ‘miraculously’ appearing on a cloth. If miraculous, then it should be brightly (if ‘cunningly’) painted to show the power as well as the majesty of the miracle worker, but if quasi realistic it should be fainter and look as if it might be made out of sweat and blood. It is also relevant to ask ourselves how the Shroud was meant to be displayed. If it were to form either a reredos above an altar (as in the recent ostentations), or an altar frontal, then its long thin shape could be explained that way, without consideration of whether it was ‘meant’ to be thought of as either a transport cloth or the burial shroud itself. It is not until the 18th century, I think, that some kind of rationalisation of the various different (all genuine) shrouds was needed, whereupon the Turin Shroud was usually thought of as the transport cloth and the Besançon one was the actual body covering. Even today, sudariumchristi.com goes to elaborate lengths to incorporate as many cloths as possible. I do not know how precise the word ‘shroud’ needs to be. I think even Colin accepts that the cloth is meant to represent a cloth wrapped around a dead body, and I think that any such cloth can legitimately be referred to as a shroud even if it was only used for transport..","date":"2015-07-13","mins":"6:44 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-21249","author":"hugh_farey","post":"Assuming that all “scientists” have similar beliefs outside their realm of expertise is much the same as thinking the same of all “artists.” However, the latter would seem to most people to be ridiculous, while somehow “scientists” are seen by the general public to be a more homogeneous bunch. To a certain extent that may be true, but in my experience biologists are much more likely to be strict atheists than physicists – especially physicists of the very small and the very big. I guess this is because evolution and physiology are fairly mechanistic in their descriptions, while sub atomic physics and cosmology, with its probability functions, multiple dimensions, many worlds, dark matter and energy, and all the rest, intuitively leaves more room for some form of theology..","date":"2012-12-28","mins":"11:53 am","url":"https://shroudstory.com/2012/12/28/peter-higgs-criticizes-richard-dawkins/","cat":"news_&_views","title":"Peter Higgs Criticizes Richard Dawkins"},{"id":"comment-21260","author":"hugh_farey","post":"The filmed Interview with El Mundo as published at the link provided doesn’t mention Dawkins at all, let alone provide all those quotes attributed to Peter Higgs. Curious..","date":"2012-12-28","mins":"1:40 pm","url":"https://shroudstory.com/2012/12/28/peter-higgs-criticizes-richard-dawkins/","cat":"news_&_views","title":"Peter Higgs Criticizes Richard Dawkins"},{"id":"comment-65083","author":"hugh_farey","post":"“Anyone who still accepts [the finding of the carbon dating labs] after the work of Ray Rogers and his colleagues is not a skeptic but a true believer in pseudo science.” “Anyone who is so intent on avoiding unpleasant truth such as the authenticity of the Shroud of Turin, is not a skeptic but a fool.” I guess we have here the difference between a lawyer and a scientist. Emanuela Marinelli, I thank her, writes as a scientist. She has this to say regarding the possibility that the radiocarbon dating laboratories produced their 13th century result from a mixture of 1st and 16th century material: Sindonologist Maria Grazia Siliato, considering the abnormal weight of the Shroud sample used for the radiocarbon dating, suggested the presence of a mending instead. Sindonologists Joseph Mario and M. Sue Benford provided some evidence of the existence of an “invisible” mending dating to the sixteeth century in the area where the sample for radiocarbon analysis was taken, including differences in thread colour and size and weave pattern. Flury Lemberg denies the existence of such a darn, but, according to Savarino “the sampling site does not exclude this hypothesis.” Later, perhaps, I may demonstrate reasons for doubting “the abnormal weight of the Shroud sample,” as well as the “differences in thread colour and size and weave pattern” but my point here is to show that scientists do not “prove” things, such that anybody who denies them is an idiot. Scientists, humbly, “suggest” things. They “provide some evidence for” things. They find evidence which “does not exclude a hypothesis.” However fanatical one may be emotionally in support of a hypothesis, one seldom supports one’s case by insulting those who find faults in it, and one definitely weakens one’s case by attributing motives for their doubts for which one has no evidence at all. But then, I can only speak for science. Perhaps the law is different..","date":"2013-12-22","mins":"1:18 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65175","author":"hugh_farey","post":"Wise words, as ever. Actually I am not reluctant to accept that the image is that of Christ; I think it probably is. I just don’t like dogmatism where there are clearly quite sensible opposing views. There is, for example, no evidence that any of the ‘wounds’ of Christ were peculiarly rare. Take the crown, or cap, or helmet. Headgear is not the prerogative of kings. Perhaps dozens of petty leaders were ‘crowned’ with thorns, or perhaps not. The fact that I’m inclined to think the image is that of Christ does not make people of the contrary opinion fools, or pseudo skeptics. Incidentally, I don’t know why anybody should suppose the crown covered the top of the head, since the top of the head is not represented on the Shroud at all. And what’s the use of all this? Why fear that the answer may be very little? To me it’s interesting, stimulating, educational and fun; that’s use enough for me. Do we need more?.","date":"2013-12-22","mins":"6:07 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65199","author":"hugh_farey","post":"Yes indeed. How convenient. Way back in January I made up some equally reasonable figures of my own and determined that about 20 men had died in exactly the same way as Jesus. I agree that, given our present knowledge about crucifixion, the chances of the Shroud being anyone other than Jesus are small, but deny that they are negligible. That’s the point..","date":"2013-12-22","mins":"7:47 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65430","author":"hugh_farey","post":"I don’t want to go round in circles. You can find the discussion by Googling: “Eric J. Jumper to Speak on the Shroud of Turin” which was the blog’s headline on 25 January..","date":"2013-12-23","mins":"4:59 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65894","author":"hugh_farey","post":"Christmas gets better and better!.","date":"2013-12-23","mins":"3:40 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65448","author":"hugh_farey","post":"Brilliant! Happy Christmas!.","date":"2013-12-23","mins":"5:34 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-66027","author":"hugh_farey","post":"“To be honest, I find Hugh’s calculation without merit at all.” That’s perfectly OK. Happy Christmas!.","date":"2013-12-23","mins":"7:21 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65065","author":"hugh_farey","post":"From John Walsh to Stephen Jones, the bald claim that the Shroud is either a miraculous product of the Resurrection or a cynical money making fraud has nothing to do with the understanding of the Shroud, but a (cynical? surely not) attempt to win adherents to authenticity by emotional rather than scientific grounds. “There is no middle ground,” they trumpet. Well that’s nonsense, as has been demonstrated many times on this blog. From the accidental product of an unconnected burial in the 1st century to a devout attempt to represent Christ’s passion for the reverence of believers in the 14th century, there is ‘middle ground’ in abundance, and I have wandered about in it with fascination for months. Then we have the “scientists have tried to manufacture the shroud…..” as if failure was evidence for authenticity. My guess is that most of the scientists trying to explain how the image was formed, by quite a large margin, were in fact trying to show how it was formed by the body of Christ, not by a medieval forger. From Paul Vignon, through Ray Rogers and John Jackson to Giulio Fanti, via the vaporograph, Maillard reaction, and all the radiation, laser and plasma theories, not to mention those on the very fringe of scientific credibility, such as quantum dissapearance or biophotonics, pro authenticity scientists have not only failed to expain how a body could produce an image, but cannot even agree about the actual configuration of either the body or the shroud required to produce one. In the face of this utter inability to produce a shroud by natural means, then obviously it must be….. Ah, but I don’t use arguments from ignorance, so I don’t go down that road! In that context, let’s rewrite Stephen Jones’s paragraph above, shall we… “The “authenticists” (who are themselves “believers” in the Shroud’s authenticity) have no evidence that the Shroud was “a product of a dead man in Jerusalem”. They cannot cogently explain: Who conjured it up? [Well, I suppose we must grant them them the who and when, although they are matters of faith rather than evidence] How was it conjured up? When was it conjured up? Why can’t they conjure it up (i.e. Make a convincing replicate copy of the whole Shroud)? The “authenticists” (so called) cannot even agree on how the Shroud was “conjured up”. Not such a bold argument for authenticity now, is it? Now let’s have a look at his quotation from Ian Wilson: “Yet ingenious as so many of these ideas are, the plain fact is that they are extremely varied and from not one of them has come sufficient of a groundswell of support to suggest that it truly convincingly might hold the key to how the Shroud was…” the end of this quotation could just as easily read “naturally made” as “forged.” One more? Stephen Jones again: “Similarly, if the Shroud were [1st century / 14th century], the science of the 20th 21st century should have discovered that by now. So that absence of proof by modern science that the Shroud is [1st century / 14th century], after 35 plus years of intensive scientific study of the Shroud, is positive proof that the Shroud is [fake / real]!” [Delete at whim.] And then I’m told my doubts are unreasonable! We end with the most unreasonable, irrational, merely emotional appeal of all, that the Shroud is scientific proof that Christianity is true. This is literally non sense..","date":"2013-12-22","mins":"12:45 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-131456","author":"hugh_farey","post":"So what, precisely is the nature of the ‘energy’ that emanated fro the body. If not particulate, then electromagnetic? In what sort of frequency range?.","date":"2014-06-19","mins":"6:44 pm","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-130729","author":"hugh_farey","post":"The answer to my query is not convincing. Yannick’s paper explicitly claims that “the major part of the bloodstains are the result of a permanent contact between the corpse and the cloth,” so (although there may be a difference between the ventral and dorsal maxima), the major part of the bloodstains should be surrounded by areas of equal, and maximum, discolouration. This is not true. A glance at just the bloodstains above the eyes, or across the back, shows a wide variation of image intensity around them. Furthermore, the major part of those bloodstains which could have resulted from body contact which was later removed would be, in a body being carried in a sheet, around the sides of the legs and sides, where we know there ought to be plenty of whip marks, as these are found on the front of the legs too. So there ought to be a large number of off register scourge marks down the sides of the dorsal legs, which there aren’t. In fact the only obvious off register stains are clearly “flows” such as the drip off the elbow, the rivulets under the back, and the dribble off the foot. These are not contacts with wounds..","date":"2014-06-18","mins":"9:55 am","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-139144","author":"hugh_farey","post":"This topic has occurred before, and is likely to be fraught with misunderstanding of exactly where the man in the shroud’s shoulders are. “There appears to be a mislignment” needs to be illustrated in order for us to agree or disagree. Here are a couple of images from Shroud Scope, with some relevant details highlighted: http://imgur.com/Pmbb Vqc. To me, both shoulders are too high, and the shape of them from the front does not match their shape from behind. The absence of neck and general departure from the wishful idea of “anatomical perfection” is often taken as evidence that the two images were independently created (the non authenticist view), or are because the head was tilted forward, one or both arms dislocated, rigor mortis or some other ad hoc interpretation (the authenticist view). Most of the great pathologists, of course, didn’t observe any distortion at all..","date":"2014-07-18","mins":"11:07 am","url":"https://shroudstory.com/2014/07/18/comment-promoted-a-misalignment-between-the-left-and-right-shoulders/","cat":"comments_promoted","title":"Comment Promoted:  A Misalignment Between the Left and Right Shoulders"},{"id":"comment-131453","author":"hugh_farey","post":"The marks you refer to are not off register spacially, they are within the outline of the body. A more wrapped cloth would include marks well outside the outline of the body. These we do not see..","date":"2014-06-19","mins":"6:42 pm","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-139157","author":"hugh_farey","post":"I don’t think it is easy to assess where the shoulders are at all. The indications I have given seem to me to be all there is. The dorsal image seems much clearer than the ventral. Try drawing in your own ideas about where exactly there is image of the shoulders on both sides, and upload your drawing via imgur.com, which is extraordinarily easy. Although the scourge marks, if so they be, are level on the shroud, they need not indicate any particular place on the shoulder. When you say “because of side contact,” are you supposing the shroud was wrapped over the shoulders during both blood and image formation, or do you follow the wrapped for the blood, horizontal for the image school of thought?.","date":"2014-07-18","mins":"12:45 pm","url":"https://shroudstory.com/2014/07/18/comment-promoted-a-misalignment-between-the-left-and-right-shoulders/","cat":"comments_promoted","title":"Comment Promoted:  A Misalignment Between the Left and Right Shoulders"},{"id":"comment-2047","author":"hugh_farey","post":"I can’t even find your new site. What is it called?.","date":"2013-03-20","mins":"5:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/12/dear-royal-society-time-maybe-to-take-a-hard-line-on-those-who-peddle-turin-shroud-pseudoscience/","cat":"medieval_forgery","title":"Dear Royal Society. Time maybe to take a hard line on those who peddle Turin Shroud pseudoscience?"},{"id":"comment-208034","author":"hugh_farey","post":"I agree with John! And I’m always a bit suspicious of those who attribute beliefs to an institution. The Vatican believes this or that? Does it? Who exactly is the Vatican? The College of Cardinals? The Curia? The Archbishopric of Turin? And while we’re on the exposition, did it really cost millions of dollars to put on? The hire of a tented corridor would not amount to much, I imagine….","date":"2015-08-12","mins":"6:01 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208263","author":"hugh_farey","post":"“The biggest nonsense that I see these days comes from all the religious propaganda done by Di Lazzaro and his team of good catholics in Italy!” Does this mean anything at all? Anybody?.","date":"2015-08-14","mins":"12:46 pm","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208300","author":"hugh_farey","post":"Ooh, it’s like an Olympic epée bout, Rick; blink and you’ll miss who’s parrying who! In his passionate rejection of anything miraculous, Yannick described Paolo di Lazzaro’s laser experiments as Catholic propaganda. The mental gymnastics required to connect a centimetre of damaged fibres to a deliberate attempt to coerce unbelievers into the validity of Roman Catholicism are too obscure to be meaningful..","date":"2015-08-15","mins":"3:56 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-196725","author":"hugh_farey","post":"You’re in good company, Colin. Paolo di Lazzaro has produce a square centimetre or so or discolouration with his laser, and just has the little problem of producing the right amount of radiation, from a dead body, which is both collimated and weakens in intensity to nothing over four centimetres. My money’s on you and Garlaschelli….","date":"2015-04-18","mins":"12:48 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-203961","author":"hugh_farey","post":"The blood is irrelevant here. Heller and Adler looked for but detected no starch on the Shroud. Rogers looked for it and found it. Either make up your mind before looking at their evidence and deride one or the other as an incompetent fool, or try to understand what was going on in all their minds and in all their laboratories to make them come to such different conclusions..","date":"2015-06-28","mins":"9:41 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","title":"Extreme Blogging"},{"id":"comment-196760","author":"hugh_farey","post":"Oh, let’s not go through all this again. UV laser beams are a form of radiation. Not radiation like, radiation pure and simple. Radiation like light is radiation, or infra red or microwaves, It’s all radiation. What is the title of di Lazzaro’s paper at acadamia.edu? It’s “Deep Ultraviolet Radiation Simulates the Turin Shroud Image.” Di Lazzaro knows that UV is radiation, he uses the word radiation in every paper and newspaper article in which he features. Radiation is a common word; this is what it means to scientists, like me, and di Lazzaro: “the emission or transmission of energy in the form of waves or particles, including electro magnetic radiation such as radio waves, visible light, UV, and x rays.” If you do not think di Lazzaro’s experiments used radiation, then you are using the word in some peculiar and individual sense which only you understand. Possibly you think radiation refers only to heat, or only to nuclear disintegration. If so, then you’re wrong..","date":"2015-04-18","mins":"6:25 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-197133","author":"hugh_farey","post":"“Light is radiation too.” It is indeed. See my comment a few lnches above. The trouble is that di Lazzaro and similar specialists in different kinds of radiation have not been able to produce the same degradation as is shown on the Shroud using visible light. So far, only UV will do, but further experimentation may widen the range..","date":"2015-04-22","mins":"2:08 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196766","author":"hugh_farey","post":"UV radiation is radiation. Not something like radiation, whatever term you like, but actual radiation. Di Lazzaro has achieved Shroud like discolouraton using radiation. Whether he thinks his method was the one used to produce the image I couldn’t say.I think he would like to, but admits that the production of sufficient amounts of the sufficient type is currently beyond the reach of science..","date":"2015-04-18","mins":"6:52 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196744","author":"hugh_farey","post":"“Forget the acid for the time being, concentrate on the blood.” No, please don’t. It took long enough for the acid to arrive; goodness knows how long you’ll have to wait for blood!.","date":"2015-04-18","mins":"4:02 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-171226","author":"hugh_farey","post":"Yes. Yes. No. There is little to no evidence that the linen is sufficiently different from the rest of the Shroud to significantly disrupt the carbon dating. Rogers’s book is excellent in many ways, but leaves open too many questions to be considered definitive. Such evidence as there is (see my comment above) may offer hope, but has a long way to go. I do not know many atheists, and none who care about the Shroud, so I do not know if their opinions are coloured by their world view. I do know a number of good Christians who do not accept its authenticity (I count myself one) and their Christianity is not lessened by their belief. As I understand it, the Bolzmann Brain hypothesis is that consciousness is an emergent property derived from the random organisation of material. Given a sufficiently large universe, and sufficient time, such organisations may be quite numerous, but having no means of expression, would drift in and out of existence without a trace. Theological philosophers can speculate that such organisation, and the consciousness that it engenders, could as well occur at cosmological scales as they might at biological or microscopic scales, in which case we might all be part of some vast organisation occupying a substantial chunk of the universe, or possibly all of it. It’s an entertaining idea, but the original premise, that consciousness can, even in principle, arise from random organisation, is yet to be substantiated. This could be wrong. If anybody knows better, do let us know..","date":"2014-11-14","mins":"1:51 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171202","author":"hugh_farey","post":"The radiocarbon dating has yet to be shown to be flawed at all, let alone deeply. I wish it was. Some contradictory evidence about cotton and some unconfirmed suggestions about vanillin are possible contra indications, but are neither sufficiently established to be classed as flaws. Nothing else comes close..","date":"2014-11-14","mins":"9:32 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171251","author":"hugh_farey","post":"If the water you test is uniform, then grab sampling is be as good as any other, cheaper, quicker and uses less water. In an environment, I guess the water is never uniform, and composite sampling is essential. The material of a sheet is much more uniform than environmental water, so grab sampling is less prone to error. It is not impossible that the Shroud is variable in composition, but unless this is demonstrated, there is no reason why a grab sample should not give a true result. The crux of your argument is: “They did not take a representative sample of the Shroud”, and “There is a high probability that their results are wrong”, two arbitrary statements without evidencial justification. Those who have eyes may see..","date":"2014-11-14","mins":"4:23 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171427","author":"hugh_farey","post":"“matters of finer detail.” Such as whether the Shroud and the Mandylion are one and the same, or whether the Shroud was wrapped around the body or laid on top, or whether the image was formed by vapour or by radiation. Matters of fine detail these may be to daveb, but I would have thought they were fairly basic to the authenticist case; they have certainly caused much vituperation. “he continues to imply fallaciously that it is the authenticists’ responsibility to demonstrate heterogeneity.” Not fallaciously at all. If anybody puts forward any hypothesis, they have some responsibility to defend it when challenged. My hypothesis is that the Shroud is homogeneous; my evidence is Shroud 2.0, Barrie Schwortz’s transmission light photographs and Mottern’s X rays. The alternative hypothesis is that the radiocarbon corner is not representative of the whole; the evidence for this is some reports about variable cotton content, Rogers’s vanillin experiments, his observations of a surface layer of gum and madder, and unjustified accusations of grubby fingeredness among medieval episcopacy. And no, not again! “You can’t explain how it was done, so I must be right and you must be wrong.” This is indeed the common consensus among authenticists, but not, thank goodness, among non authenticists, who recognise it for the specious argument it is..","date":"2014-11-15","mins":"1:05 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171340","author":"hugh_farey","post":"Of course. The Shroud is at least 600 years old and has been contaminated by handling, smoke, wax, insects, mould and bacteria. The point is, as I mentioned, that there is no evidence that there is sufficient contamination at any one point to skew a radiocarbon test. I think even authenticists have generally abandoned the idea that surface contamination even before pre treatment consisted of more than half the measured weight of the samples (necessary for it to hae an effect), and the pre treatment reduced it to a minimum. Two other possibilites are that the linen itself is not original, for which, in spite of some serious investigation, evidence is currently insufficient, or that the original linen has had C14 atoms either created (via neutron radiation) or added (via carbon monoxide), for which evidence is even less. Daveb (below) is correct that this is a perennial topic, but I don’t think we should tire of investigating it. He is also correct that “there are several reasons for coming to the conclusion that it is indeed the burial cost of Christ and dates from that time” and that “belief that the Shroud is authentic is not at all irrational.” However, as anybody who has followed this site for any length of time knows, both the historical and scientific evidence for authenticity is hotly disputed even among authenticists. If there were conclusive evidence that a double imaged sheet was ever in Constantinople, or that the Mandylion was the folded Shroud, or even that the Gospel of the Hebrews was a historical source, then authenticists would be on stronger ground, but there isn’t..","date":"2014-11-15","mins":"3:08 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171532","author":"hugh_farey","post":"“The 1988 C14 result is statistically meaningless.” If only Messrs Damon, Donahue, Gore, Hatheway, Jull, Linick, Sercel, Toolin, Bronk, Hall, Hedges, Housley, Law, Perry, Bonani, Trumbore, Woelfli, Ambers, Bowman, Leese and Tite, not to mention the statistical peer reviewers of Nature, had had daveb’s education, erudition and insight, we might have been saved all this bother. Silly Professors, silly Doctors, silly Non authenticists – it’s a wonder the British Museum hasn’t been turned into a Bingo Hall, the Oxford Radiocarbon Accelerator Unit into a Skate Park and the Arizona AMS Lab into a Cinema. Now we can all move on and look for UFO landing grounds on Mexican pyramids..","date":"2014-11-16","mins":"5:04 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171603","author":"hugh_farey","post":"I couldn’t disagree more. These scientists, many of whom are still alive and some of whom I have corresponded with, think that the sample tested was sufficiently representative to give a reasonably accurate date for the Shroud, and was sufficiently well prepared to remove a substantial proportion of any surface contamination. If any of them had thought that the result was ‘statistically meaningless’ they would have said so, and if that was so of a majority, the report would have reflected that. They had no reason to hide their objections to the sampling on purely statistical grounds. I dare say some of them were as familiar with the work of Hoel and Mc Farlane Mood as daveb. I do not know who actually wrote the paper, but am certain that it was carefully reviewed both by its co authors and by its reviewers. The idea that they signed it “without any questions” “with no second thoughts”, or frightened that they would be classed as flat earthers is not tenable. But that does not mean that ye “who still believe the Shroud is authentic, are just poor, gullible, uneducated, unenlightened, bigoted people.” That is the language of authenticists, not of non authenticists, as has been amply demonstrated in this very blog..","date":"2014-11-16","mins":"5:00 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171573","author":"hugh_farey","post":"No, I can’t accept that. All those people signed the Nature papers without any questions! Really? Have you any evidence for that? And the reviewers from Natures had no second thoughts? Really? Have you any evidence for that? Even carbon dating specialists raised no objections? Did they not? Maybe they looked for some but couldn’t find any. This is heading for conspiracy on a scale Stephen Jones can only dream of. I think it possible that some people would sign anything in a fanatical attempt to declare the shroud a fake, just as there are those on this site who accept anything in a fanatical attempt to “prove” its authenticity, but to suggest that all of them cheerfully allowed their name to be attached to something they considered “statistically meaningless”, and that the reviewers in fact failed to review the paper at all is very far fetched, in my opinion..","date":"2014-11-16","mins":"9:48 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-201411","author":"hugh_farey","post":"Hugh F carried out a number of tests in the hope of getting at least some blurry results from the decompostion of mice. Various treatments of cloth were tried, and the mice kept in a warm incubator. Sadly, although putrescine and cadaverine were very much in evidence after a few days, none of the cloths or their coatings discoloured at all. Putting them in an oven for a few hours produced irregular discolouraton, but not sufficient to relate the discolouration to the shape of the mice. All rather a damp squib, I’m afraid! Nabber, I understand that the bloodstains are not smeared, but “intact” is pushing things. Hardly any blood remains as it has mostly been abraded away, anyway, so if intact means that it’s all there, well it’s not. If the blood represents a contact layer – body on one side, cloth on the other, then the stains had no independent ‘surface’ at all, and the removal of the body inevitably exposed the inside, and pulled the adhering edges away..","date":"2015-06-09","mins":"11:36 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201431","author":"hugh_farey","post":"I didn’t write one. I’m having a rethink. I think the atmosphere was too dry, and am thinking of repeating the experiment in a more humid environment..","date":"2015-06-09","mins":"4:07 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-171824","author":"hugh_farey","post":"All very true. However, give time, I think it possible that the origin of the parent flax could indeed by identified, either by DNA comparison or by isotopic analysis. I imagine it’s only a matter of time. I also imagine that, having caught more popular interest, the textiles of ancient Egypt have already been subject to this kind of investigation, so the technology is already in place..","date":"2014-11-18","mins":"2:49 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-201516","author":"hugh_farey","post":"I used ordinary unbleached undyed linen, and treated it with various things including dextrose, singly and in combination..","date":"2015-06-10","mins":"3:49 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201534","author":"hugh_farey","post":"No. One must not get carried away by the photographic similarities of the Shroud. The intensity/distance relationship (if some kind of action at a distance is involved) or the intensity/pressure relationship (if there is only contact imprinting) is the same for the Gyotaku as for the Shroud. The Shroud image certainly gives the illusion of a photographic negative, as, in this particular case the intensity/distance and the intensity/pressure hypotheses are comparable to an intensity/luminosity relationship, which is what a photographic negative has. That the comparison is illusory is easily understood by considering the beard, and eyebrows of the image of the Shroud. These may be assumed to have been darker in colour, in life, than other parts of the skin. Any bruises the man might have developed would also be darker than the surrounding skin, and perhaps the nose and lips also. However these all appear as lighter on the ‘positive’ than the surrounding skin. Of course the luminosity of a normal photo is related to the reflectivity of the surface, while the luminosity of a luminous body is related to the emission intensity of the radiation. However, the negative image of the Shroud does not look like a body glowing from within, it looks like a normal reflected light photograph. If we claim that in this case actual emitted luminosity can be related to supposed reflected luminosity, then we still have the curious paradox of why the hair should emit stronger radiation than the skin. Attempts to explain that for this unique occasion, the entire surface of the body was equally emissive, that the emission was entirely vertical, and that the emission was strongly attenuated (to zero over 4 cm) entirely by distance and nothing else, are not characteristic of any known radiative body. So, no. “Some sort of light, X ray or some sort of radiation type waves” do not “have to be involved” and “the surface of the linen cloth” does not have “to act like photographic or X ray paper.”.","date":"2015-06-10","mins":"9:29 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201514","author":"hugh_farey","post":"It wasn’t me, Thibault, it was Yannick, but try “http://japr.oxfordjournals.org/content/5/2/161.full.pdf”.","date":"2015-06-10","mins":"3:45 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201649","author":"hugh_farey","post":"“But I am using it show the effect of radiation to the Shroud image.” But it doesn’t show the effect of radiation on the Shroud image. It doesn’t show anything relevant at all, does it?.","date":"2015-06-11","mins":"4:37 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-157622","author":"hugh_farey","post":"Various points. Firstly, like Yannick, I am not a great believer in all the extraneous clutter, from papyrus inscriptions to pieces of the titulus, ropes, nails, crowns of thorns or any of the flowers supposedly observed on the Shroud, and secondly, I know nothing about early Jewish burial rituals. However, I am also not a great fan of the appeal to authority simply because the authority is an authority. This approach leads to the “my expert is better than your expert” kind of bickering, and, although it seems to have passed Yannick by, he is not the first person to have consulted an “expert in ancient Jewish burial rituals.” There are undoubtedly several others of equally impeccable credentials who would disagree with some of his opinions. No, an expert is useful not because “he is an expert,” but because of his ability to explain how he has come to his opinions, via his research. Yannick’s “Am I right? – Yes you are” conversation is unlikely to convince anybody who disagrees with him. If Yannick really wants his expert to sound convincing, he must words his questions to attempt to disprove his hypothesis. So: 1) Have any 1st century Jewish burials been found with flowers (or papyri, ropes, coins, etc) associated with them? In what circumstances? 2) How good is our evidence for what exactly was the ‘prescribed ritual?’ 3) Were there particular rituals for people who were executed criminals, or had to be buried in a hurry? Is there evidence of exceptional procedure in such cases? 4) Could the fact that Jesus was thought of as God have influenced his followers in diverting from the prescribed ritual? 5) How closely were prescribed rituals followed anyway? How do we know? Perhaps, if Yannick reads this, he could put this sort of question to Joe Zias, whose answers would be far more interesting than those he gives above..","date":"2014-09-29","mins":"5:39 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-201567","author":"hugh_farey","post":"If the Shroud is miraculous, then it doesn’t need Physics to account for it. If it isn’t, then comparing Jesus’s hair to that of the child above is not very helpful..","date":"2015-06-11","mins":"1:00 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201612","author":"hugh_farey","post":"But keep an open mind, Paulette. There’s always a possibility that a naturalistic mechanism will turn up..","date":"2015-06-11","mins":"7:20 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201497","author":"hugh_farey","post":"Gyotaku images are essentially bas reliefs (the fish) smeared with paint and imprinted onto paper. The same process would not work with people, who look less like bas reliefs than fish. As an experimenter with cadaverine and putrescine, I can say that they diffuse all around the room in which they are created and sometimes into the corridor outside. If these gases reacted with anything clothlike, I feel sure we would know about it. However I very much doubt any collimated accuracy could be achieved with them..","date":"2015-06-10","mins":"12:55 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-160142","author":"hugh_farey","post":"Is everybody aguing the same thing here? It seems that nobody, including Yannick, Max, Frias or Mo thinks that coins were a common Jewish burial practice, but equally nobody (perhaps with the exception of Mo) thinks it impossible that coins were occasionally used in some circumstances. In that case, whether there are coins over the eyes of the man in the Shroud depends wholly on the evidence of the Shroud itself, not on historical precedent. Are there marks of coins or not? I think not. Max thinks there are. Others agree with one side or the other. And that’s it. Interminable perorations about FACTS (all of which are disputed) are no help at all..","date":"2014-10-07","mins":"11:25 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-161040","author":"hugh_farey","post":"Reference 1: Jericho D18. Hachlili makes clear that two coins were found in the tomb, one in a damaged skull and one on the floor. (Page 439 in the Googlebooks edition) Unless Max has a different source, he is mistaken in saying that two coins were found in the skull. Reference 2: Caiaphas’ daughter’s intact skull. There in no specific mention of any intact skull in Hachlili’s book. However, an intact skull “of a woman in Ossuary 8 of the Caiaphas family tomb” is implied in a paragraph on Page 443. A passage on Page 266 says, “Two inscriptions, 4 and 7 (on ossuaries 5 and 8) are incised with the names of women: [Hebrew text] ‘Miriam daughter of Shim’on’ and [Hebrew text] ‘Shalom.’ There is no obvious suggestion that either of these women were daughters of Caiaphas, however. I hope this helps!.","date":"2014-10-10","mins":"10:56 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-158578","author":"hugh_farey","post":"Hi Domenico, it may be unjust to judge Joe Zias in this case. See my comment below (October 1, 2014 at 8:02 am). We have his reply at third hand, and no information about what he was actually asked. I do not believe he can be ignorant of the Giv’at ha Mivtar excavations, and suggest it may have been the wording of the question which led him into his apparently fairly nonsensical answer..","date":"2014-10-02","mins":"6:54 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-160993","author":"hugh_farey","post":"Hi Mo! Most of “Jewish Funerary Customs, Practices And Rites In The Second Temple Period” can be found at http://books.google.co.uk, and purported extracts can be looked up. Which of Max’s quotes would you like confirmed or denied?.","date":"2014-10-10","mins":"7:57 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157760","author":"hugh_farey","post":"This discussion has prompted me to have another look. I see no coins, and although I do see a flower shape (the most famous one, upwards and outwards from the brow, epsilon side), I do not recognise it as a chrysanthemum. To me, its petals are very round, with rounded outer edges, like a ranunculus, quite unlike the longer more daisy like petals of the Chrysanthemum coronarium as identified by Oswald Schewermann and confirmed by several others. (Needless to say that neither Chrysanthemum nor Ranunculus pollen has been found…). Now what I want from an expert is for him to explain to me why this flower looks like a chrysanthemum to him, when it so clearly doesn’t to me. It is frequently published alongside actual chysanthemums and coronal discharge photos of chrysanthemums, and they don’t look the same. I mention this because it follows on rather neatly from my earlier comment, which could have been sub titled “What’s the point of an expert?” It is not enough to retort “Well, I’m an expert and you know nothing of Israeli botany,” you have to explain what you see and I don’t, and why, for your expertise to have any value in this case. My own opinion is that this flower image does not exist at all as such and is an artifact of the weave and the photo, but the point remains valid..","date":"2014-09-29","mins":"3:48 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-85657","author":"hugh_farey","post":"No scientists are haughty when critiquing another’s work. They are generous and forgiving to a fault. They query the evidence humbly, and humbly present alternative evidence if they feel it appropriate, presenting it before the whole scientific community for judgement, so that an impartial consensus is eventually arrived at. They do not accuse each other of fraud or stupidity, but suggest that their opponent is mistaken in his observations, or perhaps that his observations are OK but his conclusions are not justified by them. … sigh … if only ….","date":"2014-03-06","mins":"7:29 pm","url":"https://shroudstory.com/2014/03/06/hit-and-run-trolling-and-a-whole-lot-more/","cat":"other_blogs","title":"Hit and Run Trolling and a Whole Lot More"},{"id":"comment-158319","author":"hugh_farey","post":"I’m sorry that I don’t think Yannick’s latest contributions add anything to his previous ones. I can’t believe Joe Zias is unfamiliar with the excavations at Giv’at ha Mivtar, so I wonder if it was the form of Yannick’s question that enabled him to suggest that the well preserved bunches of flowers and twisted plaits of straw found in some of the ossuaries were mistaken identifications of “remnants of decayed roots from plants/ trees which had infiltrated from above.” Furthermore, Yannick is trying to have his cake and eat it. Having begged Zias to confirm that the Jews were sticklers for ritual observation (no coins, no flowers), he is nevertheless happy to believe that it was bypassed in the case of the washing of the body (no washing), simply in order to account for some of the alleged blood flows. I don’t think appealing to ‘experts’ in one case, and ignoring them in another, gives credence to his hypothesis. Finally, Yannick wants a rational answer to two questions – why coins? and why flowers? Various people, particularly Max, have given sensible replies to these. The hurried burial, the intention to return to complete the ritual, the social variety of Jesus’s followers, the belief that he was the son of God, the company of women, the necessity of weighing down the eyelids, even the Roman guards could all have had something to do with it. But that’s not really important. You can’t make something disappear by asking why it should be there in the first place! It seems that, unusually, we have an authority on Jewish archaeology taking an interest in the Shroud. It would be a pity to waste this opportunity to explore his accumulated experience and knowledge by asking simplistic yes/no questions, rather than trying for a more nuanced opinion..","date":"2014-10-01","mins":"8:02 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-35322","author":"hugh_farey","post":"Hair does not grow after death. Shrinkage of the skin layer due to water evaporation sometimes results in slight exposure of more of the root. There is no biblical description of Jesus, who could have had hair of any length. To what ‘biblical fact’ is your correspondent referring?.","date":"2013-05-30","mins":"4:56 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","title":"How can you argue with this?"},{"id":"comment-57245","author":"hugh_farey","post":"And BASIL. Huh!.","date":"2013-12-08","mins":"9:58 am","url":"https://shroudstory.com/2013/12/08/hurting-peoples-feelings/","cat":"other_blogs","title":"Hurting People’s Feelings"},{"id":"comment-45904","author":"hugh_farey","post":"Hi Julie, I’m not sure what you mean by ‘information.’ Wikipedia has a reasonably balanced article about the shroud which should give you a fair grasp of the ideas for and against authenticity. There were a lot of relics about in the middle ages, and many of them were declared fakes – mostly by bishops who also declared that their own fakes were real. Such was the commercial exploitation of ‘relics’ that it is difficult to give much credence either to accusations of fraud or to declarations of honesty. Those which remain today have to tell their own story..","date":"2013-09-30","mins":"6:46 am","url":"https://shroudstory.com/2013/09/29/in-case-you-missed-in-case-you-missed-it/","cat":"other_blogs","title":"In Case You Missed, “In Case You Missed It”"},{"id":"comment-45938","author":"hugh_farey","post":"I can’t remember if I’ve seen it or not. The steeply sloping tomb lid with the angel perched on it is a common feature of icons of the time. I think it must hark back to Constantine Monomarchus’s restoration of the Holy Sepulchre, but I don’t know how. There was reputedly a stone slab outside the entrance to the Sepulchre itself, which although roughly rectangular, was supposed to be a piece of the original “rolled away” stone blocking ther entrance. I don’t know how much of it remains in the “Angel Stone” which is still there, and quite small, but it may have been considerably larger once..","date":"2013-09-30","mins":"2:15 pm","url":"https://shroudstory.com/2013/09/29/in-case-you-missed-in-case-you-missed-it/","cat":"other_blogs","title":"In Case You Missed, “In Case You Missed It”"},{"id":"comment-144536","author":"hugh_farey","post":"Two posts; two comments, I think. Firstly Colin is correct to query established dogma. Too much of it is based on remarkably little evidence. We must not forget that the only things the STURP team (or Rogers later) had to work on were individual fibres stripped from the surface of the shroud by sticky tape, or the occasional snippet of extracted thread, rarely more than a few centimetres long. I have studied a lot of linen fibres, scorched and unscorched, with a microscope, and find that whether the lumen (lumen, note, a plant fibre has a lumen; wool has a medulla – why do we have to perpetuate Rogers’s error?) is well defined or not is as often a feature of the lighting conditions as of any chemistry. Well scorched fibres may or may not have obvious lumens, as, indeed, may unscorched ones. After all the lumen itself is a void; any colouration must be of its wall, and extremely thin. Thibault’s paper referenced above has lots of micrographs of scorched fibres not one of which has a dark lumen. In his later work, Rogers identified not simply his thin surface ‘impurity’ layer, which he attributed to an evaporation gradient produced from a solution of dextrin, but also the fact that it dissolved in water. Not so the image on the Shroud, which is clearly visible ‘through’ the big water stains across it. The solubility (or just wash away ability) of Rogers’s layer is a major objection to its validity. As I mentioned before, the UV problem (which I know Colin does not think significant) is to me the only objection to the image being a scorch. Almost everyone on the STURP team commented on how similar the image looks to a scorch to the eye (the scorched ironing board), the ‘top of the ridge’ image marks of Mark Evans’s micrographs have clearly and easily been replicated several times, not least by Thibault himself, and microscopically it is clear that individual fibres, and fragments of fibres, can be scorched selectively without the scorch discolouring an entire thread thickness. Whether it actually is a scorch, and how it was done if so, is still a mystery to me, but the chemical and physical arguments against it being a scorch (apart from the UV) have largely been discredited..","date":"2014-08-18","mins":"8:07 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","title":"Into a World Not Cut Off from Reality?"},{"id":"comment-144597","author":"hugh_farey","post":"I don’t think Jackson is at all stupid. I just wonder what he means. He seems to imply that it is not possible for discolouration only to occur on the topmost fibres of a thread, when we have clearly seen that it is. You claim the problem is not one of speed, but your quotation from Jackson is only about speed. Perhaps you could clarify both..","date":"2014-08-18","mins":"2:59 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","title":"Into a World Not Cut Off from Reality?"},{"id":"comment-144546","author":"hugh_farey","post":"Now, Stephen Jones’s reply to a “bippy123,” who, by virtue of being exclusively congratulatory, is one of the few commenters to feature on his blog. Not for the first time I am taken to task for the use of the word ‘accidentally.’ OK, I wish I hadn’t used it, but I have explained what I meant and won’t go on about it. What I disagree with here is the idea that I (or anybody else of my ilk) have simply ignored all the evidence in support of the authenticity of the Shroud. “IS he just overlooking all of the evidence for it being much older,” asks Bippy. “Was it accidently created to have the head image blood stains be an almost perfect match with the blood stains on the sudarium? What about the Hungarian Pray codex? And what about the Mandylion?” I have no doubt whatever that I have examined all these in much greater detail than Bippy himself, and detailed both my inquries and the conclusions I derive from them on this blog. “THE FACTS” shouts Stephen in capital letters, “ARE SIMPLY IGNORED OR BRUSHED ASIDE AS SOMEHOW DECEPTIVE.” Well, I challenge anyone to find a single fact (or even vague hypothesis) that I have either ignored or brushed aside. A few posts ago Andrea Nicolotti couldn’t understand why I didn’t! We are collectively lucky on this (Dan’s) site that whoever we disagree with, we do not either ignore or brush aside their ideas, but examine them with patience and generosity. We may not agree with them, but we give them every opportunity to establish their credentials. The Newsletter of the British Society For the Turin Shroud is in very good hands. Sadly my work will not allow me to attend either Bari or St Louis, but I believe I will be able to spend a week in Turin next June. Perhaps I may meet some of you there..","date":"2014-08-18","mins":"8:54 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","title":"Into a World Not Cut Off from Reality?"},{"id":"comment-161320","author":"hugh_farey","post":"Some interesting philosophical points, Dan. Not for the first time, I think, I am somewhat at odds with Fr Longenecker’s cursory ideas about scientfic, historical and sindonological facts, but most of all, and he is not alone in this, I strongly object to the idea that anybody who does not believe in the authenticity of the Shroud is an atheist. I do not believe that I am any less a committed Roman Catholic than Fr Longenecker himself, but, in common with many other equally committed Roman Catholic scientists, I believe that universe is supremely rational, and do not believe in all his “angels or aliens, demons or devils, goblins or gods.” The sly way he has coupled this bunch together says a lot about his argument. He will jump down my throat, I am sure, with: “Aha, so you don’t believe in angels or god!” but will no doubt claim that my riposte “Aha! so you do believe in aliens and goblins!” should not be taken seriously. This is not the place to discuss the theology of angels, but clumping them together with goblins is simply trite. Sure, “if atheistic materialism is right there are not intelligent, reasonable, personal exterior forces superior to the natural world who might interfere or interact with the natural world,” but I believe that even if atheistic materialism is wrong the world is not beset with “personal exterior forces” who interfere with the natural world. And why do I think that? Because of the total lack of evidence for any such things. [At this point, people who disagree with me give a long list of miracles, usually including rainbow Buddhists and the visions at Fatima, none of which I think demonstrate any ‘outside’ interference with the natural world, least of all the Shroud, which even most of its authenticist adherents do not think is supernatural. Please don’t bother; I already know them all.] In common with many other authenticists (even ‘rational’ ones), Fr Longenecker lists evidences about the Shroud, and on the basis of a 9 1 majority, imagines that his case would be proved to anybody looking “objectively, carefully and with an open mind.” As usual, most of the nine are irrelevant or highly disputed, even among the authenticists themselves (No. 7, for example – “the shroud shows details perfectly consistent with first century Jewish burial customs”, or No. 9 – The cloth is consistent with fabrics from first century Israel). I don’t wish to repeat myself (find other references to Fr Longenecker at shroudstory), but will at least reiterate that “You don’t know how it was done”, which is the first and biggest plank in Fr Longenecker’s case, is not evidence for anything. Finally, unlike most authenticists, I am fully aware of the genuine evidence in favour of authenticity, and am not so convinced in non authenticity that I would go to the stake for my opinion. As I have said many times, much of Dan’s apologia down the right hand side of this blog reflects my view exactly. We have (I hope this is true, Dan!) repect for each other because our reasoning processes are almost identical, and our disagreement, opting for one side or the other, is really not so important as our continued search for better evidence, whichever way it points..","date":"2014-10-11","mins":"9:53 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-161623","author":"hugh_farey","post":"I have never claimed to have provided a compelling case against authenticity. I have demonstrated evidence against authenticity, and in favour of a 12th or 13th century origin, which I personally find persuasive, but I fully accept that others do not. I agree with Thomas that non authenticists face the problem of finding a context within which the Shroud was created, but have suggested lines of inquiry which may be worth pursuing. However, authenticists simply cannot – and they do, all the time – fall back on the “You don’t know how it was done artificially so it must be authentic,” argument. This is nonsense, and so easily reversed to say, with equal validity, “You don’t know how it was done authentically so it must be artificial.” Daveb is a good example of one who, like myself, has weighed all the arguments for and against, and although he has reached a different conclusion, he has carefully explained why. He has listed some debatable issues, and the evidence which he finds persuasive to him, and it is impossible not to respect that (although even he slips in the “You don’t know how it was done” argument at the end). Another constant of the authenticist argument – and this applies to almost everybody and is not specific to Daveb, Thomas or anyone else – is this business about the weight of evidence being sufficient, and a certain irritation with scientists who are pernickity about tiny details. I don’t agree with this. To a scientist the Shroud is not a maypole held up by so many guyropes that a few snapped ones here or there make no diference to its stability, but a reservoir held back by a dam made of many stones, within any of which a single crack threatens the stability of the entire edifice. I dare say a proper approach combines the two metaphors. Some evidence may be considered trivial by either side, and its validity or not makes little difference to the argument, but other evidence may indeed be stand or fall to the conclusion one eventually comes to. For me, one such is the radiocarbon evidence. If it were demonstrated satisfactorily that there was a Russian hacker, an episcopal switch, or any interweaving, then I would agree that on balance, the evidence now tipped in favour of authenticity. I believe also that I have tried harder than most to find such evidence, on the principle that a hypothesis stands or falls on its falsifiablility, but so far, I find it insufficient. Authenticists, I think, would go for historical provenance. If a good source of 3/1 twill were identified, an artist’s workshop and some models or preliminary sketches – if, finally, someone could satisfactorily say, “This is how it was done” – then many would concede that perhaps the evidence now tipped in favour of a medieval artifact. On with the search then….","date":"2014-10-12","mins":"7:32 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-144582","author":"hugh_farey","post":"“Thermal discoloration propagates through the thickness of the cloth on a time scale between 1/100 to 1/10 second.” Does this mean anything? Discoloration does not ‘propagate.’ Heat propagates, perhaps, discolouring as it goes, but it also dissipates. Depending on the temperature, the conductivity of the material and no doubt other factors, there may not be sufficient heat to discolour anything beyond the first few fibres thickness, however fast it goes..","date":"2014-08-18","mins":"1:43 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","title":"Into a World Not Cut Off from Reality?"},{"id":"comment-161784","author":"hugh_farey","post":"I bet he regularly wove 3/1 herringbone twill as well!.","date":"2014-10-12","mins":"6:15 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174939","author":"hugh_farey","post":"“If there is someone out there that can find a two dimensional object that can be photographed and the photograph be turned directly into a full 3 D image, I will pay their mortgage until your home is paid off.” Colin? Have you got a mortgage? (I don’t or I’d grab it myself!). Any cloth singed by a bas relief achieves at least a good as, if not better than an image as the Shroud….","date":"2014-12-06","mins":"10:28 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174940","author":"hugh_farey","post":"Tsk! David G beat me to it….","date":"2014-12-06","mins":"10:28 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174961","author":"hugh_farey","post":"I think Todd is getting a bit carried away. It was the mortgage thing. His first remark was ““If there is someone out there that can find a two dimensional object that can be photographed and the photograph be turned directly into a full 3 D image, I will pay their mortgage until your home is paid off.” A two dimensional object (Colin’s scorch) was turned directly into a full 3 D image within a hour and a half. So now Colin’s image must be shown to have “3 D holographic properties.” Why? Because “FYI there is no one on earth that has a two dimensional image that contain the 3 D properties of the TS. IF you doubt this FACT. Please do your homework.” I think you’ll find, Todd, that we have done our homework. The Shroud of Turin is not a hologram, and has no more (or fewer) holographic properties than Colin’s scorchmarks. A hologram can be made of any 3 D image, and therefore of any 2 D image that can be converted into a 3 D image..","date":"2014-12-06","mins":"1:17 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174998","author":"hugh_farey","post":"Rather to my surprise, when I did exactly as Todd suggested, and took a screenshot of Dan’s image and looked at it with Image J, it was quite good. The fingers of the hand stand out particularly well, and the dimple in the nose and cheek. The cranium, being closest to the image plane, is brightest and highest. I think it bears comparison with Shroud in spite of not being a symmetrical face on obviously recognisable pattern..","date":"2014-12-06","mins":"5:42 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175065","author":"hugh_farey","post":"They did say that, didn’t they? And they were wrong, weren’t they? The first tridimensional images of the shroud were made simply by scanning a photo of the Shroud with the VP 8 analyser. Vignon’s hypothesis, that if the reflectivity of the shroud is directly related to distance from a hypothetical horizontal a relief resembling a face can be extrapolated, has never been denied. They are wrong about the distortion and the flattening, as can be seen in abundance in this blog, where relief images at least as good as the shroud and often better (such as Colin’s above) are demonstrated..","date":"2014-12-07","mins":"4:14 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175122","author":"hugh_farey","post":"“All of the studies that I have read” If you’d like to mention one or two of them, I will happily refute their claims. And seriously, have you never seen a hologram? They were very popular some years ago, and can be bought for very little on ebay. The one I was referring to was of course the flying bird which appears on every VISA card throughout the world. There is no doubt something similar on other credit cards. The Shroud is not a hologram. You mentioned Dr Soons, whose work was remarkable in several ways, and who did produce a hologram from the image on the Shroud. The production of the hologram, however, could have been just as easily achieved with any 3 D image digitally plotted on a computer, and had nothing to do with the Shroud. Where he, and later Ray Downing, really achieved success was in their taking of the fairly crude bas relief achieved by the 3 D software, and manipulating it into an image which better resembles a man lying down. No one could fail to be impressed by their achievement, but it requires considerable subjectivity and is really more of an art than a science. However, their starting point was no better than Colin’s scorch, and, had they bothered, they could have produced just as good a hologram from that as from the Shroud image. I have to say that I’m not sure that if you have read Drs Jackson, Jumper or Soons or Ray Downing’s detailed accounts, you have really understood them. As I say, if you would like to give a reference, I will be most happy to explain it to you, and, if there is anything to refute, to refute it..","date":"2014-12-07","mins":"3:02 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-161560","author":"hugh_farey","post":"“the curious fact, for fact it seems to be, that there is no dispositive evidence, or evidence of any sort that I can tell, against it.” There is nothing wrong, RH, in your conclusion in favour of authenticity, but your asserted method of acheving it is, if I may say so, deeply flawed. Many people have weighed all the evidence for and against the authenticity of the Shroud and come down for or against authenticity as their personal position. Nothing wrong with that. Others have allowed the image on the Shroud itself, as an icon of Christ, to form their judgement, regardless of science, and that is a valid position too. But your position is that you have balanced the evidence in favour against – what? Nothing. You have not found any evidence against it. How could you fail to be convinced of the Shroid’s authenticity? How could anybody? Of course, in those circumstances, it is “reasonable to conclude that the relic is authentic.” I do not know where you have been looking, but this site, from its inception, has been devoted to examining all the evidence, for and against, in such excruciating detail that exact quotations from obscure publications, or minute blips in spectrographic analyses, have been debated for days. A person’s convictions are his own, and no one should deny him them, but when he communicates them publicly, he has some responsibility to his audience, especially to those who hold different opinions. It is not enough for him to explain why he is right; he must also try to explain why they are wrong. If he is unable to explain their attitude at all, then he cannot refute it, although he may simply consider them evil or mad. If RH has read any of my, or David Mo’s, or Charles Freeman’s or several others’ comments over the past months, he will have come across evidence in abundance to explain why we cannot agreee that the Shroud is authentic. He should have considered it, and decided that it was not sufficient to change his view of authenticity. To announce that he has never seen “evidence, of any sort … against it” is irresponsible, making, if I may paraphrase, hyperbolic certainty an unbeatable standard. That, it seems to me, is unreasonable..","date":"2014-10-12","mins":"3:59 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174969","author":"hugh_farey","post":"The absurdity of my comment may be judged by other readers. The Shroud is not a hologram. I do not know of any unique properties. In common with every other artifact, it has a blend of properties which make the object unique, but none of them is particularly mysterious. Talk is indeed cheap. I note your 10 comments so far with interest, but I’m not sure what evidence you would like me to show. Do you want me to demonstrate that the Shroud is not a hologram? Well, I have hologram in front of me here. It is of a flying bird and about a centimetre square. As I tilt the hologram I seem to see a 3 D object in that some parts of the bird are revealed and hidden, as they would be were it solid, as I move it from side to side. The beak almost touches the tip of the left wing in one orientation, but is far removed from it in another. This does not happen with a picture of the Shroud. No part of the cheek is hidden by the nose as I change my point of view, nor do the fingers seem to change their orientation. The Shroud is not a hologram. When viewed in a VP 8 analyser, or by Image J, a 3 D image can be generated from anything at all, more or less realistically. Whether the Shroud image is better than any other full face, frontally lit, black background, portrait is somewhat subjective, but whatever the realism, a contour map of the 3 D image, and thence a solid 3 D object can be generated from it. A hologram could then be made of this object, just as it can of any object, using the appropriate equipment. The Shroud is nothing special in this respect. In spite of “doing my homework” I have yet to see anything different elsewhere in Shroud research. If Todd can show anything different, I would, of course, give it my most concentrated consideration..","date":"2014-12-06","mins":"2:42 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174994","author":"hugh_farey","post":"“the current evidence that shows that the shroud is indeed a 3 D hologram” No Todd. The onus is on you. If you can point me to any evidence that the Shroud is a 3 D hologram, I shall be happy to refute it. There is no such evidence. There is nothing to refute..","date":"2014-12-06","mins":"5:09 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175281","author":"hugh_farey","post":"Todd. “Would you tell me flat out that the Shroud when photographed, does not have any different properties than any other photograph?” No, of course not, why would I? I have already said that when analysed by a 3 D interpreter such as the VP 8 or Image J, the Shroud image can be converted to what looks like a bas relief of a face, where the nose and forehead appear more prominent than the eyesockets and so on. I am however very happy to disagree with you and any quote to the effect that “no other photograph contains spacial encoding when viewed under the VP 8.” The evidence is clear, unequivocal, and appears a few column inches above this comment. A scorch on a cloth, made by a heated object, photographed and analysed by 3 D software reveals precise spacial encoding, and can be converted back into a 3 D image of the object that made it. Exactly like the image on the Shroud. What’s more, as I have found out by myself, such an image is easily made from any object that can be sufficiently heated to produce a scorch. It may be that Pete Schumacher had never seen a scorch image, but you, now, have. You can see that Schumacher’s sweeping generalisations, such as “the Shroud image produces a three dimensional response unlike any other image so processed” is simply wrong. Yes, wrong. A scorch produces a three dimensional response very like that of the Shroud. There’s a picture of it above. Now; how will you respond to the paragraph above? By quoting, again, from Schumacher? Why? Is he somehow infallible? Please don’t. Compare the Shroud 3 D and Colin Berry’s 3 yourself and explain why they are not comparable. Forgive me if I err, Todd, but it seems that you would rather accept the pontification of an “authority” over the evidence of your own eyes. If so, then of course there is little point in my attempting to demonstrate him wrong, and I apologise for wasting your time, but if you are able to make up your own mind from evidence presented, then please explain why the image above is so different from that of the Shroud image to you..","date":"2014-12-08","mins":"7:02 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175341","author":"hugh_farey","post":"As a (fairly) long time student of shroudstory by now, I am of course aware of all the reasons for and against the Shroud image being a scorch. I have carried out extensive research into the UV characteristics of scorched linen myself, corresponded in detail with Colin and Thibault, and deeply respect their ongoing research into the subject. That, however, was not your point. You asked for evidence for two things, which has been provided with speed, clarity and abundance. 1) Can I demonstrate that the shroud is not a hologram? Yes I can, and have done. 2) Can I demonstrate any image at all that shows a similar 2 D 3 D convertibility to the Shroud. Yes I can, and have done. There is no doubt that the Shroud is a unique object. It shows an image of Christ that is to mind superior to that of, say, Michaelangelo’s Pieta, Da Vinci’s Last Supper, Della Francesca’s Baptism, the Byzantine Pantocrators or any of the 20th Century images, including Ray Downing’s “Real Face of Jesus” or Akiane Kramarik’s paintings. That in itself could be evidence of a miraculous origin, and I would respect anybody who thought it so. As daveb reminded us a little while ago, the Shroud’s chief interest to Christians is as an icon of the almighty, and a very fine one it is too. It can justify its existence perfectly well without being wrapped up in para scientific generalisations or mumbo jumbo such as “holographic 3 D quantum matrix” which means nothing at all. Beyond that, it’s a cloth, with an image, of unknown age, provenance and manufacture. These qualities can be investigated forensically. Some of us find it rewarding to do so, but it’s not compulsory..","date":"2014-12-09","mins":"5:57 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-54228","author":"hugh_farey","post":"Brilliant!.","date":"2013-11-30","mins":"7:01 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-54273","author":"hugh_farey","post":"I think the point of my last comment was missed, although it did build on what had gone before. Innocent people are indeed sent to prison, and a verdict of guilty does not, of course, mean that a prisoner has actually done any of the things that he is convicted of. But the consensus of the court, and by publication, of the rest of the populace, still dooms him. Guilt or innocence, in other words, is not a statement of truth, but a statement of publicly accepted truth, based on a consensus of the evidence presented. In the same way, Joe Nickell’s “Inquest on the Shroud of Turin” and, with a nod to metaphor, Walter Mcc Crone’s “Judgement Day for the Shroud of Turin,” may have ‘convicted’ a first century burial cloth of being medieval. Their findings were very widely publicised and are accepted as fact by hundreds of people. On the other hand Stevenson & Habermas’s “Verdict on the Shroud of Turin” came to the opposite conclusion, and their findings (in conjunction with many others’) are also accepted as fact by hundreds. It doesn’t seem possible to determine where, of if, there is a consensus. If Nickell and Mc Crone are wrong, how do we overturn their verdict? If Stevenson and Habermas are wrong, how do we overturn theirs? A simple consensus of probabilities won’t do. We examine every tiny detail of their findings, and point out flaws which reduce the probability of their being correct, one by one, painstakingly, until their adherents themselves have sufficient doubt about their conviction that they reclassify it as a probability, or even as simply indeterminate. The conviction that the shroud is authentic has recently been supported on this site by comments insisting on the bigger picture, on a mass of evidence, and consensus. The balance of probabilities for these commenters does not hover around the horizontal, as it does for some of us, but crashes firmly down on one side or the other. Investigating a single tiny detail is unlikely to redress their convictions, and they have wondered why anybody would bother. However for those whose balance is more finely tuned, a single thread, (literally, probably one of Rogers’s), can affect it. We began this discussion by Charles Freeman wondering whether a stitch on the shroud was as unusual as was previously thought. It seems not. A single tiny detail. A shift in the centre of gravity. That’s what I like about studying the shroud. Uncertainty..","date":"2013-12-01","mins":"5:56 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-54878","author":"hugh_farey","post":"Drivel… Oh, well… Never mind….","date":"2013-12-02","mins":"6:02 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-54281","author":"hugh_farey","post":"Wise words, as ever..","date":"2013-12-01","mins":"6:30 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-54188","author":"hugh_farey","post":"No no no. This won’t do at all. The shroud is not under “trial” nor will a “verdict” make it authentic if it is a forgery, or a forgery if it is authentic. I think daveb, a model of good sense, is quite right in guessing that if there was a “trial of authenticity,” the shroud would be found “authentic,” but that will no more make it authentic than any other miscarriage of justice properly determined by a court of law. The same would apply if, after a retrial, it were found inauthentic. Scientists, surprisingly, are not keen on facts. They work with probabilities, with suggestions and difficulties, out of which a general acceptance, with reservations, gradually emerges. They explore every carp and niggle, and expose new evidence, which they immediatley attempt to discredit. The weight they give to each piece of evidence is often largely subjective, which is why they can differ quite markedly, even from exactly the same evidence, if they’re forced to come to a conclusion. I don’t think I have ever claimed that the shroud must be a forgery because of such and such, or that it must be authentic because of something else. For many years I have teetered around the 50/50, sometimes thinking there was 60/40 chance the shroud is genuine, and sometimes thinking the reverse. But a 60/40 chance is not a conviction of authenticity, nor is the reverse a conviction of forgery. A scientific fact is not achieved “beyond reasonable doubt” but beyond any doubt at all: that’s why there are so few of them. So, by all means believe the shroud genuine or fake, according to your convictions, but if you believe it fake, keep those halophytes in the back of your mind, and if you believe it real, do the same with my 610nm spike, and remember that “they can’t show how it was made” cannot be twisted into “therefore it must be authentic” any more than it can into “therefore it must be a fake.”.","date":"2013-11-30","mins":"1:12 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-54205","author":"hugh_farey","post":"No no no, again! The shroud is under investigation, not under trial. At the outcome of a trial, it is not possible to deliver a verdict of “Probably,” but that is the outcome of many, many investigations. If Max Frei’s pollen findings were discredited, there would be very little to link the shroud to Jerusalem, and if the C14 dating was discredited, there would be little to link it to the 13th century. Although fanatics of either side think these points have been roundly cleared up (to their own satisfaction, of course) they are still important bones of contention. And, dear me, of course the verdict makes you guilty (or not). However innocent you be, if you’ve been properly stitched up by cleverer villains, the verdict of guilty locks you away and makes you a pariah in decent society. And conversely, however many atrocities you’ve committed, if you can afford a clever QC to persuade the jury to say ‘not guilty,” then you’re as free as any other citizen to continue on your way with your head held high. And that’s precisely the point. A verdict is a reasonable judgement, not, by any means, necessarily, a truth. And who is to decide what a reasonable judgement is, in the case of the shroud? Well, it’s every man for himself, I’m afraid. Any my verdict? “Probably” (or probably not, according to the wording of the indictment). Scientists do not explore every carp and niggle? Nonsense, again. They do not explore every tiny detail, perhaps, but if there is a carp against their findings, or a niggling inconsistency, then yes, getting to the bottom of every one is crucial to the publication of their findings, and occasionally pointed out (with glee) by their peers. Failing to respond to objections, or brushing them aside as irrelevant (unless they are) is a short cut to ignominy. And finally: “The point is not an individual judgment concerning one fact or another but a collective consensus concerning a viable constellation of facts.” What on earth does this mean? The point of what? Of my investigations? Not at all. Of yours? Scientific truths are not collective consensuses of viable facts. Legal truths are. A legal truth can be overturned, and often is, on appeal. A real truth can’t be. If the shroud is a 13th century fake, then no amount of consensus can make it authentic, and if it’s genuine, then none can make it false. It is not up to a committee to decide. In the absence of irrefutable proof, as I said, it’s every man for himself..","date":"2013-11-30","mins":"3:58 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-96615","author":"hugh_farey","post":"Well (it’s surprising where shroudology takes you sometimes) I find that young snakes are fed on “pinkies” which are only a few grams, and are young mice before they get any fur. If they are too small to be used individually, it may be necessary to use three or four at a time, but they are so cheap that I think the budget can stand that..","date":"2014-04-04","mins":"7:21 pm","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","title":"Let the Experiments Begin"},{"id":"comment-148322","author":"hugh_farey","post":"The scarcity of byssus today, and the character of the grand dame of contemporary byssus production, Chiara Vigo, have combined to give it a more or less impenetrable mystique. Daniel Mc Kinley (Pinna and her Silken Beard: A Foray into Historical Misappropriations) does a lot to dispel the mythology that has grown up around it (particularly with reference to transparency in ancient textiles), albeit without reference to Manoppello, and Jaworski (The Properties of Byssal Threads, the Chemical Nature of their Colours, and the Veil of Manoppello) has examined byssal threads in great detail, and found compelling similarities between them and reported observations of the Manoppello veil, but still concludes that Giulio Fanti is probably correct in saying that the fabric is probably linen. A compendium of surviving specimens of nineteenth century byssus is being compiled in Switzerland, virtually none of which are woven, knitting or crotcheting being the dominant method of manufacture. Although I have not seen any painted specimens, that may be more to do with the deep golden brown colour of the fabric than because it is ‘impossible to paint.’ Jaworski found that the fibres were hydrophobic, but that microgranules of colour remained on the surface of fibres which he tried to paint with watercolour. Perhaps a light oil would work better. Also, I don’t think byssus is particularly fragile. It is very susceptible to insects, which is probably why there are no ancient examples to be found, but seems to have been used for gloves and stockings in some abundance, for which a reasonably sturdy material is essential. The fibres are reported as being an average of 25um (Jaworski) or 14um (Fanti) in diameter, which is much thicker than silk, and Fanti reported a thread thickness of 120 um, which is comparable to the linen thread thickness of the Shroud..","date":"2014-09-03","mins":"1:36 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-155875","author":"hugh_farey","post":"Calling people fools tells the reader, I think, more about the character of the caller than that of the called..","date":"2014-09-25","mins":"10:45 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-155911","author":"hugh_farey","post":"“And the cause of science is not advanced by “scientists” who attack a particular religious belief without doing the science.” In response to my challenge, Mr Klotz named two: Carl Sagan and Richard Dawkins. To the best of my knowledge Sagan did not attack belief in authenticity of the shroud at all. In a radio interview on You Tube he admitted having respect for Walter Mc Crone, but, not having read anything else about the Shroud, did not commit himself to any particular viewpoint, and certainly did not attack any religious belief. Richard Dawkins, on the other hand, has spent a lot of time and energy “doing the science” and come to the mistaken conclusion that God does not exist. This is not a “particular religious belief,” but a general attack on the whole ideology. The cause of science is certainly not advanced by this view – and in fact such was the naivity of The God Delusion that the cause of religion was rather strengthened by it – but it has little to do with the Shroud. This was mentioned in his book The Greatest Show On Earth, in connection with radiocarbon dating, which, “doing the science,” he accepted. However he also accepted that the date could be wrong. “The dating of the shroud remains controversial … For example, the carbon in the shroud might have been contaminated by a fire.” This is not an “attack” on “a particular religious belief without doing the science.” So, as far as I can discover – and please quote chapter and verse if I’m wrong – neither Carl Sagan nor Richard Dawkins have attacked belief in the authenticity in the Shroud. Furthermore, such a belief is not, for most people, a religious belief anyway, but a conclusion derived from evidence. After calling me a fool, Mr Klotz now finds my careful exposition of his nonsense insulting. I can’t think why. As I’m sure King David would agree, not all fools deny the existence of God, many of them are his most devoted servants. And yes, being a Catholic school, the bible is quoted frequently here. “Love those who hate you” is a favourite… Details about Shirley Anne Martin are readily available on the internet as reports in numerous papers. There were no “weeks or a couple of months of hysterical viewings,” as I said. “I am afraid if you find my definition of rationalist offensive.” Of course I don’t find your definition offensive. For a start you don’t give a definition, and for a second your only mention of the word occurs in a sentence of such absurd generalisation no one could possibly take it seriously. Sadly, I will not be able to come to St Louis, but I will be delighted to buy your book for the going rate on Amazon.uk when it arrives. I wish it every success..","date":"2014-09-25","mins":"11:46 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-96604","author":"hugh_farey","post":"Hi Thibault, I’m currently thinking of preparing three types of linen – untreated, treated with saponin and dextrin, and treated with myrhh, and laying these around defrosted mice at about 20°C for three times (perhaps one day, three days and six days), observing the results and if necessary warming the cloths for a while to reveal any latent image. Any success will be followed up with confirmatory and extended experiments until I have used up a pack of 20 or 25 mice. Any deteroration of the linen due to ammoniacal decomposition, or putrescine, cadaverine or anything else ought to be observable..","date":"2014-04-04","mins":"6:36 pm","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","title":"Let the Experiments Begin"},{"id":"comment-155967","author":"hugh_farey","post":"Fair enough. Thanks for the reference..","date":"2014-09-25","mins":"1:25 pm","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-157191","author":"hugh_farey","post":"Again, thanks for the reference..","date":"2014-09-27","mins":"7:28 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-155841","author":"hugh_farey","post":"As a “fool” as defined by Mr Klotz above, I feel no qualms about saying that his post is nonsense from begining to end. The complexity of reality was discovered and exposed by rationalists, not denied by them. A truly dogged agnostic would not write anything off as a hoax; that would be a rejection of his agnosticism. In 1949 11 year old Shirley Anne Martin made tears come from the eyes of the broken head of a statue of St Ann for a couple of days. There were no weeks or months of hysterical viewings, although she did appear on television demonstrating her ability. “Anyone, who dismisses the Shroud image as other than an image of a horribly tortured, crucified man that was by all probability created within three days of his death, is a fool whatever his credentials. Science demonstrates that it IS.” I thought we’d grown out of this childish insult throwing by now. Science has opened many lines of investigation into the Shroud, but closed very few. It has certainly not conclusively demonstrated that the Shroud is authentic. “And the cause of science is not advanced by “scientists” who attack a particular religious belief without doing the science.” Can Mr Klotz name any of these “scientists” and their attacks? Which religious belief does he think has been attacked in the absence of “doing the science?” Does he think belief in the authenticity of the Shroud is a religious belief? Does he think rejection of its authenticity must be a rejection of religion? “In the case of climate change, the atheists and agnostics who proselytize for atheism instead of sticking to scince, are as big a danger as those who are driven to reject scientific proof by the arrogance of some scientists. And thn the question arises, whose paying for the opinion?” What on earth does this mean? Atheists are as big a danger as climate change deniers? To whom? Do atheists deny climate change? Calling people fools tells the reader, I think, more about the character of the caller than that of the called..","date":"2014-09-25","mins":"9:40 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-205941","author":"hugh_farey","post":"Charles is perfectly correct. There is very little evidence for any standards of length anywhere in the 1st century, and none whatever for 1st century Middle Eastern weaving looms. Such definite evidence as there is – some Roman, some Herodian – does not support the contention that the Shroud was made to a definite size, although I agree that its proportions of 8 x 2 do seem deliberate. If anything, 1st century cubits were considerably smaller than Assyrian ones. Jones, quoting Dickinson, says “a particular cubit of the market place that is connected with the Shroud, the cubit that is known as the Assyrian cubit: the widely used, indeed, international standard of that time for merchants of the Near East, and had been so for centuries.” I can find no evidence for this at all. I did ask for it the last couple of times this topic was raised, but nobody suggested anything..","date":"2015-07-16","mins":"9:13 am","url":"https://shroudstory.com/2015/07/16/maybe-a-not-so-startling-coincidence-of-something-that-is-approximate-and-presumably-averaged/","cat":"other_blogs","title":"Maybe a Not So Startling Coincidence of Something that is Approximate and Presumably Averaged"},{"id":"comment-191269","author":"hugh_farey","post":"Considering this is attempt to produce a definitive Encyclopaedia of the Shroud, a worthy cause, it is a shame that it is illustrated by a map which is admittedly misleading in at least two respects, namely the Templar route to ‘Paris 1307’, which has apparently been discarded, and the position of “Montfort 1418”, which turns out to be in the wrong place. Jones thinks that the Shroud did spend some time in the marked Montfort, but in 1358 1359, after which it moved to Anthon. However he gives no reference for this. The root of the various discussions regarding the Shroud’s movement at this time seems to be M. Bergeret’s Ohio Conference paper on ‘Linceul de Turin – Le Trou Historique’ which says that the Shroud moved to Montfort in 1360 and stayed there till 1389, and Dorothy Crispino’s ‘To know the Truth’ which says that it may have moved directly to Anthon in 1357 and stayed there till 1388. No doubt there are other variations on the theme. While the ruined Castle of Montfort is correctly illustrated, the photo of the Anthon Chateau is at Anthon, Isères, not Anthon, Haute Savoie, and is not associated with Aimon de Genève..","date":"2015-02-17","mins":"8:46 am","url":"https://shroudstory.com/2015/02/17/movement-of-the-shroud-after-1355/","cat":"other_blogs","title":"Movement of the Shroud after 1355"},{"id":"comment-111761","author":"hugh_farey","post":"Bless him. I am loath to think of Stephen as either stupid or wilful, so I assume I did not express myself sufficiently clearly. Lest any of our readers on shroudstory have been similarly misled, let me clarify. I do not for a moment suppose that the apearance of the image on the shroud was a freak combination of circumstances wholly unrelated to its subject, such as those wonderful cloud formations and pieces of pizza that turn up on the web every so often, but I do think that the image as we see it now was probably not what its creator intended. I think it likely that there was something on the shroud, possibly a pigment of some kind, possibly even material glued in place, which has come off, leaving the image we see today. It could have been scorched by a bas relief, either when it was heated (although I find it hard to think that could have been wholly inadvertent), or when a protective covering of paint or varnish or cleaning material or preservative made contact with the cloth. The concept of the volkringer image has occsionally been brought up, in which context you might like to peruse this: http://imgur.com/9ta Z8vg, which is the tissue paper protective covering to one of the plates in my (electronic) copy of Vignon’s 1902 book, the Shroud of Christ. Some of the burn hole pattern is clearly visible – by accident. There are plenty of authenticists who also think the shroud is an accident, an unintended consequence of the circumstances surrounding the entombment of Jesus. Some say that the image is not mentioned in the bible because it developed over time. Browsing Stephen’s blog (for the primary source, as usual) I find that his flight of fancy was actually written as a response to a correspondent calling himself the devil. Strange bedfellows!.","date":"2014-05-05","mins":"9:21 am","url":"https://shroudstory.com/2014/05/05/mental-health-break-2/","cat":"other_blogs","title":"Mental Health Break"},{"id":"comment-158376","author":"hugh_farey","post":"Did Occam say anything about the multiplication of Forums? I hope we don’t split into lots of little subgroups, many of which will overlap and have us clicking from forum to forum in the hope of tracking down elusive new ideas. At the moment I find nearly everything on this one, with occasional peeks at Colin and Stephen Jones, just to see what they’re up to; I hope nothing too earth shattering diverts us all from shroudstory to stlouisshroudconference..","date":"2014-10-01","mins":"1:51 pm","url":"https://shroudstory.com/2014/10/01/new-discussion-facility-on-the-st-louis-conference-site/","cat":"other_blogs","title":"New Discussion Facility on the St. Louis Conference Site"},{"id":"comment-20955","author":"hugh_farey","post":"Is it certain that the side strip is in fact detached? Accounts suggest that it is so well correlated that individual threads can be traced more or less continuously from the main cloth, through the seam and into the side strip, with very close precision. I believe the Raes sample contained a bit of seam – did it come apart into two pieces?.","date":"2012-12-22","mins":"6:48 am","url":"https://shroudstory.com/2012/12/21/nice-short-summary-of-the-shroud-of-turin/","cat":"other_blogs","title":"Nice Short Summary of the Shroud of Turin"},{"id":"comment-212219","author":"hugh_farey","post":"“Anyways, if the C14 teams had looked at the results and suggestions of STURP, they wouldn’t have picked the worst place in the world for a sample.” The C14 teams knew the S Tu RP investigations very well. They did not choose the sample site..","date":"2015-10-10","mins":"6:02 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-46384","author":"hugh_farey","post":"I have the Miller/Pellicori UV images enlarged before me as I type. Also shroudscope. I see nothing to suggest that the blood marks preceded the image, nor the other way round. There may well be bloodstains in places where there is no image, in which case it is not surprising that there is no image under them, but there is nothing to suggest that in places where there is both image and bloodstains, the image is not present under the bloodstains..","date":"2013-10-07","mins":"1:27 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-27223","author":"hugh_farey","post":"I don’t think relics of Lanciano have anything to tell us about the shroud. Dr Linoli was so clearly influenced by pre existing his faith in the miracle that his paper cannot be considered wholly unbiased, and the World Health Organisation report has many of the characteristics of a myth (such as its extremes of detail – 500 experiments, time – 15 months, length – 700 pages, and authority – the Chief Advisory Board, as well as the fact that no one on the internet has actually seen it or quoted from it). An English translation of Dr Linoli’s paper is extensively quoted by an (admitted sceptic) Aruman Chan, and largely appears to state that the biological remains are mouldy, dried up, shrivelled, and degraded to the extent that the cells of both flesh and blood lack nuclei. The minerals in the blood are in widely different proportions from modern human blood. But (according to Chan) Dr Linoli uses all this to conclude that this is evidence for miraculous preservation. There has been no attempt to carbon date these relics, and no particular reason to suppose that they date back more than the time needed to shrivel up a piece of meat into its present state. Having done that, I dare say they might remain in that state for a very long time, but there’s no obvious evidence that they have. There are five (solid) globules of blood, which are supposed to be all different sizes but exactly the same masses, according to the Miracle Rosary Mission (at http://www.miraclerosarymission.org/lanciano.html). I do not know if Dr Linoli checked that. But most importantly, even if the remains are from a 1300 year old man, there is nothing about them to suggest that they derived from bread and wine..","date":"2013-03-13","mins":"3:01 pm","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin"},{"id":"comment-46394","author":"hugh_farey","post":"Max is assuming that the shroud is the result of it having enshrouded a dead body, in which it makes a lot of sense that moist contact blood transfer would precede the vaporograph/radiation/whathaveyou distance transfer of the image. Forensically, however, one must not begin with that assumption, and Heller & Adler do not make such as assumption in the paper “A Chemical Investigation of the Shroud of Turin.” Their contention there can be simplified (fairly drastically) as follows: There are three colours of fibre on the shroud, white, yellow and red, corresponding to non image, image, and blood. When these three colours of fibre are tested with protease (to dissolve any animal trace), the white remains unchanged, the yellow remains unchanged, and the red disappears and becomes white. This implies that only the red derives from animals, and that there is no yellow underneath it. So far, so good. However, observing the shroud in close up, one can see that on the whole image fibres are on the top of the middle of each exposed thread, while the most bloodstained fibres are found most heavily down the sides of the same thread. In other words, image fibres and bloodstain fibres do not closely coincide, even on quite heavily bloodstained patches. The reason for this is that the blood has mostly eroded away, leaving the image behind. It seems to me quite probable that, in selecting well blood stained fibres for testing, Heller and Adler unwittingly selected fibres that, although they came from an image bearing part of the shroud, actually bore no image. Look, for example, at the bloodstains over the right eye (on shroudscope, for example). There is the famous epsilon, and further to the side a single dark smudge. Between these two are a couple of rather poorly defined bloodmarks. All of them are characterised by pale diagonal stripes, which represent the tops of the threads running through them. The blood is clearly found mainly in the cracks down the side. Are we to understand that all these threads running right through the bloodstains actually contain no image? I don’t think there is any evidence for that..","date":"2013-10-07","mins":"4:29 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46493","author":"hugh_farey","post":"Goodness me! A wide variety of themes to address while I’ve been off the air. Let’s see… 1) I’m very familiar with Rogers’s FAQ paper. It is deliberately fairly simplistic in tone, and addressed to people who want to understand his conclusions rather than to people who already understand them and don’t necessarily agree. Nearly every question, beginning “How do you know…” would be better begun with “Why do you think…” Many of his own beliefs are presented as fact with little or no corroboration, and several diagrams presented as if what they showed was obvious, when in fact it isn’t. For example the reflectance spectrograph labelled “image”, “blood” and “Fe2 O3” shows a reflectance spectrum for blood that only barely resembles it, and the photo purporting to be a UV image of the sample area shows a bright spot for the Raes area which appears to be a retouching and looks nothing like any of the UV photos of Miller and Pellicori. While I agree with many of Rogers’s ideas, there are many I do not agree with, and none that are wholly uncontentious. 2) There are no Roman flagra in existence for us to copy, and the only two (quite different) examples used to verify the whip marks of the shroud were modelled using those very whip marks. Hardly surprising they match. Remarkably, the only reference to an archaeological find shows a flagrum made entirely, handle, thongs and plumbata, of metal. This find no longer seems to be in existence. There are a few illustrations, on coins and such, but they only go to demonstrate that there was a wide variety of designs. To claim that the shroud matches any of them is mere speculation. The only actual whippings with which one might compare the Shroud are carried out annually in Mexico and the Philippines, and they look nothing like the Shroud. 3) Do I think the Shroud was modelled on the Pray manuscript? No. 4) The Stuttgart Psalter is wonderful and I’m so glad Max mentioned it. It can be found in its entirety at http://digital.wlb stuttgart.de/digitale sammlungen/seitenansicht/?no cache=1&tx dlf%5 Bid%5 D=1517&tx dlf%5 Bpage%5 D=1 and does indeed have a picture of a naked Christ being flogged. It seems to be dated about 825, which is probably early for such a thing. Has it anything to do with the Shroud? Not obviously..","date":"2013-10-08","mins":"1:10 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46407","author":"hugh_farey","post":"No, Max, I make no assumptions at all. I simply want to look at the fibres and see what they indicate. One way of having blood but no image behind the knees is that the image was created first, with a space behind the knees, and the blood added later. That’s what I would do if I was making a shroud myself, with some form of image making technology and a bowl of blood..","date":"2013-10-07","mins":"6:11 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46333","author":"hugh_farey","post":"Boo! Hiss! Enter the pantomime sceptic, twirling his black moustaches! Brothers, it was me. I think the evidence that there is no image under the bloodstains is very weak. It is certainly not apparent just by looking at the shroud, either from a distance or in close up. There do appear to be places where the blood has worn off, and the colour of the shroud in those places is not noticeably paler than adjacent non blood areas, imaged or not. Early examination suggested that the image was formed by corrosion of the upper surfaces of fibres, and that no corrosion was observed under the bloodstains. This might be compelling if it was quantified, and the places where the various corroded/non corroded fibres were taken from was clear, or even if clear comparison photographs were available. I have not seen any such evidence myself. Later, it was suggested that the image was not formed on the fibres of the shroud at all, but on an impurity layer which covered the whole shroud. This rather damages the finding of the corroded/non corroded fibres, which, by the new hypothesis, should not have occurred at all..","date":"2013-10-06","mins":"6:32 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46546","author":"hugh_farey","post":"My remarks were a specific reply to “Can you really paint the mirror image of a flagrum having impacted human flesh on a linen?” It is often said that a) the marks on the shroud fit the design of a Roman flagrum perfectly, and b) no artist could have matched the injuries due to a Roman flagrum. As there is no evidence as to the precise nature of either the instrument which made them or the injuries it inflicted, artists can do more or less what they like. For all anyone knows the marks on the shroud look nothing like genuine flagrum marks, and were dabbed on with a piece of sponge. If we must speculate about either the instrument or the injuries, then it is relevant that the only flagrum ever found, and the only wounds due to flagellation we can examine, bear no relation to the marks on the shroud. Wilson’s flagrum was made specifically to fit the injuries on the shroud, and has no archaeological justification. William Smith’s illustration would not produce the marks, nor would the knucklebones he also mentions. He derives his information about the flagrum found in Herculaneum from Rich’s Dictionary of Greek and Roman Antiquities, where it is illustrated. Of course all these genuine classical descriptions predate the popularity of the shroud – that’s why they didn’t feel any urge to conform to it, unlike most descriptions of flagra since. The scourge marks on the cloth may be (not must be) due to an instrument, but there is no evidence from them that it was anything like a Roman flagrum..","date":"2013-10-08","mins":"6:04 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46556","author":"hugh_farey","post":"I don’t deny that a three thonged two pelleted flagrum is possible. If the shroud is medieval, then its creator certainly thought it likely. There’s just no evidence that the dumb bell marks of themselves prove that they had to be made by a Roman flagrum. I am familiar with de Wesselow’s ideas, and find them very persuasive. Nevertheless, there are contrary arguments, which mean that I can’t altogether agree with him..","date":"2013-10-08","mins":"7:24 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46609","author":"hugh_farey","post":"Dear me. Please don’t think for a moment that I consider the case for the wounds being painted on in any way proved. Or even that I hope it will be proved. However closing one’s eyes to other evidence does not constitute a case for authenticity. The BSTS has nothing to fear from impartiality. Barbet was a wonderful man who made some interesting preliminary observations, nearly all of which have been discredited by equally knowledgeable pathologists with considerably better facilities such as Fred Zugibe. Barbet’s analysis of the scourge marks was based, of course, only on what he saw on the shroud and not on any archaeological evidence, because there isn’t any. A most interesting recent analysis of the marks is at http://www.acheiropoietos.info/proceedings/Faccini Web.pdf, which largely rewrites everything quoted by daveb above..","date":"2013-10-09","mins":"5:57 am","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46711","author":"hugh_farey","post":"That’s fine; each to his own..","date":"2013-10-09","mins":"6:37 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-213415","author":"hugh_farey","post":"I think Russ is quite right. Walter Mc Crone was a skilled microscopist, and his microscopical observations should be taken seriously, even if he is later proved mistaken. If his attributions of the disputed paintings were based on particle analysis, then they mean something, even if the style of the paintings is untypical. I think Joan Altabe misrepresents what Mc Crone deduced about the paintings he was given to study (and incidentally, the gist of this article first appeared in the Sarasota Herald Tribune of 12 Feb 2001, so it must be a slow news week). The reader is directed to the Sarasota Herald Tribune of 24 October 1992, where a more balanced article may be found. They can also try http://www.deringconsultants.com/portfolio/leonardos christ among doctors/ which considers Mc Crone’s findings correct – although the site is the owner’s, so not necessarily balanced. Altabe does not give the title of the disputed Raphael, so it is difficult to research, but a similar dispute also arose about The Three Ages of Man by (perhaps) Giorgione, which is easier to find. Try https://archive.org/stream/stormypetrel199369113ogle/stormypetrel199369113ogle djvu.txt There is no doubt that Walter Mc Crone was his own worst enemy in his field. He was often overconfident and abrasive, and excited strong feelings, both favourable and unfavourable, depending on whether he supported a view or not. None of this should overwhelm his genuine, detailed, accurate, microscopy, which must be taken on its own merits, even if the conclusions one draws from it are not the same as his..","date":"2015-10-23","mins":"7:35 am","url":"https://shroudstory.com/2015/10/23/proof-that-art-experts-are-not-always-right/","cat":"other_blogs","title":"Proof that art experts are not always right"},{"id":"comment-52424","author":"hugh_farey","post":"“They probably are” the bones of St Peter, says Jones, and on the basis of this opinion considers the Vatican duplicitous for not turning his ‘probability’ into a ‘confirmed’ fact. And what is the basis of his “probability”? That the bones belong to an old man? Surely that can’t be considered too unusual. Or is it that the site of successive incarnations of the vicar of Christ carries an inscription that might say: “Peter is here.” Personally, I side with the Vatican..","date":"2013-11-22","mins":"3:05 pm","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","title":"Quote for Today"},{"id":"comment-193351","author":"hugh_farey","post":"That’s an interesting analysis and food for thought. It’s not impossible that Jesus carried a complete cross, but I do not find OK’s analysis particularly convincing. It may be true that the execution equipment was not left on site – and Glori’s suggestions seem quite sensible in that respect – but that does not mean that the condemned criminal carried a completely constructed cross. There are a couple of reasons for this. Firstly I have myself carried such a cross a number of times, the distance (about 700m) between the Catholic and Anglican churches on my parish as part of the Good Friday ‘Walk of Witness’ and I think I can say with some authority that the crosspiece is always in front of the body and never makes contact with the back at all. OK’s diagram which seems to show the whole cross strapped to the back is wholly unrealistic. What’s more, given its length, the cross presses on the top of the shoulders and does not abrade the shoulderblades. Secondly, my cross consisted of two pieces of wood of equal cross section joined by a cross halved joint. If this is not done, then the cross piece would either be simply nailed directly across the upright, or have a mortice cut out for a tenon in the upright to fit in. In the first case it would be very difficult to stand the completed cross up with a body hanging on it (the Good Thief’s beam looks like this), and in the second the crossbeam would have to be much thicker than suggested (maybe 15cm or so) to accommodate both the tenon. Also I would certainly not assume the upright had a circular cross section; the crossbeam would be impossible to attach securely. As to weight, my cross was made of 6″ x 4″ (15cm x 10cm) pine and weighed about 50kg. However, I only carried it; I don’t know how stable such a narrow cross would be to hang a victim on..","date":"2015-03-14","mins":"9:59 am","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-1016","author":"hugh_farey","post":"Adrie, thank you so much for all your links, and the links within links they contain. Much of the information, although well advertised in general, I had not seen in detail before, and it makes very interesting reading. And some, especially your work, is completely new to me. Anyway, back to the custard… 1) Smearing a bas relief in ammonia caramel and covering it with a sheet, or pressing it onto a sheet lying on a cushion of material produces less dimensionality than a scorch. The half tone effect is very clear, with more or fewer coloured fibres per thread giving a lighter or darker image, and some fibres carry the image through to the other side of the sheet, but the 3 D effect is so muddled by variations in pressure and ‘ink’ density at any particular place that the overall result is very un shroudlike. 2) Soaking material in cornflour starch, rinsing and allowing it to dry, then pressing a hot template into it does not make a noticeable difference in colour from using untreated linen. Pressing sellotape hard over scorched material and peeling it off does not noticeably diminish the image, and I find no trace of removeable coating on the sellotape (although there is a fair amount of particulate matter). When you press sellotape over cloth and pull it off, the contact area remains in the sellotape as a regular pattern of deformed patches in the glue, basically a mould of the cloth. It was presumably on the inside of this mould that Rogers observed his discolouration layer, but I wonder how he knew that the fibre from which it came was now clear and colourless. Do you know if there are any photos of any of the slides of sellotape at, say, 25 X magnification? We often see immense closeups, but apart from one of some of Reis’s samples at about life size, that seems to be it. As my own work is mostly done at between 25 X and 200 X, it would be interesting to compare them..","date":"2012-10-26","mins":"2:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/25/refining-a-model-childrens-invisible-writing-trick-with-lemon-juice-allows-thermal-imprinting-scorching-at-a-much-reduced-temperature/","cat":"medieval_forgery","title":"Refining a model: children’s ‘invisible ink’ trick with lemon juice allows thermal imprinting  (“scorching”) at a much reduced temperature"},{"id":"comment-1009","author":"hugh_farey","post":"Of lemon juice, custard and gravy… Follow me closely… Starting with the idea of sensitising the linen with lemon juice, I thought I’d try my soapy custard mixture as well (spatula of icing sugar, spatula of cornflour, a few scrapings off a bar of soap in a cup of water), and, for good measure, potassium hydroxide, and also ordinary salt (hoping the chloride might reduce the fluorescence). With these four specimens soaked for ten minutes, lightly rinsed and dried, I heated individual spatulas (so they all started the same temperature) in a flame for a measured 10 seconds, and then applied them for 5 seconds to my cloths. The custard cloth scorched about as well as untreated linen, the others more so, especially the potassium hydroxide one. All of them fluoresced. All showed more marked scorching of the upper fibres of each thread, and all transmitted some discolouration on the reverse of the cloth. So far so good. However, thinking about a purely surface layer of degraded carbohydrate led me to a bottle of gravy browning, with ingredients: Water, Ammonia Caramel, Salt, Citric Acid, Xanthan Gum and Potassium Sorbate, all good healthy ingredients that shouldn’t upset anybody’s spectrographic analysis. It’s a thickish goo, so I dipped one finger in, wiped it on a finger of the other hand, and dabbed a sample of linen. Brilliant. Discolouration only of individual fibres, darker in the middle where pressure is greatest and more fibres were touched, lighter at the edges where only a few fibres received a slight grazing. Some individual fibres conducted the colour along their length and round to the back of the cloth. This result led me to re thinking painting. Leaving aside the stylistic arguments, everybody seems to be agreed that no artist could have painted the cloth, as the medium would have soaked through, the paint particles would be conspicuous and it would have been impossible for him to paint individual fibres, leaving others completely untouched. This is not necessarily true. Get a felt tipped pen and scribble lightly on some cloth, or a finger wiped with goo and dab on it, and look (under a 25 X microscope) at what turns up. For a start individual fibres take the colour, and some are not touched, for a second the medium doesn’t soak from fibre to fibre, but along fibres (which is how the colour turns up on the other side), and even under 400 X, the particles responsible for the colour cannot be seen (I think I did see salt crystals). A finger, of course, is not a good way of testing the “photographic negative” or the “3d information” aspects of the image, but watch this space… I’m not keen on gas diffusion, and am more convinced by physical contact. However there do seem to be at least two aspects to the image which must be derived from it, the direct, upper surface degradation and the indirect, whole fibre degradation (much paler). Scorches of various kinds, sufficiently controlled, seem to be able to provide this, but if we postulate some sort of chemical carbohydrate based pre treatment of the linen, a layer which degrades when the image is formed, why not also image a layer, transferred by contact, which has already degraded (basically caramel)? Although I’m still doubtful about any of these coatings, it would be interesting to find out if the non image fibres had the same sort of coating that Rogers thinks is present on the image, but in an un degraded form..","date":"2012-10-25","mins":"4:58 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/25/refining-a-model-childrens-invisible-writing-trick-with-lemon-juice-allows-thermal-imprinting-scorching-at-a-much-reduced-temperature/","cat":"medieval_forgery","title":"Refining a model: children’s ‘invisible ink’ trick with lemon juice allows thermal imprinting  (“scorching”) at a much reduced temperature"},{"id":"comment-1006","author":"hugh_farey","post":"Hey Ho, I’m off to buy a lemon. Easier than chopping my fingers off anyway. And, possibly related, here’s another query. Did anybody take a tape rubbing of the edges of the big diamond shaped water marks? What are they made of? Presumably something washed outwards to the edge of the evaporation rim, but what? Not image, presumably. Dirt? Concentrated lemon juice? Any ideas, anybody?.","date":"2012-10-25","mins":"10:45 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/25/refining-a-model-childrens-invisible-writing-trick-with-lemon-juice-allows-thermal-imprinting-scorching-at-a-much-reduced-temperature/","cat":"medieval_forgery","title":"Refining a model: children’s ‘invisible ink’ trick with lemon juice allows thermal imprinting  (“scorching”) at a much reduced temperature"},{"id":"comment-174932","author":"hugh_farey","post":"Louis’ paper, and the Fanti exposition which follows it, is admirable. There is much to quibble at, but in general I think Giulio has expressed his case clearly. As he admits, however, it will hold no water until he can suggest how a body wrapped in a cloth can produce the kind of discharge implied. He agrees that earthquakes and radon are unlikely to be the cause, and stops short of “therefore it must be a miracle” for which I applaud him, although he needs now to demonstrate that ball lightning (his favoured explanation) can have the appropriate effect. The other paper, however “The Physics of Resurrection” is gibberish. The risen body of Jesus certainly does not conforms to the physical laws of ‘something’ traveling beyond the speed of light. The risen body of Jesus was not infinitely massive, for a start (or consider the effect on the gravity of the earth!). Nor does the vague “very intense burst of energy” even begin to describe the energy required to accelerate a 60kg mass from rest to the speed of light, which would have annihilated most of Israel, let alone Jerusalem. And what was that nonsense about “just such images were burned onto walls by atomic bombs at Hiroshima and Nagasaki? No images were burned onto walls. Those shapes are demonstrably shadows, and show places where radiation did not reach the walls, not places where it did. The author is making the trival error of assuming that because a Fire Engine and my pencil are both red, my pencil is obviously a Fire Engine. (Reviewing what I wrote when Dan first referenced this article, I see I was much milder in my comments, merely referring to it as non sense. Well, I’ve changed my mind; it’s gibberish.).","date":"2014-12-06","mins":"10:05 am","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","title":"Revisiting Shroud of Turin and physics of resurrection"},{"id":"comment-153739","author":"hugh_farey","post":"“To say that something can be forged is not evidence that it was forged. It’s merely speculation.” Quite so, but the inverse is equally true: “To say that something can be produced naturally is not evidence that it was produced naturally. It’s merely speculation.” Actually, of course, any convincing explanation of the image, natural or manufactured, would help sway the ‘general consensus’ one way or the other. We just don’t have one yet..","date":"2014-09-22","mins":"3:53 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"id":"comment-153699","author":"hugh_farey","post":"Having nothing better to do one afternoon, I upended an electric hotplate (hot enough to melt lead but not zinc) and suspended in front of it a sheet of linen at a distance of about 1cm. By arranging the hotplate on its side I hoped to avoid any degradation effect due to convection. It was apparent after several hours that no visible degradation had occurred. To that extent, I find that Colin’s statement: “If there’s the slightest air gap, then there’s essentially no scorching,” is correct. Has anoxie found something different?.","date":"2014-09-22","mins":"2:23 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"id":"comment-153696","author":"hugh_farey","post":"I was quite surprised, on looking up “chemical scorch” on Google, to find fewer than a thousand references. It’s an expression I use quite often. I suppose that if we start with the results of a thermal decomposition of a cloth, defining them as a ‘scorch,’ then the results of any other process which produces exactly the same result could also be termed scorches, whether they be by sulphuric acid (chemical scorch), laser beams (radiation scorch), or a process wholly outside science (miracle scorch). The point would be that it would be impossible to tell, just by looking at the chemical changes to the cloth, which of these processes had resulted in the scorch. We must then look at the physical aspects of the ‘scorch’ to attempt to understand it. It appears only on the outer crowns of the threads, it appears to be of all or nothing intensity, and it appears to be only a few nanometres thick. There are good reasons for supposing that both vapour and radiation would discolour more than just the outer crowns of the threads (although the threshold intensity stochastic theory attempts to get round this) and some evidence to suggest that any thermal treatment sufficient to discolour the outer surfaces of the linen fibres would also darken the surface of the lumen as well. I’m increasingly pondering on sulphuric acid myself….","date":"2014-09-22","mins":"2:17 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"id":"comment-200665","author":"hugh_farey","post":"Dorothy Crispino has researched a number of documents regarding Charny / Lirey affairs before 1390 or so, but none of them mention the Shroud. If it was the reason for all the correspondence, it is curious that it is not mentioned. Even in his memorandum, Bishop d’Arcis says nothing of Geoffrey I de Charny having been connected with it all, claiming that the Dean of the church was the man who had procured it. Surely de Charny knew about it, so why didn’t d’Arcis mention him? The family only come in for their share of criticism for allowing the second series of expositions to which d’Arcis took exception, and even then, he grudgingly admits that they themselves do not claim the Shroud is anything more than a representation. The two versions of the pilgrim medallion, with the switched positions of their shields, certainly suggest a dynastic change such as the death of the first de Charny, so that dating the earlier to 1355 or before seems justified, and the very presence of the shields suggests a Charny imprimatur. It does not necessarily mean that he found, was given or inherited the Shroud himself. Geoffrey II, of whom d’Arcis is critical, seems to disappear from Shroud connections very soon after d’Arcis’ complaint. The effigy of him in the Wikipedia article about his father seems to stem from Ian Wilson’s discovery of it in “Monuments français inédits pour servir à l’histoire des arts” (http://gallica.bnf.fr/ark:/12148/bpt6k1087131/f4.image), Plate 125, captioned: “Tombe de messire Geoffroy de Charny, mort l’an 1398. (ancienne abbaye de Froidmont, près Beauvais).” However, Froidmont is nowhere near Troyes, Lirey or Savoie, and, in spite of Wilson’s identification, there is no way the shields dotted about his body can be interpreted as “Gules three escutcheons argent”, the arms attributed by Froissart to Geoffroi I de Charny. In short, I don’t think this Charny is closely related at all. Dorothy Crispino (https://www.shroud.com/pdfs/ssi18part6.pdf) notes that there is a town – and associated family – called Charny in Yonne, near Thory, but decides “There was no relationship between these and the Charny of the Côte d’Or, from which Geoffroy took his cognomen.”.","date":"2015-05-31","mins":"6:28 am","url":"https://shroudstory.com/2015/05/31/screwy-1-crazy-2-ludicrously-odd-or-inappropriate/","cat":"other_blogs","title":"screw·y  1. crazy. 2. ludicrously odd, or inappropriate."},{"id":"comment-201015","author":"hugh_farey","post":"As I replied in another post, I have tried. I find your website very difficult to follow. If you have any evidence for any of your claims, why not post it here?.","date":"2015-06-03","mins":"5:11 pm","url":"https://shroudstory.com/2015/05/31/screwy-1-crazy-2-ludicrously-odd-or-inappropriate/","cat":"other_blogs","title":"screw·y  1. crazy. 2. ludicrously odd, or inappropriate."},{"id":"comment-1975","author":"hugh_farey","post":"Well I agree, of course. However, there are those who claim that the “water stain” on the chest is reflected in the way the lower curvature of the ribs is drawn, as if every mark on the shroud has a representation on the picture, with the corollary that every distinctive feature of the picture (big eyes, forked beard, caved in abdomen) is derived from marks on the shroud. Thus the absence of prominent pecs on the shroud, compared to their prominence on the pictures, gives me pause for thought. Strange that one would want to “flesh out” the chest, while leaving the abdomen so scrawny?.","date":"2013-03-06","mins":"1:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…"},{"id":"comment-2014","author":"hugh_farey","post":"There’s also a chicken and egg question to be raised. If many these epitaphioses (epitaphioi?) were known to a medieval forger, then presumably he might have liked to copy their figures onto his sheet, selecting the bits he thought most realistic. The pre 1300 iconography of the shroud might have led to the shroud being the way it is, not the other way round. That does leave us with the interesting question of where the previous shroud pictures acquired their ‘standard form.’ The face, perhaps, from the statue of Zeus, the blood from the accounts in the bible, but the very long cloth (end to end as opposed to side by side), the double image and the hands crossed at the groin presumably started somewhere..","date":"2013-03-16","mins":"10:30 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…"},{"id":"comment-1966","author":"hugh_farey","post":"Something that’s been growing on me. Google “epitaphios” and you get dozens of pictures all looking in one way or another a bit like the image on the shroud. However, among the most prominent markings is invariably a deep line defining the bottom edge of the pectoral muscles. There are lots of other markings which may or may not be related to markings on the shroud, but the pectoral muscles are almost always very well defined on these images, and not at all on the shroud as we have it today. As we are frequently told that every tiny blemish on the shroud is faithfully reflected in all these early paintings, it seems to me odd that one of their most prominent features isn’t, in fact, there at all. Were they copying from a different shroud, one asks oneself….","date":"2013-03-05","mins":"11:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…"},{"id":"comment-2021","author":"hugh_farey","post":"I think if I were compelled to appear as an ‘expert witness’ against authenticity i would say something like this. 1) Early descriptions and paintings of Jesus were fairly inconsistent but were generally beardless. 2) Round about 350 AD some particular images gained popularity and authority, and were justified by being referred to acheiropoieta. Although there were fewer of these, they still lacked consistency. Some being bearded and some not. 3) Round about 450 AD the Statue of Zeus at Olympia was moved to Constantinople. 4) After its destruction in 475 AD, images of Jesus increasingly began to resemble it, in spite of at least one bishop claiming it was heresy to make Jesus resemble Zeus. 5) Nevertheless, the Byzantine influence won, and beardless acheiropoieta went out of fashion. 6) Several hundred years later, a ‘resurrection event’ was staged in Constantinople, consisting of a long cloth that emerged vertically from a mock up tomb. The cloth was painted to resemble an image left on a shroud, following the conventions of the Passion Story, that Jesus was Flogged, Crowned, Stripped, Crucified, Speared and Entombed. All these elements were included, with the hands modestly covering the image’s nakedness. The face, of course, resembled the Zeus face that had already become standard. 7) This new, full length, image became so famous that it too became a standard form, and was immediately copied by Hungarians and whoever, sometimes adapting the image to suit local conditions. 8) Either this image, or the nearest that could be found to a replica, became the Shroud of Turin. I don’t think this account is necessarily true, but it would act as a counterbalance to the Agbar Edessa Mandylion Shroud account, and I think I could make it difficult for a balanced jury to decide on their verdict, even if they did come down on one side or the other in the end!.","date":"2013-03-17","mins":"10:46 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…"},{"id":"comment-172927","author":"hugh_farey","post":"John is often thought of as the “beloved disciple”. Is that relevant?.","date":"2014-11-25","mins":"7:52 am","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus"},{"id":"comment-29195","author":"hugh_farey","post":"Possibly. Adrie’s done a good job on this. Google “The Seam and Missing Corners of the Turin Shroud” for his latest version.The trouble with clothes, tablecloths and other material is that we have to be quite selective biblically. Mark specifically says Joseph of Arimathea “bought a shroud” for instance..","date":"2013-04-03","mins":"5:22 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-29271","author":"hugh_farey","post":"Not a chance. There’s a good old ding dong about it here at https://shroudstory.com/2010/03/02/new shroud of turin book by john n lupia/, which only just ends shorts of fisticuffs. Sadly, a publication “destined to be one of the most exciting books you will ever have read in Shroud literature” has already vanished into the ether and is no longer obtainable, but I think the Regina Caeli blurb probably tells you all you need about it. The only real point of interest is that Lupin, Adrie and one or two others do address the question of why a burial shroud should be long and thin rather than squarish..","date":"2013-04-04","mins":"4:43 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-29110","author":"hugh_farey","post":"Oh, pur lease! Hear at Shroudstory we (even I, who only snuck in a little while ago) have gone a long way beyond the “if it’s not a fake, it must be real,” and “if you can’t do it your way, it must have been done my way” syllogisms typified by Fr Longenecker’s questions. Still, here we go. 1. If it’s a fake why hasn’t anyone–even with modern technology–been able to reproduce it? — This question is identical to “If it’s real why hasn’t anyone–even with modern technology–been able to reproduce it?” Ignorance is not dispelled by an appeal to the supernatural. 2. How did the forger not only know about photography in the Middle Ages, but manage to produce what is, in effect, a photographic negative? — The photographic negative effect would be an inevitable consequence of any kind of image formation, 1st, 13th or any other century, which depended on a chemical, radiation, or plain painting technique in which parts of a body closer to a supposed surface were rendered darker than those further away. 3. The image is not painted, but “singed” or burnt on to the fabric. How did they do that? — “They” or possibly “God” did it by degrading the linen fibres. I don’t know how, but Ignorance is not dispelled by an appeal to the supernatural. 4. The “burned” image doesn’t penetrate more than the surface level of the cloth. Paint would soak in wouldn’t it? — Not if it was very thick, or powdered on, or if the image is not a painting but formed by degradation of an existing substrate. (Incidentally, if you assert in Question 3 that the image is not painted, why do you raise the irrelevance of what would happen if it was?) 5. When paintings are put into a 3 D replicator they don’t produce successful 3 D images. This does. How did the forger do that? — Any painting or photograph taken full face, with front lighting and a dark background, reproduces the 3 D effect as least as well as the shroud, and sometimes better. 6. They found pollen and traces of soil from the area of Jerusalem. Did a medieval forger in Europe think of that and travel out there to get samples? — Even if your overconfident assertion is true, a forger might have had access to a cloth stolen during the crusades from Jerusalem, Constantinople and all points between, or the pollen could have arrived subsequently from reverent pilgrims pressing their own relics against the shroud. 7. Are carbon 14 dating tests ever wrong? We’re assuming someone in the Middle Ages was a fraud. What if the modern scientists cheated? Its possible isn’t it? — Carbon 14 dating tests are always wrong, and have to be carefully calibrated to produce results which conform to other factors relevant to the date of an artifact. Yes, it’s possible that modern scientists cheated; even in the 13th century the world was full of clever people trying to fool others in one way or another. 8. The man in the shroud was nailed through the wrists. Medieval artists showed Christ’s nails through his hands. How did the medieval forger know that the Romans nailed through the wrist and not the hand as people thought back in the Middle Ages? — No Roman skeleton, image or literature has ever been found that shows clearly where nails were targeted, and, although some pathologists (notably Barbet) demonstrated that nails through the palms would tear out, others (notably Zugibe) disagreed. If the victim were sitting or standing on some kind of rest the anatomical relevance disappears. Still others think the nails may have gone in through the palm of the hand and come out through the wrist. Although mediaeval painters were not necessarily anatomists, there are several examples which do show wrist wounds. 9. The forger even got the details of the wounds correct because the flagellation wounds correspond not only to Roman flagella, but to the direction from which the two men would have whipped the victim according to Roman torture techniques. How did the forger know that? — Whips through the ages don’t seem to have changed much, and it does not take much imagination to guess that there might have been two scourgers, in which case one on either side is a rather obvious configuration. Specific details of “Roman torture techniques,” although much guessed at, are not archaeologically or paleographically verifiable. 10. The pigtail at the back? It links up with the hair style of Jewish men who had taken the “Nazarite vow” in the time of Christ. This was some fantastic forger no? — The details of the Nazirite lifestyle are in the Bible. Apart from not cutting his hair, the Nazirite took a vow of abstaining from anything derived from grapes, including juice, wine, vinegar, raisins and the grapes themselves. It is fairly obvious that Jesus was not a Nazirite. Whether long hair was normal among non Nazirites is often discussed, as St Paul seems to dislike it. I believe the idea that Jesus may have been a Nazirite started because of the lack of archaeological evidence for anywhere called Nazareth, although recently I think even this has been modified somewhat. Whether there is any semantic connection between the words Nazirite and Nazareth (and Nazarene, for that matter) is also discussed, but I think has been largely rejected..","date":"2013-04-02","mins":"6:34 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-29245","author":"hugh_farey","post":"As usual daveb adds the voice of impeccable reason to my histrionics. I think my overall point remains valid though. So many people begin with “If it’s a fake why hasn’t anyone reproduced it?” as if that was per se an argument for authenticity. The fact that it hasn’t been explained, whether its a fake or not, is not an argument for anything, unless one has recourse to the supernatural (and therefore by definition inexplicable naturally). There are plenty of good reasons for opting for authenticity, but not being able to explain how the image arose is not one of them. I agree that the concept of the negative image was probably beyond people in the 13th century, although some paintings age to produce an interesting solarised effect with which some people might have been familiar. But that’s not the point. If someone aimed at a “the closer the darker” effect, which is an easy concept to imagine, then a negative effect would be an inevitable consequence, whether the image maker knew about it or not. The powder thing. Wasn’t that Joe Nicholls’s idea? I don’t think it’s new. Again, my point is that the answer to the bald question “paint would soak in, wouldn’t it?” argument (expecting the answer yes) is actually, no. The 3 D effect (response to anoxie too). I’ll email Dan some screen grabs from Image J. They’re not brilliant – but then neither is the shroud, and they certainly show the effect. The sheet pre sown with pollen and powder. Again, the forger didn’t have to know anything about it; if he used a sheet ransacked from the crusades, the pollen and powder might be there already. Actually, if Frie and friends are correct about the pollen coming from several very specific places around the middle east then that would be a very lucky choice of sheet indeed but then, as I say, pilgrims pressing their souvenirs against the shroud could also be a source. I don’t subscribe to the “dishonest 20th century scientists” hypothesis. I simply agree that it’s possible. Like the “dishonest 13th century forger” hypothesis. The nails. Well I surrender completely here. The two examples I was thinking of (one in a Tres Riches Heures) and another in Assisi) turn out to be 14th century and conceivably based on the shroud. Both have no thumbs, and only three fingers on one hand! Well, it’s been an interesting search. Are you familiar with artbible.net? Hundreds of artworks on the life of Christ, and bless my soul, not a whip thong in sight until 1280. Not necessarily based on the shroud, but it’s certainly interesting that up until that time pictures usually show bundles of sticks rather than whips. And finally the Nazirite. Fr Longenecke thinks depicting long hair is a sure sign of authenticity, but it’s not, as you so ably demonstrate..","date":"2013-04-03","mins":"3:58 pm","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-29112","author":"hugh_farey","post":"I’ve never bothered to correct a typo before, but this one is just too embarrassing to let stand! “HERE at Shroudstory…” !!.","date":"2013-04-02","mins":"6:41 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-33499","author":"hugh_farey","post":"I asked earlier: “Is a lepton heavy enough to keep an eyelid closed?”.","date":"2013-05-11","mins":"9:31 am","url":"https://shroudstory.com/2013/05/11/the-forger-and-the-coins-one-in-a-gazillion-with-13-zeroes/","cat":"other_blogs","title":"The Forger and the Coins:  One in a Gazillion with 13 Zeroes"},{"id":"comment-149577","author":"hugh_farey","post":"Another thought that has occurred, which should be borne in mind if anybody is trying to pin the dimensions down to finer than a couple of centimetres either way, is that all the edges of the Shroud are turned over and hemmed (making the original width/length a couple of centimetres longer), and of course there is the side strip seam, whether or not the strip is separate or only folded over, adding even more to the width. Then there’s Flury Lemberg’s bizarre suggestion that an unspecidfied width of cloth may have been extracted from the insde of the entire length, and the outer pieces sewn back together in order to preserve the selvedges on both sides. That would knock the whole proportion completely out of kilter..","date":"2014-09-09","mins":"2:35 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149619","author":"hugh_farey","post":"So the shorter the actual width (being turned and hemmed), the longer the measurement (being stretched). It simply shows how over precision should be carefully avoided..","date":"2014-09-09","mins":"6:14 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149620","author":"hugh_farey","post":"Oh, indeed, looms could be much larger and also presumably smaller. They were often about 44 inches, which is still a common width of bolts of cloth now. Perhaps they were sometimes assembled to some kind of industry standard, even in 1st Century Judaea. However to claim proof that the Shroud is two industry standard Assyrian cubits wide, and could not be anything else, is absurd..","date":"2014-09-09","mins":"6:18 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149629","author":"hugh_farey","post":"Re read the previous two comments (mine and yours). It is not absurd to suppose that the Shroud could have been made on a loom, or cut to a width, of a standard size. It is not absurd to speculate that that width may have been this or that particular cubit, Assyrian, Roman, Egyptian, Temple or whatever. What is absurd is to claim any kind of ‘proof of authenticity’ based on these speculations. Unless your, and Stephen’s, concept of ‘proof’ is very different from mine….","date":"2014-09-09","mins":"7:41 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149720","author":"hugh_farey","post":"1) The width of the Shroud is between 110 and 114 cm, most accurately towards the longer measurement. 2) Half this figure is between 55 and 57 cm. 3) Flinders Petrie determined the Assyrian cubit to be 54.86cm. 4) The Shroud, even ignoring the overlapping side seam, is wider than two Assyrian cubits. Including the overlap, it is unrealistically so. 5) The measurements of the Assyrian cubit are based on buildings from hundreds of years BC. 6) The cubit used for the construction of Herod’s Jewish temple (by archaeological reconstruction) was 52.5 cm. 7) There is no evidence whatever of any standard cubit in use in 1st century Jewish textile manufacture, or any other commodity. 8) Various other cubits, and various widths of cloth, are found around the world from the earliest times until today. If any of these statements is wrong, I would be most happy to be corrected. To claim that this is, without reference to any other evidence, in itself a proof that the Shroud is of 1st century manufacture, is absurd. This is what Stephen Jones claims. His claim is absurd. …links in chains of corroborative evidence… Well, that’s a different matter altogether…..","date":"2014-09-09","mins":"4:22 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149813","author":"hugh_farey","post":"It’s a good question, I agree. My own guess is that for at least most of its length the side strip seam is merely a tuck along the length of the cloth, possibly for strengthening. I know that Raes’s little bit fell apart into two pieces, but the absolute integrity of the continuity of most of the weft threads looks too good for the rematching of two pieces of cloth to me. As for Flury Lemberg’s idea, I can’t get any practical sense out of it. Why start with the wrong width? Cloth was made in all sorts of widths, and there was no need for a Shroud to have an exact width anyway. Did Joesph of Arimathea decide his cloth was too wide and hurriedly cut it up and resew, just to get the selvedges right? Or did cloth merchants regularly buy cloth of a single width and cut it to size? If they did, why cut a strip out of the middle and end up with four cut edges, two of which would have to be sewn together (to make the shroud) and the other two (of the detached strip) hemmed. Or did they throw the middle strip away? Surely not. Why not simply cut it to the correct width and hem the two cut edges, giving you two strips of cloth? I would have to be taken through the logic of Flury Lemberg’s suggestion before I thought it less bizarre, I’m afraid..","date":"2014-09-10","mins":"2:52 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149815","author":"hugh_farey","post":"Just now, taking measurements from Shroud Scope, it occurred to me that Wilson’s idea might be inversely correct (!). Instead of the side strip being added to increase the width and centralise the image, it could have been that the tuck was added to decrease the width and centralise the image. I don’t know what width of cloth is hidden, folded over, in the seam, but it could be as much as 5cm..","date":"2014-09-10","mins":"3:02 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149882","author":"hugh_farey","post":"The ‘Bartaveng’ paper is interesting too. If the original centre line crease really exists, and if it does define the original width of the shroud as 117cm, and if the width of the shroud really is 114cm (and do note the if..if..if..) then it would be almost impossible to cut a strip out of it, and resew the edges together. The idea that the seam is no more than a tuck would be much more sensible..","date":"2014-09-10","mins":"8:56 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149949","author":"hugh_farey","post":"Hi, Nabber: i’m not sure I understand your metaphor. If there is something wrong wth my evidence, please point it out. My conclusions, of course, you are free to disagree with..","date":"2014-09-10","mins":"1:40 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149490","author":"hugh_farey","post":"I don’t think anybody disputes that the Shroud is roughly four times as long as it is wide, and that that proportion is probably not accidental. Beyond that, I think it is dangerous to be too prescriptive. Looms all over the world are often just over a metre wide and always have been, that being a convenient distance to throw a shuttle from one side to the other. Being under a certain amount of tension while being woven, cloth tends to shrink from its loom size, but can of course, easily be stretched. A glance at the Shroud shows that it now has quite deeply embowed ends, so where its precise ‘length’ is measured ought to be stated. The long period when the Shroud was stored rolled up resulted in its being quite badly creased (and so shortened), and it has now been stretched out again. Jones does not seem to have noticed more recent estimates of its length. Between 435 and 443 cm seems a fair estimate of its length, give or take a couple of centimetres, and 110 to 114 cm for its width. Stephen Jones’s usual dogmatism must, as usual, be treated with caution. The thickness was measured with a micrometre by John Jackson and Ray Rogers in three places, giving between 323 and 367 micrometres, which Jones refers to accurately, but the weight (“about 2.45 kg”) is much more speculative. As it has never been weighed, estimates have been based on the known areal density of other linen cloths, or calculated by Morris, Schwalbe and London using some questionable assumptions from the Compton scatter of their X Ray experiments, or extrapolated from the weight of tiny fragments given to Raes or the radiocarbon laboratories. Something between 20 and 30mg/cm2 seems roughly right, or a maximum of about 1.5 kg for the Shroud. Jones’s 2.45 kg comes from Iannone, but I have no access to his book – does anyone know where he gets his figure from? With all this uncertainty, it may be thought that any attempt to equate the Shroud’s measurements to any supposed antique ‘standard’ such as the Assyrian cubit is futile, but on this site we never let a little thing like that prevent exhaustive inquiry. This cubit business was well explored in “The Shroud is 8 x 2 Assyrian Whatchamacallits” (November 18, 2013). Briefly, there is no evidence of an international standard cubit in use in the 1st century Jerusalem market place, and only wishful thinking to suggest there might have been. Measurements by various eminent archaeologists of various buildings, divided by appropriate numbers that seem likely, have given a range of possible cubits in use at different places and times, and a very few actual rulers have been found, and sure enough, some of the cubits have been found to be about half the width of the Shroud. However, Jones’s conclusion: “So even the dimensions of the Shroud of Turin are among the many proofs beyond reasonable doubt that it is authentic,” is wholly unjustified. Finally, the whole doubled in four thing is such peculiar special pleading as hardly to merit comment. I think it may just be etymologically possible to use tetradiplon as a description for a cloth folded to leave only the face (one eighth) exposed, but the bizarre attempt to achieve it by zig zag folding the rest of the cloth behind the face in the manner illustrated is unconvincing..","date":"2014-09-08","mins":"4:10 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-150135","author":"hugh_farey","post":"Looking at the seam on Shroud 2.0, and going along for a moment with my tuck hypothesis. It does not look like, and I think Flury Lemberg has said this too, a simple z fold. Take a pinch of material, fold it over against itself, and then lay it flat, and you have four layers of cloth to stitch down to the base. If you pinched together the edges of two pieces of cloth and folded them over and then flat you would also have something very similar..","date":"2014-09-11","mins":"5:11 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-150386","author":"hugh_farey","post":"I’m not sure I would dignify my tuck suggestion as a theory just yet, it’s just that the idea of cutting a thin sliver out of a cloth just to centre the image seems so impractical. Why not just fold over the edge and hem it? Would it look less elegant than having the seam? Not to my mind. The relic would not lose it’s integrity and the selvedges would be preserved. I speculated that the seam had four layers of cloth folded down onto the visible surface; Wilson’s diagram shows three layers, perhaps 2cm. If (remember all those ‘ifs’) the original width was 117cm and the new width is 114cm, then a sliver only 1cm wide was removed. Even if the new width is 111cm, then the sliver would only be 4cm wide. This seems to me wholly impractical. On the other hand chopping out a much wider length from a much wider original also seems bizarre (as I have discussed above), and the various reasons suggested for simply cutting the cloth in two and rejoining it again also lack real substance. It’s a real poser. What fun..","date":"2014-09-12","mins":"2:54 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-150446","author":"hugh_farey","post":"Three layers of “not included in the width mesurement” fabric, above a layer of “included in the width meaurement” fabric..","date":"2014-09-12","mins":"8:01 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-150445","author":"hugh_farey","post":"Sorry not to make myself clearer. Suppose I wanted to make a cloth thinner by cutting out a strip. I would subtract the required width from the original width, but in actual cutting I would need to take into account the amount needed for the re attachment seam. My figure of 114cm was a rounding up of Gian’s 113.7cm, and my figure of 117cm a rounding down of Barta’s 117.2. The exact difference is 3.5cm. If three layers of seam were envisaged, then a minimum of 1.5 cm should be deducted from the width of the extracted sliver, leaving 2cm to be removed. This seems unresonable to me. If the difference was 6.2cm, then leaving 1.5cm for the seam gives a cut strip width of 4.7 cm. This does not seem to me much more resonable. If you actually cut off a strip 6.2 cm, and then used 1.5 cm of the remaining pieces for the re join, the result would be a narrowing of 7.7 cm. You’re right about Wilson’s diagram. It is about joining two pieces together, but all I wanted to illustrate was that any of the tucking or cutting procedures uses up an appreciable width of cloth in the process..","date":"2014-09-12","mins":"8:00 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149507","author":"hugh_farey","post":"Thanks, Gian Marco, that fits in well with my own calculations. Have you any idea where John Iannone got his value from?.","date":"2014-09-08","mins":"5:34 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-55647","author":"hugh_farey","post":"Is it fortuitous that this post follows directly after the Wikipedia one, and its comment by Jeffrey Liss on the importance of primary sources? Stephen Jones blogs are always well laid out and admirably clear, and his references full, but I could quite understand Wikipedia rejecting them wholesale. I know I will be accused of nit picking as usual (because I am), but unless one is only attempting to preach to the converted, these things must be looked at. Taking the first few references as an illustration of the whole: “The man on the Shroud was crucified as the New Testament records that Jesus was[1].” Surely the reference should be to the New Testament, but no, it is to Stevenson & Habermas’s book concluding what Jones is setting out to demonstrate. “The first century BC Roman orator Cicero called crucifixion “the most cruel and atrocious of punishments” and the first century Jewish historian Josephus, described it as “the most pitiable of deaths”[2]. Cicero. In Verrem. 2.5.169. Josephus. De Bello Judaico. 7.203. Not, as Jones has it, Wilson & Schwortz. So far, perhaps, so trivial, but it lulls you into a false sense of security… “Historical sources indicate that it was not the full cross that was carried, as depicted in Christian art, but rather the crossbeam only, called in Latin the patibulum[6].” This reference is to Fr Wuenschel’s book, “Self Portrait of Christ: The Holy Shroud of Turin.” Fr Wuenschel’s “historical source” is the work of Giulio Ricci, whose suggestion was made on the basis of what he observed on the shroud of Turin! In other words there are no historical sources regarding the carrying of the patibulum at all. What’s more, C.M. Glori, at http://www.acheiropoietos.info/proceedings/Glori Web.pdf, rather elegantly demonstrates that the alleged bruise marks on the shoulder blades of the shroud could not have been made by carrying the patibulum after all. They could, perhaps, have been made by dragging a heavy beam along, held over the shoulder, and switching from one to the other for relief. “It was also part of Roman crucifixion that the victim was made to carry his cross naked through the streets to the site of his execution[8], but as a concession to Jewish morality, Jesus was given back his clothes after being scourged (Mt 27:31; Mk 15:20)[9].” The reference here is to Fr Werner Bulst’s “On the Shroud of Turin.” Alas, I do not have this book. Can anybody refer me to Fr Bulst’s source of information about this? Or in fact any quote from Roman times suggesting that the victim usually carried his cross naked through the streets? Josephus? Quintillian? And so it goes….","date":"2013-12-03","mins":"8:56 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","title":"The Science of Logical Forensics"},{"id":"comment-21022","author":"hugh_farey","post":"I have enjoyed entering “Infinite Macroscopic Microscopic Imaging” into Google, and finding a detailed image of the internal structure of an electron derived from nothing more than an ordinary camera photo of a needle. I notice that the MM is also short for “Microscopic Macroscopic” and even “Microscopic to Macroscopic.” Most of the scholarly articles devoted to this subject are published by Dr Stewart in various ‘Journals of Science’ such as the ‘International Journal of Astronomy and Astrophysics Research’ (not to be confused with the more familiar ‘Astronomy and Astrophysics’) and another collective called ‘Independent Archaeology Notes,’ which includes the ‘Journal of Biblical Archaeology’ and the ‘Journal of Biblical Sciences.’ Remarkably, almost every one of the papers available on the internet under any of these headings has Dr Stewart as its sole or principal author, so I was relieved to see that they had been peer reviewed: by the International Society of Peer Reviewers. Sadly, this international society is only represented on the internet as a ‘linked in’ group, whose owner, I was surprised to see, is … [sadly, the author of this post was unable to continue as he fell off his chair laughing, and this last sentence was typed by his highly trained pet guinea pig].","date":"2012-12-23","mins":"1:17 pm","url":"https://shroudstory.com/2012/12/23/this-is-the-sort-of-thing-that-hurts-the-reputation-of-shroud-science/","cat":"other_blogs","title":"This is the sort of thing that hurts the reputation of shroud science"},{"id":"comment-55815","author":"hugh_farey","post":"“That the TSM was crucified is undisputable.” Hardly. It is, as any skim through the internet will show you, hotly disputed. Nevertheless, you are correct that it is an interesting exercise to take as an axiom that the image is an accurate depiction of a crucifixion victim, and from it, to attempt to reconstruct the events that resulted in it. However, without independent qualification, we cannot be sure that we are not reconstructing a medieval version of crucifixion, and not a Roman one at all. Walked naked throught the street? – No evidence for that, I believe. Crucified naked? – Well, I can’t find evidence for that either, much to my surprise. Carried the patibulum? – I’ve found “patibulum ferat per urbem, deinde offigatur cruci,” which seems to be one of only three lines preserved from a lost play of Plautus, and recorded by the 10th century linguist Nonnius Marcellus. Indicative rather than definitive, I would say. Nails through wrists? – The only victim found has some disputed scratches on an armbone, some way from the wrists. There would be no danger of tearing if the victim sat on a sedile or stood on a suppedaneum (as in one of the grafitti). Nails through feet? – The only victim found has them through the sides of the feet, as does one of the grafitti. The other has the two feet side by side not on top of each other. Broken legs? – The crurifragium features relatively often in classical literature, but was clearly not invariable, especially if a plolonged death was required. Spear? – Quintilian is often quoted here, in his Declamationes Maiores, where he has a character claiming that cruxifixion victims who have been pierced may be buried. Not that others may not be. Again, indicative rather than definitive, I would say. Now, go back to those confident statements claiming that the shroud conforms exactly to a first century Roman crucifixion. Well it may, but the evidence is meagre at best. What the shroud does conform to is a 19th century reconstruction of a typical Roman crucifixion based on… the shroud itself. What a surprise..","date":"2013-12-03","mins":"2:35 pm","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","title":"The Science of Logical Forensics"},{"id":"comment-196195","author":"hugh_farey","post":"What a confused posting. Either Jesus’s conception is explicable in biological terms, or it was the result of an “outside the laws of physics” miracle. If the latter, then yes of course God could have given him whatever blood he chose. If the former, then either he had a human father, or was the product of some form of cloning, implantation or recombinant DNA process with which we are not familiar. I do not think any of these preclude an AB blood type, and finding AB blood on the Shroud does not preclude any of those possibilities..","date":"2015-04-13","mins":"4:40 am","url":"https://shroudstory.com/2015/04/13/with-anyone-interested-in-listening/","cat":"other_blogs","title":"With Anyone Interested in Listening"},{"id":"comment-198771","author":"hugh_farey","post":"Any paper which begins with an unequivocal statement of incontrovertible facts that are actually nothing of the kind (“Firstly, to avoid any possible confusion, we must clearly state that it is a proven and confirmed fact that the blood on the Shroud is real human blood. Scientifically, there’s absolutely no room for doubting this conclusion”) invariably rouses suspicion in the mind of the more objective reader. Suffice it to say that in spite of the word ‘fact’ occurring fifty or so times (to say nothing of eleven “!!!”, three “???” and a “?!?”), almost nothing of Yannick’s paper is undisputed by quite sensible people, who, as usual, far from forgetting, neglecting and denying the evidence, are the ones who consider it most deeply on its merits. Colin has nothing to worry about from this quarter..","date":"2015-05-10","mins":"7:57 am","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","title":"Yannick Clément on Colin Berry’s Latest Hypothesis"},{"id":"comment-73206","author":"hugh_farey","post":"Just a quibble, but over the picture of the STURP team examining the Shroud is the caption S.T.U.R.P., which implies that the ‘U’ is an initial letter….","date":"2014-01-13","mins":"4:17 am","url":"https://shroudstory.com/2014/01/11/you-do-not-like-them-so-you-say-try-them-try-them-and-you-may/","cat":"other_blogs","title":"You do not like them. So you say. Try them! Try them! And you may"},{"id":"comment-96892","author":"hugh_farey","post":"Yannick, again, what are you talking about? Thibault’s work has been closely examined by lots of people, some of whom agree with his conclusions and some of whom don’t. There is no sense in which he is an inviolable “Sacred Cow.” Colin has criticised his work at length, and I often disagree in detail. He is emphatically not a researcher that we “cannot criticize at any cost,” and to claim that he is, is vapid. Of course you have a RIGHT to criticise: you may criticise his methodology, his presentation of results, and his conclusions. But there is no need to get overexcited about it as no one has ever denied you that right. You do not have a right to criticise his character, his beliefs or his faith, because you know nothing about them, and when overexcitement has led you into intemperate language, your views have been deleted by Dan, which, of course, he has every right to do. So you know Thibault is not an expert in ancient textiles or the chemistry of scorched linen. Well so what? He has carried out some experiments and presented his results. Not being a scientist you do not know whether his conclusions are valid, so reject them by appeal to “lack of authority.” I think that’s a perfectly reasonable position to hold. I don’t mind you holding it, and I don’t suppose anybody else does either, so why say “too bad” for “us guys”? We don’t mind at all. We hope you’ll forgive us, as scientists, for not taking your admitted ignorance as good evidence for changing our own opinions of Thibault’s work. And yes, a great deal of useful work could be done with a doctor with ready access to a lot of spilt blood and some linen. I have no doubt Thibault agrees with you. However he is under no obligation to carry out such work, and may not have the time, the resources or the inclination to do so. And such is his right..","date":"2014-04-05","mins":"6:28 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"}]
