[{"id":"comment-210290","author":"hugh_farey","post":"We all refine our opinions with age, I guess. In my article (2014) I mentioned Marcia Boi’s 2010 opinions, but not, unsurprisingly, her 2015 ideas. In 2010, apart from spotting what she thought were a few misidentifications, she was mostly concerned with what the presence of all those species might signify in terms of funeral rites, and not at all dismissive of Frei’s findings. This year, she is much more critical. Frei’s studies are ” wildly inaccurate”, his pollen was “forcibly made to match a probable geographic origin”, and his conclusions are “partial and ambiguous.” One after another, even after giving it initial credence, anybody who examines the pollen data finds it too anomalous to be acceptable as any kind of evidence. Daveb makes an interesting comment. “We end up with yet another unsatisfactory situation, apparently having put all our trust in those with a claim to know the science, but apparently who knew a lot less than they thought they did.” Without wishing to be dismissive, this is the attitude of many authenticists, whose uncritical acceptance of anything which supports their belief (and, with Mc Crone in mind, an uncritical rejection of anything which doesn’t) has led them to come a cropper when discrepancies and uncertainties are pointed out. Eventually, I truly believe, a general consensus for authenticity or otherwise will be established, on the basis of new data, or old data reinterpreted, but simply putting all ones trust in “scientists”, without carefully evaluating their work for ones self, is not the way to do it..","date":"2015-09-13","mins":"12:29 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210312","author":"hugh_farey","post":"No, of course it wouldn’t be fair. You’re back to clinging to putting all your trust in ‘experts’ who must be right rather than looking at their data for yourself. I know absolutely nothing about pollen that I haven’t read on the internet in the last three years or so and have never been asked to do anything in a criminal case. So what? Does that mean I’m wrong? Try me. Did Frei use a light pressure or a heavy one? Did he fold his tapes on themselves or not? Did he accurately identify 58 species of plant? Did he compare his samples with “botanical gardens worldwide renowned for their collections”? Are any of the contradictions and obscurities I pointed out in my article untrue? If so, name one. Or is everything I say to be ignored because I haven’t testified in a trial? He was commissioned to investigate the plane crash when Dag Hammarskjold was killed. Yes indeed. He attempted to do this by melting down as much of the airframe as he could, weighing it, and examining it for traces of bullets or bombs. He concluded that one could “exclude the possibility of hostile actions from the air or from the ground” and that there was “no room for the suggestion of sabotage”. His conclusions were challenged immediately, and the possibility of sabotage was, and continues to be, investigated..","date":"2015-09-13","mins":"5:34 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210275","author":"hugh_farey","post":"No; no part of the Shroud has been “analyzed down to the quantum level.” Hardly anything has. While it is true that everything is made of atoms, and that the interior of atoms operate according to the rules of quantum physics, it is certainly not true that any of the experiments on the Shroud depended on any knowledge of any of it. The Soret band was discovered and explained by Jacques Louis Soret in 1883, and does not require any quantum analysis to be useful. To the layman, there does not seem to be much difference in scale between ‘a small speck’ and an electron, such that one can say “To me that’s down to the quantum level,” but the difference is similar to that between the solar system and a football..","date":"2015-09-13","mins":"7:40 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210277","author":"hugh_farey","post":"Understood, Carlos, but actually thistle pollen is much the same whatever the genus, and anyway it now seems that the “Gundelia” pollen was misidentified even at genus level. Possibly Carduus instead..","date":"2015-09-13","mins":"7:45 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210364","author":"hugh_farey","post":"Yes, I know. The fact that a steam engine operates at a quantum level, which of course it does, does not mean that any quantum science is needed to operate it. The same is true of all Shroud investigations ever made. No experiments, results or the conclusions drawn therefrom were any more “at the quantum level” than James Watt and his steam engine..","date":"2015-09-14","mins":"8:03 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210278","author":"hugh_farey","post":"I’ve just read John’s reply that he was using the term poetically. Fair enough – not sure why he wrote “BY SCIENCE” in capital letters if that was the case though….","date":"2015-09-13","mins":"7:47 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210393","author":"hugh_farey","post":"So of course I did. After establishing that the pollen in question is not able to be identified at the species level, and that it better resembles pollen from the genus Carduus than the genus Gundelia, Jones leaps to the quite unwarranted identification of the pollen as from the species Carduus argentatus, which, he says “grows around Jerusalem”, and is more attractive than Gundelia anyway. Actually Carduus argentatus is widespread from Spain to Afghanistan, and the Carduus genus generally consists of nearly 100 species distributed all over Eurasia and Africa. Why Carduus argentatus would be a more attractive funeral decoration than Gundelia tournefortii escapes me. Although its leaves are less spiky than Gundelia, it is still a very awkward plant to handle, and its flower, a single typical purple thistle flower, is not at all as pretty as Gundelia, a round head of lots of tiny yellow inflorescences..","date":"2015-09-14","mins":"3:40 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210442","author":"hugh_farey","post":"There may, of course, be Helichrysum on the Sudarium, but not on the Shroud, especially if neither cloth was originally from Israel. However, the generic similarity between Gundelia, Carduus and Helichrysum pollen serves to cast greater suspicion on a confident identification of any of them..","date":"2015-09-15","mins":"7:48 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210452","author":"hugh_farey","post":"But, Louis, this time two years ago you said: “Uri Baruch did not remove the grains from the tape, but examined them in situ. His work was defended by Professor Avinoam Danin, who felt that it was Dr. Thomas Litt who had not examined the grains correctly by cleaning them first.”.","date":"2015-09-15","mins":"10:04 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-213281","author":"hugh_farey","post":"The value of this paper is not in its conclusions, which are so catholic as to admit of almost any place or time from which the Shroud may have originated, but in the fact that DNA analysis of very small particles is now possible and has been carried out. Fairly arbitrary scoopings of dust mean that these findings are painted with a pretty broad brush, but the concept is precise and a useful analytical tool. Incidentally, for the scientists among our readers, I thoroughly recommend downloading the ‘Supplementary Material’ which can be found after the Acknowledgements, which adds a good deal more information. Of the pollen, of course, only two or three of the two dozen or so species listed in this paper coincide with anything discovered by previous palynologists. Where is the Gundelia which made up a third of the previous assemblages? Where the “continuous carpet” of Matricaria or Anthemis of Avinoam Danin? Where the Carduus, the Helicrysum, or Scheuermann’s Chrysanthemum? I do not know how accurate the DNA analysis might be, but for such a small quantity of known plant material found on the Shroud itself to end up in the hooverings implies that all the rest of it is exogenous..","date":"2015-10-21","mins":"4:22 pm","url":"https://shroudstory.com/2015/10/21/numerous-plant-species-and-human-lineages-identified-now-what/","cat":"news_&_views","title":"Numerous Plant Species and Human Lineages Identified. Now What?"},{"id":"comment-214319","author":"hugh_farey","post":"Where did Giulio Fanti say any such thing? His report on his DNA analysis lists Robinia, Picea, Trifolium, Lolium, Plantago, Pyrus, Prunus, Cichorium, Humulus, Cucumis, Vitis, Carpinus, Juglans and Salix, 14 genera of which one single example (Carpinus) is also found on Max Frei’s list. Fanti knows very well that no subsequent pollen analysis, by DNA or SEM or even just looking again at through a microscope, has done anything at all to verify Max Frei’s speculations, so I am surprised that he has claimed that he has “matched the results obtained by Max Frei Sulzer.” The reference you give says nothing about pollen or Max Frei..","date":"2015-11-06","mins":"3:35 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"id":"comment-214327","author":"hugh_farey","post":"I do apologise, Louis. For some reason my ‘search’ function did not pick up the second mention of pollen in your paper, which does indeed have Fanti saying that “the fragments of pollen grains on the relic detected by me [Fanti] match the results published by him [Frei].” However, in his book “Il Mistero della Sindone” Fanti gives a list of 24 species of plant, of which, as above, only one matches anything on Frei’s list. Prunus, it is true, appears on both lists, but Max gives Prunus arabica, while Fanti gives Prunus salicina. How these two lists can be described as matching beats me completely..","date":"2015-11-06","mins":"5:14 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"id":"comment-214331","author":"hugh_farey","post":"Alas, no. We did discuss the pollen, but I didn’t appreciate, as perhaps I should have done, that Alan actually had possession of Frei’s collections. As it was, Alan got so bogged down in the piles of detritus he can now see covering the body, from flowers to nails, chains, various pieces of notices and even two crowns of thorns, that I think he began to lose credibility. I suspect that is why Avinoam Danin has become so much more circumspect recently..","date":"2015-11-06","mins":"6:32 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"id":"comment-214262","author":"hugh_farey","post":"I don’t know what to say that hasn’t been said before, really. Not one of Lucotte’s plants appear on anybody else’s list, in spite of whole carpets of flowers apparently being found strewn around the Shroud. Max Frei’s identifications were suspect because his identifications were based almost exclusively on a collection of plants from the Middle East. I note with suspicion that Lucotte’s identifications are based on “the Rossignol palynothèque, specially devoted to Near East pollens” and that “Palestinian pollen grains produced by trees and tree like shrubs are described by Horowitz & Baum.” A more balanced study would not have assumed that the pollen was Middle Eastern from the start. I suggest that had Lucotte or Frei consulted a Palynology of Japan or Brazil, they would have identified very different species and demonstrated a Far Eastern or South American provenance for the Shroud..","date":"2015-11-05","mins":"2:24 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"id":"comment-214464","author":"hugh_farey","post":"I was indebted to Gaetano Ciccone’s paper for some of my research in ‘Problems with Pollen’, in the BSTS Newsletter June 2014. Since then, Giulio Fanti’s DNA research and Gerard Lucotte’s SEM examination have only served to muddy the waters even further..","date":"2015-11-10","mins":"6:16 am","url":"https://shroudstory.com/2015/11/10/the-pollen-scam/","cat":"science","title":"The Pollen Scam?"}]
