[{"id":"comment-195277","author":"hugh_farey","post":"I was happy to follow the interviewer’s lead. Although 90 minutes is long enough for a quickfire recitation of all sorts of Shroud elements, you can’t get through very much in a discussion format..","date":"2015-04-03","mins":"10:37 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196743","author":"hugh_farey","post":"If only it were that obvious, wholt. The trouble is that those pesky gospel writers didn’t write in English, or it would all be so much clearer. Jhn 19:39 venit autem et Nicodemus qui venerat ad Iesum nocte primum ferens mixturam murrae et aloes quasi libras centum ἦλθεν δὲ καὶ Νικόδημος, ὁ ἐλθὼν πρὸς [as]αὐτὸν νυκτὸς τὸ πρῶτον, φέρων [at]μίγμα σμύρνης καὶ ἀλόης ὡς λίτρας ἑκατόν Jhn 19:40 acceperunt ergo corpus Iesu et ligaverunt eum linteis cum aromatibus sicut mos Iudaeis est sepelire ἔλαβον οὖν τὸ σῶμα τοῦ Ἰησοῦ καὶ ἔδησαν [au]αὐτὸ ὀθονίοις μετὰ τῶν ἀρωμάτων, καθὼς ἔθος ἐστὶν τοῖς Ἰουδαίοις ἐνταφιάζειν. Jhn 20:6 venit ergo Simon Petrus sequens eum et introivit in monumentum et videt linteamina posita ἔρχεται οὖν [a]καὶ Σίμων Πέτρος ἀκολουθῶν αὐτῷ, καὶ εἰσῆλθεν εἰς τὸ μνημεῖον· καὶ θεωρεῖ τὰ ὀθόνια κείμενα Jhn 20:7 et sudarium quod fuerat super caput eius non cum linteaminibus positum sed separatim involutum in unum locum καὶ τὸ σουδάριον, ὃ ἦν ἐπὶ τῆς κεφαλῆς αὐτοῦ, οὐ μετὰ τῶν ὀθονίων κείμενον ἀλλὰ χωρὶς ἐντετυλιγμένον εἰς ἕνα τόπον The key words are linteis / ὀθονίοις (John 19), linteamina / ὀθόνια and sudarium / σουδάριον. Curiously, in view of the eminence of the translation you used, none of these words commonly meant strips of cloth. Linteum, in particular, is used to mean the towel that Jesus dried the disciples’ feet with, and also the huge sheet that descends from the heavens in Revelation. It is true that ὀθόνια is used to mean bandages, which supports the idea of strips, but then it also means a sail, which doesn’t. When you have a moment, you might like to see what words the other evangelists used in the same context. Sindon is a particularly interesting one. Then when you have explored the subject a little more thoroughly, you will be able to avoid solecisms like: “There should be no controversy about the shroud whatsoever.”.","date":"2015-04-18","mins":"3:59 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196757","author":"hugh_farey","post":"Yes, fine, but not really any better. Try looking up all the references to othonia in Greek literature to try to find out what it really means. It does not exclude the cloth we know as the Shroud of Turin..","date":"2015-04-18","mins":"6:05 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196762","author":"hugh_farey","post":"“But I guess that I should believe you rather than the one who saw with his own eyes.” You should believe us both, because I am simply translating what he said. I do not know what language John was originally written in, so I gave you the Latin and the Greek in case you wanted to explore these early versions for yourself. Othonia does not necessarily mean strips of cloth, and the author of John may have been referring to a sheet. Now for the spices. There was no time for elaborate burial preparations, as we know because as soon as they could the Holy Women came back to the tomb to do it properly. So the herbs and spices were simply packed around the body and the shroud folded over the top. Such an interpretation is entirely consistent with the gospels. And the head cloth (not a scarf, that’s just weird) is often identified with the sudarium of Oviedo. No problem there either. By all means convince yourself that belief in the authenticity of the Shroud is unbiblical; there are a great many others who think the same. But it won’t stand up to any serious scrutiny..","date":"2015-04-18","mins":"6:43 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196820","author":"hugh_farey","post":"I don’t know how original his ideas were, but the crux of The Fifth Gospel, by Ian Caldwell, which Dan advertised here a few weeks ago is… **SPOILER ALERT** … that since John, the last gospel writer, is the only evangelist to mention the lance wound, that therefore it was most likely entirely symbolic (a reference to Zechariah 12:10), and not an authentic wound of Christ at all. Ergo, the Shroud must be a fake. (Nay sayers, I doubt if it’s worth jumping up and down about; it’s only a novel…).","date":"2015-04-19","mins":"6:36 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196808","author":"hugh_farey","post":"William, I missed your last list of words; sorry. However you are slightly missing my point. Your “direct Greek to English” translation is only one of many, and rather an old one at that, which has been discussed in more detail since. It is not enough for some of us – and if you really want to understand what the evangelists said then it should not be enough for you – simply to find: “3608 oqon¢ioi V small pieces of cloth” and assume it must be the only possible translation. In this specific occurrence, the word is actually singular anyway. You repeat:” If you do not believe what the word of God says, then on what basis do you make your claims?” but you do not seem to want to know what the word of God is. To claim that the Shroud cannot be accommodated within the Gospel texts is to deny the word of God. Is that what you really want?.","date":"2015-04-19","mins":"4:03 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196803","author":"hugh_farey","post":"The word is indeed plural, and is usually translated as strips, presumably because some authors use it to mean bits of fabric to bind up wounds, which must surely be long and thin. However, my point is that it does not have to mean strips as thin as bandages. The word is frequently used to mean pieces of cloth for making sails with, and sometimes pieces of cloth for making tunics with, for which a 1m wide strip would seem more appropriate. Just now, Googling away, I came across this article, which covers the subject well: https://www.shroud.com/pdfs/ssi04part4.pdf.","date":"2015-04-19","mins":"3:18 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196831","author":"hugh_farey","post":"Gently, William; this isn’t a theology class, nor even a conversion polemic. On the whole, I am inclined to believe that the Shroud is not the authentic burial cloth of Jesus on various grounds, but biblical exegesis isn’t one of them. However, I don’t like flawed arguments wherever they occur, and although your convictions regarding the Shroud are no doubt sincere, they are based on shaky ground. “To claim that the Shroud cannot be accommodated within the Gospel texts is to deny the word of God.” Yes. The gospels describe the various cloths left in the tomb in various ways, and those ways do not exclude the Shroud. To claim that they do is to misread the gospels. This appears to be exactly what you are doing. “How can you claim the shroud as being accommodated by the word of God? What scriptures do you cite?” In my comments above I actually cited the gospel of John, which you yourself chose as an advocate against the Shroud, and demonstrated that it does not deny the possibility that Jesus was covered with a sheet. “You are saying that Jesus was not wrapped with strips of cloth but simply covered with a sheet,” Not at all. The gospel of John would support Jesus being wrapped either in strips of cloth or a sheet. Neither is precluded by the words of St John. “Why I this so important to you?” It is not important to me at all, It was a response to your airy denial of the Shroud solely on biblical grounds, which is unjustified. “Is your belief in the shroud the only source of belief in Jesus you have?” Not at all; quite the reverse. My belief in Jesus has nothing to do with this blog, but for what it’s worth, it does not rest on the authenticity or not of the Shroud. “Are you concerned that if the shroud were not authentic then you would no longer believe in Jesus?” Not at all. As a matter of fact I don’t think the Shroud is authentic. It does not affect my beliefs at all. “I am familiar with the Word of God and I know what it means.” Well no, you’re not, as we have seen. You are familiar with an English translation of the word of God, which is good enough in most cases, but if you want to demonstrate a specific and rather precise meaning, then you need to explore a little deeper. Your simplistic assertion: “These verses describe the fact that Jesus had a separate cloth wrapped around his head, again, not one complete sheet.” and the question: “Does not even the Pope read the Bible?” were a little arrogant, if I may say so..","date":"2015-04-19","mins":"11:04 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196852","author":"hugh_farey","post":"What an extraordinary deduction! I’m a born and bred Catholic, educated at a Benedictine monastery and a teacher in a very Catholic school. I couldn’t be more Catholic without working at the Vatican! (Mind you, there are sects which think Catholicism and Atheism are as evil as each other – perhaps you’re one of those?) Now why not go and learn a little more about this Word of God you think you know so well. You never know, you might learn more about Christ as well!.","date":"2015-04-19","mins":"2:47 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-195280","author":"hugh_farey","post":"I understand your position, Jason, but that was not really the point of the program, which was more of an introduction to the controversies surrounding the Shroud than a detailed analysis of them. Perhaps it will inspire listeners to inquire further..","date":"2015-04-03","mins":"10:58 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196855","author":"hugh_farey","post":"Are William and Wholt different people? I’ve treated all their posts as if they were from the same person. My apologies if they have different views….","date":"2015-04-19","mins":"3:03 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196934","author":"hugh_farey","post":"“All one needs to do is read the biblical account from the eyewitnesses. The description of the burial clothes of Jesus is nothing like the shroud. That is all the investigation I need.” Alas, it is all too clear that you have not read the biblical account from the eyewitnesses. You appear to have read one translation of one Gospel, and are clinging to that as a way of discrediting the authenticity of the Shroud. Go back to your bible and this time read what the evangelists (all of them) actually said. Matthew, Mark and Luke all use the word sindon to describe the sheet which covered Jesus. Luke uses othonia as well, for the same thing. Luke uses the word keiriais to describe the swaddlng clothes of the infant Jesus. John also uses the word keiriais, to describe the burial wrappings of Lazarus, but not for the burial wrappings of Jesus, which he calls othonia. Keiria are thin bands of cloth – such as for swaddling clothes Othonia are wide bands of cloth – such as for stitching together to make sails A Sindon is a sheet In some circumstances – as used by Luke – othonion and sindon can be synonyms. Had you made any attempt to understand the Gospels as a group, you would understand that the Shroud is certainly not precluded, although it is also not positively confirmed. So I wonder why you wanted to use the Gospels to discredit the Shroud. If you think it is not authentic, there is much stronger ground than John’s othonia with which to do it..","date":"2015-04-20","mins":"11:36 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-197016","author":"hugh_farey","post":"No William, you have not cited the word of God. You have cited extracts from one translation of one Gospel. However I apologise for not giving the citations fully myself; I guess I thought you might know them. Here we go: Keiria, meaning thin bands: John 11:44 “He who was dead came out, his hands and feet wrapped with grave clothes, and his face wrapped with a cloth” (Earlier, I said that Luke also used this word, but I mistook keimen for keiriai; apologies) Othonia, meaning wide bands: John 19:40 “Then they took the body of Jesus and wrapped it in linen cloths” John 20:5 7 “Stooping down and looking in, he saw the linen cloths lying. Yet he did not enter. Then Simon Peter came, following him, and went inside the tomb. He saw the linen cloths lying there, and the cloth that was around His head, not lying with the linen clothing” Luke 23:53 “Then he took Him down, and wrapped Him in linen” Sindon, meaning sheet: Matthew 27:59 “When Joseph had taken the body, he wrapped it in a clean linen cloth” Mark 15:46 “So he bought fine linen, and taking Him down, wrapped Him in the linen and laid Him in a tomb” Luke 24:12 “But Peter rose and ran to the tomb. Stooping down, he saw the linen clothes lying by themselves” Now let’s sort out this nonsense: “Unlike you, I do not claim to have any superior knowledge, I am only citing the word of God.” Unfortunately, simply picking up a bible and referring to it, which you call “citing the word of God” is not any such thing, and, since it must be the mainstay of anybody who rejects more orthodox Christianity in favour of their own personal interpretation (“I do not belong to any denomination nor do I practice any religion”), it behoves you to get better acquainted with it before you start belabouring others with it. By all means, as long as you lead a good life and love others as you love yourself, then use the bible however you will, but if you want your attempt to discredit the Shroud to have any credibility among those who know it better, then you need to find out rather more than you do..","date":"2015-04-21","mins":"2:37 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-195284","author":"hugh_farey","post":"Various people on this blog and elsewhere have put forward ideas for the future investigation of the Shroud, but there is a slight feeling of fantasy about them, as until the Pope authorises it, they are only pipedreams. I know you are a keen advocate of your various microscopies, but I have never been clear as to what exactly they could tell us. If you could write a proposal as to how exactly you think AFM or other microscopes could add to the knowledge about the Shroud, I would be very happy to consider it..","date":"2015-04-03","mins":"11:39 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-28276","author":"hugh_farey","post":"Hi David; good to have you along. The points you ask about have been the subject of considerable discussion, and even some research (!), but it would be wrong of anybody to say that conclusive proof has been achieved for or against any of them. Whether the body was washed or not, whether it was surrounded or anointed by anything, whether the shroud was wrapped or draped, whether and especially what combination of these might have resulted in the image as we see it today have all been, often hotly, debated. For what it’s worth, I will summarise the main opinions… 1) “Normally wrapped.” The precise details of 1st century Jewish burials, as applied to victims of a judicial crucifixion, in a hurry, are, of course, unknown, and leave lots of scope for variation. The paucity of archeological remains only serves to obfuscate the situation further. It seems that bodies were ‘normally’ laid in some sort of shroud (probably not a long thin one), allowed to rot away, and the bones reinterred in urns. Recovery of a relatively undamaged shroud would thus be very unlikely, which is why we don’t have any. Or any others, perhaps I should say. 2) “Attempts to coat a living person.” There have been dozens, all with fairly gruesome results. Any kind of wrapping produces what is called the ‘Agamemnon mask’ distortion of the face, with the ears wide apart sticking out at the sides, the legs very thick, and the top of the head a continuous band from forehead to the back of the neck. Very few, if any, researchers think that the body image could have been formed in that circumstance, although some people think that the blood stains were transferred while the body was wrapped, and the image arrived later, on a different configuration of the shroud. However this is not necessarily a fatal objection to authenticity. After all, the body may have been closely surrounded, even packed, by bags or blocks of ‘myrrh and aloes’ or some other concoction. The bible is at pains to point out “one hundred pounds,” which is a pretty generous dose. This might have resulted in what was essentially a bas relief, and the image would not not have extended beyond what we might call the top and bottom surfaces. Other researchers think that the image was formed by some form of emanation, either of gases, radiation or something more esoteric. Although these might be expected to spread out in all directions, if they actually only acted in a vertical direction, then again, the sides of the body would not be expected to leave an image. 3) “Washed and anointed.” Here, again, prescribed Jewish ritual versus a hurried burial in a temporary tomb leaves room for uncertainty. It does appear that the body itself was not smeared with oil or anything similar, as it left no trace of the cloth, but it may have been completely washed (a sign of respect) or not washed (to preserve the blood with the body, which was, and still is, important to Judaism when the blood represents a significant quantity of the remains) or partially washed (to remove mud and clean minor wounds, but leaving the dried or clotted significant quantities undisturbed). The ‘anointing’ may have consisted of packing the body with spices, or laying flowers or more spices on the body in some places. 4) “Dead bodies do not continue to bleed.” This is only partially true. As the heart stops pumping, and capillaries are thin, blood soon stops flowing through them, and the blood coagulates pretty soon anyway. However, blood inside a body stays liquid for some time, and opening a major wound, such as a nail hole in a wrist or a spear hole, can result in that blood falling out under gravity. Furthermore, abrasions, resulting in a loss of skin, can also remain moist for some time, and although they are unlikely to drip, at least some portion of the blood can be transferred to a cloth by contact. Try laying a piece of steak on a napkin to see what might be expected. Small but deep puncture wounds might also bleed under gravity if their surface clots were opened by a a cleaning or wiping process. It should be needless to say that none of the suggestions above constitutes a verification of the authenticity of the shroud, but they do show that the simple assumptions many take to be proof of inauthenticity are in no way to be accepted at face value..","date":"2013-03-24","mins":"12:44 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","title":"Barrie Schwartz on the Shroud of Turin"},{"id":"comment-51800","author":"hugh_farey","post":"“The bloodstains on the Shroud are both physically and chemically typical of any highly traumatized body that was tortured, scourged and who died by crucifixion.” Typical. Really? Was does typical mean? That they conform to a type. How many other tortured, scourged, crucified blood samples have been analysed, so that we can compare the shroud blood to them? How many samples constitute a “type,” I wonder?.","date":"2013-11-17","mins":"5:47 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51822","author":"hugh_farey","post":"Thanks for pointing that out. I had missed it. I note that Fazio and Mandaglio do not attempt to answer my criticisms of their paper, but ask that I publish them in a journal before they will address them. I suppose that’s fair enough, but I can’t be bothered to pay whatever they did to have their radiation paper published, so will not pursue them further..","date":"2013-11-17","mins":"7:57 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51857","author":"hugh_farey","post":"No it isn’t. A makes an unsupported statement. B denies it. A supports it. B refutes it – or doesn’t. We have got to the “A supports it” stage. Still, if I must jump the gun, you could begin by looking up the governance of the World Health Organisation in its constitution and tell me what the Higher Council is..","date":"2013-11-18","mins":"4:55 am","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51832","author":"hugh_farey","post":"Zenit is mistaken. The alleged front cover of the report is not authentic..","date":"2013-11-17","mins":"9:11 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51824","author":"hugh_farey","post":"“In 1973, the Higher Council of the World Health Organization (WHO) appointed a scientific commission to verify the Italian doctor’s conclusions. The work was carried out over 15 months with a total of 500 examinations. The conclusions of all the researches confirmed what had been stated and published in Italy.” Not one single world of this is true. Refute, please..","date":"2013-11-17","mins":"8:03 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51870","author":"hugh_farey","post":"Oh, all right. There is no Higher Council of the World Health Organisation, so it couldn’t have ordered anything. The website lancino.it, which naturally contains a detailed account of all the scientific findings, makes no mention of the WHO (or OMS, as it is in Italian). The photograph of the cover of the alleged WHO report carries a stamp unrelated to anything produced by the WHO or the UNO. The only scientists to be mentioned in connection with the modern investigation of the miracle are Dr Linoli, and Dr Bertelli, whose work was carried out in 1970 1971. Dr Linoli repeated some of his observations in 1981. Nothing was carried out in 1973. A detailed article on the miracle published in L’Osservatore Romano in 1982 makes no mention of the WHO. The i.wikipedia.org article on the miracle says: “Alcuni sostengono, senza indicare fonti verificabili, che del miracolo di Lanciano se ne sarebbero occupati anche l’ONU e il consiglio superiore dell’OMS, i quali, nel 1976, avrebbero pubblicato una relazione favorevole alla miracolosità dell’evento. Tuttavia, nonostante il prestigio internazionale dei due enti, né gli studi di Odoardo Linoli pubblicati nel 1982, né la Santa Sede, che si occupò di Lanciano in un lungo articolo su L’Osservatore Romano del 23 aprile 1982, menzionano minimamente la presunta relazione dell’ONU e dell’OMS.” So: “In 1973 [No, the researches were carried out two years previously], the Higher Council of the World Health Organization (WHO) [There is no such thing] appointed a scientific commission [No, there is no evidence of any such thing] to verify the Italian doctor’s conclusions [No, he was asked to verify them himself ten years later]. The work was carried out over 15 months with a total of 500 examinations. [This is transparent nonsense] The conclusions of all the researches confirmed what had been stated and published in Italy [No, it wasn’t]. Not one single world of this is true.” Refute, please..","date":"2013-11-18","mins":"8:04 am","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51863","author":"hugh_farey","post":"The shroud was measured by Flury Lemburg as 437cm x 111cm in 1998, and later by Barberis and Zaccone (2000), with its corners stretched slightly, as 437.7cm and 441.5cm (long sides); 112.5cm and 113cm (short sides). It is also quoted as varying in length by 2cm depending on humidity. (All information from Dr Zugibe’s ‘The Crucifixion of Jesus’). Various cubit measurements have been found, all different lengths. The nearest I can find to the 1st century is the Roman cubit of about 44.4cm, which may be based on contemporary Egyptian cubits. Some excellent work on funerary slabs in various museums suggests that the Assyrians, whose empire dissolved some hundreds of years before Christ was born, may have had three cubits, of between 51cm and 57cm. Actual measuring bars, mostly from Egyptian tombs, are about 52cm long. It is popular to pick whichever shroud dimensions seem appropriate, divide them by 8 and 4 as required, and then find a cubit that fits, pronouncing the shroud as “exactly” this or that. Whether there is any evidence that any 1st century cloth was woven (or buildings constructed) to any particular width, let alone an Assyrian cubit, I rather doubt. Does anybody know of any?.","date":"2013-11-18","mins":"6:06 am","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51922","author":"hugh_farey","post":"Look carefully at the stamp at the bottom of the report, with WHO+UNO on it. It is nothing like the insignia of either the WHO or the UNO. I am hesitant to denounce it as an out and out fraud, but I have no doubt whatever that it has no official status..","date":"2013-11-18","mins":"3:59 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51932","author":"hugh_farey","post":"No, I can see that. Try http://www.lengscollectables.com/uploads/7/8/6/3/7863674/9548461 orig.jpg.","date":"2013-11-18","mins":"4:36 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51797","author":"hugh_farey","post":"Charles, I think that your idea that the shroud may be a man made object without necessarily being a deliberate and cynical manufacture in an attempt to extract money from the gullible is very sensible. I wonder if I may ask you something, being somewhat of an authority on relics? Would you agree that the the 13th century is a little late in the day for an elaborate forgery? I have gained the impression from somewhere that relic hysteria was in its heyday more like the 9th or 10th centuries, and that enthusiasm (or possibly credulousness) was waning by the time the shroud was established at Lirey. The Wikipedia article on relics says: “The growth in the production and popularity of reproducible contact relics in the fifth and sixth centuries testifies to the need felt for more widespread access to the divine,” which may represent the beginnings of the craze, and the decree of the Council of Nicea, in 787, that every altar should contain a relic may mark the beginning of the decline. By the Council of Trent (1563) they were almost being positively discouraged. I should be interested in your thoughts..","date":"2013-11-17","mins":"5:36 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-28935","author":"hugh_farey","post":"I think we have a question of semantics here. What are the chances of an object which really dates from the 1st century being carbon dated to the 13th? And what are the chances of a 13th century object being dated to the 1st? Intrinsically, the more recent an object, the smaller the error. The bones of Richard III, for example, are dated between 1475 and 1530 (a margin of plus or minus 30 years or so) with a 70% confidence rating. The two laboratories which carried out the dating came up with dates which were about 15 years apart. If a third laboratory were to be asked to carry out the task, and came up with an ancient date, there would be a strong suspicion that a major error had occurred. If the body asking this third laboratory had previously suggested a specific date, say between 100 BC and 100 AD, and that was the date it came up with, then a suspicion of fraud would surely not be illogical. For the reverse (an object dating from the first century producing a mediaeval date) the situation is more complicated. In the absence of any provenance, I think a confidence rating of 70% would perhaps extend to a couple of hundred years either way (Yes I’m guessing). However, if two laboratories came up with a “1st century plus or minus 200 years” and a third came up with a 13th century date, that would surely be a major error. If, as in the previous example, the body asking the third laboratory had previously suggested the possibility of 13th century date, then at least some suspicion of fraud (although significantly less than in the previous example) might be entertained. At present it cannot be said that the Turin Shroud has been definitively dated, and to my mind commenters to this blog have produced sensible objections to every single “proof” that has been adduced for any date. However, if the shroud is from the first century, then a suspicion of fraud may validly fall upon the carbon date. On the other hand, if no such suspicion of dishonesty can be entertained, then that in itself is strong evidence against a 1st century date..","date":"2013-03-31","mins":"6:33 am","url":"https://shroudstory.com/2013/03/29/barrie-schwortz-biggest-issue-so-far-seems-to-be-the-validity-of-fantis-samples/","cat":"news_&_views","title":"Barrie Schwortz:  Biggest issue so far seems to be the validity of Fanti’s samples"},{"id":"comment-28698","author":"hugh_farey","post":"The Vatican Insider article says categorically that the samples were from 1988, while Fanti’s own 4 point defence refers to 1978. That’s a puzzle to me. However, except in the case of deliberate fraud, it is intrinsically far more difficult to contaminate a mediaeval cloth with 1st century fibres than to contaminate a 1st century cloth with mediaeval ones. If (you’re quite right, Yannick; maybe I should put “IF!!!”) Fanti’s procedure is sound, then the security of his provenance is not so crucial. Even if his fibres came from the sweepings off Turin Cathedral’s floor they would still be very suggestive. On the subject of a wholly different book, I waited for so long to read a review of “Follow the Light” (a self published rather cutesily written book by sculptor T.C. Newman) that in the end I was forced to buy one and read it. Although it contains little revelatory, it does have two interesting pictures showing the ventral image reflected about its vertical axis. The ‘spear side’ reflection shows quite a burly chested figure with almost emaciated legs, while the ‘wristwound side’ reflection shows a more evenly proportioned man, albeit rather thin. The difference is quite striking and I wonder if anyone else has commented on it..","date":"2013-03-29","mins":"6:10 am","url":"https://shroudstory.com/2013/03/29/barrie-schwortz-biggest-issue-so-far-seems-to-be-the-validity-of-fantis-samples/","cat":"news_&_views","title":"Barrie Schwortz:  Biggest issue so far seems to be the validity of Fanti’s samples"},{"id":"comment-28699","author":"hugh_farey","post":"I have tried wading through the comments people have made on the articles appearing in all those newspapers Dan has quoted, but it’s pretty turgid stuff. However, I did come across a brilliant explanation of all those FTIR, Raman and XRF techniques we hear so much about and don’t understand (I speak for myself, but I bet I’m not alone). It’s at http://www.webexhibits.org/pigments/intro/spectroscopy.html, and ought to be better known..","date":"2013-03-29","mins":"6:54 am","url":"https://shroudstory.com/2013/03/29/barrie-schwortz-biggest-issue-so-far-seems-to-be-the-validity-of-fantis-samples/","cat":"news_&_views","title":"Barrie Schwortz:  Biggest issue so far seems to be the validity of Fanti’s samples"},{"id":"comment-96075","author":"hugh_farey","post":"I note the quad mosaic photos appearing again, with the usual explanation that the difference in colour across the shroud represents diffrence in chemical composition. While Barrie carefully explains how a green area in one corner of one photo suggests moden interweaving, he does not explain that all the photos of different areas of the shroud show similar discolouration at the corners, or what the huge pale blue area right across the middle of the images might indicate. Surely this argument for interweaving has been totally discredited..","date":"2014-04-03","mins":"4:19 am","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-96096","author":"hugh_farey","post":"You’re quite correct. I don’t believe in the interweaving hypothesis, but there is certainly some evidence in favour of it, such as the appearance of cotton fibres and possibly Rogers’s madder and glue. The quad mosaic argument though is surely dead in the water..","date":"2014-04-03","mins":"5:51 am","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-198618","author":"hugh_farey","post":"It’s a strange word, tetradiplon, and I’m not sure that it’s real meaning is numerical at all. Let’s assume, for a moment, that the Mandylion/Image of Edessa were not large pieces of cloth folded up ‘tetradiplon’, then what is the significance of the word? Why should the precise way in which a cloth was folded be at all interesting? Was it perhaps simply a numerical way of expressing the term ‘many layered’ (rather as Jesus’s ‘not seven times but seventy times seven times’ was not an encouragement to stop forgiving after 490 attempts, but meant ‘a very great many times’). Was a multi layered ‘towel’ particularly expensive or high quality, so that giving Jesus a tetradiplon towel was not really a reference to its folding pattern but its quality, and, by extension, the respect due to the recipient. Anybody any ideas?.","date":"2015-05-08","mins":"9:24 am","url":"https://shroudstory.com/2015/05/07/charles-freeman-on-tetradiplon-and-the-video-on-shroud-com/","cat":"comments_promoted","title":"Charles Freeman on Tetradiplon and the Video on shroud.com"},{"id":"comment-198676","author":"hugh_farey","post":"Diplon is usually translated as ‘folded in half’, but if it simply means ‘folded’, then there are several ways of folding the shroud four times to achieve the one eighth size attributed to the mandylion/image of Edessa. Stephen Jones’s zig zags put one in mind of Aldo Guerreschi’s watermark investigations, which might be relevant..","date":"2015-05-09","mins":"1:47 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","title":"A Folding Method Charles Freeman Might Accept"},{"author":"hugh_farey","post":"Thank you for replying, and, indeed, for forgiving. You're still wrong about my opinions, but that's OK. As long as you don't think that the Catholic Church's 'dishonesty' is Satanically inspired I can live with that..","date":"2014-10-31","mins":"8:13 AM","url":"http://theshroudofturin.blogspot.com/2014/10/my-critique-of-charles-freemans-claim.html","title":"\nMy critique of Charles Freeman's claim that the Turin Shroud was made for a medieval Easter ritual\n"},{"author":"hugh_farey","post":"Hi Stephen.I don't comment on your blog, as you know, but recent comments perhaps need some contradiction as they are untrue.a) Bippy123 \"hugh Farey who just want the shroud to be a fake.\" For the record, I do not want the Shroud to be a fake. I would much rather it was authentic. I just do not find the evidence in favour of authenticity sufficiently convincing. I know you find it overwhelming, and I respect that, but I don't.b) Bippy123 again. \"people like farey and others totally confuse me.Its like there is a hidden bias already in there apriori before they even look at the evidences.\" I do not mind if Bippy is confused, but I can assure him, and you, that there is no hidden bias.c) You. \"Farey with his \"an accidental 14th century origin\" of the Shroud\" Yes, you've had a lot of fun with that. Perhaps an unfortunate choice of words. By accidental, I do not, of course, mean that the image arrived wholly by chance. I think it possible that the image as we see it today is the accidental result of the passage of time on some other image, which I wholly agree was not acccidental at all when it was made.d) You. \"united only in their antipathy towards the authenticity of the Shroud!\" I cannot speak for Freeman, who seems to have drifted away from Catholicism, but I certainly have no antipathy towards the authenticity of the Shroud, nor to those who think it authentic. I look forward to the day when a definitive identification can be made, authentic or otherwise.Best wishes Hugh.","date":"2014-10-30","mins":"10:33 PM","url":"http://theshroudofturin.blogspot.com/2014/10/my-critique-of-charles-freemans-claim.html","title":"\nMy critique of Charles Freeman's claim that the Turin Shroud was made for a medieval Easter ritual\n"},{"id":"comment-142570","author":"hugh_farey","post":"Actually the doubts, of either authenticists or non authenticists, are exactly what should be taken seriously. It is the overweening confidence of the completely closed mind, either of the Teddy Halls or the Stephen E Joneses, that needs to be taken with a tolerant chuckle and a moving on to more fruitful discussion..","date":"2014-08-06","mins":"6:35 am","url":"https://shroudstory.com/2014/08/05/5050-colin-berrys-most-outlandish-proposal/","cat":"other_blogs","title":"50/50  :  Colin Berry’s Most Outlandish Proposal"},{"id":"comment-20965","author":"hugh_farey","post":"Are not the two inescapably connected, and probably directly correlated?.","date":"2012-12-22","mins":"9:41 am","url":"https://shroudstory.com/2012/12/22/a-note-to-thibault-heimburger-from-colin-berry/","cat":"uncategorized","title":"A note to Thibault Heimburger from Colin Berry?"},{"id":"comment-20978","author":"hugh_farey","post":"Thanks Dave. I have some myrhh, but as you say, it’s quite pricey (about £1 per gram) so I’m reluctant to slosh it about. Although it is quite viscous, it is difficult to brush it only on one side of the cloth – it seems to seep in quickly and make it quite translucent. It is slightly fluorescent, and does seem to react with urea solution, making a mark without needing heating, but I find liquids very difficult to control, they tend to spread out all over the place. I’m unhappy about the shroud contacting any liquids at all, in fact (except the blood of course) but if myrhh was sufficiently hydrophobic, it might do the trick nicely, preventing the liquid from seeping through. I’ll give it a go. No idea where you get aloes from… As for the photos, I think iphoto is fine, but the shots I sent Colin were 3 MB or more, and may have gone funny when compressed for the web. He seems to have cracked it with the later ones though (as above)..","date":"2012-12-22","mins":"3:37 pm","url":"https://shroudstory.com/2012/12/22/a-note-to-thibault-heimburger-from-colin-berry/","cat":"uncategorized","title":"A note to Thibault Heimburger from Colin Berry?"},{"id":"comment-75949","author":"hugh_farey","post":"Wondering where the contamination, vanillin or other anomalous material on the radiocarbon sample may have come from, last week I dyed some linen with madder root, using alum as a mordant. I didn’t boil my preparation, and it dyed (yes, linen does dye quite well, just not as well as cotton) a pale orange. This week I cut it up and experimented. The results are at http://i.imgur.com/Kskju LV.jpg. Below a piece of undyed linen are the following: A – the dyed linen B – boiled in water for 10 minutes C – stirred in Molar H Cl at 70°C for 10 minutes D – stirred in Molar Na OH at 70°C for 10 minutes E – all three of the processes above, separated and concluded with a thorough rinse in cold water. F – the dyed linen (kept as a spare). I do not know what exactly is left on piece E, and I expect that it would get fainter if the processes were repeated, but it is seems clear that the cleaning processes carried out by the radiocarbon labs may not have removed dye (as opposed to paint, which would have been removed). Of course the contamination is far too small to affect the radiocarbon dates much, although it might partially explain Riani and Atkinson’s chronological anomaly findings. It may also explain Rogers’s vanillin findings. None of the samples fluoresces under UV light..","date":"2014-02-02","mins":"8:55 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-76599","author":"hugh_farey","post":"I have never thought the evidence for the ‘bloodstain first, image second’ hypothesis was particularly convincing. Shroud 2.0 does not show that the exposed areas of shroud where bloodstains have rubbed off are paler than the image upon which they sit, although Thibault has explained that the colour under the blood may be due to serum, which is fortuitously very similar to that of the image. Heller, I think, having determined that the image was due to degraded cellulose, found that image fibres showed such degradation, but blood fibres, after the blood had been dissolved away, did not. This is the principal evidence for the ‘blood first’ hypothesis. However, Rogers’s more recent theory, that the image is wholly on a thin coating on the fibres, and not a part of the structure of the fibre itself, completely contradicts this claim. Highly respectable scientists both of them were, but their views are contradictory – one of them, at least, is wrong. And then, of course, if the image was made by laying something onto the cloth, and if that something, painting, bas relief or actual body, was painted with blood before being laid, then the blood would have suppressed image formation, and the ‘blood first’ hypothesis would be justified..","date":"2014-02-04","mins":"8:29 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-47758","author":"hugh_farey","post":"The 1532 fire, the silver casket and the drop of molten metal have become so ingrained in popular shroud history that any suspicion of doubt tends to be greeted with ridicule or completely ignored. Aldo Guerreschi’s comprehensive study, refuting the ‘drop of molten metal’ story, carries with it some fearsome implications which have not been followed through. Firstly, I have never read the primary source from which the story of the fire comes in the first place. I do not know if our information is contemporary, or if the first known information comes from a copy of a copy of a copy many years later. Does anybody else? Secondly, the melting point of silver is about 900°C. The melting point of iron is about 200°C hotter. It is interesting to speculate about the kind of conflagration around the “niche in the wall” which heated the casket within it to 900°C, but did not melt the iron bars holding it in place. It is also interesting to speculate about the actions of the famous blacksmith, who in the midst of this inferno popped into to rescue the shroud. Of course, the “silver” casket may not have been silver at all. Perhaps it was wooden, with silver plates or bands, and the wood burnt through, depositing the lid on the cloth. But not, apparently, any of the burning wood. I have heard it said that wrapped cloth is a remarkably good insulator, and experiments of my own with molten lead (melting point about 300°C) show how difficult it is to make a hole through more than one or two layers. However the corollary to this is that folded cloth is very easy to char on the outside, as the heat is not conducted away. Remarkably, however, the unfolded shroud shows no distinction between the inside layers and the outside layers. For two years the shroud disappears, and then requires the testimony of three bishops and ten noblemen to establish that the one which has mysteriously reappeared is the same one as disappeared two years previously. I wonder why. Wasn’t it obvious? Or were there dark suspicions that the original may in fact have been destroyed? It was then taken to a convent where it took two weeks to do what is possibly the worst patching job in recorded history. That’s odd, don’t you think? Colin’s speculations may turn out to be fanciful, but he’s absolutely on the money when it comes to thinking that the 1532 fire is worth further investigation..","date":"2013-10-17","mins":"9:05 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-47823","author":"hugh_farey","post":"I am familiar with both the sources linked to above. However they have no deep provenance. Dorothy Crispino’s ‘Report of the Poor Clare Nuns’ seems to come from an article called “Validita ed Attualita di Due Antiche Descrizioni Della Santa Sindone” by Riccardo Gervasio in 1974, which may derive from the second source, “Le Saint Suaire de Chambéry a Sainte Claire en Ville (Avril Mai 1534)”, which was published in 1891 by Abbé Léon Bouchage. Is that as far back as we can go there? On the other hand thank you very much for mentioning Pingonius. His “Sindon Evangelica”, published in 1581, which can be found on the internet at http://sceti.library.upenn.edu/sceti/printedbooks New/index.cfm?Text ID=sindon&Page Position=9. Pingonus mention the rescue of the shroud, but not, as far as I can see, its repair..","date":"2013-10-17","mins":"7:17 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-20724","author":"hugh_farey","post":"Tire? Me? Never… And I’m not wedded to the scorch theory. It’s just that the image does look so very like a scorch… Anyway, just to show proper scientific balance, today I acquired some myrhh (too expensive) and some urea (very cheap). Myrhh, it turns out, without any treatment at all… IS FLUORESCENT! Not strongly, it’s true, but it has certainly put a new cat among my pigeons..","date":"2012-12-19","mins":"12:33 pm","url":"https://shroudstory.com/2012/12/19/colin-berrys-christmas-present/","cat":"uncategorized","title":"Colin Berry’s Christmas Present"},{"id":"comment-199073","author":"hugh_farey","post":"I think Andy was replying to Colin’s “The thing one has to beware of are preconceptions, especially pro authenticity ones.” However, being aware of preconceptions, which Colin also identifies with “the lifeblood of science” is not the same as avoiding them altogether. As an understanding of anything builds up, one is inevitably inclined to one opinion or another, and tends to approach a new idea with that inclination. The important thing is not to fossilise an inclination based on partial evidence into such a firm conviction that no subsequent evidence can be looked at on its own merits. If you are convinced the Shroud is genuine, then no attempt to demonstrate a medieval method of manufacture can be looked at on its own merits, and if you don’t, then no natural process in a tomb can be taken seriously. Recognising the possibility that one may be wrong is crucial, and any paper or article from either side which includes phrases such as “the only way” or “it must have been” indicate unwarranted certainty. It is worth looking at the published scientific papers to see how all the authors scrupulously avoid committing themselves to “the only way” or “proof,” and then at the comments on this blog and elsewhere convinced of absolute certainty. A perfect paragon of a scientific conclusion is in Riani and Atkinson’s statistical paper: “Our results indicate that, for whatever reasons, the structure of the TS is more complicated than that of the three fabrics with which it was compared.” Brilliant..","date":"2015-05-14","mins":"1:56 am","url":"https://shroudstory.com/2015/05/10/colin-berrys-method-and-3d-information/","cat":"other_blogs","title":"Colin Berry’s Method and 3D Information"},{"id":"comment-1199","author":"hugh_farey","post":"Ho ho. Just because Margaret of Austria (really? Never heard of her) repaired (or didn’t) the shroud invisibly, i doubt if its present owners would agree to your wholesale moth eating, even if they could repair it just as well. However, I understand that nothing like that size of sample would be needed; wouldn’t a single thread or two be enough? If an inch of so of weft thread (barely visible on the image side of the shroud) were taken (and repaired, of course) from your sites, wouldn’t that be enough?.","date":"2012-11-14","mins":"4:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/14/colinbs-cunning-plan-for-re-dating-the-shroud-of-turin/","cat":"cellulose","title":"ColinB’s cunning plan for re-dating the Shroud of Turin"},{"id":"comment-2500","author":"hugh_farey","post":"Hi Colin, I’m just running up to an end of term, so a bit busy, but I’ll certainly carry out the UV experiment before Christmas. As for the Evans photos, I see the “toasted” area as a conduction (contact) scorch, and the general yellowish background as a convection and/or radiation (non contact) scorch. Does that seem reasonable? Incidentally, for a true “topmost fibres only” illustration, there is an Evans photo of some rust on the shroud among Barrie’s collection, and the unchanged blue white silky background is very visible there..","date":"2013-11-21","mins":"10:30 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/11/21/glad-to-be-of-service-anonymous/","cat":"uncategorized","title":"Glad to be of service,  “anonymous”…"},{"id":"comment-1765","author":"hugh_farey","post":"I thought I quite understood genetics until I got very bogged down in Oppenheimer’s book. Exciting ideas, and possibly true, but rather turgid to wade through. If he’s correct though, I think he demonstrates that cultural heritage is not the same as genetic heritage. So what if only half a dozen Angles and an extended Saxon family actually settled in Britain – they still managed to erase 400 years of Roman occupation almost without trace (until excavated hundreds of years later), and pretty well everything that had happened before that. I don’t know much about Breton, Erse or Scots Gaelic, and precious little about Welsh, but Welsh does seem to be as much like the language of the later Romano British as we’re likely to find extant. And if we originally spoke Basque – is there any evidence of that?.","date":"2013-01-21","mins":"9:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/11/what-is-a-shroud-expert-and-is-he-or-she-to-be-trusted/","cat":"culture","title":"What is a Shroud  “expert” – and is he or she to be trusted?"},{"id":"comment-1505","author":"hugh_farey","post":"Thanks for your comment Thibault. I read your paper with interest – and Colin’s denunciation, and really the two of you inspired me to try some of these things for myself. I am now quite a dab hand at “painting” linen with a red hot spatula, in such a way that minimal scorching occurs on the other side of the cloth, and I am also aware of the effect radiated heat has on linen. There does not have to be contact to produce visible discolouration, for instance. I appreciated your paper very much (and said so at the time), but my own subsequent experiments have led me to query much of what I have read about the fluorescence of the shroud. The paper I would very much like a copy of is Miller and Pellicori’s seminal 1981 paper in the Journal of Biological Photography, which is not available to independent researchers on the internet. If you have a pdf of it I would be very grateful. I hope that my post below makes some of my current concerns clear, but to simplify them: 1) The only photo I have seen of the shroud under UV light (above) is brightly coloured, not weakly, and does not seem to be suppressed by the image. This is in contradiction to what I have read elsewhere. 2) When I heat a piece of linen in an oven ( 800 C) without discolouring at all. 3) I personally have not been able to produce a pinkly fluorescent scorch, and I’d like someone to tell me how to do it. (Using school lab and kitchen equipment!) Would you like to comment on any of those points? I would be grateful..","date":"2012-12-17","mins":"10:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1509","author":"hugh_farey","post":"Well, I look forward to what Adrie and Thibault have to say about my three main confusions at the moment! As for scorching at at a distance, there must be some reconciliation between a hot template apparently not being able to scorch at a non contact distance of a millimetre of two, and an oven at the same temperature managing to scorch it from perhaps 20 cm. (Although to be fair my linen was lying on a plate. I think I might dangle it from a grill, so that the minimum distance from any other solid is about 10 cm, but I guess it will go brown just the same.) I’ve got some interesting photos of fluorescence I’d like to share. Can I email them to you?.","date":"2012-12-18","mins":"12:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1484","author":"hugh_farey","post":"I don’t know if my hypothesis works better when the ‘overall’ scorching happens before or after the ‘image’ scorching. However, we are told that the entire shroud is ‘yellowed with age’ and ‘weakly fluorescent.’ This is consistent with the entire shroud being heated (as part of the manufacturing process before the image, or in a reliquary after the image) to, say, 200 C, producing some visible chromophores (yellow I have still not been able to produce fluorescence without any visible change at all), and some invisible fluorochromes. (Your Phase 1 above) I believe the fluorochromes form at one temperature, and are indeed degraded into non fluorescence after a very small increase in temperature. If I pour a blob of molten lead onto a piece of linen, and (after tipping it off) look at it under UV light, the scorch itself does not glow, it just looks brown, but it is surrounded by a coastline of yellow green fluorescence, as if a steep temperature gradient is being illustrated, from no change, to fluorochrome, to visible scorch (shades of brown) and eventually to char (black). Your Phase 2 then, is the application of a hot template, which would turn more of the fluorochromes into non fluorescing scorch, reduducing the overall fluorescence. I entered the shroudstory/shroudwithoutallthehype fray trying to demonstrate (with you) that the image could be a scorch, but was consistently obstructed by the “scorches fluoresce but the image does not fluoresce” chant. I think the idea that scorches only in fact fluoresce round the edges, and that the fluorescence of the shroud image is smothered by the overall backgroud fluorescence, overcomes this obstruction..","date":"2012-12-16","mins":"10:14 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1506","author":"hugh_farey","post":"Oops! My Point 2 has disappeared! I wonder how that happened. To replace: 2) When I heat a piece of linen in an oven (300 C), it turns brown in 10 minutes. This is in contradiction of the tale that the shroud was heated in a silver ‘oven’ (the casket) until it was hot enough for the silver to melt (900 C) without discolouring at all..","date":"2012-12-17","mins":"10:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1482","author":"hugh_farey","post":"Yes, that’s exactly my point. It would be interesting to know how enhanced the exposure was during the processing of the photo. As I said before, if the shroud was lightly scorched all over, then the visibly scorched fibres would not fluoresce, while the invisibly scorched (but chemically altered) fibres would, producing weak fluorescence all over, which is what we can see in the photos. Further scorching (such as you suggest for the image), would simply increase the number of visibly scorched, non fluorescent fibres, and decrease the number of invisibly scorched (but chemically altered) fibres, thus reducing the overall fluorescence..","date":"2012-12-16","mins":"12:02 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1480","author":"hugh_farey","post":"What I’m getting at is why we can see anything at all on these photos. If you illuminate a non fluorescent cloth with a UV lamp and try to take an ordinary photo, the result is nothing, just black. How come we can make out the shape of the image and bloodstains. If the shroud was also illuminated by visible light, then weak fluorescence could be impossible to detect, and if the photo was taken using UV sensitive film, then we would only be seeing reflected UV, not fluorescence. In fact, my UV lamp also gives off a small amount of deep violet light, and most materials reflect that colour, but it is far too weak to show up on my camera and even if it did, it would be deep purple, not yellowy green, like your top photo..","date":"2012-12-15","mins":"11:00 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1472","author":"hugh_farey","post":"End of Term… Back to the Shroud… I notice your photo of the hands area, under UV illumination and a long way from the nearest scorch, is glowing nicely. What do we make of that? A similar photo, also under UV, from Jumper and Adler’s Examination of the Stains and Images (1984), but this time of the area covering a big scorch and the spear wound, also shows the middle of the shroud shining brightly, and the scorch rather less! Having nothing better to do, a shoved a bit of linen into a glass pipe today, and passed methane out of a gas tape through it (and lit it the the other end so as not to die). Then scorched the linen with a Bunsen. There could not be circumstances of less oxygen surrounding the linen. After letting it all cool down, but with the methane still passing over it, I pulled it out an looked at under UV. The same greeny yellow as ever. How to get pink fluorescence is a complete mystery to me..","date":"2012-12-15","mins":"5:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1439","author":"hugh_farey","post":"Thanks. That’s new to me, but what I really want is the source for all that stuff about the four padlocks and the blacksmith and the ‘single drop of molten silver.’ Since the last ‘fact’ is clearly false, I wonder what else was..","date":"2012-12-11","mins":"5:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1430","author":"hugh_farey","post":"Maybe an old cloth, then, left over from the crusades? Is the primary source for the fire and its aftermath online, do you know? I find it odd that people had to wait for two years before the damaged shroud was ‘resurrected,’ and that was before the Poor Clares attached the backing. Where was it, and what was it doing for those two years? And why marjoram leaves, I wonder? There are no blood drops that big on the shroud (3 4cm). Were they thinking of the spear wound, I wonder, which would be about right..","date":"2012-12-10","mins":"7:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1425","author":"hugh_farey","post":"PS. Don’t tell me you’ve thought of that too!!!.","date":"2012-12-10","mins":"9:43 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1424","author":"hugh_farey","post":"Now what about this… There was a shroud of some kind in a silver reliquary, from the 1st, 13th or whatever century, but it was destroyed in the 1532 fire, and a copy was secretly made, complete with appropriate burn marks and patches, to maintain the relic, and more especially the pilgrimages and their income. I wonder if de Wesselow would consider the image ‘culturally, stylistically and technically’ impossible from a 16th (as opposed to a 14th) century viewpoint. I thought of this while reading David Hockney’s book ‘Secret Knowledge’ last night, where he thinks that portrait painters from about 1430 used a camera lucida (basically some lenses and prisms) to project images onto their paper so that they could be drawn up very accurately. He illustrates his book with dozens of examples, and points out parts of big paintings where the perspectives and sizes don’t quite match up correctly, due, he thinks, to the painter having to move the camera lucida around as it could only cover a bit at a time. Makes me think of all those people who think the shroud’s legs are too long or the neck too short or whatever. So, the carbon dating would be wrong, wrong, wrong, as usual, but because it dates the cloth as too early, not too late! Humm. Lots of implications and ramifications probably….","date":"2012-12-10","mins":"9:43 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1419","author":"hugh_farey","post":"Might have guessed you’d been there before me. Still, nothing like confirmation by experiment is there? I’m impressed by Guerreschi’s reconstruction (shroud.com) of the scorching pattern, and note that he thinks the burns were made by a solid metal object, not molten droplets. His findings are not inconsistent with a hypothesis that the shroud wasn’t in a reliquary at all, but deliberately attacked with a hot metal object, as you suggest..","date":"2012-12-09","mins":"12:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1417","author":"hugh_farey","post":"Gunga Din here… What about the myth of the silver reliquary? I was pursuing my idea that a pre scorched shroud, with weak UV fluorescence, might mean that any fluorescence due to later scorches wouldn’t show up. I have an electric hotplate, designed to melt ‘model maker’s metal’ which is a mixture of tin, lead and bismuth. When turned up full, a bit of lead sitting on it melts quite easily, but a similar bit of zinc doesn’t melt at all, so its temperature is presumably in the mid to high 300s C. I also have a small steel peppermint box (courtesy of Starbucks), about 5cm x 4cm x 1cm high, Into which I put a folded up bit of linen about 9cm x 6cm, closed the lid and put it (cold) onto the hotplate (hot). I then put a bit of lead on the top of the box just to see if it would reach melting temperature. (I do have some glass thermometers that go up to 300 C, but I’m not sure how accurate they are; they’re immersion thermometers and not good at hotplates, reading a maximum of about 240 C even when lying on the plate). Anyway, after ten minutes, I took the box off (the lead on the top hadn’t melted at all) and prized open the lid. Most of the linen was charred black, and what wasn’t was well scorched – much browner than old newspaper, for example. The char, of course, didn’t fluoresce at all, and the scorched bit quite weakly (as advertised). Now silver melts at about 900 C, depending on its quality, and I seriously wonder how a linen cloth could receive serious melt damage from a silver reliquary without being previously scorched quite badly all over, and probably charred to destruction in several places. I’ll bet a pound to a penny no shroudie has popped and old sheet into a metal tank, heated it in a bonfire until bored and then had a look inside, but I think the results would have been quite disturbing… Or am I wrong? I’m a bit reluctant (well, totally reluctant actually) to look through a microscope at a sample lit by UV, as I don’t know how much will be reflected up the barrel, but I have a feeling that there is a very small temperature difference between degradation to fluorescence, and degradation to visible scorching, at which point fluorescence stops. Certainly areas of fluorescence look much bigger than the visible scorches they surround, but I’ve never been able to get fluorescence completely unaccompanied by visible browning. However, I suspect that as it is heated, something (cellulose, lignin, hemicellulose, other starches, sugars or carbohydrates generally?) first degrades into a chemical that fluoresces but is visibly unchanged, and then degrades further into something that is visibly yellow or brown, but does not fluoresce. The weak fluorescence of a lightly scorched cloth is due to the browned fibres not fluorescing at all, and only unbrowned fibres fluorescing. Obviously, any further scorching, such as somebody playing with hot bas reliefs, would increase the area of visible scorching, and therefore decrease the area of fluorescence. Which is why it is said that the image does not fluoresce. Does that make sense?.","date":"2012-12-09","mins":"11:50 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1502","author":"hugh_farey","post":"These are all excellent references, Adrie, for which many thanks – many of them I have read before, of course, as some were posted to threads which I was commenting on myself. I have several questions revolving in my mind, and you might be able to clarify one or two. I have not read, I think, that the previous researchers thought that the ‘background fluorescence’ might itself be due to a scorch – they tend to attribute it to part of the manufacturing process, in spite of Miller’s experiment showing that “Modern linen can be artificially aged by baking at high temperature (125º 150º C) to the point where its reflected color and fluorescent emission approach those of the Shroud.” I find that 10 minutes at 220 C will do the same. Yet the shroud has been heated at least once, and possibly more, to at least that temperature. Even if there were another reason for the fluorescence, that heating would be sufficient. It’s not obvious to me what is meant by ‘weakly fluorescent.’ Looking at the picture of the hands, which Colin posted above, there appears to be a bright oval of yellow green fluorescence centred roughly in the middle of the picture, with darker margins at the edges (particularly the upper edge) as if a bright spotlight were being aimed at that particular place. If this was a UV light, and if the photo shows the reflected visible light, then I don’t call that ‘weak,’ but remarkably bright. What’s more it is all around the image of the hands. If (just suppose, for the sake of argument) a hot bas relief of a pair of hands had been pushed onto a piece of modern linen, that is exactly the picture I would expect, with discolouration (but no fluorescence) where contact or radiation heated the linen to 200 C or so, and fluorescence (and very weak colouration) where distance (or perhaps a cooler bit of the bas relief) heated the surrounding region to, say 190 C. I have recently been heating bits of linen in an oven, and find that at 250 C, ten minutes is enough to char it a uniform mid brown. I now find it staggeringly unlikely that the shroud could have sat in a silver ‘oven’ (its casket) at a temperature of 900 C (to melt the silver), without being totally destroyed. Finnally, in a last attempt to produce pink fluorescence, I placed a piece of linen in a glass tube and passed methane (my ordinary lab gas) through the tube, then, after a few seconds so that there could not be any oxygen left in the tube, and with the methane still flowing, inserted a red hot steel spatula into the open end (yes, very nervously) onto the linen, and scorched it. Removing the spatula, waiting for the linen to cool, turning off the methane, and examining the linen under UV produced… yup, the same old yellow green as ever! Not really questions then, but I’d be grateful for your thoughts!.","date":"2012-12-17","mins":"4:56 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1515","author":"hugh_farey","post":"Thanks Adrie. The background fluorescence continues to intrigue me. Is age itself (oxidation presumably) enough to make linen fluoresce? Or was it treated with something naturally fluorescent in manufacture? Or was it heated? I don’t know, but if I want to make non fluorescent linen fluoresce in ten minutes, 220 C is a good temperature, while Miller and Pellicori found that 125 C 150 C (perhaps for an hour or so?) would also do the job. I’m sure you’re correct that the picture of the hands has either been exposed for a long time, or pushed in processing, to show the fluorescence. However it does show an image area (the front of the thighs) either fluorescing itself, or at least not suppressing any background fluorescence. I’d love to see other areas of the shroud (recognised scorches) for example, photographed in a similar way. It may be that Miller and Pellicori addressed this, but I can’t get hold their paper. Yet. Guerreschi and Salcito clearly showed, I think, that the burn holes were made by something solid, not liquid, but they were less convincing about how the solid arrived on the cloth. They wonder if the casket was in fact made of wood, with silver or gold panels, and the wood burnt through, or that the fire was hot enough for ‘weld points’ to yield, or that something might have sat on top of the casket heavy enough to buckle it. All of this, I submit, would have charred the insides irredeemably. Another relevant point, which I have only just noticed in their papers, is the tiny amount of water apparently used to extinguish the smoulder, judging by the size of the water marks which they attribute to that incident. This is not, I think, indicative of someone desperately trying to cool a casket, but of a well targeted application just to cool the burns themselves. I think I’ll have to give up on the pink… I found alas that my coloured cotton shirts were all mixed with artificial fibres which just melted under heat! Even cotton wool, which I was hopeful of, fluoresces quite well before being heated. So I’m afraid we’ll have to wait a while for that one! yielding of weld points or buckling under the weight of something else.","date":"2012-12-19","mins":"10:55 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1496","author":"hugh_farey","post":"I should very much like to, but would probably want to reference Miller and Pellicori’s original findings. However their paper does not seem to be easily available on the internet. Do you happen to know if anyone’s published it anywhere?.","date":"2012-12-17","mins":"9:45 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-177256","author":"hugh_farey","post":"“Cold and withering eye”? Moi? Actually this had been trimmed from David’s site when I visited. But, really. Warm and encouraging? Hmmm… Dispassionate and clarifying?.","date":"2014-12-17","mins":"9:05 am","url":"https://shroudstory.com/2014/12/17/please-revisit-david-rolfes-shroud-enigma-soon/","cat":"other_sites","title":"Please Revisit David Rolfe’s Shroud Enigma Soon"},{"id":"comment-21532","author":"hugh_farey","post":"My ignorance of St Augustine’s exegesis humbles me beyond description. Can you give us the essence of his ideas, or better still, a reference wherein one might read the great man’s own words?.","date":"2013-01-03","mins":"11:22 am","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-59058","author":"hugh_farey","post":"I’m not happy accusing people of deliberate malfeasance, but there are certainly discrepances between Barbet’s (and Bucklin’s) ideas and Zugibe’s. Rather than impugn his integrity, we might be better off exploring why Zugibe thought so differently. For a start, they were both working from a picture of an indistinct bloodstain. I am rather taken with Mathias’s idea that the wound is too close to the knuckles to be a ‘wrist’ wound, but that’s assuming the big oval blob closest to the fingers is, in fact, the site of the nail hole. It looks as if Zugibe took it to be one end of the thinner of the two arms of the famous bifurcation (the end nearest the thumb), while Barbet took it to be the middle of the thicker one. However, I’m not sure it really matters. It is apparent from the various dissections available on the internet – (not for the squeamish, but have a look at: http://nervesurgery.wustl.edu/Nerve Images/Anatomy%20and%20 Physiology/AP Median Nerve—IMG 3299.jpg, or http://4.bp.blogspot.com/ LUB Kf8 T5 Cf A/Tid4go2 Yv7 I/AAAAAAAAB To/X Nw Hv Bt X Kc M/s1600/human body dissection 05.jpg, or http://commons.wikimedia.org/wiki/File:Branches of median nerve.jpg) – that wrist nerves, bloodvessels and tendons are rather squashed in just anyhow, and there are substantial variations from the standard model. A tap on a nail in the middle of the wrist is equally likely to send it sliding down either side of the capitate bone, whence it could equally well go through Destot’s, Zugibe’s or even Bevilaqua’s space. Any or all of the nerves of the wrist are quite likely to be damaged. Talking of which, there are several websites which refer to damage to the median nerve. In none of them is there any reference to the thumb being flexed tight across the palm, although there is some inward flexion towards the little finger. In spite of several model crucifixes with just such a contraction, does Barbet in fact claim it to that extent? There is a picture of one of Barbet’s crucified corpses in Zugibe’s response to him (http://www.crucifixion shroud.com/Barbet.htm) and while it does appear to have nerve damage (the 4th and 5th fingers are curled inwards) the thumbs are not conspicuously flexed..","date":"2013-12-13","mins":"8:13 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-144209","author":"hugh_farey","post":"We had quick look at this on 28 April this year. An extremely controversial dating by a scientist who refuses to comment at a laboratory that has not only formally denied that any such testing took place, but also that it did not have the appropriate equipment anyway, of a thread apparently stolen from the Shroud and dated (if it actually was) in the face of the express refusal of the owner to permit it. A single thread, divided into two, giving different dates for the different parts. We don’t know how long this thread was, or whether there was enough for radiocarbon dating anyway. Joe Marino claims to have some more confirmatory evidence that the dating did actually happen, but what credence can be placed on its credibility has been seriously questioned..","date":"2014-08-16","mins":"12:20 pm","url":"https://shroudstory.com/2014/08/16/another-gary-habermas-shroud-of-turin-video/","cat":"news_&_views","title":"Another Gary Habermas, Shroud of Turin Video."},{"id":"comment-47353","author":"hugh_farey","post":"I don’t how accurately the Christian Post is reporting Habermas’s lecture, but one or two statements strike me as peculiar. “One of the discoveries based on enhanced images of the Shroud presented is that the person’s teeth were showing through the skin – possible signs of the resurrection for those who believe that the man is indeed Jesus Christ. […] This is one of the best indications that the man in the Shroud, who was dead and was crucified, (has) radiation coming out. [… (The teeth) are on the inside, but on the photo they are showing outside. Whichever way (the radiation) is coming, it dragged the image from the inside to the outside.” Even if there was the slightest evidence that the teeth are visible on the shroud image, which I deny, this explanation is, as have often remarked in other contexts, literally scientific non sense. “Further radio carbon dating tests conducted in early 2013 by Padua University scientists established that the Shroud was likely made somewhere between 280 B.C. And A.D. 220, which is around the same time many Christians believe Jesus walked on Earth.” Established? Really? These were highly speculative spectrographic tests that made an interesting contribution to non destructive radiocarbon analysis. To say they “established” anything at all is grossly overestimating them. “Furthermore, traces of dirt on the man’s feet, which have been subjected to chemical analysis published in a peer reviewed secular chemistry journal, were noted to be from a species of limestone that is found almost exclusively in Jerusalem.” Aragonite is the second commonest form of limestone on the planet and although there is indeed aragonite limestone in Jerusalem, detailed isotopic tests would be needed to identify a specimen of limestone found on the shroud as from that particular area. No such tests have been conducted on the very few alleged particles that have been found, and without them, it could have come from almost anywhere..","date":"2013-10-13","mins":"6:20 am","url":"https://shroudstory.com/2013/10/13/gary-habermas-on-the-shroud-at-apologetics-conference-last-friday/","cat":"news_&_views","title":"Gary Habermas on the Shroud at Apologetics Conference Last Friday"},{"id":"comment-47381","author":"hugh_farey","post":"Louis, they are most certainly controversial, whether they are really there or not. You do not need biased opinions, OK, to create a controversy; honest ones will do, if there are enough of them on both sides to establish disagreement. Dan’s and my honest opinions are that the face of the image “is really there,” and that the coins, flowers and letters “are really not there.” I believe that the first view is uncontroversial, and second one is. I have looked closely at the negative of the face in the light of Thierry’s paper and utterly deny that any of the letters are so obvious a child could spot them. The existence of the letters does not become a fact by writing in capitals, nor by the addition of exclamation marks; it becomes a fact by general acceptance, and this, so far, it certainly does not have. What’s more, denying the letters does not necessarily constitute a rejection of authenticity, or a slavish adherence to the Maillard reaction hypothesis, or any other conclusion about the shroud. If they were clear, then they would certainly add to the information we have about it. But they aren’t, and thus remain controversial, at least for the time being..","date":"2013-10-13","mins":"1:40 pm","url":"https://shroudstory.com/2013/10/13/gary-habermas-on-the-shroud-at-apologetics-conference-last-friday/","cat":"news_&_views","title":"Gary Habermas on the Shroud at Apologetics Conference Last Friday"},{"id":"comment-47397","author":"hugh_farey","post":"I think some apparently clear letters would appear as false positives if almost any sheet was manipulated digitally in the same way. I do see the letters SB in Diagram 7 of your first Reference, and the same letters among a plethora of possibilities in one of Tierry Castex’s photos of the whole face. I do not, however, consider any of them proved, or even satisfactorily demonstrated. I have ordered a copy of Marion and Courage’s book, however, and look forward to being convinced by them….","date":"2013-10-13","mins":"3:53 pm","url":"https://shroudstory.com/2013/10/13/gary-habermas-on-the-shroud-at-apologetics-conference-last-friday/","cat":"news_&_views","title":"Gary Habermas on the Shroud at Apologetics Conference Last Friday"},{"id":"comment-29197","author":"hugh_farey","post":"De Niro et al’s 1988 paper is very interesting, but I don’t think the operations they describe could be used as accurate dating techniques (and they do not claim that they can). They do relate the composition of biological material to the atmospheric conditions during its formation, but unless one knew what the atmospheric conditions were, quite precisely, at a particular times and place, it would be difficult to place a piece of material there. Nevertheless, their ideas could certainly add circumstantial evidence one way or another..","date":"2013-04-03","mins":"5:36 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","title":"Alan Boyles Cosmic Log on Fanti’s New Book"},{"id":"comment-139101","author":"hugh_farey","post":"I should post them anyway, David, and if our Spanish is a bit weak, we can into Google Translate to try to make the best of them!.","date":"2014-07-18","mins":"4:13 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","title":"A Telling Interview with Giulio Fanti"},{"id":"comment-29228","author":"hugh_farey","post":"I can’t find a free download, and I’m not sure the full article wouldn’t be too technical for me anyway. For those who haven’t found it, here is the abstract. The 18 O/16 O ratios of cellulose and the D/H ratios of cellulose nitrate were determined for linen, a textile produced from the fibers of the flax plant Linum usitatissimum, and for maize (Zea mays) from a variety of geographic locations in Europe, the Middle East, and North and South America. The regression lines of δD values on δ18 O values had slopes of 5.4 and 5.8 for the two species. Statistical analysis of results reported in the only other study in which samples of a single species (the silver fir Abies pindrow) that grew under a variety of climatic conditions were analyzed yielded slopes of ~6 when δD values of cellulose nitrate were regressed on δ18 O values of cellulose. The occurrence of this previously unrecognized relationship in three species suggests it may obtain in other plants as well. Determining the basis for this relationship, which is not possible given current understanding of fractionation of the isotopes of oxygen and hydrogen by plants, should lead to increased understanding of how D/H and 18 O/16 O ratios in cellulose isolated from fossil plants are related to paleoclimates. The separation of most linen samples from Europe from those originating in the Middle East when δD values are plotted against δ18 O values suggests it may be possible to use the isotope ratios of cellulose prepared from the Shroud of Turin to resolve the controversy concerning its geographic origin..","date":"2013-04-03","mins":"12:19 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","title":"Alan Boyles Cosmic Log on Fanti’s New Book"},{"id":"comment-28615","author":"hugh_farey","post":"In the event that Fanti and his colleagues positively demonstrate that the age of linen can be accurately determined solely by its elasticity, then they have done a service to science regardless of any consideration of the shroud. If, by their method, they have identified a linen fibre as being 2000 years old, then there is a fairly limited provenance to such a fibre. If that fibre comes from anywhere in the vicinity of the shroud, back or front, authorised or not, then a substantial piece of evidence has been added to the shroud corpus of knowledge. The same applies to their IR or Ramon spectroscopy dating procedures. If..","date":"2013-03-28","mins":"11:30 am","url":"https://shroudstory.com/2013/03/28/an-inevitable-dispute-fanti-and-the-archbishop/","cat":"news_&_views","title":"An Inevitable Dispute?  Fanti and the Archbishop?"},{"id":"comment-28633","author":"hugh_farey","post":"They haven’t carried out any. Fanti is offering to help them confirm his findings should they wish to do so, not saying that anything similar has been done before..","date":"2013-03-28","mins":"2:33 pm","url":"https://shroudstory.com/2013/03/28/an-inevitable-dispute-fanti-and-the-archbishop/","cat":"news_&_views","title":"An Inevitable Dispute?  Fanti and the Archbishop?"},{"id":"comment-28620","author":"hugh_farey","post":"The translation above contains some delightful but somewhat misleading idiosyncracies (Translating Prof. Fanti as “infantryman” or “footsoldier” for example; and translating “sottoscrito” as “yours truly”), so I hope a clearer, if slightly freer translation of Fanti’s riposte to his critics may be helpful: “1. The correspondents to Vatican Insider have not been able to read the appendix to my book which clearly explains the provenance of the samples. 2. The samples are from what Cardinal Saldarini specifically refers to in his point d): “material taken with the explicit permission of the Custodian during the STURP investigation in October 1978.” 3. According to the requirements of Cardinals Saldarini and Poletto, the undersigned has contracted for the return of his samples. 4. The results of his published research are reproducible and could be confirmed by parallel tests conducted by the CIS. The undersigned is ready to share his knowledge and experience for this purpose.” It seems clear the Fanti felt obliged to point this out as the article to which he was replying implied that he was using samples taken without permission either in 1988 or 2002. His declaration has been quickly followed by some nervous backtracking by the Archbishop of Turin, Cesare Nosiglia, to the effect that even if the taking of the samples was authorised, the length of time since 1978 has rendered their provenance insecure. Which indeed may be correct..","date":"2013-03-28","mins":"12:32 pm","url":"https://shroudstory.com/2013/03/28/an-inevitable-dispute-fanti-and-the-archbishop/","cat":"news_&_views","title":"An Inevitable Dispute?  Fanti and the Archbishop?"},{"id":"comment-31281","author":"hugh_farey","post":"An excellent paper for a number of slightly off field reasons. Firstly, although the ‘Shroud of Turin’ was apparently used as a way of attracting funding, it has no other mention in the paper at all. Secondly, there is no mention of any of the controversial mechanical testing that formed the basis of Fanti’s ‘third method’ of dating the shroud. And thirdly, anyone who thought Andre Marion’s description of his methods (for clarifying putative inscriptions) was at all adequate need only look at this paper to understand why I called it ‘sketchy.’ Fanti’s paper is a paragon of clarity by comparison. What I would like to see now is his actual results from the Shroud, in the same format as he presents the results for his other textiles, so that we can derive our own opinion from them..","date":"2013-04-19","mins":"7:18 am","url":"https://shroudstory.com/2013/04/19/fanti-et-al-paper-in-vibrational-spectroscopy/","cat":"news_&_views","title":"Fanti, et al. paper in Vibrational Spectroscopy"},{"id":"comment-93192","author":"hugh_farey","post":"Just as claims have been made that the C 14 area was not representative of the cloth as a whole, so Fanti’s samples, from fibres vacuumed away from the space between the shroud and its backing, and therefore the weakest and most damaged of the shroud, were also unrepresentative. As such, any dating made of them using their chemical or physical degradation would almost certainly arrive at a date considerably older – perhaps a thousand or more years older – than when the cloth they derived from was actually made..","date":"2014-03-25","mins":"5:02 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-92813","author":"hugh_farey","post":"Try this. Go to http://www.sindonology.org/shroud Scope/shroud Scope.shtml and use the red ‘Measure’ tool to find the distance between one of the knuckles and wherever you think the nailhole of the wrist wound is. (I make it about 6 7cm). Measure that same distance on your own hand, first from the knuckle along the back, and then from its opposite point on the front, palm, side. Anywhere near the wrist? Not on my hand..","date":"2014-03-24","mins":"6:33 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-29935","author":"hugh_farey","post":"It seems that Fanti thinks he has developed a new way of dating textiles, based on their mechanical deterioration. If this is true, it is a valuable finding regardless of any consideration of the Shroud of Turin. Instead of calling for Vatican peer reviewers, he might do well to remove all reference to the Shroud from his report, and submit his experiments with, and results from, his control samples alone to an appropriate archaeological journal..","date":"2013-04-08","mins":"6:14 pm","url":"https://shroudstory.com/2013/04/08/giulio-fanti-responds-to-some-of-our-comments-in-this-blog/","cat":"news_&_views","title":"Giulio Fanti Responds to Some of Our Comments in this Blog"},{"id":"comment-57271","author":"hugh_farey","post":"Sorry, Gian Marco, I see I typoed Rinalsi, and Paulette, above, Ronaldi! Our apologies, no doubt. Since you’re following this thread, can you say why Fanti did not think it necessary to correct the Raman Spectroscopy date considering the fire – you didn’t comment on it at the time (neither did he) but went straight on to the mechanical one?.","date":"2013-12-08","mins":"1:23 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57112","author":"hugh_farey","post":"Fanti’s book and the brou ha ha that came with it involved various more or less dubious means of dating old flax, including the highly controversial mechanical testing. After a while he published a paper in Vibrational Spectroscopy, in which all mention of the shroud and all his dating methods were omitted, except for FTIR spectroscopy. He subjected 12 samples of known age from 3000 BC to the present, and observed a noticeable progressive change in the spectra recorded. Flax, it appears can be shown to degrade with age. In ideal situations (permanent storage in a single place of constant environmental conditions) his findings suggest an ascertainable age band of 400 years, which might be narrowed if further ressearch was carried out. Although this method is unlikely ever to be better than C14 dating, it has the merit of being wholly non destructive. In more variable conditions however (and the Shroud springs inevitble to mind) this does not seem a promising line of research..","date":"2013-12-07","mins":"12:05 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57244","author":"hugh_farey","post":"I didn’t altogether follow one of Fanti’s responses to Rinaldi’s criticism of his book at the time, and re reading it, I don’t follow it now. To be fair to Fanti, I do not think he continues to press his new dating systems as relevant to the Shroud any more, although they may have value in other circumstances. The reponse I’m wondering about concerns an ‘adjustment’ made to the FTIR date, to ‘compensate’ for the 1532 fire. The original date of the FTIR analysis (p.90 of Il Mistero della Sindone) was 752 BC +/ 400 yrs. This was adjusted by adding about 450 years to arrive at 300 BC +/ 400 yrs, according to some experiments carried out by heating moden cloth. The original date of the Raman Spectroscopy analysis was 200 BC +/ 400 yrs. However, it was not felt necessary to correct this date: neither Fanti nor Rinalsi comment on it further. The third set of results, the mechanical deformation set, gave a range of five dates from about 750 BC to 900 AD, which were averaged to 400 AD +/ 400 yrs. Rinaldi thought that the 1532 fire was likely to have affected the mechanical strength of the cloth to an extent that this result should be adjusted accordingly, but Fanti said that experiments had shown that the effect of the fire was negligible in this case and also that “the effect of the fire was further reduced by the particular position from which [the fibres he studied] were collected.” I find both those statements strange indeed, considering he was using fibres hoovered up from between the shroud and the backing cloth..","date":"2013-12-08","mins":"9:54 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57114","author":"hugh_farey","post":"And well done, Tristan, for pointing out two newer papers which were unknown to me, one dealing with a machine for testing the mechanical parameters of single fibres of flax, and another hoping to establish that these too are dateably age related. Again, however, the method relies on constant known environmental conditions, and this method doesn’t even have the merit of being non destructive..","date":"2013-12-07","mins":"12:20 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-31372","author":"hugh_farey","post":"If I might return to the original article, I’m afraid it suffers from something the New Scientist (UK) magazine calls “quantum fruitloopery,” which is the tendency non scientists have to hope that the weird predictions of quantum physics (mostly the implications of duality) may be hauled in to explain any previously unexplained phenomena. It usually follows the line: “since quantum mechanics says that things can be in two places at the same time, therefore any observation of simultaneous appearance can be (or will eventually be) explained by quantum mechanics.” This is simply not true. This statement: “The risen body of Jesus conforms to the physical laws of something traveling beyond the speed of light. It can be at multiple places simultaneously, can pass through slow matter, can appear as it wills when it wills,” quite literally makes no sense..","date":"2013-04-20","mins":"5:17 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","title":"Why Giulio Fanti Matters"},{"id":"comment-939","author":"hugh_farey","post":"Oh dear. I’m afraid I’m not a very good scientist at all….. I suppose it’s because if I have a position and want to try to get others to agree, I like to try to understand their point of view first, and then undermine it. That way, they are more likely to come round to my point of view. The cold icy detachment of the ideal scientist, perhaps such as yourself, is not, I think, very common in any field, least of all one that impinges on deep seated religious convictions. Nevertheless, I wish you luck… (there, failed again…).","date":"2012-10-13","mins":"6:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/07/yet-more-fanti-sy-from-fanti-faccini-et-al-this-time-on-the-spear-so-called-wound/","cat":"crucifixion","title":"Yet more ‘Fanti-sy’ from Fanti, Faccini et al, this time on the spear so-called “wound”…"},{"id":"comment-937","author":"hugh_farey","post":"Thank you. I liked what you say about the difference of approaches. I tend to read an account, preferably one I disagree with, and ask myself why somebody might come to that conclusion, however flawed. Probably something to do with teaching children, who come up with some wacky ideas, but often based on some kind of weird logic. So I don’t begin with a tabula rasa, but ask myself, why does so and so think it’s blood rather than jam, and look for the flaws in the reason. If somebody says “that looks like a spear hole,” then (apart from the fact that to me it looks more like a cigar) I can see why he thinks so. I then ask, would there be more to the image of a wound than just its shape. If so, and there is no sign of it on the shroud, then it’s not a spear hole, whatever it looks like, but if a real wound mark would have the same composition as all the other smears around it, then we have not disproved that it is a wound on those grounds alone. Of course, if the blood turns out really to be jam, then the wound is disproved on other grounds..","date":"2012-10-13","mins":"1:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/07/yet-more-fanti-sy-from-fanti-faccini-et-al-this-time-on-the-spear-so-called-wound/","cat":"crucifixion","title":"Yet more ‘Fanti-sy’ from Fanti, Faccini et al, this time on the spear so-called “wound”…"},{"id":"comment-935","author":"hugh_farey","post":"Do you pick up comments on older posts? I do hope so. I’m finding it difficult to read your blog in detail from start to finish as I keep getting distracted and having to look things up elsewhere! The marking on the shroud referred to above has an upper left edge which is different from the other edges, if so they may be termed. The upper left edge has a distinct slightly elliptical curve, each end of which terminates in an abrupt, almost right angular corner. The edge is quite distinct (although it has a lighter coloured fringe), and the area below it is darker than the rest of the alleged stain, in an approximate cigar shape which some have likened to the cross section of a spear. The left hand edge is also very distinct, but does not have a regular shape, and the rest of the stain has patches of light and dark which could be interpreted as twisted rivulet shaped, even if they aren’t actually anything of the kind. I’m not sure about your identification though. If I’m right, you are not denying the existence of the distinct (possibly spear shaped) section, but you are saying that it is not qualitatively different from the rest of the stain. What I’m wondering is what sort of difference might be expected if it WAS a wound. Would laying a sheet over a stabbed body be able to differentiate between the source of some gore and the oozings derived from it? When you say “There is no spear wound,” are you suggesting that there was not even an intention to represent a spear wound, or simply that the whole marking is made of the same materials. Does that observation OF ITSELF prove that no wound existed?.","date":"2012-10-13","mins":"11:15 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/07/yet-more-fanti-sy-from-fanti-faccini-et-al-this-time-on-the-spear-so-called-wound/","cat":"crucifixion","title":"Yet more ‘Fanti-sy’ from Fanti, Faccini et al, this time on the spear so-called “wound”…"},{"id":"comment-1519","author":"hugh_farey","post":"I’m sorry if the experiments look as if they were done on a bit of old floorcloth! The stripy patterns, particularly on the visible light photographs, are due to moire interference which is sometimes inevitable when compressing a photo for the web. The cloth is actually an ordinary 1/1 weave. Perhaps I should also say that all the photos were taken without flash, but the UV ones were exposure enhanced to the maximum allowed in i Photo..","date":"2012-12-19","mins":"3:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/19/guest-posting-from-hugh-farey-yipee-another-science-bod-heres-a-snapshot-of-his-current-studies-of-scorching-and-uv-fluorescence/","cat":"hugh_farey","title":"Guest posting from Hugh Farey (yipee – another science bod!): here’s a snapshot of his current studies of scorching and uv fluorescence."},{"id":"comment-1552","author":"hugh_farey","post":"Well, it may be all explained in Pellicori and Miller 1981. Thibault, where art thou at this time?.","date":"2012-12-22","mins":"10:58 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/19/guest-posting-from-hugh-farey-yipee-another-science-bod-heres-a-snapshot-of-his-current-studies-of-scorching-and-uv-fluorescence/","cat":"hugh_farey","title":"Guest posting from Hugh Farey (yipee – another science bod!): here’s a snapshot of his current studies of scorching and uv fluorescence."},{"id":"comment-1549","author":"hugh_farey","post":"Gosh. I find The Van Haelst article extraordinarily difficult to read. However, this quote is interesting: “The burn marks of 1532, caused by a CLOSED fire, with a lack of oxygen, [which we now dispute – HF] reflect a dark REDDISH colour.” I wonder if this is in turn from Pellicori’s paper, or was he at the 1978 investigation? I ask because a dark reddish colour is in fact what you see if a cloth does not fluoresce at all, and is caused by the dark red visible light that is inevitably part of an ultra violet lightbulb, however well shielded. Maybe the whole pink fluorescence thing is a myth?.","date":"2012-12-22","mins":"10:40 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/19/guest-posting-from-hugh-farey-yipee-another-science-bod-heres-a-snapshot-of-his-current-studies-of-scorching-and-uv-fluorescence/","cat":"hugh_farey","title":"Guest posting from Hugh Farey (yipee – another science bod!): here’s a snapshot of his current studies of scorching and uv fluorescence."},{"id":"comment-1545","author":"hugh_farey","post":"Well, I started experimenting in about 1978, so there have been a few, but I think the single thing that started me off again after a long pause – and made me use the shroud as an inspiration for children – was Guerreschi’s and Salcito’s discovery that the water stains didn’t match the burn holes; so obvious that a child could have noticed, and yet unobserved for so long even on the ‘most studied artifact in history’ as it’s sometimes called. It just made me want to question everything, and try to notice something of my own that nobody else has spotted! Latest news – I soaked a piece of linen in soapy starch and hung it to dry on a bush, then dropped it over a bas relief over which I’d poured a weak ammonia solution, roughly a la Rogers. For a start the contact places just absorbed the liquid into big round splodges (I think Roger’s only used vapour), and for a second there was absolutely no change in colour when the cloth dried out. But here’s the killer, on warming the cloth gently afterwards, it did go slightly brown – AND FLUORESCED JUST LIKE A SCORCH! Ho ho ho, how I laughed… I tried emailing Thibault with the address you gave me but I don’t think it can have worked, so if you’re reading this Thibault, mine is hughfarey (at) hotmail (dot) com. And finally. Quite by accident I labelled a piece of linen with a different pen today, and guess what – pink fluorescence all round the edges! On the off chance that maybe the pink on the shroud was actually formed by an organic solvent rather than heat, I tried a few I had in the lab, with no success, and even set fire to a piece of pine and then smothered it with cloth, hoping the resin might make it fluoresce pink. No joy yet, but I’ve a few things still to try. Maybe the nuns tried gluing the scorched fabric together before they patched it?.","date":"2012-12-21","mins":"11:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/19/guest-posting-from-hugh-farey-yipee-another-science-bod-heres-a-snapshot-of-his-current-studies-of-scorching-and-uv-fluorescence/","cat":"hugh_farey","title":"Guest posting from Hugh Farey (yipee – another science bod!): here’s a snapshot of his current studies of scorching and uv fluorescence."},{"id":"comment-44530","author":"hugh_farey","post":"Thank you, Dan. Taking the bull by the horns, so to speak, may I say that I shall be contacting as many of the members of the BSTS as I can on the off chance that, even if their interest in the shroud is only peripheral, they may have areas of expertise which could inform those of us who are more interested in the shroud but have less expertise at our fingertips. Chemists, Art Historians, Hand Loom Weavers, Nuclear Radiation Physicists, Geologists, Theologians – I’ve got lots of questions! From this blog’s point of view, I have become familiar with many of your specialist fields (well, more specialist than mine, anyway), but don’t know if you are members of the BSTS, or would think of becoming one, and enjoy composing an article for it. Can you get a personal message to me via this site? You could aways go through Dan, initially, I suppose. (Now I must go and re read Mark Guscin’s “The Role of An Editor” in the latest edition…!).","date":"2013-09-17","mins":"12:14 pm","url":"https://shroudstory.com/2013/09/17/hugh-farey-takes-over-as-bsts-newsletter-editor/","cat":"news_&_views","title":"Hugh Farey Takes Over as BSTS Newsletter Editor"},{"id":"comment-1737","author":"hugh_farey","post":"I have replied to Thibault be email, so that I could include more photos, but the essence is: Yes, Photo 5 is at X1000. But, I now think the plank like blocks are actually groups of hundreds of microfibrils, possibly called mesofibrils, as illustrated in a SEM photo of a flax fibre fracture at http://www.sciencedirect.com/science/article/pii/S1359835 X02000404. I am puzzled that my photos and the SEM photo show no sign of primary cell walls, and do not look that very fortuitous photo of a torn ‘sheathed cable’ appearance illustrated by Fanti. It’s almost as if I am using a different kind of fibre altogether – although it is certainly linen. Very curious..","date":"2013-01-15","mins":"11:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1708","author":"hugh_farey","post":"Nomenclature can be a bit of a problem. I’m using the word thread to mean the product of spinning flax fibres together, the thing with the Z twist in it. Threads very rarely get pulled off cloth samples by sticky tape unless they are very short (from a cut sample) or very damaged. Fibres are what the threads are made of, and appear to be the product of whatever treatment flax plants are given to turn them into something spinnable. They can be of different thicknesses. Photo 5 is the end of one of these fibres. Fibres, according to http://www.agrofibrecomposites.com/process.htm, are made of ‘elementary fibres,’ which in turn are made of microfibrils. Adrie: thanks for that. I’ve been trying to get hold of a copy of the Orphaned Manuscript but so far without success. Italy is a bit slow in postal delivery! Do you happen to know if the ‘ghosts’ were examined between crossed polarisers? That would establish whether they were bits of degraded flax, or an added coating..","date":"2013-01-14","mins":"11:05 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1715","author":"hugh_farey","post":"Aaaaaah! (Sound of penny dropping). So I thought the things people spun with were “bast fibre bundles,” but actually they had been separated in the retting process and are in fact individual or ‘elementary’ fibres. Got it at last. Revised caption to photo 5… 5) End of a single scorched fibre showing broken microfibrils – X1000.","date":"2013-01-14","mins":"6:50 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1703","author":"hugh_farey","post":"1) Sticky tape sample of scorched linen between crossed polarisers – X40 2) Sticky tape sample of fresh linen between crossed polarisers – X40 3a) Scorched part of single fibre – X400 3b) Unscorched part of the same fibre – X400 4) Sticky tape sample of scorched linen (as photo 1) in transmitted light – X40 5) End of a single scorched fibre showing broken ‘elementary fibres’ – X1000.","date":"2013-01-14","mins":"9:39 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1701","author":"hugh_farey","post":"I neglected to mention that the fourth picture (fibre bashed to bits) is at 1000 X. It is those little broken plank like pieces that come off and stick to the sellotape making the little patches of brown lines in the previous 40 X picture..","date":"2013-01-13","mins":"8:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1696","author":"hugh_farey","post":"My microscope doesn’t have polarised filters either but I happened to have a couple of squares which I simply piled above and below a slide. What I can’t easily do is rotate them. You can get them from sciencestore.co.uk for £6 or so, but to my surprise, as we started the Lent term several children returned with what looked to me like comic plastic spectacles. They were from 3 D cinemas, and as the children had no use for the lenses, they had just pulled them out and threw them away! Luckily I managed to retrieve a few. Just as a control, yesterday I smeared some gravy browning (sorry, ‘ammonia caramel’) onto some linen, let it dry and stuck sellotape on it. Sure enough the colour came away, but the little patches do not shine in crossed polarisers. Finally, the papers last week were full of a new portrait of Kate, Duchess of Cambridge, full face, with a very dark background. By superimposing it, with a bit of stretching, onto the Enrie negative, it is easy to prove conclusively that she is a direct descendant of Jesus and probably has a glass of wine from the holy grail every evening with Leonardo da Vinci. Remember you saw it here first….","date":"2013-01-13","mins":"9:57 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1728","author":"hugh_farey","post":"And their diagram bundles the microfibrils into mesofibrils, and then the mesofibrils into elementary fibrils. Confusing….","date":"2013-01-15","mins":"10:54 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1726","author":"hugh_farey","post":"Thanks for the link, Adrie. However (and I’m aware I’m going out on a limb here: my knowledge of the microstructure of linen is entirely superficial…) I’m not sure Fanti et al have interpreted their pictures in exactly the same way as I do, although the effect is perhaps the same. My understanding, based on the agrofibrecomposites site which I have mentioned above, is that the structure of a fibre is more complex than a simple ‘PCW – SCW – Lumen’ model, in that the “inner cellulosic material” of the SCW is not amorphous, but itself divided into ‘microfibrils,’ which are the things which have broken up into the rectangular sections we see on Fanti’s photo. I don’t know if each of the microfibrils has a PCW of its own (but presumably they have some kind of structure), and I don’t know if the whole fibre is sheathed in its own cell wall of some kind. It seems to break up quite readily when heated. So where Fanti sees a single thin PCW layer coating a thick amorphous SCW with a hole in it, I see a bundle of a dozen or fewer microbrils. Where his PCW is torn away like peeling paint to reveal uncoloured SCW, I see fragments of microfibrils broken away to reveal other microfibrils, which are uncoloured. I don’t think the overall effect of the image, or the mechanism of its appearance, would be very different in either case. Having said that, one of Fanti’s threads (Photo 9 and particularly 10 in your link) looks so exactly like a torn PCW sheath around an amorphous core that I am given pause, as they say! I will have to start stressing some more fibres to see if I can achieve the same result, coloured or uncoloured..","date":"2013-01-15","mins":"10:06 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1722","author":"hugh_farey","post":"The ‘locally degraded image layer’ photos in Adrie’s first reference, from a shroud image fibre, are quite consistent with a light scorch. The fibre has been broken into those plank like fragments of microfibril illustrated in my own photo above, some of which have broken completely away, to leave that gap. The reason the gap is not coloured is not, of course, anything to do with the lumen. It’s an empty space, and empty spaces can’t be coloured. No, the reason the gap is not coloured is because either the microfibrils underneath it are uncoloured (and I find with light scorches that there is no need for them to be), or there are no microfibrils there; after all, this fibre was presumably torn off the shroud, and the tape need not have removed the fibre in its entirety. We are told how easily these tapes came away; this was because the image fibres were sufficiently degraded to break away rather than having to be pulled out like the non image fibres. The picture of the fibre degraded by coronal discharge was formed, we are told, by ironing the cloth. That’s what I call a scorch. I can understand that it may be that a CD predisposes cloth to scorch at a lower temperature than usual, as may coatings of sugar or starch, but to my mind, brown marks made by ironing = scorches. As for the ghosts – Is that rather grey, rather grainy photo of two smooth trenches in the sellotape glue the only photo we have of them? I know how different a photo can be from what is actually observed through the eye piece, and don’t deny Rogers’s or Adler’s observations, but if that is all the evidence we now have – well it’s not much to go on, is it?.","date":"2013-01-14","mins":"11:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1713","author":"hugh_farey","post":"No, I think photo 5 is an ‘unqualified’ fibre, and the broken plank like thingies are bits of ‘elementary fibre.’ I think you’d have to go to SEM for microfibrils. I think fibres, elementary fibres and microfibrils all break just anywhere if sufficiently degraded, which these are. You’ll have seen my response to Adrie on shroudstory. I’ll send Dan a couple of blow ups of Rogers’s photos, and maybe a couple of my own for comparison..","date":"2013-01-14","mins":"5:30 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-49412","author":"hugh_farey","post":"The only actual test I can find being proposed anywhere is “multispectral imaging,” which is what was carried out in 1978. I dare say it could be done a good deal better with current technology, but to wrap it up in flimflam like “if molecular and atomic technology were applied to the Shroud…” seems disingenuous to me. Or am I missing something?.","date":"2013-11-01","mins":"5:27 am","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","title":"Press Release:  Marino Endorses Antonacci Petition and Proposal"},{"id":"comment-213565","author":"hugh_farey","post":"“They are really there.” I fear I am of a different opinion..","date":"2015-10-25","mins":"11:31 am","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-213613","author":"hugh_farey","post":"I think the difference between pareidolia and a true representation is that a representation is intended to resemble, or has been made by, the reality it depicts. A painting of the Mona Lisa looks like the Mona Lisa, and a shadow on a wall looks like the tree that caused it. The man on the shroud either left a representation of himself – consciously or unconsciously – or was depicted by an artist who wanted to create an image of that man. On the other hand a cloud which looks like an elephant is a pareidolia, and the shadow of a tree that looks like an octopus is another. If the teeth on the Shroud were caused in some way by actual teeth, then they are not pareidolia, but accurate observation. If they are mere artefacts of the imperfections on the cloth, then they are pareidolia. The image of the man is not pareidolia unless it is a random collection of discolourations which coincidentally resemble a man. The fact that an image is made of halftone dots, paint or photographic emulsion does not make it pareidolia, in my opinion..","date":"2015-10-26","mins":"3:23 am","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-213576","author":"hugh_farey","post":"Yes, I see your interpretation. I personally don’t think it is anything but pareidolia, but I dare say others agree with you..","date":"2015-10-25","mins":"3:26 pm","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-213568","author":"hugh_farey","post":"Nor me! It was an attempt to relate some real teeth to the markings on the Shroud, but it didn’t work. Can you do something?.","date":"2015-10-25","mins":"12:06 pm","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-175078","author":"hugh_farey","post":"You are far from alone, and there is reasonable evidence for your belief. I, on the other hand, am not able to accept the authenticity of the Shroud. I too, am far from alone, and there is reasonable evidence for my belief. One day, perhaps, sufficient strength of evidence will be accumulated to change one of our minds. I do hope it will be mine that changes!.","date":"2014-12-07","mins":"6:11 am","url":"https://shroudstory.com/2014/12/07/a-response-to-the-critical-summary-presentation/","cat":"uncategorized","title":"A response to the Critical Summary presentation"},{"id":"comment-213433","author":"hugh_farey","post":"The photos do indeed have a slight difference of orientation, and cannot be directly superimposed, but attempting to claim that a crease which clearly isn’t there actually might be is grasping at straws. The crease above the disputed one is clearly identifiable in both photos, as is the one across the top of the head. What’s more, these creases are quite clearly more pronounced in the Pia photo than on the Enrie. The reason for this is evident both by looking at the Pia photo closely, and also by noticing the the Pia photo is slightly wider with respect to its length than the Enrie. It is because Pia’s Shroud is visibly quite badly wrinkled all over, while Enrie’s has been brushed, pulled or stretched slightly to remove all those minor wrinkles. In spite of that, a new crease is boldly evident in 1931 that is not evident in 1898..","date":"2015-10-23","mins":"1:03 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213366","author":"hugh_farey","post":"It’s a shame that this blog is not read more carefully. Although it is full of opinions and discussion, from time to time something appears which is easy to check and which refutes previous arguments. For instance, pages 16/17 of this paper is devoted to a comparison of the Enrie negative with a Justinian solidus, with special attention being paid to “a subtle double fold in the cloth just below the neck”. It is easy to check that this fold, subtle or not in the Enrie photo, simply isn’t present in the Pia photo, and was therefore an artefact acquired between 1898 and 1931. Any resemblance to a Byzantine coin is entirely coincidental..","date":"2015-10-22","mins":"3:38 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213439","author":"hugh_farey","post":"I guess it’s more subjective than I thought. The Pia negative is criss crossed with creases all of which have been smoothed out by the time Enrie took his. The two most prominent creases in the Pia negative have been considerably weakened by the smoothing process. How curious that a crease previously invisible has been suddenly clarified. Doesn’t work with me, but I do appreciate that others have a different view. And yes, I’m a lot of fun in a classroom!.","date":"2015-10-23","mins":"1:46 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213426","author":"hugh_farey","post":"Enlarge! Enjoy!.","date":"2015-10-23","mins":"10:51 am","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213682","author":"hugh_farey","post":"“The fall through hypothesis fits the data of the image characteristics.” Well, of course. The trouble with the fall through hypothesis is that, being imaginary, its parameters can be adjusted so that it fits whatever observations we want. If a critic were to say that the instantaneous disappearance of 70kg of mass would create a sudden large vacuum which would suck the shroud into a screwed up ball in the middle, then we simply have to invent a physics in which that doesn’t happen. If he says that the energy emitted by such a disappearance would exceed that produced by several megatons of nuclear bomb, vaporising the Shroud and most of Jerusalem with it, we simply invent a physics in which that doesn’t happen either. All we need is for a “body wrapped in the Shroud to become volumetrically radiant […] and simultaneously mechanically transparent, thus offering time decreasing resistance to the cloth as it collapsed through the body space.” Simples. Made up physics can explain anything..","date":"2015-10-27","mins":"4:16 am","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-162311","author":"hugh_farey","post":"I think ‘contamination’ in this case is extended to included any non 1st century material. If everything was as obvious as John makes out, then the problem would be resolved and the C14 date discredited by all and sundry, but unfortunately it isn’t. It is easy to calculate the amount of carbon which needs to be added to a 1st century textile in order to skew the date towards the 14th century, and none of Rogers’ discoveries come close. The easiest way would be to sprinkle soot on the cloth. As cloth is only about 40% carbon, and soot is 100% carbon, only a small amount would be required. I forget the exact proportion, perhaps about 15%, which unfortunately would be turn the cloth black. Adding a transparent or similarly coloured compound would be best, but, as the proportion of carbon in such a compound is so much less, a correspondingly greater amount would be necessary. As has often been shown, at least 60% of the fabric would have to be modern in order to produce the required skew. This has not been demonstrated by Rogers or anyone else. Jackson is correct on that point. With John’s latter five paragraphs, I am entirely in accord..","date":"2014-10-14","mins":"7:51 am","url":"https://shroudstory.com/2014/10/14/dj-vu-squared/","cat":"critical_summary","title":"Déjà vu Squared"},{"id":"comment-164333","author":"hugh_farey","post":"“Why should the Shroud have uniquely survived?” This is a fair question; one which I asked a few posts ago and one which Charles gave some possible answers to. The Shroud was indeed a “primus inter pares.” He suggested that if any of a multitude of similar ritual objects had become associated with a specific miracle, then that would accord it the very special status John was looking for. My own ideas, that it had moved from an area where Quem Quaeritis rituals were common to a place where they were unknown, or that it resurfaced years after the rituals had ceased to be practiced, do not seem to me unreasonable either. Nevertheless, although Charles has placed the Shroud quite neatly within a ritual and even artistic context (the rise of ‘whole body’ flagellation imagery being an example), he is as aware as anybody – perhaps more so as I’ve no doubt he has looked more assiduously – that there are no comparable double imaged, paint flaked off cloths to push his argument beyond dispute. There is no point in attempting to refute his argument by demanding one. All you can do – and it’s a perfectly valid point – is to say that the lack of contemporary material convinces you that he is wrong. John also has a perfect right to demand references for things like “inventories listing shrouds.” However it seems that History today, although it demands references from its authors, has the custom of not printing them. Perhaps it enjoys stimulating controversy, or perhaps it thinks that, as some articles would have longer lists of references than the articles themselves, the content of each edition would be too restricted to be of general interest. Perhaps, after the article has arrived at the kiosks, Charles will post a link to his sources..","date":"2014-10-21","mins":"9:06 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-163977","author":"hugh_farey","post":"Because the whole thing was nothng more than a theatrical prop, perhaps? I too, find the whole creases thing less than convincing. I have never seen any good “raking light” photos that demonstrate these creases, although they are frequently mentioned in this connection, and am certainly not aware that creases in fact have any particular longevity. The only creases that we can be certain of (because of the 1532 fire) were almost indistinguishable even before the 2002 restoration, and the creases from when the shroud received its big diamond pattern water stains have completely disappeared. Creases no doubt came and went whenever the shroud was rolled and unrolled, and being roughly transverse, any selection could be selected to fit in with some kind of lifting gear. It seems that the elaborate design put forward by Jackson was mostly to account for a mass of closely spaced creases he observed around the ventral groin area, but lifting a cloth out of a box doesn’t require anything half so elaborate, even if it was by a hidden mechanism so that the operators were invisible..","date":"2014-10-20","mins":"5:16 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-213688","author":"hugh_farey","post":"It was Heller and Adler’s finding that whereas ‘image’ fibres were ‘corroded’, ‘blood’ fibres were not ‘corroded.’ That’s all. Not: “These experiments revealed that there was no image beneath the blood or beneath the blood serum at the boundary of the tested bloodstains. The image colour was found to terminate consistently at the boundary of the bloodstains.” It was Heller and Adler’s conclusion that the process of creating the image corroded the fibres of the Shroud, and that therefore that process had not occurred in the region of the bloodstains. Later Rogers disagreed with them, and in this respect agreed with Mc Crone, that the image was formed on something covering the fibres, and that there was no corrosion of the fibres themselves. It is my contention that any fibres from a bloodstained area could all be considered ‘blood’ fibres, as the blood soaked all over and through the cloth, whereas, even if there were image beneath the bloodstains, only a tiny proportion could be considered ‘image’ fibres as the image formed only on the very outer fibres of the crowns of the warp threads. The chances of a randomly selected fibre from such an area being an ‘image’ fibre at all are thus very slight, even if there is actually image under the blood. Furthermore, the blood has largely eroded from the top surface of the shroud, from exactly the place where the image and the blood could have coincided, and ‘blood’ fibres are more typically found in the weft ‘valleys’ where there is no image anyway. The UV images show a pronounced halo of ‘serum’ around the tip of a fingerlike bloodstain emerging from the wrist wound, and another along the top edge of the spear wound. (There are others, of course). However, there in no change in colour or intensity between the ‘serum’ areas and the adjacent ‘image’ areas when viewed in visible light. If there is no image beneath the serum then the colour of the serum exactly matches the colour of the image – an extraordinary coincidence that I don’t believe. See below. The Critical Summary goes on to claim that “These findings support three (3) important conclusions.” The first is that the blood must have arrived before the image. I don’t agree that it must have been, for the reasons outlined above. The second is that there is no evidence of artistic materials on top of the bloodstains. This conclusion is not based on the evidence above (about corroded fibres), and is not true, as both red ochre and vermillion were found, both by Heller and Adler and Mc Crone. This is evidence. It may be discounted or explained away, but to claim that there is no evidence is simply wrong. The third conclusion is that there is no ‘major damage’ to the bloodstains. This also is nothing to do with the corrosion evidence cited above, and is also highly disputable. What on earth constitutes ‘damage’ to a bloodstain? I think the authors mean that the bloodstains are not smeared, which shows only that they were dry before anything in contact with them was moved. They do show a fair amount of abrasion and flaking off, which to my mind is just about the only ‘damage’ a bloodstain can sustain. There is some suggestion that an artistic rendering of the image is ruled out by the lack of ‘damage’ to the ‘blood’ (…”resulting from an artistic effort to create the colored image fibres.”), a comment which makes no sense to me..","date":"2015-10-27","mins":"5:49 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213903","author":"hugh_farey","post":"That’s very generous of you, Antero. Thank you..","date":"2015-10-30","mins":"4:33 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-214406","author":"hugh_farey","post":"It is implied throughout the mention of iron in their Chemical Investigation paper, beginning with the Abstract: “Although Iron in several forms is found over the whole cloth Its distribution is shown to be accounted for by natural processes.” They spend some time discussing the presence of iron as a heme derivative in the bloodstains, and, after producing their own khaki, say: “The uncoated fibrils (non image, image, and water stain) all give relatively strong positive tests only for Ca and Fe, except for those from the inside of the water stains which give somewhat weaker, though still definite positive reactions.” This iron is regarding as having derived from the retting process. As to the uniformity of the iron except in the bloodstains and watermarks, they say later: “We found the calcium to be uniformly distributed over the tape sampled Shroud areas, while the iron, though also ubiquitous, was enhanced in the blood image areas and concentrated in the margins of the water stains. This is consistent with the X ray study(l5) which showed a uniform concentration of the iron in the image and non image areas, but enhancement in the areas of blood marks.” The uniform concentration described is not reconcilable with Morris’s findings..","date":"2015-11-08","mins":"3:46 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-214217","author":"hugh_farey","post":"I do not know how precisely the areas used for the X ray fluorescence coincide with the areas used for the light intensity, and do not think that the two graphs are necessarily mathematically comparable. In general, however, the darker nose and hair have higher iron contents than the lighter space between the cheeks and the hair. Interestingly, though, taking your examples, the light intensities of areas 5 and 8 appear to have values of 137 and 133. 133 is 1.5% lower than 137. The iron values given by Morris for these areas are 10.6 and 9.6. 9.6 is 11.9% less than 10.6. In other words your statement “the color is very different but the iron content is almost the same” is in fact exactly the contrary. However, whatever iron may be found across the image, this is still in contrast to Heller and Adler’s contention that the iron content was uniform across the Shroud (due to retting) except in blood areas and water stain margins..","date":"2015-11-04","mins":"6:11 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213720","author":"hugh_farey","post":"Ah. I understand what you mean now; thank you..","date":"2015-10-27","mins":"6:28 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213768","author":"hugh_farey","post":"Aw; that’s a little unfair. The opening words of Chapter 13 of John Heller’s book “Report on the Shroud of Turin” are “We had now found iron oxide and mercury sulphide. Both are pigments used by artists. Both are red.” For you to claim: “this is simply not true” is a harsh criticism of John Heller. It is true, and it is evidence. (and the last sentence of the precious chapter refers to a crystal of cinnabar as vermilion) What you failed to quote from my comment was: “It may be discounted or explained away, but to claim that there is no evidence is simply wrong.” And indeed, both you and Heller devote some time to discounting the evidence, which is fair enough. However, there are discrepancies in the discounting, the resolutions of which which are matters of opinion. Heller decided that he couldn’t find any more cinnabar, while Mc Crone decided that he could find quite a lot. Without going back to the tapes ourselves, we cannot determine the truth of either of their conclusions. Heller (and Adler) found three forms of iron oxide, one of which “the chelated form” was found throughout the Shroud and supposed to be part of the retting process; another, the “heme bound form” is attributed to decayed blood, and the last, Fe2 O3 (red ochre), was found “primarily in the water stain margins and charred blood areas indicating that it only constitutes a very small percentage of the total iron forms found on the Shroud.” Mc Crone disputes this, and finds particulate iron oxide on all image fibres, but not on background fibres. However, in his “X Ray Fluorescence Investigation of the Shroud of Turin”, R.A.Morris found a direct correlation between image intensity and iron concentration, from 16.8ug/cm2 on the nose to 9.6ug/cm2 in the imageless space between the cheek and the hair. This is in direct contradiction to Heller’s conclusions, and agrees with Mc Crone. You may, of course, be correct, and even if you’re not, you are entitled to put your point of view, but a point of view is not evidence. Nor proof. To claim that Mc Crone’s conclusions were proven wrong (or even PROVEN WRONG) is not true. The particles of red ochre and vermilion may have derived from paintings placed on the Shroud, but this is not proven either. The fact that you, and many others, are convinced that the Shroud is not a painting does not of itself discount the evidence suggesting that that it is, and it certainly doesn’t mean that the evidence doesn’t exist..","date":"2015-10-28","mins":"3:07 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213856","author":"hugh_farey","post":"Quite right, Antero, my mistake; I should have written ‘iron’ instead of ‘iron oxide’. As for Thibault’s paper, he must argue for himself. It seems to me that he shows well that where image intensity is dark, iron content is high, and vice versa (points 1,2,7,8,9 and 10). Where image intensity is medium, so is iron intensity (3,4,5,6). And how I agree with you in inviting “commenters on this blog to draw their own conclusions.” ps. I’m not a Doctor..","date":"2015-10-29","mins":"2:42 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213867","author":"hugh_farey","post":"Thanks OK! I may be one day!!.","date":"2015-10-29","mins":"5:42 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-131706","author":"hugh_farey","post":"Hi Joe, have a look at http://www.shroud.com/78papers.htm..","date":"2014-06-20","mins":"11:03 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","title":"John Jackson Presentation at a Roman Catholic in 2002"},{"id":"comment-132310","author":"hugh_farey","post":"There’s quite an interesting comment at the end of Part 1, where Jackson demonstrates that the spectrographic data from the inage is indistinguishable from that of the scorches. He says (from 56:42): “What you find is that when you compare a reflectance curve for the body image … with the scorched areas from the 1532 fire, that within the precision of the experiment … the variation of those two curves compared to one another is basically indistinguishable. We even see the same hump repeated at about 425nm over here. This is very strong presumptive evidence that the chemistry of the body image is indeed like … the linen of the Shroud when it is scorched, when it is thermally discoloured; like taking a hot iron and putting it on the cloth and discolouring it.” So, in 2004, Jackson thought the image chemistry was that of a scorch. Hmm..","date":"2014-06-22","mins":"12:31 pm","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","title":"John Jackson Presentation at a Roman Catholic in 2002"},{"id":"comment-132465","author":"hugh_farey","post":"My personal opinion is that the blood stains are made of blood. I do not find them a problem for either the authenticity or the non authenticity case. However the formation of the image from a dead body is at least as problematical, if not more so, that the formation of the image by artificial means. The trend among those who contemplate a 13th century possibility (even if they actually believe the Shroud to be authentic) seems to be towards a chemical scorch, possibly by the application of a hot object, although that hypothesis seems to be weaking, or by heat generated from a chemical reaction, currently being discussed, or by a long term interaction between cloth and some applied substance (paint/glue or similar) which has since been removed. The dead body proponents, such as yourself, not only have to produce a chemical explanation, such as the post mortem gas or lactic acid emission and its reaction with something on the surface of the cloth, but also to explain how this gas moved exclusively in a vertical direction, and did not spread out having reached the cloth. This has never been satisfactorily addressed, even by Roger’s. Whose attempt was, even by his own admission, somewhat speculative. Furthermore, the dead body proponents have to explain the contact/distance dichotomy, the pose of the dead man and the configuration of the Shroud over him. These have been addressed in some detail by various people, but not, so far, sufficiently coherently to provide a satisfactory demonstration that the image was in fact made by a dead body..","date":"2014-06-23","mins":"3:38 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","title":"John Jackson Presentation at a Roman Catholic in 2002"},{"id":"comment-132463","author":"hugh_farey","post":"I didn’t find the earlier comment particularly new – it was typical of many things often said about the Shroud by the STURP team. However it adds to the interest of the later remark, don’t you think?.","date":"2014-06-23","mins":"3:20 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","title":"John Jackson Presentation at a Roman Catholic in 2002"},{"id":"comment-214154","author":"hugh_farey","post":"It does look good, doesn’t it; but there are dozens of these coins about, and it is worth looking at them as a whole before deciding that any particular bump is more than wear and tear or an irregularity in the mould. This one: http://www.ancientresource.com/images/gold/christ gold 18474b.jpg, has a bump on the other side, for example, but most of them have no bumps at all..","date":"2015-11-03","mins":"3:24 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-214143","author":"hugh_farey","post":"“An exact match to the “3” blood mark on the forehead of the Shroud man.” I really cannot see such a match however hard I examine enlargements of the coins above. Can anyone help? And, is it perverse of me to think that Constantine himself probably did not design the coins personally?.","date":"2015-11-03","mins":"10:46 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-22991","author":"hugh_farey","post":"“There are other water stains on the shroud that are known to be much older [than 1532] because they appear on artistic drawings of the Shroud made before the 1532 fire.” Is there a shred of truth in this? I am aware of one painting of Christ whose concave abdomen resembles one of the water stains, but ‘drawings of the Shroud?’ Not that I’m accquainted with..","date":"2013-01-29","mins":"1:23 pm","url":"https://shroudstory.com/2013/01/29/paper-chase-new-the-shroud-a-critical-summary-of-observations-data-and-hypotheses/","cat":"news_&_views","title":"Paper Chase (NEW): The Shroud: A Critical Summary of Observations, Data and Hypotheses"},{"id":"comment-164352","author":"hugh_farey","post":"That’s excellent Mike, just what I was thinking of. These are valley folds with respect to the image side of the cloth, while the others are mountain folds, as we can see by the light and dark edges. They do not obviously connect in the middle, but the inference is clearly there. I shall certainly attempt to pursue this if I can..","date":"2014-10-21","mins":"10:57 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-164652","author":"hugh_farey","post":"Right! Some thorough investigation later. I’m sorry to rain on everybody’s parade, but Mike’s “valley fold” creases date from 2002 and no earlier. They were not easy to observe before 2002 as they weren’t there at all. They are regularly spaced and do not meet in the middle, extending only as far as the longitudinal scorch lines about a quarter of the width in from the edges. They do not coincide with John Jackson’s supposed lines as sketched in his paper. What they do coincide with, all of them, exactly, without exception, are Mechtilde Flury Lemberg’s new stitching of the new backing cloth to the shroud, whose threads are clearly visible on Shroud 2.0. Looking carefully at the BBC video at high magnification, you can even see zig zag marks across these ‘folds’, showing a certain amount of ‘slumping’ as the Shroud was held in a vertical plane. There are ten such lines of stitching, irregularly spaced along the length of the cloth, and none of them crossing the cloth within the scorch lines. They are nothing to do with any ancient lifting machanism. That does not, of course, mean that I have discredited Jackson’s fold hypothesis entirely. He relied on different supposed creases, in different places. However, his creases still seem to me to be partial width, curved, and most probably due to rolling up the Shroud, stitched to its backing, around a pole (where, obviously, the inside cloth would have to wrinkle, having a smaller radius of curvature)..","date":"2014-10-22","mins":"12:01 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-164671","author":"hugh_farey","post":"Leaving no stone unturned… Jackson’s elaborate jack in the box hypothesis is thoroughly described, and depicted, in the ‘In the Belly of the Beast” post previous to this one. Folding a piece of paper to match his picture, the folds can be described, from the toe of the dorsal image to the toe of the ventral image, with the image facing us. Using Jackson’s letters as labels, and “M” or “V” to describe mountain or valley folds, we have: A M, B M, C V, D1 M, D2 M, E M, F1 V, F2 V, F3 V, F4 M, G V. Now we can attempt to identify whether the creases he observes in the shroud actually are as described, both by using his own (Vern Miller’s) photos, and where available (as coverage is not complete) those on the video heretofore referenced. Sadly, Miller’s photos are not clear enough to be helpful. All the folds look like mountain folds to me, but I would not swear to more than a few of them. However, we can use these as a reference for the video. In that, A M, B M and C V are visible, and then there is no film until a still at F, where all the folds are all clearly mountain folds (F1 M, F2 M, F3 M, F4 M) when three of them should be valley folds. Mike’s still above, incidentally, shows fold B, almost exactly half way between his boldly labelled ‘Fold marks.’ Given all this, and the fact that the creases are all short and mostly curved, I am satisfied that Jackson’s lifting mechanism hypothesis is not confirmed by observation..","date":"2014-10-22","mins":"1:20 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-164147","author":"hugh_farey","post":"Good for the readers of this blog. I have now studied two ‘raking light’ photos, in Jackson’s paper and in the Rageh Omaar documentary referenced in the preceding post. I still can’t say I find the jack in the box hypothesis convincing. The creases are not neat transverse foldlines, but a series of short curved creases which look very like the pattern you get when you roll a lined cloth round a pole. I believe Jackson is sincere in what he thinks he observes, but do not think the unecessarily elaborate mecanism he has devised to account for them actually bolsters his case; to me it only demonstrates a rather awkward attempt to make something out of nothing. Both Rageh Omaar and John Jackson suggest that linen has some sort of memory for creases thanks to permanent deformation of the linen fibres. Although this sounds possible, it is not borne out by the simple spreading out of the Shroud out in 2002, whereupon almost every one has become irretrievable..","date":"2014-10-20","mins":"6:51 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-21418","author":"hugh_farey","post":"What a magnificent collection. Thank you, Yannick. However. Isn’t there always a however? Fanti, Botella et al.’s paper ‘Superficiaity,’ quoting Jumper, specifically mentions: “the linen fibers seen on the body image tapes are shorter and more fractured than those from nonimage areas.” This suggests that the material of the cloth itself, not just the ‘impurity layer’ was affected by the image forming mechanism..","date":"2013-01-01","mins":"7:57 am","url":"https://shroudstory.com/2013/01/01/a-collection-of-ray-rogers-quotations/","cat":"uncategorized","title":"A Collection of Ray Rogers Quotations"},{"id":"comment-164270","author":"hugh_farey","post":"Mike’s referenced BBC video depiction of the creases was certainly done in raking light, but I do not see that they are “sharp and run through the whole length of the cloth.” I presume he mean width, actually, and this leads me to another idea. Roll marks and fold marks (if any) are hopelessly muddled together. Has anyone thought to look for fold marks with raking light from above, showing longitudinal rather than transverse foldlines? Another idea, which I have not pursued but which seems possible, is to distinguish between ‘mountain folds’ and ‘valley folds’ which can be seen because of the direction of the light..","date":"2014-10-21","mins":"3:32 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-49893","author":"hugh_farey","post":"Whenever anybody calls me a fool I usually know I’m on the right track….","date":"2013-11-04","mins":"9:40 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49895","author":"hugh_farey","post":"A really helpful paper is “Age Estimation of Blood Stains by Hemoglobin Derivative Determination Using Reflectance Spectroscopy” in “Forensic Science International” by Rolf Bremmer et al. It’s behind a paywall, but I could pass it on to anyone who sent me a PM..","date":"2013-11-04","mins":"9:44 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-50182","author":"hugh_farey","post":"You could try Acc. Chem. Res. 1990, 23, 77 83..","date":"2013-11-06","mins":"9:12 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49596","author":"hugh_farey","post":"“Unless you have grounds to believe that Ray Rogers, Sue Benford, Joe Marino, John Brown, Robert Villarreal and Barrie Schwortz were participating in a fraud that spanned 14 years (from Orvieto to Valencia) you have no basis to ignore their results as Berry does.” An interestingly eclectic band of researchers, John, but the statement is not really meaningful. The fact is that the results of all these people (except perhaps Barrie, who has been more of a collector of results than an initiator) have not been ignored by people such as Colin and myself, they have been ignored by all those who have only read their conclusions, rejoiced that they supported authenticity, and then used them as impregnable ‘boxes of authority’ that one would have to be insane or criminal to dispute. Throughout this blog and elsewhere, one or two of us have genuinely studied the results, rather than the conclusions, of the people mentioned, and been unable draw the same conclusions. For example. Rogers found a thread which he thought was spliced, old linen and new cotton. Villarreal found that both sides were cotton. Estimates of the amount of cotton in the radiocarbon samples ranges from 2% to 100%. Benford and Marino speculated (and quoted confirmation for) a line down the middle of a herring bone “V,” one side of which was old and one side of which was new. They did not realise that for such a scenario, the radiocarbon dates of the samples would include some that were “pure” patch, which is, of course, not the case. These observations are not conclusions. They are results, and they do not point to a coherent explanation for the shroud. Is there one among you (apart from Thibault, who knows this area well) who can explain why the image on the shroud cannot be a scorch? Is there one among you who has actually read Miller & Pellicori’s paper on Ultraviolet Fluorescence? Or the Gilberts, or Accetta & Baumgart, on Reflectance Spectra? What do you make of this observation: “Shroud blood comparisons with known bloodstains show marked differences”? It was made by a “true expert,” or possibly a “Research Scientist” and “independently confirmed” by other “real scientists.” Now let’s look at some real results, shall we, from some real experts… Robert Villarreal and his team at Los Alamos studied some Raes threads by various instruments, but I cannot find that his results are published anywhere. Http://www.shroud.com/pdfs/villarrealvtxt.pdf discusses them, but does not give any results. Fortunately, Dan has put a lecture by Villarreal up on Youtube, and there we can see what he actually discovered. On a slide labelled “Analytical Results in Order of Analysis” we have: 1) X ray Photoelectron Spectroscopy 2) Microphotography 3) To F SIMS 4) FTIR 5) Assessment of Results 6) Re analysis by FTIR 7) Micro spot Energy Dispersive X Ray Fluorescence (MXRF) Spectrometry The first test examined the two ends of a single thread (R1) and found the relative proportions of Carbon, Nitrogen, Oxygen, Silicon and Calcium present. There was a big difference in the proportion of Carbon (Fuzzy end: 70%, Twisted end 80%) and Oxygen (Fuzzy end: 24%, Twisted end 16%), and a small one in the Silicon (Fuzzy end: 3%, Twisted end 2%). Next, the To F SIMS instrument sucked the thread apart into three, two pieces of thread and a linking ‘crust.’ At this point in his lecture Villarreral explains that microphotography was useful for looking at individual fibres, but not at groups of fibres as they are cylindrical, and focussing, which is restricted to a single plane, is difficult. The photo of a single fibre from the fuzzy end that he shows looks like a flax fibre, being not twisted, and showing ‘nodes.’ Note that flax fibres are more or less cylindrical while cotton fibres are flat. Now it is not clear next how many fibres or from which ends were individually subjected to To F SIMS analysis, but Villarreal quotes his expert as follows: “He had a lot of difficulty because when you look at a thread, the thread itself is not conductive, and so it develops space charges; but still, he said, ‘This analysis that we’re looking at looked very much like cotton. I don’t see anything that looks like flax.’ ” Some fibres were then sent off for FTIR analysis, as the spectra of different materials are much easier to recognise this way. Most noticeably, linen has a very distinct carbonyl peak which is completely lacking in cotton. Two fibres from each end were studied and they were all clearly cotton. The crust first gave the cotton spectrum, from embedded contamination, and then, at finer resolution, something that was cautiously identified as a terpene based resin. Subsequently threads R7 and R14 were also identified as cotton by FTIR analysis, possibly contaminated with the resin of the ‘crust.’ Determination of the composition of the threads was by means of reference standards of linen and cotton, but they were modern reference standards, not ancient ones, so an attempt was made to find an ancient thread with which to compare them. In an extraordinary part of the lecture, Villarreal says this: “An individual says, I’ve got a thread, and he gave me a whole history of this thread, and we called it the Tama 4 thread, and he said this is probably one of the main shroud fibres. And we looked at it, and it turns out that we don’t know in fact what this Tama 4 purportedly shroud fibre is. It is not a good match for either the cotton or the linen standard. This may be a result of the ageing effect or the material may be something entirely different.” Some provenance! Nevertheless, it is worth looking at the slide entitled FTIR Absorption Data for Tama 4 “Shroud Fibre.” It’s at 4:43 on ‘Shroud of Turin Ohio State University Villarreal Lecture Part 4 of 5.’ Of the spectrum for Tama 4, Villarreal says: “It’s somewhat comparable with cotton, but it doesn’t have the linen characteristic that we would have liked to have seen.” In other words, assuming for a moment that the thread actually was from the main body of the shroud, and therefore linen, it’s spectrum nevertheless makes it look more like cotton, placing in doubt the identification of the cotton from the Raes threads previously analysed. Villarreal goes onto to display a sticky tape sample given him by Barrie Schwortz, and admits that he is unable to identify the fibres on it. He then shows another whole thread with a thin metal filament around it, about the same diameter as one of the fibres. Having been told this was a gold iridium wire used by John Brown in his analysis, it turned out to be pure nickel. Sample R1 was then subjected to X Ray Fluorescence, which identifies whereabouts on a sample various elements can be found. Calcium, Iron, Potassium, Phosphorus, Silicon and Sulphur were identified “all through the thread. Why? We don’t know.” There were minor amounts of all sorts of things, “but we did not see any aluminium.” Oddly, the proportion of Silicon to Calcium by this means was determined as about 1 to 40, whereas by the first test (X ray Photoelectron Spectroscopy), the proportion was about 4 to 1. How odd. Villarreal sums up his findings by saying that the threads he was given were definitely cotton and did not contain flax fibres. This is in marked distinction to the findings of Thibault Heimberger, who also examined R7, and declared that there was only 15% cotton in that same thread. Thibault’s expalnation is that by sheer chance Villarreal’s teams only analysed cotton fibres, among the many flax ones that were in fact present, both in R7, R1 and R14. Finally, Villarreal concluded that the samples he analysed were not representative of the main body of the shroud, even though the only, albeit dubious, thread from the shroud he had gave substantially the same results. The confusions, mis identifications and uncertainties above are what real science is about. As I said at the start, it is not Colin or myself who “ignore results,” it is those who don’t bother to read or make the effort to understand them who really ignore them, clinging desperately to generalised conclusions in the rather vague hope that that the inconsistencies will disappear if you don’t look at hem..","date":"2013-11-02","mins":"12:14 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49624","author":"hugh_farey","post":"Hi OK! I think I’ve lost you somewhere. Or maybe you’ve lost me. You appear to be making a plea for people not to try to understand details if they are likely to cast doubt on their convictions. If the shroud is authentic, then no arguments or evidence can make it a forgery, and if the shroud is a forgery, then no arguments or evidence can make it authentic. At present though, all we have to go on is an inconclusive pile of evidence, some for and some against. There are, I know, a number of extremists who, having made up their mind, don’t really need any evidence, and denounce anybody of the opposite camp as an idiot or a criminal, but there’s really no need. Most of us here find the evidence on both sides very finely balanced. It is often confused and uncertain rather than dogmatic, and the difference between those who try to understand it thoroughly, on either side, can be very small. I think Dan has read and understood everything I have, and I wholly respect his “Is the Shroud real? Probably” as I hope he respects my “Unfortunately probably not.” However you do make an important point about the proper criticism of anti authenticist arguments. There’s a reason for that, which is that there are very few such arguments to criticise. The most powerful one, of course, is the radiocarbon paper. I believe I have examined this as thoroughly as I have any other, and although I find Remi val Haelst’s statistical papers very hard going, I was impressed by Riani and Atkinson’s paper, which I think does demonstrate chronological sequence along the radiocarbon sample. Luckily both these last gentlemen are still alive, and were able to reply to the queries I put to them. The only other scientific paper discrediting the shroud is that of Walter Mc Crone, as published in Microscope and in his book. His results too I have examined thoroughly, and am largely not in agreement with his conclusions, particularly the importance he gives to vermillion as a pigment, which he didn’t even notice until it was pointed out to him by spectroscopists. Finally, there are the opinions of numerous art historians, who say the shroud is coherent within the artistic conventions of medieval Europe. Well, I think I’ve must have seen very nearly every crucifix, shroud and dead Jesus painted or sculpted between 0 AD and 1700 AD, every naked, or crossed handed, or flogged, nailed, thorn crowned or speared body, within the Byzantine or Romanesque traditions of overtall thin people with long thin fingers, in psalters, altar frontals, statues, brass rubbings and images of every kind, and am not persuaded that these art historians are correct. I don’t think the shroud derives from an artistic culture. Mind you, I’m not convinced that an artistic culture derives from the shroud either, so maybe that cuts both ways. Does that help?.","date":"2013-11-02","mins":"3:48 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49629","author":"hugh_farey","post":"“But can you point to their mistakes?” Don’t you read my comments at all? I do not claim they have made mistakes. They are mostly good scientists and their experiments are valid. Sometimes they are contradictory, and I sometimes disagree with their conclusions. If so, I explain in exquisite detail why..","date":"2013-11-02","mins":"4:29 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49810","author":"hugh_farey","post":"I don’t believe Mc Crone was “out to prove the Shroud a fake from the get go.” His letters to Fr Rinaldi (held by the Holy Shroud Guild) suggest exactly the reverse, and a sense of real disappointment when he found he could not agree with the rest of the STURP team. I think he felt polarised into defending his position (partially due to his own stubbornness, it’s true) and became a bitter, and embittered, opponent of authenticity; but I do not think that was his original position. Gove’s book must by balanced by Mc Crone’s own for one to try to get a fair idea of who was responsible for what..","date":"2013-11-03","mins":"7:45 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-1660","author":"hugh_farey","post":"I don’t think I have a working hypothesis at the moment, but feel that the rejection of non working hypotheses might help, whether they are mine or someone else’s. The importance of it is simply that it occurs at all. Is fluorescence a feature of all old linen? Has anybody asked a museum? If not, then how did it occur? I thought it might be in association with the body image, but it seems to be spread too widely over the cloth. Then I thought it might have been due some anointment, as the M&P images seemed to show it concentrated in the middle of the cloth – however, as I now see that the top, bottom and left edges of every photo are dark (not just the famous corner where the C14 came from) I think the fluorescence may cover the whole cloth after all, and the fringe darkness is an artefact of the photography. So is it a common feature of 1st century middle eastern or 14th century French cloth? Has anybody checked? If not, then the unusual preparation of the cloth may be significant. M&P say that they can replicate the background fluorescence with heat (which they don’t believe happened), but they do not demonstrate that it can be achieved by ‘aging’ (whatever that means). Since the shroud has spent most of its life rolled up, I would expect some sort of banding, darker on the outside and lighter in the middle, if light, heat, oxygen or other gas were responsible for ‘aging’ the shroud over hundreds of years. If it was used as the famous mandylion, then there should be a stripe across the face, if as a Byzantine altarcloth (folded in four as per Lirey holes) then one quarter might look more ‘aged’ than the other three, and so on. None of this seems to be the case..","date":"2013-01-07","mins":"10:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1658","author":"hugh_farey","post":"Feel free. The evidence is available. Pellicori and Miller distinguish very clearly between the 1532 scorches (which fluoresce red – but check out the enhanced photo from ohioshroudconference) and the Lirey poker holes, which don’t. They attribute this to the Lirey holes being more burnt than scorched. However they also find a couple of ‘donut shaped’ areas which ‘appear to be scorches’ although they are ‘brightly fluorescing yellow green.’ In laboratory tests, they found that “scorches emit a bright greenish yellow fluorescence if produced in air and reddish if produced under conditions of limited available oxygen.” It is not clear to me if this means that they found that the brown scorches in visible light (darker than the background) were yellow in UV, lighter than the background. The only time I have achieved this is with cotton, not linen..","date":"2013-01-07","mins":"8:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1655","author":"hugh_farey","post":"I think there is a tendency to misremember (or even misread) papers that came out a long time ago, and they only need to be quoted once or twice for the misinformation to be set in stone. Barrie Schwortz’s comment 8125 is a case in point. – “true scorches on linen will always fluoresce in the red.” This is obviously nonsense, and even Pellicori and Miller don’t claim that it is true. – “Every documented scorch on the Shroud fluoresced in the red.” As above. – “The only conclusion possible from these observations is that the Shroud image is NOT the product of scorched or heated linen.” The observations being false, the conclusions are wholly unjustified..","date":"2013-01-07","mins":"2:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1653","author":"hugh_farey","post":"Pellicori and Miller do indeed say that the background glows and image does not, which is true. However, to conclude that this observation precludes a scorch is, I think incorrect. My scorching experiments on linen invariably result in something very similar – a dark scorch surrounded by “background” fluorescence. On the shroud, this background fluorescence extends well beyond the image, so was probably produced separately, but not necessarily by a different mechanism. Pellicori and Miller suggest that it is due to aging, but admit that exactly the same effect can be achieved using heat. What’s more, their photographs show the background fluorescence decreasing at the edges of their photos, and especially at the corners of the cloth, which may suggest that it is not as uniform as would be expected if the whole cloth had been similarly treated. (It may also suggest that the UV light was spotlighted in the middle and didn’t reach the edges, but they don’t mention that possibility. There is a whole subsection of the literature about what this ‘edge decrease’ might mean regarding the C14 sample, but it might not really be there at all!) They also observe that the big scorches on the shroud (but not the minor ones) actually fluoresce themselves, and there is a massively enhanced photo (ohioshroudconference.com/papers/p07.pdf) which does show red fluorescence from the darkest parts of the 1532 burn marks. The rest of the discolouration, image, blood or scorch, does not fluoresce, although there is a bright halo around the outer edge of the spear wound. I still find this red fluorescence very odd, and wonder if it is not simply the reflection of the red visible light shining off the wholly (shiny?) carbonised areas..","date":"2013-01-07","mins":"9:03 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-206789","author":"hugh_farey","post":"Hugh appreciates anybody who actually tries to replicate the image formation mechanism rather than just talking about it. Vignon, di Lazzaro, Fanti, Berry, Rogers, Guarlaschelli, Allen, Nickell, etc., even myself. How tired we get of what ‘would have happened,’ when such guesswork is lacking any real practical evidence. Don’t you?.","date":"2015-07-28","mins":"12:38 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-1649","author":"hugh_farey","post":"Golly. Well, a bit at a time… That UV picture… it’s glowing so EXACTLY like a scorch… I now have a coloured copy of Pellicori and Miller’s paper, and although I agree completely with their observations, I disagree almost as completely with their conclusions..","date":"2013-01-05","mins":"11:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-206846","author":"hugh_farey","post":"Evidence? Report? Pictures? … sigh … I thought not … An inspired guess may indeed be the answer, but unless supported by evidence, that’s all it is..","date":"2015-07-29","mins":"6:20 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206781","author":"hugh_farey","post":"It’s very much of its time, and I doubt if, were David Rolfe to make a similar film today, he would do it the same way. But I don’t think the cursory inspection of a couple of photos which appears to lead to Dr Bucklin’s detailed forensic conclusions was seriously meant to make us think he was performing his ‘autopsy’ there and then. It would be interesting to know how he really worked before writing, and mostly learning, the clearly scripted commentary he gives here. Was the mise en scene really necessary? Or true? We see corridors lined with corpses on trollies, only to arrive at a conveniently empty room in order to examine a piece of paper. (We also notice the Dr Bucklin marches through the corridors gloveless, and then quickly, off camera, puts some on so that he can take them off again as he enters the room – why?). There’s an interesting form of words in Dr Bucklin’s comments on the nail hole. “An injury to this part of the wrist will invariably damage the median nerve, whose function is to flex the thumb across the palm.” So what happens if you damage it? You can’t move your thumb across the palm, and you get ‘ape hand deformity’. I have scoured the internet looking for median nerve damage that might result in the thumb vigorously flexed across the palm as described with no success. Can anybody support the idea that it might?.","date":"2015-07-28","mins":"11:12 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206884","author":"hugh_farey","post":"Sadly, telling us of papers for which there is no evidence is not the same as presenting evidence. Why not send them to Dan?.","date":"2015-07-29","mins":"1:17 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206890","author":"hugh_farey","post":"Then update them and send them in. Sorry, Max, but “pix or it ain’t so,” as they say..","date":"2015-07-29","mins":"2:21 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206821","author":"hugh_farey","post":"“Whatever, the thumb still flexed! On each and every attempt.” This would be more convincing if the only photos I have ever seen of Barbet’s experiments did not show flexed thumbs… “La contraction de ces muscles thénariens, encore vivants comme leur nerf moteur, s’expliquait facilement, par excitation mécanique du nerf médian. Il ne peut donc s’agir de paralysie de ces muscles, comme on l’a prétendue Au con­traire, le nerf médian, tendu, dans sa partie externe, motrice, intacte, sur le clou, en recevait une excitation mécanique à chaque mouvement.” This is a more sensible explanation of a possible action of a damaged nerve, but this: “Le Christ a donc dû agoniser et mourir et se fixer dans la rigidité cadavérique, avec les pouces opposés dans les paumes,” sounds like wishful thinking, as the muscles relax after death, and the idea that rigor mortis would suddenly catch the thumbs in just the right position is unrealistic. I still await some confirmation that the flexed thumb suggestion is not a myth..","date":"2015-07-29","mins":"2:09 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206845","author":"hugh_farey","post":"Yes, I thought you’d say that. So the dear old lady we see crucified in his photos was not freshly dead? I suppose not. Or the X rayed hand freshly amputated? As I have said, I have a lot of time for people who actually carry out experiments, and the chance to repeat Barbet’s seems rather unlikely. However, having flung the thumb across the palm at first nailing, what happened next, I wonder? Carlos’s extract suggests that the median nerve needs to be stimulated to produce the contraction, and then relaxes, only to tighten again as an involuntary movement triggers the nerve once more. He then, quoting Barbet, says that rigor mortis locked the thumb in the contracted position, which seems unlikely. It would be good if anybody at all, ever, had seen a corpse with an adducted thumb, except Barbet..","date":"2015-07-29","mins":"6:14 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206856","author":"hugh_farey","post":"Hi Stan, good to have a physician on board. In your experience, then, what happens if the median nerve is damaged at the wrist? The internet is full of references to ‘ape hand’ and ‘benediction hand’, which demonstrate that median nerve damage prevents the thumb from closing towards the palm, but I found Carlos’s quote from Barbet not unreasonable, that some partial damage could cause spasmodic flexion as described. After death, however, does it remain fixed across the palm, or do the muscles relax it into its ‘normal’ position?.","date":"2015-07-29","mins":"7:53 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206902","author":"hugh_farey","post":"Thank you so much, Stan. Can I clarify, then, that your opinion is that the flexed thumb was caused more by damage to the nerve to the extensor muscles than damage to the nerve to the flexors? (Or possibly a combination of weakening the extensors and putting the flexors in spasm at the same time?). And, could you say whether this musculature would continue even after death?.","date":"2015-07-29","mins":"4:17 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206943","author":"hugh_farey","post":"Thank you, Stan; your expertise is much appreciated. However, when you say that there is no reason why the thumbs should not relax after death, would it not be due to the post mortem flaccidity of the flexor muscle, previously in contraction, causing the thumb to fall into a position in which neither muscle group (extensors or flexors) were under tension?.","date":"2015-07-30","mins":"4:08 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206995","author":"hugh_farey","post":"And I should like to be informed of instances of thumbs firmly flexed by muscular contraction remaining fixed in place even after death and the relaxation of the muscles..","date":"2015-07-31","mins":"1:46 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-207241","author":"hugh_farey","post":"I’m inclined to agree with Daveb here. I cannot think that Barbet deliberately falsified his observations, although I don’t think it impossible that he over accentuated them. So, the thumbs flexed. What I think is highly disputable, especially with regard to the X ray photo of a wrist with a nail through it, is that they remained flexed after whatever flexed them stopped working, either because of death, or because the nerve or muscles or whatever stopped being stimulated. Barbet himself seems to suggest that it was the movement of the arm around the nail that stimulated repeated flexions of the thumb, as if he knew that it relaxed as soon as the immediate stimulation ceased..","date":"2015-08-02","mins":"4:35 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-51350","author":"hugh_farey","post":"“The pathologist observes that there are blood flows which extend in a direction from wrists toward elbows on the right and left forearms. These flows can be readily accounted for my the position of the arms which he has just determined.” “A crucifixion type posture would be the most plausible explanation for these findings.” Well, yes, except that the wrists were supposedly nailed against a wooden plank, which would undoubtedly smudge any emerging blood, or if the blood did not emerge till the body was removed from the cross, then the blood would emerge from the palms of the hands and dribble down between the fingers emerging on the cloth below them. Seems the forger didn’t think of that….","date":"2013-11-14","mins":"6:31 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","title":"Paper Chase: The Findings of Robert Bucklin"},{"id":"comment-51417","author":"hugh_farey","post":"Difficult to say. How much blood remains in a hand elevated above a dead body? And with what pressure will it be released when a nail is removed? My guess is that no blood will flow at all until there is sufficient in a “reservoir” above it, as when the arm is lowered into “shroud formation.”.","date":"2013-11-15","mins":"7:22 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","title":"Paper Chase: The Findings of Robert Bucklin"},{"id":"comment-1399","author":"hugh_farey","post":"I think the “before or after” question of the bloodstains is an important factor, possibly crucial, in determining how the image occurred. Every mention I can find claiming that there is no image under the blood refers to two papers, both by Heller and Adler, in Applied Optics and the Canadian Forensic Society Science Journal. The first, which available online, does not, in fact, mention the image at all, and the second (in a journal whose real name is “The Canadian Society of Forensic Science Journal) is not online. However I found the following quotation on randi.org. “It is interesting to point out that many of these wound images appear to have a border encircling the darkly colored area where body image is absent, a halo of sorts that can clearly be seen as such in the UV photography…”(Heller, J. H.; Adler, A. D. The Canadian Society of Forensic Science Journal 1981, 14, 81 – 103). [Correctly named this once!]. I believe this refers to the UV fluorescent halo which is occasionally mentioned encircling one of the tips of the blood image on the wrist. In ordinary light, (as on the shroudscope photos) no such halo can be seen, and in its place the fabric is as dark as anywhere else on the image. I do not know if this article says anything else about the subject or not. Elesewhere, there is reference to the blood being dissolved away, and no image being revealed underneath. However these chemical experiments were carried out on single threads, where the blood is present in crystallised lumps. Given that the image is mostly present on the tops of threads, and the blood mostly in the furrows, I don’t understand how this claim can be made, unless a clearly yellowed thread equally clearly stopped being yellow under a lump of blood, and then was yellow again when it emerged from the other side. I have not read any evidence to that effect. Back on fluorescence, I note that the entire shroud fluoresces weakly, and wonder how the image, however it was made, manages to suppress this, unless those who claim the image doesn’t fluoresce really mean that it doesn’t fluoresce any more than the rest of the shroud. However the image was made, if the entire shroud was subjected to a temperature of, say, 200°C, it would all be slightly scorched (accounting for its sepia colour?), and its overall fluorescence would mask any fluorescence made when the image was formed. I have only seen one picture of the shroud under UV light (the one with the ‘halo’ round the blood), and it all seems to be glowing quite brightly. Are there any other of the UV photos available online, do you know?.","date":"2012-12-06","mins":"10:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/06/no-mr-breault-the-blood-is-on-the-hair-because-thats-where-the-artist-intended-it-to-be/","cat":"medieval_forgery","title":"No Mr. Breault – the blood IS on the hair (because that’s where the artist intended it to be)"},{"id":"comment-121455","author":"hugh_farey","post":"Authenticist: One who having considered the evidence on both sides thinks that the balance of probability is that the Shroud is the burial cloth of Jesus. Non Authenticist: One who having considered the evidence on both sides thinks that the balance of probability is that the Shroud is not the burial cloth of Jesus. Pro Authenticist: One who, having determined that the Shroud is the burial cloth of Jesus, considers that any evidence to the contrary is the work of the devil and that anyone who disbelieves in the authenticity of the Shroud is in peril of his immortal soul. Anti Authenticist: One who, working directly under Satan, knows and cares nothing for the Shroud but is working for the downfall of Christianity. Scientist: See Anti Authenticist. I think that sums it up… Now I must go and polish my horns….","date":"2014-05-19","mins":"9:25 am","url":"https://shroudstory.com/2014/05/19/dear-stephen-jones/","cat":"uncategorized","title":"Dear Stephen Jones"},{"id":"comment-84466","author":"hugh_farey","post":"Sorry, Louis, but I read about what is going on in the world, and I doubt what you have commented. I don’t think there is any fear of the authenticity of the shroud, and you don’t seem to be able to demonstrate that there is. There may well be a suspicion, even a hope, that people who don’t think the shroud is genuine are afraid of the power of the supernatural, but without evidence, that’s all it is, a vague, and to my mind slightly paranoid, opinion..","date":"2014-03-03","mins":"10:05 am","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-84958","author":"hugh_farey","post":"Wise words, as ever, daveb. Although I don’t think Raes ever had a chance to examine the rest of the cloth closely. In the pre STURP days it was widely assumed the whole shroud was a mixture of linen and cotton, based solely on Raes’s findings about his sample..","date":"2014-03-04","mins":"5:39 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-86485","author":"hugh_farey","post":"“Since the Shroud has lost ALL its vanillin, then obviously it is over 1,300 years of age.” Hi Angel. Thanks for your commment. I was not aware that the absence of vanillin from a sample of linen necessarily demonstrates that it must be over 1300 years old. I rather thought vanillin loss depended on a number of factors, heat probably being the most important. Can you provide a reference for your “statement of the obvious”?.","date":"2014-03-09","mins":"5:43 am","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-84237","author":"hugh_farey","post":"Does anybody at all “fear” the authenticity of the shroud? Has anybody any evidence at all to support this common, but wholly unsubstantiated opinion? There are myth busters, art historians, archaeologists and scientists who don’t think the shroud is authentic, but that is not evidence that they “fear” its authenticity. Are we sure this isn’t the paranoia of those who do believe in it?.","date":"2014-03-02","mins":"7:52 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-87727","author":"hugh_farey","post":"Yes and no. Rogers’s calculations about the loss of vanillin from linen over time were wholly mathematical and depended on a number of constants which were assumed rather than measured. I do not know if any actual measurements have been made on old linen to check whether his equations really apply or not. He himself was well aware of the limitations of his exercise, and did not commit himself to any specific dates, being content to demonstrate that his C 14 sample was observed to contain some vanillin, while his shroud sample did not. That in itself is an important finding, and ought to be confirmed. Jackson’s hypothesis that CO could skew the C14 content of cloth was experimented on in Oxford with negative results..","date":"2014-03-12","mins":"7:52 am","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-87908","author":"hugh_farey","post":"I agree with that. And you’re quite right about the anomalous dating of snails and virtually all marine organisms. A lot of their carbon is obtained from dissolved CO2, which in turn can derive from old carbonates as well as atmospheric CO2. This was given as the explanation for Richard III’s bones dating from before their ‘correct’ date, as he was assumed to have eaten a lot of seafood. It is probably also the explanation for the famous ibis anomaly, if the bird’s diet was largely aquatic, while its wrappings came from atmospheric photosynthesis..","date":"2014-03-12","mins":"6:26 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-84919","author":"hugh_farey","post":"Stephen 8 points of evidence are indeed quite clear, which makes it easy to explain clearly why they are, in fact, not evidence at all. 1) Hacking had started before 1988. So it had. So what? That’s not evidence that the Tucson Radiocarbon laboratory was hacked, or any of the others. 2) Hacking had started before 1988. This is the same piece of evidence as No 1, expressed differently. 3) The date of the shroud’s manufacture matches the date of the shroud’s manufacture. That’s not evidence of hacking; it’s evidence of accuracy. 1350 is not a “bulls eye date” and the date found by the C 14 labs was 1260 1390, whose midpoint is not 1350 anyway. 4) Gove accepted the C 14 date. That’s not evidence of hacking. 5) If the shroud was hacked, it was well done. That’s not evidence of hacking. 6) If the shroud dated from between 1260 1390, the C 14 dating had to be perfectly accurate. This is nonsense; a 130 year range is not perfectly accurate. 7) Thomas de Wesselow thinks fraud a possibility. That’s not evidence of hacking. 8) Ian Wilson does not think fraud a possibility. That’s not evidence of hacking. 8a) The fraud could have been carried out without anybody knowing. I dare say it could, but that’s not evidence that it was. “Ridiculous computer hacker hypothesis.” Steady on, Dan, that’s a bit steep…. Er……...","date":"2014-03-04","mins":"3:03 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-84396","author":"hugh_farey","post":"How? Who? Is there any evidence for this unconscious fear of authenticity, or is this the kind of conspiracy theory that says: “There is no evidence for my theory, but that means it must be true, because only a really powerful conspiracy could keep itself that secret.”.","date":"2014-03-03","mins":"5:21 am","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-97125","author":"hugh_farey","post":"No, no, no. Garlaschelli and Borrini do not mention the shape of the cross, and their experiments were not concerned with it. Wasting time attempting to discredit the idea of a “Y shaped cross” misses the more important point of their article, which is that whatever the shape of the cross, blood did not flow down an arm unless it was at an angle of more than 80° to the horizontal. The implies that the hands were only a few inches away (outwards) from vertically above the shoulders, unless we go along with the assymetrical lurching from side to side illustrated a few posts ago. The shape of the cross is a red herring. De Wesselow, unusually, sets up two ‘medieval’ creators to discredit, not only the usual “arrogant swindler” but now the “overzealous monk,” but still sticks to 14th century France for his date and place. I’m going for 13th century Bulgaria myself….","date":"2014-04-06","mins":"1:08 pm","url":"https://shroudstory.com/2014/04/06/more-on-the-y-from-stephen-jones/","cat":"news_&_views","title":"More on the Y from Stephen Jones"},{"id":"comment-97588","author":"hugh_farey","post":"Michelangelo probably. Was he the first?.","date":"2014-04-08","mins":"5:01 am","url":"https://shroudstory.com/2014/04/06/more-on-the-y-from-stephen-jones/","cat":"news_&_views","title":"More on the Y from Stephen Jones"},{"id":"comment-103652","author":"hugh_farey","post":"Strange that it should come to this is so short a time. Until January this year all Dan’s references to Stephen’s site were complementary. Even his response to Stephen’s first suggestion that the radiocarbon data might have been hacked was interested and encouraging. “This ‘mini series’ sounds promising. Stephen isn’t joking and the title of this posting, being as it is a play on the title of Feynman’s most famous book, is meant as a full throated compliment to Stephen, assuming he pulls it off.” I was less complimentary, as even in this first post there was a serious misunderstanding of Gove’s statistical analysis of the shroud (which it is not clear Stephen really understands even now), and a misrepresentation of Robert Hedges’ viewpoint. Although he was quick to qualify what he meant by fraud, he firmly announced his intention to “set out the evidence for … the bias and dishonesty of those involved in the dating,” which seemed, in the absence of any such evidence, libellous. Stephen second post (Labelled Part 1) was in February. Now the ‘fraud’ had become some kind of computer hacking, but no evidence at all was put forward. Dan was disappointed. So was I. Stephen thanked Dan for the publicity he was being given. Part 2, the following day, added nothing more, and to be fair to the dubious, Dan suggested we look at Wikipedia’s Timeline of Computer Security Hacker History. Part 3 appeared a few days later and “the hacker” was more or less established. However still no evidence had been put forward and I was prepared to dismiss this whole idea as preposterous. Dan didn’t comment at all. By March 7 it was either “a KGB agent hacked into the AMS system control console computer at each of the three C 14 labs and inserted a program” or “anyone with the requisite computer skills, even a university student hacker testing his ability.” When both Professors Jull and Ramsey had replied to my emails saying this was impossible, they were described as “ambiguous,” “misleading” and “defensive,” with “fallacious reasoning and false facts.” However Stephen now turned his attention to the possibility of individual hackers at each of the three labs, and, picking on Arizona University first, fingered two of the radiocarbon team with deep suspicion, while announcing boldly that he couldn’t prove they were guilty. Until this moment, Dan still hadn’t murmured a derogatory word, but at last, under some pressure from his readers, felt that direct personal accusations of fraud without any evidence whatsoever were unacceptable on his blog. Nothing constructive has occurred since, but I cannot find that Dan has been derogatory about Stephen anywhere. Stephen’s “evidence” concerning hacking has been robustly challenged without much defence and his hypothesis cannot be considered to be in any sense established. And finally: “However, unlike Porter, it is part of my long standing, stated policies that I do not to allow offensive or sub standard comments. This includes offensive comments against Porter.” !!! (Falls off chair in hysterics…).","date":"2014-04-25","mins":"12:34 pm","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103680","author":"hugh_farey","post":"I don’t think Rogers actually tested the image formation proposals of Jackson. I’m not sure he knew how to go about it. Neither do I. Any ideas?.","date":"2014-04-25","mins":"2:12 pm","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103696","author":"hugh_farey","post":"Yes. It was how to test the “mechanically transparent” body I was really thinking of….","date":"2014-04-25","mins":"2:46 pm","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-28163","author":"hugh_farey","post":"Aragonite. As usual there is more to this than meets the eye. According to the Villadas (A New Look at the Validity of the Carbon 14 Dating of the Shroud – shroud.com), Rogers passed on a single slide with a single speck of indeterminate composition to Kohlbeck, who identified it as aragonite and in turn passed it on to Levi Setti, who analysed it as best he could. A single speck. I am not aware that anybody else has analysed any other speck. Caesar Barta (at holyshroudguild.org) takes up the story. He notes that Aragonite is widespread and very common, and therefore not a good proof that the shroud is associated with the Jerusalem sample, but he prints the mass spectrometer spectra. These are not easy to read, and are somewhat deceptive, as the spectrum from the shroud overlays, and in many places obscures that of the Jerusalem sample, and the diagrams are blurred. What’s more, as Barta points out, the spectrum from the shroud includes that of underlying linen, as the speck could not be removed from it. Nevertheless, reading from left to right of Diagram 1: Positive Secondary Ions, there are some curious points to observe, which somebody may be able to explain. 1) The spectrum begins with a huge Hydrogen spike for the Jerusalem sample (J), and no corresponding one for the Shroud (S) at all. 2) Lithium has a small S spike but no J evidence. 3) There is 10 times as much sodium in J as there is in S. 4) Magnesium and Aluminium spikes appear to be similar, but S has silicon and J does not. 5) The next named spike is Potassium, of which there is about the same. 6) Then comes Calcium, with a huge J spike, 100 times bigger than the S spike. 7) And then Cobalt, of which there is10 times as much in J as in S. 8) The next collection is the Ca O/Fe group, which again shows a huge discrepancy between the two spikes, 9) And finally Gallium (?), of which there is a lot in S but very little in J. I will refrain from repeating my survey for Diagram 2, the Negative Secondary Ions, but I hope I have said enough to make people go back for another look. The two spectra look nothing like each other, and if we are to accept that in fact they show a similarity between the speck on the shroud and a sample of Jerusalem limestone, then could some expert please explain how?.","date":"2013-03-23","mins":"10:05 am","url":"https://shroudstory.com/2013/03/23/stephen-jones-adds-another-part-to-his-series/","cat":"other_blogs","title":"Stephen Jones adds another part to his series"},{"id":"comment-28270","author":"hugh_farey","post":"Thanks, Gabriel. I too know nothing about the mass spectra of limestone, and would be very pleased to know more. Gerard Lucotte’s controversial paper on particles from the face claims that rather little of the dirt is aragonite, so I have emailed him for clarification, although I note Yannick’s comments earlier that Lucotte (a professor at the “Institute of Molecular Anthropology” in Paris) is a clown from the lunatic fringe..","date":"2013-03-24","mins":"9:50 am","url":"https://shroudstory.com/2013/03/23/stephen-jones-adds-another-part-to-his-series/","cat":"other_blogs","title":"Stephen Jones adds another part to his series"},{"id":"comment-86338","author":"hugh_farey","post":"If the Lord has revealed the secrets of the Shroud to mere children I wish we knew which ones….","date":"2014-03-08","mins":"7:06 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86344","author":"hugh_farey","post":"Ah! My mistake. I’m a teacher and have been interrogating my pupils….","date":"2014-03-08","mins":"7:20 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-25718","author":"hugh_farey","post":"The poker holes correspond to the shroud having been folded in four, being then 55cm across and 220cm long, more or less. Or the ends may have been folded in. The holes are then in the middle. There are not simply four neat ‘poker’ holes, but a number of extraneous burn holes round about, and a prominent ‘water stain’ with a most interesting rim which, because it too only occurs four times, must be associated with these holes and not with other damage on the shroud. To be honest, they don’t look like ‘test holes’ to me, and much more like mistakes. If they are anything to do with the “Trial by Fire” daveb mentions above, I wonder what they established, and how they established it!.","date":"2013-02-26","mins":"7:15 am","url":"https://shroudstory.com/2013/02/25/stephen-jones-summarizes-the-burn-marks-and-water-stains/","cat":"other_blogs","title":"Stephen Jones summarizes the Burn Marks and Water Stains"},{"id":"comment-25775","author":"hugh_farey","post":"I gather that the point of these trials was to demonstrate that the holy object was not affected by fire. So when a trial with a poker showed exactly what would be expected with any other cloth in similar conditions, it was proved a fake? (Using the word ‘prove’ in its original sense, of course.) I’m only asking….","date":"2013-02-26","mins":"6:23 pm","url":"https://shroudstory.com/2013/02/25/stephen-jones-summarizes-the-burn-marks-and-water-stains/","cat":"other_blogs","title":"Stephen Jones summarizes the Burn Marks and Water Stains"},{"id":"comment-46381","author":"hugh_farey","post":"Even by his own terms, Stephen is being rather ungenerous, I feel. Although he personally has no doubts at all, he seems to accept that the Shroud may be thought of as either the work of God or the work of the Devil (He doesn’t seem to accept any other possibility). That being so, what response would he feel appropriate from the Catholic (or any other) Church? It is a pity that Stephen treats John Walsh’s comment, that the Shroud is either “the most awesome and instructive relic of Christ in existence” or “one of the most ingenious, most unbelievably clever products of the human mind and hand on record, “there is no middle ground,” as an axiomatic fact, and is therefore immune to any suggestion to the contrary..","date":"2013-10-07","mins":"12:55 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"},{"id":"comment-66515","author":"hugh_farey","post":"Having read this, I had a look at David Rolfe’s first Shroud film, extracts of which are on his website. Following Home – Wall 1 – Pollens, we find an interview with Max Frei, in which the narrator (Kenneth More, I think) says: “Dr Frei was given an opportunity to study the Shroud at first hand when, in 1973, he was asked to authenticate photographs of the cloth, taken a few years earlier.” Frei continues: “I remarked, between the threads some dust particles, some of them looking like pollen grains, or spores. At higher magnification I was certain of it, and so I asked the competent authorities if it would be possible to take dust samples.” He says this while holding what is clearly a scanning electron microscope image of some fibres. Later on, he looks though an optical microscope but a number of SEM images are shown on the film, which is presumably cinematographic licence. But what about those first photos, which he holds in his hands? Are they real, or are they cinematographic license as well?.","date":"2013-12-24","mins":"8:57 am","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","title":"A STURP Sequel?"},{"id":"comment-142945","author":"hugh_farey","post":"The cotton question is a bit of a stumbling block. I do not think it is clear whether the main shroud contains flecks of cotton or not, and it is certainly not clear whether any confidence can be placed in the “cotton enrichment” hypotheses, when those who have studied threads microscopically have come up with so many different conclusions. If the the shroud is substantially 1st century with medieval interpolations, were those interpolations a) all cotton (Villarreal), b) a deliberate 20/80 mixture of cotton and linen, c) linen, but with a few cotton flecks from the spinning or weaving room blended in fortuitously, d) some other suggestion. None of the Rogers/Heimburger/Fanti school of thought seem in agreement about this,.","date":"2014-08-08","mins":"5:21 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-142973","author":"hugh_farey","post":"Daveb is not the first both to acknowledge Flury Lemburg as a world expert on textiles and one of the very few people to have studied the shroud at close range intensely, and at the same time to assume that she failed to distinguish between inweaving, which a kind of patching, and French weaving, which is more like darning. Both kinds are, of course, readily visible under a microscope, as they involve the interpolated threads running alongside their original counterparts for some distance on either side of the missing section. I’ll happily agree that to the naked eye they are practically invisible, but on enlargements such as the Evans micrographs or Barrie Schwortz’s photos of the retained Tucson portion, they would be very visible. Shroud 2.0 makes an interesting study, as it shows the Shroud simply riddled with inconsistencies, which may indeed be due to repair. They are certainly not invisible, but not quite clear enough to follow with certainty. Without A Trace has a prominent website and good demonstrations of the success of French weaving, but Michael Ehrlich seems unwilling to re enter the discussion. There are a number of other websites which illustrate the technique clearly..","date":"2014-08-08","mins":"10:25 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-86477","author":"hugh_farey","post":"I have recently received an email from Timothy Jull, regarding the hacking hypothesis. Its text, in its entirety, runs: “This is impossible. In our case, the software for the calculations is offline. In any case, the calculation does NOT require software, it was done offline and plotted on a graph, as I recall. Indeed, in 1988 the internet (as we know it today) didn’t exist – there was a pre existing network run by the US government which was quite restricted. Anyway, the machine we used at that time couldn’t have been attached to it, and that one still isn’t.”.","date":"2014-03-09","mins":"4:54 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-994","author":"hugh_farey","post":"Hi Adrie. I tried two different experiments to try to reduce the oxygen. 1) Fold up a 4x4cm square of linen into a little block 1x1cm and 16 layers thick. Wrap it in aluminium cooking foil till the foil is 10 layers thick. Wrap the ends of the tinfoil tightly around the package and squash tight. Hold the whole thing over a Bunsen for 5 seconds. The package bulges a bit. Unfold. The linen is scorched on the outer faces and edges, but fluoresces as greeny yellow as any other. 2) Heat 3ml of water in a test tube till it is boiling. Push a 3x3cm piece of linen into the tube. When it begins to brown, remove the burner. Allow to cool. Still greeny yellow fluorescence. Do you happen to know if the explanation for the red on the shroud is anything more than an educated guess? Has anyone produced red fluorescence by experimentation? If so, how?.","date":"2012-10-24","mins":"1:50 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-988","author":"hugh_farey","post":"Thanks, Matthias; it is certainly a problem, and is the first and most obvious reason for people to say “the image cannot be a scorch.” However, it raises a lot of quite testable corollaries. 1) Can the UV fluorescence be somehow removed? I’m working on that. 2) Does it fade with time? (Not since the burn holes – 500 years, but since Christ – 2000 years?) Not easy to experiment with, but has anybody tested other old scorches, from archaeological finds dating from the 1st to 14th centuries? 3) Can we achieve a scorch like mark (with low temperatures, light, nuclear radiation, chemicals, magic…) which does not fluoresce in the first place? I’m working on that too. 4) Can we duplicate the pink fluorescence of the burn holes? And that. If, after trying dozens of things, I can’t either remove or prevent the fluorescence, I still cannot be certain that it isn’t possible, but it does shift the weight of evidence. As it stands, however, I am not aware that anybody has carried out these tests at all..","date":"2012-10-24","mins":"11:32 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-982","author":"hugh_farey","post":"A confusing day. I’ve been heating a) my faithful spatula, b) my faithful spoon, c) a china thingy, d) a metal pony (which actually melted after being heated too much) and have come to various conclusions, mostly contradictory. 1) The best image results in terms of graduation of shade come from china. The heavy contact can be not too dark, the light contact not too light, and a bit of non contact still visible. The trouble is that the discolouration seems to cover entire areas of threads, including the hidden surfaces and the back of the cloth. 2) The best fibre results come from metal, but with a very brief contact time (a second or less). Only the very tops of the fibres are scorched and the resemblance to Mark Evans’s photos is marked. However, you have to be very quick to get variation of pressure, and I never achieved it. Either the hard contact was burnt through, or only that area was visible at all. 3) From a photo processing point of view, a negative of almost any of these experiments looks amazing. Rather than being astonishing, I’m beginning to think that the most remarkable aspect of the shroud is in fact rather commonplace. 4) My bas relief effect (on Adobe Elements) is pretty primitive, so I can’t really say anything about the 3 D (VP 8 Image Analyser) effect. 5) All attempts not to get fluorescence, and to remove it, have failed completely. 6) I read somewhere that pink fluorescence might be due to the charring of the cloth in the absence of oxygen. I tried heating a bit of linen tightly wrapped in tinfoil, and also inserting it into a test tube with boiling water in the bottom (driving out the air). Fluorescence remains firmly greeny yellow. Next steps: a) Buy a bit of brass… (my pony looking a bit warped now) b) Try to remove the upper layer of marking with a piece of sellotape c) Try to prep the cloth with a mixture of starch, sugars and saponin – soapy custard in fact – to see if I can get an extra layer on the surface of each fibre..","date":"2012-10-23","mins":"8:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1186","author":"hugh_farey","post":"Can I add my support Colin’s appeal? I think I follow the theme of your post, but most of it is way over my head, and a tree diagram might help clarify the details!.","date":"2012-11-14","mins":"12:35 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1021","author":"hugh_farey","post":"Lemon Juice… In the kitchen this morning I dropped some lemon juice on a bit of cloth and put it under the grill (not near my Bunsen burner, you see). Sure enough, the lemony areas darkened much more quickly than the rest. However, sudden inspiration! So far, we have been placing irregular heat onto regular cloth (hot bas reliefs on linen), whereas what I was doing in the kitchen was placing regular heat on irregular cloth (grill on lemon drops). As my half term is drawing to a close, I must get back to earning a living, but with your trusty African mask and pencil shapener, why not mix up a paste involving lemon juice (or milk or some other invisible ink) and something to make it pasty, rub it on your artefacts, dab them, just as you did when then they were hot, successively onto your cloth, and when they’re dry, put the whole thing in the oven. Conductivity… I also noticed that the cloth, lying on the metal bars of the grill, didn’t char at all where it was in contact with the metal bars, which were presumably conducting the heat away so fast (as in your boiling water in a paper bag experiment) that the cloth didn’t get hot enough. So I placed a horse brass on the grill, and put some cloth on top. Brilliant. A lovely negative of the brass, with everything scorched except the shape underneath. I’ve no idea whether this has any implications for the shroud, but it was quite interesting anyway. Finally… Time for a blockbuster, mind shattering bestseller of an idea, if it hasn’t been thought of before. Given, for the sake of argument, the following: 1) the C14 dating is genuine (which lots of people dispute) 2) technically the shroud is impossible to fake (which has yet to be determined) 3) the shroud is a representation of Jesus (which most people accept) 4) the blood marks were added later (which nearly everybody disputes) 5) that there was at least one and probably a handful of full length images of Christ knocking around in France in the 14th century (accepted by some, who explain their provenance as being copies of ‘our’ shroud, but if the few images of the Besancon shroud I’ve seen are anything to go by, not so impossible as 14th century creations). My hypothesis is that ‘our’ shroud was in fact the backing sheet of one of the others. They may have been to our eyes obvious fakes, but if whatever they were painted with (the medium rather than the pigment) transferred onto the backing sheet, it may well only have stained the topmost fibres of the backing (my dabbing with ink, or lemon juice idea). In a subsequent hot incident, the painting became sufficiently discoloured, or brittle, to have to be thrown away, leaving a most surprising, and in fact much better replacement. If only I was an author. Trouble is, I don’t know to what extent I accept any of my initial assumptions. However, if there’s anybody out there who does (and the idea hasn’t already been thought of and rejected) then can I have a percentage of the royalties?.","date":"2012-10-27","mins":"1:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/26/nul-points-dr-thibault-heimburger-you-have-arrived-at-an-over-hasty-ill-judged-diagnosis/","cat":"medieval_forgery","title":"Nul points, Dr.Thibault Heimburger. You have arrived at an over-hasty, ill-judged diagnosis… The patient is NOT dead…"},{"id":"comment-18377","author":"hugh_farey","post":"I understand. My apologies. I think de Wesselow didn’t pursue the formation of the Jospice image, or for that matter Volckringer images, simply because he wanted them as illustrations that “natural images are possible” before going on to explore the shroud more thoroughly. I agree with you that it does not appear that the Jospice image has been wholly explained, and it would be good if more work was done on it..","date":"2012-10-26","mins":"3:34 pm","url":"https://shroudstory.com/2012/10/25/must-listen-thomas-de-wesselows-talk-at-shroud-enigma/","cat":"art","title":"MUST LISTEN: Thomas De Wesselow’s talk at Shroud Enigma"},{"id":"comment-202371","author":"hugh_farey","post":"“I did not bring up this point because J. Jackson’s explanation about image formation sounds convincing.” Is this the vanishing body explanation? It may sound convincing to you, but to me it is wholly unconvincing. Being convinced is obviously somewhat subjective….","date":"2015-06-16","mins":"12:24 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-202384","author":"hugh_farey","post":"Sorry to misunderstand you, Louis. The ‘vanishing body’ hypothesis is Jackson’s explanation for the cloth/body distance observation. Can I ask for some opinion about ‘high resolution’ we keep hearing about. The resolution is not at all high. The resolution is poor. The fat that one smudge can be seen as the edge of the lower lip does not justify the complete absence of any nipples, fingernails, navel and so on, all of which would be expected from an image of any good resolution. The Shroud in Turin was truly amazing, but probably not for the right reasons. From the moment one entered the reception area, some half a mile from the exposition, to the moment one was debouched back into the piazza, there was not one single indication that the Shroud had anything at all to do with any religion, let alone Christianity, let alone that it might be authentic, except for a few panels describing the lives of some saints mostly associated with Turin. The words Jesus, or Christ, any religious context at all, were scrupulously avoided. The explanatory pamphlet and the short film describing the Shroud did not mention anything at all about what we might be going to see – even the trickles of blood from the hair were described as ‘from thorns’ with no mention of a crown. The route to the Cathedral reminded me forcefully of the access corridor to Gate 43 from the Departure Lounge of Brussels airport, which I had recently visited, and so carefully were the visitors shielded from the interior of the Cathedral that it was difficult to be sure that one was actually in one unless one was very observant. The Shroud itself hung in a limbo of blue frame hovering amid deep red curtains, and the only sign of any respect were a pair of armed civilian police. The route out was equally shrouded, followed by another airport corridor, and an exit which made it quite difficult to work out which building we had actually been into. The illumination of the Shroud, which is heavily blue accented to increase image contrast, was so flat that one could not honestly say whether one was looking at a cloth, a photo of a cloth, or even a projection. No, I forget, there was a brief prayer from somebody while we were in its presence, in which I caught the word Jesu, and it may be that the Italian versions of the pamphlet and film were more reverential. Now have a look at some of Charles’ pictures of expositions from the past. Now that’s what I call an exposition of a sacred object..","date":"2015-06-16","mins":"2:45 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-202490","author":"hugh_farey","post":"I wish I knew what people mean by a resolution of 5mm. Grab a pencil and draw the outline of the arms. How precise is it? 30mm, I reckon. The fingers and face are a bit better, but a contact image precise to an accuracy of 5mm is not good resolution, it’s poor. One of the arguments against the Shroud being some kind of bas relief rubbing is just that – its resolution is so poor. “I personally can discern the image of crushed nipples.” Quite possibly, and no doubt other people can guess too – but the chances of their guesses coinciding to with 5mm are very small indeed..","date":"2015-06-17","mins":"6:52 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-202681","author":"hugh_farey","post":"Yes that’s what they all say, and perhaps I misunderstand them. Can we detect collarbones or the Shroud image? Ribs? Kneecaps? You don’t need a very high resolution to see these clearly on images of people, and the Shroud shows none of them. I don’t know how the resolution of an image of a body should be quantified, but I do know that the Shroud isn’t very very high, regardless of what Schwalbe and friends think, unless, as I say, I misunderstand what they mean by a resolution of 5mm..","date":"2015-06-18","mins":"4:21 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-202741","author":"hugh_farey","post":"“How long shall repeat…” Don’t repeat at all, Max. If I don’t understand what you say, I’ll ask for clarification. If I disagree, then simply repeating it won’t change anything. In your post above you have vaguely explained why the Shroud image has such poor resolution; you have not demonstrated that it has good resolution. If it’s any help, many of the blood marks have very clear edges and can be said to have a resolution of a millimetre or so. If you and I both drew an outline of the wrist wound mark, for example, our two drawings would be unlikely to be different by more than a millimetre in any place. The same could be said of many other blood flows, but not the contusions. It could not be said of almost any feature of the image, except possible the line of the lower lip, although the X Ray teeth adherents don’t even agree with that..","date":"2015-06-19","mins":"2:01 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-202780","author":"hugh_farey","post":"You are still explaining why the resolution is poor rather than substantiating the opinion that it is good. Prof. Fanti did indeed say that the edge of the lower lip of the image was well defined, and I agree with him. The rest of the face is less so, and the rest of the body a mere blur. Optically speaking a well defined Shroud image would be one around which it would be possible for different people independently to draw outlines of various features (e.g. Arms, legs, eyes, fingers) and when superimposed they should not differ by more than a millimetre or so. I said that before. That’s my answer..","date":"2015-06-19","mins":"8:11 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-201932","author":"hugh_farey","post":"Rarely can two sides of a discussion be so determined to ignore – and here I really do mean ignore – each other’s evidence. There are two distinct and incompatible traditions of depiction of the image on the Shroud, and any explanation of how it was made must at least attempt to reconcile them. Thibault has very rightly drawn attention to the fact that many of those reproductions of the Shroud classed as ‘extractum ex originale’, dating from the 16th century onwards, show an indistinct, nude shape, with its feet together. This surely implies that from the 16th century the original was not very different from how it appears today, and Charles really ought at least to suggest an explanation for this version. I am not taken with the rapid painting on and off of crowns, loincloths, open legs and so on, which, if every copy is accurate must have occurred several times. On the other hand, almost every depiction of the Shroud being exhibited, also from the 16th century onwards, shows a very well defined shape, clearly visible for a long way, with legs apart and feet splayed. If the image was barely visible, then Charles’s detractors really ought to suggest a reason for this version. The idea that it was drawn clearly both so as to fit in with the technicalities of engraving, and to show people who bought it what they should have seen had they only got close enough does not explain the differences in posture and apparel very well. Did none of these eminent artists actually see the artefact they were representing, and did they all copy something else? Both versions are as likely to have crowns of thorns as not, bloodstains may or may not be present and are almost invariably different from the original, and where illustrations of the burn patches are included at all, they are often reduced to mere symbols, as if the artist had no idea of what they really were. Not until Carlo Cusetti’s image of the late 19th century is it obvious that any of the copyists were attempting an identical representation. Thomas de Wesselow, whose lecture I attended, agrees that painted linen cloths were very common, and that, being mostly ephemeral, there are only about eight extant today. He gives three different methods of painting them, with the suggestion that there may be others. I agree with him that comparing the Shroud to an illustration or portrait or even deliberate faked relic, makes little sense, but he does not explore the idea that it could have been one of the ‘ephemeral’ paraphernalia of liturgical ritual, of which no examples at all remain. Whichever side of the debate one chooses to support, there are serious anomalies in the evidence which need at least to be discussed, not dismissed, or ignored..","date":"2015-06-14","mins":"4:06 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-202369","author":"hugh_farey","post":"“Would gas diffusion, radiation or light that may have form the shroud image be part of the definition of imprint?” Only metaphorically, I think. The essence of the definition provided is that something solid has rested against the imprinted material. The mark made is either by some material on the solid, such as ink, or by deformation of the material, such as tyre marks. “Ray Rogers has estimated that even by a Maillard reaction, the image must have been formed in a minute fraction of a second.” Really? Where does he say that? “If the imprint was by contact, would that not mean that there would be no differences in intensity?” Not necessarily. The pressure of the contact could result in changes in intensity, the more pressure, the darker..","date":"2015-06-16","mins":"12:18 pm","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-18368","author":"hugh_farey","post":"Would it be considered heresy to say that I don’t believe there is a face image on the Jospice Mattress that needs to be explained by telergy. There are some smudges entirely consistent with a pillow and head slumped to one side. I found Thomas de Wesselow’s lecture compelling. He argued with good illustrations and in detail why neither the image not the bloodstains were not compatible technically, conceptually and stylistically, taking each aspect individually, with 14th century culture. I myself have difficulty in disbelieving the 1988 C14 ratings, but I appreciate that if it is a 14th century forgery, the shroud is certainly a ‘one off,’ quite outside the cultural norms of its time. His point in introducing the Jospice image was not to suggest that the two were made in a similar way, but to illustrate his next point, which was that naturally made (as opposed to supernaturally made) images are not unknown or intrinsically impossible..","date":"2012-10-26","mins":"1:38 pm","url":"https://shroudstory.com/2012/10/25/must-listen-thomas-de-wesselows-talk-at-shroud-enigma/","cat":"art","title":"MUST LISTEN: Thomas De Wesselow’s talk at Shroud Enigma"}]
