[{"id":"comment-191178","author":"hugh_farey","post":"You can find the article at: http://shroud.com/pdfs/n79part8.pdf. Briefly, different studies differ on how much pollen there is, where it came from, how it got to the Shroud, the precision with which it can be identified, and the biological and geological distribution of the species discovered..","date":"2015-02-16","mins":"4:48 am","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-191116","author":"hugh_farey","post":"1) Helichrysum of any kind does not appear among Max Frei’s list of 58 pollen identified species on the Shroud. Nor does it appear in any of the identifications of any of the subsequent pollen investigators (Danin, Baruch, Litt, Whanger). Its identification on the Shroud by Marzia Boi has been based entirely on photographs of type specimens and not on any actual Shroud pollen, either on tape or photographed. 2) Be that as it may, Avinoam Danin, in his Flora of Israel site (http://flora.org.il/), lists two species of Helichrysum, pallasii and sanguineum. The former is rare and does not flower till late June and can be rejected. The latter is common, grows around Jerusalem, and flowers in April. 3) Helichrysum sanguineum is an entomophilous flower whose pollen could not have blown onto the Sudarium. Its pollen could only have arrived on the blood of the cloth by being placed there. Despite Boi’s etymology (heli chrysum : sun gold), H. Sanguineum flowers are deep red, are sometimes called the Blood of the Maccabees, and have a similar significance as a memorial to fallen warriors as the poppy does in Western Europe. I do not know when this symbolism emerged, but at face value, the plant does not seem inappropriate for Jesus. 4) It is not clear to me what the precise relationship is supposed to have been between the Sudarium and the Shroud. A) Did the Sudarium cover the face, and the Shroud cover the Sudarium? The appearance of the image of the face on the Shroud through two layers of blood soaked Sudarium seems to me incredible. B) Did the Sudarium cover the face for the transport of the body to the tomb, whereupon it was removed and replaced by the Shroud? In which case why should it have been covered with flowers? 5) What is the provenance of the sample examined by the electron microscope? To date, at least on this site, there has been absolutely no evidence for any supposed pollen identification of the Sudarium other than vague suggestions. If Max Frei, or anyone else, took tape samples from the Sudarium, when did he do it, where is his report and where are the slides? 6) As has been mentioned Helichrysum species are found all over Europe, the pollen in individual species are difficult to identify, so there is nothing in this report that prevents the Sudarium from being an early medieval creation, as suggested by its (also unconfirmed) radiocarbon date..","date":"2015-02-15","mins":"9:04 am","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-191127","author":"hugh_farey","post":"Thanks, OK, but this is very much a secondary source. “At least nine of the sixteen species of pollen found on the Sudarium grow in Palestine”, says Bennet of page 4, and “There are about thirty types of pollen grains, three of which indicate that the Sudarium was in Palestine, and the rest clearly indicate a flora belonging to the Mediterranean region” she says on page 5. How does Janice Bennet know this? I guess she is quoting from two reports. Where are they? She mentions three Palestinian pollens, Quercus, Pistacia and Tamarix. Not Helichrysum, and not even Gundelia, which is a cornerstone of the Whanger/Danin hypothesis. How strange. Slide 18 on the pdf announces: “The electronic scan microscope makes it possible to identify a large number of pollen grains.” What does this mean? There are two pictures of pollen grains taken by a scanning electron microscope, but the microscope illustrated is not a scanning electron microscope, nor it is how Max Frei took his specimens. All very confusing..","date":"2015-02-15","mins":"1:33 pm","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-175076","author":"hugh_farey","post":"A Soxhlet purification process, which I believe is standard in cases of suspected organic contamination, would have removed the pollutants. What was the cleaning regime?.","date":"2014-12-07","mins":"6:07 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","title":"Paper Chase:  New observations on the Sudarium of Oviedo"},{"id":"comment-190825","author":"hugh_farey","post":"Thanks for the references, OK, but I can’t really agree with your statement “But the point is that bloodstains on the Sudarium surely are not random.” How, after all, can you tell? If the ‘points of congruence’ argument is used to establish that the two cloths are related, you have to start with the premise that there is no relationship, and show that that premise is wrong. If you start by assuming the two cloths are related, then of course you are likely to find the points of congruence more telling than the points of non congruence. However, as I said, it is not easy to discuss this without a clearer indication of what, exactly, the 120 or so points of congruence actually are. Is there a diagram of them? Who counted them up?.","date":"2015-02-12","mins":"10:21 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190838","author":"hugh_farey","post":"I missed the collection of measurements by professor Jose Antonio Sanchez quoted by Michael Hesemann earlier, but it epitomises my point of view. As quoted the comment is bordering on absurd. The ‘typical’ measurements of a Spanish man? Are all Spanish men ‘typical’, or are any Spanish men who are not typical also not Spanish? What are the measurements of a ‘typical’ Jewish man, or a ‘typical’ inuit for that matter. I trust that Prof. Sanchez actually reported his findings as a range of measurements, and probably in terms of proportion rather than absolute size, as larger people might be expected to have different measurements but in similar proportion if there is truly a racial stereotype. But all we have here is that the Sudarium face is 139mm, and a typical Spanish face is 127 130mm, therefore the Sudarium man is probably middle eastern. What about Norwegian? What is their national stereotype? Or Brahmin? Or Inuit? Or Bantu? As quoted, Michael Hesemann is far from convincing..","date":"2015-02-12","mins":"12:12 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190797","author":"hugh_farey","post":"As usual with Sudarium articles, it is remarkably difficult to check any of the alleged forensic findings. Whatever one may think of the conclusions of Heller, Adler, Schwalbe, Rogers or others of the S Tu RP team regarding the Shroud, as least we know what they did to arrive at those conclusions. With the Sudarium, from the composition of the stains (pleural fluid? really?) to their origin (marks of fingers? really?) to the pollen (quercus calliprinos? really) to the radiocarbon datings, very little of the primary investigation is available. I could only check one sentence. “The pollen quercus caliprimus was found, being limited only to the area of Palestine.” There is no such species nor ever has been. Either the author of the article got it wrong, or the authors of his sources got it wrong, or the original identifier got it wrong, which casts doubt upon his authority. What they all meant, I’ve no doubt, was Quercus calliprinos, which although commonly called the Palestine Oak, is native throughout the middle east and south west Asia, and is certainly not “limited only to the area of Palestine.” As for the ‘points of congruence’ game, it is invariably forgotten that ‘points of non congruence’ must also be taken into account. Take any two random scribbles and overlay them and there will be dozens of ‘points of congruence’. It is only by demonstrating that there are no ‘points of non congruence’ (or at least be explaining why they can be ignored) that any identification can be made. Because of the lack of sources I don’t really know what to make of the Sudarium, which is why I rarely comment on it, but this article is so clear and authoritative that it is necessary to ask how much is based on speculation, and how much can be verified independently..","date":"2015-02-12","mins":"5:55 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-216012","author":"hugh_farey","post":"Splendid. Now, focus on the question, Max. Does any author refer to the image of Edessa or the cloth of Addai as both ‘rakkos’ and ‘himation’ in the same article? Many thanks..","date":"2015-12-09","mins":"11:10 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216027","author":"hugh_farey","post":"No, don’t repeat anything, Max, just answer the question: Does any author refer to the image of Edessa or the cloth of Addai as both ‘rakkos’ and ‘himation’ in the same article? Many thanks..","date":"2015-12-09","mins":"12:35 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216038","author":"hugh_farey","post":"No, Max. The word ‘rakkos’ cannot mean a 4m long piece of cloth. Not at all. Never. Unless, of course, somebody has used it in conjunction with the word ‘himation’…..","date":"2015-12-09","mins":"2:07 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216064","author":"hugh_farey","post":"No, Max. A corpus is not an article. John of Damascus appears to have thought that the image of Edessa/Addai was a long cloth. The Acts of Thaddeus and Georgius Cedrenos seem to have thought it was a kerchief sized cloth. One of the two traditions is wrong. Nobody has described it being both at the same time. The fact that a long cloth can be folded to look like a small cloth is not an adequate reconciliation of the dichotomy..","date":"2015-12-09","mins":"5:29 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216072","author":"hugh_farey","post":"Yawn! That’s me, Max, bone idle – but right! While you scurry about making up unjustified assertions and philological prestidigitations – all wrong! Never mind, it’s all such… yawn… fun….","date":"2015-12-09","mins":"6:35 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215408","author":"hugh_farey","post":"There are also the two contradictory positions of the head during rigor mortis to be considered. For the Sudarium scenario, the head was jammed so tight against one shoulder that the cloth could not be passed around it. For the Shroud, it is sitting serenely on the shoulders. Also Mark Guscin has Jesus lying for hours in various positions in order for each layer of superimposed stains to dry before the next one is added, which does not seem to me very likely..","date":"2015-12-01","mins":"3:09 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215887","author":"hugh_farey","post":"Hi Max! Where is the image of Edessa, or the cloth of Abgar, described as a “rakkos tetradiplon”?.","date":"2015-12-08","mins":"6:59 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215915","author":"hugh_farey","post":"And you haven’t replied to my question, Max. Where is the Shroud referred to as a “rakkos tetradiplon”?.","date":"2015-12-08","mins":"1:42 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215937","author":"hugh_farey","post":"Thanks, Max. Sorry to be pushy but I only have access to one Greek version of the Acts of Thaddeus (Tischendorf and Lipsius), where ‘rakkos’ does not appear in conjunction with ‘tetradiplon.’ Indeed, it does not appear at all as far as I can see. I would be interested in your context. For the benefit of other readers, there is a point to all this. The word ‘rakkos’ (or ‘rhakos’) does not necessarily mean ragged or tattered, nor does it derive from any word which implies it might. Although it means ragged in the Odyssey, in the bible it refers to the clean new patch which must not be sewn onto old wineskins (Matthew 9:16, Mark 2:21). I think the whole essence of the word is that it is a small piece of cloth cut or torn from a larger piece. If the Edessa image, or the Addai cloth, is anywhere described as a ‘rakkos tetradiplon’, it refers to something much smaller than the Shroud. Max’s idea that it means “torn, pierced rag” or, even more extremely, “dirty kerchief/rag moisted with secretion” is wildly over interpretative..","date":"2015-12-08","mins":"5:23 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215947","author":"hugh_farey","post":"No, Max, you’re wriggling. There is no way that Mark and Matthew use the word ‘rakkos’ to mean tatty, dirty, pierced, ‘moisted’ or unclean. It is specifically used to describe a clean new piece of cloth with which to patch wine skins. It may have been torn, neatly from a larger piece, and if so, the edges were not a clean as a knife cut, but to equate the word’s use in the bible with the dirty, holed sheet you are claiming is wholly unjustified. And I gather that you now agree that the Acts of Thaddeus do not use the phrase “rakkos tetradiplon”. This kind of stuff: “See the Vienna ms (hist. Gr. 45) + liturgical instructions (August 16th, Holy Mandylion day) + Georges Kedrenos’ relation in his Synopse des Histoires,” is unhelpful. Can I ask, again, who, if anybody, referred to the image of Edessa or the cloth of Addai as a ‘rakkos tetradiplon’? I do not think a rakkos could possibly define a cloth as large as the Shroud, and its use to describe the image of Edessa or the cloth of Addai, if it was ever used, means that these artefacts could not be the Shroud..","date":"2015-12-08","mins":"6:13 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215991","author":"hugh_farey","post":"No, Max. Good try, but no. I agree that ‘rakkos’ has been used both as a dirty cloth and a clean cloth – indeed, I said so myself if you recall – but your arbitrary announcement that it meant a dirty cloth in this case was unjustified. And the fact that any particular ‘rakkos’ might be full of holes or dripping with secretions does not mean that the word itself implies any such thing. The word as used by the other sources you mention is not derived from the Acts of Thaddeus. It may be that, assuming the Acts of Thaddeus to be referring to a small cloth, that is why Kedrenos introduced it. And I disagree with your opinion about a ‘rakkos’ being as large as the Shroud. You don’t make a small cloth by folding up a large one. The best you have come up with here is a ‘large kerchief’, which by no stretch of the imagination can be 4m long. And no, you didn’t ask me about sindons or himations, you asked Charles. However, I would agree that you would have some philological justification if the same author, in the same place, referred any cloth as both a ‘rakkos’ and a ‘himation’. Is this in fact the case? A quote from John of Damascus might help your argument. And the Pray Codex, of course, shows no such thing, cryptosteganographically or otherwise..","date":"2015-12-09","mins":"9:09 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]
