[{"id":"comment-213762","author":"hugh_farey","post":"I don’t think the evidence for a significant difference in the areal density of the radiocarbon carbon area, as opposed to the main body of the Shroud, is very strong. 1) The Shroud has never been weighed, either with or without its backing cloth. 2) All the overall values for the mass of the Shroud are based on more or less unreliable estimates of the densities of linen and Holland cloth in general, or on abstruse calculations related to Compton scatter. 3) The mass of the radiocarbon samples was accurately determined several times, but their areas were, on the whole, not. Giovanni Riggi drew several contradictory diagrams with their dimensions, but how accurate they were seems uncertain. (http://www.shroud.com/pdfs/oxley.pdf) a) In one diagram he gives the first dimensions as 8.4cm x 2.2cm (with a bite taken out of one corner for the Raes sample) and a mass of 479.00mg. However, as two of the edges were rolled seams, the actual area of the cloth was greater, about 8.9cm x 2.7cm (but still with the bite). B) Riggi’s second diagram shows the dimensions after the seams were cut off. He gives 7.9cm as the length, and two widths, 1.35cm for the Raes sample end, and 1.70cm for the wider end. The mass is given as 300.00mg. Taking the average of the two widths, the areal density for the trimmed sample is 25.90mg/cm2. C) I do not know where Maria Grazia Siliato (http://www.cirac.org/shroud/Discussion/MGS CESS 36 42.htm) obtained her dimensions of 7cm x 1cm from. Does anyone? 4) Freer Waters and Jull (https://journals.uair.arizona.edu/index.php/radiocarbon/issue/view/175) examined a piece of radiocarbon sample retained from the Tucson sampling. It has an area of “approximately 0.5 × 1 cm and originally weighed 12.39 mg”, giving an areal density of 24.78mg/cm2. Barrie Schwortz later photographed this sample, with mm scales, from which it can be calculated that a more accurate value for the area is 0.52cm2 and the areal density therefore 23.83mg/cm2. All in all, this evidence shows no significant discrepancy between the areal density of the radiocarbon sample and the rest of the Shroud. Can anybody refute? And Hi Donn! Good to hear from you. Unfortunately your inability to find evidence for a medieval date for the Shroud is not evidence that such evidence does not exist. Have you tried Googling “Shroud” “not authentic” “evidence”?.","date":"2015-10-28","mins":"2:06 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213806","author":"hugh_farey","post":"Yes, Matthew, I do indeed ‘need’ all those things. It is my contention, however, that those needs have been supplied. I really don’t think the Pray manuscript shows any knowledge of the Shroud as we know it, that the Sudarium of Oviedo has even been anywhere near the Shroud, that the repair hypothesis is valid, or that the coins and pantocrators were based on the Shroud rather than the other way about. The reasons why I do not find the evidence to the contrary convincing have been explained elsewhere. That is not to say that there isn’t evidence, of course, just that it isn’t as convincing to non authenticists as it is to authenticists. Such is the enduring mystery of the Shroud..","date":"2015-10-29","mins":"4:19 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213772","author":"hugh_farey","post":"Hi John, Please list the disinformation. I am ever anxious to be scrupulously correct, as you know and shall be happy to be corrected or amended. For instance, I cannot find where Rogers noted a significant difference between the weight of his radiocarbon fibres and those of the rest of the Shroud. I should be grateful for the reference. As for anybody weighing the Shroud, I guess that was a bit of a challenge. I have attempted to discover any such weighing several times on this blog and elsewhere, and found nothing. If anybody knows anything to the contrary I, and the rest of the Shroud world, no doubt, would be very interested indeed. And thanks, OK. I think the Nature measurements were little more than a rough approximation, don’t you?.","date":"2015-10-28","mins":"3:39 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213803","author":"hugh_farey","post":"Really? You mean that you personally have no doubt about it. I have considerable doubt about it, and have explained in detail, several times, why..","date":"2015-10-29","mins":"4:12 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213810","author":"hugh_farey","post":"Very interesting, Thomas. The tomb is a Cadaver Tomb, or Transi, which appears to have developed in medieval Europe towards the end of the 13th century. I have long been familiar with one in Tewkesbury Abbey, but hadn’t realised they were a recognised genre, so to speak. One or two things that could be significant – where the cadaver is shown naked, one or both hands invariably cover his genitals, as I think the left hand does in your example above (Bishop Richard Fleming of Lincoln, and see the tomb of John Fitz Alan, 14th Earl of Arundel, for a clearer example), and in at least one example, the cadaverous part of the double effigy is carved in bas relief. This is a whole new avenue of exploration, I reckon. If Charles Freeman is watching this, what do you think?.","date":"2015-10-29","mins":"5:15 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213802","author":"hugh_farey","post":"Both Daveb and Thomas make valid points. The fact that the evidence for the areal densities of the Shroud being different is not very strong does not mean that there isn’t any evidence at all. Nevertheless, Dave B knows very well that the comparison Raes makes above is between the side strip and the rest of his sample, not between the ‘rest of his sample’, which intruded into the radiocarbon corner, and the rest of the Shroud; and that there is some evidence that the side strip does not always precisely line up to the place where is was cut off. As the yarn is of variable width and density, it is not surprising that any particular lengths should differ from one another. Raes himself said: “the count could only be determined on a very short length of material, and we have no indication about the irregularities of the yarn. Therefore it is not possible to state with certainty that Pieces I and II originate from fabrics of different manufacture.” Similarly, as has been continuously pointed out, there are few if any convincing comparable artistic renderings of the dead Christ. The point is moot. May I inquire where the photo above comes from?.","date":"2015-10-29","mins":"4:06 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213820","author":"hugh_farey","post":"No, well, that’s OK. There are indeed some unexplained markings on that drawing, and I often ask myself the same question as you – why are they there? I don’t know, but I’m not persuaded that they have anything to do with the Shroud..","date":"2015-10-29","mins":"7:21 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213919","author":"hugh_farey","post":"“… the Freeman/Farey objections are incredibly stubborn at best and disingenuously cynical at worst” “… Fallacy in Logic in several categories …” I think the key similarities drawn by authenticists between the Pray Manuscript and the Shroud are the Herringbone Weave and the Poker Holes. I really don’t think it either stubborn or cynical to say that the zigzag patterns on the lid of the sepulchre in the Pray manuscript look nothing at all like herringbone weave, or that the two unexplained patterns of circles on both the tomb and the lid are not necessarily representations of holes in the Shroud. I think before I could be accused of unnecessary obduracy I would like to see any other representation of herringbone which resembles a series of concentric zigzag ‘semi circles’ centred on different points at the edges on a rectangle, and also any other representation of Three Marys iconography showing a piece of cloth as a rigid sub rectangle at an unlikely angle. I can see that to Nabber, and no doubt to many other readers, similarities between the Pray codex and the Shroud are wholly unequivocal, but I hope that most of them will be able to understand that it is possible to disagree without being either stubborn or cynical..","date":"2015-10-30","mins":"9:09 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-48430","author":"hugh_farey","post":"Hugh: “To the best of my knowledge no threads from areas away from the C14 corner have been analysed.” O.K.: “So your knowledge is poor. Several threads outside C14 corner were extracted for specific researches, see for example Appendix D in Wilson’s 1978 Shroud. Also several threads were taken for Pier Luigi Baima Bollone for blood examinations.” Hugh: “Well that’s wonderful. Please don’t keep us in suspense. Where can I read these analyses?”.","date":"2013-10-22","mins":"2:02 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48425","author":"hugh_farey","post":"If you have any evidence describing any attempt to assess the proportion of cotton to linen in the threads of the shroud away from the C14 area I would love to know of it. Heller & Adler, Mc Crone and Lucotte describe their observations in detail. Rogers does not. In “A Chemist’s Perspective on the Shroud of Turin” he makes a number of statements about cotton, such as: “The shroud is nearly pure linen”, “Cotton is not common in Shroud samples”, “I did not attempt to make a quantitative cotton comparison between Raes and radiocarbon threads and Shroud tapes, because there was too little cotton of any kind on Shroud samples”, “We could not find more than traces of cotton on the Shroud. The cloth appeared to be pure linen,” and “Samples from the main part of the cloth are significantly different from the Raes samples and the radiocarbon sample with regard to cotton content.” Finally, of a tape sample from the ankle, “Absolutely no cotton could be found among the hundreds of fibres on this tape sample.” This hardly constitutes a blanket denial across the shroud, although it does suggest that cotton content is both small and variable. That would be in keeping with random fibres mixed in with the weaving, but not, I think, with any deliberate attempt to spin mixed flax/cotton thread. Supposing one did want to spin a flax/cotton mixed thread – perhaps to combine durability with comfort or something similar. What proportions would make a difference? 10% cotton? More? I haven’t a clue. Anybody like to guess?.","date":"2013-10-22","mins":"1:16 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48434","author":"hugh_farey","post":"Quite..","date":"2013-10-22","mins":"2:18 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48454","author":"hugh_farey","post":"“But you seem insistent that those who have such as Rogers are somehow incompetent or charlatans. Do you really think you are a better scientist than Rogers?” No, M’learned friend, I claimed nothing of the kind. I claimed that four men of much more experience and practical hands on experience of the actual shroud than me came up with four completely different ideas about the proportions of cotton on the shroud. You do not need to be any kind of scientist to think that 2% is a different number from 100%. Still, never mind, I note that after my detailed, clear and referenced response to your comment at 3:43 on 21 October, in which you wondered if anybody on this blog was intelligent, you suddenly introduced for the first time the question of vanillin and had the boldness to suggest that it was I who had ignored it. Not at all. Rogers’s observations are extremely interesting. The 1978 STURP tests for lignin had proved negative across the shroud, whereas Rogers did detect it on Raes threads given to him 20 years later. There are a number of possible reasons for this, but I don’t know enough about them, yet, to be able to account for it. I note that a description of madder root dye, which Rogers also found, says that it contains three coloured chemicals (alizarin, purpurin and xanthin) and also lignin, gum, sugar, resin, and various other minor chemicals. I wonder if that could be the source of the vanillin?.","date":"2013-10-22","mins":"6:32 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48495","author":"hugh_farey","post":"I see we have moved on from the evidence to the summing up, in the hope that the jury will forget the evidence. The quotations from Rogers’s book above cannot be summed up as “There is no interwoven cotton on the Shroud in chief. That is the quite positive determination of the STURP team” without a certain amount of terminological inexactitude. Next we have Rogers’s unimpeachable work in which he tested threads covered with madder and found vanillin. I do not dispute that for a moment. I wish I could ask him if it is possible that the positive vanillin test came from the madder rather than the threads, as the standard test he describes would not differentiate between the two. Nor does Rogers at any time say, or even imply, that he tested main shroud threads for vanillin. The lignin test (which relies on vanillin) was carried out by the STURP team in 1978, with negative results..","date":"2013-10-23","mins":"3:39 am","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48393","author":"hugh_farey","post":"As far as I know, the only opportunities for determining the proportion of cotton to linen in the main body of the shroud were by examination of the famous sticky tape slides and, possibly, by examination of the fibres vacuumed up from underneath. To the best of my knowledge no threads from areas away from the C14 corner have been analysed. The sticky tape slides were analysed by Heller and Adler (A Chemical Investigation of the Shroud of Turin), who say: “The microscopic survey revealed that there were a large variety of fibrils and particulates present in the samples along with occasional assorted “incidental” debris found in limited quantities such as insect parts, pollen, spores, wax, modern synthetic fibrils, red and blue silk, wool, and flair tip pen dye marks (due to a previous investigator).” They do not mention cotton as “incidental” debris, but then nor do they identify the “variety” of the fibrils they observed. The slides were also analysed by Walter Mc Crone (Judgement Day for the Turin Shroud), who says: “Since the extraneous but rare particles may be of interest, I will list them: silk, wool, linen and cotton fibres of various colours, wax spatters, bird feather fibres, rodent hairs, mica, limestone (calcite), quartz, aragonite, starch grains (corn and wheat), pollen (average less than 2 3 pollen grains per tape), mold spores, trichomes (leaf hairs), flash (oil soot, power plant, incinerator, trash burning, Jeweler’s rouge, paper fibres, pigments (madder, orpiment, yellow ochre, azurite), paint fragments (titanium white, ultramarine, yellow ochre), plant and insect parts, charred linen fibres, etc.” I wonder how Heller and Adler came to miss all that! Neither of the above descriptions seems to be at all definitive. It is clear from both sources that the composition of the woven material was assumed to be linen, and no consideration was given to any possible admixture, all the non linen fibres being dismissed as ‘incidental’ or ‘extraneous.’ And that brings us to Gérard Lucotte’s highly controversial examination of some fibres hoovered up from between the shroud and its backing. He says: “Nous avons pu computer lors de notre dénombrement 16 fibres individuelles de cotton (pour 137 fibres de lin).” (about 10%) Is cotton unique to the C14 sample area? No. Have we sufficient evidence to claim that the sample area contained a different proportion of cotton from the rest of the shroud? No. Can we be sure that the cotton content of the shroud is constant throughout its area? No. I don’t know what to make of it all, myself..","date":"2013-10-22","mins":"9:07 am","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-39617","author":"hugh_farey","post":"Freer Waters & Jull; Investigating a dated piece of the shroud of Turin, Radiocarbon, Vol 52, Nr 4, 2010, p.1521 1527. “The warp fabric count is 30 yarns per cm (76 per inch) and the weft is 40 yarns per cm (102 per inch).” Although the numbers are reasonable, Freer Waters & Jull clearly have their warp and their weft the wrong way round. On the other hand; Mark Oxley; Evidence is not Proof, http://www.shroud.com/pdfs/oxley.pdf, gives counts from the following: Timossi: Warp 40, Weft 27 Raes: Warp 38.6, Weft 25.7 Vial: Warp 37.6, Weft 25.8 Vercelli: Warp 36, Weft 24 Fanti: Warp 38, Weft 27.5 These quotations disagree substantially from Andrew of Nashville’s quote (from Wilson, quoting Vial) above, but agree precisely with Jos Verhulst..","date":"2013-07-23","mins":"6:49 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","title":"Max? Anyone? Thread count for the Shroud of Turin"},{"id":"comment-39656","author":"hugh_farey","post":"Well there it is in black and white, but it must be a misprint surely. Nobody thinks there are twice as many threads in one direction as the other per unit length. Presumably Wilson’s reference derives from Gabriel Vial’s CIELT Symposium paper from 1989. Does anybody have a copy? Meanwhile, the plot thickens… There are two photos of the same piece of shroud, at https://shroudofturin.files.wordpress.com/2011/01/image12.png and http://www.shroud.com/pdfs/arizona.pdf (Figure 2, top), both with scales, which can be printed out and literally measured. Curiously, while the weft threads (in columns across the photos) are relatively consistent at about 29 threads/cm, the warp threads (in rows from top to bottom) differ remarkably, from about 26 threads/cm in the first picture to about 42 threads/cm in the second, as if the sample had tightened up in that direction by the time Schwortz came to photograph it, or the first photo is considerably distorted in that direction. Fascinating….","date":"2013-07-24","mins":"12:01 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","title":"Max? Anyone? Thread count for the Shroud of Turin"},{"id":"comment-152506","author":"hugh_farey","post":"I have written to the author of the paper for a bit more explanation. The fibre is far too thin to be any kind of stitching thread. If it is twisted into a shroud thread I wondered if it could be a hair from the weaver or spinner. If not, then a fibril from one of the stitches used to connect the backing cloth to its outer backing, a hair from a researcher or priest, or a modern fibre from clothing or floating house dust..","date":"2014-09-19","mins":"11:19 am","url":"https://shroudstory.com/2014/09/18/new-textile-report/","cat":"paper_chase","title":"New Textile Report"}]
