[{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Hiya jman\nYup, I’ve seen it, and to say I was truly appalled at the gross liberties taken with the use of physical techniques to probe forensic microchemistry and biology would be a massive understatement. I inserted this brief statement into my July 1 posting (the one preceding yesterday’s “infrared” posting):\nSaturday July 8th\nSee (or better still, don’t) this latest Fanti et al bit of fantisy masquerading as analytical chemistry:\nLInk to: Atomic resolution studies detect new biologic evidences on the Turin Shroud\nSindonological pseudoscience does not get much worse than this. Which referees on Plos One allowed this paper through? Name them!\n######################\nNuff said methinks…\nThanks for your interest (and visit).\n","date":"July 14, 2017 at 6:30 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-9689","author":"Colin Berry","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Hi Colin are you aware of a recent scientific article released around June 30th showing new research on samples obtained from the shroud? It was revealed that blood was found from these samples and they reveal chemical coumpounds that are released into the blood stream during a traumatic injury on the body. Im skeptical of course as too how prevelant these chemical conpounds really are in the blood stream. Also if real human blood is found how would that play into the hoax or creation of the shroud? Did the creator cut his own hand lol! Seems as though you are greatly educated on the subject and the only skeptic who is consistently doing research into the subject. Thanks for your great work I plan to continue to read through it and learn more about this subject. Heres the original research paper: http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0180487. Just wanted to know your thoughts, thanks!\n","date":"July 14, 2017 at 3:56 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-9688","author":"jman98","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Hello again Matt\nAre you still around (I’d understand if you weren’t, you being as you’ve said a busy fellow with a wide range of interests)?\nI think I’m now able to explain the ‘second face’ in a way that is backed up with experimental data.  See my current posting dated July 1 : “My Model 10 – thermal imprinting with white flour onto linen – can account for the curious properties of the Turin Shroud body image”\nPreviously I thought it was a  mechanism operating entirely from the imprinted side, relying on capillary transport in the narrow channels between the closely packed linen fibres within each linen thread. I’ve now had to revise that view.\nI now think there’s something going on INSIDE each linen fibre, maybe involving even narrower capillary channels between cellulose microfibrils  within linen fibres (maybe not) and that effects of oven heat on the most superficial hottest parts of the reverse side of the linen are activating that mechanism so as to produce the second reverse-face image. See my latest photomicrograph copied/pasted from the end  to the start of the posting. In short, the ‘second face’ effect depends on simultaneous heat BOTH sides of the linen: a preponderance of heat reaching the reverse side of the linen favours a more intense reverse-side image as can be shown experimentally using different geometries inside the oven as regards position of linen relative to source of oven heat.\nThese are early days experimentally – there is much more to be done. For now, let me leave you and other site visitors with this thought: if the reverse side image on the newly-created Shroud was anything like my model system, then it comprised highly superficial coloured fibres mixed in with many uncoloured ones, giving an overall impression of faint  straw colour. But those coloured fibres were fragile and brittle, and over the centuries many will  have snapped off as a result of handling and fallen away, leaving the merest hint of reverse side colour that we see today! For all we know, the early owners of the Shroud did not care for the reverse side image, and may have hastened its disappearance with gentle brushing, snapping off those brittle reverse-side fibres! \nThat reverse side image, or rather modelling thereof, is providing a valuable and unexpected research tool – but I’m not expecting ‘sindonology’ to display the slightest interest, whether at Pasco next week or thereafter. Sindonology has no time – and indeed nothing but contempt – for any thinking that does not presuppose a 1st century provenance and authenticity. On that basis alone, sindonology is for the most part PSEUDOSCIENCE…\nGoogle has dropped this site from its ‘any time’ listings for a (shroud of turin) search where it used to appear anywhere between pages 3 and 7.  I wonder why…\nThe pen used to be considered  mightier than the sword.  But the  online keyboard is sadly not mightier than the world’s favourite search engine, not while the latter pursues its own mysterious self-interested  agenda, no doubt influenced by outside pressures ..\nToday’s headline in the London Times, July 13, 2017:\nGoogle pays academics millions for key support\nResearchers get secret funds\nGoogle has paid millions of dollars to academics at British and American universities for research that it hoped would sway public opinion and influence policy in favour of the tech giant. A watchdog identified 329 pieces of research funded directly or indirectly by Google since 2005 in key…\n","date":"July 13, 2017 at 6:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-9679","author":"Colin Berry","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Btw, whats the vertical line that looks like a fold running down the length of the Shroud on the one side. I looked at shroud scope and it looked like its part of the original cloth, is that a fold or something? Someone was trying to prove to me along time ago that that was the (already debunked) “invisible reweaving area”. Could you fill me in on that?\n","date":"April 8, 2017 at 5:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8852","author":"Matt","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"It’s the so-called side strip, approx 6 inches wide Matt. The weave is continuous with the main body of the Shroud, with some suggesting there’s been no separation – the seam being a tuck to create piping, others that for reason or reasons unknown, the edge was cut completely off then reattached to preserve the original alignment.\nNobody can call themselves a real sindonologist until they have racked their brains on the side strip, then produced a pdf full of ifs and buts leaving the reader none the wiser. I’ve yet to cross that particular bridge.\n","date":"April 8, 2017 at 5:58 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8854","author":"Colin Berry","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Thanks again Matt. I’ll start with your 5, order still to be decided, probably posting the first on Saturday pm am (UK time). First I have to compose a preamble, making clear how and why things have gone seriously off-beam in sindonology. \nThe rot began to set in with the 1981 STURP summary*, the background to which can be found towards the end of John Heller’s 1983 book on his involvement with the STURP project. Wild and inaccurate ‘acid-fixated’ chemical speculation involving atmospheric oxygen, essentially mimicking the natural ageing of linen cellulose, was promoted  in the STURP Summary as if established fact, discouraging  more promising lines of experimental modelling, notably those involving THERMOchemical as distinct from mere chemical ones.Then the propaganda started against anything that could be tagged as a “scorch hypothesis”, with the ludicrous claim  that “all scorches fluoresce under uv”. It’s time that someone started to set the record straight. I guess that someone will have to be me.\n* See this passage in particular:\n“The scientific concensus  (sic) is that the image was produced by something which resulted in oxidation, dehydration and conjugation of the polysaccharide structure of the microfibrils of the linen itself. Such changes can be duplicated in the laboratory by certain chemical and physical processes. A similar type of change in linen can be obtained by sulfuric acid or heat.”\n","date":"April 6, 2017 at 11:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8835","author":"Colin Berry","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Thanks Matt. Any thoughts on which to tackle first (first 5 or so)?\n","date":"April 6, 2017 at 10:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8833","author":"Colin Berry","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"I was interested in 8 and 23 (I would call it a failure, instead of ill judged) the whole vanillin “dating” has every flaw that creationists level against radiometric dating and I’m willing to bet a lot of these shroudies are creationists (maybe not all). 19 and 2 especially 2 because its a laughable argument like looking at a whale and calling it a monkey. There IS “blood” on the hair. 29 as well. In summary 8, 23, 19, 2 and 20 where the ones that stuck out the most.\n","date":"April 6, 2017 at 10:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8834","author":"Matt","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Hello again Matt. Are you still looking in? If so, here’s a progress report. I’ve listed some 27 points – see below –  re STURP’s performance (plus later  authenticity-promoting ‘sindonologists’) that I consider represent a  hugely irritating and frustrating non-enlightenment as regards the nature of the Turin Shroud.  Let’s not mince our words: most could have been avoided by more careful selection and screening of personnel, more objective, less bedazzled by things such as so-called  “encoded 3D properties” (just one of many instances of galloping pseudoscience)).\nMy next posting, to be started at the weekend, will take each of those 27 points from the outline skeleton and develop them more fully. It will take days, probably weeks, to do justice to them all, but I’ve decided to make it a single posting. To keep length to a tolerable minimum there will  be a few images only (I may decide to set up a separate image archive elsewhere, having 2 other semi-dormant websites to choose from).\nHere we are: 27 points (maybe more to come!):\n1. Dispensing with the cylindrical, wrap-around distortion objection to imprinting via direct contact.\n2. Addressing the claim that blood not really on the hair, used in Trojan horse strategy to claim image and blood are out of stereoregister, then used to implicate radiation as imaging mechanism\n3. Failure to recognize that ‘neck crease’ is no ordinary crease, failure to appreciate  the clue it provides to imprinting mechanism that utilizes direct contact and applied pressure.\n4. Failure to consider the evidence for thermal imprinting mechanism, indeed contemptuous dismissal thereof.  Failure to do experiments with model scorch imprinting (3d, bas relief etc).\n5. Failure of STURP  to recognize that blood stains are too good to be true. Coroner Robert Bucklin’s inability to recognize that blood stains cannot necessarily be equated with wounds.\n6. Failure to recognize that  a subset of bloodstains – the scourge marks  – are also too good to be true, with near-perfect imprinting of the metal bead tips of one or more Roman flagra.\n7. The radiocarbon dating:  why the opposition to repeat testing (St.Louis conference, 2014) coming from STURP team leader and other big shot attendees at Discussion forum no less.\n8. The ‘just a painting’ nonsense from someone with no scientific credentials -and scarcely any significant ones as a historian either. Shame on ‘History Today’ for allowing that shallow, ill-informed nonsense into the public domain.\n9. STURP’s failure to prioritize, to go to Turin with one or more positive models.\n10. STURP’s failure to ensure proper sampling methods for blood and body image. Rogers’  fait accompli re “Mylar sticky tape” and the severe practical problems it posed for himself and others, notably those charged with blood testing.\n11. STURP’s failure to properly characterize the presence of authentic human porphyrin, despite late recruiting of porphyrin specialist Alan Adler. Adler’s self re-invention as a physiology/medicine expert re blood clotting, liver metabolism etc. Ouch,\n12. The premature embrace of radiation models, ones that go beyond any known science (like auto-emission of electromagnetic or nuclear radiation from a corpse).\n13. The cursory attempt to dismiss any kind of imprinting by direct-contact, based on self-serving models.\n14. Failure to grasp the implications of the negative image.\n15. Gross overhyping of so-called ‘encoded 3D properties’. Failure to experiment with model imprints that would distinguish between 3D properties and 3D response in computer software programmed to read  and re-map image density as height on an imaginary z axis with virtual shadowing as an optional 3D-enhancing extra.\n16. Failure to recognize that the TS was seen by  early viewers as a body IMPRINT left on J of A’s linen  by SWEAT and blood, and could thus have been designed as such in the 14th century.\n17. Failure by STURP and later sindonologists  to recognize that the biblical account does not permit one to assume that the linen, whether authentic or not, was used and intended as a BURIAL shroud, when its purpose was  probably for improvised ‘stretcher’ ‘/bodybag’  transport between cross and tomb.\n18. Overhyping of alleged image superficiality, the justification for resort to radiation, lasers etc. Failure to place microscopic transverse sections of threads or even single fibres into the public  domain, assuming  (optimistically) they were ever part of the experimental protocol.\n19. Attempts to use uv fluorescence  or lack thereof – with no experimental data – as a means of dismissing the ‘scorch hypothesis’ (some scorches?  all scorches?  all thermal imprinting mechanisms?) . Meaning of “scorch”?\n20. Certain of the more over-hyped aspects of the “blood stain” story, like why the blood looks too red to be authentic blood (“extraordinary levels of bilirubin”) , the ‘blood-before-image’ mantra etc etc. Unrealistic scenarios re behaviour of  detached blood clots etc.\n21. Heller and Adler’s failure to recognize the real significance of their important diimide bleaching finding. Its use to inflict an over-dogmatic identification of the image chromophore as “conjugated carbonyl” with an untested oxidation model, failing to recognize that double bond formation is achievable by chemical dehydration of sugars alone, not needing oxidation. Inappropriate unrealistic  model for chemical dehydration (conc. H2SO4)  that sidelined thermal dehydration. Assumption that cellulose is the only target for fibre coloration, ignoring other endogenous or exogenous compounds.\n22. Rogers’ alternative Maillard hypothesis. Pros and cons. Inappropriate deployment of 60 degrees C in his model system, having claimed his Maillard chemistry would work at rock cave temperatures. Failure to make clear how starch can serve as source for “reducing sugar”;  questionable substitution of dextrins (semi-hydrolysed starch) for starch in model system. How quietly tweaked self-serving models risk undermining research credentials.\n23.  Ill-judged attempts to substitute chemical for radiocarbon clocks by Rogers (vanillin) and Fanti (spectral changes, mechanical strength testing) all of which are invalidated if image formation required an oven-heating stage (accelerated ageing).\n24. To be announced later.\n25. Rogers’  inadequately documented claim for blood hydroxyproline as a marker for Shroud having not been exposed to heat. Likely confusion between blood and connective tissue collagen etc., between free and protein-incorporated hydroxyproline.\n26. Rogers’ claim for crystalline  supposedly ‘native ordered’ cellulose as a marker for Shroud linen not having been exposed to heat. Failure to recognize phenomenon of retrogradation (i.e recrystallization after ‘melting’) as pointed out by Adrie van der Hoeven.\n27. The controversial  involvement of microscopist Walter McCrone, with claims that the body image could be entirely accounted for as paint pigment, notably red ochre (iron oxide). Failure of STURP to shoot that down at the earliest opportunity with the diimide finding,  allowing the mistaken notion to take root, surviving to the present day as the risible attention-seeking  pseudo-scientific, pseudo-historical  ‘just a painting’  dross.\n","date":"April 5, 2017 at 9:49 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8814","author":"Colin Berry","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Sounds like a plan, I look forward to reading.\n","date":"April 6, 2017 at 9:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8831","author":"Matt","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"The Shroud image is said to be super-superficial, yet I have still to  see any quantitative measurements to justify the alleged 200nm thickness.  Do they exist, or are we being conned with still more fanciful, self-serving pseudoscience (“too superficial to be man-made”)?\nThe obvious way to measure image thickness would be to look at a cross-section of an image fibre under the microscope, maybe with added contrast,  to make the faint yellow coloration appear as dark brown. That’s a cross- section note, since one can learn next to nothing about image thickness  from a longitudinal section, e.g STURP’s Mark Evans photomicrographs.\nI have yet to see sindonology display an image fibre cross-section. Why not? \nThat’s one more black mark to STURP and its so-called ‘documenting photographers’.  Microscopic  cross-sections play a hugely important role in science. \nIf anyone knows of an image fibre cross-section,  please supply a link.\nPS (added Tue April 4). I should have said “cross section of entire thread“, it being important to know if there’s coloration in the tiny channels between the fibres, initially narrow air-filled cavities,  as my flour-imprinting, thermal-cocktail-exuding Model 10 would predict.\n","date":"April 3, 2017 at 7:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8801","author":"Colin Berry","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Any time you feel like doing a guest posting, Matt, you have only to say, given we’re both on the same wavelength.  It would give me a few more days in which to continue sketching out my next posting where I finally sit in judgement on the whole of STURP and subsequent sindonology (a thankless unedifying task, believe me, given the almost totally non-joined up thinking).\nOne or maybe two thousand words, more or less if you prefer, to sciencebod01@aol.com?\nPlease say YES!\n","date":"April 3, 2017 at 3:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8798","author":"Colin Berry","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"I’d love to, but my time is limited, I’m a busy guy. Not only that I’m still learning the science (or lack thereof) behind the Shroud. Needless to say you are definitely more equipped to post about the subject. I do write on my spare time about a load of topics, mainly refuting young-earth creationism and miracle claims from the Catholic Church. I haven’t posted any of it on any forum since my writings are just for me to organize my thoughts. There’s a lot of b.s out there for sure and many instances of these religious zealots lying through their teeth to stir the fears and the “feelies” of the faithful. However, I will keep your offer in mind if I write anything that would possibly be of value for this blog.\nBut I’m not kidding, would the people who own the Shroud allow you to take samples if you asked?\nAlso, I just viewed your post “Modeling the Shroud of Turin with White Flour, Olive oil and a real face” and saw the pictures of the hands https://shroudofturinwithoutallthehype.files.wordpress.com/2016/01/scan-300-dpi-oil-v-flour-only-control-magnified-then-screen-grab.png?w=640\nI was amazed by the detail and shroud like images (I was surprised Thibault was impressed too). However, my question is, were these images as superficial as the actual shroud image and/or your experiments on the “To all those who persist in claiming the Shroud image is far too superficial…”\nThanks for the feedback, and I will keep your offer in mind.\n","date":"April 3, 2017 at 3:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8799","author":"Matt","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"They’re all pseudoscientists, in every sense of the word. And they want to keep it a mystery and exaggerate their claims and pretend the radiocarbon date was wrong and pretend there’s blood on it, and pretend it’s a photographic negative, and pretend some more.. It seems they want to keep it a mystery and get the feelies and keep the circus going. Btw, you’re a scientist, have you ever thought about getting your hands on the Shroud of Turin and do your own examinations? Or do they only allow believers.\n","date":"April 3, 2017 at 2:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8797","author":"Matt","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Thanks Matt. \nThat posting is in preparation as we speak. It’s taking longer than expected. Why? Well, it means having to re-examine some of the claims of folk who have passed on and thus no longer around to defend themselves. That either strains my highly undeveloped diplomatic skills to breaking point, and/or risks blunting the intended message. One shall endeavour to err on the side of hitting where it hurts (the living) or no longer hurts (the dead)! There’s been too much kid glove treatment if you ask me, an essential component of keeping negative comment in the family  and/or sanctifying dear departed relatives, and thus keeping the authenticity-promoting,  playing-to-the-gallery show/circus on the road to continue its journey unhindered by the likes of we callow sceptics.  (One has only to look at the provisional self-serving programme for July’s grandly titled “International Conference” in Pasco, Washington State to see what I mean. How do you like your image-forming and/or radiocarbon date-skewing  body-emitting neutrons served up – by nuclear engineer Bob Rucker or lawyer-turned-celebrity-author Mark Antonacci, neither of whom responds to my emails) .\nProvisional plan is to post a skeleton version,  hopefully by the end of the week, and then flesh it out in additional bite-size instalments  – in other words to become by degrees a gradual living, breathing thing – one that makes best use of the informal open-to-all, feel-free-to-criticize blogging format chosen to report this still-ongoing raspberry-blowing project in real time.\n","date":"April 3, 2017 at 6:11 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8796","author":"Colin Berry","site":"colinberry"},{"title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?","post":"Hey, thanks for dedicating a post to my comment. I didn’t know it was worth that much. Looking forward to reading,“Turin Shroud: so how come STURP managed to get it so COMPLETELY wrong?”.\n","date":"April 3, 2017 at 1:29 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","id":"comment-8789","author":"Matt","site":"colinberry"}]
