[{"title":"Paper Chase:  The Second Face Defended","post":"Giulio had sent power point slides but the flash drive that I put it on   failed.\n\n","date":"December 4, 2014 at 5:34 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","id":"comment-174589","author":"jmarino240","site":"shroudstory"},{"title":"Paper Chase:  The Second Face Defended","post":"I still have the old interview-article covering part of this topic in pdf and will send it to Dan later, leaving it to him to decide whether it should be uploaded. After having been advised from serious sources in the realm of Shroud studies that there is no second image, the decision was taken to store it for a while.\nThe shroud.com 1 December, 2014 update has put the latest interview-article on the “black list”, together with others that have had no peer review. I make it a point not to be anyone’s mouthpiece and do think that there should be explanations from whoever proffers any paper, whether scientific or historical.\n\n","date":"December 4, 2014 at 6:27 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","id":"comment-174597","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  The Second Face Defended","post":"What do you mean “black list”?  What did shroud.com actually do?  I would like to see the interview.\n\n","date":"December 4, 2014 at 6:40 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","id":"comment-174598","author":"Paulette","site":"shroudstory"},{"title":"Paper Chase:  The Second Face Defended","post":"By “black list” I meant those papers listed on shroud.com as not having been peer-reviewed. Since my interview-article was on the list I presume that is because of the responses, not my questions. If there are any questions about my questions I am willing to thrash things out on this blog.\nDan has rightly pointed out more than once that peer review is controversial. After all, a peer-reviewed paper is one that merits consideration, it is not gospel truth.\nAfter years of reviewing books I can state that even academic books can and do contain rubbish, with authors or contributors with PhDs writing rubbish, moved by prejudices, promoting distortions and, worse, even demonstrating hatred.\n\n","date":"December 4, 2014 at 6:07 pm","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","id":"comment-174664","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  The Second Face Defended","post":"Louis, send it. I’ll upload it and make it available to anyone.\n\n","date":"December 4, 2014 at 7:19 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","id":"comment-174602","author":"Dan","site":"shroudstory"},{"title":"Paper Chase:  The Second Face Defended","post":"Dan, I have just sent the interview-article to you. You and readers here may have read it since it is not new. It was ready not long after the peer-reviewed paper was published in “Applied Optics” and dwells on the second face and the corona discharge that is supposed to have been the only process that could produce it.\nFurther to what I posted above, Ian Wilson’s last Shroud book says that “some vestiges of a face” could be seen when Professor Giovanni Riggi saw the underside of the relic. The controversy could come to an end if Turin releases at least some of the microphotographs of this site it has in its possession.\n\n","date":"December 4, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","id":"comment-174663","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  The Second Face Defended","post":"This is a storm in a teapot.\nG. Fanti got a massive coverage after publishing his paper, the article should stand by itself without the reader looking for another interview.\nAs soon as july 5, 2004 Barrie cautiously  added:\n“It is interesting to note that the Turin authorities currently deny the existence of any image on the reverse side of the cloth, in spite of the peer-reviewed work done by Giulio and Roberto. I believe that making the high resolution 2002 images available for further study by qualified researchers would be an excellent means of avoiding further controversy on this issue.”\nAnd we know how reluctant Turin authorities are to take a stand for a scientific issue…\n\n","date":"December 5, 2014 at 1:32 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","id":"comment-174714","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase:  The Second Face Defended","post":"As far as I know, it is the blogmaster who decides whether any material is worthwhile posting or not.\nIt seems that my previous comments have not been read. The interview has a defence of the methodology by the interviewee because the double image is linked to the corona discharge that has been proposed. Other controversies about the Shroud are also discussed.\nNow I will repeat what I said in the previous comments. I am a journalist and there are rules to follow, including listening to other points of view. I will not be anyone’s spokesman, the differences have to be thrashed out in an objective way, avoiding personal attacks, that is ethical conduct. Being so, serious sources in the realm of Shroud have informed me that there is no second image. If Dan uploads the pdf it will be left to readers in general to discuss the matter, although obviously what scientists or those who understand image processing have to say will be more important. There was no direct access to the relic, and the images were scanned from a book.\nDan has pointed out umpteen times that peer review can also be controversial, in response to the “black list” in the shroud.com 1 December, 2014 update. As one who has been reviewing books, academic and others, for a number of years I must add that this applies to academic books as well. I have seen prejudice, distortions and hatred in academic books, with essays written by those with PhDs.\n\n","date":"December 5, 2014 at 5:50 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","id":"comment-174734","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  The Second Face Defended","post":"Despite reading Fanti and Maggioli’s pdfs several times, I still have difficulty in deciding whether the claim for there being a real reverse side image being on the top few fibrils has really been demonstrated. There’s certainly no colour plate showing sepia coloured fibres on the reverse side, and as far as one can make out the evidence is all indirect. Some of that evidence is questionable in my view (while having no expertise in image analysis). For example, we are told that when one colours up the front side of linen with graphite, one cannot see any black shape when viewing from the opposite side. Ipso facto, we are told, the reverse side image is not merely a weaker penetrating form of the front side image.\nBut much depends on the background surface on which the fabric is placed, whether it’s white and reflective or not, as I discovered and reported some time ago.\n\nNote the faint reverse-side image on the left. It’s entirely artefactual, and is due to bleed through from the reverse side. Examine the faint image through a hand lens and one finds the colour is entirely in the interstices of the weave, which as we know are just holes. How can holes be coloured? \nThere’s a simple explanation, as my photograph on the right shows. White lights enters the fabric from the reverse side, and exits from the opposite side as red light, due to  abstraction by the marker pen ink of certain non-red frequencies, as  ne can see from the patch of red light on the white background. But that red light can be back-reflected, and return to the viewer’s eye through the interstices of the weave, giving rise to that faint reverse side image. However, place the fabric down on a black background, and the reverse side image disappears from view! Why? No more back-reflection!\nMaybe Fanti’s test with the graphite was unfortunate, having chosen a very black substance that would abstract ALL the frequencies of white light, so that back-reflection would be that of modestly attenuated white light that might be difficult to spot, even on a white background. If his background had been dark he could not have expected to see the outline of the graphite at all, at least not via the interstices route described (though I make no claim that is the only path for back-reflected light). He should have chosen something other than black for his penetration test, and looked for colour!\nSpeaking of which – colour that is – there’s no substitute for a good colour photograph taken at a hand-lens level of magnification. If someone has those photographs for the reverse side of the TS, minus Holland cloth, then PLEASE let’s be having them…\n\n","date":"December 5, 2014 at 2:44 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","id":"comment-174720","author":"Colin Berry","site":"shroudstory"}]
