[{"id":"comment-92441","author":"steve_hammond","post":"Thanks for the welcome, Mike! No relation to Max Patrick Hammond that I know of…(I’m genetically a “Hamilton”. Long story that I won’t bore you with.) ;).","date":"2014-03-23","mins":"8:33 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92433","author":"steve_hammond","post":"I’m new here so my first post upthread was held up for moderation… Will repost this from above: “Also, I find it interesting that the neck crease crosses the lower edge of the non image area lateral to the face, which is,according to Colin, an area of non contact with the bas relief. I find it hard to believe a crease could be “cooked in” in this location under Colin’s scenario. Just some thoughts…”.","date":"2014-03-23","mins":"7:54 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92743","author":"steve_hammond","post":"I agree, Colin, that is an excellent image. It actually supports my point which is not that the crease extends lateral to the hair, but extends across the “gap” between the face and hair–the “dark area” where there should be little to no contact with the linen in the scorching scenario..","date":"2014-03-24","mins":"2:11 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92375","author":"steve_hammond","post":"First post here from someone who has been fascinated for years by the shroud. I’ve been catching up on old posts here and on Colin’s blog. I am a physician (gastroenterologist) so no particular expertise regarding the shroud, but of course familiarity with science. I lean toward the shroud being authentic, but I applaud Colin’s probing endeavors and research and think it serves a valuable purpose. That being said, I don’t yet buy that the creases he points out are “cooked in.” I see lots of creases on the Enrie and Durante images on Shroud Scope. Many of these are far from image areas and should be very different from the neck and head creases Colin points out as they should not be “cooked in”. (It would be interesting to see the enhanced images in these areas.) Also, I find it interesting that the neck crease crosses the lower edge of the non image area lateral to the face, which is,according to Colin, an area of non contact with the bas relief. I find it hard to believe a crease could be “cooked in” in this location under Colin’s scenario. Just some thoughts….","date":"2014-03-23","mins":"4:49 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"}]
