[{"id":"comment-5511","author":"john_macgillivray","post":"Well ,with all of these testimonies…and I haven’t read them all but what I have read I must admit…are sincere,compelling and believable.WHY ARE THEY BELIEVABLE ? Because 40 years ago I was lying in a hospital bed wasted away from too much street drugs and in a very weak state.It was all within the same hour that I was admitted when something happened that changed my life…I was never the same again. Shortly after being admitted I was lying in the hospitable bed thinking I was slowly dying…when the fear of death and the unknown was racing through my mind and so I began to call out or pray to God.I was a little delirious but I remember exactly what I said and exactly what happened after wards. Earlier before being admitted I really didn’t care if I was dying because I was so terribly disappointed in myself and in my inability to live according to my conscience and according to what I felt was a more decent way to live my life. As I began to my prayer or what was then “a cry of desperation”…I said “God give me another chance ,I am not ready to die…I can do better with my life just give me another chance…I know I can do better”.These were the exact words on my lips,spoken slowly and in a weakened state…what happened next was nothing short of miraculous. I can give this testimony without fear of being thought of as trying to “standout” in my own personal experience.Because I believe I could be doing much more to share this experience with a greater number of people…and so far I have not.I have shared it…but not in great detail.I have written written poetry and created artwork relating to my “faith” and shared through music my basic Christian faith…but most do not know about how my conversion came about. As I was speaking about asking for another chance…I felt a sudden vibration in my heart while in the same motion my arms flung wide open and I was drawn in a sit up position.All the while a bright light was bursting upon me and I was crying aloud in the same breath,”My God it’s true ! It’s true ! Your really there ! You really care”.I never heard of St. Paul’s experience on his Way to Damascus before this…But after wards discovered how similar the experience of a great light from above was. The question for me is not whether heaven is real or is there a God anymore…the question is now about accountability before God…and is there more that I can do to share this and later experiences of God’s love.I believe there is…maybe a book…God knows.Please pray about that for me.Thank you and God bless..","date":"2011-12-14","mins":"2:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8092","author":"john_macgillivray","post":"The artists of old who painted icons usually fasted forty days before they began to paint…I wonder if this is the case anymore with modern iconography..","date":"2012-02-09","mins":"9:57 am","url":"https://shroudstory.com/2012/02/09/michael-obriens-portraits-of-christ-often-a-likeness-to-the-shroud-of-turin/","cat":"art","title":"Michael O’Brien’s portraits of Christ often a likeness to the Shroud of Turin"},{"id":"comment-7616","author":"john_macgillivray","post":"I briefly met this artist while staying at a Russian Orthodox commune.He was greatly influenced by baroness Catherine de Hueck Dorothy who left Russia with her family when a little girl and who was the founder of Madonna House apostolate in Ontairio.She was the one that was responsible for William Kurelek’s return to his faith..","date":"2012-01-28","mins":"12:00 am","url":"https://shroudstory.com/2012/01/26/the-christ-of-the-shroud-of-turin-and-other-reminders/","cat":"art","title":"The Christ of the Shroud of Turin and other reminders"}]
