[{"id":"comment-8421","author":"john_macgillivray","post":"40 years ago when I was only 19 years ago…I had a “most” unusual experience.I had thought I was dying…and as I lay in bed I pleaded with God to give me another chance because I felt i wasn’t ready to die and that I could do better with my life.Many events led up to this experience and many events followed but I will get to exactly what happened as I implored God. Immediately I felt something like a vibration in and of my heart…as all in one motion my arms involuntarily sprung open wide and I was drawn into a 3/4 sit up position while a light burst and radiated upon me,and I suppose within and through me as well.I also burst into an ecstatic cry of joy and a river of tears as it was happening.My first words were,”My God it’s true!Your really there…you really care…your really there ! The whole experience couldn’t have lasted more than five to several seconds…but I then fell back onto my pillow as the door opened to my room and a nurse entered.She didn’t know what had just happened…and I have never forgotten. I afterwards had fellowship with every denomination you can think of in my town and other parts of the country.A Russian Orthodox commune and Trappist monastery being the last two places I spent some time until I settled into the faith I was raised in.I’ve witnessed to my faith countless times but rarely shared this particular event regarding my “road to Damascus” experience which entailed a similar light to that of St. Paul. So now I feel I am ready to share this “miraculous” experience and to tell it like it is…I didn’t know how to share it before and was mostly always afraid that no one would believe it.But I will leave that up to whoever hears it and to God.I have no fear of what others will think about this anymore because I know that I will need to give an account to God Himself and it’s what He thinks that really matters. Why it took 40 years to prepare me to speak out about this I do not know…I can only quote something from scripture which may explain it some.”Silver is for the smelter,gold is for the furnace,but the purification of the heart by fire is of God. God bless…as a final comment I want to say…. That I have an absolute certainty or conviction that the Shroud of Turin is undoubtedly the true burial cloth of Christ.I believe that it was a burst of light during his “predicted” resurrection which left the image on the cloth.It was left to us as both a testament and legacy for future generations..","date":"2012-02-18","mins":"12:21 am","url":"https://shroudstory.com/2012/02/17/so-swings-and-roundabouts-darn-dawkins-didnt-ask-about-the-shroud/","cat":"news_&_views","title":"So, swings and roundabouts: Darn, Dawkins didn’t ask about the shroud."},{"id":"comment-8891","author":"john_macgillivray","post":"To me it makes “perfect” sense that God would allow at least a miraculous image behind for future hundreds of millions to see.For those generations to come after him and not have the good fortune to hear His Son speak or witness His countless miracles which were performed on a daily basis. The preservation and survival of this sacred relic is a miracle in itself.And the fact that it now exist for millions to witness and study today convinces me that it was from all time…intended that way..","date":"2012-03-02","mins":"10:39 am","url":"https://shroudstory.com/2012/03/02/that-was-me-once-upon-a-time-i-was-sure-the-shroud-of-turin-was-fake/","cat":"news_&_views","title":"That was me once upon a time. I was sure the Shroud of Turin was fake."}]
