[{"title":"A Treasure of Reading Material","post":"Thanks Dan, I’ll read them with interest.  I note that the Zaccone paper on historical research seems to end abruptly mid-sentence.  Maybe it wasn’t fully copied to the site?\n\n","date":"May 26, 2015 at 5:29 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200223","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"Strange. Let me get back to you on that.\n\n","date":"May 26, 2015 at 6:20 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200229","author":"Dan","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"Fixed. Enrico very quickly sent me a new file.\n\n","date":"May 26, 2015 at 9:11 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200244","author":"Dan","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"I commend Flavia Manservigi, who has taken to heart various comments made by Andrea Nicolotti and myself and is (albeit slowly; she doesn’t quite make it here!) coming round to the view that none of the alleged flagra kept in museums is in fact any such thing.\nI also commend Marzia Boi, who has taken to heart various comments made by a number of people regarding Max Frei’s methodological failure, although I feel she is a little harsh in her condemnation.\n\n","date":"May 26, 2015 at 7:01 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200236","author":"Hugh Farey","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"The Marzia Boi article is just the kind of article we need if Shroud studies are to move on.\nI can’t make head or tail of the history one!\n\n","date":"May 26, 2015 at 11:17 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200249","author":"Charles Freeman","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"Reminder to Hugh who seems to be misleadingly in denial of any finding of specimens of flagra somehow compatible to the ones used to scourge the Man of the Shroud and of which specimens are actually reproduced with xylographies in Roman and Greek dictionaries. Flavia Manservigi confirms my opinion (see my post on May 19, 2015 at 2:02 pm) namely “It does seem the flagrum/flagra used on the TS man’s naked back is/are an in-between(s) i.e. between a common flagrum (see above) and a flagrum talis tessellatum/tesseratum”.  \nAccording Flavia Manservigi: \n“Probably, the flagrum used to scourge the man of the Shroud was a rough object, made of chains or lashes ending with heavy knobs, maybe of the type quoted before (so the plumbum and plumbata). As we have seen, the use of these tools in the first centuries of the Roman world is witnessed by historical, literary and iconographical sources. \nARCHAEOLOGICAL WITNESSES\nBut what about Archaeology? Are there any Archaeological witnesses of the Roman era confirming the use of whips compatible to the ones used to scourge the Man of the Shroud?\nIt is necessary to state that the great part of the instruments used to scourge criminals can not have preserved, since they were made of natural (and so perishable) materials, like leather or wood. For this reason, it will be very unlikely to find specimens of virgae, ferulae or Spanish cords.The same matter applies to the flagrum with astragals, even if it is possible that single parts of it have preserved, like for example the bones.\nFor what concerns flagra made of chains and metal balls, we have some indications about the\nexistence of such kind of tools in some dictionaries of Archaeology: we can quote a specimen\nmentioned in the Dictionary of Antony Rich, dated to 1890, which, according to the author, was found at Herculaneum and so was surely dated to the 1st century34. This information is reported also in the Dictionary of Greek and Roman Antiquities by William Smith35, in the Dictionary of Roman and Greek Archaeology by Daremberg and Saglio36 and in the dictionary of Christian Archaeology by Cabrol and Leclercq37. In all these cases, the specimens are reproduced with xylographies.\n34 A. RICH, A dictionary…, p. 289, s.v. flagrum.\n35 W. SMITH, A Dictionary of Greek and Roman Antiquities, Boston, Little, Brown and Company, 1859, s.v.\nflagrum.\n36 Dictionnaire des antiquités grecques et romaines, by CH. DAREMBERG, EDM. SAGLIO, rist. Anast.\nAkademische Druck-u. Verlagsanstalt, 1969, 10 voll. (Ripr. facs. dell’ed. Hachett, Parigi, 1877-1919).\n37 Dictionnaire d’archeologie chretienne et de liturgie, by F. CABROL, H. LECLERCQ, Librairie Letouzey et\nAne, Parigi, Vol. V, s.v. flagellation (supplice de la), by H. LECLERCQ, c. 1642, fig. 4474.\nFigure 9 (does show) reproductions of specimens of flagra found at Herculaneum; the first image comes from the Dictionary of Greek and Roman antiquities of A. Rich (p. 289), the second one from the Dictionary of Roman and Greek antiquities of Daremberg and Saglio (fig. 3092) and the last one from the Dictionary of Christian Archaeology of Cabrol and Leclerque (fig. 4474).”\n\n","date":"May 26, 2015 at 12:18 pm","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200252","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"Reminder for all: Hugh’s misrepresentation of others’ opinion does seem to be his cup of tea.\n\n","date":"May 26, 2015 at 12:22 pm","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200253","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"“So it seems possible to suppose that also the objects classified as ‘Roman flagra’ could actually be objects that were used for other purposes. This doubt is strengthened by the fact that there is a strong resemblance among the ‘flagella’ ending with triangle – shaped terminations and some objects of the Villanovian age, found in some tombs near the city of Verucchio, which are classified not as ‘flagra’, but as decorative ‘pendants’, or as tools to spur horses. The same doubts concern the ‘flagella’ ending with round knobs, very similar to some specimens found in the same tombs of Verucchio, which are not identified with torture tools, but with terminations of decorative chains. So, the flagella of the Vatican Museums could have been wrongly interpreted, even if it must be stated that this hypothesis has not been taken into account by the archaeologists of the Museums themselves.”\nWell quite. Just what I said. Give her time; I think Flavia Manservigi is beginning to realise that none of these chains are anything like either the descriptions nor the illustrations of Roman flagra.\n\n","date":"May 26, 2015 at 12:36 pm","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200254","author":"Hugh Farey","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"Hugh misleadingling keeps writing: “I think Flavia Manservigi is beginning to realise that none of these chains (interpreted as flagella are anything like either the descriptions nor the illustrations of Roman flagra”.\nRe the objects kept in the Vatican Museums, FM just wrote: “it must be clarified that SOME (NOT ALL, my comment) of these specimens (two out of four objects classified as ‘bronze Roman flagella’, inventoried with numbers from 60564 to 60567)  are not dated to the Roman era, and they can not be considered torture tools: in particular, the TWO (upper cases mine) ‘graffioni’ are actually Etruscan oil lamp cases”.\nBTW tools that are classified not as ‘flagra’, but as decorative ‘pendants’, could ALSO have been used as tools to spur horses or… whip slaves. There is no contradiction in se. Don’t you make a couple of exceptions a rule, please. And do bear in mind objects (such as decorative pendants) could have been thought and used too as impromptu flagra.\nRe the specific flagra found in Herculaneum (of which xylographies are known to the archaeologists), FM unambiguously wrote: “the use of these tools (aka flagra) in the first centuries of the Roman world is WITNESSED (upper cases mine) by historical, literary and iconographical sources”.\n.\n\n","date":"May 26, 2015 at 2:16 pm","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200260","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"Hugh misleadingling keeps writing: “I think Flavia Manservigi is beginning to realise that none of these chains (interpreted as flagella are anything like either the descriptions nor the illustrations of Roman flagra”.\nRe the objects kept in the Vatican Museums, FM just wrote: “it must be clarified that SOME (NOT ALL, my comment) of these specimens (two out of four objects classified as ‘bronze Roman flagella’, inventoried with numbers from 60564 to 60567) are not dated to the Roman era, and they can not be considered torture tools: in particular, the TWO (upper cases mine) ‘graffioni’ are actually Etruscan oil lamp cases”.\nBTW tools that are classified not as ‘flagra’, but as decorative ‘pendants’, could ALSO have been used as tools to spur horses or… whip slaves. There is no contradiction in se. Don’t you make a couple of exceptions a rule, please. And do bear in mind objects (such as decorative pendants) could have been thought and used too as impromptu flagra.\nRe the specific flagra found in Herculaneum (of which xylographies are known to the archaeologists), FM unambiguously wrote: “the use of these tools (aka flagra) in the first centuries of the Roman world is WITNESSED (upper cases mine) by historical, literary and iconographical sources”.\n.\n\n","date":"May 26, 2015 at 2:16 pm","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200261","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"“Don’t you make a couple of exceptions a rule, please.” I’ll do what I want. These couple of exceptions are the thin end of a wedge which will eventually mean that all the alleged flagra are rejected.\n“And do bear in mind objects (such as decorative pendants) could have been thought and used too as impromptu flagra.” So what? So could lots of other things. A lamp hanging does not become a flagrum because somebody once used it as one.\n“As we have seen, the use of these tools in the first centuries of the Roman world is witnessed by historical, literary and iconographical sources.” She does say that, but the sources she actually quotes and depicts do not resemble the drawings of the archaeological finds. The nearest she can get textually is the use of the Latin for “leaden balls” at the end of whips. None of the artefacts is made of lead.\n\n","date":"May 26, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200265","author":"Hugh Farey","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"Hugh, keep up misrepresenting others’ opinion and Herculaneum findings as far as scourge marks (for the former) and flagra (for the latter) are concerned. \nYou wrote: “These couple of exceptions are the thin end of a wedge which will eventually mean that ALL (uppe cases mine) the alleged flagra are rejected”. By whom? By you (not Flavia Manservigi). Are you rejecting too the finding of flagra in Herculaneum? How do you account for the extant xylographies of flagra then? How can you tell they are not flagra either and will eventually be rejected? Where did you get your allegedly ‘superior archaeological knowledge of flagra’ from to be so negatively assertive? Methinks you are light -years’ far from being an archaeologist of whips and scourges!\nReminder for Hugh: CURRENT redirecting of the original function of the same object (e.g. a decorative pendant redirected as a scourge) can result in (a) new object (s) (e.g. a flagrum and/or a flagellum). The concept of habitus is the cornerstone here.\nIn sharp contrast, ‘your approach’ of Roman whips/scourges is only based on “processual archaeology”. The latter arrived at explanations based on monocausal intentionality of human relationships with things, if any human action was considered to be intentional at all. In principle, it was assumed that every object had its own specific function and that this object was created by man with the intention of exactly fulfilling this function. \nThus you totally ignore “post-processual archaeology. The latter has always emphasised the plurality of an object’s functions. Particular strands of post-processual archaeology replace the monocausal intentionality of processual archaeology by polycausal intentionality. In their view, humans do not create objects with a single function in mind, but do so with several possible functions in mind. \nYou are not even aware meanwhile more and more approaches try to improve on processual and post-processual archaeology. Archaeology owes important thought-provoking impulses to French sociologists Pierre Bourdieu and Bruno Latour, namely Bourdieu’s concept of habitus and Latour’s actor-network theory (ANT). \nIn contrast to the dominating mentalist approaches in anthropology and sociology in the 1970s, Bourdieu rightly acknowledged the importance of the material in human living environments. He thereby created possible approaches for archaeologists who have only completely taken up these possibilities over the last twenty years. Bourdieu’s (1987) concept of habitus is based on the notion that, to a large extent, our practices with things are governed by unconscious internalisation of collective dispositions. Therefore, humans act in a way that is specific to their social background, often without being aware of this and without acknowledging the important influence of their material surroundings on them. These material surroundings shape the habitus, where things are integrated within social practices.\nArchaeology can only yield momentary meanings and functions of an object.\n\n","date":"May 27, 2015 at 11:03 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200347","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"Besides, archaeology’s current understanding of objects cannot do justice to the potential of things.\n\n","date":"May 27, 2015 at 11:11 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200349","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"This is all windy persiflage, Max. None of the artefacts currently labelled scourges are any such thing, nor have ever been used for any such purpose, and sooner or later everybody, even you, will accept that. The reason why the Herculaneum and the Etruscan ‘flagra’ have mysteriously vanished is because they were recognised as something else and reclassified. They will be found in a box marked ‘hanging chains for domestic utensils, or possibly ”miscellaneous horse equipment.’\nDo I have any evidence for such a precise vision of the future? None whatever. But I bet I’m right!\n\n","date":"May 27, 2015 at 11:23 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200351","author":"Hugh Farey","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"Do you really mean the Herculaneum flagra are/were neither flragra nor used as such and the Turin Shroud is not a shroud and was not used as such and your name is not Hugh?\n\n","date":"May 28, 2015 at 6:41 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200418","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"Etymology of Hugh: it refers to somebody who says/claims he is all thinker: hug (“thought,reflection, intellect”) from Aramaic HOuG for “mental activity”.\nAs ‘Hugh’, you’d better avoid cerebral buzz coming from mechanical logic\n\n","date":"May 28, 2015 at 6:52 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200419","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"There is no end to the variety of whips/flagra that Roman soldiers could have created for punishment.  The lack of such objects that have survived to the present day testifies to their casual construction (in most cases), as well as to their disgusting nature after much use (objects to be thrown away).  What’s really the point of the non-authenticists, anyway — the scourge marks have been shown to be non-paint and in some examinations, blood.  There is little doubt that any medieval hoaxer working on a real human body would have used whip marks, not flagrum marks, not having any knowledge to the contrary.\n\n","date":"May 27, 2015 at 7:40 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200336","author":"Nabber","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"I think Nabber comes close to the mark here, flagra – implements of casual construction from what materials happened to be close at hand at the time, hence of variable fabrication, to be thrown away after use as disgusting objects.  The more obvious scourge marks on the TS are very specific, indicating the type of instrument used in this particular case.  They are a sharp contrast with the vague scourge markings on artistic works, the Carolingian Stuttgart Psalter illustration from 800-814 AD being among the earliest such.  The only one that comes closest is the Stavronitska epitaphios, curiously a Byzantine creation which seems to post-date the appearance of the TS in Europe, and may reflect a memory of it in Constantinople.  Wilson has an illustration of a Herculaneum coin ~100 AD, which shows a gladiatorial contest, one of the contestant’s weapons clearly being a type of flagrum.\n\n","date":"June 2, 2015 at 3:21 pm","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200908","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"I have read the five pages by Rainer Riesner,\nbut without the help of notes (the footnotes), this text appears a bit lacking and all the problem inherent to the family of Jesus seems to be inconclusive …\n— —\nUnfortunately I have not read the book by Riesner :\nJesus, Qumran and the Vatican Paperback – International Edition, May 1, 2012\nand so I could not properly appreciate the possible connection between “Christianity in Eastern Syria and Jewish-Christians in Palestine, influenced by Essenism” (…are these ideas only mere claims?…).\n… Also … I remember that Antonio Lombatti was strictly contrary to the authenticity of the “Legend of Abgar”.\n— — —\nOn the other hand you can try to find something of useful in the paper titled:\n“Judas, Thaddeus, Addai: possible connections with the vicissitudes of the Edessean and Constantinopolitan Mandylion and any research perspectives”\nby\nAndrea Di Genua, Emanuela Marinelli, Ivan Polverari and Domenico Repice\n(Bari, 4-5 September, 2015)\nLink:\nhttp://www.sindone.info/BARI2.PDF\nBut I think you should also read the paper by Scavone…\nLink:\nhttp://www.shroud.it/SCAVONE1.PDF\n— — — —\nAt this point, see also the recent paper by A. Nicolotti (Ph.D.):\n“From the Mandylion of Edessa to the Shroud of Turin. The Metamorphosis and Manipulation of a Legend”\nLink:\nhttps://www.academia.edu/8475824/From_the_Mandylion_of_Edessa_to_the_Shroud_of_Turin._The_Metamorphosis_and_Manipulation_of_a_Legend\n>The legend behind the story of the Mandylion of Edessa is derived from an- other, older Syriac legend, which began with an exchange of letters between King Abgar of Edessa and Jesus Christ. Slowly the content of the letter written by Jesus, together with its apotropaic function for the city, were transferred, as from the fifth century, onto an image that is not part of the earliest versions of the story.\n>In the sixth century, the image itself, which was originally a colored picture of the face of Jesus, was transformed, especially in the Byzantine environment, into a miraculous imprint of Jesus’ face left on a cloth, but not everyone was aware of this evolution.\n[Then, here my short note: See also the Holy Face of Manoppello!…]\n>Several exemplars of the image – per- haps slightly individualized in the features shown – began to compete with one another for preeminence, and countless reproductions of each were pro- duced, all sharing some key elements: the presence of the towel that showed only the face of a living Jesus.\n>The legends that relate the transformation of the painting into an acheiropoieton are comparable, although they differ in some details. One of these Mandylion was moved to Constantinople in 944, where it remained until the Fourth Crusade… etc. … etc. …\n— —\nIn any case Movses Khorenatsi (approx 410-490s AD)\ncan not be seen as living in the ninth century as it appears instead  towards the end of the text in pdf format.\nLink:\nhttp://en.wikipedia.org/wiki/Movses_Khorenatsi\n… And in 1441 Lorenzo Valla demonstrated that the letter to Abgar\nattributed to Jesus was a fake… \nLinks:\nhttp://it.wikipedia.org/wiki/Abgar_V\nhttp://en.wikipedia.org/wiki/Abgar_V\n— — —\nIn short:\nmy judgment (from the few pages of Riesner I’ve read)\nis that I am not convinced of what exposed Rainer Riesner in Turin …\n\n","date":"May 27, 2015 at 10:09 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200343","author":"piero","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"I apologize for having (almost) a bit “mistreated” Rainer Riesner,\nin fact he is the editorial board of the\n“Journal for the Study of the Historical Jesus” …\nLinks:\nhttp://en.wikipedia.org/wiki/Rainer_Riesner\nhttp://en.wikipedia.org/wiki/Journal_for_the_Study_of_the_Historical_Jesus\nhttp://www.brill.com/journal-study-historical-jesus#EDIBOA_1\nhttp://booksandjournals.brillonline.com/content/journals/17455197/12/3\nHowever, what interests me, is your opinion\nbecause I did not see a sign of your interest in this issue …\n-*-*-*-*-*-*-*-*-*-\nFor example,\nhere another link (Andrea Nicolotti) to improve the debate.\nLink:\nhttp://my.unito.it/unitoWAR/ShowBinary/FSRepo/X033/Allegati/Mandylion%20(Andrea%20Nicolotti).pdf\n(To complete the discussion consider the point of view of Lombatti,\nwho is cited several times in that document …\nSee the pages : 29, 32, 111, 121, 124,150\n… and, please, start considering the old paper by Lombatti:\n“The image of Edessa and its sources: the case of Movses Xorenac’i”, 2000\nLink:  https://www.shroud.com/orvieto.htm)\nThen, see also:\n“From the Mandylion of Edessa to the Shroud of Turin.\nThe Metamorphosis and Manipulation of a Legend”\nby Andrea Nicolotti\n… and the inherent connection with the intervention by Rainer Riesner in Turin…\n\n","date":"May 28, 2015 at 7:58 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200422","author":"piero","site":"shroudstory"},{"title":"A Treasure of Reading Material","post":"It is nice to see that Professor Rainer Riesner took an interest in the Shroud. I reviewed his excellent book on Qumran in 1999, which will soon be online.\n\n","date":"June 2, 2015 at 11:54 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","id":"comment-200897","author":"Louis","site":"shroudstory"}]
