[{"title":"Clarification of the Stochastic Process Paper","post":"At the risk of unleashing another 2000 words, I wonder Yannick would like to address the main problem with his paper, which is that in spite of its title, it does not resolve the blood/image dichotomy at all. The blood, it declares, is a contact process; the image, it declares, is related to cloth/body distance. Since the intensity of the image in the areas around the bloodstains is variable, then those areas represent both contact and variable distance colouration processes. This is contradictory. Any chance?\n\n","date":"June 16, 2014 at 8:14 am","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-129970","author":"Hugh Farey","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"Hugh, you wrote:\n‘ Since the intensity of the image in the areas around the bloodstains is variable, then those areas represent both contact and variable distance colouration processes.’\nCan you give us examples of the first part of your sentence.\nI’ll explain my reasons later.\n\n","date":"June 16, 2014 at 3:15 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130039","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"Hi Thibault, you might look at the ‘scourge marks’ down the back of the legs. in some places the image is well defined, in others virtually absent, and there is a range of stages in between. If the bloodstains are all contact prints, then the image should be of equal (and maximum) intensity around each one, for Yannick’s “co-existence explained” to make any sense.\n\n","date":"June 16, 2014 at 6:44 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130071","author":"Hugh Farey","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"I am partial to the naturalistic process theory. I think any naturalistic theory has to explain why there is no side image though. I’m not sure any of them do now.\n\n","date":"June 16, 2014 at 12:16 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130005","author":"Chris","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"I think the best of them postulate a kind of wall of bags of myrrh and aloes all around the body, after it was laid on the shroud, so that it was effectively covering a kind of elevated bas relief.\n\n","date":"June 16, 2014 at 3:01 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130036","author":"Hugh Farey","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"Chris: See Mario Latendresse paper “The Turin Shroud Was Not Flattened Before the Images Formed and no Major Image Distortions Necessarily Occur from a Real Body”. I think the URL is latendre@iro.umontreal.ca .  You need to see his slides at:\nhttp://www.sindonology.org/papers/latendresse2005aSlides.pdf   \nMario considers that the Shroud was loosely draped over the body and his experiments with a volunteer show that there’d be little image distortion.  If you measure the distance over the top of the head on his Shroudscope, then it seems that the cloth had to be wrapped quite firmly and closely over the head, so that the top of the head had to be masked somehow, perhaps with a cloth, or else the imaging process had to be constrained to act vertically only for some reason.  \nMax PH is insistent that the burial shroud was wrapped tightly following the prescribed burial ritual, but then you have the problem of no side image.  John’s gospel account says Nicodemus brought 100 Roman pounds of herbs and burial spices, and they must have been put to some use.  They might have been placed along the sides of the body, and then Max can have his tight wrapping together with image formation which could then be orthogonal.  The gospel accounts say the tomb was in a garden, and it was spring, so maybe there could have been some fresh floral packing as well.  Danin and others have asserted they see images of various flowers, others say they don’t see them. \nThe rational authenticist position should be first to pursue a naturalistic explanation before resorting to miraculist explanations;  but the experimental work necessary for it has never been pursued to any proper conclusion, only theoretical speculations and minimal experiments.\n\n","date":"June 17, 2014 at 12:02 am","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130119","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"Hugh and Dave, thanks. Interesting theories and definitely stuff worth pondering. \nOne of the things I wonder about though is how can we determine tight wrap versus a loose draping. Some of the blood stains suggest a tight wrap (or even a close wrap) without anything else in there – take that elbow bloodstain for instance. I recall reading something recently from another post where that blood stain maps to the man’s elbow if the shroud was wrapped around him. One would have to assume that there would not be anything else in there. The other thing is the bloodstains in the hair. Seemingly they map to the sides of the face? It would suggest, if that were true, that the shroud had to be wrapped tight at some point but then loosened and draped loosely for the image formation process. \nOne possibility is that Joseph had helpers and they were the ones who had to physically take the body into the tomb and lay it in the shroud. Maybe they were doing this while Joseph was getting other burial supplies to put in the tomb in anticipation of a later, fuller burial. Perhaps they weren’t all that familiar with what Joseph had in mind given the time constraints and so while waiting for him to arrive wrapped the body rather closely thinking they were helping and that Joseph would just carry in the burial stuff and lay it next to the body (on the floor or something) instead of placing it around the body. Joseph then comes in with the stuff and wants to give Jesus a modicum of respect with regards to burial ritual but doesn’t have time to do anything other than just lay the stuff closely against the sides of his body and drape the shroud over everything. After all he’ll be back after the Sabbath to finish the job. And having those spices there might help with the inevitable stench from the decaying corpse.  I can’t imagine that would take all that long and it might be long enough to allow the blood transfer to happen and then the image formation could happen over the period of the next 48 or so hours. \nPure speculation on my part but in any scenario I think for a naturalistic process theory to work you’ve got to have both a tight wrapping and a loose draping if those facial and elbow bloodstain mappings are correct.\n\n","date":"June 17, 2014 at 1:05 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130280","author":"Chris","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"This dichotomy is one of the biggest objections to a natural origin for the Shroud as we know it. Explaining it satisfactorily is possibly the holy grail of the authenticist viewpoint, just as explaining how to achieve the image artificially is the holy grail for the non-authenticist.\n\n","date":"June 17, 2014 at 1:40 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130290","author":"Hugh Farey","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"Hugh, yeah, it’s tough to explain. It may be even simpler than we’ve imagined. Thinking about it some more it may just be that the body was wrapped tightly in the shroud right off the cross, then transported in some fashion to the tomb where it was unwrapped, spices laid aside it and the top draped over to await the final burial.\n\n","date":"June 17, 2014 at 2:52 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130316","author":"Chris","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"Chris wrote: “Pure speculation on my part but in any scenario I think for a naturalistic process theory to work you’ve got to have both a tight wrapping and a loose draping if those facial and elbow bloodstain mappings are correct.”\nThe proposed scenario of a tight wrapping by Lavoie on this subject cannot have happened because you would have a vertical misalignment of the bloodstains vs the image. See paper\nhttp://sindonology.org/papers/latendresse2005a.pdf\nThere is no need for a tight wrapping to explain the bloodstains in the facial area: Lavoie did not present any argument that such bloodstains cannot have been transferred from the hair and I do not see how such an argument can be made.\nAs for the bloodstain near the elbow, it can be explained by the blood dropping from the elbow towards the ground and forming the blood line and droplet stain we see on the Shroud.\nHugh Farey wrote: “This dichotomy is one of the biggest objections to a natural origin for the Shroud as we know it. Explaining it satisfactorily is possibly the holy grail of the authenticist viewpoint…”\nI think this is explainable along the line of the paper cited above.\n\n","date":"June 18, 2014 at 12:35 am","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130557","author":"Mario Latendresse","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"Here’s a reply to Mario’s comment about the bloodstain near the elbow:\nI don’t want to start an old debate that we once had on this subject, but I sure want people who will read your comment to know that an alternative explanation still exist, which has been described by me in the recent paper that was published in the MAA journal.  Here’s the part of that paper I’m talking about: “In fact, the presence of blood, serum and bile pigments are the result of a direct-contact mechanism between a real wounded human body who died by crucifixion and the linen cloth, which had been used to cover it (see Items xi through xiii). It’s important to understand that some of these biological stains could have been formed on the cloth by temporary contacts during the burial procedure (for example, during the probable moving of the enshrouded body from a central place inside the tomb to his final resting place on a stone bench carved in a wall of the tomb), while others (representing certainly the major part of the bloodstains) are the result of a permanent contact between the corpse and the cloth (e.g. direct-contacts that were maintained after the end of the burial procedure). And it should be noted that the very probable fact that some bloodstains were formed by temporary contacts during the burial procedure could explain why some bloodstains on the Shroud are offregister with respect to the anatomical details of the body images (Item xv).”\nSuch a scenario can explain at least as good as yours why there is a bloodstain off the right elbow of the Shroud man’s body image.\n\n","date":"June 20, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-131824","author":"Yannick Clément","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"“even though the title of our paper can suggest otherwise”\nGreat, second chance, what should be the title of this article ?\n\n","date":"June 16, 2014 at 1:59 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130022","author":"anoxie","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"Chris: John’s gospel account of the burial Jn 19:38-42 is the one with the most detail.  Key points made seem to be: a new tomb close to crucifixion site and in a garden;  Nicodemus bringing 100 pounds of myrrh and aloes;  took the body of Jesus, wrapped it with the spices in linen cloths; following the Jewish burial custom; it was Day of Preparation; tomb close at hand they laid Jesus there.  What one makes of all that still leaves much room for ambiguity. \nFrom “following Jewish burial custom” and “tomb close by” I think Max would argue that most of the burial rite would be carried out, including tight wrapping and other certain rituals, and that there was ample time to do this.  Others would argue the opposite, that the point seems to be made that it was Preparation Day which that year would fall on the sabbath, so it was especially sacred, and maybe the author is hinting that there wasn’t time for the full rites, and that allows the cloth to be loosely draped. \nI recently came across a paper (maybe on this site), I forget the details, but it was suggested that the body was tightly wrapped and was lain horizontal, but that the image was formed with the body vertical (e.g. round (not flat) buttocks) and the cloth at that stage was loosely draped.  I think the author was probably suggesting a miraculist explanation for the image rather than some naturalistic process.  \nYou pays yer money, and you makes yer choices!  Essentially not enough known!\n\n","date":"June 17, 2014 at 4:47 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130354","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Clarification of the Stochastic Process Paper","post":"Or the body was horizontal, but hovering in mid-air, with the shroud hovering above and below it. (John Jackson, I believe)\n\n","date":"June 17, 2014 at 5:29 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","id":"comment-130377","author":"Hugh Farey","site":"shroudstory"}]
