[{"title":"Paper Chase:  The Effects of Douse Water","post":"Isn’t it possible that the artists who copied the Shroud were just adding their own “improvements”? After all, some artistic renderings of the Shroud have loincloths and a circlet crown of thorns.\n\n","date":"May 17, 2014 at 10:00 am","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","id":"comment-120775","author":"Chesterbelloc","site":"shroudstory"},{"title":"Paper Chase:  The Effects of Douse Water","post":"Curious that the water which completely removed the image of the feet did not remove the image of the legs around the knees.\nCurious too, that Pam interprets the toes on the Lier shroud as evidence of later removal, but I’ll bet a pound to a penny she doesn’t see the lack of blood on the arms as evidence of later addition.\nAnd, of course, and possibly irrelevant, the central waterstains do not line up with the 1532 burn marks and are clearly from a differerent incident. (http://www.shroud.com/pdfs/aldo4.pdf).\n\n","date":"May 17, 2014 at 10:32 am","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","id":"comment-120782","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  The Effects of Douse Water","post":"Is there any experimental evidence that water can remove the image coloration from any Shroud fibre?  Temperature may be a factor, although Ray Rogers seemed to be of the view that the linen would not have absorbed much heat during the 1532 fire.\n\n","date":"May 17, 2014 at 3:54 pm","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","id":"comment-120834","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  The Effects of Douse Water","post":"I don’t agree with this paper. As Hugh mentioned the frontal knees image (in negative) is the clearest indication that the body image is not affected or smudged by the water stain. It’s very speculative to try to make a scientific conclusion (i.e. the image is removed by water) based on an artistic expression (i.e. Lier Shroud).\nThe importance of Jesus feet has no bearing on why the feet should be visible or not. The frontal feet image is missing because of how the body was wrapped in the shroud. As with any wrapping job, we start with the lower side of the wrapped object and make sure we have enough material, the top side then only gets what’s left of the cloth.\n\n","date":"May 17, 2014 at 4:12 pm","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","id":"comment-120836","author":"Mike M","site":"shroudstory"},{"title":"Paper Chase:  The Effects of Douse Water","post":"I’m a teacher. Do your homework. Pam, the image does not dissolve in water.\n\n","date":"May 17, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","id":"comment-120839","author":"Paulette","site":"shroudstory"},{"title":"Paper Chase:  The Effects of Douse Water","post":"There will be a paper challenging the author on another topic soon.\n\n","date":"May 17, 2014 at 5:20 pm","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","id":"comment-120844","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  The Effects of Douse Water","post":"This paper by Pam Moon does not say that the image “dissolved” due to water, but that “douse water [..] obscured  some features”. The word “obscured” is essential. Pam Moon also points out why she thinks some part of the Shroud have not been affected by this water: mixing with carbon. I think the Lier copy is not required to prove some of these points, because it is rather obvious that some parts of the image of the Shroud are obscured by water stains.\n\n","date":"May 18, 2014 at 2:24 am","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","id":"comment-121021","author":"Mario Latendresse","site":"shroudstory"},{"title":"Paper Chase:  The Effects of Douse Water","post":"Mario, why would a water stain obscure? Water takes impurities from the middle of the stain and moves them to the edge of the stain by capillarity. The middle of the stain should be “cleaner” than before not more obscure. The edges will show a line and that may obscure but I don’t think she was referring to that in the paper.\n\n","date":"May 18, 2014 at 7:53 am","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","id":"comment-121094","author":"Mike M","site":"shroudstory"},{"title":"Paper Chase:  The Effects of Douse Water","post":"Mike, water stains can have edges that span several centimeters and these can be seen on the Shroud. See for example the water stains photomicrographs at \nhttp://www.sindonology.org/photomicrographs.shtml\nThere is even some large areas darkened by water that appears to have carry charred linen. Yes, I agree that a water stain moves microscopic materials by capillarity and that it could make some part “cleaner”, but the other case also occurs (move dirt from one part to another) and they do occur on the Shroud. The main issue on the Shroud is that water has moved some of the charred material onto the cloth over the image. \nMoon’s paper never states that the image was removed or dissolved by water. I do not see that anywhere in the paper. What is clearly stated, at least twice, is that the water stains obscure the image and in some cases from carbon (charred material) that drifted from the burned area. I agree to that. Take one of the elbow, for example: it is obscured by a water stain.\nBut I disagree that  the front feet were more visible before 1534, because the current image of the front feet is compatible with  the toes of one foot pointing upward such that you could not see the side of the toes and most of the foot. And, as pointed out by others, the artistic rendering of the Lier copy cannot be taken to support the claim that the foot was once more visible because the artist may have added the appearance of the front feet to its copy. And note that Pam Moon was careful to write that the artist could have added that detail.\nIn summary: water stains obscure some image areas and that can readily been observed by looking at high definition photographs of the Shroud or some of the Evans’ photomicrographs. Using the Lier copy to prove that claim, obscures (sorry for the pun!) the claim.\n\n","date":"May 18, 2014 at 1:28 pm","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","id":"comment-121171","author":"latendre","site":"shroudstory"},{"title":"Paper Chase:  The Effects of Douse Water","post":"I agree with that, the elbows may be obscured by a small water stain and a scorch in the middle.\n\n","date":"May 19, 2014 at 9:29 am","url":"https://shroudstory.com/2014/05/17/paper-chase-the-effects-of-douse-water/","cat":"news_&_views","id":"comment-121457","author":"Mike M","site":"shroudstory"}]
