[{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"M.P. Hamon was at the Frascati (Italy) conference in May 2010. An extended abstract of his presentation (in English) may be seen here:\nhttp://www.acheiropoietos.info/abstracts/poster.html\nHere too, the subject is about the coins over the eyes.\nI copy the unusual credentials of Hamon:\n“Former professor at the University of Riyadh (Kingdom of Saudi Arabia)\nFounder and director of LE CERCle (Office for Studies and Research in Cryptology), Reze (France)\nIndependent researcher in Late Antique and Medieval archaeoperceptive cryptology”\nHis address was in France.\n\n","date":"October 23, 2011 at 1:50 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4264","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Jesus with pagan coins over the eyes waiting to pay his due to cross the Styx river…  If those coins are there (and, by the way, only a chemist could confirm this or not) this is the meaning of this finding !  Can you believe this ?  Knowing that Jesus and all his followers and family were pious Jews, I can only say that it don’t make any sense.  When it comes to judge of something like this that don’t have a real true scientific confirmation, I always use my logic to weigh the pros and cons.  And in this case (and it’s the same thing for the flowers and the ghost writings), I came to the conclusion that there is more cons.  Sorry. \nBut, nevermind what I think or what you people think about this, nobody can be really sure about this question until a chemical test could be perform on a sample that come from the eyes area…  Period.  We can scratch our backs all we want on this topic, we will never solve this question.  Only a chemist could.  Let’s wait…  I think Ron will agree with me this time.\n\n","date":"October 23, 2011 at 6:00 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4265","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"I am afraid that a chemical analysis of the eyes’ area of the Shroud could not give any clue at all, since that would imply that some transfer of metalic matter from the “coins” to the Shroud’s fibers took place. Something impossible. In my opinion, the only analysis that could throw some light is the high resolution images analyzed in a reproducible way according to the state of the art as admitted by the scientific community and not following any other more “creative” way, something that unfortunately, we have seen in too many occasions……But chemistry is a discipline that cannot help in this issue. Coming to the plasubility of the coins being put on the eyes of the Messiah, there is a great controversy regarding the influence of the greek culture at that time. I wouldn`t rule it out completely that such a costume was so widely spred among pagans and jews too that for the last had lost its pagan meaning and only reflected perhaps some kind of respect towards the dead person. We see that in Western countries with christian roots, non-christians (muslims, hindis, jews…) ALSO buy presents for their families in Christmas. I mean, something that started as something religious has become purely cultural and common to all. But I don`t want to go too far with this because I am not sure at all and I am just hypotethisezing .\n\n","date":"October 23, 2011 at 6:55 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4267","author":"Gabriel (Spain)","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"I think a chemical analysis would be necessary to know the truth about those so-called images of coins and flowers.  At least, a chemical analysis done properly (along with a microscopic and spectral analysis) could tell us if the fibers of the eyes area are colored the same exact way than the colored fibers from other image areas on the Shroud.   If the fibers presents the same spectral and chemical characteristics (same yellow-straw color, same superficiality, same spectral characteristics, etc.), that could mean, for the eyes, that it’s not coins at all but just the eyeballs that produced those images…  Or maybe a chemical analysis (along with a microscopic and spectral analysis) could find a different kind of coloration.  If it would be the case, then, the hypothesis of an image other than a body image could be more realistic…  You see, chemical analysis are always interesting in those kind of questions…  Just analysing an image is dangerous because of the misinterpretations that could happened, even if it’s a HD image and even if it’s a numismatist or a botanist that do the image analysis.  That’s what I think…\n\n","date":"October 23, 2011 at 9:08 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4271","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"A chemical analysis could only determine if the composition of the fibres from some section of the Shroud (eyes for example) is different from others. I don`t think that can possibly happen.\nA spectral analysis would be part of a comprehensive image analysis, not only in the visible band but also at different UV and IR wavelengths. I mean, this would fall in the realm of Optics if, as I mentioned in my previous post, the whole analysis -which is far too much than discovering “objects”-, is carried out according to the generally admitted scientific standards as described in the scientific literature.\nOne point which in my opinion should be incorporated into the analysis is a thorough comparison of the spectra from the Shroud and those obtained on linen sheets by Paolo DiLAzzaro using laser beams. In case they showed some similarity, this could throw light on the mechanisms involved in the formation of the image. To summarize, an in-depth optical analysis should go far beyond discovering “objects”.\nned\n\n","date":"October 24, 2011 at 2:44 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4273","author":"Gabriel (Spain)","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Yannick, PLEASE, I would like you to be be fully aware of the 2 following facts: \n– Symbols can be ambivalent. Whether they are seen through 1st century Roman eyes or Judeans eyes, the symbols on Pilate coins can take up different meanings. Actually, they were designed TO AGREE BOTH Romans and Judeans.\n– The incomplete coin impressions I detected and identified on the eye areas are faint carmine to carmine brown tiny blood decals.\n\n","date":"October 24, 2011 at 5:33 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4274","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"First point :  Then why the Jews had to change their normal coins to coins without an image of a god or an emperor when they had to pay something in the Temple ???  Another important thing : I don’t see any pious jewish dead man with coins on the eyes simply because it was a PAGAN RITE !  You can twist it all you want, IT WAS A PAGAN RITE…\nSecond point : Only a chemical test will be able to tell if you are right or wrong on this topic.\n\n","date":"October 24, 2011 at 1:01 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4284","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"its too bad we dont have the hamon paper to read. ohio 08 had the right idea putting all papers online\n\n","date":"October 24, 2011 at 7:46 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4277","author":"MouseInTheHouse","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"“I am open to being convinced that sufficiently identifiable parts of coin images exist that are not possibly visual noise. In the meantime, however, I am sufficiently convinced that the coin images are not there to “believe” that they are not there.”(Dan’s quote)\nDan,  I wish you had asked me how much credence I give 1979-2008 Filas et al’s coin image extractions. In spite of my deep respect for Filas’, Whanger’s and Moroni’s pioneering work, my answer would have been NONE!\nI might  even have added: I am convinced “THEIR COIN IMAGES” are not there. Both optically and numismatically speaking I CAN PROVE IT.\nHowever, the whole irony of it is I myself detected and identified  incomplete Pilate coin impressions… on the suspected areas. Both optically and numimactically, I do hope it will be convincing even to the uninitiated eye.\n\n","date":"October 24, 2011 at 7:58 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4278","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Most interesting post by Max. For me at least, this is new!! If I understand well Max, could detect two coin imprints originated from tiny blood  stains by directly examinating the Shroud. In my opinion, this puts nows the coins issue at the same level of credibility that the flowers (quite high). The other detection of coins by Filas and the rest came from “creative” analysis of images, which in my opinion makes these detections highly dubtious.\nThe methodology of  “flowers& coins discovering” is what makes Avinoma’s and MAx’s claims quite plausible.\n\n","date":"October 24, 2011 at 8:26 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4279","author":"Gabriel (Spain)","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Max, if it’s there, why I don’t see nothing ?  I’m not a numistatist but I have a pretty good vision and I know what a coin look like.  I repeat : I don’t see nothing (even on the good resolution photos) !  And Dan prove that I’m not alone in this case…  Explain this to me.\n\n","date":"October 24, 2011 at 1:03 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4285","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"“I’m sure you can agree with me that the burial ritual wasn’t completed on friday and the women planed to come back on sunday morning to do an anointing of the body.” (Yannick’s quote)\nYannick ALLOW ME to totally disagree with you. I already presented an oral paper on the subject at The 1998 Turin Symposium – June 5-7, 1998. Yeshua’s first burial ritual was completed (he was tightly wrapped up in funerary linens according to the Judean custom). The women’s visit to the tomb on the following Sunday is to be read in the light of a specific Judean tradition which consisted to pay visit to the deceased during the week that followed his death. The use of perfume here was just to prevent bad smells.\n\n","date":"October 24, 2011 at 9:46 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4281","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"If what you just said is correct, then what do you think of this : “The women who had come with Jesus from Galilee followed Joseph and saw the tomb and how his body was laid in it. Then they went home and prepared spices and perfumes. But they rested on the Sabbath in obedience to the commandment.”  \nPaying visit to the dead was jewish tradition.  Correct.  But that don’t mean no way that the people who pay visit to the dead had to ENTER INTO THE TOMB !!!  Look at the story of the raising of Lazarus in John’s gospel.  Mary ran to see Jesus and all the people who was with her thought that she was going to the tomb again !  This is exactly the tradition right there.  Do you beleive one second that Mary had to roll the big stone and enter the tomb to accomplish this ritual ?  The people thought that she was going to the tomb… Not enter into the tomb !  There’s an important difference here.  If the women had to enter into the tomb on sunday, you can be sure that it was because the burial ritual wasn’t completed on friday…  Sorry to disagree again with you.\n\n","date":"October 24, 2011 at 1:34 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4286","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"I forget to wrote the gospel references :  For the first quote : Gospel of Luke, chapter 23, verses 55 and 56.\nAnd here’s the second quote : Gospel of John, chapter 11, verse 31.\n\n","date":"October 24, 2011 at 1:39 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4287","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"From what I know, the only time that Jews would enter the tomb after the burial rite was one year after that to collect the bones…  Beside this procedure, they had no reasons to enter the tomb IF the burial rite was completely done.  When you go to see a relative at the cemetary, did you dig out the coffin and open it ?\n\n","date":"October 24, 2011 at 2:05 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4289","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Barrie Schwortz wrote/told Yannick Clément: “if they did use coins, they certainly would not have put a pagan Caesar coin on the face of the prophesized Messiah!” \nArchaeologically speaking, if Pilate coins are pagan objects as Schwortz claims, how could then the American technical photographer account for Second Temple Judean tombs yielding more than three tens of Pilate coins? \nArchaeologically speaking, how much credence give Barrie Schwortz ‘s opinion? Is he a literate Hellenistic Judean (liberal Pharisee) of the Second Temple period and a secret\ndisciple of Yeshua? Is he a Jewish scholar, a  historian or an archaeologist of the Second Temple period?\n\n","date":"October 24, 2011 at 11:21 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4282","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"I really think you’re off track here.  My friend Barrie Schwortz is a Jew.  Maybe he knows 2 or 3 things about his culture !\nAnd how can you explain that only one jewish skull was found with coins in it if it was a normal practice ???\n\n","date":"October 24, 2011 at 1:45 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4288","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Yannick, you’re REALLY THICK.\nThis is no news to me Barrie is Jew! Mentioning Jewish origins, you can read my name in the Bible (in the Song of songs). In Hebrew Hamon means “Univers”, “Vast World”.\n\n","date":"October 24, 2011 at 2:41 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4290","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"I could add this to my statement :  You don’t have to be a Jew to think like Barrie !!! ;-)  I think his argument his very strong against this question of the Pilatus coins.\n\n","date":"October 24, 2011 at 3:20 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4291","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Ideally, eye areas should be studied under appropriate raking light and alternative lights in conjunction with authentic, 2nd and 3rd generation photographs + 3D images and digital squeezes.\n\n","date":"October 24, 2011 at 3:32 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4295","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"On the contrary Barrie’s arguement is very weak and his opinion not qualified.\n\n","date":"October 24, 2011 at 3:35 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4296","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Cheap comment completely.  How can you say that ?!?  You’re far from convincing me with YOUR WEAK points my friend.  SORRY.  And I don’t care one bit how many diplomas you can have on your wall…  You would not be the first “scientist” to have been wrong on something.  HOOOOO NOOOOO !!!!  Not the first and surely not the last.\n\n","date":"October 24, 2011 at 3:39 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4299","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"To convinced me, first try to find an exact quote from the ancient Jewish litterature (Thora, Talmud, Mishna, etc.) that talk specifically about a general practice of putting pagan coins over the eyes of their dead.  That would be a start.  I wait for you about that.\n\n","date":"October 24, 2011 at 3:42 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4301","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Now, we agree on something !  But, please, push also for a chemical test to go along…  I think it would be imperative to have both.\n\n","date":"October 24, 2011 at 3:36 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4297","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Remember: when there are two Jews, there are three opinions!\n\n","date":"October 24, 2011 at 3:38 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4298","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Non destructive tests do exist to detect blood stains no matter how tiny they are.\n\n","date":"October 24, 2011 at 3:41 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4300","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"But even if a chemical or another test prove that there is blood there, that will not prove that the inscription you claim to have seen are really there !  It’s a problem you will always face when you want to prove something like that…\n\n","date":"October 24, 2011 at 3:44 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4302","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"i still say the weave of the cloth is too coarse to support such detail even if made of blood micro-droplets.\n\n","date":"October 24, 2011 at 4:28 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4304","author":"MouseInTheHouse","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"One things for sure, when you deal with small images (and/or faint images) like that, there’s a big room for misinterpretation.\n\n","date":"October 24, 2011 at 4:41 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4305","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Spy details on ancient coin types “behave” like fingerprints. Body images (resolution limit 0.5cm) should not be mistaken with blood images (resolution limit 0.5mm). Many Shroud researchers (including Barrie Scwortz) makes repeatedly the same confusion. He also totally ignore the thread count per square centimetres. The only snag with Barrie Schwortz’s faulty opinions is that thousands of his website viewers are all too ready to believe him.\n\n","date":"October 25, 2011 at 4:51 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4316","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"If it’s so true Max, then explain to me why Miller and Pellicori in their paper about the analysis of the UV photos of the Shroud have not said a word about possible blood stains (or any word about a possible image of a coin) in the eye region ???  Yet, they were able to detect minute stains of serum and minute scratch-like marks in the scourge marks !!!\n\n","date":"October 25, 2011 at 8:32 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4327","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"TO DO AWAY WITH A RECURRENT RECEIVED IDEA: Pilate coins were “casher”. Should I repeat they were specially designed to abide by the 2nd commandement. A sheperd crook-like shape or a libation bail-like shape are not specifically “pagan” as you mean it. They are neutral symbols in se and did agree with both Romans and Judeans.\nBy the way, do you know that, accordding to the best etymologists,  the words “Caesar” and “Casher” do have the same etymology (it would come from the aramaic “csar”)?\n\n","date":"October 25, 2011 at 5:50 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4317","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Then, why a “casher” coin like that was not hallowed into the temple by the jewish authorities ???  And you want me to believe that a coin minted by Pilate was not consider sacrilegious by the pious Jews ?  Come on !  \nIF what you say is true, then back up your words with an exact reference coming from ancient jewish litterature or some other reliable sources !  Personally, I’ve never read anything about this idea…\n\n","date":"October 25, 2011 at 10:40 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4333","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Yannick, you can tell Barrie about it!\n\n","date":"October 25, 2011 at 6:00 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4318","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"I don’t have to because I think he read this blog frequently !!! :)\n\n","date":"October 25, 2011 at 8:28 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4326","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"There are so many received ideas, half-truths, biased observations & results, pseudo-theories about the Shroud that it would take too much of my precious time to list them all here. This is MY LAST POST.\n\n","date":"October 25, 2011 at 8:55 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4330","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Before going out of this blog, if you’re so sure about your great science, why don’t you give us the exact reference in ancient jewish litterature where it is clearly said that putting coins over the eyes was a normal procedure in ancient jewish burials ?  But obviously, YOU CAN’T simply because it ain’t there !\nIf we summarize this question :\n1- There is no exact reference in ancient jewish litterature (Thora, Mishna, Talmud, etc.) about the fact that putting coins over the eyes was a normal procedure in ancient jewish burials.\n2- The procedure of putting coins over the eyes (or into the mouth) was a pagan rite and this rite could have been taken as an act of idolatry by the pious jews like the Pharisees.\n3- The coins that are claimed to be on the shroud are Roman coins.  Those coins were not hallowed in the Temple by the jewish authorities.\n4- Jesus and his followers were all pious Jews and not hellenistic jews.\n5- The burial rite after Jesus death was only partially done on friday and they had to come back on sunday to do an anointing of the body.\nLove it or not, this was the situation on the day of Jesus death.  And we can add this fact to the list below :  Most of the people who have looked at the shroud images of the eye area HAVE NOT SEEN any images of coins there.  \nNow, it’s up to you to make up your own mind about this question of the coins.  Personally, it’s evident for me that the chances that there are really images of coins over the eyes on the Shroud are close to absolute zero.  As I said so many times, anybody is free to believe what he want.  But please, use a bit of your logic before making up your mind !\n\n","date":"October 25, 2011 at 10:36 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4332","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Before giving any credibility to the coin conjecture I think not only the apparent coin image should be presented but its registration should be demonstrated.  The best of the “enhancements” do present the impression of elements of the Pilate coin, however the elements seem to be out of placement and not in the correct scale, so it may well simply be a case of similarity and not a real image at all.  Remember that the folks doing the processing were looking for a particular appearance so there is a selection phenomenon at work which will drive the process to the best apparent fit.\n\n","date":"October 25, 2011 at 12:56 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4336","author":"Ray Schneider","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Thanks for this comment.  I agree completely and I know that the late Ray Rogers would agree with this too.  Our mind play tricks sometimes…\n\n","date":"October 25, 2011 at 1:02 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4337","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"That may be true, but we should not also ‘assume’ a selection phenomenon. We all must remember that most all 3D or pseudo 3d renderings, show quite clear that there are objects on the eyes, as you are quite familiar with Ray. What these ‘objects’ are is still a mystery and unlikely to be ‘noise’ or a remnant of the weave…and I should add; I hope that we have not seen the “best of the enhancements” as of yet.\nGreat to see you on here too Ray!\nR.\n\n","date":"November 4, 2011 at 10:41 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4558","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Breaking “my silence”, I just wanted to say I am 100% with you Ray! It’s so refreshing to meet a well thought comment from time to time by a serious Shroud researcher.\n\n","date":"October 25, 2011 at 1:43 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-4338","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Have just come across this posting of Dan Porter’s from 2011. I stand corrected that Max’s contribution was a poster presentation, his having pointed out yesterday that he delivered it verbally. Having said that, how anyone could stand in front a group of strangers and say what he did by way of introduction is quite the most extraordinary thing I have ever read as regards the conference circuit – this passage in particular.\n“In order to get out of the research dead-end, I think it is essential now to go beyond the “pro-and anti-coin-on-eye” dichotomy. One must be fully aware that those who claim the ability to identify the presence or the absence of coin impressions left on the Shroud (a theologian, a psychiatrist, a medical doctor, an amateur scholar of numismatics or coin collector, a technical photographer, a church historian, a mathematician, a linguist, a lawyer, a laser physicist or engineer for instance) are definitely not the best qualified Shroud researchers to analyze and/or cryptanalyze ancient images and inscriptions. How can anyone of them turn into a professional numismatist, an archaeological analyst or cryptanalyst overnight? It does take extensive data-analysis and/or -cryptanalysis before you acquire the proper eye-and-brain. Without such a trained eye-and-brain for forms, how can a non-specialist, credibly discriminate between misspelling, misreading and non univocal forms; between mere “figures in clouds” and genuine palaeographic information embedded in visual background noise and random shapes?”\nI can think of some conferences I’ve attended where the audience atttendees have clearly taken quickly against a speaker, but usually managed to restrain themselves until the paper is read, and then thrown open to discussion. But if anyone had ever read that obnoxious putdown of oh so may disparate individuals and groups thereof, they would have been met with an immediate intake of breath, of furious head-shaking, of noisily consulting neighbours, rustling of papers, walk-outs even.  It has to be quite the most conceited piece of conference self-promotion I have ever encountered, and at some venues he would not have been able to proceed for all the hissing, booing and catcalls that would have come from the audience, Professors included (the capital P is intentional). That’s fully accredited University Professors, you realize – Heads of Department, acknowledged experts in their field with mountains of published findings in peer-reviewed journals – not the narcissistic attention-seeker poseur that is Max Patrick Hamon, someone who would have us all believe that he was himself a University professor between 1976 and 1978. \nStrong words I know, but hopefully my last words on the subject of this individual, someone who totally misunderstands how to conduct himself in or on public forums, at least where academic scholarship is concerned. One has to earn one’s reputation, Max, which can be a long slow process. One cannot claim to have privileged insights, denied to us lesser mortals, and you are wasting your time (and ours) and indeed making a pitiful spectacle of yourself when you attempt to brazen it out. Most important of all, you cannot demand respect, or even a silent attentive audience, as a matter of right.\n\n","date":"June 25, 2013 at 2:09 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38016","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Reminder for C*** & B*******’s venomous misinformation (AGAIN): \n1/ this is the WRITTEN version of my research paper NOT my ORAL paper (the latter had a TOTALLY DIFFERENT TONE AND PRESENTATION STYLE). I see Mr C*** & B******* is not very familiar with presenting paper at international conferences.\n2/I am a professional cryptologist (cryptology applied to archaeology, criminology and psychophysiotherapy as new approaches).\n3/ In my ALL MY ATTESTATION LETTERS (both in French and Arabic) from the French Embassy in Jeddah and from the University of Riyadh, I am referred to as ‘Professeur à l’Université de Riyad’ and ‘ الرياض‎ أستاذ جامعي‎ ‘. Therefore I am entitled to be described as ‘university professor’ (this is the English translation from both French and Arabic) WHETHER MR CRAPCOLIN BULLSHITINGBERRY lLIKE IT OR NOT. I would bet my house Mr Mickeymist has no PhD in French laguage and Civilization and no PhD in Arabic language and Civilization.\n4/Since the alleged ‘man’ failed to attack me on scientific and archaeological ground as far as the Turin Shroud is concerned, the ‘man’ is coward enough to attacking me on the FORM. That says it all about the ‘man”s worth. \n5/ when the alleged ‘man’ is referring to “someone who totally misunderstands how to conduct himself in or on public forums”, so funny, I just cannot help thinking of Mr Colin Berry himself.\n\n","date":"June 25, 2013 at 6:02 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38021","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"It’s a total breach of conference etiquette to say one thing in a  Conference abstract or summary, and something completely different, in this case, toned-down (one would hope) in one’s verbal presentation. I speak as someone who has given scores of conference presentations, and attended many more in a spectator capacity. Max continues to be a slippery customer when one tries to pin him down on the detail.\nDoes anyone know how his paper was received? Is there a transcript somewhere of  actual questions put to the speaker?\nThe question I would have put is this: how can you be so confident, indeed categorical,  that the claimed coin images are in blood, or that it was blood transferred from others’ fingertips? Why no fingerprints superimposed on alleged coin lettering?\nIf the latter, how come there are not bloody fingerprints, with ID-specific whorls etc., elsewhere on the Shroud?\nIf it’s blood as distinct from a body-type image (skin, hair etc) how come it needs particular photographs, notable Enrie’s (1931) taken or processed under particular conditions to see these so-called ‘blood decals’(curious nomenclature, btw, that seems to be imported from the world of computer games, or so it would seem from googling). There is generally no difficulty in spotting the conventional, broadly biblically- correct bloodstains on the Shroud, no matter which photograph is looked at, right from the very beginning. See Secondo Pia (1898)\nIt is actually not difficult for folk to do their own discrimination test (blood v non-blood image)  and to gauge for themselves whether there is blood on the eyes/eyelids/coins, regardless of whether those so-called  “decals” constitute lettering or not, as I shall explain later in a follow up comment.\n\n","date":"June 25, 2013 at 6:38 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38023","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"The spiting snake is still spitting his venomous prose while minding about my alleged   ‘violation of the etiquette’!! Can the alleged ‘man’ stop putting words in my mouth again (a pathological habit of his I presume)\nRe my Torun paper, .I JUST wrote the SAME THING but in a different expository writing style, THAT’S ALL. Can Dan DO something and STOP Colin Berry making all this VENOMOUS NASTY FUSS about nothing?. Can we mean science and archaeology here for G.od’s sake?\n\n","date":"June 25, 2013 at 8:18 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38026","author":"chantal boisselier","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"The distinction between what was distinctively Jewish and what was pagan was never clear cut for many practices during the biblical period. Pagan idols were placed in the Temple,  both Solomon and Herod built pagan temples, Solomon also worshipped Ashtarte, Jesus himself referred to the fact that some Jews were also worshipping Ba’al. If a Pilate coin can be identified over one eye of the Man of the Shroud it should be no reason for surprise because, perhaps, coins minted by the Roman procurator could have been the only ones inside the pocket of whoever placed them there. There was no time for exchange, no Barclays or Citibank at a corner.\n\n","date":"June 25, 2013 at 11:33 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38034","author":"Louis","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"OK,  but would one of those present at the initial preparation of a corpse for interment really have placed coins in the eye-sockets without first wiping the deceased man’s blood off his fingers? Is that consistent with devotees of the deceased who have gone to the trouble and expense of purchasing an expensive linen shroud?  Wouldn’t blood on the coins be deemed an insult to those in the spirit world for whom the coins were intended?  And if bloodstains were left on coins, sufficient to leave a bloody imprint from which the coins can now be identified, then would one not expect to see fingerprints all over the Shroud, including the two frontal and dorsal non-image surfaces on the visible “outside”, albeit under the original Holland cloth? Are there fingerprints on those obverse sides that have to be handled to seal the Shroud? None that I have heard or read of, except by penetration from the opposite side.\nPersonally I don’t buy into the idea of coins in eyes, far less any handy, printers’ ink bloodstains in the eye-sockets. That’s something that anyone can easily confirm for themselves with ShroudScope (detailed operating instructions in preparation). It’s simply an agenda-driven ploy to put the “right” date on the Shroud. Nope, it is worse than that: it is an authenticity-promoting, pseudoscientific hypothesis, claiming one has patiently searched for, and  oh so conveniently stumbled upon the right facts.\n\n","date":"June 25, 2013 at 12:26 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38044","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Good point about the lack of bloody fingerprints elsewhere. The whole coin issue has become a wild goose chase. There are better aspects of the Shroud to be investigating which could bear more fruit, one way or another, than the painfully subjective coins angle.\n\n","date":"June 25, 2013 at 12:34 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38045","author":"David Goulet","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Fine, the question of fingerprints is something that I had thought about years ago and it does really need attention that will probably only come with another hands-on examination. Now it does not seem that the coins, if they really were there, had anything to do with paying Charon to ferry the spirit across the Styx. The Pentateuch does not say anything about after-death survival and since the Saducees only accepted this part of the Tanakh as Revelation they did not believe in life after death. There were exceptions, of course, (like Miriam, found in the Caiaphas tomb?) who seems to have appealed to Greek mythology in order to “make sense” of life, perhaps, trying to answer questions like the ones Viktor Frankl did for us today.\n\n","date":"June 25, 2013 at 1:01 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38048","author":"Louis","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"PS The above comment was addressed to Colin.\n\n","date":"June 25, 2013 at 1:02 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38050","author":"Louis","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"OK, I did not mention ferrymen specifically, though folk do not usually part with coins, no matter how small the denomination, unless it’s intended to pay someone “on the other side”, not necessarily Paradise.\nReturning to an earlier point re the claimed or obligatory role of blood as imprinting medium (“printers’ ink”):\nAs I indicated earlier, it is actually not difficult for folk to do their own discrimination test (blood v non-blood image)  and to decide for themselves whether there is blood on the eyes/eyelids, regardless of whether the “decals” constitute lettering. \nHere’s a no-nonsense way of judging for oneself if blood spots, small enough to allow “lettering”, but big enough to be seen, are present in the centre of those eye sockets.\nGo to Mario Latendresse’s ShroudScope (use the face- only option under Base Layer in blue panel on right for best resolution) \nhttp://www.sindonology.org/shroudScope/shroudScope.shtml\nCentre your laptop screen on the eye region. Stay centred while one moves the slide up to optimum magnification for one’s screen size. Do a screen grab to MS Paint or another image-capturing program with reasonable toolbar. \nCrop the image to get both of the eyes and some of the bloodstains on the forehead. Then increase the contrast by degrees to its maximum value. Adjust brightness as necessary. You should see something interesting happen. \nA difference in colour density aka saturation should be immediately obvious when comparing blood and non-blood areas. Blood is much, much denser than non-blood. What’s more, the blood stains have a colour that might be described as ‘plum’ when viewed, especially at lower magnification. Elsewhere the colour is one of various shades/hues between tan and red-brown.\nIt is not apparent where MPH got his description of blood as having any kind of carmine tint, at least on photographic images.  I see no carmine, but that may be because of the increase in contrast used to discriminate between blood and non-blood.\n   The initial coloration of the ShroudScope images, uniformly monochromatic (purplish hue) resolves into two different colours – a yellowish-brown for body image (skin, eyebrows etc) and a quite different coloration for the major bloodstains – dense reddish brown  with a pinkish.- purple hue in lower-intensity regions of the blood. (I have previously interpreted the heterogeneity as flaking off of blood leaving  that pinkish background  but one can take that or leave it).\nNow look at the eyes. The first impression is that there is little pigmentation or image in the eyes, relative to bloodstains. Such little as there is seems more like body image than bloodstain. There is no obvious spotting or micro-spotting of blood, even at these top magnifications.  (Oh, and the impression of two eyelids in apposition – giving rise to the “closed eye” look  seems to be due to an irregularity in the weave of just one of the eyes.)\nI personally fail to see how anyone could claim to see blood “decals” when looking at the high-resolution ShroudScope pictures. The latter are of course  from Durante’s 2002 digital takes, minimally-processed “as-is”, not light/dark reversed negatives, as distinct from Pia/Enrie-type legacy silver-grain analogues, with attendant risk of artefacts, especially if the images have since been tweaked digitally or by other means to “best show up” the alleged blood and coins.\nAll Shroud photographs should carry a health message, especially those that show coins, lettering, flowers etc:  “Warning, this image may trick your visual cortex into seeing things that are not really there.”\n\n","date":"June 25, 2013 at 1:34 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38051","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Reminder for Mr Colin Berry from Max Patrick Hamon, former Professeur à l’Université de Riyad:\nOn June 10, 2012 at 1:55 pm (#6 Reply): “BEWARE! What is presented on SST as “2002 Durante Shroud Face Photograph” is actually nothing but a detailed view of the the 2002 overall Shroud photograph as opposed to a genuine Shroud face photograph. Many significant tiny details are lost.”\nMost obviously besides having a very poor memory, Mr CB does lack a Ph.D. in optical sciences.\nWithin 2-3 weeks (I am very busy at the moment), I’ll ask Dan to kindly publish on his blog  two tables  (from  the intermediary version of my 2011 Torun Paper) unequivocally showing the partial bloodstain patterns/blood imprints of a Pilate coin obverse on each eye. \nKeep tune (especially ‘Doctor Ignoramus’)\n\n","date":"June 25, 2013 at 2:05 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38053","author":"chantal boisselier","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Reminder for ‘Doctor Ignoramus’: I am a professional enigmatic image cryptanalyst who can discriminate between falsely positive perception, falsely negative perception, misreading in terms of non-univocal image patterns and the real thing,,which ‘Doctor Ignoramus’ just can’t.\nA vous revoir.\n\n","date":"June 25, 2013 at 2:16 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38055","author":"chantal boisselier","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Bravo. You’re a legend in your own lunchtime/déjeuner (googleable)\n\n","date":"June 25, 2013 at 2:35 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38059","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Can ‘Doctor Ignoramus’ discriminate beetween a blood decal and a blood imprint? What if the blood smearing of the two small coins was deliberate and had a meaning in se? What if the Plate coin obverses could be read as a rebus/silent eulogy in Hebrew and/or Aramaic?\n\n","date":"June 25, 2013 at 2:32 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38058","author":"chantal boisselier","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Ah yes, what if?  What if your failure to publish a single paper in a peer-reviewed journal was down to your failure to focus on questions that are capable of being answered in a realistic time span? What if the best questions to ask do not start with “what if?” but instead “what is?”\nMaybe more whatissery is called for, and less whatiffery…\n\n","date":"June 25, 2013 at 2:58 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38063","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Message for Max and Colin:\nPersonal attacks, mud slinging won’t get us far, and a lot of time wasted on this sort of thing could be devoted to constructive criticism, with a point-by-point debate (after a glass of cold water? Freud left a nice lesson about emotions for humanity).\nMax: To avoid being accused of being an impostor, something you certainly are not, may I suggest you have a homepage where your material could be posted or request the webmaster of some Shroud website to post your papers, to which readers could link, even through this blog? I know you don’t have much time, but do think about it.\nColin: My field is not science, yet I did get your point and there is nothing that could be contested from my layman’s point of view. I am open to opposing points of view and hope you posted something about your observations on the Internet in the form of a small paper, preferably illustrated. As commented on several occasions, only a fresh hands-on examination can remove many of the doubts voiced on this blog and elsewhere.\n\n","date":"June 25, 2013 at 3:59 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38066","author":"Louis","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Thank you for your suggestion, Louis. In fact I used to have my own blogsite devoted to the Shroud, but didn’t feel it justified the time or effort. If you were referring to Shroud Scope I once did a long series of postings, at least 10, but that’s all water under the bridge. \nA better strategy where the internet is concerned is to do a little initial probing, and then before ideas have crystallized to give hints or recipe instructions on forums such that those who are interested can explore for themselves, seeing things through their own eyes, making their own interpretations. One then has a basis for a genuine exchange of views in which there is a greater parity of knowledge and insight between the parties. What one doesn’t do is post graphics. They seem to kill curiosity stone dead (that or the words I use to accompany them). Hugh Farey is a notable exception, but I see he is busy on the Randi forum right now. When’s he going to announce his recent epiphany moment on this site, that’s what I want to know?  In the meantime, his secret is safe with me.  ;-)\nPerhaps you might like to tell us a little about yourself, and how you come to be interested in the Shroud.\n\n","date":"June 25, 2013 at 4:38 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38069","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Colin, I read a lot of history in school, learned some theology with Catholic priests while in college, then jumped to parapsychology, biblical archaeology and biblical studies and later to existentialism. Religious belief has always interested me and interest in the Turin Shroud began around 1990 after reading books on the topic. My Christian faith does not depend upon relics but the possibility that supernatural phenomena can be observed in this our material world is not ruled out.\n\n","date":"June 25, 2013 at 5:06 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38070","author":"Louis","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Existentialism eh? Heavy stuff, unless you are French and into absinthe.\nQ: How many existentialists does it take to screw in a light bulb?\nA: Two. One to screw it in and one to observe how the light bulb\nitself symbolizes a single incandescent beacon of subjective\nreality in a netherworld of endless absurdity reaching out toward a\nmaudlin cosmos of nothingness.\n\n","date":"June 25, 2013 at 5:17 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38072","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"Basically we are all existentialists, Colin, consciously or unconsciously, because there are questions which we will never be able to answer and so we look for material supports in relics produced by supernatural means, go to parties, pubs, bars to drink and forget about the problems in life (for the time being), face the doubts head on by taking part in some charitable work to help the needy and so on. Of course, there are the selfish, led by greed, only worried about themselves, not bothered about religion, philosophy, but who still face an existential problem: how to keep the money safe.\n\n","date":"June 25, 2013 at 5:32 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38074","author":"Louis","site":"shroudstory"},{"title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue","post":"One of the headlines in this morning’s Telegraph: \n………………………………………………..\n“Ian Brady: I murdered children for ‘existential experience’ \nIan Brady has said he murdered five children for an “existential experience” and indicated he does not “regret” what he did. \n………………………………………………..\nI don’t deny that we all have a streak of ‘existentialism’ in our make up. But that’s the trouble: it’s too non-specific. If we are all existentialists now, then so are the primates and higher mammals like dolphins and whales that can communicate after a fashion via sounds. So why not lower creatures too that communicate via other means? Could not a computer that scanned its own circuity at interval, performing repairs automatically, or having “bad spells”, also not be said to be existentialist.\nWhat makes humans so special, such that we can rise above mere existentialism? Without wishing to get involved in the age-old question as to what constitutes consciousness, might it not be do with the development of high level communication  skills. not acquired by apes dolphins etc., ones that  “bring us out of ourselves” through listening to others, starting from birth with immediate family, whose view of the world may differ significantly  from that our own, left to our own (de)vices such that we gradually, in our formative years, start to see ourselves as just one component of a collective world-wide consciousness?\nI have little time for “existentialism”, seeing it merely as an expression of the electrical activity in the primitive limbic system of the brain, largely separate from the higher centres – the  latter being the kind that confers constructive civilized behaviour on websites – as distinct from the near-robotic dog-eats-dog variety we sadly see all too often.\n\n","date":"June 26, 2013 at 4:41 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","id":"comment-38092","author":"colinsberry","site":"shroudstory"}]
