[{"title":"Paper Chase: The Shroud of Turin From the Viewpoint of the Physical Sciences","post":"There would be A LOT of things to say about this fascinating article.  I just have to see :  Get it, read it and meditate on it !\nI’m not so sure about the validity of the hypothesis developed by M. Carreira in his article but it’s worth to read it !!!  It is the most interesting article about the Shroud I’ve read since many years.\n\n","date":"July 25, 2011 at 3:43 pm","url":"https://shroudstory.com/2011/07/25/paper-chase-the-shroud-of-turin-from-the-viewpoint-of-the-physical-sciences/","cat":"news_&_views","id":"comment-3410","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin From the Viewpoint of the Physical Sciences","post":"I agree. And I certainly didn’t mean that I agree with Manny’s hypothesis because I said it makes good sense. Like Yannick, I need to meditate on it. \nDan Porter\n\n","date":"July 25, 2011 at 4:09 pm","url":"https://shroudstory.com/2011/07/25/paper-chase-the-shroud-of-turin-from-the-viewpoint-of-the-physical-sciences/","cat":"news_&_views","id":"comment-3413","author":"episcopalian","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin From the Viewpoint of the Physical Sciences","post":"Very good article. I think that those two forgetful angels found in the sepulcher could have a very important role  in the process of the Resurrection. According my viewpoint, they could have placed Jesus’ body in the vertical position (suggested by His hair) changing the gravity and the time-space due to their presence in the tomb scenario\n\n","date":"July 27, 2011 at 8:26 am","url":"https://shroudstory.com/2011/07/25/paper-chase-the-shroud-of-turin-from-the-viewpoint-of-the-physical-sciences/","cat":"news_&_views","id":"comment-3444","author":"Tersio Gorrasi","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin From the Viewpoint of the Physical Sciences","post":"This is a very interesting paper and as mentioned, it does draw us to meditate many things and would most definitely warrant much discussion.I’ll keep my thoughts about his hypothesis to myself at the moment though ;-) \n…I was hoping someday someone would bring up those two angels in the tomb, as I read an interesting paper written by the late  Albert R.Dreisbach, titled; “Lazarus” and Jesus, 2005 I believe, which can be found at Shroud.com.Maybe an article Dan can post here as it is very interesting and I for one would love to hear others thoughts on it’s relevance, determination and conclusions.\nI for one do not believe there was ever any Angels at the tomb! I have believed this since I was very young in my catholic schooling days and we were discussing the writings of Paul and more precisely the chapters leading to the crucifixion and burial  and onward.It just came to me as a surprise that all of a sudden John mentions Angels, when he had never before in his writings.His writings to me seemed very ‘grounded’ and historical minded to that point.So when the angels were mentioned it just for a better sense of a word ‘flipped a switch” in my head, I couldn’t explain it then and I actually pressed the issue with my teacher which didn’t go well to say the least.Anyways I had totally forgotten about that small incident in my life until I read this paper by Rev.Dreisbach and it just hit me like a sledgehammer when he mentions the Angels in his paper and thier ‘meaning’ in the scriptures to the actual Shroud.If anyone has not read this piece, I highly recommend you do.\nThanks for listening,\nRon\n\n","date":"August 1, 2011 at 7:34 am","url":"https://shroudstory.com/2011/07/25/paper-chase-the-shroud-of-turin-from-the-viewpoint-of-the-physical-sciences/","cat":"news_&_views","id":"comment-3504","author":"Ron","site":"shroudstory"}]
