[{"title":"Papers by the Skeptic of STURP","post":"There’s no doubt if scientists could do testing now STURP might pale in comparison, not because the science was poor, but because the instrumentation and abilities they had also pale in comparison.  I’m sure he is not comparing the scientists, but the technology.\n\n","date":"January 14, 2015 at 7:47 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183202","author":"Andy","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"So the bas relief theory but using a woodprint? And the mechanism of image formation to the cloth?\n\n","date":"January 14, 2015 at 9:41 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183222","author":"David Goulet","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"It’s a wet method that’s being proposed, David, based on ancient recipes for printing ink (iron gallate, gallic acid being  trihydroxybenzoic acid,  a natural plant-derived product). While simpler, less fiddly in practice than scorch-imprinting off a hot template, it’s going to be harder obviously to tick all the boxes re superficiality, lack of colour penetration etc. \nIf a woodprint had been used as template, would it not have been possible to get a more realistic differentiation, say between hair and skin? \nMy money’s still on thermal imprinting off a bas relief or 3D template(s.) Most of those who say it fails to match this or that feature of the TS have never done a scorch imprint in their lives, and/or don’t wish to know about the subtle effects that are achievable with relatively small changes in technology. Dry, e.g. thermal imprinting, maybe with chemically-sensitized linen, gives a far more predictable outcome. What’s more, it can chemically /permanently modify the most superficial fibres of the linen.  It beats simply sticking something to them that can subsequently drop off (or be claimed without a shred of evidence to have done so, leaving, as if by magic, chemically modified fibres, ghost images still with 3D properties etc!).\n\n","date":"January 14, 2015 at 10:22 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183226","author":"Colin Berry","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Thanks for the summary, Colin. Agreed, the woodprint/wet theory has some major hurdles to overcome.\n\n","date":"January 14, 2015 at 10:33 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183230","author":"David Goulet","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Surfing the Web I have just found a paper:\nTwo-dimensional correlation spectroscopy and principal component analysis\nstudies of temperature-dependent IR spectra of cotton–cellulose\nby\nSerge Kokot, Boguslawa Czarnik-Matusewicz andYukihiro Ozaki\nlinks:\nhttp://onlinelibrary.wiley.com/doi/10.1002/bip.10163/abstract;jsessionid=F415A813C6BB6D2571FC4F479F0B79B5.f01t04?deniedAccessCustomised\nhttp://onlinelibrary.wiley.com/enhanced/doi/10.1002/bip.10163/\nHere an excerpt from the\nAbstract:\n>The FTIR spectra were measured for raw Uplands Sicala-V2 cotton fibers over a temperature range of 40–325°C to explore the temperature-dependent changes in the hydrogen bonds of cellulose. These cotton–cellulose spectra exhibited complicated patterns in the 3800–2800 cm−1 region and thus were analyzed by both the exploratory principal component analysis (PCA) and two-dimensional (2-D) correlation spectroscopy methods. The exploratory PCA showed that the spectra separate into two groups on the basis of thermal degradation of the cotton–cellulose and the consequent breakage of intersheet H-bonds present in its structure. Frequency variables, which strongly contributed to each principal component highlighted in its loadings plot, were linked to the frequencies assigned to vibrations of the OH groups involved in different kinds of H-bonds, as well as to vibrations of the CH groups. Deeper insights into reorganization of the temperature-dependent hydrogen bonding were obtained by 2-D correlation spectroscopy … …\nB.T.W.:\nDo you know Principal Component Analysis (= PCA) ?\nFor example, see under the following address:\nhttps://georgemdallas.wordpress.com/2013/10/30/principal-component-analysis-4-dummies-eigenvectors-eigenvalues-and-dimension-reduction/\n>… First of all Principal Component Analysis is a good name.\n>It does what it says on the tin. PCA finds the principal components of data …\n— —\nSee also:\nNear-Infrared Spectroscopy for Anticounterfeiting Innovative Fibers\nby\nJing Cao and Suraj Sharma\nLink:\nhttp://www.hindawi.com/journals/isrn/2013/649407/\n\n","date":"January 14, 2015 at 11:17 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183239","author":"piero","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"I do not want to bore you with my notes on specific analyses\n(here I refer to yesterday), but now I’m curious about what\ncould result from “the intersection for BRDF and PCA” …\n– PCA:\nThe Principal Components Analysis is a powerful statistical technique capable of identifying\nand quantifying orthogonal contributions to the total variance of a collection of data…\n– BRDF:\nBidirectional Reflectance Distribution Function (BRDF)\nis essential to characterize an object’s reflectance properties.\nThis function depends both on the various illumination-observation\ngeometries as well as on the wavelength.  …\nAnd then\nread what wrote Accetta:\n“… spatially invariant bi-directional reflectance distribution (BRDF)\nphotographed with linear film and under direct illumination normal\nto the object plane…” (at p. 4 of 18 of the paper by Accetta\nLink:  http://www.shroud.com/pdfs/stlaccettapaper.pdf )\n— — —\nThen a possible question to solve can be the following:\nHow the PCA technique applied to BRDF data may help\nto the identification of the different interaction processes\noccurring on the surface?\nHere a vague reference:\nhttp://digital.csic.es/bitstream/10261/54506/1/Ferrero.pdf\n(= “Principal components analysis on the spectral bidirectional\nreflectance distribution function of ceramic colour standards”,\nby A. Ferrero and others). \nSo…\nWhat is your suggestion?\n— — —\nAnother paper:\n“Investigation of Fibrous Cultural Materials by Infrared Spectroscopy”\nLUO Xi-yun1, DU Yi-ping2, SHEN Mei-hua3,\nZHANG Wen-qing2, ZHOU Xin-guang1, FANG Shu-ying2, ZHANG Xuan2  \n1. Research Laboratory for Conservation and Archaeological, Shanghai Museum, Shanghai 200050, China\n2. East China University of Science and Technology, Shanghai 200237, China\n3. Shanghai Wool and Jute Textile Research Institutes, Shanghai 200082, China \nHere an excerpt from the Abstract:\n> Cultural fibrous material includes both important categories, i.e. textile and paper, consisting of precious cultural materials in museum, such as costume, painting, and manuscript. In recent years more and more connoisseur and conservator’s concerns are, through nondestructive method, the authenticity and the ageing identification of these cultural relics especially made from fragile materials. In this research, we used attenuated total reflection infrared spectroscopy to identify five traditional textile fibers, alongside cotton, linen, wool, mulberry silk and tussah silk, and another five paper fibers alongside straw, wheat straw, long qisong, Chinese alpine rush and mulberry bar, which are commonly used for making Chinese traditional xuan paper … …\n“… the principal component analysis (PCA) was applied to separate cotton and linen …”\nLink:\nhttp://www.gpxygpfx.com/qikan/epaper/zhaiyao.asp?bsid=21876\n\n","date":"January 15, 2015 at 8:58 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183497","author":"piero","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Sorry…   Have you found a new Golden Section Gauge?…\n\n","date":"January 15, 2015 at 9:18 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183501","author":"piero","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Joseph A. Accetta made some good points regarding belief, however no anti-authenticity paper has really addressed all the complexities of the image and particularly the extreme superficiality.\n\n","date":"January 14, 2015 at 11:47 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183248","author":"Louis","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Nor has any pro-authenticity paper.\n\n","date":"January 14, 2015 at 11:49 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183249","author":"Hugh Farey","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"I don’t see rationale in this. The complexities support authenticity.\n\n","date":"January 14, 2015 at 12:09 pm","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183252","author":"Louis","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"The complexities are surely partly the result of the ageing process unless you think the Shroud is miraculously preserved exactly as it was first created.\n\n","date":"January 14, 2015 at 12:54 pm","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183255","author":"Charles Freeman","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Charles, Colin (and Louis),\nThe extreme superficiality of the image is just one of the problems of the “complexity” of the TS.\nFor example, Colin’s thermal imprinting can be superficial. Yes, that’s true.\nHowever, Colin have introduced new ideas like ” chemically-sensitized linen”. Why? \nBy “complexity”, I understand many other facts. For example:\n– what looks like a realistic bruise on the face\n– what looks like a realistic fracture of the nose\n– the “dust” on the sole of the feet area\n– the “strange” shapes of the blood stains\n…\nI could add many other observed facts.\nWhat about this forger?\n\n","date":"January 14, 2015 at 4:18 pm","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183300","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"“Chemically-sensitized linen” is a line of research I’ve been pursuing in my kitchen laboratory on- and-off for the best part of 3 years, TH, and consider it has a lot going for it.\nHere’s a photograph from a posting I did from Sep 30 last year that gives a clue to the potential of incorporating a familiar substance (lemon juice) into linen.\n\n I had confirmed a hunch about lemon juice as early as spring 2012, through hypothesizing that the “invisible ink” trick might allow imaging at lower temperatures, and possibly creating a more superficial image if the the latter were on a thin coating rather than the linen fibres per se. At the time it seemed that the active ingredients would be citric acid, or glucose, or maybe both in concert, but when I failed to reproduce the invisible ink effect with that mixture I went off and sulked for two years. Finally I forced myself to do some reading and learned of a different explanation for the lemon juice effect. Heat degrades the ascorbic acid of citrus fruits to the 4 carbon aldose sugar threose, which then gives a Maillard reaction with the epsilon amino groups of lysine residues in proteins. One can replace the lemon juice with white flour and get similar thermal sensitization of linen such that is scorches at a lower temperature, producing a fuzzy-edge image reminiscent of the Shroud.\nSo, Maillard reactions are one way of sensitizing linen to thermal imprinting, but there may be others that we don’t know about. \nPS Are you aware TH that wikipedia’s brief reference to my scorch studies was excised a short time ago, on the grounds that it has not appeared in a recognized peer-reviewed journal. Meanwhile your pdf is still there, claiming that contact scorches always lack subtle tone contrasts. That was despite yours being similarly unrefereed (and as it happens totally untrue). Maybe I should adopt the pdf format too for that oh-so-authoritative look (but I shan’t, regarding my research as a work-in-progress, reported in real time, and open here as well as on my own site to anyone to criticize if so inclined).\n\n","date":"January 14, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183306","author":"Colin Berry","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"“However, Colin have introduced new ideas like ” chemically-sensitized linen”. Why?”\nBecause after 3 years of denial, he had to admit his scorch theory was not consistent.\nWhat’s next is baloney.\n\n","date":"January 15, 2015 at 4:29 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183449","author":"anoxie","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"No at all. Unlike the authors of most of the recently published papers on the origins of the image, Colin has never claimed that his ideas are the only possible ones, nor that they were his last word on the subject, only that they can explain the scorched appearance and superficial quality of the image. This can be tested and verified by anyone with a cloth and a soldering iron. The “chemically-sensitised” amendment is just that, an amendment, and does nothing to weaken his overall argument. On the contrary, it helps to explain some of the real objections that were raised when it was first proposed (impossible in practice, no fluorescence), thus strengthening the argument rather than weakening it. \nRemarkably, while some authenticists have deemed it wholly impossible for anyone to have heated up a bas relief to scorching point and applied a cloth to it so quickly that only the surface fibres were scorched, they find it quite possible for a dead body to glow like a child’s Electrostorm corona discharge sphere, to explode in a cloud of subatomic particles, or to radiate barely detectable heat in perfectly vertical rays.\nBoth Walter McCrone and Ray Rogers came to the conclusion that the Shroud was covered in something that formed the image such that, were it removed, no image at all would be visible. Few people agree with either of them. ‘Chemical sensitisation’ provides a useful halfway house, is an essential part of the “stochastic distribution” hypothesis of Giovanni Fazio, and is biblically sanctioned. Why shouldn’t Colin incorporate it into his hypothesis?\n\n","date":"January 15, 2015 at 5:22 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183455","author":"Hugh Farey","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Thibault,\nThanks for your remarks. You are quite correct, there is a lot more in the box.\n\n","date":"January 15, 2015 at 10:34 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183515","author":"Louis","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"That’s funny, there are many medieval paintings, but none with the complexities seen on the Shroud.\n\n","date":"January 15, 2015 at 10:44 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183519","author":"Louis","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Like Ian Wilson I have to also point to the face on the Shroud. It impressed even C.G.Jung, who kept a copy behind a small curtain in his study.\nhttps://www.academia.edu/6823292/What_did_Jung_see_in_the_Shroud\n\n","date":"January 14, 2015 at 12:18 pm","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183253","author":"Louis","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Interesting points Louis.  The complexities – of the image on the cloth – the science of it – as well as the complexities of the anatomy conveyed in the image – such as swelling – are far beyond explanation.  In regards to C.G. Jung – I wonder if he was moved by the fact that the image on the Shroud – seems to be that of a living man – serene and at peace.  I have been in on enough autopsies and cadavre disections – of the human face/head/body – to know that a dead person’s body appears sunken – skin and muscles sagging away from bone.  One could argue this could be achieved in a sculpture used in the forgery of the shroud.  Nonetheless, Jung apparently felt the image was speaking a truth to him.  Or as philosopher Michael Polanyi would say, “We know more than we can tell.”\n\n","date":"January 14, 2015 at 1:06 pm","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183258","author":"Stan Walker, MD","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Hi Stan\nIt is good to see comments from a medical practitioner. I will be in radio silence for a while due to urgent things I have to get done. As soon as that is over there will be another Shroud article, going deeper than before. I would appreciate your comments when it goes online, in February.\nBest.\n\n","date":"January 15, 2015 at 10:37 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183516","author":"Louis","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"Thanks Hugh. Couldn’t have put it better myself…\nI was going to add a rider to the effect that image (in)visibility by medieval spectators and ‘over-flagellation’ were two self-cancelling features of the pedestrian paint hypothesis, but the sun’s shining, so it’s time for my daily constitutional instead.\n\n","date":"January 15, 2015 at 5:33 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183460","author":"Colin Berry","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"… and thus reinvigorated, how about a brief musical interlude? One could start with the appropriately-entitled “I Still Believe” by Frank Turner, see link below, and a minor change in lyrics. \n“Hey, hey, anoxie, how much O’s become N today?\nHey, hey, anoxie, how much O’s become N today?”\netc etc.\n(Apologies to those unfamiliar with chemical symbols, or the medical definition of anoxia (Fr, l’anoxie).:\nhttp://www.porteliotfestival.com/video-gallery/frank-turner-perform-i-still-believe/\n\n","date":"January 15, 2015 at 6:51 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183474","author":"Colin Berry","site":"shroudstory"},{"title":"Papers by the Skeptic of STURP","post":"I am unable to reply in the appropraite box, but thanks to Stan and Thibault, both medical practitioners.\n\n","date":"January 15, 2015 at 10:54 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","id":"comment-183524","author":"Louis","site":"shroudstory"}]
