[{"title":"Papers from 1991 Shroud Conference","post":"In the pdf of the “Papers from 1991 Shroud Conference” are not present the pages 130-154, 226-255,  325-345, 351 ff.\n\n","date":"December 26, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/12/26/papers-from-1991-shroud-conference/","cat":"news_&_views","id":"comment-68576","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Papers from 1991 Shroud Conference","post":"That’s why we have a variety of Shroud sites because not every sites is a place to post everything.\n\n","date":"December 27, 2013 at 1:29 am","url":"https://shroudstory.com/2013/12/26/papers-from-1991-shroud-conference/","cat":"news_&_views","id":"comment-68726","author":"Andy Weiss","site":"shroudstory"},{"title":"Papers from 1991 Shroud Conference","post":"Dan, there is something that has to be said and I think you know what I am talking about and will probably receive e-mail messages after what I have posted since what exactly people feel in the realm of Shroud studies is said behind the scenes and not on a blog like this one, where there is a lot of public relations. Public relations that are barely able to hide the tension lurking behind, a tension that is revealed when it explodes openly — when public relations is not possible.  \nPosting Shroud papers on Academia.edu will not attract academics to the field because if they want to delve deeper they will inevitably be led to Shroud sites and publications, where they will see that the right hand does not know what the left hand is doing in some places and get the impression that confusion abounds.They will either lose interest or read what is being said just to keep in touch with what is going on, but unwilling to enter a minefield.\nTo get something published in the “top” sites and publications you have to be a chummy, no matter whether what you have written is a useful contribution or just plain rubbish. I regret having to tell you that you yourself have succumbed to this policy, but can understand it on account of the pressure you must be facing from those behind the scenes who decide who is and is not a chummy and to whom a door should be opened, albeit indirectly. One clear example? There are people who are not exactly prominent Shroud scholars who have received mention in your last paragraph and others who are, that is, who have contributed with useful papers based on important discoveries, have been ignored. Of course, they are no longer chummies and have been unjustly driven out of the Shroud scenario.\nCuriously, some time ago one prominent Shroud scholar was the object of scorn simply because he was writing papers beyond his field of expertise and although his contributions were noteworthy. At the same time another scholar, who was not at all prominent, began writing absolute nonsense — I received correspondence from prominent Shroud scholars backing my position — and was mentioned 4(four) times.\nSomething must change drastically if academics are to enter the scene and if Shroudies wish to gain the confidence of the authorities, both in Turin and Rome. You can do something to make this a reality, given that the blog is very useful, but it will depend on you to resist the pressure.\n\n","date":"December 27, 2013 at 9:39 am","url":"https://shroudstory.com/2013/12/26/papers-from-1991-shroud-conference/","cat":"news_&_views","id":"comment-68959","author":"Louis","site":"shroudstory"}]
