[{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"It’s a most interesting experiment, actually two separate experiments, 24 observers in the first, 80 in the second to obtain a stronger result.  For each experiment, the groups were split in half, all were aged 18-21, university students (presumably all from the same university, and possibly therefore of a particular local culture), about two-thirds female, one-third male. \nThey were all shown an A4 size photograph of a piece of ordinary modern linen and told that it may have words on it.  Those who were informed that it was a photo of a religious artifact reported on average  1.7 (24 group) or 2.3 (80 group) words with religious significance, with an SD of about 0.7, while those in the control group reported much fewer words but all of no religious significance.  \nA few issues readily come to mind.  How representative is such a group from such a narrow age range; what university faculties were represented or were they all psychology students; would a preponderance of female observers result in a greater tendency to see pareidolia; is there a localised religious bias, i.e. were they Southern baptists, or from Yale or Harvard; etc.?  There might also be a scaling factor, an A4 photograph is much smaller than a 4m x 1m linen cloth.  From the report it would seem that the average observer in the religious context might see perhaps two religious words, more or less.  If many more words were reported by several observers, would that mean that the words are in fact very likely present, rather than not, and would a larger artifact need to be adjusted for scale?     \nIn any real experiment, the objective must needs be limited.  From this experiment it may be concluded that there is a psychological susceptibility to a suggestion that religious words may be present when they are not, but it cannot inform when words are in fact faintly present.\n\n","date":"November 11, 2015 at 6:15 am","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214488","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"I really don’t know if there are writings on the shroud. \nBut I what I do know is that there is a significative difference between young students (less than 22 years old) unaware of pareidolia, like in this study, and professional optical engineers and historians well aware of this psychological phenomenon.\n\n","date":"November 11, 2015 at 6:19 am","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214489","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"But I what I do know is that there is a significative difference between young students (less than 22 years old) unaware of pareidolia, like in this study, and professional optical engineers and historians well aware of this psychological phenomenon.\nAre you sure? Because I think the whole term ‘pareidolia’ is overused in Shroud research, while the problem is different:\nHere you got those inscriptions from Castex, as well as Marion & Courage and Frale books:\nhttp://thierrycastex.blogspot.fr/Here you have (physically) some greyscale structures that can be “creatively” interpreted as letters, or even whole inscriptions. But “creative interpretation” does not prove (nor disprove) they are real. To have a good sense whether they are real structures, or merely random noise, you need more.\nI think the inscriptions & coin issues are good material for Monte Carlo simulations. These are routinely performed in similar issues in other (non-Shroud related) studies. The main question is why no one has performed them yet with regards to the alleged Shroud inscriptions & coins?\nPerhaps I know a few people who could perform such a simulation. But simply, I don’t want them to get involved in Shroud research, knowing what the hell enviroment it is.\n\n","date":"November 11, 2015 at 7:05 am","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214492","author":"O.K.","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"I was curious about the argument:\n“Monte Carlo Simulations” and then\nI have found the following links:\nhttps://www.countbayesie.com/blog/2015/3/3/6-amazing-trick-with-monte-carlo-simulations\nhttp://decision-analytics-blog.lumina.com/monte-carlo-simulations/monte-carlo-simulation-tips-and-tricks/\nAre You really experts in this field?\nI have read what Wikipedia\nwrote:\n>Analytica is a visual software package\ndeveloped by Lumina Decision Systems\nfor creating, analyzing and communicating\nquantitative decision models. …\nLink:\nhttps://en.wikipedia.org/wiki/Analytica_%28software%29\nSo…\nI’d be interested to know your opinion\non these links …\nhttp://www.lumina.com/products/free101/\nhttp://www.lumina.com/products/analytica-cloud-player/\n… Am I going a bit too off topic?\nSo…\nAt the end, perhaps, I should admit\nthat I still have to spend some time\nin order to learn (link:\nhttp://stat.wharton.upenn.edu/~stjensen/stat542/lecture14.mcmchistory.pdf ),\nalso considering the History:\nLos Alamos right after World War II\nand MCMC methods… etc. …\nI beg your pardon about that confusing\napproach (in front of a “simple problem”,\nsee also: the case of an OCR software\nand Monte Carlo simulations)…\ndue to the lack of time.\nI hope in your help.\n\n","date":"November 11, 2015 at 11:46 am","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214494","author":"piero","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"O.K. I have carried out several Monte Carlo simulations during my working career and also since then during personal research projects, so I’m well acquainted with what they can and cannot do.   Typically each possible outcome depends on a number of events all with different probabilities and frequency distributions.  A random number generator then determines whether a particular event occurs or not according to each event’s probability, and the outcome for a particular simulation obtained.  Several simulations, perhaps 1,000, are then run, and the overall probability distribution for the outcome obtained.  Several different approaches may be possible.  I have some difficulty in envisaging how a Monte Carlo simulation might be applied in deciding whether a perceived object is real or not.  Can you elucidate what you envisage?  \nTurning now to the authors’ paper and the overall problem:-\n1.  From the paper, it would seem that if several investigators asserted that they could see very much more than 2 inscriptions (say mean plus two SDs)  then that ought to be evidence that the inscriptions are in fact real, but if less than this they may only be pareidolia.  If the investigators all claimed independently to see the same inscription in the same place, that would be good evidence that the inscription was real.  However there are other issues that I’ve mentioned above, the scaling issue, and the selective bias of the observers in the model experiment. \n2. A wicked thought occurred to me last night.  In university sponsored psychology experiments it is common to use psychology students as the observers as being part of their practical training.  This creates a selective bias.  The students become trained guinea pigs, and after some experience may well guess the real purpose of the experiment, and so develop a skill in detecting the expectation of the experimenters, and seeking to please their professors, give a result that meets that expectation.  The experimenters being trained psychologists would be aware of this, and consequently the use of psychology experiments in this environment may be vulnerable to a mischievous intent, and consequently result in a suspect report.\n\n","date":"November 11, 2015 at 2:45 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214500","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"I have some difficulty in envisaging how a Monte Carlo simulation might be applied in deciding whether a perceived object is real or not. Can you elucidate what you envisage? \nMore less, we upload the Shroud results (coins, inscriptions) as potential outcome, we set a random model for greyscale distribution, and check whether obtaining a pattern of inscriptions/coins through the random process is likely or not. We set some significance level, we run several simulations, and we count a number of random “coins/inscriptions” obtained.\nAnd then we decide whether it is likely that alleged coins or inscriptions are real, or just random noise.\nDetails to be worked out.\n\n","date":"November 11, 2015 at 3:14 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214502","author":"O.K.","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"Daveb:\nO.K. I have carried out several Monte Carlo simulations during my working career and also since then during personal research projects,\nWould you manage to deal with the Shroud issue?\nBecause it may be real input to the coin/inscriptions issue.\n\n","date":"November 11, 2015 at 3:16 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214503","author":"O.K.","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"I’d need to think about it a lot more.  Looks like a lot of graphics work would be involved, don’t know that my old PC could handle it.  Certainly a helluva lot of work.\n\n","date":"November 11, 2015 at 3:48 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214504","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"If you have a lot of free time after retirement (and want to contribute an important paper re the Shroud)…\nPerhaps it is a motivation to invest into a new laptop.\n\n","date":"November 11, 2015 at 3:58 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214506","author":"O.K.","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"“If the investigators all claimed independently to see the same inscription in the same place, that would be good evidence that the inscription was real.”  But not necessarily, it might still only be an artifact of the weave. \nThe face on the planet Mars was plain enough for all to see, but that did not make it a real human face.  It was actually a mesa.  For an excellent NASA report on the face see:\nhttp://science.nasa.gov/science-news/science-at-nasa/2001/ast24may_1/\n\n","date":"November 11, 2015 at 3:52 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214505","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"This is an important point. A pareidolia is usually very clear to all observers – a cloud which looks like an elephant, for example – but it is obvious that there is no connection between the observed shape and the mechanism which produces it. In the case of the Shroud, if all observers could agree that there was an image of a coin on the eyelid (or any of the other paraphernalia supposedly cluttering up the Shroud), the connection between the observed image and the proposed mechanism which produced it would be much more difficult to deny. But they don’t. Any more than the unbiased students of Zayed University, Dubai, saw in another piece of unmarked linen.\n\n","date":"November 11, 2015 at 5:35 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214510","author":"Hugh Farey","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"Dr. Barbara Frale dwelt on the process involved in the “inscriptions”, however it is doubtful if any identification by any expert is possible if the object itself is not seen. That is where psychological influences come into the picture and that applies to both inscriptions and coins.\nhttps://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\nDr. Paolo Di Lazzaro warned about the problems inherent in “seeing” inscriptions, flowers, coins and so on on the Shroud. He felt that image processing could lead to wrong results and gave the reasons in the response to question 8, also providing an example:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"November 11, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214512","author":"Louis","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"Even when I “try” to see these with a larger than life 2nd generation negative from Enrie’s 1931 photo of the face and chest – nothing.  The coin over the right eye is the only other image detected by my eyes.\nRed herring?\n\n","date":"November 12, 2015 at 7:43 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214550","author":"chuck hampton","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"This is what I read in an article:\nI was puzzled by the fact that on certain photographs these letters were visible and not on others, so I consulted professional photographers. They told me that because the image is present only on the most superficial one to two fibers of the cloth, (each thinner than a human hair), the FOCUSING OF THE LENS (distance) by the individual photographers is of the utmost importance and that varies from photographer to photographer.\n\n","date":"November 12, 2015 at 8:17 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214551","author":"Sampath Fernando","site":"shroudstory"},{"title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin","post":"That’s a new idea to me, and makes sense. However, committed artefact-observers such as Alan Whanger claim that their observations can be seen in a wide variety of different photos.\n\n","date":"November 13, 2015 at 2:35 am","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","id":"comment-214560","author":"Hugh Farey","site":"shroudstory"}]
