[{"title":"Should a St. Louis Conference Paper be Withdrawn?","post":"No, don’t withdraw it. It happened. I don’t like rewriting history, and as I have said before, I think it is important to review every idea about the shroud on its merits, and not pretend it doesn’t exist. So we looked at David Roemer’s Gnostics idea, Stephen Jones’s Russian spies, and Vincent Ruello’s angled screen negatives, to name but a few. An idea that is not openly available, discussed and approved or discredited tends to fester. The trouble with Skurka’s mistake is that it is not just a slip of the pen or minor oversight (goodness knows I make enough of those myself, even on this very blog), but one of the cornerstones of Skurka’s neutron emission hypothesis, which he has been working on since before 1998, when this book cover was tested. Do we really think he didn’t look carefully enough at his evidence to notice such a basic mistake? Do we think his indeterminate picture of a pile of ashes and a few burnt bedsprings really shows a shrunken skull? (I notice he shows the picture in his presentation but simply mumbles “Kind of a picture. It’s very blurry. I couldn’t get a good one.”) And what happened with his X-ray film? Was there any kind of control – don’t all ashes or bits of dirt scattered on an X-ray film produce the same kind of picture? Maybe Skurka will respond to Joe with satisfactory replies, but I can’t say I’m holding my breath with anticipation.\n\n","date":"January 23, 2015 at 1:30 pm","url":"https://shroudstory.com/2015/01/23/should-a-st-louis-conference-paper-be-withdrawn/","cat":"paper_chase","id":"comment-185745","author":"Hugh Farey","site":"shroudstory"},{"title":"Should a St. Louis Conference Paper be Withdrawn?","post":"Corrected papers are often published. It should include the word “Corrected” under or above the title on the title page and a brief explanation should be offered at the end of the paper.  \nRoemer’s Gnostic speculations, Jone’s conspiracy theory and Ruello’s made up discoveries in science were not conference reports nor would they have been. The problem is that conference papers are often treated as though they were (in a sense) peer reviewed. A citation study might be very revealing. \nPapers like this, when not called out, reflect on the entire community of researchers. I’d like to see Jeffrey have a chance to make corrections. If not, at the very least, archive sites should provide notices.\n\n","date":"January 23, 2015 at 2:51 pm","url":"https://shroudstory.com/2015/01/23/should-a-st-louis-conference-paper-be-withdrawn/","cat":"paper_chase","id":"comment-185772","author":"Dan","site":"shroudstory"},{"title":"Should a St. Louis Conference Paper be Withdrawn?","post":"Papers may be corrected but not videos. I have no plans to take it down. I can add a correction if need be to the metadata that describes the video.\n\n","date":"January 23, 2015 at 5:52 pm","url":"https://shroudstory.com/2015/01/23/should-a-st-louis-conference-paper-be-withdrawn/","cat":"paper_chase","id":"comment-185806","author":"Russ Breault","site":"shroudstory"}]
