[{"title":"Looking for a paper by Mark Andersen","post":"Sadly, I think Materials Evaluation has not put its older issues online. It would be necessary to email them with your specific reprint requirements to get a copy of Mark Anderson’s paper. And no doubt pay…\n\n","date":"August 22, 2014 at 9:32 am","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","id":"comment-145444","author":"Hugh Farey","site":"shroudstory"},{"title":"Looking for a paper by Mark Andersen","post":"Searching Google for “Materials Evaluation Subject Index. 1942 to 2013” one finds a PDF where the name Andersen does not appear, nor any papers in volume 40 beginning on p. 630. It seems that this quote is only given by the Wikipedia page for the Shroud.\nThe matter was considered by Porter in this blog in 2011:\nhttps://shroudstory.com/2011/12/11/mark-anderson-disputed-walter-mccrone-substantiated/\nAlso by Porter in his “An open letter to journalists” that can be retrieved with archive.org as captured in 2008. It would seem that the Andersen story is a hearsay with only Ray Rogers as a source. If really there is a printed source authored by Andersen himself, it is strange that sindonologists have not yet been able to obtain it.\n\n","date":"August 22, 2014 at 12:48 pm","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","id":"comment-145466","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Looking for a paper by Mark Andersen","post":"If indeed “there`s a lot of people who thinks McCrone`s word is “sacred”.” according to this reader from Costa Rica, I think you only need to refer to McCrone’s own published work to show that he was completely unconvincing. I would even say he was lost.\nThere are many inconsistencies and errors in his book “Judgment Day for the Shroud of Turin”. He certainly has not proven that the Shroud is a painting by what he published in it, a claim he upheld until his death. I’ll end by one of the many blunders one can find in his book. On page 191 one can read:\n“I have found a number of art experts who are scientific enough to agree with me (see p. 289).”\nOn page 289, what you can mainly read is the reproduction of a postcard:\n“Old man Walter C. McCrone is an incompetent Senile Old FART who belongs in the Nut House. That old fraud Fudges data and misinterprets on an unprecedented scale. Citizens for scientific honesty”.\nWhere are these “art experts who are scientific enough to agree with [him]”? Nowhere to be found in his book.\n\n","date":"August 23, 2014 at 12:41 am","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","id":"comment-145567","author":"Mario Latendresse","site":"shroudstory"},{"title":"Looking for a paper by Mark Andersen","post":"Off topic, Mario, may I ask what will be with this photo of Manoppello, that I sent you a month ago or so to be installed in Shroud Scope?\n\n","date":"August 23, 2014 at 5:21 am","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","id":"comment-145596","author":"O.K.","site":"shroudstory"},{"title":"Looking for a paper by Mark Andersen","post":"Indeed a bit off-topic! I came back from vacation and looking into it. I think now that it will be better to create  a separate Web page for it. I am thinking that it should be labelled as “Manoppello Scope” and not be part of Shroud Scope. Otherwise, it will be confusing to mix the Shroud and the Manoppello Veil under the same umbrella named “Shroud Scope”.\n\n","date":"August 23, 2014 at 2:57 pm","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","id":"comment-145678","author":"latendre","site":"shroudstory"},{"title":"Looking for a paper by Mark Andersen","post":"Any microscopy from as far back as 1978 is hopelessly out of date anyway, so I think we need not bother about that ancient controversy. We just need to get the tapes looked at again in a 2014 lab- if a representative sample of these tapes is  still to be found. They are the only record of accretions to the Shroud that exist outside Turin and there must be lots on them that can be seen in 2014 that could not be seen by McCrone or anyone else in 1978.\n\n","date":"August 23, 2014 at 5:52 am","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","id":"comment-145601","author":"Charles Freeman","site":"shroudstory"},{"title":"Looking for a paper by Mark Andersen","post":"The (optical) microscopy itself is fine, 1978 or not. The tapes are still around but I believe in two sets probably dispersed at different locations as I write this. What is faulty, and even abysmal on McCrone’s part, is his interpretation, handling of data and analysis. \nWhat I find amusing is to read skeptics refer to McCrone’s work to claim that the Shroud is a painting. They either do not understand what McCrone did or never consulted his work.\nI think we should thank McCrone to have created such a trap for them.\n\n","date":"August 23, 2014 at 3:24 pm","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","id":"comment-145683","author":"latendre","site":"shroudstory"},{"title":"Looking for a paper by Mark Andersen","post":"You already know that I prefer the SPM (= AFM, CFM, SNOM …) way.\n— —\nBut, see also :\nAFM and Raman controls …\n— — *** — —\nIn any case I have found the following book:\nRaman Microscopy: Developments and Applications (Google eBook)\nGeorge Turrell, Jacques Corset\nAcademic Press, 24/giu/1996 – 463 pages\nOne of the first books devoted entirely to the subject of Raman microscopy,\nthis volume addresses issues of great interest to engineers working\nin Raman-microscope development …\n— —-\nSee also the study:\nRaman confocal microprobing, imaging and fibre-optic remote sensing: A further step in molecular analysis\nby J. Barbillat, P. Dhamelincourt, M. Delhaye and E. Da Silva\nJournal of Raman Spectroscopy\nVolume 25, Issue 1, pages 3–11, January 1994\nAbstract\nThis paper reviews some recent developments in Raman instrumentation. The introduction of the confocal design in most Raman spectrometers represents the latest advance in the field of instruments for Raman spectroscopy. It is the basis of new applications in the field of Raman microprobing and improvements in Raman imaging techniques. The basic principle of confocal microscopy is reviewed and its extension to Raman spectroscopy is discussed in terms of improved depth resolution which results in better background discrimination. A new concept of Raman imaging is also presented which benefits from the confocal system and overcomes most of the limitations of direct imaging techniques. A dual fibre-optic remote analysis scheme is described which has been developed to optimize the collection of the scattered light while minimizing the interference from the optical fibres. .\n— — — *** — —\nB.T.W. :\nDo you know the Polarized Raman Microspectroscopy?\n\n","date":"August 25, 2014 at 10:49 am","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","id":"comment-146046","author":"piero","site":"shroudstory"},{"title":"Looking for a paper by Mark Andersen","post":"Try to consider:\nRaman-AFM and nano-Raman (TERS)…\nSee under the address:\nhttp://www.horiba.com/us/en/scientific/products/raman-spectroscopy/raman-afm-and-nano-raman/configuration/\nConfigurations for Raman-AFM and TERS imaging …\n\n","date":"August 26, 2014 at 5:14 am","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","id":"comment-146236","author":"piero","site":"shroudstory"}]
