[{"title":"Now you can read it online","post":"If you look close enough, you can actually see the pupils of the eyes. The right pupil is more easily seen as the eyelid is open just a bit more than the eye on Jesus’ left side.  That is what grabbed me when I first noticed it some time back and my Guardian Angel told me what I was staring at.\n\n","date":"November 6, 2015 at 6:42 am","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","id":"comment-214288","author":"Emmett McMahon","site":"shroudstory"},{"title":"Now you can read it online","post":"I still remember the look of my father\nafter he died: he had not his eyes\ntruly closed, thus: not completely\nclosed (ie: maybe his eyes were\nclosed only for about a seventy-five percent).\nAnd this fact appeared evident\nsome hours after the first manual\nclosing of his eyelids, after his death.\nAnd so… Now I wonder how\nhad been the eyes of Jesus after his death.\nI beg you to also consider the possible\nchanges about the facial posture\nafter the use of the Sudarium of\nOviedo (thus: after the terse\ntreatment of the corpse [post mortem])\nand the deposition into the tomb for\nthe “provisional sepolture”.\n\n","date":"November 6, 2015 at 10:02 am","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","id":"comment-214294","author":"piero","site":"shroudstory"},{"title":"Now you can read it online","post":"Here I want to specify my position and\nI state that after what I heard to say from\nProfessor Gonella (he had been\nquestioned in Milan by a man who\nI did not know, after the presentation\nof the book he had done with Riggi)\nI’m very skeptical on the issue of coins …\n — — —\n>…Wacks still said in THE AUGUR No 35 (1982)\n“It is impossible to determine precisely\nthe Judaean coin that might have caused\nthe image on the Shroud since no one\ncoin design – inscription, motif, and their\nrelative positions – exactly matches the\nShroud coin image. It is this third vital\nfactor positioning – that Filas neglected\nto take into account when he computed t\nhe mathematical probability of the coin\nimage being the lituus coin of Pontius Pilate.\nIf it is taken into account the probability\nbecomes infinitesimal.\nTo prove his case, Filas must prove\nthe existence of a lituus coin of Pontius\nPilate with an error in spelling and an\nentirely new positioning of the inscription.”… …\nTaken from:\n“SHROUD NEWS – A Newsletter about\nthe Holy Shroud of Turin” by Rex Morgan\n(Author of “Perpetual Miracle”)\nIssue No. 15, September 1982\nLink:\nhttps://www.shroud.com/pdfs/sn015Sep82.pdf\n>…“It is conceivable that a portion of\nthe barley design might extend high\nenough to cause the upright line\nfollowing the ICA, but the chance\nof this happening is remote,” Wacks contends. …\n>…If the Shroud coin image was caused\nby a coin of Coponius or Ambibulus, it\nwould cause no problems concerning\nthe dating of the Shroud to the time\nof Jesus, Wacks points out, since\ncoins circulated for decades and\nlonger in the ancient world. …\nLink:\nhttp://www.amuseum.org/book/page27.html\nSo,\nI ask:\nHow far are you arrived in your research\non this controversial subject?\nHaralick spent about 6 months doing\na variety of digital enhancements to\nthe photographs publishing his findings\nin 1983 in a 66-page monograph,\n“Analysis of Digital images of the Shroud of Turin”…\nI think using the same amount of time\nwe would not work on an issue as\ncontroversial and uncertain (= the coins\nover the eyes, etc.), but we could\nwork with ATR-FTIR, DRIFTs, SERS,\nAFM, CFM, AFM-Raman, etc. and\nso we would come to some\ninteresting conclusions about\nthe Shroud of Turin…\n\n","date":"November 6, 2015 at 11:04 am","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","id":"comment-214296","author":"piero","site":"shroudstory"},{"title":"Now you can read it online","post":"Father Heinrich Pfeiffer mentioned a photograph of the “coin” on the Shroud that had been sent to Ari Kindler of the Eretz Museum in Tel Aviv and the response:\nhttps://www.academia.edu/14795646/An_interview_with_Professor_Heinrich_Pfeiffer_SJ\nChe Guevara died with his eyes fully open after he was shot dead in the Bolivian jungle. He said he was the opposite of Jesus, and sounded a bit like General George Patton when talking about an enemy. He wrote to his mother:\n“I am not a Christ or a philanthropist. I am all the contrary of a Christ. I fight for the things I believe in, with the weapons at my disposal and try to leave the other man dead so that I don’t get nailed to a cross or to any other place.”\n\n","date":"November 6, 2015 at 11:48 am","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","id":"comment-214299","author":"Louis","site":"shroudstory"},{"title":"Now you can read it online","post":"The identification of the coin over the right eye rests on a lituus, a shepherd’s crook shape, and the letters UCAI, which can form part of the inscription around the outside. However, in the case of every single lepton I can find on the internet, the letters CAI (or more usually KAI) invariably appear to the right of the vertical line of the staff and over the curl of the crook, while on the Shroud they are (if they are there at all) to the left of the vertical line. This is well discussed at http://www.amuseum.org/book/page27.html.\n\n","date":"November 6, 2015 at 11:50 am","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","id":"comment-214300","author":"Hugh Farey","site":"shroudstory"},{"title":"Now you can read it online","post":"Hugh thanks for the reference link to the coin discussion.  The principal authority cited (Wacks), seems prepared to concede the presence of the coins but could not agree with its main advocate Fr Filas that it was a Pontius Pilate coin with the lituus which he says was not issued until after August 30 AD post-dating the April 7, 30 AD date often proposed as the date of the crucifixion.  This is the date that Meier favours, however a date in 33 AD is also admissible when the lituus coins would have then been available.  However the reference also suggests that an earlier coin issued would fit the case, viz: \n“If the Shroud coin image was caused by a coin of Coponius or Ambibulus, it would cause no problems concerning the dating of the Shroud to the time of Jesus, Wacks points out, since coins circulated for decades and longer in the ancient world. The coins of Coponius and Ambibulus are among the most common of all Prefect and Procurator issues … and they were struck only about 20 years before Jesus’ crucifixion. ” \nPersonally I don’t see the coins, but that may be my lack of perception.  It is interesting that Wacks is prepared to concede an earlier coin may be there, and his main difficulty seems to be in agreeing to Fr Filas’ interpretation, that it is a lituus coin rather than with the fact(?) of the coins.  I would be inclined to ignore the authors’ contention that Jews viewed the coins with disfavour because they hated Pilate.  I’d be certain that they used the coins in everyday transactions without a moment’s thought.  [The pharisees had no difficulty in producing a so-called hated coin of the tribute to show Jesus when asked.]\n\n","date":"November 7, 2015 at 11:42 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","id":"comment-214374","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Now you can read it online","post":"There may be coins there or there may not.  Assertions either way have been contentious, relying on subjective perceptions.  Much of the problem seems to be that the resolution of the image being limited to the crowns of the threads does not permit a definitive answer.  Those who have asserted their presence may possibly be seeing pareidolia.  Those who deny their presence may lack the necessary perception.  I doubt that the matter will ever be resolved because of the inherent graininess of the image.  Nor does image enhancement, such as smoothing and blurring resolve the matter, as any positive results may merely be an artefact of the process.  Even the very clear image of a man’s face on the planet Mars was no more than a trick of nature from mountain shadows, a pareidolia.  \nI don’t think that denial of the coins on eyes should rest on claims that it was a pagan practice and unlikely to be practised in Jewish burials.  Charon’s obol to pay the ferryman was a single coin placed in the mouth, not two coins on the eyes.  The eyes might be thought to be the windows of the soul, and so placing coins on the eyes of the dead could be considered as a mark of respect to their privacy, whether or not it was a common practice.\n\n","date":"November 6, 2015 at 2:18 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","id":"comment-214312","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Now you can read it online","post":"The coin(s) are an important data treasure concerning the nature of the image formation process, the energy responsible.  The energy passed through the coins, interacting with those atoms enough to leave an image with surprising resolution on a linen cloth.  WOW!\n\n","date":"November 7, 2015 at 8:00 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","id":"comment-214366","author":"Chuck Hampton","site":"shroudstory"},{"title":"Now you can read it online","post":"Dr Haas (SMU) said to me back in 1990 that many ion ratios could be examined the next time a REAL sample(s) is made available.  The clues to the nature of the event are just waiting to be discovered.\n\n","date":"November 7, 2015 at 8:06 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","id":"comment-214367","author":"Chuck Hampton","site":"shroudstory"},{"title":"Now you can read it online","post":"I meant isotope, not ion.\n\n","date":"November 7, 2015 at 8:07 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","id":"comment-214368","author":"Chuck Hampton","site":"shroudstory"}]
