[{"id":"comment-51960","author":"anomymous","post":"I didn’t followed the discussions on this topic but I would like to urge you to read the excellent paper presented at the Valencia conference by Ada Grossi, an Italian researcher (link: http://www.academia.edu/2427474/Jewish Shrouds and Funerary Customs a Comparison with the Shroud of Turin in 1st International Congress on the Holy Shroud in Spain   Valencia April 28 30 2012 ed. Centro Espanol de Sindonologia CES ) In this paper, the author talk specifically about the supposed 2 X 8 cubits evidence and conclude that we must be extremelly careful before taking such a supposition for granted because in ancient time, the cubit measurement unit was not standard everywhere and all the time. The author state: “The debate about ancient cubits is no easy matter: the length of common cubits varies between 44.5 and 45.7 cm and that of royal cubits between 50.3 and 52.4 cm; as for the “Syrian cubit”, more correctly called “Assyrian cubit”, its measure is uncertain as much, and it’s seem therefore UNWISE TO IDENTIFY IT AT ALL COST WITH A SUBMULTIPLE OF THE SHROUD’S DIMENSION.” Folks, I AGREE 100% with such a prudent conclusion. And I would add another important possibility to back up this conclusion: nobody can be certain if the actual dimensions of the Shroud were the same originally. On this subject, the simple presence of the side strip (which presence has never been fully explained beyond any doubts by textile experts) is enough to at the very least make us very cautious concerning the question of the Shroud’s original dimensions..","date":"2013-11-18","mins":"9:29 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51961","author":"anomymous","post":"By the way, this author also indicates that it was NOT part of a normal Jewish burial to bind the enshrouded corpse with linen strips. The most common burial procedure was simply to make a loose stitching at the edges of the cloth to make sure the body would not fall off the cloth (note: this procedure is still in use during orthodox Jewish burial as it was described by Barrie Schwortz himself in a recent interview while talking about his father’s burial). This particular conclusion is another good clue to support the hypothesis of a loose configuration of the Shroud around the dead body of the Shroud at the time of the image. On this subject, we can say that historical evidence support the conclusions of Jackson et al. And Latendresse studies, which found out that a linen cloth drapped pretty loose over a dead body really seeem to be the most probable configuration of the Shroud in regard of the very slight distortions of the frontal image..","date":"2013-11-18","mins":"9:37 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51962","author":"anomymous","post":"Here, some people could say: this seem to contradict the Gospel accounts that seems to talk about many cloths. Not necessarily. It is possible that other linen cloths (smaller for sure) could have been used during the burial procedure of Jesus as “bags” that could have contained the aloes and myrrh described by John (probably in powder) and such “bags” could have been placed all around the enshrouded body (outside or more probably inside the Shroud) in order, as Barbet said in his book, to retard a bit the putrefaction process and more importantly, to prevent bad smellings in the context of an incomplete burial, which needed a return to the tomb some 36 hours later. It’s also possible that the Sudarium of Oviedo could also have been part of the “other cloths” inside the tomb, along with the main Shroud….","date":"2013-11-18","mins":"9:43 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"}]
