[{"id":"comment-52460","author":"anomymous","post":"Quote: “…SOME of the blood stains are medieval touch ups made with the motivation of making the relic appear ‘more authentic’.” If that would be true, STURP would have easily found strong evidence to support this hypothesis. The truth is precisely the opposite. In the present state of our knowledge, I don’t see any good reason to agree with such a scenario. For example, the only red ochre that was found was in microscopic quantity and scattered everywhere and not particularly more in the bloodstains regions. And the most logical hypothesis to explain these minute traces of red ochre on the Shroud is the historical fact that various medieval copies of the Shroud were made and artists were then allowed to put their painting in direct contact with the Shroud to sanctify their “replica”… I think we can forget any idea of a “touch up” that could have been made during Medieval time for the body image as well as for the bloodstains..","date":"2013-11-22","mins":"9:32 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52459","author":"anomymous","post":"Quote : “and others have carried out observations that suggest the opposite.” Who? Where can I read what they wrote about this topic?.","date":"2013-11-22","mins":"9:25 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-51811","author":"anomymous","post":"The fact that most bloodstains on the Shroud are made of exudates of moistened (or re moistened) blood clots instead of whole blood in liquid form explain why certain properties of it are somewhat different than what can be normally expect… Again, that’s one reason why I wrote this other comment today: https://shroudstory.com/2013/11/17/barrie schwortz on ewtn recently/#comment 51783 People very often forget this crucial aspect of the Shroud blood… but not Adler, nor Barbet!!!.","date":"2013-11-17","mins":"6:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51810","author":"anomymous","post":"If Dan would have done something as mean as this (blocking the account of a blogger who contributed to elevate the level of some debates related to the Shroud, that would be a total shame!!! I repeat: I’m not Yannick, I’m his phantom. I’ll let you figure out what this could mean….","date":"2013-11-17","mins":"6:09 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51809","author":"anomymous","post":"Ordinary blood mean that the blood would present all the properties of whole blood that would have stained the cloth while in liquid form. On the Shroud, the reality is very different for the vast majority of the bloodstains and that’s precisely where the most definitive piece of evidence in favor of authenticity is hidding… But when people (like you obviously) don’t want to see the evidence, they will always deny what is obvious..","date":"2013-11-17","mins":"6:07 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51796","author":"anomymous","post":"Thibault say: “Yes, there is a problem with potassium….in whole blood.” That’s PRECISELY why I wrote this new comment of mine regarding Barrie’s interview (see: https://shroudstory.com/2013/11/17/barrie schwortz on ewtn recently/#comment 51783) and what he said versus the nature of the blood on the Shroud, which is NO ORDINARY BLOOD!.","date":"2013-11-17","mins":"5:36 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51659","author":"anomymous","post":"Quote: “The blood is not that hard to duplicate.” Let me laugh at this one! No one has ever come close to deplicate the blood and serum stains on the Shroud (not even Garlaschelli, Allen or Nickell) and you know why? Simply because it takes a real tortured corpse (yes, a dead body – because there are both pre and post mortem bloodstains) to replicate all these blood and serum stains and not only that, it takes a bloody corpse that must be covered with clotted wounds and not with fresh blood that would still be in a liquid state. Also, people always forget that it is a fact that the blood and serum stains were on the cloth before the image. Consequently, the only possible scenario involving a man made forgery for the image is one that involve a forger who would have artificially created (with a scorch technique or something else) the body images (back and front) with a real bloodstained burial cloth of a real crucified man. And our hypothetical forger would have been so genius that he would have succeed to create perfect body images (forensically speaking) while being able (we don’t know by what miracle) to not distrurb or damage at all the blood and serum stains on the cloth! This is so ridiculous as a hypothesis that I don’t understand some people still believe the Shroud can be the product of a man made forgery… The answer to the Shroud image formation must lie in some form of interaction (most probably natural) between the corpse of a real crucified man and the surface of his real burial cloth. Period. There’s no other rational possibility than this one and, by the way, that’s one of the main conclusion of STURP’s final report about the Shroud..","date":"2013-11-16","mins":"7:11 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51667","author":"anomymous","post":"In the case of the Shroud, when I use the word “perfect” is in the sense of “looking authentic” or, if you will, “looking real”. So much in fact that almost every medical or forensic experts were convinced, just like the ENTIRE STURP team, that these images must have been formed by an interaction between the cloth and a real crucified corpse. And it’s the same thing for the blood and serum stains..","date":"2013-11-16","mins":"8:25 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51674","author":"anomymous","post":"David, any transfer process that can “scorch” the linen fiber imply automatically a high amount of energy, which, because of its high intensity, cannot produce a discontinuous distribution of colored fibers like it has been noted in the image area of the Shroud. So, here’s my advice to you: forget about Corona discharge or UV light or any other burst of high energetic radiation has a possible solution for the Shroud image. It is simply scientifically impossible for such energetic processes to produced a discontinuous distribution of colored fibers like we see on the Shroud. And again, for the same reason I just mentioned and also because of the evidence of the bloodtains, you can also completely forget the idea of a forgery made with a scorch technique. I repeat myself but I can’t shut up about that: the answer for the Shroud image formation must have something to do with a natural process coming from the corpse that was enshrouded for less than 48 hours Inside that cloth. The solution cannot be found outside of this….","date":"2013-11-16","mins":"10:59 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51676","author":"anomymous","post":"I must write again the last sentence with an important addition: the answer for the Shroud image formation must have something to do with a natural AND VERY MILD process coming from the corpse that was enshrouded for less than 48 hours Inside that cloth. The solution cannot be found outside of this… All the data coming from the Shroud (and particularly the fact that the blood and serum stains outside the immediate vicinity of the 1532 fire holes were not disturbed or damaged by the image formation process, along with the discontinuous aspect and extreme superficiality of the image) points in direction of a mild process, which have all the chances in the world to have been natural. Nature is very surprising at times!.","date":"2013-11-16","mins":"11:04 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"}]
