[{"id":"comment-51801","author":"anomymous","post":"On the contrary to you, I NEVER claim being a scientist. So if I made some mistakes versus the scientific method, pardon me please! ; ) But the claim you make that my position is magic based is ridiculous. I simply follow the most solid data coming from the Shroud, reflect upon them for a while using only rationality (and no magical thinking) in order to extract all the possibilities given by those data, while at the same time, leaving aside all the other scenario that cannot fit with them (like your hypothesis of the scorch by the way)..","date":"2013-11-17","mins":"5:48 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51804","author":"anomymous","post":"The fact that there are both pre and post mortem blood material on the Shroud, the fact that there is a much higher than normal level of bilirubin in the blood, the fact that there are serum stains around many bloodstains, the fact that most of these bloodstains come from exudates of moistened (or re moistened) blood clots and the fact that these stains are consistent with someone who died in a vertical position of crucifixion and was later on transferred to the tomb and laid in the Shroud in an horizontal position, should be enough for you to understand what I meant by saying that “The bloodstains on the Shroud are both physically and chemically typical of any highly traumatized body that was tortured, scourged and who died by crucifixion.” By the way, you must read Fazio and Mandaglio’s reply to the highly critical review you wrote the other day versus their work: https://shroudstory.com/2013/11/09/video barrie schwortz at the pikes peak prophesy summit/#comment 51786.","date":"2013-11-17","mins":"5:53 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51781","author":"anomymous","post":"Charles wrote: “There is just one simple point I want to add it seems. From these debates, that if the Shroud is not authentic, it must be a forgery. In fact there is a third possibility, that it was a painted cloth made for some other function that became venerated (as an icon) and was then ADOPTED as the genuine burial shroud of Jesus.” Charles, you can forget that one! The evidence of the bloodstains is there to contradict completely such a scenario. Read the paper written by Yannick about that (link: http://www.shroud.com/pdfs/n76part5.pdf) and, at the end of your reading, I hope an intelligent and rational guy like you will agree with him that, because of this important evidence coming from the bloodstains (which is too often forgotten or left aside or denied by the skeptics) there are only 4 possible scenarios to explain the Shroud and not a single one of those include the possibility of a man made forgery. This path is a dead end my friend. Concerning the forgery thesis, I’m affraid the Shroud image can only be a natural (and most probably) accidental product of a forger who would originally tried to replicate the bloody stigmata of Christ by enveloping for some time the real crucified corpse of a man who suffered the same tortured than Jesus as reported by the Gospels (including the crowning with a cap of thorns) in a burial cloth. Then, after a certain time (which must have been of something between 24 and 48 hours), it is possible that our very gruesome and hyper realistic forger would have found, most probably to his astonishment, that he not only succeeded to replicate the stigmata of Christ but also to imprint a body image of the crucified man on the cloth. It is also possible, because the Shroud image is possibly a latent sort of image that could have taken decades to become visible, that our highly hypothetical forger would only have discovered the body image many years later. Seriously, in face of all the data coming from the Shroud, if someone pretend it to be the work of a forger, I don’t think he has the right to defend another scenario than the one I just describe (except a similar scenario involving the same kind of forgery but with a forger who would have been aware of the fact that he would get a body image of his crucified victim on the cloth). Seriously, when you analyze the level of probability for such an extravagant scenario to be true, you end up with a very low result! In my mind, it’s much more plausible to think the Shroud is just want tradition say it is: the authentic burial cloth of Jesus of Nazareth. Note: this statement doesn’t imply that some form of miraculous process must have been active in order to produce the body imprint on the cloth. And concerning your statement “I still haven’t found anyone who has ever seen bright red blood used in a criminal trial as evidence that the injured/deceased was tortured before death – yet it seems to be Barry’s clinching argument.”, I think you misunderstood a bit the heart of what Barrie meant because I think that all he wanted to express was precisely the opposite of what you said. Yes, I think that Barrie wanted to say that it’s only when he found out a real credible and rational explanation for the reddish aspect of the blood that he became fully convinced that the Shroud was really authentic. In the end, it’s not the reddish aspect of the blood that was understood by him “as evidence that the injured/deceased was tortured before death” but the opposite: it’s the fact that there is a much higher than normal level of bilirubin in the bloodstains (which is a sign of a great suffering of the Shroud man prior to his death and which caused the blood to remain read until this day with maybe the help of possible presence of saponaria residues on the cloth, which still need to be proven) that was understood by Barrie as a sort of “definitive” evidence of the authenticity of the cloth (but only after he put it alongside all the other solid pieces of evidence that exist to support such a conclusion)..","date":"2013-11-17","mins":"4:44 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51783","author":"anomymous","post":"By the way, after having seen and heard a lot of interviews done by Barrie, it was the first time I heard him say clearly that the bloodstains on the Shroud are made of exudates of moistened blood clots, which is a very good thing, because it is a crucial aspect of the bloodstains (and, by extrapolation, of the serum stains) that should help the public to understand that the blood on the Shroud is NO ORDINARY BLOOD! This is much too often forgotten or misunderstood by people interested in the Shroud, while it is probably the most important data coming from the Shroud to support the authenticity of the relic as the real burial cloth of Jesus of Nazareth! So, bravo Barrie for your presence of mind concerning the very particular nature of the bloodstains on the Shroud and I surely hope that, in future interviews and public lectures, you will keep on emphasizing the fact that what’s as stained the Shroud is NO ORDINARY BLOOD. This is VERY IMPORTANT..","date":"2013-11-17","mins":"4:49 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51795","author":"anomymous","post":"The bloodstains on the Shroud are both physically and chemically typical of any highly traumatized body that was tortured, scourged and who died by crucifixion. Therefore, it cannot be anything else than a burial cloth that enveloped for less than 48 hours a real dead body of a real crucified man and this could have been done by a forger who wanted to replicate the bloody stigmata of Christ (highly improbable scenario) or by some persons during a real Jewish burial procedure involving the corpse of Jesus or of another person looking like him. So, I don’t know what you tried to express with me using two different mode of expression..","date":"2013-11-17","mins":"5:33 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51787","author":"anomymous","post":"Precision Emmett: The Shroud is a man made object (most probably manufactured during the Antiquity), the image on it is not….","date":"2013-11-17","mins":"5:09 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-57172","author":"anomymous","post":"Of course, I was talking about the same material (or a reserved portion of it) he first dated with his new method. I know C14 destroy the material but I think that would have been the only way to learn if his new method can produce any reliable result..","date":"2013-12-07","mins":"7:32 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57189","author":"anomymous","post":"What I was talking about was dating Fanti’s sample with C14, not Julls’ samples..","date":"2013-12-07","mins":"9:26 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57165","author":"anomymous","post":"No matter if we talk about Fanti’s method or a new C14 dating that could be performed under better conditions, in my mind, if such a method produce a bullseye result about the Shroud’s age like the result published by Fanti did, I have to be highly skeptical about that. On this subject, this is exactly what is thinking an expert in C14 dating like William Meacham, who wrote in his book The Rape of the Turin Shroud that, in 1988, he was expecting a result around the 4th or 5th century, even though he was convinced of the authenticity of the Shroud. Why? Because there are too much possibilities of contamination with a relic like the Shroud who was held by numerous hands (many of which we don’t know anything about) in numerous conditions (again, many of which we don’t know anything about) and I think this is ever truer in the particular case of Fanti’s highly suspicious samples (taken with a vaccuum from the space between the Holland cloth and the backside of the Shroud, which could well have traped a lot of alien material that have nothing to do with the original cloth over the centuries). So, in such a context, it is almost scientifically impossible to expect the dating result will give a pretty 30 AD result! And in the particular case of Fanti’s dating, here’s a very good question that I don’t think was ever asked: Why in the world he did not ALSO dated his samples with the well accepted C14 method in order to compare the results and see if his new method could have some chance to yield accurate results in the case of ancient textiles?.","date":"2013-12-07","mins":"6:55 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-54544","author":"anomymous","post":"Just as it is meaningless to still try to disprove the “scorch theory” while every one who knows the data very well (especially concerning the blood and serum stains) and have two cents of intelligence knows that such a man made forgery CANNOT be what have caused the body image on the Shroud….","date":"2013-12-01","mins":"6:47 pm","url":"https://shroudstory.com/2013/12/01/remembering-shroud-blood-scientist-dr-john-h-hellera-guest-posting-by-kelly-kearse/","cat":"uncategorized","title":"Remembering Shroud Blood Scientist Dr. John H. Heller–A Guest Posting by Kelly Kearse"},{"id":"comment-54606","author":"anomymous","post":"If the blood evidence is approved, then the skeptics should rely of the only forgery scenario that is possible, which imply the use of a real crucified corpse in order to produce a false relic of the Shroud of Christ with all his bloody stigmata (and with a body imprint in extra). That’s the only possible forgery scenario that exist once you accept that the blood on the Shroud is real blood and came most certainly from the Shroud man himself… But I repeat myself over and over again. Sorry. It’s just that people don’t seem to get it..","date":"2013-12-01","mins":"8:50 pm","url":"https://shroudstory.com/2013/12/01/remembering-shroud-blood-scientist-dr-john-h-hellera-guest-posting-by-kelly-kearse/","cat":"uncategorized","title":"Remembering Shroud Blood Scientist Dr. John H. Heller–A Guest Posting by Kelly Kearse"}]
