[{"id":"comment-51786","author":"anomymous","post":"Here’s the reply of Mr. Fazio and Mandaglio concerning the highly critical review of Hugh Farey that we can find just above (link: https://shroudstory.com/2013/11/09/video barrie schwortz at the pikes peak prophesy summit/#comment 50952): “ Dear Hugh Farey, we have read your intervention on our Shroud papers. Your approach shows that you do not know the stochastic processes. Besides, you do not use the language of the ”true scientist”, you write as a teacher of Natural Science. Therefore, WE INVITE YOU TO PRODUCE A SHROUD ARTICLE ON THESE QUESTIONS IN A INTERNATIONAL REVIEW. Later, we will answer and if your ideas are without mistakes, we will accept the results that you have obtained. THE COMPARISON OF THE IDEAS (the one among “true scientists”) HAPPENS BY INTERNATIONAL JOURNALS. In a blog, on the web, in a bar, on the beach, a person can write and say anything. We are nuclear physicists and our articles are, generally, published in: Phys. Rev. , Phys. Rev. Lett. (USA), J. Phys. , Eur. Phys. J., Phys. Lett. , Nucl. Phys. , Few Body System , Europhys. Lett. (EUROPE)), Yadernaia Fizica , Izv, Rossiiskoi Ak. Nauk (RUSSIA) , J. Phys. Soc. Jpn. , Prog Theor. Phys. (JAPAN) ,Nucl. Science Tech. (CHINA) Mod. Phys. Lett. , Int. J. Mod. Phys. Therefore, as you can understand, the comparison for us is necessary and, when it is the case, we admit the errors. So, we continue to believe, without presumptuousness, our Shroud papers while, WE WAIT FOR AN ARTICLE OF YOURS IN AN INTERNATIONAL REVIEW. Sincerely, G: Fazio and G: Mandaglio “ Note from me: After this post of Mr. Fazio and Mandaglio, I hope there will not be anyone left (not even Hugh!) to believe these 2 nuclear physicists don’t know what they are talking about when they categorically say that no known form of high energetic radiation (whether it be a scorch, a burst of UV light, a Corona discharge, a burst of protons, of neutrons, etc.) can produce the kind of body image we see on the Shroud with all its very particular characteristics, especially the spatial encoding, the highly superficiality of the image AND the discontinuous distribution of colored fibers in the image area..","date":"2013-11-17","mins":"5:08 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50589","author":"anomymous","post":"On Youtube, the title of the video is “Shroud of Turin: Hoax or Proof of Resurrection?” How many times do we see such titles associated with the Shroud? I’m always amazed to note how most people (including most Shroud researchers these days) don’t seem to understand that the most probable answer for the Shroud can well be hidden right between these two extreme positions (i.e. Not a hoax and not a by product of the Resurrection, but more likely a natural (but amazing nevertheless) product of the dead body of Jesus of Nazareth)! As long as most people will only seek the answer for the Shroud and its body image in these 2 extremities, I have a feeling that we’ll never found the real cause for the image. Look people, the Shroud is a real bloodstained burial cloth of a real crucifed man that suffered the same set of tortures as Jesus of the Gospel and the image on it represent what look like Jesus Christ right after his Passion and death. Taking that into account, don’t you think the most logical and rational (and thus probable) cause for this body image has to be some kind of natural interaction between the dead body and the cloth? And finally, when you also take into account (without any religious or anti religious preconceive notions) the professional judgment of radiation experts like Rogers, Fazio and Mandaglio (who all categorically stated that the image cannot be the product of any kind of high energetic radiation and cannot be the product of a forger), then you are kind of “forced”, like me, to come to the sad conclusion that most people today don’t understand the Shroud correctly as they only tend to see an hoax or a proof of the Resurrection while looking at this cloth, when they should see instead a possible proof of God’s Incarnation in our humanity and a proof of the validity of the Gospel accounts concerning the Passion and death of Jesus (and, by extension, a pretty good clue that Christ’s disciples were truly convinced of the reality of Jesus’ Resurrection). Last thing: I have not watch the video of Barrie’s presentation but I will and I’m sure that, as usual, it is well done and interesting….","date":"2013-11-09","mins":"7:58 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50681","author":"anomymous","post":"First, the paper of Fazio you mention talks mainly about a hypothesis he proposed (which I don’t think is the most probable by the way!) concerning one aspect of the Shroud’s dorsal image that is mainly based on the possible presence of burial ointments on the back part of the Shroud. In this context, the fact that a nuclear physicist ask some questions to a biblical scholar about the ancient Jewish method of burial and burial ointments is completely normal and part of the proper way to do a good scientific research. I don’t see any problem there and, in fact, I see this as another proof of the professionalism of this person. And secondly, you can be certain that the Giovanni Fazio I often refer in my comments, as well as his colleague Mandaglio, are two real experts in radiations and, therefore, we must listen very carefully to what they have to say about the image formation that, in their opinion of expert (as well as the opinion of the late Rogers, who was another true expert in radiations), cannot have been caused by a man made forgery (including a scorch), no more than a release of some high energetic radiations by the dead body of the Shroud man, but on the contrary, must have been caused by a natural interaction (still undetermined) between the cloth’s surface and the dead body. And if you don’t believe me when I say that both Fazio and Mandaglio are true experts in the field of radiations, take a good look at the details of where Fazio and Mandaglio are currently working: Fazio: 1. Istituto Nazionale di Fisica Nucleare, Sezione di Catania, I 95123 Catania, Italy. 2. Dipartimento di Fisica e di Scienze della Terra, dell’Università di Messina, I 98166 Messina, Italy. Mandaglio: 1. Istituto Nazionale di Fisica Nucleare, Sezione di Catania, I 95123 Catania, Italy. 2. Dipartimento di Fisica e di Scienze della Terra, dell’Università di Messina, I 98166 Messina, Italy. 3. Centro Siciliano di Fisica Nucleare e Struttura della Materia, 95125 Catania, Italy. Last thing: I know Fazio personally via emails and, as he told me, he and Mandaglio have absolutely no pro religious or anti religious agenda behind their backs (just like Rogers by the way) and the only motivation they have is to explore the mystery of the Shroud in a purely scientific way, which is only based on all the pertinent data related to the relic..","date":"2013-11-10","mins":"7:36 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50684","author":"anomymous","post":"Additional comment: Unfortunately for the diehard skeptics and the supernatural and religious fanatics, the professional conclusions of radiation experts like Roger, Fazio and Mandaglio concerning the nature of the image formation do not fit at all with their preconceived ideas. And since the major part of those interested by the Shroud comes from these two “extreme” categories, I think that explain why these particular conclusions have generally not been well accepted by most Shroud researchers as well as by most shroudies..","date":"2013-11-10","mins":"8:07 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"}]
