[{"author":"stephen_e_jones","post":"Kyle>I'm invoking the \"any shroud related topic on newest post\" rule.No need to invoke it. As long as a comment is not \"offensive or sub standard\" then if it is \"under my latest post [it] can be on any one Shroud related topic\" without being \"off topic\" (see my policies below). >I was recently reading about the Sudarium of Oviedo and noticed that it is almost universally accepted that the radiocarbon dating tests performed on it were inaccurate. It wasn't that it was \"inaccurate\" but according to the then Director of the Arizona radiocarbon dating laboratory, Paul Damon, \"the dating was never carried out\":See my post 28 Jul12 (words in bold are the Shroud sceptic Charles Freeman's): Freeman continues to mislead his readers by selectively concealing from them relevant information in his claim that the Sudarium has had \"a radiocarbon 14 dating apparently of c. 700 AD\":Those trying to assess the authenticity of the Sudarium of Oviedo have to contend with a radiocarbon 14 dating apparently of c. 700 AD. But Freeman's claim is misleading (and what's more, since he surely must have read Guscin's book, he knows it is misleading) that \"the Sudarium of Oviedo \"had ... A radiocarbon 14 dating ... Of c. 700 AD.\" What Freeman does not tell his readers is that Guscin went into this very thoroughly in his book, detailing his correspondence with the Tucson Arizona radiocarbon dating laboratory, and he concluded:\"The only conclusion that can be drawn from this, and the Tucson laboratory would seem to agree, is that the whole affair was something of a shambles. Mr Jull ends his fax to me offering to carry out a serious radiocarbon dating on a sample of interest. The samples were not taken with permission for radiocarbon dating, and had presumably been taken by Monsignor Ricci about 15 years before being sent to Tucson. When sent, insufficient provenance information accompanied them; one of the samples was even stated to be 11th century. Paul Damon says the dating was never carried out, and in the results sent to Italy the sample numbers do not coincide. The laboratory suggests a serious experiment. Taking all this into account, the supposed results of the carbon dating of the sudarium can safely be ignored.\" ([Guscin, M., 1998, \"The Oviedo Cloth,\" Lutterworth Press: Cambridge UK,] pp.83 84).\" >I have been able to find very little information on it besides that. See above.[continued].","date":"2017-06-06","mins":"11:23 AM","url":"http://theshroudofturin.blogspot.com/2017/06/real-human-blood-23-man-on-shroud.html","title":"\nReal human blood #23: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic!\n"},{"author":"stephen_e_jones","post":"Anonymous>I read that type AB is the newest of blood types. Mostly starting only ten or twelve centuries ago. Is this true and what data supports this claim?Thanks for your comment. According to a Dr. Peter D'Adamo at http://www.dadamo.com/bloodtype AB.htm:\"Type AB blood is rare – it’s found in less than five percent of the population. And it is the newest of the blood types. Until ten or twelve centuries ago, there was no Type AB blood type. Type AB resulted from the intermingling of Type A with Type B.\"Whether this is true or not, I don't know. In fact I don't see how anyone could know for sure, since it presumably is impossible to test the type of centuries old blood and all old human blood tends to become type AB.And again the significance of the Shroud blood being type AB is that if it was anything else, e.g. Type O, then that would be evidence against it being very old and evidence for it being European.Stephen.","date":"2011-06-24","mins":"11:20 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"stephen_e_jones","post":"[continued]>Do you have an opinion on the accuracy of this test ...See above that there was no test, or if there was one, it was so flawed that the Arizona radiocarbon dating laboratory has disowned it.But in general, if a radiocarbon date disagreed with other historical information (e.g. The Sudarium of Oviedo left Jerusalem in AD 614 see my 24 Jan17) then it is the radiocarbon date that is wrong, presumably due to contamination with younger carbon.>and do you think its inaccuracy has any bearing on your theories regarding the carbon dating of the Shroud?This is particularly so with the Shroud. The evidence is overwhelming that the Turin Shroud is authentic and the laboratories and Nature should have taken that into account. It is a form of scientific fraud to state the result of a scientific test without acknowledging the evidence against your result.The standard of scientific honesty that all scientists, including those involved in the radiocarbon dating of the Shroud, should adhere to is that set by the late Professor of Physics at Caltech, Richard P. Feynman (1918–1988) (my emphasis):\"It's a kind of scientific integrity, a principle of scientific thought that corresponds to a kind of utter honesty a kind of leaning over backwards. For example, if you're doing an experiment, you should report everything that you think might make it invalid not only what you think is right about it: other causes that could possibly explain your results; and things you thought of that you've eliminated by some other experiment, And how they worked to make sure the other fellow can tell they have been eliminated. Details that could throw doubt on your interpretation must be given, if you know them. You must do the best you can if you know anything at all wrong, or possibly wrong to explain it. If you make a theory, for example, and advertise it, or put it out, then you must also put down all the facts that disagree with it, as well as those that agree with it ... The idea is to try to give all of the information to help others to judge the value of your contribution; not just the information that leads to judgment in one particular direction or another ... I'm talking about a specific, extra type of integrity that is not lying, but bending over backwards to show how you're maybe wrong, that you ought to have when acting as a scientist.\" (Feynman, R.P., 1985, \"Surely You're Joking, Mr Feynman!,\" Unwin Paperbacks: London, Reprinted, 1990, pp.340 343)Stephen E. Jones MY POLICIES. Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Except that comments under my latest post can be on any one Shroud related topic. To avoid time wasting debate I normally allow only one comment per individual under each one of my posts..","date":"2017-06-06","mins":"12:04 PM","url":"http://theshroudofturin.blogspot.com/2017/06/real-human-blood-23-man-on-shroud.html","title":"\nReal human blood #23: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic!\n"},{"author":"stephen_e_jones","post":"Bippy>I would also like to apologize to Barry Schwartz for my rash response.I am not sure what you are apologisng for, but his name is Barrie Schwortz and I know that he doesn't read my blog, let alone comments to it. He did not even realise that I had a Shroud of Turin blog until recently.Stephen E. Jones.","date":"2012-02-12","mins":"8:56 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"stephen_e_jones","post":"Bippy123>Hopefully this will get indexed quick by google so that other researchers could also get this out there.Yes. That's why I posted it in my February 2012 Shroud News, even though it was 2010 news. As far as I know, no Shroudies saw it.So thanks again for your contribution to Sindonology!Stephen E. Jones.","date":"2012-02-12","mins":"9:00 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"stephen_e_jones","post":"Flagrum3>... You may want to check out Dan's Shroud of Turin Blog as ... Immunologist Kelly P. Kearse has written a fine post to this very topic.Thanks, I saw it: \"MUST READ: A lot of old blood types as AB: Not Exactly. I noted Kearse's summing up: \"Is the blood on the Shroud type AB? Probably. ... It is best concluded that the results suggest that the Shroud bloodstains are type AB as shown by forward typing methods. To dilute the significance of these results by adding that \"however, all old blood types as AB\" or \"all old blood is degraded to AB\" unfairly oversimplifies the issue ... This is simply not always the case.\"Good to have that factoid put back in its box!\"... Serological typing has been successfully used in the study of mummies by Robert Connelly, including King Tutankhamun with blood type A.\"And also to have it confirmed that the blood typing of 14th century BC Egyptian mummies as type A, was valid.I also found this interesting, that the Shroud's blood type could in principle be absolutely confirmed by DNA:\"... Expression of human ABO blood groups is controlled by a single locus in exons (coding segments) 6 and 7 of chromosome 9. If molecular analysis of this region were feasible, such studies would help address previous concerns raised with serological techniques regarding the blood type.\"Stephen E. Jones.","date":"2012-02-17","mins":"10:27 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"stephen_e_jones","post":"Radha>i heard that any postmortem blood gives AB grouping i mean to say blood taken during autopsy You don't cite any reference so I am unable to comment specifically on mere hearsay.But your comment prompted me to repost today as a separate post, \"Old blood does not always degenerate to type AB, so the Shroud of Turin's and the Sudarium of Oviedo's blood group being AB is significant!\" my comments on the article \"King Tut's Dad's Toe Returns Home,\" in my post \"Shroud of Turin News for February 2012,\" referred to in comments above, where a family of ancient Egyptian mummies has a blood type which was not AB.So what you heard, \"that any postmortem blood gives AB grouping\" is not true.Stephen E. Jones Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. I reserve the right to respond to any comment as a separate blog post..","date":"2012-07-14","mins":"8:51 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"stephen_e_jones","post":"Bippy123>This debunks the theory that all blood degrades to type ab You haven't provided any evidence. Just assertions. Admittedly I haven't seen any hard evidence that old blood does degrade to type AB, but since type AB is the absence of antibodies (see above), I assume that it is so.What I would like to see is blood from a 2,000 year or older body that is not type AB. If you know of any that is in an authoritative source, e.g. A scientific journal, not just a web page that asserts it, I would appreciate you or anyone supplying the details in a comment.Stephen E. Jones Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Each individual will usually be allowed only one comment under each post. Since I no longer debate, any response by me will usually be only once to each individual under each post..","date":"2012-02-07","mins":"7:45 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"stephen_e_jones","post":"Bippy123>In my former post I posted that tut had type ab, what I meant to say was type a2 which is definitely different than ab.Thanks for the correction.>Can anyone verify this about tut before I get to a desktop pc?Googling on \"King Tut blood group A2\" I found a number of hits, including this one:\"King Tut's Dad's Toe Returns Home,\" Rossella Lorenzi, Discovery News, April 15, 2010 ... A toe belonging to King Tutankhamun’s father has been finally returned to Egypt, the Supreme Council of Antiquities said on Wednesday. The bone piece belonged to mummy KV55, which was identified as Akhenaton during a recent major genetic investigation into King Tut's family. The son of Amenhotep III and also the father of Tutankhamun, Akhenaton, (1353 1336 B.C.) is known as the \"heretic\" pharaoh who introduced a monotheistic religion by overthrowing the pantheon of the gods to worship the sun god Aton. The terminal phalanx of his great toe, probably from the left foot, was taken away in 1968, when the Department of Antiquities in Cairo, under the supervision of the then director, handed it over to the late Professor Ronald Harrison of Liverpool University. \"Since then, the specimen has been held securely in my laboratory, but I decided it had to `go home,' particularly since very few people knew where it was,\" Robert Connolly senior lecturer in physical anthropology from the University of Liverpool's Department of Human Anatomy and Cell Biology, told Discovery News. Connolly, who authored several scientific papers with Harrison, used the specimen to determine the blood group of KV55, then believed to be Smenkharel, an ancient Egyptian pharaoh of the late 18th Dynasty. \"The remains appeared to be A2 with the antigens M and N present. This was identical to the blood group of Tutankhamun,\" Connolly said. ...While not a scientific journal, I regard this Discovery News science news report as sufficiently authoritative, especially as it quoted Dr. Connolly's words: \"The remains appeared to be A2 with the antigens M and N present,\" to establish that old blood does not necessarily degrade to AB. Especially bearing in mind that at 14th century BC King Akhenaton's (not Tutankhamun's) remains are much older than the Shroud's presumed 1st century AD.Which means both the Shroud's and the Sudarium of Oviedo's blood group being AB is significant and cannot just be set aside by the claim that old blood always degrades to type AB. I am more than happy to be corrected on this one! Thanks again for the tip off.Stephen E. Jones Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Each individual will usually be allowed only one comment under each post. Since I no longer debate, any response by me will usually be only once to each individual under each post..","date":"2012-02-09","mins":"7:51 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"stephen_e_jones","post":"Bippy123 See my subsequent post, \"King Tut's Dad's Toe Returns Home,\" in my Shroud of Turin News for February 2012, where I acknowledge: \"I was alerted by a commenter bippy123 ... That King Tutankhamun's blood type was A2.\"Thanks again.Stephen E. Jones.","date":"2012-02-11","mins":"5:53 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"id":"comment-24848","author":"stephen_e_jones","post":">Bloodstains. As usual, the “obvious” turns out to be almost the exact opposite. While few (perhaps none) of Stephen Jones’s observations are incontrovertibly incorrect, even fewer (perhaps all) are utterly unchallengeable They are not MY observations, as though I just made them up off the top of my head. I meticulously referenced each point I made back to the Shroud pro authenticity literature. And of course, in our postmodern age, ANYTHING can be, and IS, challenged, but that does not thereby make it UNTRUE. There are indeed many problems of understanding how and why the bloodstains appear on the Shroud the way they do, and I don’t pretend to have all the answers. The evidence seems to suggest that the body was washed which moistened the bloodstains and it is that moistened blood which appears on the Shroud, explaining at least partly why earlier bloodstains on the Shroud which would have dried appear to be as fresh as later bloodstains. I will deal with that under section “12.Objections” or “13.Questions.” But it always gets back to the only two reasonable alternatives (see my “1.3 The central dilemma of the Shroud“). Either 1) the Shroud is an incredibly brilliant medieval or earlier FAKE, intended to depict Jesus’ crucified body and blood on it; or 2) the Shroud is AUTHENTIC, the very burial sheet of Jesus, with the image of His body and His blood transferred to it. If the latter alternative is true, as I am persuaded it is, then any problems of how Jesus’ image and blood were transferred to the cloth are merely APPARENT problems. Problems of our limited UNDERSTANDING, not problems in REALITY. After all, we don’t have Roman crucifixion victims and their shrouds available today to scientically study, let alone RESURRECTED ones! And as my posts say, I am collecting one by one the problems of the only reasonable alternative: the medieval or earlier forgery theory, to be brought together and discussed in section “9. Problems of the forgery theory.” As will then be seen, any problems of the authenticity theory PALE INTO INSIGNIFICANCE compared to problems of the forgery theory. Stephen E. Jones.","date":"2013-02-19","mins":"8:40 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","title":"Stephen Jones’ New Posting on the Bloodstains"},{"id":"comment-25728","author":"stephen_e_jones","post":"Going by the image above, the Shroud Scope image that Colin Berry is referring to is of a bloodstain in the Man’s hair alongside His right temple. But as Lavoie showed, and Adler agreed with, the bloodstains which appear to be in the Man’s hair alongside His face and temples were actually on the sides of His face and temples. That is, those bloodstains and image are out of stereoregister. So looking at an image under those bloodstains is looking at the wrong place. This is explained by John Jackson’s Cloth Collapse Theory, as being due to the Shroud around Jesus’ head flattening out as it fell into the source of radiation where Jesus’ resurrected body had been. Note that Lavoie arrived at his conclusion by experimenting with a cloth around a man’s head with imitation bloodstains copied from the Shroud and daubed on it. It was unexpected by him and he was not trying to make his facts fit Jackson’s theory. In fact he made his discovery in 1983, eight years before Jackson proposed his theory. Read Lavoie’s book, “Resurrected: Tangible Evidence That Jesus Rose from the Dead” (2000) or his “Unlocking the Secrets of the Shroud” (1998). Coincidentally, my latest but one post on my The Shroud of Turin blog, “The Shroud of Jesus?: 2.5. The bloodstains” covered this: “The blood marks in the hair along the sides of the face (see above) are actually on the sides of the face and temples of the man’s body[50]. That is those blood marks on the cloth are out of stereoregister with the Shroud’s image of the physical face and temples upon which they were[51]. As we shall see in “10. How was the Image Formed?”, this is explained by Dr. John Jackson’s “Cloth Collapse Theory”[52]. … 50. Lavoie, G.R., 2000, “Resurrected: Tangible Evidence That Jesus Rose from the Dead,” [1998], Thomas More: Allen TX, pp.114 115. [return] 51. Adler, A.D., “The Shroud Fabric and the Body Image: Chemical and Physical Characteristics,” in Scannerini, S. & Savarino, P., eds, “The Turin Shroud: Past, Present and Future,” International scientific symposium, Turin, 2 5 March 2000,” Effatà: Cantalupa, 2000, pp.51,59. [return] 52. Jackson, J.P., “An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image,” in Berard, A., ed., 1991, “History, Science, Theology and the Shroud,” Symposium Proceedings, St. Louis Missouri, June 22 23, 1991, The Man in the Shroud Committee of Amarillo, Texas: Amarillo TX, pp.325 344.” Stephen E. Jones.","date":"2013-02-26","mins":"9:16 am","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."}]
