[{"id":"comment-19054","author":"stephen_e_jones","post":"Colin Berry’s call for a new C14 test is a tacit admission that the 1988 dating was wrong. We have such an abundance of evidence that the Shroud existed many centuries before the “mediaeval … AD 1260 1390” C14 date, that if the Shroud was redated and it still came out medieval it would only confirm that there was something fundamentally wrong with dating ancient burial shrouds in general and a Shroud whose former occupant, Jesus, was resurrected in particular. Because even if the Shroud is authentic, it is likely that a new C14 dating would yield a date somewhere between AD30 and 1350, due to the combined factors of younger carbon having become an integral part of the fabric and therefore unable to be removed by pretreatment, and radiation emitted as a byproduct of Jesus’ resurrection when His body changed state (1 Cor 15:50 52; Php 3:21), a new C14 dating would probably satisfy no one. Pro authenticists would point to how close the date was to the 1st century and anti authenticists would point to how close the date was to the 14th century! And from the Vatican’s perspective what would be in it for them? Have their priceless relic further “cut up” (to use Colin’s term for his excuse why no museum would supply a postage stamp sized sample of medieval 3:1 herringbone twill visually identical to the Shroud as a control in the 1988 dating) and then endure decades of controversy in its aftermath, not to mention in its planning. As cardinals and bishops they no doubt already have a very busy day job: administering a church, than to spend it pandering to the whims of scientific types who blew their first attempt at C14 dating in 1988 and now wanted another one. Remember that the current Pope Benedict XVI, as Cardinal Ratzinger, was Chair of the Pontifical Academy of Science over the time of the 1988 C14 dating, and so he has an unparalleled understanding of the issues. As a Christian who believes in the Shroud’s authenticity and the Biblical teaching on the sovereignty of God, I believe that the 1988 C14 dating fiasco was no accident. Quite clearly if the Shroud is authentic (as the preponderance of the evidence overwhelmingly points to); and God wanted the 1988 C14 dating to come out as 1st century AD to accurately reflect that fact; which to many, if not most, uncommitted people would prove that Jesus did really exist and really was crowned with thorns, flogged, crucified, died, was entombed and resurrected, as the Gospels attest; then God could have made sure that no human incompetence, prejudice or schemes would have prevented that happening. But as Pascal in the 17th century observed, God seems to have arranged it so that (paraphrased): 1) there is enough evidence for a Christian to have reasonable grounds for his/her faith; and 2) for a non Christian to have no excuse for his/her unbelief; but 3) there is not enough evidence to force a non Christian to believe in Christ against his/her will. Stephen E. Jones.","date":"2012-11-15","mins":"3:53 am","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"id":"comment-48178","author":"stephen_e_jones","post":"I don’t normally comment on Dan’s blog, or even read the comments under his posts, but I must make an exception congratulate Max on his major discovery of this very realistic 9th century (820 830) depiction of Christ being scourged naked from behind, and particularly his noticing that the two scourgers’ fingers pointing to Christ’s head are unnaturally curved resembling the epsilon or reversed 3 bloodstain on the forehead of the man on the Shroud. This is more evidence that the Shroud was in existence and seen in its full length in the 9th century. According to Ian Wilson’s chronology that would be even before the Shroud was taken from Edessa to Constantinople in 944. I have therefore taken the liberty of drawing Max’s discovery to the attention of Ian Wilson and Barrie Schwortz. I will also take the liberty of commenting on Max’s discovery on my blog. Again my congratulations to Max on his major discovery and also my thanks to Dan for posting it..","date":"2013-10-20","mins":"11:29 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-86871","author":"stephen_e_jones","post":">Its results were connected electronically to a calculator, but not a computer in our sense of the term, Not according to Gove’s eyewitness account, published in 1996: “The first sample run was OX1. Then followed one of the controls. Each run consisted of a 10 second measurement of the carbon 13 current and a 50 second measurement of the carbon 14 counts. This is repeated nine more times and an average carbon 14/carbon 13 ratio calculated. All this was UNDER COMPUTER CONTROL and the CALCULATIONS PRODUCED BY THE COMPUTER were displayed on a cathode ray screen.” (Gove, H.E., 1996, “Relic, Icon or Hoax?: Carbon Dating the Turin Shroud,” p.264). Nor according to Sox’s 1988 account, evidently obtained from Gove, since Sox wasn’t there: “The CALCULATIONS WERE PRODUCED ON THE COMPUTER, AND DISPLAYED ON THE SCREEN. Even the dendrochronological correction was immediately available. All eyes were on the screen. The date would be when the flax used for the linen relic was harvested. Gove would be taking cowboy boots back to Rochester.” (Sox, H.D., 1988, “The Shroud Unmasked,” p.147). Even in 1988 a computer was a COMPUTER, not a calculator. I bought my first personal computer in 1980 and it was called a COMPUTER even then, not a calculator. Despite the ad hominem personal attacks: “obsession…. Hardened conspiracy theorists … fanaticism” of Hugh, I stand by my PROPOSAL that the three AMS radiocarbon dating laboratories were duped by a computer hacker, who either remotely via Arpanet, or manually at each laboratory, inserted a program into each of the lab’s COMPUTERS, which received the uncalibrated radiocarbon dates from their AMS radiocarbon dating machines and displayed them upon each of their screens. The inserted program replaced the Shroud’s first century (or early) C 14 dates coming from the labs’ AMS machines with random dates which clustered around 1325, just before the Shroud’s historical debut in the 1350s. I realise that my proposal is unnecessary for those, like Hugh, who believe (against all the other evidence) that the Shroud is a 14th century fake. But I note that none of those who believe the Shroud to be authentic attempt to explain how the Shroud can be 1st century, yet radiocarbon date to 1325 +/ 65. And indeed the very first run of C 14 dates of the Shroud, displayed on Arizona lab’s computer screen, was “1350 AD … the time its historic record began”: “The age of the control sample could have been calculated on a small pocket calculator but was not everyone was waiting for the next sample the Shroud of Turin! At 9:50 am 6 May 1988, Arizona time, the first of the ten measurements appeared on the screen. We all waited breathlessly. The ratio was compared with the OX sample and the radiocarbon time scale calibration was applied by Doug Donahue. His face became instantly drawn and pale. At the end of that one minute we knew the age of the Turin Shroud! The next nine numbers confirmed the first. It had taken me eleven years to arrange for a measurement that took only ten minutes to accomplish! Based on these 10 one minute runs, with the calibration correction applied, THE YEAR THE FLAX HAD BEEN HARVESTED THAT FORMED ITS LINEN THREADS WAS 1350 AD the shroud was only 640 years old! It was certainly not Christ’s burial cloth but DATED FROM THE TIME ITS HISTORIC RECORD BEGAN.” (Gove, 1996, p.264). What is the likelihood of that? It means the Shroud would have had to be harvested, woven into linen, and the the Shroud’s image added, all in less than 5 10 years. And while the Shroud was owned by the noblest Christian knight in France, Geoffroi de Charny (c.1300 1356). Even on Benford & Marino’s theory that the Shroud sample was a mixture of 1st century original linen and 16th century repairs, it would be an AMAZING COINCIDENCE (absent some degree of fraud, i.e. ” making results appear just a little crisper or more definitive than they really are, or selecting just the `best’ data for publication and ignoring those that don’t fit” – Broad & Wade) that the Shroud `just happened’ to C 14 date to just before the Shroud first appeared in undisputed history in c. 1355. I note in passing the inconsistency (to put it mildly) of Dan who was worried that the Shroud.com could be hacked by a bogus technician: “Barrie Schwortz’ shroud.com is an irreplaceable treasure. Could it disappear tomorrow because of hackers? It deals with a highly controversial topic that is unavoidably an affront to atheists and many religious people. As such it is a natural target for idealists or extremists of all kinds and particularly a group of hackers who call themselves “Anonymous.” They could probably take down the website in a few minutes. Would they also destroy backup copies of the website’s contents? … How much damage could someone posing as Barrie do? I imagine it would be 100%. Only files stored on third party systems or on dismounted DVD media would be safe. And how much damage could someone posing as a technician of the hosting company do in just a few minutes? Just as much.” (“They don’t do it just for the credit card numbers,” January 9, 2014). If “shroud.com is an … an affront to atheists” and so “a natural target for idealists or extremists of all kinds” then why was the 1988 C 14 dating of the Shroud ITSELF not “an affront to atheists,” and “a natural target for” the KGB? And if in this day and age, a quarter of a century later, when we are much more conscious of computer security than they were in the 1980s, a hacker “posing as a technician of the hosting company” for Shroud.com could “in just a few minutes” destroy Shroud.com, yet in 1988, a hacker “posing as a technician of the” AMS C 14 dating system company” could not insert a program in the AMS C 14 dating system at each lab, which would replace the Shroud’s dates with 1325 +/ 65 dates? Isn’t groupthink interesting? Andy, who “As an IT guy” found my proposal “preposterous” apparently did not find Dan’s proposal also “preposterous”! I thank the lone commenter Dover who had the courage to swim against the tide of groupthink on Dan’s blog, for at least applauding me “for intellectual imagination and creativity in trying to find solutions.”.","date":"2014-03-10","mins":"5:35 am","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-87389","author":"stephen_e_jones","post":">I have recently received an email from Prof. Christopher Ramsey of the Oxford Radiocarbon Laboratory regarding the hacking hypothesis. The text in its entirety runs: “Yes – I agree with all that Tim says. This would seem to be a suggestion from someone who does not know what computers were like in the 1980s. No. I was one of the first to have a personal computer in 1980, I pioneered the introduction of computers into Health Department of WA hospital computers in the mid to late 1980s and in the late 1980s/early 1990s,I was the Systems Administrator of a network of 7 hospitals UNIX systems. And also I have read Stoll’s 1989 book, “The Cuckoo’s Egg” which relates how easy it was to hack into university computers in the 1980s. >In the case of Oxford the AMS had no connection to any network (and indeed even today our AMS control computers have no network connections). Thanks to Prof. Ramsey for this unambiguous statement. >The software was very simple just outputting counts of 14 C and currents measured. Age calculation was done offline and could just be done with a calculator, or by a simple program into which you typed the numbers from the AMS.” Nevertheless, it WAS “software” on each lab’s AMS control computer, which outputted “counts of 14 C” which were, according to Gove’s eyewitness account, displayed on the AMS control computer’s screen: “The first sample run was OX1. Then followed one of the controls. Each run consisted of a 10 second measurement of the carbon 13 current and a 50 second measurement of the carbon 14 counts. This is repeated nine more times and an average carbon 14/carbon 13 ratio calculated. All this was under computer control and THE CALCULATIONS PRODUCED BY THE COMPUTER WERE DISPLAYED ON A CATHODE RAY SCREEN. The age of the control sample could have been calculated on a small pocket calculator but was not everyone was waiting for the next sample the Shroud of Turin! At 9:50 am 6 May 1988, Arizona time, the first of the ten measurements appeared on the screen. We all waited breathlessly. The ratio was compared with the OX sample and the radiocarbon time scale calibration was applied by Doug Donahue. His face became instantly drawn and pale. At the end of that one minute we knew the age of the Turin Shroud! The next nine numbers confirmed the first. It had taken me eleven years to arrange for a measurement that took only ten minutes to accomplish! Based on these 10 one minute runs, with the calibration correction applied, the year the flax had been harvested that formed its linen threads was 1350 AD the shroud was only 640 years old! It was certainly not Christ’s burial cloth but dated from the time its historic record began.” (Gove, H.E., 1996, “Relic, Icon or Hoax?: Carbon Dating the Turin Shroud,” p.264). It is those calculations which when calibrated, yielded a date of “1350 AD”. So all that a hacker would have to do is modify the program which displayed those “counts of 14 C” to replace those coming from the Shroud samples with “counts of 14 C” which when calibrated, yielded the TOO GOOD TO BE TRUE date of “1350 AD”. >I don’t suppose Stephen Jones will accept this as a sensible rebuttal of his claim, I do accept it as face value as a rebuttal of my original proposal that the hacker logged in remotely via Arpanet. But it is not a rebuttal of my subsequent proposal that a hacker logged into the three C 14 dating laboratories locally, e.g. “posing as a technician” or after hours. >and I’m sorry about that, because his current stance, coupled to his earlier Satanic allegations about Pope Francis, `Poisoning the well’ allegation noted: “Poisoning the well (or attempting to poison the well) is a rhetorical device where adverse information about a target is pre emptively presented to an audience, with the intention of discrediting or ridiculing everything that the target person is about to say…” (Wikipedia) I made NO “Satanic allegations about Pope Francis”. All I wrote in my “2013 Favs: New Tests Date the Shroud from the Time of Christ” post was: “But if the Shroud is a deliberate fraud, then it would almost certainly be a work of Satan, and no Church that calls itself Christian should be promoting a deliberate fraud (much less a work of Satan)!” Note the all important conditional “IF”. I don’t think that “the Shroud is a deliberate fraud” and my argument is that neither does the Vatican. My point was simply to highlight the inconsistency of the Vatican’s current policy of neither confirming nor denying the Shroud is authentic, yet spending the equivalent of many millions of dollars protecting the Shroud and also of exhibiting it with increasing regularity to millions of people. >render his absolutist convictions about the authenticity of the Shroud, which I originally found quite noble (albeit wrong), utterly worthless. Another attempt to `poison the well’ by Prof. Ramsey. I don’t have “absolutist convictions about the authenticity of the Shroud,” As my blog’s masthead states: “I am PERSUADED BY THE EVIDENCE that the Shroud of Turin is the burial sheet of Jesus Christ and bears His crucified and resurrected image.” On a previous post several years ago, I wrote something like: `I was a Christian for nearly 40 years before I became persuaded by the evidence that the Shroud is authentic. And if it were proven to be false, I would still be the same Christian that I was before I accepted that the Shroud was authentic.’ And even if my proposal that the radiocarbon dating laboratories were duped by a computer hacker turns out to be wrong, that does not make my other “convictions about the authenticity of the Shroud … utterly worthless.” The Shroud could still be authentic, as all the evidence except for the C 14 date of 1325 +/ 65 years indicates, and only my above proposal be wrong. But then there still would be the problem of explaining how the Shroud could be 1st century, yet its C 14 date is 1325 +/ 65 years, just before the Shroud’s historical debut in the 1350s. As the agnostic art historian Thomas de Wesselow pointed out: “One important consideration weighs in favour of the possibility of deception. If the carbon dating error was accidental, then IT IS A REMARKABLE COINCIDENCE that the result tallies so well with the date always claimed … as the Shroud’s historical debut. But if fraud was involved, then it wouldn’t be a coincidence at all. Had anyone wished to discredit the Shroud, ‘1325 ± 65 years’ is precisely the sort of date they would have looked to achieve.” e Wesselow, T., 2012, “The Sign: The Shroud of Turin and the Secret of the Resurrection,”, p.170. My emphasis). Indeed, I find it strange that a scientist of Prof. Ramsey’s eminence would even THINK, let alone say, such an illogical thing. That if I am wrong on ONE THING in favour of the Shroud’s authenticity, then EVERYTHING ELSE I say in defense of the Shroud’s authenticity is “utterly worthless.” Prof. Ramsey seems very keen to `poison the well’ against me personally, so no one will take any notice of what I say. That suggests, to me at least, that maybe Prof. Ramsey has something to hide in respect of my proposal that the radiocarbon dating laboratories were duped by a computer hacker?.","date":"2014-03-11","mins":"12:48 pm","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-87356","author":"stephen_e_jones","post":">I find the idea of a Soviet hacker preposterous and conspiratorial, and the continued attempt to defend it obsessive. As I wrote: “I realise that my proposal is unnecessary for those, like Hugh, who believe (against all the other evidence) that the Shroud is a 14th century fake.” That is, it is only a problem of explaining why the Shroud is 1st century, yet has a 1325 C 14 date, to those who on the basis of all the other evidence, are persuaded that the Shroud is authentic and so is 1st century. But Hugh and his anti authenticist ilk have the FAR GREATER PROBLEM of proposing a comprehensive and coherent forgery theory which: 1) negatively, plausibly explains away all the evidence that the Shroud is authentic; and 2) positively plausibly explains how the Shroud was faked, who faked it, when it was faked and why it was faked. That there is no such comprehensive and coherent forgery theory of the Shroud on the table shows that such a theory, if it had ever been attempted, was found to have so many holes that it was quietly shelved. So all that the Shroud anti authenticists like Hugh can do is snipe away at Shroud pro authenticists (like me), including `poisoning of the well’ character assassinations, as we attempt to strengthen our comprehensive and coherent Shroud pro authenticist theory. But to paraphrase Alfred Lord Tennyson, in science, “‘Tis better to have theorised and lost than never to have theorised at all.” At least my theory is FALSIFIABLE and so could yet be proven wrong. But Hugh’s NON theory, as it presently stands, is “not EVEN wrong”! I note that no one has responded to the points I made above, but instead they have repeated ad hominems and/or changed the subject. Therefore I regard my `the radiocarbon dating laboratories were duped by a computer hacker’ proposal as to date unrefuted. I meant to thank Dan for his: “shroud.com [sic] is … an affront to atheists and .. As such it is a natural target for idealists or extremists of all kinds.” And also for his scenario of “someone posing as a technician” obtaining access to the computer where Shroud.com’s is hosted and backed up, and destroying it “100%”. So if that is true of a Shroud WEBSITE, how much more is it true of the Shroud ITSELF? That is, even if it wasn’t the KGB, on Dan’s own reasoning there would have been “ATHEISTS” and “idealists or extremists OF ALL KINDS” to whom a C 14 dating of the Shroud to the 1st, or an early, century, would be “a NATURAL TARGET”. And in 1988 at a university, it wouldn’t even have to be “someone posing as a technician.” As Stoll (who did his Ph D at the University of Arizona) wrote in 1989: “Every few months, I’d hear a rumour about someone else’s system being invaded; usually this was at universities, and it was often blamed on students or teenagers. … Sure, it’s EASY TO MUCK AROUND COMPUTERS AT UNIVERSITIES where NO SECURITY WAS NEEDED. After all, colleges SELDOM EVEN LOCK THE DOORS TO THEIR BUILDINGS.” (Stoll, C., 1989, “The Cuckoo’s Egg,” p.12). So, applying what Stoll wrote to the Arizona, Zurich and Oxford universities’ radiocarbon labs in 1988, it would be “easy” to hack into their AMS C 14 dating computers because back then “no security was needed” and the labs may not have even bothered to “lock the doors to their buildings.”.","date":"2014-03-11","mins":"9:46 am","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-87474","author":"stephen_e_jones","post":">That last paragraph is close to being an allegation of intellectual dishonesty. I did not use the word “dishonest”. My last paragraph was: “Prof. Ramsey seems very keen to `poison the well’ against me personally, so no one will take any notice of what I say. That suggests, to me at least, that maybe Prof. Ramsey has something to hide in respect of my proposal that the radiocarbon dating laboratories were duped by a computer hacker?” I explained what I meant by `poisoning the well’: “Poisoning the well (or attempting to poison the well) is a rhetorical device where adverse information about a target is pre emptively presented to an audience, with the intention of discrediting or ridiculing everything that the target person is about to say…” (Wikipedia) I stand by my claim that Prof. Ramsey’s false claim that I made “Satanic allegations about Pope Francis”: >>I don’t suppose Stephen Jones will accept this as a sensible rebuttal of his claim, and I’m sorry about that, because his current stance, coupled to his earlier Satanic allegations about Pope Francis, I made NO such claim (see above). And his false claim that I have “absolutist convictions about the authenticity of the Shroud”: >>render his absolutist convictions about the authenticity of the Shroud, and his illogical claim that because (in his view) I am wrong about ONE thing in favour of the Shroud, that the C 14 labs may have been duped by a computer hacker, therefore EVERYTHING I write in defense of the authenticity of the Shroud is “utterly worthless”: >>which I originally found quite noble (albeit wrong), utterly worthless. That is, in my opinion, an attempt by Prof. Ramsey to poison the well against me, so that no one will heed my proposal that the C 14 labs may have been duped by a computer hacker. That DOES suggest “to me at least, that maybe Prof. Ramsey has something to hide in respect of my proposal that the radiocarbon dating laboratories were duped by a computer hacker?” I hasten to clarify that I don’t claim that if a hacker did hack into the three C 14 laboratories and modify the AMS console computer program to replace the Shroud sample’s 1st or early century’s date with dates which clustered around 1325, the Prof. Ramsey has anything to do with that. What I meant was that, as I wrote in my reply to Prof. Jull, it seems overly defensive. As though it has just dawned on the C 14 labs after all these years that they may have been duped by a hacker. >To suggest that Hugh is anti authenticity seems to be a similar charge. Hugh wrote in his latest BSTS editorial: “Unlike my predecessors, whom I think are more or less committed to a pro authenticity point of view, I myself currently incline more towards an accidental 14th century origin for the cloth now preserved in Turin.” That makes Hugh by his own admission, anti authenticity. >Let’s all of us try to not make this so personal. Thanks to Dan for his belated concern for the many personal attacks on me, to which he didn’t lift a finger! I am going to now respond to Prof. Jull and Prof. Ramsey’s emails on my own blog..","date":"2014-03-11","mins":"6:50 pm","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-86593","author":"stephen_e_jones","post":"No, Jull’s email does NOT refute my hacking hypothesis, First, it is clear from my quote of Gove, the final calibration was done offline by Donahue: “The ratio was compared with the OX sample and THE RADIOCARBON TIME SCALE CALIBRATION WAS APPLIED BY DOUG DONAHUE.” But it was the computer at the end of the AMS C 14 dating system that supplied the “OX sample”‘s raw years which Donahue calibrated. I allowed for that: “… a KGB agent hacked into the AMS system control console computer at each of the three C 14 labs and inserted a program which, when each test was run, replaced the Shroud’s 1st or early century c 14 date, WITH DATES WHICH WHEN CALIBRATED, would yield years clustering around AD 1325, just before the Shroud’s appearance in undisputed history in the 1350s.” Second, Jull’s “…in 1988 the internet (as we know it today) didn’t exist – there was a pre existing network run by the US government which was quite restricted.” I did not say it was the “Internet”. What I said was: “… in the 1980s university computers were all interconnected by ARPANET, THE PRECURSOR TO THE INTERNET …”. Jull’s “quite restricted” does not mention that Arpanet was originally restricted but was expanded to universities, and in particular to “research laboratories in the US: “ARPANET … was one of the world’s first operational packet switching networks, the first network to implement TCP/IP, and the progenitor of what was to become the global Internet. The network was initially funded by the Advanced Research Projects Agency (ARPA, later DARPA) within the U.S. Department of Defense for use by its projects at universities and RESEARCH LABORATORIES IN THE US.” (Wikipedia) A Google search of “Arpanet” and “University of Arizona” shows that Arpanet was at the University of Arizona by 1984. Jull’s “Anyway, the machine we used at that time couldn’t have been attached to it, and that one still isn’t”, is ambiguous. If he means by “machine” the AMS machine itself, I don’t claim that machine was attached to Arpanet. But if Jull means by “machine” the COMPUTER which processed the data coming from the AMS machine, then I doubt that is true, although Jull may believe it to be true. Stoll’s book makes clear that all university computers in the 1980s were connectable to Arpanet, and most were, especially laboratories. But if it can be proven that Arizona, Zurich and Oxford’s AMS control console computers were not ever connected to Arpanet, then that does not mean that a hacker could not have inserted a program into those computers, as he could have done it manually. Stoll’s book (and he did his Ph D at the University of Arizona) makes it clear that physical security at universities in the 1980s was also poor. You and your commenters may scoff at the idea that the KGB would have as one of its goals to discredit the Shroud, but you fail to consider what a perceived threat it would be to the Soviet Union if the Shroud was dated to the first or early centuries. Dan, your commenters, and you, can try to denigrate me personally by calling my proposal a “conspiracy theory” with all its negative connotations. The One whose image is on the Shroud will be my and their Judge (Mt 16:27; 25:31 32; Ac 10:42; 2 Cor 5:10; 2 Tim 4:1, 1 Pet 4:5). But they, and you, are not facing up to the fact that if the Shroud is authentic (as all the evidence apart from the C 14 dating indicates), then it would be “a remarkable coincidence” (to put it mildly) that its C 14 date was 1325 +/ 65 years, just before “the Shroud’s historical debut”, as the agnostic Thomas de Wesselow saw clearly: “One important consideration weighs in favour of the possibility of deception. If the carbon dating error was accidental, then it is A REMARKABLE COINCIDENCE that the result tallies so well with the date [of] … the Shroud’s historical debut. But IF FRAUD WAS INVOLVED, THEN IT WOULDN’T BE A COINCIDENCE AT ALL. Had anyone wished to discredit the Shroud, ‘1325 ± 65 years’ is precisely the sort of date they would have looked to achieve.” (de Wesselow, T., 2012, “The Sign: The Shroud of Turin and the Secret of the Resurrection,” p.170). My bottom line is that, since the Shroud IS authentic, there HAD to be some form of fraud to convert a 1st century actual date of the Shroud into the too good to be true 1325 ± 65 years date. Harry Grove’s worries before the test that at least one of the AMS labs would return an outlier date, and the 1989 Intercomparison Test in which the AMS labs fared badly, makes it difficult to believe (again to put it mildly) that all three AMS labs independently dated the Shroud “flawlessly,” as Gove later assumed they would have to have done, to date the Shroud so accurately, to within 25 30 years of the Shroud’s appearance at Lirey in the 1350s. My proposal that the labs were duped by a computer hacker fits all the facts (Jull’s ambiguous email notwithstanding), and it allows for Ian Wilson’s assurance that the lab leaders were basically honest. I am hopeful that now my proposal is in the public domain, it will eventually be confirmed by someone in a position to know..","date":"2014-03-09","mins":"12:38 pm","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-87681","author":"stephen_e_jones","post":"Thanks to Hugh for the clarification. In the wee small hours I misread your comment. I withdraw that part of my reply to Prof. Ramsey with an apology and apply them to you. In preparing my response on my blog to Dr. Jull and Prof. Ramsey’s emails, I found the only post which mentioned both “Pope Francis” and “Satan”: —————————————————————————– “Shroud of Turin News, October 2013” ….] “This image, impressed upon the cloth, speaks to our heart This disfigured face resembles all those faces of men and women marred by a life which does not respect their dignity, by war and violence which afflict the weakest and yet, at the same time, the face in the shroud conveys a great peace; this tortured body expresses a sovereign majesty.” – Pope Francis on Easter Saturday, 2013. …. If the Shroud of Turin is a deliberate fraud, then it would almost certainly be a work of Satan “the deceiver of the whole world” (Rev 12:9), and no Church that calls itself Christian should be promoting a deliberate fraud (let alone a work of Satan)! —————————————————————————– If readers bother to follow the link, they will see that I made NO “Satanic allegations about Pope Francis.” The part of my post about Pope Francis is COMPLETELY SEPARATE from the part about “Satan”. And again, In the context, it was a CONDITIONAL “IF”. My entire criticism of the Vatican for its duplicity, is based on my assumption that it, like me, regards the Shroud as authentic, and NOT “a deliberate fraud” and therefore NOT “a work of Satan”. Hugh is REALLY scraping the bottom of the barrel in an attempt to discredit me. But in doing so, he only discredits himself!.","date":"2014-03-12","mins":"4:59 am","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-87691","author":"stephen_e_jones","post":">As for me being anti authenticity, I think that as usual you are being too extreme. Continued `poisoning of the well’ attempt by Hugh, “as usual you are being too extreme” noted. No, again in his latest BSTS Newsletter Editorial, Hugh wrote that his position is “UNLIKE” that of his “predecessors” as BSTS Newsletter Editor (Ian Wilson and Mark Guscin), who WERE (not “more or less”)” committed to a pro authenticity point of view, and that Hugh “incline[s] more towards an accidental 14th century origin” of the Shroud and that his is “a HERETICAL opinion”: “Unlike my predecessors, whom I think are more or less committed to a pro authenticity point of view, I myself currently incline more towards an accidental 14th century origin for the cloth now preserved in Turin. I say this somewhat tentatively, as I’m well aware that in some internet forums such a statement is tantamount to proclaiming oneself the Anti Christ, and even the more moderate ones have commenters who doubt that it is possible to be a good Christian, let alone a Catholic, and hold such a heretical opinion.” As one who holds the same committed pro authenticity position as Hugh’s predecessors, Wilson and Guscin, I regard Hugh’s position as ANTI authenticity. And it clear from Hugh’s personal attacks on me for arguing for the pro authenticity position that he is more STRONGLY anti authenticity than his, “I myself currently incline more towards an accidental 14th century origin” of the Shroud would have Hugh’s BSTS Newsletter readers believe..","date":"2014-03-12","mins":"5:34 am","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-87375","author":"stephen_e_jones","post":">it’s not backward if say for instance you originally start with honest skepticism then investigate the Shroud and discover it’s authenticity is backed up in spades save an anomalous C14 test that, upon investigating … points to sabotage from the inside to discredit the Shroud. A belated thanks to EGM for his support. It is a stereotypical myth of science, that it is “backward science” to “start with the conclusion and end up with the hypothesis”. Science in fact DOES start from a previous conclusion, and proposes new hypotheses based on that conclusion. >Then you can move to the next level after arriving at the Shroud’s authenticity and attempt to explore how widespread the fraud really is which some don’t want to be discussed it seems. Yes, slogans like “conspiracy theory” are excuses not to think about the problem: if the Shroud is 1st century, then why did it date to 1325, just before the Shroud’s historical debut in the 1350s? >It’s naturally going to lead into colluding elements if that’s what really happened, possibly strange bed fellows as well, that’s human nature I’m afraid, My `the C 14 labs were duped by a computer hacker’ proposal is an attempt to explain how there could have been fraud, yet the lab leaders were basically honest. If Hugh and his ilk could remove the naturalistic scales from their eyes they would see I am not a conspiracy theorist, because the latter all to date have accused the laboratories leaders of outright fraud in switching samples, etc. The worst that I have in the past proposed is that the C 14 labs were guilty of “making results appear just a little crisper or more definitive than they really are, or selecting just the `best’ data for publication and ignoring those that don’t fit” which respected science journalists Broad and Wade state is “probably far from unusual in science” (Broad, W.A. & Wade, N.J., 1982, “Betrayers of the Truth: Fraud and Deceit in the Halls of Science,” p.20). My new theory is an attempt to explore a way that the labs could be basically honest, yet a fraud did occur, not by the labs but by a computer hacker. If it was confirmed to be what happened, then it would make the laboratories look GULLIBLE, but they would not then be guilty of fraud.. >you don’t get to claim it debunked just because it sounds strange, absurd, ridiculous, etc to your (hopefully not closed) mind. Reality is absurd and ridiculous and over the top sometimes. Agreed. But it is not even “absurd and ridiculous and over the top” that the Arizona, Zurich and Oxford’s C 14 lab’s computers were hacked into in 1988. The fact is that university computers DID get hacked back in the 1980s. The hacker that Stoll caught DID hack into Berkeley University Livermore Lab’s computer system, so he could from that system hack into about 400 MILITARY computers which were more secure than university computers, the latter which, as Stoll records, were not very secure at all. >If hacking the labs is really so off base as some would like to paint it, then it should easily be debunked with verified facts and the world will continue. Yes. I found Jull’s email curiously ambiguous, and indeed FALSE: >>This is impossible. In our case, the software for the calculations is offline. In any case, the calculation does NOT require software, it was done offline and plotted on a graph, as I recall. But Gove and Sox’s accounts show that the results were displayed on Arizona’s AMS computer’ screen, and it was evident from that screen that the Shroud was not first century, even thought the years on the screen needed to be calibrated. >>Indeed, in 1988 the internet (as we know it today) didn’t exist – there was a pre existing network run by the US government which was quite restricted. This is disingenuous. Jull must know that by 1988 Arpanet connected most USA universities, and in particular their research laboratories. >>Anyway, the machine we used at that time couldn’t have been attached to it, and that one still isn’t.”. Again ambiguity by Jull. Is “machine” the AMS system or the COMPUTER receiving C 14 dating data from the AMS system and via a program displaying that C 14 data’s uncalibrated dates? If the AMS machines COMPUTER was connected to Arpanet, would Jull be aware of it? It would be convenient for the company which supplied the AMS system to be able to log into the AMS system’s comouter via Arpanet and update its software. But, as I previously wrote, if it could be proved (and I mean independently of the C 14 labs) that the AMS system computers at the three C 14 labs were not online, nevertheless they were still computers which were operated by a program, which in turn could be hacked locally, e.g. By “someone posing as a technician”. >So far there seems to be only more questions raised and clarifications needed from the responses from representatives of two of the three labs involved in the 1988 C14 tests. Agreed. But of course if it has just now dawned on the labs, after all these years, that they may have been the victim of a hacking, in such an important C 14 dating as that of the Shroud, they would hardly be likely to welcome investigations into it. Rather they would be defensive as Jull’s email seems to be. I thank Dan for his “Comment Promoted: On the Hacking Hypothesis.” And to Hugh for contacting Jull. No doubt they both thought “this [would] put an end to it, once and for all” but the genie of my proposal is now, thanks to them, out of the bottle. And as my replies have shown, it is not as simple as they thought, to dismiss my proposal by ad hominems and half truths. ..","date":"2014-03-11","mins":"11:24 am","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-80559","author":"stephen_e_jones","post":"Dan Thanks again for the free publicity! Whether you believe it or not, the labs being duped by a computer hacker was going to be one of the fraud possibilities in my series that I terminated because I realised it was going to take too much time to address all fraud possibilities. It is you and some of your readers who seem to have jumped to the conclusion that fraud can only mean by the laboratories’ leadership. I have been thinking of the laboratories being duped by a hacker possibility since at least 2007. I regard that as a type of fraud. And, as you will see, computer hacking by a laboratory insider (or insiders) is a real possibility, which would be a type of fraud by the laboratories, but not necessarily by one of their leadership. And even if the labs were duped by a hacker, there still could have (and probably would have) been low level fraud that Broad and Wade refer to in “making results appear just a little crisper or more definitive than they really are, or selecting just the `best’ data for publication and ignoring those that don’t fit”: “The term `scientific fraud’ is often assumed to mean the wholesale invention of data. But this is almost certainly the rarest kind of fabrication. Those who falsify scientific data probably start and succeed with the much lesser crime of improving upon existing results. Minor and seemingly trivial instances of data manipulation such as making results appear just a little crisper or more definitive than they really are, or selecting just the `best’ data for publication and ignoring those that don’t fit the case are probably far from unusual in science. But there is only a difference in degree between `cooking’ the data and inventing a whole experiment out of thin air.” (Broad, W.A. & Wade, N.J., 1982, “Betrayers of the Truth: Fraud and Deceit in the Halls of Science,” Simon and Schuster: New York NY, p.20). Which has always been my MINIMUM claim. PS: It’s strange you didn’t find “Arizona” in your Kindle version of Stoll’s book. In my paper version, opposite the title, it says: “Clifford Stoll is an astronomer by training and a computer security expert by accident. He received his Ph.D. From the UNIVERSITY OF ARIZONA in 1980 and has since then worked as an astronomer, scientific programmer and computer systems manager in various observatories and laboratories.” (my emphasis). Though it is not my claim that Stoll mentions radiocarbon dating or the Shroud (I read the book years before I became interested in the Shroud), it is a bonus for me that Stoll received his Ph D from Arizona, as you will see. Stephen E. Jones.","date":"2014-02-19","mins":"6:32 am","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin"},{"id":"comment-95543","author":"stephen_e_jones","post":">Wow! So Ramsey puts out what looks like disinfo on a crucial question regarding how/if the numbers could have been fudged in the C14 tests (whether intentionally or it was just a ‘senior moment’ you can decide) — thus appearing to discredit himself Prof. Ramsey’s claim that I was “someone who does not know what computers were like in the 1980s.”: >>Yes – I agree with all that Tim says. This would seem to be a suggestion from someone who does not know what computers were like in the 1980s.” is not only FALSE, I know from PERSONAL EXPERIENCE what computers were like in the 1980s. But also it is MISLEADING in the light of Prof. Ramsey’s next paragraph: >>In the case of Oxford the AMS had no connection to any network (and indeed even today our AMS control computers have no network connections). The software was very simple just outputting counts of 14 C and currents measured. Age calculation was done offline and could just be done with a calculator, or by a simple program into which you typed the numbers from the AMS.” This could be taken to mean that the AMS control console computer was little more than a calculator. In fact, based on it, Dan questioned whether it was even “programmable”. But in fact it now appears that the AMS control console computer was a “DEC computer system,” either a PDP or a VAX. In which case it would have been a mini computer, i.e. A mini MAINFRAME computer, far more powerful than personal computers were until a decade later. Given that Prof. Ramsey must know that, his attack on me seems strange for an Oxford Professor, let alone that it was FALSE and MISLEADING. Therefore it seems to me, at least, to be a case of “protesting too much”. That is, I suspect that Prof. Ramsey may know, or suspect, that the C 14 labs were, or could have been, hacked and therefore their 1260 1390 date of the Shroud was, or could have been, a fraud, perpetrated on them. The 1989 suicide of Timothy Linick may have alerted them to that possibility, or even actuality. >— yet Stephen Jones is the one looked askance at and receiving cheap pot shots for pointing it out and daring to pursue the important questions! It just shows that they fear the truth. It also reflects poorly on Dan as Moderator, that he would allow me to be continually defamed while seeking the truth, without him lifting a finger to protect me. However, I have noticed less ad hominems, so perhaps Dan is belatedly moderating the defamers.. >I guess the saying is true about knowing you’re over the target when you’re getting lots of flak! I had never heard that saying, but it is apt! Thanks again to EGM for his support..","date":"2014-04-01","mins":"12:56 pm","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-95616","author":"stephen_e_jones","post":"I was doing a search of my computer last night for the name [. . . Content edited out] “Hardly had this wave of publicity died down before on 26 August the London Evening Standard ran as its front page lead story `Shroud of Turin Really is a Fake’. Accompanying this was a seemingly authoritative article by librarian Dr. Richard Luckett of Magdalene College, Cambridge, cryptically remarking that `laboratories are rather leaky institutions’ and `a probable date of about 1350 looks likely’. This again generated media stories all round the world, yet both the Oxford laboratory and Dr. Michael Tite of the British Museum insisted that they knew nothing of how Dr. Luckett had come by his information, and had had no dealings with him. When in a telephone enquiry to Dr. Luckett I asked whether the Revd. David Sox had been his source, he hastily changed the subject.” (Ian Wilson, “On the Recent “Leaks,” BSTS Newsletter, 23 September 1985). The evidence is pointing to [. . . Content edited out ] being one of the hackers, but at this stage I am still not yet claiming that he WAS..","date":"2014-04-01","mins":"6:44 pm","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-95652","author":"stephen_e_jones","post":">some time ago I explained some ground rules about questioning someone’s intellectual honesty in this blog without solid evidence. Dan, MY intellectual honesty has been continually questioned on your blog, as well as other personal attacks, but you don’t lift a finger to protect me. You are biased against me but you probably don’t realise it. Your position is sitting on the fence: “Is the Shroud real? Probably”. Which gives you the tactical advantage of sitting up there on Mt Olympus looking down on us mere mortals arguing for and against the Shroud’s authenticity, and sending down the odd thunderbolt. But your position is the worst of all: “not EVEN wrong”. I am therefore leaving your blog in that I will read its posts from time to time, and I will respond to those posts as posts on my blog, where I feel it is warranted. But I will no longer read the comments under those posts on your blog nor comment on them on your blog. If anyone has a comment or point they wish to draw to my attention for my response, they will have to do it as a comment on my blog, and I will respond to it on my blog. Again I thank you for the free publicity. Goodbye. PS: [content edited out by Dan Porter] Stephen E. Jones.","date":"2014-04-01","mins":"9:00 pm","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-95609","author":"stephen_e_jones","post":"It IS misleading. The “age calculation” was merely CALIBRATING the C 14 years displayed by the “software” on the AMS control console computer’s terminal screen. It led Dan to ask whether the computer was even “programmable”. In the interests of full disclosure, Prof. Ramsey could have said, “the AMS control console computer was a 32 bit DEC VAX 11”.(for example). And what WAS the point of Prof. Ramsey saying of my original proposal, that the AMS control computer was connected to ARPANET: “This would seem to be a suggestion from someone who does not know what computers were like in the 1980s.” if it was not to mislead? A DEC VAX 11 or PDP 11 could certainly have been connected to ARPANET. Of course Hugh could have mislead Prof. Ramsey. So in the interests of full disclosure could Hugh please copy and paste here what he told Dr. Jull and Prof. Ramsey about my original proposal..","date":"2014-04-01","mins":"6:14 pm","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-95526","author":"stephen_e_jones","post":">You have to admire Stephen’s persistence, don’t you? I am persistent because I believe that I am on the right track. And because I am facing up to the key issue: if the Shroud is authentic (which Hugh doesn’t believe), then how did its linen, being first century or earlier, `just happen’ to have a C 14 date the midpoint of which is 1325, just before the Shroud’s historical debut in the 1350s? Indeed Arizona’s date WAS “1350 AD …the time its historic record began”: “Based on these 10 one minute runs, with the calibration correction applied, the year the flax had been harvested that formed its linen threads was 1350 AD the shroud was only 640 years old! It was certainly not Christ’s burial cloth but dated from the time its historic record began.” (Gove, H.E., 1996, “Relic, Icon or Hoax?: Carbon Dating the Turin Shroud,” p.264) which is just too good to be true and should have rung alarm bells in the minds of normally sceptical scientists that something was wrong. But they all accepted that `bull’s eye’ date uncritically, even those who had believed that the Shroud was authentic. >I suppose his crucial question is now: How was his computer programmed? Punched cards? Roll of of punched paper? Magnetic tape? Or did the programme have to be typed in? If the AMS control console computer was a DEC VAX 11, as per my previous comment under Dan’s post that he has provided a link to above, then it supported a variety of computer languages, including “assembly language“: “The VAX 11/780 introduced on October 25, 1977 was the first of a range of popular and influential computers implementing that architecture. … The VAX instruction set was designed to be powerful and orthogonal…. When it was introduced, many programs were written in assembly language, so having a “programmer friendly” instruction set was important…. In time, as more programs were written in higher level language, the instruction set became less visible, and the only ones much concerned about it were compiler writers.” (“VAX,” Wikipedia). I would not be surprised if the AMS control console computer program was written in assembly language, because of its power and flexibility in controlling machines, albeit at the cost of difficulty of programming it it. But that would be no problem for a hacker. Even I wrote programs in “assembly language” back in the 1980s and I knew a programmer back then who did it for a living...","date":"2014-04-01","mins":"11:58 am","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-95532","author":"stephen_e_jones","post":"According to Vatican Insider (coincidentally exactly a year ago today), Timothy W. Linick’s death was “suicide in mysterious circumstances”: “Another episode was disturbing , June 4, 1989 , suicide in mysterious circumstances by Timothy W. Linick , a scholar of the method of the mass spectrometer .” (Giacomo Galeazzi, “Never solved the enigma that still divides the Church,” Vatican Insider, Apr 1, 2013. Translated from Italian by Google). Also there is an Italian Wikipedia page (translated by Google) which says that others have theorised that Linick “could have been killed … to avoid…” him confessing “… the alleged fraud”: “The “conspiracy theorists” have also raised doubts about the death of Timothy Linick, forty collaborator of the Tucson laboratory and co signer of the Nature, who died June 4, 1989 by suicide, according to this theory, could have been killed instead, to avoid prove that the alleged fraud. [citation needed]” (“Examination of the carbon 14 on the Shroud,” Wikipedia, January 4, 2014). In the context this was about the `conspiracy theory’ that “Michael Tite [of the British Museum] and at least one person for each of the three laboratories” were involved in a switching of Shroud samples fraud. I do NOT believe that. And again I do NOT claim that Linick WAS a hacker and that his death WAS suicide, However, I can’t help thinking that the execution made to look like suicide of hacker Karl Koch, who had worked for the KGB, on 23 May 1989, and then the “suicide in mysterious circumstances” of Arizona lab’s Timothy W. Linick, less than 2 weeks later on 4 June 1989, only a few months after the 16 February 1989 Nature paper claimed the Shroud was dated “AD 1260 1390”, MAY have been linked. Significantly, that each of the three AMS laboratories used the same procedures for measuring the C 14 in their samples, under the control of their AMS control console computers, is stated in the 1989 Nature paper: “The specific measurement procedures for each laboratory are given by Linick et al. 9 … 9. Linick, T. W., Jull, A. J. T., Toolin, L. J. & Donahue, D. J. Radiocarbon 28, 522 533 (1986). That is the paper I cited in my previous comment, “Linick, T.W., et al. 1986, “Operation of the NSF Arizona accelerator facility for radioisotope analysis and results from selected collaborative research projects,” Radiocarbon, Vol. 28, No. 2a, pp.522 533).” As can be seen, Linick was the lead author of that paper and therefore it is likely that he wrote the AMS control console computer program for it, given that he was “extremely mathematically gifted,” according to his obituary in Radiocarbon. And if the program was written in assembly language (see above) that would make it more likely that the program was opaque to the other lab staff, in Arizona and the other two labs. So Linick (if he was the hacker) could have modified the Arizona lab’s program to replace the Shroud C 14 dates with dates clustering around 1325, and he could also have sent both Zurich and Oxford C 14 labs his modified program as an `update’ of their program, which he had himself written. Admittedly this is necessarily speculative at this stage and again I do NOT claim that Linick WAS a hacker and that his death WAS suicide..","date":"2014-04-01","mins":"12:12 pm","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"author":"stephen_e_jones","post":"Carlos>Stephen:>>Te envío link de Abgar y el Mandylion de 1,96 Mb I send link of Abgar and the Mandylion of 1.96 Mb (Google translate from Spanish).Thanks.>http://days.pravoslavie.ru/jpg/ih4447.jpg That's the largest image I have found online of the Abgar receiving the Edessa cloth from Thaddeus icon in St Catherine's monastery.When everything but Jesus' face is cropped out, it is 236 x 289 pixels. It then looks like there is a depiction of the reversed 3 bloodstain on Jesus' forehead.But I was sent by Ian Wilson a 1374 x 738 pixels photo of just the Edessa cloth. When everything else is cropped out but Jesus face, it is 458 x 472 pixels. But then the reversed 3 bloodstain looks like it could be wax that has oozed out or is behind a crack in this encaustic (hot wax) painting. It still could be the reversed 3 bloodstain but is impossible for me to be sure. So I deleted my claim that it was.Jesus' face has, by my count, at least 12 of the Vignon markings, but because it is so small it is difficult to be sure. And there are other 10th century icons which have that many Vignon markings.It would have been the greatest discovery since the Pray manuscript (in my opinion) if it did have both the reversed 3 bloodstain (depicted as blood) and the Vignon markings.>Carlos>webmaster de http://lasabanaylosescepticos.blogspot.com/ \"The Shroud and the Skeptics\" (Google translate).Thanks again Carlos.Stephen E. Jones Reader, if you like this my The Shroud of Turin blog, and you have a website, could you please consider adding a hyperlink to my blog on it? This would help increase its Google Page Rank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks..","date":"2014-05-29","mins":"12:21 AM","url":"http://theshroudofturin.blogspot.com/2014/05/my-theory-that-radiocarbon-dating.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #1\n"},{"author":"stephen_e_jones","post":"[continued]Even though Gove's book was not available until 1996, which stated that the AMS radiocarbon dating process was FULLY COMPUTERISED:\"The first sample run was OX1. Then followed one of the controls. Each run consisted of a 10 second measurement of the carbon 13 current and a 50 second measurement of the carbon 14 counts. This is repeated nine more times and an average carbon 14/carbon 13 ratio calculated. ALL THIS WAS UNDER COMPUTER CONTROL and the CALCULATIONS PRODUCED BY THE COMPUTER were displayed on a cathode ray screen.\" (Gove, H.E., 1996, \"Relic, Icon or Hoax?,\" p.264. My emphasis);Sox's book stated it in 1988:\"The CALCULATIONS WERE PRODUCED ON THE COMPUTER, and DISPLAYED ON THE SCREEN. Even the dendrochronological correction was immediately available. All eyes were on the screen. The date would be when the flax used for the linen relic was harvested.\" (Sox, H.D., 1988, \"The Shroud Unmasked,\" p.147).So there really was NO EXCUSE for those who correctly realised that there HAD to have been fraud in the 1st century Shroud having a 13th/14th century radiocarbon date, not considering computer hacking as another form of fraud.Although they mean well, like police investigators who focus only on the wrong suspect in a crime, and ignore other suspects, one of whom actually did the crime, those who claim the fraud was sample switching are unwittingly protecting the actual perpetrator, a computer hacker (allegedly Timothy W. Linick).>And the fact that there is a mismatch in the reported weights and sizes of the samples provides support to his accusation The photograph of the various Shroud radiocarbon dating samples in Wilson's 2010 book, \"The Shroud,\" which is online, shows that there is no \"mismatch in the reported ... Sizes of the samples.\" So any \"mismatch in the reported weights ... Of the samples\" is readily explained by human error.Stephen E. Jones MY POLICIES Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Except that comments under my latest post can be on any Shroud related topic without being off topic. I normally allow only one comment per individual under each one of my posts..","date":"2015-06-08","mins":"9:59 AM","url":"http://theshroudofturin.blogspot.com/2014/12/my-theory-that-radiocarbon-dating_8.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #10: Summary (2)\n"},{"author":"stephen_e_jones","post":"DH Thanks for your comment.>>Besides, if they thought the Shroud was a medieval fake[42] why would they switch samples to ensure the Shroud's radiocarbon date was medieval?You have omitted the other reasons why the radiocarbon dating laboratories would not have switched the Shroud sample with a medieval control sample:1. \"But Ian Wilson personally knew Tite and most of the other the radiocarbon dating project leaders and he dismissed as \"absurd and far fetched as it is unworthy\" accusations that \"one or more of these men may have `rigged' the radiocarbon dating\" by switching samples[39]. 2. \"It is also highly unlikely that leaders of the radiocarbon dating project like Dr. Tite would commit major scientific fraud by switching control and Shroud samples, since they would have too much to lose if the fraud was discovered[40],\"3. \"as it would have been because of the Shroud's distinctive weave[41].\">Precisely because they thought it was NOT medieval, but from the time of Jesus, There is NO evidence that these mostly non Christian atheist/agnostics laboratory leaders and their staff \"thought it [the Shroud] was NOT medieval, but from the time of Jesus,\">that they may have wanted to do the fraud. Even if they HAD \"wanted to do the fraud\" (and there is no evidence that they did) the fact that the fraud would have been \"discovered ... Because of the Shroud's distinctive weave\" rules out fraud by sample switching.>Bonnet Aymard hypothesis makes sense. It indeed \"makes sense\" that there HAD to have been fraud in the 1st century Shroud (according to the OVERWHELMING weight of the evidence) having a 13th/14th century radiocarbon date, when the probability of that was \"astronomical\" (Tite, Hall Hedges); \"about one in a thousand trillion\" (Gove) and indeed \"totally impossible\" (Hall). But where those who pointed that out went wrong is that they considered only ONE form of fraud, sample switching, which is highly implausible; and did not consider a much more likely form of fraud for the FULLY COMPUTERISED process of AMS radiocarbon dating, namely COMPUTER HACKING.[continued].","date":"2015-06-08","mins":"9:56 AM","url":"http://theshroudofturin.blogspot.com/2014/12/my-theory-that-radiocarbon-dating_8.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #10: Summary (2)\n"},{"author":"stephen_e_jones","post":"Orange>On Saturday, May 24, 2014, you wrote that \" • Conventional explanations of the discrepancy don't work. Attempts by Shroud pro authenticists to explain away the discrepancy between the Shroud being 1st century, yet its radiocarbon date is 1260 1390, don't work.\".Yes.>On the same day you also wrote that \"Being a theory, not a fact, I may need to modify my theory (including abandoning it altogether as false) as new information comes to light.\"Yes.>You have put yourself in a very difficult situation I'm afraid. No.>If conventional explanations don't work and your theory is false You have missed out the \"IF\" before \"your theory is false.\" It has not been SHOWN that my theory is false. In fact NO ONE (in a comment on my blog at least I don't read other blogs or forums) has even ATTEMPTED to show me where my theory is false. I therefore maintain that my theory is TRUE.>then the Shroud is a medieval fake .No. Even if my theory were false, there could be some other, not yet thought of, explanation of why the carbon dating was wrong.Only if the Shroud can be SHOWN to be \"a medieval fake\" can it be truly stated that \"the Shroud IS a medieval fake.\"And for that to happen, those who state that \"the Shroud IS a medieval fake\" need to:1. Positively explain WHO was the faker; HOW it was faked; WHEN was it faked; WHY was it faked; and REPLICATE the fake (the entire Shroud with all its major features) EXACTLY using medieval knowledge and technology.and2. Negatively explain away ALL the evidence for the Shroud having existed since the 1st century. No Shroud anti authenticist has even ATTEMPTED that. Or if they had attempted it, they quietly gave up on it, when they realised the magnitude of the problems of the Shroud anti authenticist position.>Orange Your trying to win by default using such fallacious verbal trickery only reinforces how BANKRUPT the Shroud anti authenticity position is.Stephen E. Jones Reader, if you like this my The Shroud of Turin blog, and you have a website, could you please consider adding a hyperlink to my blog on it? This would help increase its Google Page Rank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks..","date":"2015-04-05","mins":"9:42 PM","url":"http://theshroudofturin.blogspot.com/2015/03/my-theory-that-radiocarbon-dating_31.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #10: Summary (7)\n"},{"author":"stephen_e_jones","post":"Orange>>You have missed out the \"IF\" before \"your theory is false.\">>>>It has not been SHOWN that my theory is false. In fact NO ONE (in a comment on my blog at least I don't read other blogs or forums) has even ATTEMPTED to show me where my theory is false.>I didn't miss out anything. I just quoted you and there was no \"IF\"No. The words, \"If conventional explanations don't work and your theory is false\" were YOURS, not mine. You were by verbal trickery trying to convert my CONDITIONAL (\"may\") statement:\"Being a theory, not a fact, I may need to modify my theory (including abandoning it altogether as false) as new information comes to light.\"into a PREMISE of your argument that my theory IS false.That I am open to the POSSIBILITY of my theory being false, does not mean that it IS, or WILL BE shown to be, false.>>\"In fact NO ONE (in a comment on my blog at least I don't read other blogs or forums) has even ATTEMPTED to show me where my theory is false.\">Are you joking ? Do you have serious memory problems ? No.>Dan Porter posted your theory on his blog back in 2014. No. My theory was not a theory until my post, \"My theory that the radiocarbon dating laboratories were duped by a computer hacker #1\" which was on 24 May 2014.Before that it was just a \"proposal\". The headings of my posts on the topic from 18 February 18 May 2014 were in the form of a QUESTION: \"Were the radiocarbon dating laboratories duped by a computer hacker?\">You were still a member of Porter's blog at that time No. I left Porter's blog in April 2014 and ceased reading his blog's posts and comments, on 8 May 2014.>and we all remember that it was severely criticized There were some MINOR criticisms of my hacker proposal before I finally left Porter's blog on 8 May 2014, but nothing that I had any problems with, and I have since addressed those criticisms in my subsequent \"My theory ...\" posts.>and that you replied to your theory's detractors in an attempt to defend it.See above. First, while I was on Porter's blog before 8 May it was just a \"proposal\", not a theory.Second, I did not \"ATTEMPT to defend\" my proposal. I DID successfully defend it.Even on your own account you have failed to make your case: \"severely criticized\" is NOT \"REFUTED\".>Orange I invite anyone (except Colin Berry who is banned) to comment on my blog, listing the major criticisms of my theory and I will respond to them.But they must do it in accordance with my policies below. That is, make it ONE first and final complete, well thought out, comment by each person, which is not offensive or sub standard. To avoid interminable debates, I won't normally allow a commenter to post more than one comment under each post.I will allow you, Orange, to make as your last comment under this post such a ONE first and final complete, well thought out, not offensive or sub standard comment outlining your major criticisms of my theory and I will respond to those criticisms. Otherwise this was your last comment under this post.Stephen E. Jones MY POLICIES Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Except that comments under my latest post can be on any Shroud related topic without being off topic. I normally allow only one comment per individual under each one of my posts..","date":"2015-04-05","mins":"11:48 PM","url":"http://theshroudofturin.blogspot.com/2015/03/my-theory-that-radiocarbon-dating_31.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #10: Summary (7)\n"},{"author":"stephen_e_jones","post":">You were by verbal trickery trying to convert my CONDITIONAL (\"may\") statement:>>\"Being a theory, not a fact, I may need to modify my theory (including abandoning it altogether as false) as new information comes to light.\"Correction: \"CONDITIONAL (`may')\" above should have been \"HYPOTHETICAL\".Stephen E. Jones.","date":"2015-04-06","mins":"6:48 AM","url":"http://theshroudofturin.blogspot.com/2015/03/my-theory-that-radiocarbon-dating_31.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #10: Summary (7)\n"},{"author":"stephen_e_jones","post":"Anonymous Thanks again for your comment under part #6. I have re posted it under this part #5 post where the calibration chart is.>I am looking at your calibration chart, especially at the two yellow \"Oxford\" lines, which you say represent 780 and 720 years Before Present. These reflect off the calibration line and arrive, you say, at 1214 to 1266 AD. I'm afraid I don't see that. The 780 BP line seems correctly placed, but the corresponding vertical line arrives well after 1250 AD, and nowhere near 1214. Thanks. I have rechecked Oxford's dates and there was an error in both the placement and calculation of its 720 BP and 780 BP date. The correct calibrated year corresponding to 780 BP, should have been 1210, not 1214.>The 720 BP line seems to be far too high on the y axis, close to 750 BP. If it were correctly placed, it would correspond to a calendar date rather later than 1266. Is that right, or am I missing something?Thanks again. The correct calibrated year corresponding to 720 BP, should have been 1279, not 1266. That still leaves Oxford's maximum date below the minimum dates of both Zurich (1286) and Arizona (1290).I will recheck all three laboratories' calibrated dates and replace my calibrated table and bar chart above with corrected ones.And if there is any need to change my conclusions above, apart from the dates, I will do that too. But at this stage it appears the changes are comparatively minor and don't necessitate a change to my conclusions.The Nature paper should have included calibrated dates for each laboratory, but it didn't. I assume that was deliberate to avoid it being obvious that the dates were markedly different. If you can find the actual calibrated dates for the three laboratories (I Googled for them but could not find them) I will replace my dates with those in my above post.Thanks again for your comment.Stephen E. Jones Reader, if you like this my The Shroud of Turin blog, and you have a website, could you please consider adding a hyperlink to my blog on it? This would help increase its Google Page Rank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks..","date":"2014-06-28","mins":"10:37 AM","url":"http://theshroudofturin.blogspot.com/2014/06/my-theory-that-radiocarbon-dating_13.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #5 \n"},{"author":"stephen_e_jones","post":">I will recheck all three laboratories' calibrated dates and replace my calibrated table and bar chart above with corrected ones.I have replaced the calibrated graph, table and bar charts with corrected ones.As can be seen, Oxford's years still do not overlap Arizona and Zurich, and the latter two only overlap by 8 years.This is INEXPLICABLE if these were real dates, given that, as the 1989 Nature paper admits: \"the agreement among the three laboratories for samples 2, 3 and 4 [control samples] is exceptionally good.\"But as I point out in my post above, in each laboratory's dating runs, the Shroud and control samples were all on the same ~1 inch (~26 mm) diameter carousel wheel, and each sample was irradiated in turn by the same caesium beam, for a minute, the entire run taking only 10 minutes.However, these results for Sample 1 (the Shroud) ARE EXPLICABLE if they were bogus dates generated by a hacker's (Timothy W. Linick's) computer program!Stephen E. Jones.","date":"2014-06-29","mins":"12:12 AM","url":"http://theshroudofturin.blogspot.com/2014/06/my-theory-that-radiocarbon-dating_13.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #5 \n"},{"author":"stephen_e_jones","post":"\"If we show the material to be medieval that would definitely mean that it is not authentic. If we date it back 2000 years, of course, that still leaves room for argument. It would be the right age but is it the real thing?\"You seem to think that statement is somehow logically invalid. Why?Proving the shroud is 2000 years old wouldn't prove it wrapped Jesus, for the same reason proving it 1000 years old wouldn't prove Jesus didn't exist..","date":"2014-07-03","mins":"8:55 PM","url":"http://theshroudofturin.blogspot.com/2014/06/my-theory-that-radiocarbon-dating_24.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #6\n"},{"author":"stephen_e_jones","post":"[continued]>Something smells funny here about these 2 deaths.Agreed. Apart from my theory, there is no known reason for Koch's simulated suicide. He had ~9 months before finished confessing his hacking of computer secrets for the KGB and so had his fellow hackers. But none of the latter were killed. Besides, the KGB would not be unduly upset that news of it's sponsored hacking of the computer secrets of OTHERS became known. It would only be the KGB's OWN hacking, e.g. Ensuring the C14 dating of the Shroud returned a 1st century date, that the KGB would kill to ensure it remained secret. What also seemed strange was when Hugh Farey copied my early comments on Porter's blog, proposing that the 1988 radiocarbon dating of the Shroud were the result of a computer hacking, to Profs. Timothy Jull and Prof. Christopher Ramsey, Directors of the Arizona and Oxford radiocarbon laboratories respectively, who both were signatories to the 1989 Nature paper, they both responded promptly. I thought that \"smells funny\" because why would they respond AT ALL to an unknown blogger (Farey said he did not tell them my name)?But what also smelled even funnier is that they were both very defensive and Prof. Ramsey effectively LIED, claiming that I was \"someone who does not know what computers were like in the 1980s\":\"This would seem to be a suggestion FROM SOMEONE WHO DOES NOT KNOW WHAT COMPUTERS WERE LIKE IN THE 1980 S. In the case of Oxford the AMS had no connection to any network (and indeed even today our AMS control computers have no network connections). The software was very simple just outputting counts of 14 C and currents measured. Age calculation was done offline and COULD JUST BE DONE WITH A CALCULATOR, or by a simple program into which you typed the numbers from the AMS\" (my emphasis).when in fact I was there at the beginning of the personal computer revolution of the 1980s and grew with it, becoming a SYSTEMS ADMINISTRATOR of a Health Department of Western Australia wide area network of 7 hospital UNIX computers in the late 1980s/early 1990s.And besides it MADE NO SENSE because Prof. Ramsey KNEW that the AMS System computer at Arizona, Oxford and presumably Zurich, was a very powerful DEC PDP or VAX MINICOMPUTER. So what was Ramsey's POINT, if it was not to MISLEAD? And mislead it did, with those on Porter's blog interpreting Ramsey's \"The software was very simple ... Age calculation was done offline and could just be done with a calculator,\" as saying that the AMS computer was little better than a calculator, and Porter himself questioned whether it was even programmable!So I assume that Profs Ramsey and Jull know things that would support my hacking theory, but are trying to cover it up. Which is not to say that they KNOW they were hacked. Linick could, and probably did, include in his program that it would erase itself on the three laboratories AMS computers after it had been run, and then was not run again for (say) three months, when all dating of the Shroud would have finished. But Jull and Ramsey may SUSPECT that they COULD have been hacked, but they wouldn't want that to be known. [continued].","date":"2014-09-06","mins":"10:27 PM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n"},{"author":"stephen_e_jones","post":"Bippy123 Thanks for your support. I have had little (or no) expressions of support for my theory from pro authenticists. Perhaps Porter's \"conspiracy theory\" scare campaign against my theory is working? No matter, I am not intimidated by the likes of Porter. I will leave it to the Lord to repay (Rom 12:19) Porter and his ilk for the personal attacks and nastiness that they have directed at me.>Its very interesting that Koch and Linick were both dead within so close time intervals of each other. Yes. I initially thought that my theory was weakened when I re calculated that Koch was killed sometime between 23 and 30 May 1989 (since Koch went missing on 23 May and a farmer called the police after he noticed Koch's car abandoned three days in a row), which was between 12 and 6 days before Linick's `suicide.' But then I remembered that the police would havehad to formally identify the charred body as Koch's:\"The body was LATER IDENTIFIED as that of the twenty four year old Karl Koch.\" (Clough, B. & Mungo, P., 1992, \"Approaching Zero,\" p.163. My emphasis).before they could release the news to the public, which would presumably take at least a few days.So the KGB would probably not have known that Koch's body, which they had tried to hide so it would not be found for a long while:\"Koch left his workplace in his car to go for lunch; he had not returned by late afternoon and so his employer reported him as a missing person. Meanwhile, German police were alerted of an abandoned car in a forest near Celle. When they went to investigate, they found an abandoned car, that LOOKED LIKE IT HAD BEEN THERE FOR YEARS, AS IT WAS COVERED IN DUST. Near to the car they found a burned corpse (Koch). His shoes were missing and have never been found. There was a patch of burned ground around him, which although it had not rained in some time and the grass was perfectly dry, was controlled in a small circle around the corpse. It is thought to be highly unlikely that this type of controlled burning could have been achieved by Koch himself which leads many to believe that his death was not suicide.\" (\"Karl Koch (hacker),\" Wikipedia, 30 May 2014. My emphasis).had been found until they read, or heard it, via the news media. And then it was BIG news:\"The news of Hagbard's [Koch's] death brought the case of the hacker spies once again into public view. West German magazines and newspapers carried lengthy, speculative articles about the death. Just how sensitive was the material that landed in the hands of the KGB? And just who might have had an interest in seeing Hagbard dead? Could such a hideously painful death really have been the result of suicide? Unlike a drug overdose or suicide by gunshot, death by burning usually leaves the cause more ambiguous.\" (Hafner, K. & Markoff, J., 1991, \"Cyberpunk,\" pp.302 303).But the police did not find Koch's body until \"NINE days later\" than 23rd May, i.e. 1st June, or it could have been 31st May if the day Koch went missing was included in the 9 days:[continued].","date":"2014-09-06","mins":"9:39 PM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n"},{"author":"stephen_e_jones","post":"[continued]\"Karl Koch was last seen alive on 23 May 1989. That morning he had turned up to work as usual at the Hannover office of Germany's ruling Christian Democratic party. Just before twelve o'clock he drove off alone to deliver a package across town. He never arrived. In the late afternoon, his employers notified the police of his disappearance. NINE DAYS LATER the police went to a wood on the outskirts of the small village of Ohof, just outside Hannover, on a routine inquiry. They were investigating a report of an abandoned car, its roof, hood and windscreen thick with dust. In the undergrowth near the car, the police stumbled on a charred corpse lying next to an empty gasoline can. The vegetation around the body was scorched and burned. The police noticed that the corpse was barefoot but no shoes were found in the car or in the surrounding area. The investigators were perplexed. There had been no rain for five weeks and the undergrowth was as dry as matchwood. But the scorched patch around the body was contained, as if the fire that consumed the victim had been carefully controlled. The body was later identified as that of the twenty four year old Karl Koch. The police assumed he had committed suicide. But still there were questions: principally, if Koch had killed himself, how had he been able to control the fire? Why had it not spread outside the confined perimeter?\" (Clough & Mungo, 1992, p.163. My emphasis).So, since Linick was found dead of \"suicide in mysterious circumstances\" on 4th June, then that would have been IMMEDIATELY AFTER the KGB learned that Koch's body had been found. >Suicide was the typical liquidation methods of intelligence agencies and they were very good at what they did.Indeed. The coincidence seems too great that a KNOWN hacker for the KGB (Koch) was killed, presumably by the KGB (who else?), for no apparent reason, and then immediately after his body was found, a THEORISED hacker for the KGB (Linick) was found dead of \"suicide in mysterious circumstances.\">Its interesting that not much information can be found on Linick's death.Yes. You would think that the sudden death of a 42 year old local scientist in Tucson, would at least be mentioned in the local media. But the Library of Congress could only find a death and funeral notice. It is consistent with the US security agencies having suppressed the news. Although it is possible that the suicide was in a category that the media don't report, to avoid copy cat suicides, like jumping in front of a moving train. Which of course the KGB could have arranged. But when Koch was found dead by simulated suicide presumably the US security agencies took note of it, because Koch had hacked US secrets and sold them to the KGB. Then when Linick committed \"suicide in mysterious circumstances\" only days later, since the Arizona radiocarbon dating laboratory is a US Government funded facility:\"Arizona Accelerator Mass Spectrometry Laboratory focuses on the study of cosmogenic isotopes, and in particular the study of radiocarbon, or Carbon 14. ...Established in 1981, this facility is a National Science Foundation research facility.\" (\"Arizona Accelerator Mass Spectrometry Laboratory,\" Wikipedia, 9 August 2012)it is possible that the US security agencies put two and two together, and had the news of Linick's death suppressed on national security grounds.[continued].","date":"2014-09-06","mins":"9:46 PM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n"},{"author":"stephen_e_jones","post":"[continued]I am therefore quietly confident that more information will come to light that will support and even confirm my theory. Although being a theory, not a fact, I am open to any evidence that might require it to be modified, or even abandoned as wrong (although I think the latter is unlikely).But if I WAS wrong, in Science there is no shame in that, despite what Porter, who has no science qualifications (unlike me) might think. Most scientific theories have been wrong and all science theories are potentially wrong. Scientists ADMIRE (albeit often grudgingly) when someone sticks their neck out and proposes a bold theory which attempts to explain much. What is DESPISED in Science are those who sit on the fence (like Porter) and propose NO bold theories (or even a theory AT ALL) but hold an UNFALSIFIABLE position that is \"not EVEN wrong,\" e.g. \"Is the Shroud of Turin real? Probably\"!But as I have written before, Koch is not essential to my theory, since Linick could have done all the hacking himself. It would not have been too difficult for Linick to take a week off work and fly to Oxford and Zurich and install clandestinely his program on their AMS computers, as he had done on Arizona's (although if Linick did not know how to break into Zurich and Oxfrord's computers, then that would explain Koch's involvement). It is not even essential to my theory that the KGB was involved, as Linick could have done the hacking alone (again assuming that he could break into Zurich and Oxford's AMS computers) for no financial gain but just out of his extreme anti authenticism. However, I believe that my theory should try to explain as many facts as possible (the mark of a good theory), which is why I have stuck my neck out, giving Porter and anyone else, the opportunity to chop it off!Stephen E. Jones Reader, if you like this my The Shroud of Turin blog, and you have a website, could you please consider adding a hyperlink to my blog on it? This would help increase its Google Page Rank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks..","date":"2014-09-06","mins":"11:53 PM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n"},{"author":"stephen_e_jones","post":"Anonymous>At the beginning the computer hacking was a proposal, No. Before that it was a \"case\" 09 Jan 14.Then it became a question: 18 Feb 14 to 18 May 14. Towards the end of those question posts, I started using the pre theory term \"proposal\" 07 Mar 14.>afterwards a theory, Yes. From 24 May 14 I started to call my proposal a \"theory,\" as I became increasingly persuaded by the evidence that the radiocarbon dating laboratories had been duped by a computer hacker. >now an evidence.No. Since 23 Jul 15 I have been using the phrase: \"... My concluding summary of the evidence that the 1988 radiocarbon dating of the Shroud of Turin as `mediaeval ... AD 1260 1390' was the result of a computer hacking ... \" But it is still evidence supporting my theory that the 1260 1390 radiocarbon date of the Turin Shroud was the result of a computer hacking.Stephen E. Jones MY POLICIES. Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Except that comments under my latest post can be on any Shroud related topic. I normally allow only one comment per individual under each one of my posts..","date":"2016-08-01","mins":"5:42 PM","url":"http://theshroudofturin.blogspot.com/2016/07/the-1260-1390-radiocarbon-date-of-turin.html","title":"\nThe 1260-1390 radiocarbon date of the Turin Shroud was the result of a computer hacking #9 \n"},{"author":"stephen_e_jones","post":"[continued]I am quietly confident that my theory is basically correct, because it explains, and takes account of. As no other theory does, so many different things:1) how the 1st century Shroud had a C14 midpoint of 1325, only 25 30 years before the Shroud's first appearance in undisputed history at Lirey, France in the 1350s;2) other pro authenticist explanations of 1) don't work, e.g. Contamination; neutron flux; sample switching, because: a) it would require 60% of the Shroud samples to be contamination when Arizona's undated sub sample sample clearly isn't; b) it would be a MIRACLE if a neutron flux `just happened' to reset the Shroud's 1st century date to 1325; and c) if the Shroud samples were switched the Table 2 of the 1989 Nature would not have wide variances between laboratories (see below), since they would be real dates.3) why Linick was quoted surprising in Sox's 1988 book as an extreme anti authenticist and in direct contact with Sox, in breach of his signed undertaking not to communicate with anyone outside the lab;4) that Linick therefore was probably the leaker of Arizona's 1350 first run date to Sox who leaked it to the media;5) the otherwise inexplicable wide variances between the laboratories' Shroud samples C14 dates in Table 2 of the 1989 Nature paper, i.e. They are not real dates but computer generated;6) that the entire process of C14 dating and displaying the results was under the AMS computer's control, so a hacker COULD install a program on it, at each of the three AMS laboratories, Arizona, Zurich and Oxford, to substitute the Shroud's 1st century date with dates that clustered around 1325;7) that Linick wrote the paper describing in detail Arizona's AMS C14 dating system, including its computer control, so he was probably thoroughly familiar with the AMS computers at Arizona and indirectly at Zurich and Oxford since they were `clones' of each other.8) that university laboratories (as the three AMS laboratories are) were insecure, both physically and computerwise, in 1980s;9) that the laboratories' AMS DEC computers' operating system, would probably have been VMS, which in the late 1980s had a huge hole, known to and exploited by hackers, including Koch, which allowed a hacker to enter the computer and become a superuser, after which he could install a program that would come between the output of the AMS C14 dating system and the AMS computer's display of the C14 dating results; 10) why Koch was killed, probably by the KGB, between 23 and 30 May, in a simulated suicide and Linick was killed, by a \"suicide in mysterious circumstances, again probably by the KGB, at most only 4 days after Koch's death became public; to ensure that the hacking of the Shroud's C14 dates, sponsored by the KGB, remained a secret.[continued].","date":"2014-09-06","mins":"11:33 PM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n"},{"id":"comment-1174","author":"stephen_e_jones","post":">Scientists place an entire artefact in a special chamber with a plasma, an electrically charged gas similar to gases used in big screen plasma television displays … The chamber could be sized to accommodate large objects, such as works of art and even the Shroud of Turin … I cannot imagine that the Roman Catholic church would ever allow the entire Shroud to be placed in a chamber of gas which is then electrically charged up to a plasma state. Nor should us Shroudies want them to take the risk, if there was even the slightest chance that something could go wrong the Shroud destroyed or permanently changed (e.g. The image disappear into the background). I personally do not want to gain a 1st century radiocarbon dating of the Shroud but lose it in the process. Stephen.","date":"2010-03-24","mins":"7:27 am","url":"https://shroudstory.com/2010/03/24/new-dating-technique-might-help-with-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New dating technique might help with the Shroud of Turin"},{"id":"comment-1184","author":"stephen_e_jones","post":"Besides, the Shroud could always be radiocarbon dated conventionally by taking tiny, less than postage stamp size, samples from several different inconspicuous areas (e.g. Underneath the 1532 fire burn patches, at the ends and sides where it is covered by backing cloth, etc) with no risk to the Shroud itself. Stephen.","date":"2010-03-27","mins":"12:56 am","url":"https://shroudstory.com/2010/03/24/new-dating-technique-might-help-with-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New dating technique might help with the Shroud of Turin"},{"id":"comment-1185","author":"stephen_e_jones","post":">We need an international scientific commission more than ever. Not if there is any chance that it would be hijacked by anti authenticity types, which it likely would on the grounds of `even handedness’ etc. Besides, it doesn’t take a scientific commission to radiocarbon date an artifact (for example). It is done all the time by individual archeologists. All that is required is that samples tested be taken from several different areas, to control for random variables. The Shroud pro authenticity community has plenty of scientists available to design and oversee the test, and then write up the results in a scientific journal. If the anti authenticity side complains of pro authenticity bias, too bad. That could be countered by pointing out that they had their own biased turn in 1988 when all Shroud pro authenticity scientific participation and advice was deliberately excluded from the process. Stephen.","date":"2010-03-27","mins":"1:39 am","url":"https://shroudstory.com/2010/03/24/new-dating-technique-might-help-with-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New dating technique might help with the Shroud of Turin"},{"id":"comment-1196","author":"stephen_e_jones","post":"Maria >I utterly agree with all comments namely from Professor Stephen Jones. Thanks. But I am just plain Mr. Jones. I don’t think we need to be worried about this at all. Apart from it being Jesus’ Shroud, who has all power and authority in heaven and earth (Mt 28:18; Eph 1:21), and who has protected His burial sheet down through the ages as a witness to His suffering, death and resurrection; there is effectively zero probability that the Pope would allow the whole Shroud to be put in a chamber of gas which was then electrically charged up to a plasma state. Perhaps the most important part of the article is Dr Rowe’s statement: “In theory, it could even be used to date the Shroud of Turin.” Because that is a tacit admission of what is probably now widely accepted in the radiocarbon dating community, that the 1988 carbon 14 dating of the Shroud as “AD 1260 1390 … mediaeval”: “The results of radiocarbon measurements at Arizona, Oxford and Zurich yield a calibrated calendar age range with at least 95% confidence for the linen of the Shroud of Turin of AD 1260 – 1390 (rounded down/up to nearest 10 yr). These results therefore provide conclusive evidence that the linen of the Shroud of Turin is mediaeval.” (Damon, P.E., et al., “Radiocarbon Dating of the Shroud of Turin,” Nature, Vol. 337, 16 February, 1989, pp.611 615, p.614). Was flawed, otherwise why bother proposing to radiocarbon date the Shroud again? Stephen.","date":"2010-03-30","mins":"6:01 pm","url":"https://shroudstory.com/2010/03/24/new-dating-technique-might-help-with-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New dating technique might help with the Shroud of Turin"},{"id":"comment-1199","author":"stephen_e_jones","post":"Dan For some reason I get everyone else’s comments emailed to me, but not my own. I therefore don’t know whether others get my comments either. I regularly tick all the boxes on the subscribe to posts and comments emails the system generates asking for all posts and comments to be sent to me, but still I get emailed all others’ comments except my own. I have checked my settings and I cannot see where I can set it so that I get my own comments emailed to me. I cannot recall making comments on another Word Press blog, so I don’t know if it is normal on them that the person posting a comment does not get emailed a copy of it, but it seems a strange feature if that is the case. But if not, and you can set it so that I get my own comments, I would appreciate it. Thanks. Stephen.","date":"2010-03-30","mins":"8:11 pm","url":"https://shroudstory.com/2010/03/24/new-dating-technique-might-help-with-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New dating technique might help with the Shroud of Turin"},{"author":"stephen_e_jones","post":"Erwin>Current controversy about the shroud of Turin Thanks for your comment.>In relation to the current debate regarding the accuracy of the carbon dating, following which the Vatican announced the shroud to be a 14 century forgery,I am a Protestant, so I have no brief to defend the RC Church. But the fact is that Vatican never \"announced the shroud to be a 14 century forgery.\" As I pointed out in a recent post, \"Shroud of Turin may not be a fake after all! \", that was the invention of the British media.>it is important to know that the carbon dating was correct but carried out on samples which were not from the original cloth. If this is claiming that \"the carbon dating was correct\" then I don't necessarily agree that it was. It is very difficult to radiocarbon date old linen, especially when it has wrapped a body, due to flax fibres being highly porous and comprised of microfibrils arranged in a rope like spiral, giving it an enormous surface area that can absorb and retain younger carbon and then resist it being removed.As for \"carried out on samples which were not from the original cloth,\" this could be either from a fraudulent switch of a 14th century linen sample for the Shroud; or from the sample being from a re woven patch of the Shroud. There is some evidence for both theories, but I am not yet convinced of either one.>The church had absolutely no interest in providing a genuine sample of the shroud because it would show that the person, (presumably Jesus) who had been wrapped in it, was not dead but had survived the crucifixion. This Kersten & Gruber (and others') conspiracy theory is implausible on at least two grounds: 1) the overwhelming preponderance of the evidence is that Jesus was dead (see below); 2) if the RC Church really thought that the Shroud showed that Jesus survived the crucifixion and wanted to cover it up, it has had plenty of opportunities to destroy the Shroud (including two fires, one as late as 1997) and also to distance itself from the Shroud's authenticity. But instead the RCC has gone to immense lengths to preserve the Shroud, and despite all the claims that the Shroud is a fake, the RCC has never agreed with those claims (despite media hype to the contrary). Moreover, even after the 1989 carbon dating result, the RCC has continued to exhibit the Shroud in 1998 and 2000 as though it was the genuine article, with Popes John Paul II and Benedict XVI publicly stating their personal belief in its authenticity.It is in fact the \"Jesus ... Was not dead but had survived the crucifixion\" theories that are themselves dead! Among the best evidence that Jesus did die on the Cross was provided by New York State medical examiner Dr. Frank Zugibe, who pointed out that \"If Jesus had been alive after the spear wound, the soldiers and others at the site would have heard a loud sucking sound caused by breath being inhaled past the chest wound\" (a fact no doubt well known to the Romans soldiers, which is presumably why they did it):\"There are at least three signs on the Shroud that Jesus was dead when He was buried. First, the body of the man in the Shroud is in a state of rigor mortis, in which the muscles stiffen, keeping the body in the position the person occupied just prior to death. Such a state is complete in about twelve hours after death, begins to wear off in twenty four hours, and disappears in thirty six to forty hours. Of course, these times are variable and imprecise, and therefore somewhat unreliable. Closely related to rigor mortis is a state called cadaveric spasm, an immediate stiffening, a rather sudden contraction of the muscles that occurs quickly after some violent deaths. Rigor mortis is observable on the Shroud in several places. The head was bent forward, the feet were somewhat drawn up, and the left leg in particular had moved back toward its position on the cross. Especially visible in the three dimensional image analysis of the Shroud are the retracted thumbs and the `frozen' posture of the chest and abdomen. As was also noted by Bucklin, the entire body was quite rigid and stiff, occupying some of the positions it did on the cross. The second evidence of death in the man of the Shroud is the post mortem blood flow, especially from the chest wound. If the heart had been beating after burial, the blood literally would have been shot out onto the cloth. But the blood oozed out instead. Also, a comparatively small quantity of blood flowed, and there was no swelling around the wound. Finally, the blood from the chest, left wrist, and feet separated into clots and serum and was much thicker and of much deeper color than it would have been prior to death. Zugibe also mentioned a third piece of evidence based on his medical experience. If Jesus had been alive after the spear wound, the soldiers and others at the site would have heard a loud sucking sound caused by breath being inhaled past the chest wound. Zugibe related that when answering a distress call after a man had been stabbed in the chest, he heard the loud inhaling of the unconscious man all the way across the room. He saw this phenomenon as `a direct refutation of the theory that Christ was alive after being taken down from the cross.\" [Zugibe, F.T., \"The Cross and the Shroud,\" Angelus Books: New York NY, 1982, p.165]\" (Stevenson, K.E. & Habermas, G.R., \"The Shroud and the Controversy,\" Thomas Nelson Publishers: Nashville TN, 1990, p.113. Emphasis original)>The amount of blood shown on the cloth could not have been from a person who had been dead for three hours, particularely taking into account that it was customary that the upper part of the body was elevated when entombed. There in fact is not all that much blood on the Shroud (see above, \"a comparatively small quantity of blood flowed\"). And despite claims to the contrary, dead bodies can still bleed by oozing, even days after death, as the floor of any butcher shop will show.>Hence it would appear that the cloth provided by the church for carbon dating was an almost identically looking cloth dating from the 14th century.The RC Church did not provide the cloth, except by making the entire Shroud available for cutting off the sample. And the sample was cut off, not by a RC priest but by a scientist, the late Prof. Giovanni Riggi, in a videotaped ceremony which was attended by, amongst others, the British Museum's representaive and the chiefs of the three radiocarbon dating laboratories.As I said above, it is possible there was a sample switch later (although I think it unlikely), but then it would have been done after the Shroud sample had been cut off, and was therefore no longer under the control of the RC Church.>Earlier pollen tests carried out on the shroud had shown it to have originated from the area of Jerusalem from the first century.Agreed, but that was from the same Shroud that the RC Church provided for the sample to be cut from. This also undercuts the RC Church \"had absolutely no interest in providing a genuine sample of the shroud\" theory, because: 1) the pollen samples were taken by foresic scientist Max Frei at scientific examinations of the Shroud in 1973 and 1978. If the RCC thought the Shroud showed that Jesus survived the crucifixion, it would never have allowed those scientific tests, let alone allowed Frei, a Protestant, to take pollen samples from it.But no doubt this will make no difference to conspiracy theorists like yourself, to whom evidence against the conspiracy just shows how devious the RC Church was in making it look like there wasn't a conspiracy!Stephen E. Jones.","date":"2008-03-25","mins":"12:07 PM","url":"http://theshroudofturin.blogspot.com/2008/02/shroud-dating-may-have-been-inaccurate.html","title":"\nShroud Dating May Have Been Inaccurate - Radiocarbon Expert\n"},{"id":"comment-94857","author":"stephen_e_jones","post":">now being forced to revise his thinking after seeing emails to Hugh Farey from two of the three lab directors. I was not “forced”. I had already stated in a comment, before the emails from Dr Jull and Prof. Ramsey were posted, confirming that their AMS control computers had never been online, that my alternative was that each of the three computers were hacked manually. When Prof. Ramsey confirmed that the AMS control console computers were not ever online, I thanked him for that and immediately modified my proposal to my alternative manual hacking of each of the three computers. >Has he determined if the AMS Control Consoles at all three labs had programmable computers There is no such thing as a NON programmable computer. Prof. Ramsey confirmed that the AMS control console computers were under the control of “software,” which is just another name for a program. When I get to that part of my series I will give further evidence about this. […] >Anyways, Stephen has provided us with some historic information to consider. Indeed! Even though I have only posted historical evidence from the 12th and 13th centuries, it is sufficient to establish that the Shroud existed CENTURIES before the earliest, 1260, C 14 date of the Shroud. The agnostic art historian, Thomas de Wesselow, has written of only ONE of those items of historical evidence: “The poker hole patterns represented in the Pray Codex drawing, first noticed in 1998, are also the FINAL NAIL IN THE COFFIN OF THE CARBON DATING RESULT. The cloth now in Turin must be at least three centuries older than the earliest date indicated by the radiocarbon age of the sample tested – a sizeable error. The 95 per cent confidence level the laboratories cited is meaningless, except, perhaps, as a measure of scientific hubris. Physics is not the only way to date the Shroud; HISTORICAL AND ART HISTORICAL RECORDS HAVE THEIR PART TO PLAY, as do the various indications gleaned from medical, chemical and archaeological investigations. This broad spectrum of research indicates that THE SHROUD DATES NOT FROM THE MIDDLE AGES, BUT FROM ANTIQUITY.” (de Wesselow, T., 2012, “The Sign: The Shroud of Turin and the Secret of the Resurrection,” p.182. My emphasis). You yourself Dan, state on your blog’s sidebar: “The carbon dating, once seemingly proving it was a medieval fake, is now widely thought of as suspect and meaningless. … Christopher Ramsey, the director of the Oxford Radiocarbon Laboratory, thinks more testing is needed. So do many other scientists and archeologists. This is because there are significant scientific and non religious reasons to doubt the validity of the tests.” How come the anti authenticists on your blog don’t take issue with that? And if the carbon dating is wrong, how come it still `hit the bull’s eye’ of 1325 +/ 65, absent fraud, either by hacker(s) or by the labs? As has been pointed out by you Dan, and by others on your blog, the various other explanations for how the Shroud can be 1st century yet its C 14 date is 1325 +/ 65, don’t hold water. At best they explain why the Shroud should have C 14 dated early but not 1st century. Dan, I am continually being defamed on your blog (the latest that I am morally indecent), for being the only pro authenticist who is publicly facing up to the key question: “how can the Shroud be 1st century, yet its C 14 date was 1325 +/ 65, just before the Shroud’s historical debut in the 1350s?” The 1st century + 16th century = 1325 +/ 65 repair theory doesn’t do that. It would be a MIRACLE, absent fraud, if the mix of 1st and 16th century linen, just happened, to produce that `bull’s eye’ date. >Nice new picture of Stephen. Thanks. My apologies for not changing my 1990s photo long before now.That photo of was taken on a holiday in Melbourne in 2007, cruising down the Yarra river..","date":"2014-03-30","mins":"6:08 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-94860","author":"stephen_e_jones","post":">Stephen Jones’ new photo definitely bears a striking resemblance to the face on the shroud .May be that he and Jesus are identical twins ? Dan, the Holy Spirit has been prompting me for months to request that you, as Owner and Moderator of this blog, start taking action to curb the incessant personal attacks on me, a Christian who is seeking only to serve his Lord Jesus. Romans 12:19 states to Christians, “Beloved, never avenge yourselves, but leave it to the wrath of God, for it is written, `Vengeance is mine, I will repay, says the Lord.’” That is, the Lord Jesus will avenge the personal attacks on me by those commentators defaming me and by you allowing them to do it. Those commenters and you may scoff at this, but they and you have been warned and now my conscience is clear..","date":"2014-03-30","mins":"6:26 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-94892","author":"stephen_e_jones","post":">Has he determined if the AMS Control Consoles at all three labs had programmable computers I meant to add, but I could not remember the name, that one of those listed by Harry Grove as present at Arizona’s C 14 dating of the Shroud was “Art Hatheway” who was “connected with the Arizona AMS facility”: “The next morning at about 8 am (6 May 1988) I arrived at the Arizona AMS facility. … I would be the only one present outside the Arizona AMS group. Doug immediately asked me to sign the following statement: “We the undersigned, understand that radiocarbon age results for the Shroud of Turin obtained from the University of Arizona AMS facility are confidential. We agree not to communicate the results to anyone spouse, children, friends, press, etc., until that time when results are generally available to the public.” It had been signed by D J Donahue, Brad Gore, L J Toolin, P E Damon, Timothy Jull and ART HATHEWAY, all connected with the Arizona AMS facility, before I signed. My signature was followed by T W Linick and P J Sercel, also from the Arizona facility.” (Gove, H.E., , 1996, “Relic, Icon or Hoax?: Carbon Dating the Turin Shroud,” p.262. My emphasis). A Google search on “Art Hatheway Arizona” (without quotes) had turned up an obituary of an “Arthur Loyal Hatheway” who was “Senior Staff Engineer at the AMS Lab in the Physics Department at U of A.” and a “computer programmer”: “Arthur Loyal Hatheway Obituary HATHEWAY, Arthur Loyal, born in Los Angeles on March 26, 1940 to Philip and Pauline Hatheway, went suddenly to Jesus on October 11, 2008. … In 2006, Art retired from his position as Senior Staff Engineer at the AMS Lab in the Physics Department at U of A. There his skills as COMPUTER PROGRAMMER and small instrument engineer, his thorough nature and precise workmanship, his understanding of chemistry and physics, as well as his abilities to invent and mentor, WERE PUT TO GOOD USE. Art met Jesus in 1992. This new relationship changed his perspective on life …”. I am NOT alleging that Art Hatheway was one of the hacker, just that there was at least one member of the Arizona C 14 lab staff who was a “computer programmer” and indeed a “Senior Staff Engineer,” which is indicative of a high level of sophistication of the Arizona C 14 lab’s computers, and presumably the other C 14 labs’ computers. And that presumably a major role Senior Staff Engineer Hatheway’s role was ensuring the AMS control console computer program controlled the AMS C 14 dating process: “The first sample run was OX1. Then followed one of the controls. Each run consisted of a 10 second measurement of the carbon 13 current and a 50 second measurement of the carbon 14 counts. This is repeated nine more times and an average carbon 14/carbon 13 ratio calculated. ALL THIS WAS UNDER COMPUTER CONTROL and the calculations produced by THE COMPUTER were displayed on a cathode ray screen.” (Gove, 1996, p.264). I had originally thought that the computer which controlled the AMS dating was different from the AMS control console computer, but according to Gove’s words above, they were ONE AND THE SAME. Now a lab does not need to employ a “Senior Staff Engineer” who is also a “computer programmer” and who “put[s] to good use” those “skills,” on a computer which Prof. Ramsey gave the misleading impression was little more than a calculator: “The software was very simple just outputting counts of 14 C and currents measured. Age calculation was done offline and could just be done with a calculator, or by a simple program into which you typed the numbers from the AMS.” (“Comment Promoted: On the Hacking Hypothesis,” March 9, 2014). And which led Dan to question whether it was even “programmable”. Now Prof. Ramsey is highly computer literate, being himself a computer programmer, as the author of “Ox Cal” a computer “program … intended to provide radiocarbon calibration”: Ox Cal The Ox Cal program is intended to provide radiocarbon calibration and … For further information contact the author: Prof. … christopher.ramsey@rlaha.ox.ac.uk.” So Prof. Ramsey presumably KNOWS VERY WELL that the AMS control system computers at Arizona, Zurich and Oxford were not little more than “a calculator” but were PROGRAMMABLE computers, controlling the entire complex AMS radiocarbon dating process as well as outputting the uncalibrated C 14 dates of each sample onto their screens. I personally find Prof. Ramsey’s (and Dr Jull’s) defensiveness significant. But again, I repeat, that I am NOT alleging that the late Art Hatheway (or Prof. Ramsey) was one of the hackers. All I am seeking to establish is that the C 14 labs’ AMS control console computers were PROGRAMMABLE. And therefore HACKABLE!.","date":"2014-03-30","mins":"9:23 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-95003","author":"stephen_e_jones","post":"Dan >I don’t think the personal attacks are incessant, as you say. As the person at the receiving end of it them, they are. I have already unsubscribed from receiving both posts and comments on your blog, and if the personal attacks on me continue here for much longer, I am not going to read the comments on your blog. If you continue to allow personal attacks on your blog, you will continue to drive away its polite members and all you will be left with are the impolite ones, who cannot make their points without insults. The choice is yours. Stephen E. Jones.","date":"2014-03-30","mins":"6:28 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-95104","author":"stephen_e_jones","post":"I decided to Google the name which was after Art Hatheway’s on Prof. Harry Grove’s list of those present at the Arizona lab’s 6 May 1988 dating of the Shroud. It was “T. W. Linick”. I found out his name was “Timothy W. Linick”. I then discovered that he died on June 4, 1989, aged 42, a few months after the Nature paper to which he was a signatory appeared, on February 16 of that year. Moreover, it was rumoured that Linick committed suicide. It may be significant that Karl Koch, a self confessed (after was caught) hacker who had worked for the KGB, died on May 23, 1989, less than 2 weeks earlier than Linick, in what appeared to be an execution designed to look like suicide. I Googled the names of other signatories to the 1988 Nature paper but found no other untimely deaths. However, as the Wikipedia article on Karl Koch notes, Koch’s fellow hackers Pengo (Hans Heinrich Hübner), and Urmel (Markus Hess) also confessed that they had worked for the KGB but were not eliminated. While I do not claim that Timothy W. Linick WAS a hacker, nor that his untimely death WAS suicide, let alone an execution by the KGB designed to look like suicide, it nevertheless is worth keeping in mind as a possible piece of the jigsaw. This will no doubt be dismissed as a “conspiracy theory” by those who prefer mindless slogans to thinking. But it is a FACT that the KGB did CONSPIRE with hackers, notably Karl Koch, of whose death Wikipedia notes that, “there is little evidence supporting suicide and many believe that Koch was killed in order to keep him from confessing more to the authorities”. And it is a FACT that the KGB did CONSPIRE with hacker Markus Hess whom Clifford Stoll caught..","date":"2014-03-31","mins":"2:24 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-95115","author":"stephen_e_jones","post":"Dan When I posted the above comment, I received for the first time (from memory) the message: “Your comment is awaiting moderation,” Is this a new policy of yours that ALL comments are going to be moderated? If so, I applaud it. But if it is a retaliation by you against me, because I warned you that if the personal attacks against me continued on your blog, I would cease reading and commenting on it, then this will have been my last comment on your blog (assuming you post it). Stephen E. Jones.","date":"2014-03-31","mins":"3:10 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-95142","author":"stephen_e_jones","post":">The reason you received the message is because your posting contained more than three outbound links. Thanks for the clarification. I was not aware of the 3 outbound links limitation, but I will in future keep such links to 3 or less. >Everything said or written about the shroud should be subject to scrutiny. I agree about “scrutiny” but I don’t agree that it includes defamatory imputations. I stand by what I said that if you continue to allow me to be defamed on your blog, by those who don’t like their position being subject to scrutiny, without lifting a finger to protect me, then I will no longer read the comments on your blog, nor comment on it..","date":"2014-03-31","mins":"5:32 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-95175","author":"stephen_e_jones","post":"I have discovered what make and probably the model of the AMS control console computer was. On Googling “Linick Arizona computer” (without the quotes) I found the paper, Linick, T.W., et al. 1986, “Operation of the NSF Arizona accelerator facility for radioisotope analysis and results from selected collaborative research projects,” Radiocarbon, Vol. 28, No. 2a, pp.522 533. In it the late Dr Linick, described the computerised process that Prof. Gove wrote of Arizona lab’s AMS control console computer, and wrote that it is a “DEC computer system”: “The DEC computer system largely controls the cycling of isotopes, accumulation of data, and calculation of results for each 15 minute run.” “DEC” stands for Digital Equipment Corporation, the maker of the powerful PDP and VAX range of minicomputer which were very popular in laboratories in the 1980s. However I have been unable to discover what model it was, e,g. PDP 11, VAX 11, etc. Googling “DEC” and then selecting “images,” the Arizona Labs AMS control console computer in the photo on page 176 H of Prof. Gove’s book (see my latest post), looks like a DEC VT 100 terminal. If that is so, and given that Arizona’s AMS system was installed in 1981, its AMS control console computer was probably a 32 bit VAX 11: “In 1976, DEC decided to extend the PDP 11 architecture to 32 bits while adding a complete virtual memory system to the simple paging and memory protection of the PDP 11. The result was the VAX architecture, where VAX stands for Virtual Address e Xtension (from 16 to 32 bits). The first computer to use a VAX CPU was the VAX 11/780, which DEC referred to as a superminicomputer. Although it was not the first 32 bit minicomputer, the VAX 11/780’s combination of features, price, and marketing almost immediately propelled it to a leadership position in the market after it was released in 1978. VAX systems were so successful that in 1983, DEC canceled its Jupiter project, which had been intended to build a successor to the PDP 10 mainframe, and instead focused on promoting the VAX as the single computer architecture for the company.” (“Digital Equipment Corporation: VAX,” Wikipedia, 10 March 2014). Supporting the VAX’s success was the VT52, one of the most successful smart terminals. Building on earlier less successful models (the VT05 and VT50), the VT52 was the first terminal that did everything one might want in a single chassis. The VT52 was followed by the even more successful VT100 and its follow ons, making DEC one of the largest terminal vendors in the industry. With the VT series, DEC could now offer a complete top to bottom system from computer to all peripherals, which formerly required collecting the required devices from different suppliers. Whatever DEC computer system it was, whether a PDP or VAX, it CERTAINLY was programmable and therefore HACKABLE!.","date":"2014-03-31","mins":"8:10 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-95180","author":"stephen_e_jones","post":"Dan, after I posted the above (with its 6 outside links) I realised that the text beginning with “Supporting the VAX’s success … ” should have been after “for the company” and inside the Wikipedia article reference, If you delete it, and this brief message, I will post it again with the error corrected..","date":"2014-03-31","mins":"8:25 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-95188","author":"stephen_e_jones","post":"I should have added, “my apologies”. Delete this also if you delete my other two comments..","date":"2014-03-31","mins":"8:38 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-94724","author":"stephen_e_jones","post":">Darn. Stephen left out two of my favorite historical items: 1) The Hymn of the Pearl and 2) The Mozarabic Rite. They are coming. The Hymn of the Pearl is 2nd century and the Mozarabic Rite is 6th century. As my Revised #1 post indicated, I am going to list all the “historical evidence that the Shroud existed in the thirteenth century all the way back to the first century:” My first step is to show beyond any reasonable doubt that the Shroud existed well beyond the lower limit of the C 14 dating’s lower limit of 1260, and therefore the C 14 dating was wrong. My second step is to show that the odds are astronomical for the Shroud to be 1st century, yet C 14 date to 1325 +/ 65, and therefore there must have been fraud involved for the Shroud’s C 14 date to not just be any old date, but the too good to be true date ~25 years before the Shroud’s historical debut at Lirey, France in the 1350s. My last step will be to lay out the case for the fraud to have been perpetrated, not by the labs, but by a computer hacker, or hackers, physically accessing each AMS control console computer in the three university C 14 labs at Arizona, Zurich and Oxford, and modifying each computer’s program which received output of raw uncalibrated C 14 dates from each lab’s AMS system and replaced the Shroud’s dates with dates, which when when calibrated, would cluster around 1325 +/ 65. My prime suspect is the KGB employing as agents a ring of hackers, inside or outside the three universities, since the KGB has a proven track record of using at least one such ring of hackers, the Chaos Computer Club. The USSR in the late 1980s was facing the threat of breaking up (the Berlin Wall came down in late 1989). So with its atheist ideology and huge Russian Orthodox and Roman Catholic populations, the USSR would have felt very threatened by the prospect of a 1st or early century date of the Shroud. So even though it did not believe the Shroud to be authentic, it would have wanted to `take out insurance’ that the Shroud did not return a first or early century C 14 date. But as the school year has begun, I am again working part time as a high school relief teacher. So my time is limited, and it is going to take many months to get to the end of this multi part series. However, unlike Dan, I am in no hurry. I am enjoying filling in the gaps in my knowledge of the historical evidence for the Shroud’s existence back to the 1st century..","date":"2014-03-29","mins":"7:57 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-966","author":"stephen_e_jones","post":"Coincidentally, I re read this letter to NATURE (17 October 1991, p.598) only yesterday in going through some of my science journal articles on the Shroud. According to Wikipedia, Cesare Emiliani (1922 1995) was “one of the greatest geologists and micropaleontologists of the 20th century and the founder of paleoceanography … a Renaissance man, familiar with classical literature, fluent in many languages, and a valiant opponent of dogmatic attitudes and mental rigidity wherever found. In his later years he dedicated much time to introduce a calendar reform based on the Holocene calendar (HE) concept to eliminate the BC AD chronology gap caused by the lack of a Year Zero.” Emiliani’s eminence may be why NATURE published such a strange letter. Emiliani’s opening comment in his letter was: “Pierre Busson laments the various problems arising from the radiocarbon dating of the Shroud of Turin. As I see it, there is only one problem: the dating itself. The Shroud of Turin is a religious object and, as such, it should never have been subjected to scientific scrutiny.” That Science Religion (Gnostic?) ultimate duality is very common in the USA and is supported by the US Supreme Court’s extreme separation of Church and State doctrine. It is a major defensive weapon of the Naturalist (“nature is all there is”) side in the USA’s Creation Evolution struggle and tellingly Emiliani refers to “Creationists” being “even more guilty, for they have been mixing science and religion for years …” That Science Religion duality is also, in my opinion, a major (albeit largely unrecognised) theme in the Shroud debate, with even some leading Shroud pro authenticity advocates claiming that science can never prove the Shroud to be the burial sheet of Jesus. Yet every day individuals are imprisoned and even executed on far less Forensic Science evidence pointing uniquely to them, than the evidence of the Shroud points uniquely to Jesus. We are all blind to some extent to our motives (Ps 19:12; Jer 17:9), but many (if not most) scientists in particular don’t seem to even realise the possibility that their attempts to isolate “religion” from the real world of science is actually a subconscious attempt to isolate the Christian God (who they intuitively know exists – Rom 1:18 20) from their guilty conscience. In the light of his comments in his NATURE letter, Emiliani’s crusade to “eliminate … BC AD” from the calendar seems to be just another such attempt to cover himself with a “fig leaf” from the all seeing eye of His Creator (Gen 3:7) by writing Jesus out of the Play that He Himself wrote, starred in, and directs! Stephen.","date":"2010-01-28","mins":"8:49 pm","url":"https://shroudstory.com/2010/01/28/strangest-quote-ever-on-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Strangest Quote Ever on the Shroud of Turin"},{"id":"comment-94824","author":"stephen_e_jones","post":">you should at least have the moral decency Ad hominem noted. >to contact the labs and ask them their opinion before exposing your theory. Hugh Farey has already emailed Arizona’s Dr Jull and Oxford’s Prof. Ramsey for their response to my proposal and they have, not surprisingly, rejected it, albeit with fallacious reasoning and false facts. See my post, “Were the radiocarbon dating laboratories duped by a computer hacker?: My replies to Dr. Timothy Jull and Prof. Christopher Ramsey“. But they would do that even if my proposal was true, that the labs UNKNOWINGLY were victims of computer hacker(s) in their 1988 C 14 dating of the Shroud. My proposal is NOT that the labs KNOW that they were victims of a computer hacking and I said in one of my comments here that they would probably be unaware of it to this day and therefore would not welcome the thought that after all these years their 1260 1390 C 14 date of the Shroud was the result of them having been hacked. So I am NOT accusing the C 14 labs of fraud. My proposal is that they were the VICTIMS of fraud, committed by a computer hacker or hackers. When I have finished my multi part series, “Were the radiocarbon dating laboratories duped by a computer hacker?: Revised,” I will have more evidence to support my proposal, when I may then call it a theory. If and when that point is reached, I have not ruled out that I may formally submit my then theory to the Directors of each of the three laboratories for their comments. But even then, I expect they would reject my then theory, even if it was true. It would be a HUGE embarrassment if the C 14 labs had been hacked in their dating of the Shroud and so they would have a strong motivation to deny it and would be unlikely to cooperate with requests for information to support my proposal. So all that I can do is set out the evidence for my proposal and hope that someone who was involved in, or aware of, the hackings would come forward and confirm that my proposal was true..","date":"2014-03-30","mins":"3:46 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-88690","author":"stephen_e_jones","post":"I had already thought of the problems that Dan raised and I will address them in my revised proposal. But I had already stated that I had accepted Prof. Ramsey’s unambiguous statement that the AMS control console computers were never online, so Dan’s going on about Arpanet is irrelevant. And I had already stated before Dr. Jull’s and Prof. Ramsey’s emails that an alternative is that the hacker could have hacked into each of the three C 14 laboratories locally. It is interesting that the `open minds’ on Dan’s blog have already dismissed my revised proposal as “science fiction,” “nonsense,” and “wrong”, without even waiting to see it. They thereby show that their minds are closed and NOTHING I say will ever satisfy them, so I won’t even bother. I have no problem admitting I am wrong, when I AM wrong! But no one on this blog has shown that I am wrong. They mistake personal attacks for arguments. But I take such personal attacks as confirmation that my opponents don’t have any good arguments against my proposal, otherwise they would use them. And again I thank Dan for the free publicity, and for his hacker posing as a technician idea, and Hugh for advising Dr. Jull and Prof. Ramsey of my proposal!.","date":"2014-03-14","mins":"8:38 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"id":"comment-1261","author":"stephen_e_jones","post":">Emilani was a respected scientist … he pulls the strings of religion fundamentalists who ridiculously believe that a painted cloth woven in the middle age was the shroud of Christ. There are irreligious fundamentalists too. The late paleontologist Stephen Jay Gould famously included biologist Richard Dawkins in the category of “Darwinian Fundamentalism” in the June 12, 1997 issue of The New York Review of Books. But because Naturalism, the philosophy that “nature is all there is” (“Naturalism (philosophy),” Wikipedia, 14 April 2010) (i.e. There is no supernatural, including God), so dominates science and our science based culture generally, it is invisible to those whose minds have been fully taken captive by it (Col 2:8). To Metaphysical Naturalists, it is simply “ridiculous” that the Shroud of Turin even could be the burial sheet of Christ, because that would imply that there is a God who can and does supernaturally intervene in the world, and to whom they might be accountable. Since Naturalism is unquestionably true for fully committed Naturalists, they cannot accept that there even could be evidence, let alone seriously consider it, that the Shroud is the burial sheet of Jesus, if that implies that the Gospels are true and that He rose from the dead. It is sufficient therefore for Naturalists to accept the best (or least worst) Naturalistic explanation of the Shroud’s image (e.g. It is just a medieval forgery, etc), combined with personally attacking (e.g. As “religious fundamentalists,” etc) those of us whose minds have not been captured by Naturalism, and can and do accept the evidence which overwhelmingly points to the Shroud of Turin being the very burial sheet of Jesus and bearing the image of His crucified and resurrected body! Stephen.","date":"2010-04-16","mins":"7:18 pm","url":"https://shroudstory.com/2010/01/28/strangest-quote-ever-on-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Strangest Quote Ever on the Shroud of Turin"},{"id":"comment-89990","author":"stephen_e_jones","post":">David Goulet … >Even if we concede that the KGB of that era, under an atheist Soviet system, had motive to perpetrate this conspiracy, Dan has posted (Google: “They don’t do it just for the credit card numbers”) that Shroud.com, a website ABOUT the Shroud was sufficiently an “affront” to “atheists” that hackers would be motivated to destroy it. But HOW MUCH MORE would a first or early century date of the SHROUD be an affront to the atheistic Soviet Union in the 1980s that it, through its `dirty tricks’ agency, the KGB, would be motivated to ensure that the Shroud did not return a 1st century or early C14 date? >why have none of these conspirators since revealed what happened. They may yet. I have previously posted to the effect, that now my proposal is in the public domain, one of the hackers, an ex KGB agent, or someone else, who knows what happened, may confirm my proposal. But fear of KGB retaliation: “Koch was loosely affiliated with the Chaos Computer Club. He … was involved in selling hacked information from United States military computers to the KGB. … Koch was found BURNED TO DEATH with gasoline in a forest near Celle, Germany. The death was officially claimed to be a suicide. However … there is little evidence supporting suicide and many believe that Koch was KILLED IN ORDER TO KEEP HIM FROM CONFESSING MORE TO THE AUTHORITIES.” (“Karl Koch,” Wikipedia); or fear of prosecution, and also that the hacker(s) likely believe that Shroud is a fake, might prevent anyone blowing the whistle. >… What motivation is there to keeping up the game of the rigged dates via hacking? PLENTY! See above. Last time I checked the ex head of the KGB, Vladimir Putin, is the President of Russia. And how many hackers have VOLUNTARILY admitted their past hacking? Not many, if any. >To be honest, Stephen, I feel you truly believe there was a conspiracy between the labs themselves to present a medieval date. No. While I firmly believe that there HAD to be fraud of some kind to convert a 1st (or early) century date of the Shroud to the `too good to be true’ 1325 +/ 65 C14 date, the worst that I have suggested is that the labs may have been guilty of low level fraud: “… making results appear just a little crisper or more definitive than they really are, or selecting just the `best’ data for publication and ignoring those that don’t fit …” (Broad & Wade, 1982, p.20) and that is still my fall back position. But bearing in mind Ian Wilson’s view, from knowing the lab leaders personally, that they were basically honest and would not have “rigged” the result, I wanted to explore a way that there could have been fraud in the C14 dating, but by a hacker, not by the labs. >But prudence, lack of evidence or legal fear prevents you from outright accusing them of fraud, therefore you are using this hacking theory as the thin edge of the wedge. No. As far as I am aware, there would be no possibility of legal action against me if I accused `the C14 laboratories’ of fraud, but only if I accused individuals BY NAME in the laboratories of fraud. My only reason for not accusing outright the C14 laboratories of fraud is that I don’t believe that there was fraud by the laboratories, unless it was the above low level fraud. >There are lots of clues and oddities in the whole C14 business that do raise some question marks but what no one has presented yet is hard evidence of any date fudging or sample switching. I have been presenting the evidence for my proposal and taken on board what evidence there is against it. But in the nature of the case, being secret hacking carried out 26 years ago, it is only circumstantial evidence. If a hacker or KGB agent confessed to the hacking would that be “hard evidence”. But there are other forms of hard “evidence.” If a member of the C14 labs admitted that a hacker COULD have done what I have described. Dr Jull and Prof. Ramsey have not done that. Indeed, Prof. Ramsey’s, “This would seem to be a suggestion from someone [me] who does not know what computers were like in the 1980s” is not only over defensive, it is actually FALSE. As I pointed out, I know VERY WELL “what what computers were like in the 1980s”: “… I was one of the first to have a personal computer in 1980. I pioneered the introduction of computers into Health Department of WA hospitals in the mid to late 1980s and in the late 1980s/early 1990s, I was the Systems Administrator of a network of 7 hospitals’ UNIX systems.” Prof. Ramsey’s too defensive and FALSE over reaction, makes me suspicious that he may think that I have a point, which he doesn’t want to face up to. Best of all would be to find the hacker’s code on at least one of the original AMS control console computers. But although Arizona’s AMS system which did the 1988 is still operational (Google: “Arizona AMS 1981 operational”), I doubt that it is still there, with its original software, or at the other two labs. But even if at least one of the original AMS control console computers is still there, complete with what looks like the original software but no hacker’s code, that would not disconfirm my proposal, because the KGB would likely have insisted the hacker remove his code when he had finished, as KGB agent Markus Hess removed evidence of his hacking. >A single whistleblower, or late confession, or damning email would go a long way to exposing the crime. Agreed. See above. That may yet happen. It is early days. >Until then they are just theories, conspiracy theories, and accordingly given the gravity they warrant. I don’t claim my proposal has yet reached the level of a theory. But as for the pejorative term “conspiracy theory,” which is designed to “poison the well” against me personally: “Poisoning the well … is a rhetorical device where adverse information about a target is pre emptively presented to an audience, with the intention of discrediting or ridiculing everything that the target person is about to say.” (Wikipedia). To discredit me personally in the minds of readers so they won’t accept my proposal: My proposal indeed is that the KGB CONSPIRED with a hacker or hackers to ensure that the Shroud returned a 14th century C14 date. There is abundant evidence that the KGB did conspire with hackers (Google “Chaos Computer Club” and also “Cyberpunk Hafner”). But if it makes you and your ilk feel better, denigrating my proposal as a “conspiracy theory” and me personally as a “conspiracy theorist,” then be my guest..","date":"2014-03-17","mins":"8:02 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"id":"comment-6539","author":"stephen_e_jones","post":">Ramey’s … showed himself to be completely openminded in taking on the lab work involved in checking out the carbon monoxide hypothesis As I pointed out previously, Jackson’s carbon monoxide hypothesis would be an honourable way out for all three labs. That is, the Shroud sample they had did actually date to about ~AD1350 due to a then unknown contaminant: new carbon in the form of carbon monoxide. But to admit that what the three labs tested was actually a “medieval repair,” not the Shroud itelf, would not be an honourable way out because it would make the labs look like fools, i.e. They did not even realise, or consider, that they were dating a mediaeval patch. Also, since Oxford actually discovered the cotton, it would have even less excuse for not realising that what they had was a medieval patch, not the Shroud itself..","date":"2012-01-04","mins":"10:54 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","title":"What did Christopher Ramsey Know"},{"id":"comment-89634","author":"stephen_e_jones","post":">Stephen, in 1988, no one even knew what the internet, or a computer virus, or hacking was. How old are you Gerard? I am 67 and I have lived through the pre Internet, Internet, and pre Web eras. I caught my first computer virus, the Stoned Virus in 1987. Google ” Stoned Virus”. The hacker who Clifford Stoll caught, Markus Hess, hacked into 400 US military computers in 1986. Google “Clifford Stoll.” Hess was a member of a group of Hackers called the “Chaos Computing Club, “founded in Berlin on September 12, 1981.” (“Chaos Computing Club,” Wikipedia). So it is not ME who is writing “nonsense”! I have already stated here, following Dr. Jull and Prof. Ramsey’s confirmation that the AMS control console computers (at least at Arizona and Oxford) were never online, that my proposal now is the alternative (which I had mentioned before their confirmation) that the hacker or hacker’s inserted a new program, or more likely modified the existing one, at each of the three laboratories. Each of which had the same AMS C 14 dating system. The whole point of Clifford Stoll’s book, the “Cuckoo’s Egg” (read it) is that in the 1980, all universities both physically and computer wise, lacked security. Stoll did his Ph D at the University of Arizona, so he would especially have had that university in mind. The C 14 tests were weeks and even months apart in 1988: Arizona (May 6), Zurich (May 26) and Oxford (August 8). It would not have been difficult for a hacker, or hackers, to before each test, gain access to the AMS control console computers at each of the three labs and modify the program which received inputs from the AMS system, converted it into raw uncalibrated years and displayed those years on the control console computer’s screen. From the photo of Arizona’s AMS control console computer in Gove’s book, which I had already posted, it looks like a simple personal computer, such as a Tandy TRS 80, or similar. All such 1980s P Cs came with a simple programming language called BASIC, which I used to write programs in. The Shroud samples would have to have had a unique identifying code (otherwise the labs would not know which dates applied to the Shroud), so it would be easy for a hacker to modify the program (especially if it was written in BASIC) so that if the data was coming from the Shroud samples, whatever their dates were, to replace those dates with dates, which when calibrated, clustered around 1325, just before the Shroud’s known historical debut in the 1350s. The KGB had already recruited and paid hackers before 1988. For example Markus Hess in 1986 and other members of the Chaos Computer Club (Google “Karl Koch”). But they were only the KGB’s hackers WHO WERE CAUGHT. There is no reason why there could not have been other hackers, recruited and paid by the KGB, who were NOT CAUGHT. And there is no reason why some those not caught hackers were not paid by the KGB to ensure the Shroud C 14 dated to just before the 1350. I will develop these points in my next posts in this series: “Were the radiocarbon dating laboratories duped by a computer hacker?: Revised.","date":"2014-03-16","mins":"12:25 pm","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"id":"comment-6537","author":"stephen_e_jones","post":"Prof. Christopher Ramsey Bronk, aka “C.R. Bronk,” the first mentioned name from Oxford in the 1989 Nature article declaring that “The age of the shroud is obtained as AD 1260 1390” (AD1325 +/ 65 years) and therefore “the linen of the Shroud of Turin is mediaeval.” That presumably means that he was the scientist at Oxford who actually did the test. If so he must have known that the Shroud samples contained cotton that was “possibly of Egyptian origin and quite old.” But the other two labs, Tucson and Zurich had already run their tests 2 3 months previously, and had arrived at a date of about AD1350. The three AMS labs would normally be in regular contact with each other so it beggars belief that the labs did not share their results of their dating of the Shroud. Anyway, there is evidence that they did. Ramsey would then have had a dilemma: 1. He knew that the other two labs which had already dated their samples at ~AD1350 had not discovered the cotton (they hadn’t), so their dates would have included the cotton. 2. So if Oxford removed the cotton from its sample, then Oxford’s date could not have been the same consensus ~AD1350 date as the other two. 3. If the cotton was “of Egyptian origin and quite old” and was not removed, it would have made their Shroud sample appear to be much older than ~AD1350. There seems to be only one honourable way out of Ramsey’s dilemma and that is if both the cotton and the Shroud sample were about the same ~AD1350 age. But then why would the cotton appear to be “yellow … possibly of Egyptian origin and quite old” even under a 200 X microscope if it was in reality the same ~AD1350 age of the Shroud linen sample? The only answer seems to be that the cotton was dyed yellow to make it look like the linen. And it took it being “magnified 200 times under a microscope” to discover that it was cotton. But this is precisely what the “medieval repair” or Benford Marino “Reweaving Theory” maintains. That the tiny 1.2 x 0.8 cm sample that the three labs were given from the same area of the Shroud and then divided equally amongst themselves for dating, was not part of the Shroud itself, but was actually a medieval patch added to the Shroud for repairs, using cotton dyed to make it look invisible to the naked eye against the background of the yellow linen. So if Ramsey continues to maintain “the suggestions of … medieval repair were unlikely” then he has no honourable way to explain how the other two labs arrived at an ~AD1350 date, even though their sample included what appeared to be old Egyptian cotton; and his Oxford lab arrived at the same date with the same cotton removed. Unless Oxford deliberately re ran its test on a sub sample with the cotton included so as to make it appear to agree with the other two labs. Or if Ramsey claims the cotton was not old, then he needs to explain: 1. How old was it? And 2. Why did it look old and yellow, even under a 200 X microscope..","date":"2012-01-04","mins":"10:37 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","title":"What did Christopher Ramsey Know"},{"id":"comment-6556","author":"stephen_e_jones","post":">I remain open minded about the reweave theory. What we all have to live with is the fact that the one person who should know, Ms Flury Lemburg, refuses to countenance it. Whether David intended “Ms Flury Lemburg … refuses to countenance it” literally, it does seem to be the impression created by Mechthild Flury Lemberg rejection of Benford and Marino’s invisible reweaving theory, backed up as it is with a wealth of scientific evidence. According to Joe Marino (private email), Flury Lemberg’s main objection to the reweave theory is that such invisible weaving would be visible on the reverse side, and she had not personally seen it when she examined the Shroud (see her “The Invisible Mending of the Shroud in Theory and Reality,” BSTS Newsletter No. 65, June 2007). But as Benford and Marino pointed out in their paper, “Discrepancies in the radiocarbon dating area of the Turin shroud,” Chemistry Today, July August 2008, medieval reweaving could be made to be invisble on both sides: “Historical evidence demonstrates that it was not only possible for medieval weavers and embroiderers to invisibly mend textiles such that they were not top side detectable, but it is also recognized that they could choose whether or not to permit their handiwork from being detected on the back side as well. `Historically, reweaving was not carried out through a support fabric and was often executed so skilfully that it is not always recognizable as a later addition, although differences in the rate of dye fading have often revealed its presence. Evidence of reweaving would now (16th Century) usually be left deliberately visible on the reverse of the tapestry by the presence of the warp ends and knots’ [F. Lennard, M. Hayward, Tapestry Conservation: Principles and Practice. Burlington, Massachusetts: Butterworth Heinemann 16 (2006)] As this passage infers, skilful medieval weavers could choose whether or not to leave evidence of their work on the back side of a fabric. Although a less than conventional restoration practice, it is known that in early part of the 16th Century the art of `reversing’ was practiced such that tapestries could be viewed intact from either side of the cloth.” These very cotton fibres that Oxford discovered in their sample, yet Tucson and Zurich had not, and which required 200x magnification to determine that they were cotton, is itself evidence that just looking at the Shroud with the naked eye, may be not enough to detect expert medieval reweaving that is designed to not be visible to the naked eye..","date":"2012-01-05","mins":"1:33 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","title":"What did Christopher Ramsey Know"},{"id":"comment-6363","author":"stephen_e_jones","post":"First two corrections: “4 x 2 metre” should be “4 x 1 metre” or “4.4 x 1.1 metres.” And “Ramsay” should be “Ramsey” as mostly stated. I presume Ramsey’s real name is Christopher Ramsey Bronk, as per the Nature article and books on his web page (http://www.arch.ox.ac.uk/CBR.html), but he (understandably) prefers “Ramsey” to “Bronk”! It is also worth noting that his name appears on the 1989 Nature paper first of those from Oxford: “… C.R. Bronk,3 E. T. Hall,3 R. E. M. Hedges, 3 R. Housley,3 I. A. Law,3 C. Perry,3 … 3 – Research Laboratory for Archaeology and History of Art, University of Oxford, Oxford, OX1 3 QJ, UK …” That usually signifies that he actually did the experiment. Also, that Bronk/Ramsey was no mere bit player in the radiocarbon dating of the Shroud is evident that he is mentioned in Gove’s book on it as attending, as Oxford’s representative, an important meeting in Canada on 30 April 1987, of representatives of the five AMS radiocarbon laboratories who were originally proposed to carbon date the Shroud: “The people present at the Niagara on the Lake meeting were S L Brignall, Rochester, C R Bronk, Oxford, P E Damon, Arizona, D J Donahue, Arizona, J C Duplessy, Gif sur Yvette, H E Gove, Rochester and W Woelfli, ETH Zurich.” (Gove, H.E., 1996, “Relic, Icon or Hoax?: Carbon Dating the Turin Shroud,” p.188)..","date":"2011-12-30","mins":"11:19 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"}]
