[{"author":"stephen_e_jones","post":"The Deuce>It occurs to me that, while there is no contradiction between the Shroud and the Gospel accounts, the fact that so many people perceive such a conflict, by taking a naive reading of the Gospels as a fully exhaustive account, offers further evidence that the Pray Codex is based on the Shroud.This is a VERY good point. If the Pray Manuscript's \"The Entombment\" and \"Visit to the Sepulchre\" scenes, in Berkovits, 1969, plate III, were based on the gospels' descriptions of those events, then we would expect something like Caravaggio's \"The Entombment of Christ\" and Il Baciccio's \"The Three Marys at the Sepulchre.\" But these, while they are no doubt great works of old Christian art, have NO unique features in common with the Shroud as the Pray Manuscript has (e.g. The shroud is more than twice Jesus' length, L shaped `poker holes', herringbone weave, Jesus is nude, His hands are crossed in front of him, a bloodstain on Jesus forehead exactly where there is a \"reversed 3\" bloodstain on the Shroud, etc). >The Codex depicts a single long cloth under the body and wrapped (or about to be wrapped) over top of the head, like the Shroud. However, a naive reading of only the Gospels themselves, and taking the Gospel descriptions as an exhaustive description of the cloths, would tend to give a different impression. Agreed. There is nowhere near enough detail in the gospels for the Pray Manuscript artist to INDEPENDENTLY come up with depictions of Jesus' entombment and of the visit of the women to the empty tomb, that by chance `just happens' to have the same unique features above which are also on the Shroud.>It seems very unlikely that the artist would have drawn the burial cloth the way he did based only on the Gospel accounts, without additional information to go on. Together with the naked body, crossed wrists, etc, we have good evidence that the additional information was the Shroud.Agreed. See above. Those who claim that the Pray Manuscript is not based on the Shroud would have to come up with a plausible explanation of how the Pray Codex (1192 95), the writing in which is in Old Hungarian, was unknown even in Hungary until Hungarian historian György Pray rediscovered it in 1770, `just happens' to have at least 12 unique features in common with the Shroud of Turin, when the latter, according to the 1988 radiocarbon dating, is no older than AD 1260.Stephen E. Jones.","date":"2012-07-19","mins":"11:06 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"stephen_e_jones","post":"Matt>I've been doing some research on Bela III, who was the King of Hungary from 1172 to 1196 (ie. During the creation of the Pray Manuscript)Agreed. See my comment under, \"`Or the artist of the fake shroud knew of the Pray Manuscript and incorporated these signs into his forgery?'\": De Wesselow, in discussing the Pray Manuscript, points out that \"King Bela III [of Hungary] ... Spent eight years as a young man in the imperial court at Constantinople\" and \"During his reign ... Cultural links between Hungary and the Byzantine capital were strong\" (p.178).According to Wikipedia, that must have been between 1164 72:\"Béla III (Hungarian: III. Béla, Croatian: Bela III., Slovak: Belo III) (c. 1148 – 23 April 1196) was King of Hungary and Croatia (1172–1196). [Reign 4 March 1172 – 23 April 1196. Coronation 13 January 1173] He was educated in the court of the Byzantine Emperor Manuel I [1118 80] who was planning to ensure his succession in the Byzantine Empire till the birth of his own son. ... In the beginning of 1166, Manuel I and Béla co chaired the synod of the Byzantine Church in Constantinople\" (\"Béla III of Hungary,\" Wikipedia, 28 May 2012),So I assume that the Pray Manuscript's drawings were probably commissioned by Manuel I as a gift to Bela III, upon his accession to the Hungarian throne, in 1172 73. >Interesting to read of his very strong connections with Constantinople (he was educated there, and married a Byzantium woman). He was in fact lined up to be Emperor, but this was changed when the Emperor finally had a son.Yes. It's not hard to imagine that allowing a Hungarian artist to depict the Shroud symbolically was an appropriate consolation gift from Manuel I to Bela III.Berkovitz (1969) noted that the Pray Manuscript drawings on her plates III & IV \"show close stylistic relationship to ... Some figures of the sculptor of Pecs known as the Master of the Nativity\" (p.20), who on p.18 she said sculpted \"the Sampson Scenes\" (1140 1150).\">Bela III fostered relations with Constantinople and \"invited religous orders and scholars from abroad to settle in the country\" (From \"The Church and Bela III of Hungary (1172 1196): the Role of Archbishop Likacs of Esztergom\")>This provides further backing for the claim that the images in the Pray Manuscript were influenced by a viewing of the Shroud in Constantinople. In fact, could the images have been drawn by one of the foreign scholars, perhaps from Constantinople? The fact that the Pray Manuscript is the first written Hungarian document supports the notion of a foreign creator or protagonist.Agreed.>I found Bela's history interesting, as I didn't know of the very strong Constantinople connection.See above for my previous comment on 31 May.There is more about Bela III in genealogist Noel Currer Briggs' \"The Holy Grail and the Shroud of Christ\" (1984), \"The Shroud and the Grail\" (1988), and \"Shroud Mafia\" (1995). I will scan any relevant information and post in a further comment.Stephen E. Jones Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. I reserve the right to respond to any comment as a separate blog post..","date":"2012-07-24","mins":"9:58 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"stephen_e_jones","post":">There is more about Bela III in genealogist Noel Currer Briggs' \"The Holy Grail and the Shroud of Christ\" (1984), \"The Shroud and the Grail\" (1988), and \"Shroud Mafia\" (1995). I will scan any relevant information and post in a further comment.I have checked all occurrences of \"Bela III, King of Hungary\" in Currer Brigg's last two books above, but there is nothing in them that is not in his first book. Therefore the following references are only to Currer Briggs, N., \"The Holy Grail and the Shroud of Christ\" (1984).King Bela III of Hungary's first wife was Agnes de Chatillon (p.72). Their daughter Mary Margaret married Byzantine Emperor Isaac Angelos in 1185 (p.60) and they had a son Kalojan (p.73).Bela III's second wife was Marguerite, daughter of Louis VII of France, and widow of Henry II of England's eldest son Henry Courtmantel (1155 ) (p.54). The reign of Bela III (1172 1196) was a glorious period in the history of Hungary (p.73). His family relations assured him a high place in the hierarchy of European monarchs (p.73). He would have been aware of the nature and extent of the collection of relics at Constantinople (p.73). During his reign French influence in Hungary reached its highest point.\" (pp.73 74).The widowed Mary Margaret married Boniface de Montferrat, a leader of the crusaders who sacked Constantinople in 1204 (p.72). He was given the Kingdom of Salonica, which included northern Greece (p.72). They left Constantinople in 1204 taking much of the imperial treasure with them, which may have included the Shroud (pp.72 73). They later had a son, Demetrios (p.73).The again widowed Mary Margaret married Nicholas de Saint Omer, a relative of Godfrey de Saint Omer, one of the founders of the Knights Templar (p.72). They had two sons, Bela and William de Saint Omer (p.73). Nicholas died in 1212 and in 1222, Mary Margaret was driven into exile with her sons, taking refuge in Hungary at the Court of her brother King Andrew II (p.73). He appointed her eldest son Kalojan the Duke of Sirmium (p.73).King Bela III's daughter, ex Empress Mary Margaret, provides the link between Constantinople, Hungary, the Templars [and France my addition]. If anyone had had an opportunity and the motive to take it, it was she. (p.80).Stephen E. Jones.","date":"2012-07-26","mins":"8:04 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"stephen_e_jones","post":"Flagrum3>To Matt's last comment on Bela III; This is a very important point, as it does create a strong connection between Hungary and Constantinople. Agreed.>It makes it quite possible that Bela III had seen the Shroud in Constantinople face to face, He almost certainly did. See above that from \"1166 ... Béla co chaired the synod of the Byzantine Church in Constantinople.\">or even stronger that the monk who drew the PM had also or had accompanied him there...There is no evidence that it was a \"monk who drew the PM\" or that the PM artists accompanied Bela III there. See above Berkovitz' point that the Pray Manuscript drawings \"show close stylistic relationship to ... Figures of the sculptor of Pecs known as the Master of the Nativity.\" It may be that \"the sculptor of Pecs\" was a monk but I know of no evidence of this. It seems more likely that Bela III (or Manuel I at Bela III's request) commissioned the Pray Mqnuscript's artist to come from Hungary to Constantinople to ink paint the PM's four drawings (Berkovitz, 1969, plates II, III (upper & lower) and IV).>making for a very plausibly connection...this would or could explain alot of the coincidences found on the PM to the Shroud.Agreed that since: 1. Bela III was Hungarian; 2. He was in Constantinople between ~1164 and 1172; 3. He was at one point the heir apparent to Manuel I the Byzantine Emperor; and 4. The Pray Manuscript is Hungarian; this adds to the already very high probability, bordering on certainty, that the at least 12 unique shared similarities between the Pray Manuscript and the Shroud are not mere coincidences, but are due to the artist who painted the Pray Manuscript having before him the Shroud as his model.[continued].","date":"2012-07-27","mins":"8:37 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"stephen_e_jones","post":"[continued]>... I'd like to go back to the Sakli fresco painting and my thoughts on it. I am in question to the circles having any relation to the 3 circles of the esophagus or to the poker holes on the Shroud.It's sarcophagus. An esophagus is the tube through which food passes from the mouth to the stomach!But I agree it is speculative that the pattern of 4 and 3 circles to the left and right of the Mandylion over the arch in the Sakli church, Goreme, Turkey represent the `poker holes' on the Mandylion/Shroud, yet nevertheless, in the absence of a more plausible explanation, I believe that they do. >Reason; there is no logic in it. If the artist was depicting the poker holes; W Hy not depict them exactly as are seen? and why 3 holes? Even with the faintest of the poker holes, atleast 4 burns can be seen and why angled? There IS logic in it. If the Mandylion' protective surround at that time had that pattern of 4 and 3 circles on it, then the Sakli fresco artist would have faithfully represented it. And then the logic of the Mandylion's protective surround having a pattern of 4 and 3 circles on it would be to symbolically represent all the patterns of the `poker holes' on the Shroud. Which, looking at them on Shroud Scope (Durante 2002 Vertical) the major holes are patterns of 4 and 3: * * * ** * * * * * * * * *Within the limited space between the Mandylion's border (and between the Sakli church's arch and ceiling), a pattern of 4 and 3 circles would be a reasonable artistic compromise to depict the poker holes on the Shroud.I also made the point in a comment under \"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\" that the Sakli church is in the centre of Turkey and it may have been important to depict the `poker holes' as a reminder to Christians of the triumph of the Shroud in over the Islamic `trial by fire' in AD 680.>...this theory also would propose the artist had seen the Shroud 'unfurled' and not folded as the Mandylion/Edessa cloth was described and known to exist. No. He may have only been faithfully depicting a pattern of circles on the Mandylion's protective surround, which in turn were based on the actual poker hole burns on the Shroud.>The link to the Constantine 3 holed esophagus in Jerusalem seems too far reaching. If so, then why the need or meaning to the four holes? Agreed that that may be an unnecessary refinement.>My thoughts are that the artist may have known that the Edessa cloth/Mandylion was actually a larger sindon (burial cloth) but had not neccesarily seen it as such, as it can be supposed most people would not have been able too, just a few of the higher clerics, nobles etc; but he was aware of it's distinctive folding. He did not even need to know or see that the Mandylion was the Shroud folded up.[continued].","date":"2012-07-27","mins":"11:57 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"stephen_e_jones","post":"[continued]>Hense the odd circle patterns of 3 on one side, four on the other along with the fold lines which can be viewed on either side of the painting, reminiscent of layers. This seems too far fetched to me. It is simpler that the pattern of 4 and 3 circles were on the Mandylion's surround and that they were traditionally known to represent poker hole burns on the cloth inside, from an Islamic `trial by fire' of the Shroud in 680.>I may be way off here on my proposition and Mr. Guscin did actually relate to me that the painted circles were common on many paintings, so unlikely they had much or the indepth meaning as I proposed....but for some reason I cannot agree and feel there is.Guscin may well be right. But I agree with you that there is a connection between the pattern of 4 and 3 circles on the Sakli church Mandylion and the pattern on 4 and three poker holes on the Shroud. My theory is that the former faithfully represent a pattern circles on the Mandylion's protective surround, which in turn was a symbolic depiction of the pattern of 4 and 3 main poker holes on the Shroud, within the limited space available.Stephen E. Jones.","date":"2012-07-27","mins":"12:00 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"stephen_e_jones","post":"Flagrum3>I find here in lies another issue over the discussion on the Shroud; Some people just not using any logic! Agreed! I am only a high school maths teacher but I thought that 1 + 1 = 2!>i.e; The poster who questions the authenticity of the Shroud due to misinterpretation of scripture.Some Christians (to whom the saying \"a little knowledge is a dangerous thing\" applies) think that they can resolve all Biblical issues using their English translation. As the old parishioner said to the young clergyman who wanted to introduce a newer translation: \"If the King James Version was good enough for St. Paul, young man, then it's good enough for me\"!But English Bible translations often mask nuances in the original language in the interests of English readability, popular appeal, tradition, etc. To find out what a particular original Greek or Hebrew word really means, one needs to consult Greek English or Hebrew English lexicons.But even checking in an English translation what the other gospels say about the same incident can reveal things aren't quite as simple as they appeared to be in only one gospel.And then there are those examples of one gospel mentioning one angel/demoniac/blind beggar and another gospel mentioning two angels/demoniacs/blind beggars. If a Christian throws out the shroud on the grounds that a gospel mentions two burial cloths, then to be consistent he/she should throw out the gospel(s) which mention only one angel/demoniac/blind beggar! Well meaning, devout, but ignorant Christians can, without realising it, be \"fighting against God,\" just as well meaning, devout, but ignorant Jews were in the first century (and still are today): Acts 5:34 39. \"But a Pharisee named Gamaliel, a teacher of the law, who was honored by all the people, stood up in the Sanhedrin and ... Addressed them: `Men of Israel, consider carefully what you intend to do to these men. ... I advise you: ... Let them go! For if their purpose or activity is of human origin, it will fail. But if it is from God, you will not be able to stop these men; you will only find yourselves fighting against God.'\">John never states the body was wrapped in Othonia (cloths plural), he only states he SAW the othonia (cloths plural) in the tomb. There is a huge difference between the two. When John mentions othonia, it could mean several things; The Shroud itself and bound by strip(s) (As hypothesized by Dr. Jackson) or there could have been more cloths involved lying there.I don't disagree. But in first century Jewish burials the minimum burial cloths were:1) the corpse's hands, feet and jaw were tied with linen bandages (Gk. Keiras as mentioned in Lazarus' burial in Jn 11:44) to keep them in place until rigor mortis set in. 2) Then the body was enfolded in a large linen sheet or sindon (Mt 27:59; Mk 15:46; Lk 23:53). Jewish corpses were not totally wrapped around with bandages or strips as Egyptian mummies were. But apparently sometimes a Jewish body was buried in his/her clothes, which may have been the case with Lazarus, since no sindon is mentioned and yet he would have been naked when he emerged from the tomb if he wasn't covered in a sheet or was in his clothes. We don't know what Lazarus died of, but if it was an infectious disease, it is more likely he would have been buried in his clothes to minimise the chance of catching the disease.[continued].","date":"2012-07-12","mins":"5:47 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"stephen_e_jones","post":"[continued]3) The facecloth (Gk. Soudarion), was a small cloth which was placed over the face of a person who had just died while he/she was being carried to the tomb. It had previously been thought that the jaw band was the soudarion, because it was \"around\" \" (Gk. Peri) Lazarus' head but \"upon\" (Gk. Epi) Jesus' head (Jn 11:44; 20:7). But watch the video \"Shroud Report Interview with Mark Guscin on the Sudarium of Oviedo\" to see what the soudarion really was and how it was used in the case of Jesus. As can be seen in the case of Jesus, the soudarion was evidently removed if the body was enfolded in a shroud, but in the case of those who were buried in their clothes, like Lazarus may have been, the soudarion may have been more elaborate (which is indicated by the different Gk prepositions) and left on, since otherwise there would have been nothing covering his face.All the above linen graveclothes were collectively referred to as othonia \"linen\" (plural).>It has been suggested another large cloth was (needed)or used, to actually carry Jesus from the cross to the tomb, and I think this is evident in that if the Shroud was used to carry the lord from the cross, it would be very evident on the Shroud itself, and it is definately not, meaning there could have been a number of other cloths in the tomb amongst the Sudarium and the Shroud...There could have been, but because of Judaism's law about a bleeding body must be buried with its lifeblood:\"Lazarus died a natural death. In accordance with normal Jewish practice he would have been washed, interred fully dressed in his Sabbath best, tied up with a few binding strips to keep his jaw and limbs suitably together, and provided with some kind of face cloth for screening purposes. Jesus, in contrast, died a very bloody death, and stark naked, his clothes having been removed from him at the time of his crucifixion. [Matthew 27:35, Mark 15:24, Luke 23:34, John 19:23] In his case Jewish law prescribed something very different. As has been carefully explained by Jewish born Victor Tunkel of the Faculty of Laws, Queen Mary College, University of London, the belief among the Pharisees of Jesus's time, shared by Jesus's own followers, was that everyone's body would be physically resurrected at the end of time. This meant that as far as humanly possible everything that formed part of that body, including particularly the life blood, should be buried with it. As expressed in the Jewish Code of Laws, `One who fell [e.g. In battle] and died instantly, if ... Blood flowed from the wound, and there is apprehension that the blood of the soul was absorbed in his clothes, he should not be cleansed.' ... In these circumstances, therefore, those preparing the dead person for burial had to wrap a `sheet which is called a sovev' straight over any clothes, however bloodstained. This sovev had to be an all enveloping cloth, that is a `single sheet ... Used to go right round' the entire body. Such a sovev readily corresponds to the `over the head' characteristics of Turin's Shroud.\" (Wilson, I., \"The Shroud,\" 2010, p.52)it is more likely that the Shroud did double duty in being used in carrying Jesus otherwise naked body to the tomb and then used to finally enfold Him with His life blood in the tomb.>So basically this argument is mute to the discussion of the authenticity of the Shroud.I would put it more strongly. It is both ILLOGICAL and WRONG to claim that there is any contradiction between \"Jesus was wrapped in linen cloths (plural) and had a separate cloth wrapped around his head\" and ONE of those \"linen cloths (plural)\" being a sindon the Shroud.Stephen E. Jones.","date":"2012-07-12","mins":"6:11 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"stephen_e_jones","post":"Matt>And the artist of the Pray Manuscript very cleverly reconciles these gospel differences in Plate III.Disagree that the Pray Codex artist is trying to reconcile gospel differences. As discussed in my post above, the major apparent differences between the gospel accounts of Jesus' resurrection is the number of angels/young men. But the Pray Codex does not attempt to reconcile this.As stated in my post above, the Pray Codex artist is only depicting the scene in Mk 16:1 6 where the three women (Mary Magdalene; Mary the mother of the James, and Salome) came to finish the anointing of the body of Jesus but were told by an angel that Jesus was not there and had risen.>As per John, he shows both the face cloth and the linen body cloth (Shroud).Disagree that this Pray Codex is \"as per John.\" The events being depicted in the lower scene of plate III (Berkovitz, 1969) are those in Mk 15:1 6 where Mary Magdalene, as one of the three women, is told by an angel that Jesus had risen.Mary Magdalene's account of this is briefly mentioned in Jn 20:1 2:\"1 Now on the first day of the week Mary Magdalene came to the tomb early, while it was still dark, and saw that the stone had been taken away from the tomb. 2 So she ran and went to Simon Peter and the other disciple, the one whom Jesus loved, and said to them, `They have taken the Lord out of the tomb, and we do not know where they have laid him.'\"But as can be seen John does not mention the other women or the angel. That there were other women with Mary Magdalene is not contradicted by John as he records her saying, \"WE do not know where they have laid him.\" But there is no mention of the discarded graveclothes in John's version of her account.In that part of John's account which does mention the discarded graveclothes, Jn 20:3 8:\"3 So Peter went out with the other disciple, and they were going toward the tomb. 4 Both of them were running together, but the other disciple outran Peter and reached the tomb first. 5 And stooping to look in, he saw the linen cloths lying there, but he did not go in. 6 Then Simon Peter came, following him, and went into the tomb. He saw the linen cloths [Gk. Othonia] lying there, 7 and the face cloth [Gk. Soudarion], which had been on Jesus' head, not lying with the linen cloths but folded up in a place by itself. 8 Then the other disciple, who had reached the tomb first, also went in, and he saw and believed;\"the women and angel are not mentioned, only Peter and John (\"the other disciple\").[continued].","date":"2012-07-19","mins":"10:40 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"stephen_e_jones","post":"[continued]>The face cloth or sudarium is the small bundled object, to the right of the angel's foot and the cross motifs. Freeman acknowledges this to be the sudarium. It is the right size to be the face cloth, and further support for it being this rather than the Shroud is provided by the symbolic connection depicted by the letter (alpha?) floating between the cross and Jesus's head behind the right arm of Mary.Agree that it is \"Jesus's head behind the right arm of Mary\" and as you rightly indicate \"the letter (alpha?)\" is ambiguous.But disagree with Freeman (and you) that:\"The most important point of all is that a blown up image shows that the sudarium is depicted as a separate piece of cloth and so the source seems, once again, to be the account in John's gospel where the sudarium is reported as lying separately.\" [pages 17 & 18]See previously that Freeman (and you) is simply WRONG that \"the source seems ... To be the account in John's gospel.\" And I have Berkovits, 1969, plate III, in front of me, and even under a magnifying glass there is NO \"small bundled object, to the right of the angel's foot and the cross motifs.\" In fact Freeman doesn't even say that, just vaguely that \"a blown up image shows that the sudarium is depicted as a separate piece of cloth,\" without stating where it is.And as previously stated the \"sudarium\" (Gk. Soudarion), and indeed the graveclothes, are not mentioned in Mk 15:1 6, the \"Visit to the Sepulchre\" by the three women.Even if he was trying to reconcile the scene in Mk 15:1 6, with the other gospel accounts of the discovery of the empty tomb, the 12th century Hungarian Pray Codex artist would be most unlikely to know what we know today, that the soudarion of Jn 20:7 is the Sudarium of Oviedo. That was in Spain, in a chest, in an obscure cathedral in an obscure town, Oviedo. And the Sudarium of Oviedo's connection with the Shroud was only rediscovered in the 1960s.If the artist was trying to depict the soudarion then it would be the strip of linen around the neck of the garment emerging from the empty sarcophagus. Until fairly recently, before the significance of the Sudarium of Oviedo became more widely realised in Shroud pro authenticity circles, it was wrongly assumed that the \"the face cloth [soudarion], which had been on Jesus' head\" in Jn 20:7 was a strip of linen which in Jewish burials was tied around the top of the head and the chin to keep the mouth from falling open until rigor mortis had set in.>Then the Shroud is the object beneath the face cloth, with the 4 poker holes, streaks of blood, and cross motifs symbolising the image of Jesus on the Shroud.Disagree. There is no \"face cloth\" depicted in the LOWER scene on plate III, unless it is the strip around the neck of the garment emerging from the sarcophagus. In the LOWER scenw of plate III, the Shroud is depicted as the sarcophagus, decorated with the \"4 poker holes, streaks of blood, and cross motifs\" and Jesus' face in profile near Mary Magdalene's right arm. The \"image of Jesus on the Shroud\" is depicted in the UPPER scene of plate III.Matt, as previously mentioned, we are going around in circles on this. I don't want to waste my time arguing the same point endlessly. Yet I feel I must counter what I consider to be wrong information posted on my blog. Therefore you have had your final comment under this post on this matter about the sudarium being depicted on the Pray Codex.If I feel I have to, to save me wasting my time on endless debates, I will reluctantly reestablish my policy that:\"Each individual will usually be allowed only one comment under each post. Since I no longer debate, any response by me will usually be only once to each individual under each post.\"Stephen E. Jones.","date":"2012-07-19","mins":"10:56 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"id":"comment-7937","author":"stephen_e_jones","post":">there is no clear proofs that the Shroud of Turin was really present anywhere. This is false, but it would take a huge amount of time and space for me to prove it, and even then I doubt that Yannick would accept it. It all depends on: 1) what Yannick has read; and 2) his personal standard of proof in each instance. As an example of 2), the late great liberal New Testament scholar Rudolf Bultmann claimed (from memory) that there were only 14 lines of the New Testament that tell us anything reliable about the Jesus of history. The Jesus Seminar scholars say much the same thing. And 1) highlights a major problem with the Internet. Anyone can say anything and if they sound authoritative enough, most readers don’t have the means to check it out in depth for themselves. In the end you have to read books and journal article on any topic to fully master it, just as you would have to if you were doing a university degree. When I did my Biology degree in 2000 04, the lecturers emphasised that Internet only articles (i.e. That were not copies of journals or books) were not acceptable as scholarly references for assignments and papers. For what its worth, I own and have mostly read about 120 books on the Shroud, not counting hundreds of articles. When I get to “4. History of the Shroud,” in my Power Point presentation based series “Shroud of Turin: Burial sheet of Jesus!” I will outline the historical evidence of the Shroud going back to the 1st century, with references, so readers can have some basis to make up their own minds..","date":"2012-02-04","mins":"8:33 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-7947","author":"stephen_e_jones","post":">>there is no clear proofs that the Shroud of Turin was really present anywhere. >This is false, but it would take a huge amount of time and space for me to prove it, and even then I doubt that Yannick would accept it. I later remembered that Ian Wilson had also presented empirical evidence that the Mandylion was the Shroud folded in eight (doubled over and then folded four times), with the top eighth being the face of the Shroud in landscape mode: “For me a crucial breakthrough in overcoming this objection surfaced in the 1960s, when I noticed how a sixth century Greek version of the Abgar story, the Acts of the Holy Apostle Thaddaeus’, describes the Edessa cloth as a tetradiplon. In all the corpus of Greek literature tetradiplon is an extremely rare word, and totally exclusive to the Edessa cloth. Yet, because it is a combination of two common words, tetra meaning `four’ and diplon meaning `two fold’ or `doubled’, its meaning is actually very clear: `doubled in four’, suggesting four times two folds. This immediately raised the thought: `What happens if you try giving the Shroud four times two folds?’ When I tried this, using a full length photograph of the Shroud, I was dumb founded by the result – as I continue to be today. There was the Shroud face, front facing and disembodied looking on a landscape aspect cloth, exactly as on the earliest artists’ copies of the cloth of Edessa. Whenever the Shroud is presented in this manner – and it is a very logical way to present and make manageable a 437 cm length of cloth – its nature as a `shroud’ is in fact subordinated to its rather more socially acceptable nature as a `portrait’. And historically such an arrangement finds ready support in the description of the Edessa cloth, on its arrival in Constantinople, as `fastened to a board and covered with the gold which is now to be seen’. It therefore readily explains the many centuries of silence about an image bearing `shroud’ as such. Furthermore, when the man of the Shroud’s eyes are viewed on the cloth itself, as the Edessans and Constantinopolitans might have viewed them, rather than on the photographic negative that we tend to be more familiar with today, they appear open and staring, just as if he was alive, thus readily corresponding to this aspect of the Abgar story. … Clearly a crucial component of this theory is that the Shroud should bear signs of its once having been folded, for some significant length of time, in the ‘doubled in four’ manner postulated. When the STURP team worked on it in 1978, at my urging they specifically included in their test programme raking light photography to show up as clearly as possible the innumerable ancient and not so ancient creases that criss cross its surface. When Dr John Jackson carefully analysed these creases to gauge whether there were any significant and long established fold marks consistent with the ‘doubled in four’ theory, he found that indeed they were there. He even found that the way they fell, with two particularly pronounced concentrations – one at the level of the topmost part of the back of the head, the other just below the crossed hands – indicated that the cloth had at one time been stored so that, if it was pulled upwards, the imprint of the man of the Shroud would appear to rise up from whatever casket in which it was stored.” (Wilson, I. & Schwortz, B., “The Turin Shroud: The Illustrated Evidence,” Michael O’Mara Books: London, 2000, pp.110 11). See also Dan’s: “Tetradiplon or Doubled in Fours” “The Definitive Shroud of Turin FAQ: Tetradiplon” “Shroud of Turin FAQ: Comment on Wikipedia Text” This is empirical proof beyond reasonable doubt that the Mandylion was the Shroud folded so that the face only is visible..","date":"2012-02-05","mins":"3:11 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"author":"stephen_e_jones","post":"Steve>I'm eagerly awaiting more in this series Thanks. So am I!Stephen E. Jones MY POLICIES Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Except that comments under my latest post can be on any Shroud related topic without being off topic. I normally allow only one comment per individual under each one of my posts..","date":"2016-01-27","mins":"12:53 PM","url":"http://theshroudofturin.blogspot.com/2016/01/chronology-of-turin-shroud-1st-century.html","title":"\nChronology of the Turin Shroud: AD 30\n"},{"author":"stephen_e_jones","post":"Anonymous>Hi Stephen,>I could not go on your cherished website this morning. Was there a temporary problem ?Not that I am aware of.>All the best>Patrick Thanks.Stephen E. Jones MY POLICIES. Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Except that comments under my latest post can be on any one Shroud related topic. To avoid time wasting debate I normally allow only one comment per individual under each one of my posts..","date":"2017-03-29","mins":"4:30 PM","url":"http://theshroudofturin.blogspot.com/2017/03/chronology-of-turin-shroud-ninth-century.html","title":"\nChronology of the Turin Shroud: Ninth century \n"},{"id":"comment-6920","author":"stephen_e_jones","post":">John 20:5 7 says “He bent over and looked in at the strips of linen lying there but did not go in. Then Simon Peter came along behind him and went straight into the tomb. He saw the strips of linen lying there, as well as the cloth that had been wrapped around Jesus’ head. The cloth was still lying in its place, separate from the linen.” John 20:5 7 does not say that. An ENGLISH TRANSLATION (NIV) of the Greek of John 20:5 7 says that. The old joke: “if the King James Version” was good enough for St Paul, it is good enough for me” applies. The point is that the New Testament is in Greek and if one wants to make an argument that is based on key words, as this one is (“strips of linen”), then one must find out what the original Greek means. My Interlinear Greek New Testament, renders it more literally: “5 and stooping sees lying the sheets [Gk. Othonia], not however he entered. 6 Comes therefore also Simon Peter following him, and entered into the tomb; and he beholds the sheets [othonia] lying, 7 and the kerchief [sudarion], which was on the head of him, not with the sheets [othonia] lying but apart having been wrapped up in.one place In this case the key word is othonia which is translated “strips of linen” in one English translations, e.g. NIV. But the word othonia is just the plural of othone] “linen cloth.” So the KJV is more accurate than the NIV, as it renders the word othonia as “linen clothes”: 5 And he stooping down, and looking in, saw the linen clothes lying; yet went he not in. 6 Then cometh Simon Peter following him, and went into the sepulchre, and seeth the linen clothes lie, 7 And the napkin, that was about his head, not lying with the linen clothes, but wrapped together in a place by itself. The English Standard Version (ESV), which is regarded as one of the more accurate modern translations, renders othonia as “linen clothes”: 5 And he stooping down, and looking in, saw the linen clothes lying; yet went he not in. 6 Then cometh Simon Peter following him, and went into the sepulchre, and seeth the linen clothes lie, 7 And the napkin, that was about his head, not lying with the linen clothes, but wrapped together in a place by itself. Also Lk 23:53 (NIV) refers to Jesus’ body being “wrapped … in linen cloth” (Gk. Sindon (singular) a linen sheet: 53 Then he took it down, wrapped it in linen cloth and placed it in a tomb cut in the rock, one in which no one had yet been laid. And Lk 24:12 (NIV) refers to the linen cloths [othonia] (plural), again wrongly translated “strips”: 12 Peter, however, got up and ran to the tomb. Bending over, he saw the strips of linen lying by themselves, and he went away, wondering to himself what had happened. So Luke sees no inconsistency between Jesus body being wrapped or enfolded in a large linen sheet [sindon] (singular) and Peter and John finding in Jesus’ empty tomb, “linen cloths” [othonia] (plural). Therefore, in Jn 20:5 7, John, like Luke, by othonia is referrring to the linen cloths (plural), which included the large linen sheet sindon, and the smaller bandages keiria (Jn 11:44) which in Jewish burials bound the hands, feet and jaw, fr example, in the case of the raising of Lazarus, which the NIV inconsistently translates this different Greek work also as “strips of linen”: Jn 11:44 The dead man came out, his hands and feet wrapped with strips of linen [keiria], and a cloth around his face [soudarion]. Jesus said to them, “Take off the grave clothes [keiria] and let him go. Putting it all together, what Peter and John saw in Jesus’ empty tomb, as described by John 20:5 7, was: 1. The linen cloths collectively: the Shroud [sindon] and bandages [keiria]; and 2. The “cloth that had been wrapped around Jesus’ head” [soudarion] in a separate place. This is fully consistent with the Shroud of Turin being included in the [othonia] “linen clothes” (KJV & ESV), “linen cloths” (RSV & NKJV), or “linen wrappings” (NASB & NLT), and the Sudarium of Oviedo being the “cloth [soudarion] around his face” (NIV) or “napkin, that was about his head” (ESV)..","date":"2012-01-13","mins":"9:05 am","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","title":"Have a think about it. Of linen strips and the Shroud of Turin."},{"author":"stephen_e_jones","post":"Dan>Stephen, you really should pay attention to my blog. If I read your blog (which I haven't since 8 May 2014), I would have to comment, and then on past experience I would be personally attacked with you not lifting a finger. No thanks!Besides, I barely have time to research and write my blog.>You are making many mistakes that could be corrected. That is your and Farey's opinions, which is not borne out below.>For instance, after I reposted your text on Montfort and Anthon, Hugh Farey posted the following comment. The same Hugh Farey who claims that the Shroud is a 14th century accident! He needs to remove the log in his own eye so that he can see clearly to take the speck out of my eye (Mt 7:3 5).>You might want to fix your posting. >>Considering this is attempt to produce a definitive Encyclopaedia of the Shroud, a worthy cause, it is a shame that it is illustrated by a map which is admittedly misleading in at least two respects, namely the Templar route to ‘Paris 1307′, which has apparently been discarded, and the position of “Montfort 1418″, which turns out to be in the wrong place. That's what I WROTE in my caption below the map! Wilson's map is still useful with those corrections I had flagged.>Jones thinks that the Shroud did spend some time in the marked Montfort, but in 1358 1359, after which it moved to Anthon. However he gives no reference for this. Wilson, for one, agrees with the Montfort en Auxois interim move between Lirey and Anthon after Geoffroy I's death in 1356. And that source is in my \"References.\">The root of the various discussions regarding the Shroud’s movement at this time seems to be M. Bergeret’s Ohio Conference paper on ‘Linceul de Turin – Le Trou Historique’ which says that the Shroud moved to Montfort in 1360. I will stick with 1358, which was the year of the attack on Troyes, only 12 miles away from Lirey. >and stayed there till 1389, He's wrong in my opinion, for that reason. In my references below, a number of sources (including Wilson) state that the Shroud was with Jeanne in Aymon's High Savoy domain from their marriage until Aymon's death in 1388. And that fits with the other evidence I cited.[continued].","date":"2015-02-18","mins":"12:36 AM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"[continued]>For the record , I'm just a peasant who believes in the authenticity of the shroud .There was a trap in that commenter's implication that people who are \"very intelligent and very cultured, say that the shroud [sic] is a medieval fake\" and therefore those who claim that the Shroud is authentic are not \"very intelligent and very cultured.\" I avoided that trap at the starts of my response above.Jesus made the point in His \"Parable of the Rich Young Ruler\" (Mt 19:16 30; Mk 10:17–31; Lk 18:18–30) that a major reason for rejecting Christianity is not being willing to give up one's \"great possessions.\" And the late, great, Christian evangelical apologist, Bernard L. Ramm (1916 1992), pointed out that they include \"intellectual riches\" (and \"cultural riches\" too), which are an obstacle to saving faith in Jesus:\"In the Gospels a very wealthy young man refused to make the motions of faith. He was intrigued by Jesus Christ, but when the issue became sharply one of Christ or his possessions, the tug of his possessions was the stronger, and sorrowfully he left Jesus Christ. He wanted religion without the motions of faith. It is not a rash presumption to believe that many scientists and educated men wish for peace of mind, relief from a guilty conscience, hope for the life to come, and the blessedness of faith in God. But they find themselves caught between their science and their religious hopes, unable to move. Being possessed of great intellectual riches which manage to come first in their sentiments, they leave Jesus Christ. Just as Jesus refused to pursue the rich young man and make other terms, so today we cannot lessen or cheapen or alter the terms of the gospel for our men of science. There is no other Saviour than Jesus Christ, and there is no other means of having Him than by the motions of repentance and faith. Therefore, if a scientist comes to God he must come in the same way as any other person comes to God. He must make the appropriate spiritual motions. He must repent; he must confess his sin to God; he must believe in Jesus Christ with all his heart.\" (Ramm, B.L., 1955, \"The Christian View of Science and Scripture,\" p.245).Jesus also added at the end of His parable above, that those who are prepared to give up their \"great possessions\" to gain Him, \"will receive a hundredfold\" in this life \"and will inherit eternal life\" as well! (Mt 19:29; Mk 10:28–30; Lk 18:28–30).Regards.Stephen E. Jones.","date":"2015-02-24","mins":"9:34 PM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"Hugh Farey is also a LIAR.On the International Skeptics Forum, in a thread, \"Miracle of the Shroud II: The Second Coming\" one \"hugh farey Critical Thinker\" wrote on 7th March 2015: Should you find yourself at http://theshroudofturin.blogspot.co.uk, you will find that your \"Possibly at least one of the lab techs at each of the three labs was a yeti/'Squatch/human hybrid, a sleeper agent put in place to protect the secret\" is seriously proposed by one Stephen E. Jones. As far as I know he is totally alone in this belief, but it's there none the less! Of course I wrote no such thing. In \"My theory that the radiocarbon dating laboratories were duped by a computer hacker\" I propose that: Arizona radiocarbon laboratory physicist Timothy W. Linick (1946 4 June 1989) was allegedly the primary hacker, who: 1) allegedly wrote and installed on Arizona radiocarbon dating laboratory's AMS computer a program which ensured that the Shroud of Turin samples' actual radiocarbon dates would be replaced by dates which, when calibrated, clustered around 1325; and 2) allegedly passed that program on to the KGB, for which he was allegedly working, to be installed by confessed KGB hacker Karl Koch (1965–3 June 1989) on the AMS computers at Zurich and Oxford radiocarbon dating laboratories ... You know your theory is standing up well when your opponents don't answer it fair and square, but resort to ad hominems, strawmen, and poisoning of the well, fallacies! Farey might be a teacher at a Roman Catholic school, but he evidently deceives himself that the commandment, \"You shall not bear false witness against your neighbour\" (Ex 20:16), and reaffirmed by Jesus (Mt 19:18; Mk 10:19; Lk 18:20), does not apply to him!Stephen E. Jones.","date":"2015-03-10","mins":"9:24 PM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"Hugh>Just read your latest Stephen. My response to your claim on the International Skeptics Forum, that I propose that \"one of the lab techs at each of the three labs was a yeti/'Squatch/human hybrid, a sleeper agent put in place to protect the secret ...\" This is a LIE. 1) I do not propose that \"one of the lab techs at each of the three labs,\" i.e. Were THREE lab techs who were hackers. I propose that only ONE of the lab techs, Timothy W. Linick was a hacker. 2) I do not propose that one lab tech was a \"yeti/'Squatch/human hybrid.\" I propose that the hacker was an ordinary human being, motivated by extreme ant authenticism and money. 3) I do not propose that Linick was \"a sleeper agent put in place.\" I propose that Linick approached the Soviets with an offer to guarantee the Shroud would return a date that was agreed with widely known predictions of Mc Crone and others that the Shroud would date around or before the 1350s. >Of course I was not referring to sasquatches or anything so ridiculous, They were your words. As they stand, they are a LIE. >but to the term \"sleeper agent\" which I take to mean somebody who was acting clandestinely to falsify the radiocarbon date, who was part of the team and who no one suspected. That is NOT what a \"sleeper agent\" is. \"A sleeper agent is A SPY WHO IS PLACED in a target country or organization, not to undertake an immediate mission, but rather to act as a potential asset if activated.\" (\"Sleeper agent,\" Wikipedia, 24 February 2015). Which is what you wrote, \"a sleeper agent PUT IN PLACE.\">This, as I understand it, describes your position perfectly. That is also a LIE. Far from describing my \"position perfectly,\" it is a STRAWMAN CARICATURE of my position. If you were interested in the truth, you would have correctly stated my position (see my previous comment above). >As far as I know you are totally alone in this belief. I am not \"totally alone in this belief\" as you FALSELY stated it. I don't even believe it.And I am NOT \"totally alone in\" in my theory that the 1325 +/ 65 radiocarbon date of the Shroud was a result of a computer hacking. At least two prominent Shroud pro authenticists have emailed me privately that my theory may well be true.And I am sure that some of the 60+ readers a day of my blog provisionally agree with my theory. But it is early days and they are understandably reluctant to publicly agree with it.Besides, as a science teacher you would be aware that many (if not most) major scientific theories, which are now accepted as true, were initially believed only by the proposer and vigorously attacked by the majority. What matters in science is not a popular vote of how many believe a theory but whether it FITS THE EVIDENCE better than any other theory. And my theory does that.[continued].","date":"2015-03-13","mins":"6:41 AM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"[continued]>If either of the above statements is wrong, I apologise, They ARE wrong (see above). And I don't accept your apology because I don't believe you mean it. But you should apologise to your fellow \"critical thinkers\" on the forum you made them, correctly stating my theory in my previous comment above.>but I was certainly not lying, nor setting up a strawman, nor poisoning your well.You WERE doing all three, Hugh. >I wish you could see that it is possible for someone to disagree with you without bearing any personal animosity, I would have no problem if you fairly stated my theory and then stated why you disagree with it.But as the one on the receiving end of it, you clearly bear me \"personal animosity.\">and I wish you well in all your Shroud endeavours.That is a LIE too. As I have said before, I follow the wise advice of one of my university lecturers: \"Don't believe what people SAY, believe only what they DO.\" And what you DO, Hugh, is oppose all my Shroud endeavours, even stooping to \"bearing false witness,\" i.e. LYING.One day soon you will need to give account to Jesus (Mt 16:27; 25:31 32; Ac 10:42; 2 Cor 5:10; 2 Tim 4:1, 1 Pet 4:5) for your evident animosity towards me and to His Shroud. Stephen E. Jones.","date":"2015-03-13","mins":"6:43 AM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":">for your evident animosity towards me and to His Shroud. That should be evident animosity towards Jesus' Shroud (Hugh believes it had \"an accidental 14th century origin\"!) and towards me, who only seeks to serve Jesus by presenting the evidence for His Shroud's authenticity.But ironically it may have backfired on Hugh. Early this month my blog's Sitemeter visits jumped from the 60s a day to over 100 a day. I thought it was the result of the CNN `documentary' on the Shroud with more people interested in the Shroud and searching the Web for more information about it, and it still may have been.But part of that marked jump in visits to my blog may have been Hugh's LYING comment on 7th March about my theory to that Skeptics forum. And after more than a week, visits to my blog are still in the high 90s a day!Stephen E. Jones Reader, if you like this my The Shroud of Turin blog, and you have a website, could you please consider adding a hyperlink to my blog on it? This would help increase its Google Page Rank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks..","date":"2015-03-13","mins":"4:36 PM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"[continued]>and Dorothy Crispino’s ‘To know the Truth’ which says that it may have moved directly to Anthon in 1357 and stayed there till 1388. No doubt there are other variations on the theme.That disagrees with what Farey had just written! Which is it?And all that Crispino wrote was: \"Can we assume that when Jeanne de Vergy married Aimon de Geneve, probably in 1357,3 she left Lirey to reside with her second husband in his mountainous domains?\"Crispino's footnote \"3\" does not say anything about Jeanne marrying Aymon. In fact it implies she hadn't yet in 1357. Check it out online for yourself. According to my sources and best estimate, Jeanne married Aymon IV in 1359. But if anyone has any hard evidence that it was in 1357, I will change the Shroud's time at Anthon accordingly.>While the ruined Castle of Montfort is correctly illustrated,Thanks.>the photo of the Anthon Chateau is at Anthon, Isères, not Anthon, Haute Savoie, and is not associated with Aimon de Genève.Thanks, but half right. I will make the appropriate minor correction. It still could be near the \"Anthon\" in which Aymon IV and Jeanne lived with the Shroud. And far from it being \"not associated with Aimon de Genève,\"as I wrote (does Farey have a reading problem?), it says the chateau was built in 1315 by \"Guichard d'Anthon.\" As I wrote, presumably that was Guichard VI d'Anthon (c. 1278 1320), who was Aymon IV's great uncle. And Aymon's mother Isabelle d'Anthon (c.1307 1335), did inherit Guichard VI's lands and titles through her father, Aymar d'Anthon (1286 1325).So most of the alleged \"mistakes\" Farey raised were either Farey's own mistakes or debatable. Only the minor point about which \"Anthon\" the chateau was near requires a clarification.That's not worth me wasting my time wading through all the dross on your blog (let alone the personal attacks) to find the odd speck of gold!Stephen E. Jones Reader, if you like this my The Shroud of Turin blog, and you have a website, could you please consider adding a hyperlink to my blog on it? This would help increase its Google Page Rank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks..","date":"2015-02-18","mins":"12:44 AM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"On the International Skeptics Forum thread, \"Miracle of the Shroud II: The Second Coming\" Hugh Farey wrote on 13th March: >I have recently read a comment by Stephen Jones on his website referring to my remark, in which he calls me a liar and asks me to apologise. I did NOT ask Hugh to apologise to ME. I regard asking for apologies as a mark of weakness and my long standing practice has been to NEVER ask for apologies.I only suggested (not ASKED) that Farey: \"should apologise to your fellow `critical thinkers' on the forum you made them, correctly stating my theory in my previous comment above.\">Putting aside the \"yeti/'Squatch/human hybrid\" nonsense, which I hope nobody took seriously, Why write it then?>he says specifically that he does not propose that there was \"a sleeper agent put in place to protect the secret.\"As Farey well KNEW. So it was a deliberate LIE on a forum where most (if not all) would not know what I did propose. >He says that: \"A sleeper agent is A SPY WHO IS PLACED in a target country or organization, not to undertake an immediate mission, but rather to act as a potential asset if activated.\"That is not what I say it is what WIKIPEDIA says. >But he believes that: \"Arizona radiocarbon laboratory physicist Timothy W. Linick (1946 4 June 1989) was allegedly the primary hacker, who: 1) allegedly wrote and installed on Arizona radiocarbon dating laboratory's AMS computer a program which ensured that the Shroud of Turin samples' actual radiocarbon dates would be replaced by dates which, when calibrated, clustered around 1325; and 2) allegedly passed that program on to the KGB, for which he was allegedly working, to be installed by confessed KGB hacker Karl Koch (1965–3 June 1989) on the AMS computers at Zurich and Oxford radiocarbon dating laboratories.\"Farey should have stated this from the outset. But I give him credit for quoting my words stating my theory eventually.>I am happy to make clear the distinction and apologise unreservedly for any confusion.I also give credit to Farey for apologising to the Forum members for misleading them. >He also says that: \"I am NOT \"totally alone in\" in my theory that the 1325 +/ 65 radiocarbon date of the Shroud was a result of a computer hacking. At least two prominent Shroud pro authenticists have emailed me privately that my theory may well be true. Later I regretted the \"At least two...\" as `gilding the lily'. It was only two, but they ARE \" two prominent Shroud pro authenticists.\"[continued].","date":"2015-03-16","mins":"12:56 AM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"Continued]>And I am sure that some of the 60+ readers a day of my blog provisionally agree with my theory. But it is early days and they are understandably reluctant to publicly agree with it.\"From memory I have had no comments on my blog disagreeing with my theory. If commenters on Dan Porter's blog are disagreeing with it, I am not aware of it, because I haven't read his blog's posts or comments since 8 May.>I have no wish to upset anybody, least of all Stephen,I regard this as a LIE (unless it is self delusion). From the outset of my commenting on my theory on Porter's blog, Farey has gone out of his way to PERSONALLY ATTACK me:1) On Porter's blog Farey on several occasions PERSONALLY ATTACKED me, casting doubt on my mental state, which was one of the main reasons I left Porter's blog.2) Farey sent early comments of mine on Porter's blog WITHOUT MY PERMISSION to Profs Jull and Ramsey, Directors of Arizona and Oxford radiocarbon dating laboratories. Which backfired because their unexpectedly prompt replies contained evidence for my theory!3) Farey FALSELY accused me of linking the Pope with Satan, when they were my entirely separate comments on Shroud news items.4) Farey wasted no time in attacking me and my theory in only his second issue as Editor of the BSTS Newsletter.5) In (4) above, Farey omitted to mention that I had scanned back issues #1 42 of the BSTS Newsletter for Barrie Schwortz to add them to his online archive, when it was highly relevant in the context for Farey to do so. I regard that OMISSION AS DELIBERATE by Farey.6) Farey's LYING comment on the above Skeptic's forum is just part of a pattern of personal attack and denigration of me and my theory by Farey, which I expect will continue.>who is a tireless worker on behalf of the Shroud,Farey regards the Shroud as having had \"an accidental 14th century origin,\" so WHY WOULD he think it was good that I am \"a tireless worker on behalf of the Shroud\"? From his EXTREME ANTI AUTHENTICIST position he must regard all pro authenticists (including me) as wasting their time at best and being hopelessly deluded enemies of the truth at worst.>and am happy to be corrected.Now that he had been found out!The point is that AN HONEST PERSON (at least in Shroud matters) COULD NOT have posted what Farey did, when he thought no one on that forum would know that his comments were a LIE.Stephen E. Jones.","date":"2015-03-16","mins":"6:40 AM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"Hi Stephen,>>I'm sorry I have caused such excitement. I doubt it.>My point about the map was not that it was incorrect; as I said you admitted it was wrong. My point was that you used an incorrect map at all. Why not draw a better one?I felt that Wilson's old, incorrect, map was instructive. For one, it gave me an opportunity to mention his abandonment of his Templar theory. >As for the statements about the movement of the Shroud between 1357 and 1388, there are at least three sensible possibilities, one of them being yours. Thanks.>However, in a comprehensive encyclopaedia I think there is a duty to be a bit more precise about the reason for your choice. You misunderstand my new, re started encyclopedia. As I stated in its first index page, my aim is to spend less time on each entry, so I can post more entries:\"This is ... My new Turin Shroud Encyclopedia. It supersedes my old fully referenced Turin Shroud Encyclopedia which was too slow ... This new Encyclopedia will have less footnotes to statements within entries .... My aim will be to post a topic every few days. ...>I tried all over the place to justify it from primary sources, including Ian Wilson's more recent books (1998 and 2010) It seems that you DO have a reading problem! \"Anthon\" is in the index of Wilson's 2010 book: \"Anthon 229.\" And in that place Wilson discusses Jeanne and Aymon's marriage \"within a few years\" of 1358, and Jeanne's taking the Shroud to Aymon's High Savoy estates.As I replied to Dan, you need to remove the log from your eye (your ABSURD 14th century accident theory) before you presume to remove the specks from my eye (Mt 7:3 5).>where he doesn't mention it, and his seminal 1978 book, where he doesn't mention Anthon (Just my luck if he mentions both in Holy Places, which I haven't got with me!) It is in that book too. If you are going to be a critic of my posts on detail, you need to do your homework THOROUGHLY.>I was sorry not to find M. Bergeret's paper online, as that might quote a 14th century source. Perhaps you have a specific source, or perhaps you were making an educated guess and a perfectly good one it is but I think you should make clear which.See above about you first removing the log out your eye, Hugh. Until you address your ABSURD 14th century accident theory, you have little credibility with me.[continued].","date":"2015-02-18","mins":"6:54 AM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"Anonymous >If there is overwhelming evidence that the Shroud is authentic , why is it then that so many people, some of them very intelligent and very cultured, say that the shroud is a medieval fake ?First, there are some very intelligent and very cultured people, who have STUDIED THE EVIDENCE for the Shroud's authenticity FOR THEMSELVES and have concluded from that evidence that the Shroud of Turin is authentic and NOT a medieval fake.Second, the very intelligent and very cultured people who say that the Shroud is a medieval fake, don't WANT the Shroud to be authentic, because that would be strong evidence (if not proof) that Christianity is true.In which case they sense that they would need to change their non Christian lifestyle, and that many of their \"very intelligent and very cultured\" friends would disown them.And so, like the proverbial ostrich with its head in the sand, they take the line of least resistance and CHOSE TO IGNORE that overwhelming evidence for the Shroud's authenticity. As though ignoring it will somehow make it not true!Stephen E. Jones.","date":"2015-02-19","mins":"9:41 PM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"Bippy123 >My guess is that hugh thinks that these very intelligent people who believe in the shrouds authenticity are obviously delusional because hugh farey thinks its a 14th century forgery mistake lol.It wasn't Hugh Farey who wrote the above about, \"so many people, some of them very intelligent and very cultured, say that the shroud is a medieval fake.\" It was an anonymous commenter.>I bet hugh also things the congruent points between the shroud and sudarium were also a mistake or that the sudarium's history is a lie ;)Presumably Farey just dismisses it as a coincidence. If one WANTS the Shroud to be a fake, as Farey evidently does (in the same `progressive' anti supernaturalist Roman Catholic tradition as Canon Ulysses Chevalier (1841–1923) and Fr Herbert Thurston (1856–1939))), then one can just ignore and dismiss the OVERWHELMING evidence for the Shroud's authenticity, and in its place cling to an ABSURD anti authenticity `explanation'.Jesus' commands about first removing the log from one's own eye before one presumes to remove the speck from another's eye (Mt 7:3 5); and straining out a gnat and swallowing a camel (Mt 23:24); apply in spades to Farey and his ABSURD 14th century accident theory. >But then again making false accusations against Stephen claiming what he said against Catholics was also proven by Stephen to be untrue.Farey acknowledged that he was mistaken. The matter is now closed.>Hugh actually u didn't cause much excitement to me. I've come to expect these things from u as completely normal behavior I could say more about Farey (and Porter claiming that I should read his blog to correct my \"many mistakes\" ROTFL!!), but I have a policy against commenting on my blog about Porter, his blog, and his blog's members, beyond what is necessary to respond to their comments on my blog.>Best wishes to you also ;)Thanks.[continued].","date":"2015-02-24","mins":"9:11 PM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"stephen_e_jones","post":"[continued]>As for the date of Jeanne de Vergy's marriage to Aymon IV, I think Crispino is guessing that the indulgences granted in 1357 were in order to celebrate it. She doesn't SAY it, nor do any of my other sources which mention it, and she is no longer here to ask her what she meant by it.But I doubt that the 12 bishops of the Avignon court would grant indulgences in 1357 to pilgrims who visited Lirey church, to mark the occasion of Jeanne and Aymon IV's wedding, yet only mention \"Jeanne de Vergy\" and not Aymon IV.>What makes you think it was in 1359?Absent any hard evidence when Jeanne married Aymon IV, I felt that it would more likely be a few years after her husband Geoffroy I's death in late 1356. >You're probably correct about Guichard d'Anthon it may well be that Anthon Haute Savoie was named after Anthon Isère, but the castle of the former is not otherwise associated with the chatelain of the latter. In order of your points: thanks, I doubt it, so what?>I'm glad you will change the photo, although I could not find one of a castle in Haute Savoie. Perhaps it no longer exists.I am not going to change the photo. As I said, I am going to make a minor clarification under it. And again Hugh, I find it almost UNBELIEVABLE that you, of all people, strain at the gnats of the minor points of my posts, yet swallow the camel (Mt 23:24) of claiming that the Shroud was a 14th century accident!>Best wishes,>Hugh I doubt it.According to my normally one comment per individual policy (see below), to save me time from endless debates, this has been your last comment under this post.Stephen E. Jones MY POLICIES Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Except that comments under my latest post can be on any Shroud related topic without being off topic. I normally allow only one comment per individual under each one of my posts..","date":"2015-02-18","mins":"6:58 AM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"id":"comment-7117","author":"stephen_e_jones","post":"Goska’s excellent article has since been titled “The Shroud of Turin???” and is webbed at http://www.codypublishing.com/goska/shroud.html..","date":"2012-01-17","mins":"6:12 pm","url":"https://shroudstory.com/2012/01/17/paper-chase-danusha-goskas-untitled-essay/","cat":"history","title":"Paper Chase: Danusha Goska’s Untitled Essay"},{"id":"comment-7118","author":"stephen_e_jones","post":"Only the other day I found a reader’s review by Goska of Ian Wilson’s, “The Blood and the Shroud” (1998): Author’s Style Makes This Book a Favorite, April 25, 2004 By Danusha Goska (Bloomington, IN) … Though the Shroud of Turin is infinitely fascinating, the research available on it is finite: the pollen; the negativity of its image; the bloodstains; the theorized Mandylion connection; its accurate depiction of the anatomy of a man who died by crucifixion; the evidence of Roman style execution, down to the images of the weights on the ends of the whip used to beat the victim; evidence of first century Jewish burial practices, etc. All of this evidence adds up to two conclusions, neither of which can ever sit comfortably in the mind of an intelligent person. One conclusion is that the Shroud is a diabolical, intricate fake. It was designed by some Medieval forger who could predict how scholars, in a variety of fields, centuries hence, would seek authenticity, using features no Medieval audience would require or even accept – for example, Jesus’ nudity and nail marks through the wrists, rather than the hands. The other conclusion is that the Shroud is the burial cloth of Jesus Christ. *That* conclusion is so stunning, so truly terrifying in its implications, that the intelligent person, while intrigued and delighted by the Shroud’s mysterious features, struggles to find conclusive evidence that the Shroud cannot possibly be what it very much appears to be. In any case, the evidence to support either conclusion is finite. If you read this book, or Mark Antonacci’s book, or any number of other publications on the Shroud, you will be going over similar intellectual terrain. You will read of neutron flux, the sacking of Constantinople, the Knights Templar, and the peculiarities of Jerusalem’s flora. As an artist, Wilson pays more attention to artist Isabel Piczek’s theories than other authors have — and that is a very good thing — but, otherwise, Shroud fans will have read about much of this material before. What set Ian Wilson’s book apart for me was the author’s style. Amidst the hard evidence, Wilson was willing to give us his own subjective response to seeing the Shroud for the first time. Wilson was willing to quote others’ astounded reactions as well. Wilson wrote of scholars whose theories he does not accept with wit and graciousness. He was also willing to share with those of us outside Shroud politics the ins and outs of the Shroud world’s gossip and infighting. For these reasons of style, humanity, humility, and humor, Wilson’s is my favorite Shroud book so far. I like it that he doesn’t allow the pressure to prove the Shroud’s value via hard science to silence his humanity. Wilson strikes me as a wonderful chap; reading his book, I wished I could be discussing the Shroud with him in person in a pub somewhere in the soggy English countryside..","date":"2012-01-17","mins":"6:34 pm","url":"https://shroudstory.com/2012/01/17/paper-chase-danusha-goskas-untitled-essay/","cat":"history","title":"Paper Chase: Danusha Goska’s Untitled Essay"},{"id":"comment-15692","author":"stephen_e_jones","post":"I don’t normally read comments to Dan’s blog, but I was tipped off by a commenter on my blog that Charles Freeman had replied to a comment on my blog, on Dan’s blog, where the comment, as far as I am aware, has never appeared. Mr Freeman states above: ————————————————————————————————————————— Jones’ latest contribution: He [Freeman] is merely a “freelance” `gun for hire’ who presumably was PAID MONEY by the atheist publication Free Inquiry and/or its “The Skeptical Shroud of Turin Website,” run by arch atheist and Shroud anti authenticist Steven Schafersman to write his two `hatchet job’ articles on the Image of Edessa for the gullible, true believers in the Shroud’s inauthenticity, `sceptical’ (so called), readership of Free [so called] Inquiry! Freeman is deliberately writing WHAT HE KNOWS TO BE FALSE for Free Inquiry’s “The Skeptical Shroud of Turin Website to MAKE MONEY. ————————————————————————————————————————— I accept Mr Freeman’s assurance that there was no payment asked or received for his articles: ————————————————————————————————————————— Unfortunately Jones has now over reached himself as can be seen below (from the Comment provided by him on his latest critique on his blog). There is no payment asked or received for my articles. ————————————————————————————————————————— I will delete immediately any comments (Blogger does not give the option of modifying them) which alleged that Mr Freeman was paid for his articles. I apologise to Mr Freeman for any hurt or embarrassment I caused him by my assumption that he was paid for his articles in Free Inquiry and/or “The Skeptical Shroud of Turin Website.” I will also immediately post this comment where I made the above assumption. Stephen E. Jones.","date":"2012-09-01","mins":"12:50 pm","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15717","author":"stephen_e_jones","post":"I am receiving comments to this post only on Dan’s blog, because I wanted to see if Mr Freeman responded to my apology, and action I took to immediately remove from the comments on my blog every claim of mine that Charles Freeman was being paid to write his articles on the Shroud of Turin and the Image of Edessa. I note that Mr Freeman puts the word “apology” in single quotes. That is his problem. The comment “WHAT HE KNOWS TO BE FALSE” was in a sentence about Charles Freeman being paid money, so it was deleted along with that sentence. I have no particular desire to gratuitously hurt or embarrass Mr Freeman, or damage his reputation, so in future I am going to confine myself to objectively pointing out his false statements and any relevant information he fails to tell his readers because it would undermine his case, with no personal observations by me about Mr Freeman himself. I point out that Charles Freeman himself has set a precedent in this in claiming in his “The Shroud of Turin and the Image of Edessa: A Misguided Journey” that “[Ian] Wilson fails to tell his readers that it [The Doctrine of Addai] contains relevant material which might undermine his case”: “The Doctrine of Addai is used completely inappropriately as Wilson fails to tell his readers that it contains relevant material which might undermine his case, weak though it already is.” with the clear implication by Charles Freeman that Ian Wilson is being less than completely academically honest in that. I am going to post a copy of this comment of mine to my blog under, “My critique of Charles Freeman’s “The Turin Shroud and the Image of Edessa: A Misguided Journey,” part 6: “The Turin Shroud and the Image of Edessa” (2). ” I am then going to unsubscribe again to this Dan Porter’s blog. So if Charles Freeman has any more complaints or criticisms about my ongoing series critiquing his paper above, he should comment under the relevant post on my blog, otherwise I won’t see it. Stephen E. Jones.","date":"2012-09-02","mins":"6:00 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-16190","author":"stephen_e_jones","post":"Dan Thanks for the plugs. But you might want to correct the typo “Jone’s” in this post’s heading. And thanks also for your wonderful graphics that I often post and link to. I’m glad that you allow such `piracy’. You might quote to Colin Berry that HE is the one potentially breaking the law by demanding that you delete your posting of extracts from his blog, “without [him] determining whether that posting reflected `fair use’ of the copyrighted material”: “In August 2008 US District Judge Jeremy Fogel of San Jose, California ruled that copyright holders cannot order a deletion of an online file without determining whether that posting reflected `fair use’ of the copyrighted material. …” (“Fair use: Fair use on the Internet,” Wikipedia, 15 May 2012) Regards. Stephen E. Jones.","date":"2012-09-12","mins":"11:16 am","url":"https://shroudstory.com/2012/09/12/stephen-jones-critique-of-charles-freeman-continues-and-continues-and-continues/","cat":"history","title":"Stephen Jones’ Critique of Charles Freeman Continues and Continues and Continues"},{"id":"comment-16205","author":"stephen_e_jones","post":"It IS doubled four times, although not the way Dan shows it in his Tetradiplon graphic. I remembered that there was something wrong with Dan’s Tetradiplon graphic but I forgot what it was. I have a cut out copy of the Shroud in my hands. First doubling is between the two head images into one half. Second doubling of the top visible 1/4 concertina style behind the head image. Third doubling is the visible 1/3 also concertina style behind the head image. Fourth doubling is the visible 1/2 concertina style behind the head image. Looked from the side, which may be how the Edessans saw it, there are four folds doubled. Which is no doubt where tetradiplon four doubled” came from. It is hard to describe this, especially as I need to get ready for work, but do it and you will see it works. I will make my own graphic and post it to my blog in place of Dan’s..","date":"2012-09-12","mins":"6:33 pm","url":"https://shroudstory.com/2012/09/12/stephen-jones-critique-of-charles-freeman-continues-and-continues-and-continues/","cat":"history","title":"Stephen Jones’ Critique of Charles Freeman Continues and Continues and Continues"},{"author":"stephen_e_jones","post":"Anonymous>'And He knew as knowing the heart, and asked to wash Himself; and a towel [Gk. Tetradiplon] was given Him; and when He had washed Himself, He wiped His face with it. And His image having been imprinted upon the linen [Gk. Sindon], He gave it to Ananias, saying: Give this, and take back this message, to him that sent you: Peace to you and your city!\">So this is clearly not referring to a should but a cloth with an image of Christ's face on it that Christ asked to be given to the city of Edessa. As I stated in my post above:\"Its first known occurrence is in the sixth century Acts of Thaddeus, an update of an earlier story about Edessa's King Abgar V (c. 4 BC AD 50) receiving an image of Jesus imprinted on a \"four doubled\" (tetradiplon) linen sheet (sindon):\"It was the earlier Doctrine of Addai which `explained' that the image was imprinted on the cloth when Jesus wiped His face on it.The Acts of Thaddeus updated this with the 6th century discovery that the cloth was a four doubled (tetradiplon large linen sheet (sindon).I have revised my post above to make this clearer:\"Its [tetradiplon's] first known occurrence is in the Acts of Thaddeus, a sixth century update of an earlier (c. AD 400) story in the Doctrine of Addai, about Edessa's King Abgar V (c. 4 BC AD 50) receiving an image of Jesus imprinted on a cloth. The sixth century Acts of Thaddeus added new information to that earlier story that the cloth was a sindon (a large linen sheet) which was tetradiplon (\"four doubled\"):\"The Acts of Thaddeus did not challenge the earlier Doctrine of Addai's `explanation' how Jesus' image came to be imprinted on the cloth.Presumably, if the writer of the Acts of Thaddeus knew that it was not only the image of Jesus' face which was on the cloth, but that of His whole body, naked, tortured, bloodstained and dead, he was not at liberty to write that.Those among the Edessan clergy who knew that shocking new information would have a powerful vested interest to withhold it from the Edessan public, to whom it would be profoundly disturbing.Therefore it is not surprising that the Edessan clergy would maintain the traditional story about how the image was imprinted on the cloth, while permitting the writer of the Acts of Thaddeus to update it with the new information about the cloth itself, that it was a sindon (a large linen sheet), and that it was tetradiplon (four doubled). >Can you explain how it could be a shroud?See above.Stephen E. Jones Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. I reserve the right to respond to any comment as a separate blog post..","date":"2012-09-15","mins":"9:36 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"author":"stephen_e_jones","post":"Anonymous>This part of the story is false:Jesus asked for a towel to wash himself and then wiped the cloth on his face. With his image imprinted upon the towel, Jesus gave it to Ananias and t[o] Thaddeus to guide the king and the city Agreed that the sixth century Acts of Thaddeus, story of Jesus leaving an image of Himself on a towel by washing His face on it is false. As I wrote above, it was an Edessan explanation of how and why Jesus' image was on the Mandylion (the Shroud of Turin \"doubled in four\" Gk tetradiplon), to maintain consistency with Edessa's earlier Doctrine of Addai story of Edessa's 1st century King Abgar receiving from Jesus His image on a towel. Which in turn is probably an earlier conflation of Jesus' letter to Abgar I, which is in Eusebius' 4th century Ecclesiastical History, and an earlier (at least 4th century and possibly even 1st century) knowledge of Jesus' image on the Mandylion/Shroud.That in the sixth century the unique in all of known ancient Greek literature word tetradiplon tetra \"four\" + diplon \"doubled\" = \"four doubled\") was used of a cloth with Jesus' facial image on is proof beyond reasonable doubt that there was known in at least the sixth century to be a cloth with Jesus' image on which was one eighth of a larger cloth. This can only be what we now call the Shroud of Turin, which when folded in eight shows Jesus face in landscape aspect, exactly as it appears in early copies of the Mandylion.>The Shroud is a 14 foot long burial cloth but it has the image of Jesus on it (very faint actually). The image imprinted after Jesus died and it is not from washing his face.>Legends obscure facts. The legend of the Veronica cloth (she supposedly wiped his face on the way to crucifixion) is false (there is no Veronica cloth) It was widely told for centuries. It is based on the Mandylion (never made by human hands therefore not an icon)Agreed. The name \"Veronica\" is a combination of Latin vera \"true\" and ikon \"image\" = \"true image\", and therefore shows that the story of a woman named Veronica receiving Jesus' image on a towel she gave Him to wash his face with was false. But historians take ancient legends seriously as probably being based on facts. In this case that there was known to be an early (pre 4th century) image of Jesus, or at least of His face, on cloth.>The Mandylion (the Shroud) was often described as a facial image because it was displayed as folded (not the full length) and that is where the story of a face cloth came.Agreed. That's what my post above says.>There is a face cloth (the Sudarium) but it too is a death cloth and its stains match the Shroud (Sindon) and so at one point both clothes were together (te grave). They each have type AB blood.Agreed. [continued].","date":"2013-09-15","mins":"8:02 AM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"author":"stephen_e_jones","post":"[continued]>Type AB is the rarest (less than 3% have it) and blood typing was discovered in 1907. So blood tyhpe help to corroborate the relationship of the cloths.Agreed. And Jews have a higher incidence of type AB than Europeans. Also, while it may be argued that old blood tends to degrade to type AB (although even that is not always so see my post \"My critique of Charles Freeman's `The Turin Shroud and the Image of Edessa: A Misguided Journey,' part 4: `The Shroud of Turin and the Sudarium of Oviedo' (2)\") if the Shroud and Sudarium of Oviedo had different blood types that would be have been a problem.Stephen E. Jones Readers: If you like this my The Shroud of Turin blog, and you have a website, could you please consider adding a hyperlink to my blog on it? This would help increase my blog's Google Page Rank number and so enable those who are Google searching on \"the Shroud of Turin\" to discover my blog. Thanks. .","date":"2013-09-15","mins":"8:04 AM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"author":"stephen_e_jones","post":"Anonymous>So it really was the Shroud and the clergy knew this but they put out the story that it was an image of the face of Christ while alive?No. As I said, the `explanation' of how Jesus' face became imprinted on the cloth by Him wiping His face with it, was in the third century (c. AD 400) Doctrine of Addai.That `explanation' pre dates the Shroud being at Edessa (AD 526), and is more evidence for Markwardt's theory that the Shroud was in Antioch from c. AD 47 526, and hidden above Antioch's Gate of the Cherubim from c. AD 326 526.The sixth century Acts of Thaddeus did not change the earlier story of how the image was imprinted on the cloth, but it did add new information about the cloth itself, that it was a large linen sheet (sindon) which was four doubled (tetradiplon), i.e. Folded in eight.That presumably means that some in the Edessan clergy leadership became aware of the full length cloth under the top face panel.Although it is possible they could see that the cloth was four doubled in profile from the edge of the frame, without them actually having unfastened the cloth from its frame, unfolding it and looking at the image of Jesus' naked, bloodstained, crucified and dead body.>At what point was the truth revealed? In 944 or later?There seems to be no unambiguous record of when it was discovered that behind the Image of Edessa's face image was the full length Shroud. The first definite reference was in 1130:\"All this makes all the more intriguing the evidence that someone, sometime after the Mandylion's arrival in Constantinople, seems to have undone the gold trelliswork covering the cloth, untwined the fringe from the surrounding nails, carefully unfolded the cloth, and, for the first time since the days of the apostles, set eyes on the concealed full length figure. Frustratingly, this is another of those moments in the Mandylion's history that has gone unrecorded, yet is crucial to it. It is attested as a real happening from an impressive array of circumstantial evidence. The first indications, and the most direct, come from western authors. The earliest, datable to sometime before 1130, is an interpolation in an original eighth century sermon by Pope Stephen III. [von Dobschutz, E., Christusbilder, Leipzig, 1889, p, 134] Referring to the Mandylion, it tells us: `For the very same mediator between God and man [Christ], that he might in every way satisfy the king [Abgar], stretched his WHOLE BODY ON A CLOTH, white as snow, on which the glorious image of the Lord's face and the LENGTH OF HIS WHOLE BODY was so divinely transformed that it was sufficient for those who could not see the LORD BODILY IN THE FLESH, to see the transfiguration made on the cloth.' [Green, M., \"Enshrouded in Silence,\" Ampleforth Journal, LXXIV, 1969, p.333]\" (Wilson, I., \"The Shroud of Turin: The Burial Cloth of Jesus?,\" 1979, pp.157 158. My emphasis).[continued].","date":"2012-09-16","mins":"9:13 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"author":"stephen_e_jones","post":"Bippy123>Stephen don't forget the sturp physicist John Jackson performed a raking test on the shroud and found the folding creases that match a tetradipion. Thanks for reminding me. I have now inserted into my post above:\"This is consistent with major foldlines at one eighth intervals, found on the Shroud by Dr John Jackson from raking light photographs of the Shroud taken in 1978 by the Shroud of Turin Research Project (S Tu RP)\" and I have uploaded a diagram of those foldlines from Ian Wilson, \"The Evidence of the Shroud,\" 1986, p.123.>I can't post the links because for some reason I can't copy and paste on here from my i Pod , but this is even more evidence in favor of it.You may be thinking of Dan Porter's, \"What is the significance of the folding patterns on the Shroud?,\" The Definitive Shroud of Turin FAQ, 2009.>Great article again Thanks.Stephen E. Jones.","date":"2012-09-16","mins":"6:13 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"author":"stephen_e_jones","post":"[continued]On or after 1130 that there are further such references (my emphases):\"Another account, from the prodigious History of the Church written by the English monk Ordericus Vitalis about 1130, seemed to derive from the first. According to this version: `Abgar reigned as toparch of Edessa. To him the Lord Jesus sent ... A most precious cloth with which he wiped the sweat from his face, and on which shone the Savior's features miraculously reproduced. This displayed to those who gazed on it the likeness and proportions of the BODY OF THE LORD.' [Ordericus Vitalis, Historia ecclesiastica, part III, bk. IX, 8]\" (Wilson, 1979, p.158).\"A Vatican Library codex, also datable to the twelfth century, repeated this tradition in its version of Christ's letter to Abgar: `If indeed you desire to look bodily upon my face, I send you a cloth on which know that the image not only of my face, but of my WHOLE BODY had been divinely transformed.' [Vatican Library Codex No. 5696, fol. 35, published in P. Savio, Ricerche storlche sulla Santa Sindone, Turin, 1957, footnote 31. P. 340]\" (Wilson, 1979, p.158).\"By the thirteenth century, Gervase of Tilbury, a great retailer of the gossip of the time, not only repeated these words of Christ to Abgar, but added: `Far it is handed down from archives of ancient authority that the Lord prostrated himself FULL LENGTH on most white linen, and so by divine power the most beautiful likeness not only of the face, but also of the WHOLE BODY OF THE LORD was impressed upon the cloth.' [Gervase of Tilbury, Otia Imperialia, III, from Scriptores rerum brunsvicensium, ed. G. Leibnitz, Hanover, 1707, I, pp. 966 67]\" (Wilson, 1979, p.159).While these may seem late, they are only the earliest surviving records of the discovery in Constantinople after 944 that behind Jesus' face image was His full length, whole body image. It may have been discovered not long after the Image/Shroud arrived in Constantinople in 944, but it was either not recorded or that recording was lost.Whichever, this lack of any Constantinople document recording the discovery of Jesus' full length, naked, bloodstained, crucified and dead body under His face image, is further evidence of how shocking this was to the Byzantine mindset. And helps explain that if the Edessan ruling clergy were aware of it from 526, why they kept it a closely guarded secret.And even though these 1130+ references are at least 186 years after the Image/Shroud arrived in Constantinople, they are still at least 130 years before the earliest possible radiocarbon dating of the Shroud, 1260.Stephen E. Jones.","date":"2012-09-17","mins":"5:33 AM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"author":"stephen_e_jones","post":"Bippy123>Stephen, thank you again for adding John Jacksons raking finds. Thanks again for reminding me of them.>You've done an incredible job of adding all the bread crumb evidence together. That's all I do, take evidence of the Shroud's authenticity discovered by others, e.g. Ian Wilson, and publish it on the Internet.>Have a few friends that have been debating the shroud and I'm going to lead them to your post here. Great!>They are really excited about this connection here.Thanks for the feedback.>God bless And you.Stephen E. Jones Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. I reserve the right to respond to any comment as a separate blog post..","date":"2012-09-18","mins":"7:15 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"id":"comment-27602","author":"stephen_e_jones","post":"The “Pray Codex … is an old handwritten Hungarian text dating to 1192 1195” (“Pray Codex,” Wikipedia). Therefore what looks like an “a” in “The Visit to the Sepulchre” (Berkovits, I., “Illuminated Manuscripts in Hungary, XI XVI Centuries,” 1969, plate III lower), is presumably in Old Hungarian (although it could be Greek or Latin). According to Wikipedia’s “Old Hungarian alphabet” page, the nearest letter to it appears to be “M.” I haven’t read anywhere what the letter represents. I doubt it is the artist’s initial because he hasn’t signed it in his other two drawings, and if he did sign his initial one would expect it down in a corner. So presumably it has something to do with Christ’s resurrection. The drawing depicts the scene in Mark 16:1 7, in the emply tomb, where Mary Magdalene, Mary the mother of James, and Salome (the Apostle John’s mother and Mary the mother of Jesus’ sister) are told by an angel, “Do not be alarmed. You seek Jesus of Nazareth, who was crucified. He has risen; he is not here. See the place where they laid him.” So it may symbolise the angel’s words..","date":"2013-03-18","mins":"4:42 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-27721","author":"stephen_e_jones","post":">Typo: ALMOS >Typo: In all likelihood Max, how about checking your comments first, before cluttering up our inboxes with your “typos”. Or if a typo does slip through, credit us all with the IQ to realise it is a typo and don’t bother writing another comment just to tell us what we already know,.","date":"2013-03-18","mins":"8:04 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-995","author":"stephen_e_jones","post":"Another reason why Gibson’s argument is fallacious is that it assumes that the linen of the Shroud of Turin was intended to be a burial shroud. But the Bible only says that “Joseph [of Arimathea] bought some linen cloth …” (Mk 15:46) which he then used as a burial shroud for Jesus’ body. And that Joseph had to buy the linen cloth in a hurry, because “the Sabbath was about to begin” (Lk 23:54). Therefore it is entirely possible and consistent with the Biblical evidence that the linen of the Shroud of Turin was intended, not for a burial shroud, but for clothing, as Hoare pointed out: “While the exact time and place of manufacture are uncertain, there can be no doubt that the Shroud is a beautifully made length of cloth, and probably cost a very great deal. This has prompted the suggestion that it was intended as apparel rather than a shroud. There is a lot of sense to this. A shroud would probably have been made from the simplest weave, which is why the funeral cloths that have been preserved from early times are nearly all plain weave. Garments do not survive so frequently.” (Hoare, R., 1995, “The Turin Shroud Is Genuine: The Irrefutable Evidence,” p.18). Stephen.","date":"2010-02-03","mins":"6:36 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1158","author":"stephen_e_jones","post":">Once again, you make unwarranted caustic comments about a book you never read. All I commented about your theory under this “The Gibson Study …” post was: “However this raises more problems for your theory that the Shroud is Jesus’ tallit. See my comment to be made under `New Shroud of Turin book by John N. Lupia.'” I don’t want to open up a `second front’ discussing your theory under this “The Gibson Study …” post, so I will confine my comments under the “New Shroud of Turin book by John N. Lupia” post. Stephen.","date":"2010-03-12","mins":"7:58 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1161","author":"stephen_e_jones","post":"Ellen >I ask you who is John Lupia. John is a bona fide expert. Here is what the Journal of Biblical Studies says about him: John N. Lupia was trained in biblical studies and archaeology at Seton Hall University’s Divinity School, (B. A. 1976). His graduate studies in biblical scholarship were at the Immaculate Conception Seminary. He studied under Msgr. James Turro, one of the contributors to the Jerome Biblical Commentary. He went on to graduate studies in art history and archaeology at City College of the City University of New York, (M. A. 1982). He served as an extern in the Metropolitan Museum of Art, the Frick Museum, and the Jewish Museum. He went on for his Ph. D. In art history at Rutgers University, studying under James H. Stubblebine. He served as his graduate research assistant for several articles and his book Assisi and the Rise of the Vernacular. Later, he was made a graduate fellow of Rutgers School of Information and Library Studies (MLS 1993). He served as an intern at Princeton University’s Special Collections in the Marquand Art Library. He taught art history and archaeology for over fifteen years at various universities. He served as a leading contributor for Macmillan Publishers Dictionary of Art; 35 volumes, 1995. Mr. Lupia is listed in Catholic Biblical Associations Member Directory; Gale Publishers, The Directory of American Scholars; 5 volumes, 1998 edition; ABI’s International Directory of Distinguished Leadership, 10th ed; and IBC’s Directory. He has been a member of the Society of Biblical Literature; College Arts Association of America; the Catholic Biblical Association of America; the American Society of Papyrologists. But of course being qualified and experienced does not of itself make the expert necessarily right on any particular topic (even within the expert’s own field of expertise), and us mere amateurs necessarily wrong on that topic. Science (for example) is littered with discarded theories proposed by highly qualified and experienced experts in their own fields of expertise, but which turned out, under testing, to be wrong. Shroud of Turin studies (Sindonology) encompasses a wide range of disciplines, including history, archaeology, art, science (physical and biological), theology, etc, and the well read amateur can himself become an expert across that multi disciplinary field, albeit not with any formal qualification in Sindonology, since there isn’t one. And a great thing about the Internet is that a mere amateur can directly question an expert about his theory and make up his own mind whether the expert has satisfactorily answered those questions. Stephen.","date":"2010-03-12","mins":"11:01 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1142","author":"stephen_e_jones","post":"John >Flury Lemberg confirmed the cloth was cut and sewn together. … Flury Lemberg made this report at the Symposium at Turin, March 2 5, 2000. Thanks for this information. I don’t yet have the book of this symposium: Fanti, G., ed., “The Turin Shroud: Past, Present and Future,” International Scientific Symposium, Torino 2 5 March 2000″ (if anyone can let me know where can buy a copy, I would be most grateful). But Googling on “Turn Shroud: Past, Present and Future” and “seam” I found a report (which I already had on my computer but had forgotten) on this in the BSTS Newsletter of June 2000: “By far the most important information to come from Dr. Flury Lemberg, however, concerns how the Shroud had been woven and finished. As she pointed out, looms in antiquity, particularly those in Egypt, could be up to 3.5 metres wide, enabling them to turn out continuous lengths of cloth far longer and wider than the Shroud. The high quality of the Shroud’s weaving strongly suggests it to have been made on a ‘professional’ loom of this kind. The explanation of its side strip would therefore seem to be that at the time of its manufacture it formed part of considerably wider cloth which was then cut lengthwise into at least three pieces, two wide, and one narrow, this latter being the side strip, which retains selvedge along its length, just as does its opposite number. With the central section removed (and now lost without trace), the wide and narrow pieces were very expertly joined up to form the Shroud as we know it today, this thereby clearly having been made to conform to specific dimensions.” (Wilson, I., “`The Turin Shroud – past, present and future’, Turin, 2 5 March, 2000 – probably the best ever Shroud Symposium,” British Society for the Turin Shroud Newsletter, No. 51, June 2000). That Google search also found another article: “First, we examined the so called side strip and its seam, about which there have been questions and disagreement. In 1982 after studying the radiographs taken in 1978, Schwalbe and Rogers reported that there is continuity of the threads from the Shroud into the side strip and concluded that the Shroud and the side strip are of one piece. (Ref.: Schwalbe & Rogers, 1982) We studied the same area also, trying to discern whether the side strip is 1) a completely different piece of linen which had been joined to the edge of the Shroud, 2) a piece of the original Shroud which had been detached but was then carefully reattached by the seam, or 3) an integral, continuous part of the Shroud fabric with the seam being really a tuck in the cloth for some reason. A joint paper, `Concerning the Side Strip on the Shroud of Turin,’ (Ref.: Adler et al, 1997) was presented at the May 1997 Nice Symposium in which we reported our findings from tracing several thousand of some 15,000 weft threads from the body of the Shroud through the seam and into the side strip that there is near perfect alignment of nearly each thread in position, thickness, and intensity. Also, we found no evidence of frayed thread ends either in the seam or along either side of it. Our conclusion then was that the side strip is continuous with the rest of the Shroud.” (Whanger, A.D. & Whanger, M., 2005, “Excerpt from Radiological Aspects of the Shroud of Turin,” Council for Study of the Shroud of Turin, Durham NC, pp.1 15, p.1) So I stand corrected there is a side strip, it being part of the same cloth and expertly cut and rejoined by a seam at the time of original manufacture, such that each thread is almost perfectly aligned across the two sections. Thanks again for bringing this to my attention. However this raises more problems for your theory that the Shroud is Jesus’ tallit. See my comment to be made under “New Shroud of Turin book by John N. Lupia.” Stephen.","date":"2010-03-11","mins":"11:25 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1140","author":"stephen_e_jones","post":"Dan >One thing that challenges but doesn’t disprove these speculations is the side strip. It seems apparent that the cloth’s loom width was reduced by cutting it near one edge and reattaching the selvedge. I missed this before. The evidence now is that there is no side strip. That is because xrays taken by STURP in 1978 show that the weave is continuous throughout both the Shroud and the `side strip’. The `seam’ is now thought to be a folded and sewn “cord” to pass a thin rope or wire through or to otherwise help support the holding of the Shroud during displays. Here are quotes to that effect. “The radiograph … suggests that the side strip either is, or at least was, at one time an integral portion of the full cloth. In this particular area, there are alternating high and low material density `bands’ that evidently correspond to weft lots of different weight used in the weaving. (The visible light transmission photographs of Schwortz also clearly show these structures.) … The distinct weft structure is continuous across the seam joining the two panels and strongly suggests that the side strip and the main section were of a single manufacture.” (Schwalbe, L.A. & Rogers, R.N., 1982, “Physics and Chemistry of the Shroud of Turin: Summary of the 1978 Investigation,” Analytica Chimica Acta, Vol. 135, No. 1, pp.3 49, pp.41 42). “This side strip is made from the same twilled cloth of the Shroud, of which it originally formed part; in fact, the irregularities of the weave, clearly visible in the principal section, extend exactly to the side strip, as can be seen from the radiographies carried out in 1978 and published by Schwalbe and Rogers. [Analytica Chimica Acta, 135, 1982, p.42]” (Petrosillo, O. & Marinelli, E., 1996, “The Enigma of the Shroud,” p.162). “Schwalbe and Rogers [Schwalbe, L. & Rogers, R., “Physics and Chemistry of the Shroud of Turin; A Summary of the 1978 Investigation”, Anal. Chim Acta, 135, 1982, pp. 3 49], mainly on the continuity of various macroscopically observable patterns seen in the weave in the radiograph images [Mottern, R., London, R. & Morris, R., “Radiographic Examination of the Shroud of Turin; A Preliminary Report”, Materials Eval., 38, 1979, pp. 39 44] taken during the STURP investigations, rejected the possibility of an adventitious piece of cloth for the side strip and concluded that the two pieces of cloth were actually continuous through the seam. .” (Adler, A.D., 1998, “Concerning the Side Strip on the Shroud of Turin,” in Adler, A.D. & Crispino, D., ed., “The Orphaned Manuscript,” 2002, pp.87 91, p.87). “There are three possibilities as to the nature of the side strip: 1) it is a completely different piece of linen cloth which has been joined to one edge of the Shroud for some unknown purpose; 2) it is a piece of the original cloth of the Shroud which for some unknown reason became detached from the original and was then reattached by the seam; 3) it is cloth that is continuous with the rest of the Shroud and the seam is really a tuck or a tube that has been sewn into the cloth for some unknown purpose. … Of our three original possibilities, situation 1 is clearly rejected and situation 2 also seems highly unlikely in view of the detailed thread matching that would be required and the absence of any evidence of any frayed thread ends along either side of the seam image. Therefore we conclude that the side strip is actually continuous with the rest of the Shroud.” (Adler, 1998, pp.87 88). “Several authors have suggested that the purpose of a corded side seam might be to facilitate hanging the cloth for exhibition. Certainly many paintings of such medieval exhibitions show the Shroud being displayed in such a manner with the cloth shown along its length and held or suspended along what would appear to be the side seam. It should be noted that this mode of display places maximum stress at the end points of suspension and tearing of the fabric would be expected to proceed from the ends inward along the seam. Some historical accounts record that certain noteworthies were given pieces of the Shroud. It would be logical to assume that such samples would be taken from such torn end panels, thus providing a simple explanation for the missing panel portions of the side strip. Perhaps the Charny family decided to repair such damages at the time of their display of the Shroud. Maybe the radiocarbon sample is simply rewoven material from the time of this repair. Had the recommended protocol for taking this sample been followed [Adler, A., 1996, “Updating Recent Studies on the Shroud of Turin,” Orna, M.V., ed., ACS Symp. Series, 625, pp. 223 228], we would have an answer for these questions.” (Adler, 1998, pp.87 91) “One final mystery element of the fabric is what appears to be a seam line three and a half inches from the Shroud’s edge (as seen to the left of the frontal image when viewed face on), that runs the cloth’s full length. It is from inside this seam line that the Shroud’s two missing portions have been removed at its two ends, but what is as yet still far from clear is the exact function of the seam itself, if that is indeed what it is. Before the STURP examination of 1978 I had hypothesised that the three and a half inch wide strip of cloth which the seam appears to join to the main body of the Shroud was a ‘side strip’ added close to the time of its original manufacture, perhaps in order to balance the appearance of the image on the cloth, since only by its addition does the body image appear central. But then in 1978 X radiographs made by the STURP team showed that the same weft run could be traced through from the original Shroud into the side strip, suggesting that the cloth had been made as a single piece, with the seam being just that, a seam. However, if that was the case, why on earth had anyone gone to all the trouble of very carefully cutting off a three and a half inch strip, only then equally carefully to sew it back on again?” (Wilson, I., 1998, “The Blood and the Shroud,” 1998, p.72). Stephen.","date":"2010-03-11","mins":"9:38 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1143","author":"stephen_e_jones","post":"Sorry, I posted the wrong Whangers quote above. It should have been the following: “In March 2000, Flury Lemberg presented a paper, `The Linen of the Turin Shroud,’ (Ref.: Flury Lemberg, 2000) dealing with technical and archaeological characteristics of the fabric. She had worked directly with the Shroud as a fabric specialist. She felt that originally the fabric had been cut into three lengthwise strips, two wide and one narrow, and that later the narrow strip (now the side strip) was expertly reattached to one of the wide strips by the seam to produce what we now know as the Shroud. Later, we reexamined the radiographs as well as photographic enlargements of portions of them to get a better understanding of the side strip and the two missing corners (MC) at the frontal and dorsal ends on the anatomic left side of the Shroud. … Following the seam its full length on the Shroud, it is remarkably uniform for almost the entire length except for the two ends near the MC. The weft threads can be traced from the Shroud through the seam continuing into the side strip in near perfect alignment. The seam appears to be a simple tuck (a portion of the cloth folded over on itself) in the Shroud fabric, which is meticulously hand sewed in place on both sides of the tuck.” (Whanger, A.D. & Whanger, M., 2005, “Excerpt from Radiological Aspects of the Shroud of Turin,” Council for Study of the Shroud of Turin, Durham NC, pp.1 15, p.2). My apologies. Stephen.","date":"2010-03-12","mins":"1:18 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"}]
