[{"id":"comment-7730","author":"stephen_e_jones","post":">”You can’t prove it,” he wrote back. “It could be pure coincidence and you don’t know for a fact that it isn’t. What is the threshold for perceiving an image? What are the criteria for saying that the image is of a man? Are you an expert on the human face?”. On that basis it would be impossible to decide whether “the Face on Mars” was a representation of a real alien face, or just a rock formation that by coincidence happens to look like a human face. The test, as Dan said, is in the level of detail. The Face on Mars only LOOKED like a face at a low level of resolution and from a certain angle in a 1976 Viking 1 photograph. It was later shown by NASA in 1998, when its Mars Global Surveyor “snapped a picture ten times sharper than the original Viking photos … the image first appeared on a JPL web site, revealing [the Face on Mars to be] a natural landform.” So a fake only gets more and more unlike the real thing as the level of detailed scrutiny increases. The Shroud, on the other hand, has only become more and more like the real thing, as the level of scrutiny has increased. Members of the 1978 Shroud of Turin Research Project (STURP), like the late Ray Rogers and Barrie Schwortz, were confident that it would only take a short time of their detailed scientific scrutiny, for them to detect that the Shroud was a fake. Yet that that did not happen. After 5 days of the most intensive scientific scrutiny, none of the STURP team, were able to conclude that the Shroud was a fake. And today, a third of a century later, the Shroud continues to only look more and more like the real thing, the very burial sheet of Jesus, bearing the imprint of His crucified, dead, and resurrected body, and less and less like a fake. The only reasonable (and consistent if one believes the Face on Mars is just a rock formation) conclusion, is that the the Shroud is NOT a fake, but is in fact JESUS’ and its image is “a literal `snapshot’ of the Resurrection” (Wilson, I., “The Turin Shroud,” 1978, p.210)..","date":"2012-01-30","mins":"8:55 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","title":"Sciencebod’s 3D Problem"},{"id":"comment-3415","author":"stephen_e_jones","post":"I have booked to attend this lecture and will briefly report here and more fully on my blog The Shroud of Turin my impressions. Stephen E. Jones.","date":"2011-07-25","mins":"8:51 pm","url":"https://shroudstory.com/2011/07/25/public-lecture-by-joel-bernstein-the-shroud-of-turin/","cat":"image_theory","title":"Public lecture by Joel Bernstein: The Shroud of Turin"},{"id":"comment-7728","author":"stephen_e_jones","post":">I am a Catholic much more in sympathy with progressive Catholic scholars like Crossan who interprets the resurrection as a statement of faith and not as a physical event in a … historic sense. Crossan believes that “Jesus’ body, far from being resurrected, was probably buried in a shallow grave and eaten by dogs.” That means Jesus is NOT “ascended into heaven, seated at the right hand of the Father, from where he will come to judge the living and the dead.” Crossan’s dead Jesus cannot save anyone or make intercession to the Father for their sins. According to St Paul, Crossan’s (and his ilk’s) faith is empty of content and he/they are of all men the most to be pitied (1 Cor 15:14 19). If this reader REALLY believes what Crossan believes (and I note that he/she does not actually state that), then he might be a Catholic (or a Baptist, or an Anglican, etc), but he/she is NOT a Christian. There are people who believe the Shroud is authentic (like the late Rodney Hoare, a past Chairman of the British Society for the Turin Shroud, who even wrote books defending the Shroud’s authenticity, but who believed Jesus never died on the cross) but who are not Christians. That is OK in Sindonology (“the scientific study of the Shroud of Turin“) but it is NOT OK in Christianity. There are Christians who don’t believe the Shroud is authentic (I was one for nearly 40 years), who are my brothers and sisters in Christ. There are non Christians (like Barrie Schwortz owner of Shroud.com) who are my brothers and sisters in the Shroud. But the two brotherhoods are NOT the same. And the brotherhood in Christ is INFINITELY more important than the brotherhood in the Shroud..","date":"2012-01-30","mins":"8:05 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","title":"Sciencebod’s 3D Problem"},{"id":"comment-7023","author":"stephen_e_jones","post":">How do we get a high resolution (focused) image without a converging lens, concave mirror, or even pinhole camera. John Jackson’s Cloth Collapse theory explains how there is a “a one to one mapping between a given point on the body to a unique point on the cloth … achieved for all points on the Shroud”: “Image Characteristics explained by Hypothesis Let us now show how this concept explains each of the image characteristics of the Shroud discussed at the beginning of this paper. 1. High Resolution. As various points on the Shroud intersect different topographical features on the body surface during the collapse process, radiation dose on the cloth begins to accumulate. If the radiation is assumed to be strongly absorbed in air, radiation effects on the cloth cannot begin until virtual intersection with the body surface occurs. Thus, a one to one mapping between a given point on the body to a unique point on the cloth is achieved for all points on the Shroud, which is equivalent to stating that the resulting image is well resolved.” (Jackson, J.P., “An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image,” in Berard, A., ed., “History, Science, Theology and the Shroud,” Symposium Proceedings, St. Louis Missouri, June 22 23, 1991, The Man in the Shroud Committee of Amarillo, Texas: Amarillo TX, 1991, p.340. Emphasis original). Without the need for a converging lens. Jackson’s Cloth Collapse theory also explains every other major characteristic of the Shroud: “Thus, the hypothesis of the Shroud collapsing into a radiating body explains all the above characteristics of the Shroud image, something that other image formation hypotheses posed thus far fail to do. (Jackson, 1991, p.342). Jackson also made a testable prediction of his theory that “the frontal image should reside on both sides of the Shroud, whereas the dorsal image should reside on only one side”: “Testable Predictions of Hypothesis … 2 Surface Discolorations on Both Sides of the Shroud for the Frontal Image. As noted above, the superficial nature of the image is explained by the theory. However, the above reasoning leads to one other prediction concerning the superficiality of the image; the frontal image should reside on both sides of the Shroud, whereas the dorsal image should reside on only one side. The reason is that when the upper part of the Shroud falls into the body region, radiation from the body impinges upon both sides of the cloth. However, in the case of the dorsal image, radiation impinges from only one side because the cloth there never moves into the body. Unfortunately, there are no suitable data available to test this prediction because the reverse side of the Shroud has been covered since 1534 with a backing cloth. But if such a prediction could be confirmed by a future examination of the reverse side, then the theory proposed herein would be given considerable support. It is likely, however, that if a frontal image discoloration exists on the reverse surface of the Shroud, it would be somewhat less intense than the discoloration which is observed on the normal viewing side because that side presumably entered the body first.” (Jackson, 1991, pp.342 343. Emphasis original). Jackson’s prediction was found to be true in 2004 when “The ghostly image of a man’s face” was discovered “on the reverse side of the Shroud” (i.e. What was originally the uppermost side of the Shroud as it lay on Jesus body in the Tomb) which “had a striking 3 D quality and matched the known face in form, size and position”: “The ghostly image of a man’s face has emerged on the reverse side of the Shroud of Turin, the piece of linen believed to have been wrapped around the body of Jesus after he was crucified, scientists say. The discovery, using new digital imaging techniques, adds new complexity to one of the most controversial relics in Christendom. The study, which will be published online ahead of print publication in the Journal of Optics A: Pure and Applied Optics, examined the back surface of the famous handwoven linen. … the back side has remained hidden for centuries beneath a piece of so called Holland cloth … The back surface, however, was photographed in detail and the pictures published in a book by Monsignor Giuseppe Ghiberti, one of the Church’s top shroud officials. … `As I saw the pictures in the book, I was caught by the perception of a faint image on the back surface of the shroud …’ said Giulio Fanti … the study’s lead author. Imaging the face Fanti used sophisticated image processing based on direct and inverse Fourier transform, enhancement and template matching techniques on Ghiberti’s pictures to uncover the image of a man’s face. Lying behind the known image of the bearded man bearing the marks of crucifixion, the new image had a striking 3 D quality and matched the known face in form, size and position. `Though the image is very faint, features such as nose, eyes, hair, beard and moustache are clearly visible …,’ Fanti said. But the enhancing procedure did not uncover the full body image as it appeared on the front side. `If it does exist, it is masked by the noise of the digital image itself. But we found what it is probably the image of the hands,’ Fanti said … Fanti’s finding matches a hypothesis postulated in 1990 by Dr John Jackson, a U.S. Physicist who conducted the first major investigation into the shroud in 1978. Jackson speculated the presence of a faint image on the back surface of the shroud, only in correspondence to the frontal image.” (“Turin shroud shows another mystery face,” Rossella Lorenzi, Discovery News, ABC Science, 12 April 2004). Jackson’s Cloth Collapse theory is also fully compatible with the ENEA report that the image was created on the Shroud by ultraviolet radiation: “5. Chemical Nature of the Image. Electromagnetic radiation that is absorbed strongly in air consists of photons in the ultraviolet or soft x ray region. It happens that these photons are also sufficiently energetic to photochemically modify cellulose. Such photons are strongly absorbed in cellulose over fibril like distances. Experiments performed by the author have shown that subsequent aging in an oven of photosensitized (bleached) cloth by shortwave ultraviolet radiation produces a yellow browned pattern like the Shroud body image composed of chemically altered cellulose. Thus, I posit that radiation from the body initially photosensitized the body image onto the Shroud. This pattern would have appeared, if the radiation was ultraviolet, as a white (bleached) image on a less white cloth. With time, natural aging would have reversed the relative shading of the image to its presently observed state where it appears darker than the surrounding cloth (which also aged or darkened with time, but not as fast).” (Jackson, 1991, p.341. Emphasis original). As far as I know, Jackson’s paper is not webbed and is only available in the Berard, ed., 1991 St. Louis Symposium Proceedings book above. Stephen E. Jones.","date":"2012-01-15","mins":"11:45 pm","url":"https://shroudstory.com/2012/01/15/tough-questions-from-sciencebod/","cat":"image_theory","title":"Tough Questions from Sciencebod"},{"author":"stephen_e_jones","post":"Chidi>Despite the arguments of pseudo skeptics like colinsberry I don't know what Colin Berry's latest arguments are on this topic, because I don't read his blog.He has been permanently banned from this blog because of his repeated off topic, offensive and sub standard comments, so I would appreciate it if his comments not posted here, giving him a proxy presence on my blog.>that Alan. D Adler didn't prove the blood is real they must be able to explain these results and the presence of human serum albumin Agreed. But then Berry's position on the Shroud is \"invincible ignorance\":\"There does remain, nonetheless, a cast of mind which seems peculiarly closed to evidence. When confronted with such a mind, one feels helpless, for no amount of evidence seems to be clinching. Frequently the facts are simply ignored or brushed aside as somehow deceptive, and the principles are reaffirmed in unshakable conviction. One seems confronted with what has been called `invincible ignorance.'\" (Fearnside, W.W. & Holther, W.B., \"Fallacy: The Counterfeit of Argument,\" 1959, p.113).because for NO amount of evidence would be sufficient to convince him that the Shroud is authentic.Stephen E. Jones Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. I reserve the right to respond to any comment as a separate blog post..","date":"2012-07-23","mins":"3:26 AM","url":"http://theshroudofturin.blogspot.com/2008/07/re-middle-eastern-features-on-shroud.html","title":"\nRe: Middle Eastern Features on Shroud Image\n"},{"author":"stephen_e_jones","post":"Anonymous>There are various opinions and researches of the shroud of Turin.That is a truism, i.e. \"... A claim that is so obvious or self evident as to be hardly worth mentioning ...\" (\"Truism,\" Wikipedia, 27 February 2013).>Some people say that it is the genuine and some that it is the fake and the hoax. Another truism, except you should have added \"...and some don't say anything about it\" to cover the entire range of possibilities! >The fact is that the shroud of Turin doesn't present Jesus of the Bible. The fact is that you are WRONG on that. As I shall demonstrate when I get to \"3. The Bible and the Shroud\" which should be in the near future.>If we can find even one evidence, which disprove the shroud of Turin theory, so the whole story shall be invalidated. Another truism. OBVIOUSLY if the Shroud of Turin were \"disprove[d]\" then it would have been \"invalidated\"! >We can find a large number of evidence from the Bible, which show that the shroud of Turin cannot be the shroud of the Lord Jesus.Again you are WRONG. There is NOTHING in the Bible which shows that the Shroud of Turin is not the burial sheet of Jesus. Indeed, the image of a naked crucified man on the Shroud of Turin is so CLOSELY COMPLEMENTARY to the Gospel accounts of Jesus' passion, death, burial and resurrection, that the Shroud has been aptly called \"the fifth Gospel\":\"Is this remarkable cloth with its clearly visible images of a man who was scourged mercilessly, humiliated by a crown of thorns, forced to bear his own cross, and finally crucified and gashed in his side to assure his death, all in accord with the Gospel descriptions of the Holy Passion is this yellowed cloth the true burial shroud of Jesus Christ? ... If it is authentic, the Holy Shroud is unquestionably the greatest religious relic known to Christianity and one of the most fascinating antiquities known to mankind. If it is authentic, THE SHROUD CAN RIGHTFULLY TAKE ITS PLACE AS `THE FIFTH GOSPEL,' for what it reveals of Jesus and his suffering far exceeds the scant Gospel words of the evangelists. If it is authentic, and if no completely satisfactory natural explanation can account for its unusual physical properties, then the Shroud is indeed the most miraculous of Holy Miracles an enduring, self made portrait of the man who would be called Savior by millions of Christians throughout the world. ?\" (Humber, T., \"The Fifth Gospel: The Miracle of the Holy Shroud,\" 1974, pp.11 12. My emphasis).But since comments on the topic of whether or not `the Shroud of Turin presents Jesus of the Bible' is off topic under this post about \"Burns and water stains\" on the Shroud, it is your last comment under this post.If you want to comment further on this topic then do so when I begin posting on \"3. The Bible and the Shroud\" which, as I said, should be in the near future.Stephen E. Jones Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. I reserve the right to respond to any comment as a separate blog post..","date":"2013-04-07","mins":"5:11 PM","url":"http://theshroudofturin.blogspot.com/2013/02/the-shroud-of-jesus-26-other-marks-1.html","title":"\nThe Shroud of Turin: 2.6. The other marks (1): Burns and water stains\n"},{"author":"stephen_e_jones","post":"Anonymous>Stephen you need to see this a hologram photo has been processed from the back second face of the Shroud>>http://ireport.cnn.com/docs/DOC 954016 Thanks. There has been some recent comments about the \"second face\" on the underside (which was the top side) of the Shroud under my post, \"New tests by Prof. Giulio Fanti show the Shroud of Turin could date from the time of Christ.\"As I commented there:\"I have been advised that this `second image' may not be actually there, in a confidential email by a Shroud scientist, therefore I will look into it when I get to that part of my series, probably \"8. Major features of the Shroud's Image.\"\"Although there is a photo of it on one of Dan Porter's pages: `What is the second face and what does it mean?'\".Stephen E. Jones.","date":"2013-04-11","mins":"4:57 AM","url":"http://theshroudofturin.blogspot.com/2013/02/the-shroud-of-jesus-26-other-marks-1.html","title":"\nThe Shroud of Turin: 2.6. The other marks (1): Burns and water stains\n"},{"author":"stephen_e_jones","post":"Anonymous>I also expected from you a further argument this makes for problems with the forgery theory. For the relic to have ever been stored in such a way, and presuming the possessor appreciated it as holy, suggests that it was in peril. I deliberately did not speculate why the ancient earthenware jar containing the Shroud, at some point in time had been partly filled with water, because no one knows. It most likely was the result of an accident, because partly filling the jar would not have hidden the Shroud.>Correct me if I'm wrong in thinking that post Lirey, France, there is no documented evidence of any threat the shroud that would require such ends for its preservation. Agreed. But see above that partly filling a water jar containing the Shroud would not have hidden it from a threat.>Therefore it must pre date the carbon dating.The large water stains definitely predate the 1988 radiocarbon dating, since they are evident on Enrie's 1931 photographs of the Shroud. In fact the Shroud sample was cut from one of the large water stains. See the first photo above where the bottom left large water stain covers the area from where the 1988 carbon dating sample was cut.Also, Guerreschi and Salcito point out that they must predate the Holland Cloth backing cloth sewn onto the Shroud in 1534 after the 1532 fire, because the large water stains would be on that too, but aren't.That the large water stains perfectly fit an earthenware jar of a type common in the first century Middle East is evidence that the Shroud was stored in such a jar in the Middle East in the first or early centuries. There is a 10th century Constantinople Official History that from 544 in Edessa to at least 944 in Constantinople the Shroud was mounted on a board, and it is most unlikely (to put it mildly) it was ever after that stored in a Middle Eastern earthenware jar.The burden of proof is on anti authenticists to explain how a late medieval (1260 1390) Shroud has water stains that perfectly fit it having been stored in a first century Middle Eastern earthenware jar!Stephen E. Jones MY POLICIES. Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Except that comments under my current post can be on any one Shroud related topic without being off topic. To avoid time wasting debate I normally allow only one comment per individual under each one of my posts..","date":"2018-04-16","mins":"10:31 PM","url":"http://theshroudofturin.blogspot.com/2018/04/water-stains-28-other-marks-and-images.html","title":"\nWater stains #28: Other marks and images: The evidence is overwhelming that the Turin Shroud is authentic!\n"},{"author":"stephen_e_jones","post":"Anonymous>>I also expected from you a further argument this makes for problems with the forgery theory. For the relic to have ever been stored in such a way, and presuming the possessor appreciated it as holy, suggests that it was in peril.>I deliberately did not speculate why the ancient earthenware jar containing the Shroud, at some point in time had been partly filled with water, because no one knows. It most likely was the result of an accident, because partly filling the jar would not have hidden the Shroud.I later read in Barbara Frale's 2012 book, \"The Templars and the Shroud of Christ,\" that \"Whoever raised the lid [of such an earthenware jar] would not have seen anything but a featureless mass of cloth, too tightly turned in on itself to show even the abundant marks of blood\":\"Rather, it was a container designed for other purposes, where the Shroud was perhaps only provisionally housed. The shape of the object is exactly like that of the terra cotta amphoras found in Qumran, which held the 800 or more manuscripts of the Essene library. In effect, amphoras were very versatile containers in which anything could and would be stored, from oil to grain to books. At the very bottom of that container there must have been some water, a small amount but enough to dampen the lower part of the cloth. This reconstruction seems to open a new and promising path of research. No doubt that kind of earthenware container was a highly commonplace object, made all over the Middle East and certainly not only in Qumran, but the community that lived in isolation on the Dead Sea shore had several features that might have made it a safe refuge for the earliest Christians, persecuted by the Jerusalem authorities almost from the time of Jesus's death. At any rate, if Salcito and Guerreschi's reconstruction is correct, it argues for a phase in the Shroud's history in which this object was not exhibited to the veneration of the faithful, but, on the contrary, hidden: Whoever raised the lid would not have seen anything but a featureless mass of cloth, too tightly turned in on itself to show even the abundant marks of blood. As is known, Jewish tradition held blood in horror and saw it as necessary to destroy anything that had come into contact with corpses, being in the highest degree impure and able to pollute people, things, and places.\" (Frale, B., 2012, \"The Templars and the Shroud of Christ,\" Skyhorse Publishing: New York NY, p.171)I then realised that I had missed your point, thinking only of the water, not the fact that this would indeed suggest that the Shroud was stored folded tightly in an earthenware jar at a time when \"it was in peril,\" namely in the early first century when the tiny Christian church was being persecuted by its far more numerous enemies, the Jews (Acts 8:1 3; 11:19; 12:1 3).\"I have posted this correction under the \"Comments\" section of my April 2018, Shroud of Turin News.Stephen E. Jones.","date":"2018-05-07","mins":"11:47 PM","url":"http://theshroudofturin.blogspot.com/2018/04/water-stains-28-other-marks-and-images.html","title":"\nWater stains #28: Other marks and images: The evidence is overwhelming that the Turin Shroud is authentic!\n"},{"author":"stephen_e_jones","post":"Flagrum3>Here in lies one of the biggest problems with the Shroud authenticity debate; People will 'listen' to arguments from people like Nickell's, St. Paul predicted it in 2 Tim 4:3, \"For the time is coming when people will not endure sound teaching, but having itching ears they will accumulate for themselves teachers to suit their own passions,\"The Nickell's of this world are listened to because they tell people without Christ what they want to be true.Indeed, even Christians, who don't know much about the Shroud, and/or are opposed to it thinking it is just another fake Roman Catholic relic (as I once was) can be taken in my Nickell's plausible sounding arguments.Even Christian apologist Josh Mc Dowell has been conned by Nickell, quoting in his \"Answers to Tough Questions\" 1980, pp.162 164, from atheist Marvin M. Mueller's 1982 article in Skeptical Inquirer (without referencing where it came from) which claimed (falsely) that Nickell's bas relief powder rubbing method can duplicate the Shroud!In fact Mc Dowell used the same fallacious having it both ways argument as Nickell, citing approvingly Bishop d'Arcis' claim that the Shroud was \"painted\" and also citing approvingly Nickell's implied claim that the Shroud is a bas relief powder rubbing! >whom is not a scientist or a chemist or physicist or has any training in any fields which would allow him to make any educated remarks about the Shroud. Agreed, but Nickell is a gifted writer, who to the man in the street who doesn't know much about the Shroud, sounds convincing.But Nickell is self deceived through his mind having being taken captive to the philosophy (Col 2:8) of Naturalism, i.e. The philosophical position that \"nature is all there is: there is no supernatural.\"He is an example of `the blind leading the blind' (Mt 15:14).>Yet people keep quoteing his writings. Again, that's because Nickell tells secular people what they want to hear. Who have neither the time or the inclination to check what he claims.>Maybe if they would just check his credentials against those of authors of dozens of peer reviewed papers, minds might change a bit about the Shroud's authenticity.Most people, including so called `skeptics', haven't got the time or inclination to read the Shroud pro authenticity web articles and books, let alone peer reviewed journal papers. >It's truly dumbfounding.It is all part of the Plan: Isa 14:26 NIV \"This is the plan determined for the whole world; this is the hand stretched out over all nations.\"The One whose image is on the Shroud has told us that it is His purpose to let the weeds grow with the wheat until the harvest:Mt 13:27 30. 27 And the servants of the master of the house came and said to him, `Master, did you not sow good seed in your field? How then does it have weeds?' 28 He said to them, `An enemy has done this.' So the servants said to him, `Then do you want us to go and gather them?' 29 But he said, `No, lest in gathering the weeds you root up the wheat along with them. 30 Let both grow together until the harvest, and at harvest time I will tell the reapers, Gather the weeds first and bind them in bundles to be burned, but gather the wheat into my barn.'\"when they will be separated by Him into their respective eternal destinations.The Nickell's of this world think they are destroying Christianity, when all along they are unwittingly obeying it!Stephen E. Jones.","date":"2012-05-11","mins":"10:13 PM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"\nYou state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'\n"},{"author":"stephen_e_jones","post":"Eddie>I am researching the shroud right now and this dialogue has been extremely helpful. Thank you Thank you.See also my \"No paint, etc. #15\" in my \"The evidence is overwhelming that the Turin Shroud is authentic!\" series.Stephen E. Jones.","date":"2018-04-24","mins":"9:43 PM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"\nYou state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'\n"},{"author":"stephen_e_jones","post":"Anonymous>Some have claimed that the image is the result of a Bas Relief rubbing technique. ... Do you have any references that offer a response to the \"rubbing technique\" claim?See my post, \"`I heard the Shroud image was made by a bas relief metal sculpture heated'.\" Stephen E. Jones Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. I reserve the right to respond to any comment as a separate blog post..","date":"2012-06-27","mins":"7:53 AM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"\nYou state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'\n"},{"author":"stephen_e_jones","post":"Flagrum3>Stephen, thank you for that last passage and your final comment. It has actually made me feel better about this whole mess and my bewilderment to people's opposition to the Shroud and the Lord's teachings.Glad I was able to help. Here is a verse that just occurred to me:Romans 3:3 NASB. What then? If some did not believe, their unbelief will not nullify the faithfulness of God, will it?And also remember that we Christians have read the end of the book (Rev 22:1 5) and we win!:\"When things get bad and you can't stand to look It's time to read to the end of the book Don't put it down 'til you get to the end When Jesus come and His Kingdom begins... We win ...\" (Michael W. Smith,\"End of the Book.\" My emphasis).Stephen E. Jones.","date":"2012-05-20","mins":"3:27 PM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"\nYou state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'\n"},{"author":"stephen_e_jones","post":"Anonymous>I'm still very confused about the paint issue...if I have read Mc Crone correctly, he says that there are traces of red ochre that make up the body image, and red vermillion that make up the blood image. There is no blood image. The blood is REAL blood.And as red ochre making up the body image, Mc Crone COULD NOT have legitimately said that because he only examined STURP's sticky tapes which were taken only from NON IMAGE areas.Mc Crone found what he was looking for isolated particles of red ochre and vermilion on STURP's sticky tapes of NON IMAGE areas and he UNSCIENTIFICALLY: 1) extrapolated from those isolated red ochre and vermillion particles on sticky tapes from NON IMAGE areas of the Shroud, that the blood is comprised of vermillion pigment and the body IMAGE must be comprised of red ochre; and 2) did not consider alternative explanations for the red ochre and vermillion that it was left behind on the Shroud when artists pressed their copies of the Shroud to the Shroud to confer a blessing on their copies.>And he found no pigment on the non image areas. If that were the case then he would have found no pigment AT ALL because Mc Crone never went to Turin with STURP to examine the Shroud itself. ALL that Mc Crone had for study was STURP's sticky tapes, and STURP was not permitted to, and did not, press their sticky tapes to image areas of the Shroud. >I realize that these results were not peer reviewed, but if he is wrong, it seems like a rookie mistake...Mc Crone signed a STURP agreement that he would only publish his findings in peer reviewed scientfic journals, as other STURP findings were, but he reneged and published them in his own journal, The Microscope and in the media. Why? The answer must be because he knew deep down that his findings would not survive peer review because they were WRONG. Mc Crone was an atheist/agnostic and extremely biased against the Shroud's authenticity. In 1981, AFTER he had examined STURP's sticky tapes and handed them back he made the most unscientific admission: \"I believe the shroud is a fake, but I cannot prove it.\" (Mc Crone, W.C., in Murphy, C., \"Shreds of Evidence,\" Harper's Magazine, November, 1981, pp.42 65, pp.54 55).So even Mc Crone admitted that his finding red ochre and vermillion on sticky tapes from NON IMAGE areas of the Shroud did not prove it was a fake. And HOW then did Mc Crone KNOW that the Shroud was a fake? >which only leaves the option that he lied, since he was a highly respected microscoptist. Not necessarily. It could mean that he so much WANTED the Shroud to be a fake that he went BEYOND the scientific evidence available to him and AGAINST the scientific evidence of other STURP scientists.>This is certainly possible, but I don't like to make an assumption that a scientist is fabricating data. You are now arguing against a straw man that YOU have created. I do not claim that Mc Crone \"lied\" just that he was so biased against the Shroud's authenticity that he went beyond the limited evidence available to him and did not consider alternative explanations.[continued].","date":"2013-01-09","mins":"10:20 AM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"\nYou state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'\n"},{"author":"stephen_e_jones","post":"[continued]>It sounds like STURP scientist are cliaming that yes, there are paint particles, but they don't form the image. Correct.>Are they also claiming that there are only red ochre and red vermillion, or do they claim that multiple pigments are visible? No. STURP found a lot of isolated particles on the Shroud, but they were not more concentrated in the image areas than the non image areas. And particles that COULD form the image, like a particular paint, pigment or mixture of same, would have to be ONLY, or at least HIGHLY, concentrated in the image area for it to form the image. And they aren't. Proof of that is the Shroud has been in at least two very hot fires in 1532 and 1997 and in both case the image was not chemically changed as it would have been if it was formed by pigments. And in the 1997 fire the Shroud was sprayed with water from firemen's hoses which turned to steam in the Shroud's container, yet the image did not run as it would have if it was a pigment.>If there are only the two, it would seem odd that only two pigments would be found from 'sanctifying' other 'shrouds' against the 'real Shroud'. You would expect multiple pigments, I would imagine.There ARE \"multiple pigments\" on the Shroud, but NONE of them are sufficiently concentrated in the Shroud's image area to form its image.Stephen E. Jones Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. I reserve the right to respond to any comment as a separate blog post..","date":"2013-01-09","mins":"10:22 AM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"\nYou state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'\n"}]
