[{"id":"comment-6134","author":"stephen_e_jones","post":"The scientists concluded that because the image on the Shroud is only “one fifth of a thousandth of a millimeter” (0.0002 mm) deep – the thickness of a flax fibril cell wall, and it would have required the equivalent of “34 thousand billion watts” delivered by “a battery of ten thousand excimer lasers” (“Translated version of 2011 14 ENEA.pdf”), the image COULD NOT HAVE BEEN CREATED BY A MEDIEVAL FORGER. Therefore, ALL medieval forgery theories for the creation of the Shroud image (whether painting, hot statue, primitive photography, crucified victim, etc) are WRONG. And also the 1988 89 radiocarbon date of the Shroud linen to between 1260 1360 AD is WRONG! But if someone does not personally like the theory that “God did it,” i.e. The image of the crucified Jesus was imprinted on His linen Shroud by the radiation emitted as His body changed state in resurrection (1 Corinthians 15:35 52; Philippians 3:20 21), they are free to propose some other theory. Or to believe in no theory. But what they cannot now rationally do is claim that the Shroud is a medieval fake and that that was proved by the 1988 radiocarbon dating. This five year series of experiments by the Italian ENEA scientists has ruled those out..","date":"2011-12-26","mins":"6:37 am","url":"https://shroudstory.com/2011/12/26/a-different-point-of-view-illogical-nonsense-on-the-turin-shroud/","cat":"other_blogs","title":"A Different Point of View: Illogical nonsense on the Turin Shroud"},{"id":"comment-6497","author":"stephen_e_jones","post":"Agreed about the committment to Materialism/Naturalism, i.e. Nature is all there is, and nature is ultimately nothing but particles, which is the dominant philosophy in science. Israel’s leading botanist, Prof. Avinoam Danin, in his new book, “Botany of the Shroud,” agrees that Max Frei’s pollen is not determinable down to the species level, because its external identifying structures are obscured by Frei’s sticky tape glue. But Turin has a large collection of pollen vaccuumed from the Shroud that may be determinable down to the species level. Also, Prof. Danin has identified the imprint of flower parts on the Shroud (on several different types of photos and also directly on the Shroud). They include four species: Gundelia tournefortii, Zygophyllum dumosum, Cistus creticus and Capparis aegyptia, which are only found growing together between Jerusalem and Hebron! And only flower in the March April when Jesus was crucified!! But as Jesus observed, a prior committment to Naturalism (i.e. Anti supernaturalism), always overides evidence of the supernatural: “If they do not hear Moses and the Prophets, neither will they be convinced if someone should rise from the dead” (Lk 16:31)..","date":"2012-01-03","mins":"10:12 am","url":"https://shroudstory.com/2012/01/03/if-its-a-fraud-make-another-one/","cat":"other_blogs","title":"If it’s a fraud, make another one."},{"id":"comment-7856","author":"stephen_e_jones","post":">Even then it seemed odd to me that an evangelical parson (evangelicals base their faith on the Bible alone) – should be an advocate for the authenticity of a Roman Catholic relic. I am an evangelical who had this prejudice for nearly 40 years until 2005 when I read a book by evangelicals Stevenson and Habermas (“Verdict on the Shroud“), which set out the evidence for the Shroud’s authenticity. But that is all it is – a prejudice. God is neither an evangelical nor a Roman Catholic. And there were no Protestant churches in existence in 1355 (the Protestant Reformation started in 1517) when the Shroud first appeared in undisputed documented history in Lirey, France. Moreover, the Roman Catholic Church has only owned the Shroud since 1983, when it was bequeathed to it in the will of ex King Umberto II, whose Savoy family had been the owners of the Shroud since 1453. But even on evangelical (“the Bible alone”) premises, there is reason to accept the authenticity of the Shroud. The Bible records in all four Gospels that Jesus was buried in a linen Shroud (Mt 27:59; Mk 15:46; Lk 23:53; Jn 19:40). And the Bible also records that the disciples found Jesus’ burial clothes left behind in the empty tomb (Lk 24:12; Jn 20:5 7). The Bible does not record that the disciples left Jesus’ graveclothes in the tomb, nor that they later disposed of them. So on purely evangelical (“the Bible alone”) premises, evangelicals have no reason to reject the authenticity of the Shroud. Indeed, if they were consistent, since the Bible does go out of its way to mention Jesus’ linen burial Shroud: “And Joseph took the body and wrapped it in a clean linen shroud” (Mt 27:59); “And Joseph bought a linen shroud, and taking him down, wrapped him in the linen shroud …” (Mk 15:46); “Then he took it down and wrapped it in a linen shroud …” (Lk 23:53); and does not mention the disciples abandoning or disposing of it; evangelicals should, on balance, be in favour of the Shroud’s authenticity, or at least be neutral towards it. >Even then I was sceptical about the “Shroud”, as I am to this day! So was I, for nearly 40 years, until I set aside my prejudice and actually read the evidence for the Shroud’s authenticity. Since when has prejudice based on ignorance been an evangelical principle, or something to be proud of?.","date":"2012-02-02","mins":"10:26 am","url":"https://shroudstory.com/2012/02/02/memories-of-a-shroud-of-turin-obsessed-vicar-in-coventry/","cat":"other_blogs","title":"Memories of a Shroud of Turin obsessed vicar in Coventry"},{"id":"comment-1507","author":"stephen_e_jones","post":"An anonymous commenter (whom I assumed from his writing style was this Petri Paavola) recently left a comment under my blog posts: “Burial shroud proves Turin Shroud not from 1st century C.E. Jerusalem?”, as follows: “Many people speak in favor of the shroud of Turin. Some people are against the shroud. The Bible bears witness against the shroud and indicates it for false and a fake. This article points out in the light of the Bible that the shroud of Turin is a fake: http://koti.phnet.fi/petripaavola/shroudofturin.html My response included: “Thanks for the link. But the article is wrong on all its key points. Significantly his reference list does not include any actual books on the Shroud, which discuss the Biblical and Jewish issues at depth. It is typical of well meaning but uninformed criticism of the Shroud by some Christians. … I may answer that webpage in detail in a separate post.” Since my above brief response, I had already decided to respond to the claims on that web page in detail. Stephen.","date":"2010-10-08","mins":"7:42 am","url":"https://shroudstory.com/2010/10/07/more-on-petri-paavola-from-finland/","cat":"other_blogs","title":"More on Petri Paavola from Finland"},{"id":"comment-7135","author":"stephen_e_jones","post":"I have now posted to my blog, with permission, John P. Jackson, “An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image” (1991) ..","date":"2012-01-18","mins":"11:53 am","url":"https://shroudstory.com/2012/01/10/now-we-are-cooking-with-sciencebod/","cat":"other_blogs","title":"Now we are cooking with Sciencebod"},{"id":"comment-6764","author":"stephen_e_jones","post":"The ENEA Report (translated by Google and hence the strange English style) has an explanation for the too red color of the Shroud blood: “The UV and VUV light colored linen that is compatible with the absence of staining in the blood stains of the Shroud (hemoglobin in thin blood absorbs UV and VUV light) and the second some scholars [46] UV light may be responsible for another very unique feature of Shroud, the red spots of blood after so much time of their deposition.” (p.22). The reference is to: 46. C. Goldoni: “The Shroud of Turin and the bilirubin blood stains” Atti dell’International Conference on The Shroud of Turin: Perspectives on a Multifaceted Enigma, edito da G. Fanti (Edizioni Libreria Progetto Padova 2009) pp. 442 445. Http://www.ohioshroudconference.com/papers/p04.pdf In that paper, which was translated from Italian and difficult to follow, Goldoni (a Doctor of Medicine and Clinical Pathologist) states: “Coming back to the Shroud it is important to note that the bright red colour of blood, visible on the cloth, is connected with an exposure to ultraviolet rays. This last result was in agreement with many previous observations. … However, the following irradiation in the UV next showed, after exposure of only 30 minutes, a sharp change towards the bright red colour regardless the bilirubin excess in each samples (Fig. 2)” (pp.3,5). As it happens, last night I re read physicist John Jackson’s 1991, “An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image” and in it Jackson presciently (20+ years ago) attributed the Shroud’s image to ultraviolet light emitted from the body: “Chemical Nature of the Image. Electromagnetic radiation that is absorbed strongly in air consists of photons in the ultraviolet or soft x ray region. It happens that these photons are also sufficiently energetic to photochemically modify cellulose. Such photons are strongly absorbed in cellulose over fibril like distances. Experiments performed by the author have shown that subsequent aging in an oven of photosensitized (bleached) cloth by shortwave ultraviolet radiation produces a yellow browned pattern like the Shroud body image composed of chemically altered cellulose. Thus, I posit that radiation from the body initially photosensitized the body image onto the Shroud. This pattern would have appeared, if the radiation was ultraviolet, as a white (bleached) image on a less white cloth. With time, natural aging would have reversed the relative shading of the image to its presently observed state where it appears darker than the surrounding cloth (which also aged or darkened with time, but not as fast). This mechanism is consistent with (1) the observed lack of pyrolytic products in microchemical studies of Shroud fibrils expected from high temperature cellulose degradation (in this case image coloring occurs by natural aging at ambient temperatures over a long period of time) and (2) the absence of substances in the image areas that chemically colored the cloth (Note that image coloration is produced onto the cloth only by radiation and without any extraneous chemicals).” (Jackson, J.P., “An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image,” in Berard, A., ed., “History, Science, Theology and the Shroud,” Symposium Proceedings, St. Louis Missouri, June 22 23, 1991, The Man in the Shroud Committee of Amarillo, Texas: Amarillo TX, 1991, p.341. Emphasis original). And what’s more, Jackson had proposed that the Shroud’s blood was also photochemically modified: “Photochemical Modification of the Shroud Blood. Given that the assumed radiation stimulus induced a chemical change in the cellulose of the Shroud, which we refer to generically as the `body image,’ it is reasonable to ask if analogous chemical changes might also have been induced in the blood which remained attached to the Shroud during the hypothesized collapse.” (Jackson, 1991, p.343. Emphasis original)..","date":"2012-01-10","mins":"8:38 am","url":"https://shroudstory.com/2012/01/10/now-we-are-cooking-with-sciencebod/","cat":"other_blogs","title":"Now we are cooking with Sciencebod"},{"id":"comment-6752","author":"stephen_e_jones","post":"Nevertheless, I will respond to Sciencebod’s comment! >Let’s suppose that Margaret of Austria commissioned repair work on the Shroud, and that it was carried out before the fire (bearing in mind she died just two years before the fire), i.e. Before being extensively damaged. Agreed. Between 1502 and 1509 seems to be the most likely dates. >What proportion of the shroud would have required highly demanding, time consuming invisible mending? Probably not more than 1 part in a 1000 at the most, would you agree if iit was not to take an eternity? No. Medieval invisible reweavers repaired whole tapestries, so the comparatively tiny area of the Shroud it is proposed was patched would not take long. >Given that the shroud is 4.4 x 1.1 metres, that is 48,400 sq cm, so repairs were needed on just 48 sq cm. No. Sciencebod’s “not more than 1 part in a 1000 at the most” is just a figure plucked out of the air. I have read somewhere that Margaret may have been motivated to invisibly repair only a particular patch of the Shroud that was removed since it came into the possession of her Savoy family. >Yet the sample taken was a strip 7cm x 1 cm, i.e. 7sq cm. The chances of a strip of just 7sq cm having major repairs (especially at a corner) sufficent to throw carbon dating, Chance has nothing to do with it. The corners are the most damaged areas of the Shroud, because they are structurally the weakest, and from time immemorial the Shroud was held up during expositions by its corners. Also, relic pieces were taken from the corners, no doubt on the principle that since it was already damaged, with pieces missing, a little bit more taken would be less noticed. If Sciencebod had actually taken the trouble to study his topic, i.e. Buying and reading books on it, not just `cruising the web’, he would know that was in fact why it was decided that the sample cut from the Shroud and given to the three labs, would be from the same already damaged and patched bottom left hand corner of the Shroud. So that it would cause minimal visual impact to the Shroud: “Nor is this the only cause for disquiet. The 1986 protocol laid stress on the care which Mme Flury Lemberg should exercise when choosing the location from which the samples for the radiocarbon dating should be taken. Yet despite all the years of apparent planning for the taking of the carbon dating samples it was not until the very moment itself that Gonella and Riggi chose this location – after a very public, heated and protracted argument witnessed and attested by the entire contingent of bemused radiocarbon dating scientists. They could hardly have chosen anywhere much more unsuitable than they did … But now we come to the decision that Gonella and Riggi arrived at after their argument: to take the sample in the form of one single sliver from the frontal image bottom corner closest to the side strip. This must be regarded as misguided in the extreme. For yet another major cause of possible contamination of a radiocarbon dating sample arises from any excessive handling to which it may have been subjected at times distant from when it originated. And when we study the hundreds of depictions of the Shroud being held up before the crowds during past centuries, what do we see? In example after example a cleric’s hand can be seen holding up the Shroud at, yes, the frontal image bottom corner closest to the side strip. …. Also, while their wisest decision would have been to take several tiny samples from scattered areas, by opting for just this single site they ensured that any contamination error, however large or small, would be bound to be repeated by all three laboratories.” (Wilson, I., “The Blood and the Shroud: New Evidence that the World’s Most Sacred Relic is Real,” Simon & Schuster: New York NY, 1998, pp.190 192). >I shan’t try doing the probability calculation this time of night, and in any case I am rusty in that department. I will help Sciencebod with his “probability calculation.” Probability ranges from 0 (impossible) to 1 (certain). Since the corners were the most damaged, and relics had already been taken from there, the probability is almost certain, close to 1, say 0.95, that a 6th century invisible repair to a piece that was taken for a relic, would be in the area where the radiocarbon dating sample was taken. >The very idea that the sample taken for C dating happened to have Margaret of Austria’s invisible repairs is so improbable, statistically speaking, as to be for all intents and purposes a non starter. No. Far from being, “so improbable” that “the sample taken for C dating happened to have Margaret of Austria’s invisible repairs” it is highly probable that it was from the same area, given that both were for the same underlying reason: 1) to repair the most badly damaged corner, from which relics had been taken; and 2) to take the sample from the most badly damaged corner, from which relics had been taken!.","date":"2012-01-10","mins":"12:37 am","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","title":"Sciencebod, Do some homework on the Shroud of Turin"},{"id":"comment-6737","author":"stephen_e_jones","post":"In response to Sciencebod making a comment on my blog about when was the repair done, I wrote that I hadn’t given it much thought, but on checking Benford & Marino’s online 2008 Chemistry Today paper, I provisionally accepted it was in the 16th century. Then in response to Sciencebod’s pointing out the unlikelihood of bothering to invisibly mend a small part of the Shroud after the 1532 fire, I further checked and then wrote: ——————————————————————— Reading Shroud.com’s “Shroud History: 1500s” I would have thought between 1502 and 1509 when Marguerite of Austria took control of the Shroud and installed it at Chambéry Castle: “June 11, 1502: At the behest of Duchess of Savoy Marguerite of Austria, the Shroud is no longer moved around with the Savoys during their travels, but given a permanent home in the Royal Chapel of Chambéry Castle. …. 1509: New casket/reliquary for the Shroud is created in silver by Flemish artist Lievin van Latham, having been commissioned by Marguerite of Austria at a cost of more than 12,000 gold ecus. …” would be a likely time that invisble repairs were made to the Shroud. But I have ordered Joe Marino’s new book, “Wrapped Up in the Shroud” and will wait and see what he says in it. ———————————————————————.","date":"2012-01-09","mins":"6:36 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","title":"Sciencebod, Do some homework on the Shroud of Turin"},{"id":"comment-7172","author":"stephen_e_jones","post":"The Bible does not mention unicorns. The King James Version of 1611 English Translation of the Bible incorrectly translated the Hebrew word re’em a “wild bull,” as “unicorn” in Num 23:22; 24:8; Dt 33:17; Job 39:9,10; Ps 22:21; 29:6; 92:10 & Isa 34:7. Modern English translations such as the ASV, NIV and ESV correctly translate re’em as “wild ox”. As for the Shroud being “painted” Knight Errant is either ignorant or being deliberately provocative (i.e. A troll). Even the `Secular Bible’ Wikipedia effectively admits that the Shroud image is not a painting: “Painting The technique used for producing the image is, according to W. Mc Crone, already described in a book about medieval painting published in 1847 by Charles Lock Eastlake (“Methods and Materials of Painting of the Great Schools and Masters”). Eastlake describes in the chapter “Practice of Painting Generally During the XI Vth Century” a special technique of painting on linen using tempera paint, which produces images with unusual transparent features—which Mc Crone compares to the image on the shroud. This hypothesis was declared to be unsound as the X ray fluorescence examination, as well as infrared thermography, did not point out any pigment. It was also found that 25 different solvents, among them water, do not reduce or sponge out the image.The non paint origin has been further claimed by Fourier transform of the image: common paintings show a directionality that is absent from the Turin Shroud.” (“Shroud of Turin: Hypotheses on image origin Painting and pigmentation,” Wikipedia, 15 January 2012). Knight Errant’s, “There is no more reason to believe in God than to believe in unicorns,” reminds me of an atheist I debated years ago on an Internet forum who claimed that God was nonexistent like Santa Claus. So I asked him: 1) why does he bother debating the existence of God then? 2) On what other forums was he debating the non existence of Santa Claus? Internet atheists’ `body language’ (i.e. They waste a lot of time and emotion on someone they claim is non existent) shows that they are “the sort of atheist who does not so much disbelieve in God as personally dislike Him”: “Hopping around their web world, one quickly gets the impression that there are two basic types of atheist. The first is the sincere, scholarly atheist, the type who walked away from the Unitarians when they got too evangelical. The Maine Atheists Union typifies this bunch. They want to `think freely’ and `live free,’ and one of their main precepts reads: `Nobody has all of the answers and nobody ever will. Take the time to get as close as possible to the truth.’ The other group is like Orwell’s embittered specimen from `Down and Out in Paris and London,’ `the sort of atheist who does not so much disbelieve in God as personally dislike Him.’ These shrill types can be found in places like MSN’s God is a Lie! chat community and, of all places, high school. … What do they all have in common? For one thing, a preoccupation with Christianity. Look around the precincts of atheism and you’ll see lots of slogans like `The Religious Right is neither,’ but you’ll never see `Taoism is for dummies.’ Or, for that matter, much anti Judaism or anti Islam sentiment …” (Last, J.V. “You Gotta (Dis)Believe,” Weekly Standard, 30 July 2002)..","date":"2012-01-19","mins":"10:44 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-6746","author":"stephen_e_jones","post":"As I and others, especially Dan, have pointed out: 1. The Pray Codex (1192 95), 2. The Vignon markings unique to the Shroud on coins and art from the 6th century, 3. The exact match of bloodstains on the Sudarium of Oviedo (which has been in Spain since at least AD 840) and the Shroud, and now 4. The ENEA report showing that the Shroud’s image is only “one fifth of a thousandth of a millimeter” and therefore it could not possibly have been created by a medieval or earlier forger. Because of any one of the above, let alone all four, lines of conclusive evdience that the Shroud is not medieval, the AD 1260 1390 medieval radiocarbon date of the Shroud simply has to be wrong. The only question now is: how did the three radiocarbon laboratories get it so wrong? The ball is now in the Shroud anti authenticist court to try to find a face saving answer. The pro authenticity side no longer have to provide an answer since it no longer is (if it ever was) their problem. The 16th century invisible reweave theory is a possible explanation, among many, of how the radiocarbon labs got it wrong. If Sciencebod and his Shroud anti authenticist ilk don’t like that explanation, then let him/them find another. It’s now his/their problem, not ours!.","date":"2012-01-09","mins":"9:04 pm","url":"https://shroudstory.com/2012/01/09/sciencebod-do-some-homework-on-the-shroud-of-turin/","cat":"other_blogs","title":"Sciencebod, Do some homework on the Shroud of Turin"}]
