[{"id":"comment-7332","author":"stephen_e_jones","post":">It concludes: > >Perhaps one day the Father will exact an answer from many to this question: “How is it that you tried to shroud the glorified One in a medieval cloth? (26). (emphasis mine) The point is that we who believe in the authenticity of the Shroud are merely accepting the evidence that God the Father has provided us. Especially evangelical Protestant Christians like me, who believe in the Reformation doctrine of Sola Scriptura (the Bible alone), and have an inherent distrust of Roman Catholic relics, have every reason to reject the Shroud. The only reason I came to accept the authenticity of the Shroud is that in 2005, after nearly 40 years a Christian, and to the extent I thought about the Shroud at all, I assumed it was just another fake medieval relic, I became aware of the evidence for its authenticity in Stevenson & Habermas’ book, Verdict on the Shroud (1981), that I bought for $3.00 in a second hand bookstore. I only bought the book because: 1) it was co authored by evangelical theologian Gary Habermas whose writings I was familiar with as sound and evidence based; and 2) it cost only $3.00. I note that Anderson has a Ph D Philosophy of Evolutionary Biology. He should then appreciate that if the Shroud is a fake, yet God has allowed it to come into existence, complete with all the evidence for its authenticity, then God would be a “cosmic deceiver.” And then Anderson could not logically reject the extreme Young Earth Creationist “Appearance of Age” argument that God allowed the Universe to come into existence, complete with a fake history of it being billions of years old, when in reality it is only tens of thousands of years old..","date":"2012-01-22","mins":"10:04 am","url":"https://shroudstory.com/2012/01/22/correcting-an-article-about-the-shroud-of-turin/","cat":"news_&_views","title":"Correcting an article about the Shroud of Turin"},{"id":"comment-6364","author":"stephen_e_jones","post":">Professor Paolo Di Lazzaro … indicated … ‘….it appears unlikely a forger may have done this image with technologies available in the Middle Ages or earlier’, but their study does not mean the Shroud image could only have been created by the flash of a miraculous resurrection … Prof. Di Lazzaro is trying to have it both ways. If, as his experiments found, the Shroud image is only “one fifth of a thousandth of a millimeter” thick, which is “the thickness of the primary cell wall of [a] single linen fiber,” and required the equivalent of “a battery of ten thousand laser excimer[s]” delivering a total energy of “34 thousand billion watts,” to reproduce the image on the Shroud (ignoring the advanced artistry, the anatomical precision of the image’s wounds and bloodflows, it being a photographic negative hundreds of years before photographic negatives were invented, in 3 D, etc); then what actually is the alternative to “the flash of a miraculous resurrection”? As Sherlock Holmes famously observed: “… when you have eliminated the impossible, whatever remains, however improbable, must be the truth …” (Doyle, A.C., “The Sign of Four,” Penguin: London, 2001, pp.42 43. Emphasis original)..","date":"2011-12-31","mins":"3:31 am","url":"https://shroudstory.com/2011/12/30/how-fast-is-wikipedia-shroud-of-turin-article-updated-already/","cat":"news_&_views","title":"How Fast is Wikipedia? Shroud of Turin Article Updated Already"},{"id":"comment-28571","author":"stephen_e_jones","post":">If every time new scientific discoveries are made they are not presented where they should ( peer review journals) and instead, a best seller is written and published around Eastern or Christmas, this definitively sounds suspicious. The date of publication usually has little or nothing to do with the author. Publishing houses are businesses which exist to make a profit. And it is good business to publish Christian books (pro and anti ) at Easter and Christmas when they are more likely to be bought as a gift. Besides, this is the first “best seller … written and published around Easter… or Christmas” that I have heard of, in which the basis of it is scientific studies that are actually going to be peer reviewed and published in a scientific journal!.","date":"2013-03-28","mins":"5:00 am","url":"https://shroudstory.com/2013/03/28/email-of-the-day-doing-things-backwards/","cat":"books","title":"Email of the Day: Doing Things Backwards"},{"id":"comment-28569","author":"stephen_e_jones","post":">Fanti’s findings,now published in a book, are to be subsequently published in a “specialist magazine and assessed by a scientific committee.” Isn’t this backwards? The article actually said: “What’s new about this book are Fanti’s recent findings, which are also ABOUT TO BE PUBLISHED in a specialist magazine and assessed by a scientific committee.” (my emphasis). So, it seems that Fanti had waited until his paper had been peer reviewed and was about to be published in a scientific journal before he published his book about them. Also, that Fanti’s findings will be published in a book before they are assessed by a scientific committee and appear in a scientific journal does not mean that they were not submitted to the journal some time ago. Due to a backlog of papers to be peer reviewed and published, it often takes a long time for scientific journals to publish papers that have been submitted to them. For that reason, many scientific journals have a “Date submitted” near the beginning of each paper. Moreover, it is the rule rather than the exception these days for scientific findings to be first published in the popular press before they are peer reviewed and appear in a scientific journal. There are science news publications like Science Daily and Live Science which largely exist for that purpose. To criticise Fanti for doing what most other scientists routinely do is either ignorance of modern scientific publication practice, or a form of special pleading (`it’s OK if other scientists do it, but it’s not OK if a Shroud pro authenticity scientist does the same’)..","date":"2013-03-28","mins":"4:46 am","url":"https://shroudstory.com/2013/03/28/email-of-the-day-doing-things-backwards/","cat":"books","title":"Email of the Day: Doing Things Backwards"},{"author":"stephen_e_jones","post":"Sounds like a good read to me Stephen!Blessings in the peace of Christ Jesus the Risen Lord! g.","date":"2010-02-05","mins":"9:30 PM","url":"http://theshroudofturin.blogspot.com/2010/02/ian-wilsons-new-book-shroud-2000-year.html","title":"\nIan Wilson's new book:  \"The Shroud: The 2000-Year-Old Mystery Solved\"\n"},{"id":"comment-1073","author":"stephen_e_jones","post":">As for the Shroud of Turin being a Jewish tallit, that is another matter. It is hard to fathom. It would be great if the Shroud was a Jewish tallit (i.e. Prayer shawl) because it would be another problem for the medieval European forgery theory to explain. But the Shroud is in fact a single (even the so called `side strip’ and `seam’ are part of the same cloth) sheet of linen, 8 cubits x 2 cubits (4.34 m x 1.09 m). It has no “special twined and knotted fringes known as tzitzit attached to its four corners” (Wikipedia) and nor is it “made of wool” as “Most traditional tallitot (plural of tallit) … are” (Wikipedia). As has been previously commented, given the very high quality of the Shroud’s 3:1 herringbone twill weave, it is possible that the cloth may not have been originally intended to be for a burial shroud. The Gospels record that Joseph of Arimathea “bought some linen cloth” (Mk 15:46) hurriedly because “the Sabbath was about to begin” (Lk 23:53 54). So the linen cloth that Joseph bought many have been intended for clothing or a tallit. But short of asking Joseph of Arimathea when we get to Heaven (and even he might not know what the cloth he bought was intended for!) it seems inherently impossible to resolve this question. Nevertheless, I look forward to reading the gist of John Lupia’s argument. Stephen.","date":"2010-03-02","mins":"8:44 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1089","author":"stephen_e_jones","post":">I do not think the translation that reads Joseph of Arimathea “bought some linen cloth,” is expressing the author’s intended sense John’s “I do not think” is a big climb down from his original claim that, “the role Joseph of Arimathea played with the Shroud it has been completely obscured by inept translations” (my emphasis). >It should be pointed out that “agorasas” does not exclusively mean “to purchase, or to buy”, since it can also mean “redeem” or “to pay the tax”. Again, John’s “not exclusively” and “it can also mean” is also a big climb down from his original claim above. And according to my computerised Parsons NT Greek English Dictionary (to save me going through and quoting my hardcopy lexicons), agorasas is a variant of the verb agorazo, which primarily means “to go to market, i.e. (by impl.) to purchase” and only secondarily means “spec. To redeem” hence its overall meaning is “buy, redeem” in that order. Now sometimes the secondary meaning of a word can be the correct one in that context, but that is a case John would have to argue on its merits, not by dismissing out of hand ALL (by implication) “translations” of Mark 15:46 as “inept”. >since it was a Jewish holy day and it is scarcely conceivable that shops selling linen or anything else were open. The Gospels make it clear that it was before the Sabbath: Mk 14:42 “It was Preparation Day (that is, the day before the Sabbath),” which was also the Passover that year). And so there was no reason why the markets would not have still been open until sundown. Besides, redeeming linen would be just as much a problem as buying it if there were no “shops selling linen or anything else … open.” And so in the context, Joseph of Arimathea buying new pieces of linen in the Jerusalem markets, fits better than him, a wealthy member of the Sanhedrin, redeeming used linen. Even if it be granted that “redeeming” was a usual term for buying used linen, which seems unlikely, as “redeem” has the meaning of buying back something that one formerly owned, i.e. “To recover ownership of by paying a specified sum” (The Free Dictionary). Which is especially unlikely in the case of the “rich man” Joseph of Arimathea (Mt 27:57) that he would have to buy back (e.g. From the 1st century equivalent of a pawnshop?) linen that he had previously owned! Stephen.","date":"2010-03-04","mins":"10:50 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"author":"stephen_e_jones","post":"Anonymous>I was seriously considering buying Dayvault's book. I read what you write and realize that I would just have thrown away my hard earned money !In respect of its main claim: that a mosaic tile which is the earliest known example of a copy of the Image of Edessa/Shroud face, just happens to be THE Keramion, a tile bearing the image of Jesus' face, which disappeared from Constantinople in 1204; you would indeed have wasted your money.What is the likelihood that a relic which was looted from Constantinople in 1204, would end up in a wall in a house in Edessa, which has been continuously under Muslim control since 1144, and where all images of Jesus were ruthlessly destroyed? Zero!It is a worry that Dayvault was an FBI agent. In this book he breaks what must be one of the first principles of investigation: don't become so fixated on one hypothesis which you want to be true that you lose touch with reality and ignore all the evidence against your hypothesis.I really struggle to understand how Dayvault could go to Sanliurfa, then to the Western end of the Citadel, look at the high wall surmounted by fortifications and call it a GATE! I can only charitably assume that Dayvault is massively deluded in this matter, instead of the more obvious alternative. I wholeheartedly agree with the first customer review of the book on Amazon.com with: http://www.amazon.com/Keramion Lost Found Journey Morgan/dp/16304764201.0 out of 5 stars Repetitive and lacking a convincing argument By The Wolf on April 4, 2016 ...Very very very very repetitive...at one third of the way through the book, he was still saying he was going to explain big things...the book could have been a long essay, perhaps...except he uses many words to indicate the uncertainty of his information. Words like: supposedly, according to legend, it is believed/thought, traditionally...many words that a scholar would never use...unless he did not believe his own conjectures. No new info in the first third of the book...just promises of something to come. And at times he jumps around so much the book is incoherent. I have read many good books on the shroud. This one is a waste of money and time. It does not deserve even one star. There is a HUGE amount of irrelevant padding in the book. It's as though Dayvault had to make it a ~300 page book to get it published.>Thank you so much Stephen !You're welcome. I am pleased to see that a Google search of \"Keramion Lost Found review\" (without the quotes) brings up my above blog review. I cannot understand how Russ Breault could give it 5 stars in his Amazon.com review. But then again, Breault's review says NOTHING about Dayvault's central thesis, that this Sanliurfa mosaic is THE Keramion. So it is a `damning with faint (albeit 5 star) praise'!Dayvault's book is an EMBARRASSMENT to sindonology and deserves to fail.Stephen E. Jones MY POLICIES Comments are moderated. Those I consider off topic, offensive or sub standard will not appear. Except that comments under my latest post can be on any Shroud related topic without being off topic. I normally allow only one comment per individual under each one of my posts..","date":"2016-04-28","mins":"12:01 AM","url":"http://theshroudofturin.blogspot.com/2016/04/my-review-of-keramion-lost-and-found.html","title":"\nMy review of \"The Keramion, Lost and Found: A Journey to the Face of God\" (2016) by Philip E. Dayvault\n"},{"id":"comment-1090","author":"stephen_e_jones","post":">the Shroud width does not measure 111 cm, but 113 to 113.7. Thanks to John for that latest measurement. I would appreciate a reference for it. So even on John’s own admission there is no one exact measurement of the Shroud, but only a range of measurements. That is also close enough (for me at least) to 2 x the Assyrian Royal cubit of 55.6 cm = 111.2 cm. Given that: 1. It is impossible to know what the exact original dimensions of the Shroud were, given that for centuries it has been stretched, using weights, by hanging it both vertically and horizontally; 2. It is unreasonable to demand that a ~2,000 year old cloth, produced when measurements were cubits, based on the length of part of a man’s arm and finger breadths, should conform exactly to the very centimetre or millimetre, to a multiple of an idealised average of one of those cubits, i.e. The Assyrian Royal cubit of 55.6 cm. >The unit of measurement you are applying is the wrong one. Short of omniscience or a time machine, John cannot know that. His extreme dogmatism and absolutism is out of place in the field of Shroud studies. It is entirely possible that the Shroud was originally woven in the 1st century in Syria and intended to conform by its weaver to approximately 8 x 2 Assyrian Royal cubits. >I think we actually might be saying the same thing, in a sense, since you are assertive that the Shroud can be shown to conform to an ancient unit of measurement, just as I do. No. John’s claim originally was that: “The dimensions of the Shroud do not conform to 8 x 2 cubits of any sort” and he has never actually retracted that. My claim is that the dimensions of the Shroud would likely have originally conformed approximately to 8 x 2 of the Assyrian King’s cubit (~ 55 cm) or more likely Royal cubit (~55.6 cm). >The only difference is I found another ancient unit that works much better. Great! But paradoxically, if John’s proposed different ancient unit of measurement yields exactly the dimensions of the Shroud today, then it is almost certainly not the originally unit of measurement used by the weaver of the Shroud’s linen. That is because: 1) ancient units of measurement and their application were not exact (see above); 2) due to centuries of stretching the Shroud, both horizontally and vertically, as uncountable numbers of clerics held it up for display, with weights to stop it from flapping (it is approx. 4 x 1 metres yet only as thick as a shirt), as documented in art and photographs; and 3) an unknown length of the Shroud was cut off for relics; it is highly unlikely that the Shroud’s dimensions today are what it originally was, even if we could reconstruct exactly how much has been cut from its length. >I think you will be very pleased when you read about it. Sorry, but given John’s extremist dogmatic claims, to the effect that everyone else is wrong and only he is right, I agree with the commenter who wrote: “I think I’ll wait on the reviews before I spend this kind of money.” Stephen.","date":"2010-03-05","mins":"12:33 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1102","author":"stephen_e_jones","post":">The redemption or buying back of the tallit of Jesus by Joseph of Arimathea from the Roman soldier is more clearly explained in the book when you read in context. John just ignores Mt 27:59 which states: “Joseph took the body, wrapped it in a clean [kathara] linen cloth …” That is a total refutation of his theory that the Shroud is Jesus’ tallit, since the Gospels record that after Jesus had been flogged and crowned with thorns, the soldiers put Jesus’ own clothes (which would include his tallit) back on his by then bleeding body: Mt 27:26 35. 26 Then he released Barabbas to them. But he had Jesus flogged, and handed him over to be crucified … 28 They stripped him and put a scarlet robe on him, 29and then twisted together a crown of thorns and set it on his head. … 31 After they had mocked him, they took off the robe and put his own clothes on him. Then they led him away to crucify him. … 35 When they had crucified him, they divided up his clothes by casting lots. Jesus’ bloodstained tallit would have been among these same clothes that the soldiers gambled for and which John claims Joseph of Arimathea bought back from one of them and used as Jesus’ burial shroud. But since Mt 27:59 makes it clear that Jesus’ burial shroud was “a clean [kathara] linen cloth” it could not have been Jesus’ tallit. Stephen.","date":"2010-03-06","mins":"4:24 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1097","author":"stephen_e_jones","post":"John >The Pesach Eve is a Jewish holy day, not only the Pesach (Passover). Whatever the Jewish custom is today, the Gospels don’t say that the Day of Preparation, on which Jesus was crucified (Mk 15:42; Lk 23:54; Jn 19:31) was then in the 1st century a holy day in which no work, such as buying and selling could be done. In fact the emphasis of the Gospels is that Jesus’ body had to be removed before sundown, because it would then be the Sabbath (when no work could be done – Lk 23:53 24:1), and the Jews did not want the bodies left on their crosses to defile that holy day: Jn 19:31. Now it was the day of Preparation, and the next day was to be a special Sabbath. Because the Jews did not want the bodies left on the crosses during the Sabbath, they asked Pilate to have the legs broken and the bodies taken down. >I can see you never understood my point that Joseph of Arimathea purchased back or redeemed the tallit of Jesus won in a dice game at the crucifixion. I did not even know that was your point, because as far as I know, you had not stated it here. But the Gospels say nothing about Joseph of Arimathea redeeming Jesus’ tallit, when they surely would have (it being a redemption theme) if it happened. Besides, the Gospels have a word for tallit, Gk. Himation “garment, robe, cloak.” It is highly likely that a tallit is meant when the Gk. Kraspedon “a fringe or tassel” is used in conjunction with it, e.g. The woman with a haemorrhage and others being healed by merely touching the “hem,” “edge” or “border” of Jesus’ garment (Mt 9:20; 14:36; Mk 6:56; Lk 8:44) and also when Jesus criticised the Scribes and Pharisees because they made “the tassels on their garments long” (Mt 23:5). So if Joseph had bought back from the Roman solders Jesus’ himation at least one of the Gospels would surely have said so. It doesn’t make sense that Mark, just after recording that the soldiers “parted his garments himatia” (Mk 15:24 KJV), would then say that “Joseph bought some linen cloth [sindona]” (Mk 15:46). Anyway, in researching the Gk. Himation on my computerised Parson’s Greek English Dictionary, I found a clear refutation of your theory that the Shroud is Jesus’ tallit, and that is Mt 27:59 which states that: “Joseph took the body” and “wrapped it in a clean [Gk. Katharos] linen cloth,” because Jesus’ outer garment by that stage would have been anything but clean, it having been placed back over his bleeding scourged body (Mt 27:31; Mk 15:20). Also, in Googling “shroud tallit” I found that the theory that the Shroud is a tallit, had been proposed by a Donald Smith in 1997: “Donald Smith, a new BSTS member from North London, has written inviting any Newsletter readers with the requisite specialist knowledge to get in touch with him to discuss a hypothesis he is working on that the Shroud was first a Jewish ‘Tallit’. Otherwise known as a pallium or himation, the measurements he gives for this are 118,4 cm by 444 cm – proportions of one to 3.74, rather than one to four as in the case of the Shroud. Working with 444mm as the Roman cubit and 555mm as the ‘legal’ or ‘Talmudic’ cubit, he proposes that the Shroud’s original length was 10 Roman or 8 Jewish cubits. He maintains that the Shroud is lacking a second seam with identical ‘hem’ and two corners, besides those known not to be original. He believes that all four corners, with ‘gams’ (letter like forms created in appliqué ribbon) were cut away. The two corner patches we do have are unequal in length, according to him, because an end strip of similar width to the seam and ‘hem’ combined was also, and last of all, removed. It was also these strips, he suggests, which made it possible to tie it as a ‘bag’.” (BSTS Newsletter, No. 46, Nov/Dec 1997). So the problem is not that the Shroud may have been a Jewish tallit: I said at the outset it may well have been. Although having now realised there is a Gk. Word for tallit (himation), I don’t think the Shroud could have been actually a tallit, complete with tassels, etc, but may have been the fine linen sheet basis of a tallit, or other piece of fine linen clothing. No, the problem is your theory that the Shroud was Jesus’ tallit, because the Gospel evidence is against it. Stephen.","date":"2010-03-05","mins":"11:03 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1104","author":"stephen_e_jones","post":"John >The scriptural narratives were exhaustively researched and the explanations given in the book address and answer the very point you have made since there is strong evidence that the tallit Shroud was washed prior to burial. Sorry, but “clean” katharos, “clean (lit. Or fig.):–clean, clear, pure” does not mean “washed” which is (Gk. Nipto Mt 27:24; Jn 9:7,11,15; 13:14; 1 Tim 5:10; brecho Lk 7:44; baptizo Lk 11:38; louo Jn 13:10; Ac 9:37; 16:33; 1 Cor 6:11; Heb 10:22; 2 Pet 2:22; Rev 1:5; or pluno Rev 1:5). Especially the latter: “and have washed [pluno] their robes” (Rev 1:5). If Joseph of Arimathea had bought back Jesus’ bloodstained tallit and washed it, at least one of the Gospels would surely have said so and used one of the words for “washed” above, but they don’t. You are trying to make the evidence fit your theory but you should try to make your theory fit the evidence. Any theory can be propped up by adding `epicycles’ as you are doing to try to make it seem to fit the evidence, but in the end your theory has too many special assumptions that aren’t in a straightforward reading of the relevant Gospel accounts. In science Occam’s Razor decrees that the simplest theory which fits all the facts is the best. And the simplest theory that fits all the relevant facts in this case is that Joseph of Arimathea bought in the market a clean linen cloth and used that to enshroud Jesus’ body. I feel for you, that you have spend many years and written a book based on a theory which contains a fatal flaw. But that is the case and `shooting the messenger’ won’t change it. Stephen.","date":"2010-03-06","mins":"8:30 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1078","author":"stephen_e_jones","post":">The dimensions of the Shroud do not conform to 8 x 2 cubits of any sort. Disagree. Since Syria was the Middle East centre of linen production in the first century, the Assyrian cubit was the likely measuring unit for the Shroud. According to the article, Guralnick, E., “Sargonid Sculpture and the Late Assyrian Cubit,” Iraq, Vol. 58, 1996, pp.89 103), there were three Assyrian cubits: the Standard (51.5 cm = 20.3 in), the King’s (55 cm = 21.7 in) and the Royal (55.6 cm = 21.9 in). The Shroud’s 435 x 110 cm divided by the middle cubit value of 55 cm is a near exact multiple of 8 (7.91), and an exact multiple of 2 (2.00), respectively. And given that the length of the Shroud has been reduced by relic taking (Ricci, G., “The Holy Shroud,” 1981, p.7), it is not unreasonable to assume its original length was 440 cm, or 8 cubits of 55 cm. But if it is objected that the King’s cubit was rare, the more common Royal cubit of 55.6 cm would yield an 8 x 2 cubit Shroud of 445 x 111 cms, which at only 10 cm longer and 1 cm wider than the Shroud, which even if it is not granted that the length of the Shroud has been reduced by relic taking, is still a very close approximation for what is after all, a cloth measured in a pre industrial society. >As for the Gospel of Mark telling us about the role Joseph of Arimathea played with the Shroud it has been completely obscured by inept translations. The original Greek does not necessarily read as translations have it Surely John is not claiming that ALL English translations of Mark 15:46 are “inept” in having “COMPLETELY obscured” the original Greek and ONLY his translation is right? The vast majority of my nearly 30 e Sword English translations of Mark 15:46 render the Greek, “… he/Joseph bought a linen cloth …” This agrees with my Interlinear Greek translation: “And having bought a piece of unused linen …” According to my Greek lexicons, the verb rendered “having bought” is agopasas, which is in the first aorist tense, i.e. A simple completed action, from the root agora, “market place”. Wuest’s “Expanded Translation of the Greek New Testament” which pays particular attention to the exact meaning of the Greek verbs, renders it: “And having purchased fine linen in the market place …” Stephen.","date":"2010-03-04","mins":"1:21 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1109","author":"stephen_e_jones","post":"John >If a tallit is clean, as Matthew 27:59 says it is, by implication it has been washed. For even new unused tallitot were washed if sold in the market. Not washed clean of bloodstains from being placed over a bleeding living body that had been scourged and crowned with thorns! That would have made Jesus’ tallit ceremonially unclean on what you claim was a holy day. There is also the impossibility of cleaning a 4.5 square metres, absorbent linen sheet of all traces of blood, in the limited time available. Also washing it would be work on what you claimed was a holy day. So why is it OK to work washing a large bloodstained linen sheet on a holy day (according to you) but not OK to work selling a “clean linen cloth” (Mt 27:59) on a holy day? And why would Joseph go to all that trouble? There was no requirement that Jesus’ burial shroud had to be his tallit. To try to save your theory that the Shroud is Jesus’ bloodstained tallit washed clean (of which there is nothing in the Gospels) from being falsified by Mt 27:59, that “Joseph took the body” and “wrapped it in a clean [Gk. Katharos “clean, clear, pure”] linen cloth,” you have now made it self contradictory. Stephen.","date":"2010-03-07","mins":"10:34 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1115","author":"stephen_e_jones","post":"John You are taking my critique of your theory too personally. I have nothing personally against you or your theory. Indeed, I said at the outset, “It would be great if the Shroud was a Jewish tallit (i.e. Prayer shawl) because it would be another problem for the medieval European forgery theory to explain.” I am only interested at getting at the truth. >If you are a Jew then you do not work on a Holy day. If you are a Roman fullo you can work since they were Gentiles and not bound by Mosaic law. So now, in order to save from falsification by Mt 27:59 “Joseph took the body [and] wrapped it in a clean linen cloth” your theory that the Shroud is Jesus’ tallit that was put back on His scourged and crowned with thorns bloody body (Mt 27:26 35), you are proposing yet another `epicycle’ that Joseph of Arimathea, on a holy day (according to you) circumvented the Mosaic Law by employing a Gentile to wash Jesus’ bloodstained tallit. But apart from the dishonesty in the things of God you would then be attributing to Joseph, a devout Jew (“a disciple of Jesus” – Mt 27:57; Jn 19:38; who was “waiting for the kingdom of God” – Mk 15:43; Lk 23:51), that would still be work in that it would be a Jew buying services off a Gentile on a holy day (according to you). And if only Gentiles could then work on Passover Eve (according to you) then why could not Joseph have “bought some linen cloth” (Mk 15:46) from a Gentile market stall? Since Syria was then the major linen production centre in the Middle East, it is highly likely that there would have been Syrian markets selling linen open on Passover Eve, if not in Jerusalem itself, then outside the then city’s walls. Also the word for “bought” (Gk. Agorasas), does not mean “redeem” (except “figuratively”), i.e. “Agorazo does not mean `to redeem'”: “Buy, Bought … agorazo. Primarily, “to frequent the market place,” the agora, hence “to do business there, to buy or sell,” is used lit., e.g., in Matt. 14:15. Figuratively Christ is spoken of as having bought His redeemed, making them His property at the price of His blood (i.e., His death through the shedding of His blood in expiation for their sins), 1 Cor. 6:20; 7:23; 2 Pet. 2:1; see also Rev. 5:9; 14:3,4 (not as AV, “redeemed”). Agorazo does not mean “to redeem.” See REDEEM.” (“Vine’s Expository Dictionary of New Testament Words” My emphasis). There is a form of agorazo, that doe mean “redeem,” namely exagorazo: “Redeem, Redemption … exagorazo. A strengthened form of agorazo, “to buy” (see BUY, No. 1), denotes “to buy out” (ex for ek), especially of purchasing a slave with a view to his freedom. It is used metaphorically (a) in Gal. 3:13; 4:5, of the deliverance by Christ of Christian Jews from the Law and its curse; what is said of lutron (RANSOM, No. 1) is true of this verb and of agorazo, as to the Death of Christ, that Scripture does not say to whom the price was paid; the various suggestions made are purely speculative; (b) in the Middle Voice, “to buy up for oneself,” Eph. 5:16; and Col. 4:5, of “buying up the opportunity” (RV marg.; text, “redeeming the time,” where “time” is kairos, “a season,” a time in which something is seasonable), i.e., making the most of every opportunity, turning each to the best advantage since none can be recalled if missed.” (“Ibid.“). So if Joseph had bought back Jesus’ tallit from the Roman soldier who had won it in a gamble (Mk 27:35; Mk 15:24; Lk 23:34), Mark would have used exagorasas. Except that if Joseph had bought the linen privately from a Roman soldier, he would not have used either agorasas or exagorasas, since as Vine says above, they mean “primarily, `to frequent the market place,’ the agora, hence `to do business there, to buy or sell'” (my emphasis). There is another word under Vine’s “Buy, bought,” namely oneomai “to buy, in contradistinction to selling”: “oneomai `to buy, in contradistinction to selling,’ is used in Acts 7:16, of the purchase by Abraham of a burying place.” (“Ibid.“) that Mark would have used in Mk 15:46 if he had meant that “Joseph bought some linen cloth” privately from a Roman soldier. Stephen.","date":"2010-03-07","mins":"9:37 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1121","author":"stephen_e_jones","post":"John >For your own edification buy a copy off Kittel and BGD. I have both. Kittel’s “Theological Dictionary of the New Testament” (1985) has “agorazo [to buy, redeem] exagorazo [to redeem] … agorazo 1. Meaning `to buy’ …” (p.19). Although “redeem” is in the heading of Kittel’s agorazo, it does not give “redeem” as a separate secondary meaning of “to redeem” under that heading but includes examples of redeem under “1. To buy.” There is no specific reference to Mk 15:46. BGD, i.e. BAGD (Bauer, Arndt, Gingrich & Danker’s “Greek English Lexicon of the NT,” 1979), for “agorazo” has 1. Lit … buy, purchase … sindona Mk 15:46 …” and 2. Fig. Based on the analogy of … bestowed freedom on a slave …” (p.12). So your own two recommended authorities, “Kittel and B[A]GD,” do not support your claim that agorasas means “redeem.” In fact BAGD specifically states of agorazo (i.e. Agorasas) in respect of sindona in Mk 15:46 that it means “buy, purchase” not “redeem.” Stephen.","date":"2010-03-08","mins":"11:33 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1126","author":"stephen_e_jones","post":"John >You must be using an abridged edition of Kittel … See Liddell, Henry George, and R. Scott, and H. Stuart Jones (1996) Greek English Lexicon You simply ignored my: BAGD (Bauer, Arndt, Gingrich & Danker’s “Greek English Lexicon of the NT,” 1979), for “agorazo” has 1. Lit … buy, purchase … sindona Mk 15:46 …” In fact BAGD specifically states of agorazo (i.e. Agorasas) in respect of sindona in Mk 15:46 that it means “buy, purchase” not “redeem.” BAGD is the world’s leading NT Greek English lexicon, which you yourself recommended. It specifically states that agorasas in Mk 15:46 means “buy, purchase,” i.e. “bought,” not “redeemed.” My Zodhiates’ “The Complete Word Study Dictionary: New Testament” (1992) also has under agorazo “from agora market place. To buy … Mark … 15:46 …” (p.75). My Thayer’s “Greek English Lexicon of the New Testament” (1901) under agorazo has “1. To frequent the market place. 2. To buy (properly, in the market place. … b. Figuratively: Christ is said to have purchased his disciples … But agorazo does not mean redeem (exagorazo …” (p.8. My emphasis). My 24 different e Sword English translations give the following translation of agorasas in Mk 15:46: “bought” 21; “got” 1; “buying” 1; “purchased 1. Not even one translated it as “redeemed.” To summarise, your theory is refuted (even if you refuse to accept it), that the Shroud of Turin is Jesus’ tallit for reasons including: 1. There is a Greek word himation for tallit which the Gospels don’t use for Jesus burial cloth but instead use sindon “linen” (Mt 27:59; Mk 15:46; Lk 23:53); 2. The Gk. Word agorasas in Mk 15:46 means “bought” not “reedemed”; 3. Mt 27:59 says that Joseph wrapped Jesus’ body in “a clean [katharos “clean, clear, pure”] linen cloth” not a bloody tallit that had been washed; 4. The Gospels don’t state that Passover Eve then was a holy day in which no work, including buying or selling, could be done. Rather, their emphasis is on the need to get Jesus’ body off the cross and entombed before sundown and the Sabbath (which was also the Passover that year) began (Lk 23:54 56; Jn 19:31); 5. Your theory is self contradictory because you claim Jews could not buy linen on Passover Eve, but you claim that Joseph of Arimathea, a Jew, bought Jesus’ linen tallit back from the Roman soldier who won it in a gamble (Mt 27:35; Mk 15:24; Lk 23:34; Jn 19:24). You appear to have invested so heavily in your theory, which is the basis of your book, that when presented with evidence that is false; you take the easy way out and ignore that evidence and/or commit the ad hominem fallacy of `shooting the messenger.’ However, other readers who can be bothered to have read this far, will make up their own minds on the truth of your theory and therefore the value of your book. I have made up mine. This is (hopefully) my final comment on this topic. Thanks for the discussion. Stephen.","date":"2010-03-08","mins":"6:14 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1135","author":"stephen_e_jones","post":">Lk 23:53 KAI KAQELWN ENETULIZEN AUTO SINDONI > >“And he took it down and wrapped it in his tallit” Firstly, John’s rendering of auto as “his” above is wrong. According to my Bagster’s “Analytical Greek Lexicon,” n.d., p.60; and Robertson’s “Grammar,” 1977, pp.101 102); auto is a neuter reflexive pronoun.” Therefore John’s “his” above should be “it.” As it is my Greek English Interlinear NT of Lk 23:53 (speaking of “the body of Jesus” in v.52): “… and taking down wrapped it [auto] in linen.” (Marshall, A., “The Interlinear Greek English New Testament,” 1966, p.349). Secondly, John’s rendering of sindoni as “tallit” (i.e. A Jewish prayer shawl) is wrong. According to my Bagster’s “Analytical Greek Lexicon,” p.367, sindoni is the dative singular of sindon. And sindon, according to my NT Greek English lexicons, means: “fine linen cloth; (a) for as used for swathing dead bodies … Mt 27:59; Mk 15:46 …” (Abbot Smith, 1937, p.407); “linen 1. Of the linen cloth in which the body of Jesus was wrapped Mt 27:59 … Mk 15:46; Lk 23:53 …” (Bauer, Arndt, Gingrich & Danker, 1979, p.751); “fine Indian cloth; fine linen; in NT a linen garment, and upper garment or wrapping of fine linen, worn in summer by night; and used to envelope dead bodies, Mat 27.59; Mar. 14.51,52; 15.46; Lu. 23.53.” (Bagster’s “Analytical Greek Lexicon, n.d., p.367, “a fine linen cloth … the use of this word for swathing dead bodies, as in Mt 27:59, may be seen in the letter regarding funeral expenses … a letter announcing the dispatch of a dead body … (Moulton & Milligan, “1. Linen cloth … in which the bodies of the dead were wrapped: Mt. Xxvii.59; Mk. Xv.46; Lk. Xxiii.53 …” (Thayer, 1901, p.576); “linen cloth, a sheet or wrapping of linen, probably square or oblong in form, worn by the Orientals at night (Mark 1451,52). Used also for wrapping dead bodies (Matt. 27:59; Mark 15:46; Luke 23:53 …” (Zodhiates, 1992, p.1290 91). Note that Bauer, Arndt, Gingrich & Danker’s lexicon above was recommended by John (as “BGD”), but it contradicts John’s claim. John also recommended Kittel’s lexicon but there is no entry for sindon in my one volume abridged edition of the latter. Thirdly, as previously pointed out, there is another word himation, which evidently encompasses the Jewish tallit, especially when it is used in conjunction with kraspedon “a fringe or tassel”: Besides, the Gospels have a word for tallit, Gk. Himation “garment, robe, cloak.” It is highly likely that a tallit is meant when the Gk. Kraspedon “a fringe or tassel” is used in conjunction with it, e.g. The woman with a haemorrhage and others being healed by merely touching the “hem,” “edge” or “border” of Jesus’ garment (Mt 9:20; 14:36; Mk 6:56; Lk 8:44) and also when Jesus criticised the Scribes and Pharisees because they made “the tassels on their garments long” (Mt 23:5).” On past experience, I don’t expect John to accept this evidence, so I am writing it for other readers to help them make up their own minds who to believe, the above leading NT Greek English lexicons, or John. Stephen.","date":"2010-03-10","mins":"11:03 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1159","author":"stephen_e_jones","post":"John >Your constant attacks critiquing a book you never read … I am not critiquing your book. I am critiquing your theory that the Shroud of Turin is Jesus’ tallit. And I can do that without reading your book, based on what I know about: 1. The Shroud of Turin; 2. The Gospels’ account of Jesus’ life, suffering, death and burial; 3. Jewish tallits in general; and 4. What you have said here about your theory contained in your book. If you had satisfactorily answered my critique of your theory, I would have been among the first to have bought your book. But you haven’t, so I haven’t. Remember that I am not against your theory in principle. At the very outset I wrote: “It would be great if the Shroud was a Jewish tallit (i.e. Prayer shawl) because it would be another problem for the medieval European forgery theory to explain.” and I still mean that. But unfortunately you have failed to respond adequately to my testing of your theory and have instead increasingly resorted to the `shooting the messenger’ ad hominem fallacy: “Shooting the messenger … `Shooting the messenger’ is a metaphoric phrase used to describe the act of lashing out at the (blameless) bearer of bad news. In ancient times, messages were delivered in person by a human envoy. Sometimes, as in war … An easily provoked combatant receiving such an overture could more easily vent anger … on the deliverer of the unpopular message than on its author, thus literally killing the messenger … In modern usage, the expression still refers to any kind of punishment meted out to the person bringing bad news, but has taken on an ironic dimension as well. `Attacking the messenger’ is a subdivision of the ad hominem logical fallacy.” (“Shooting the messenger,” Wikipedia, 9 February 2010) I have always assumed that when those I am debating with on the Internet start responding, not with reasoned arguments and evidence, but with ad hominem personal attacks, that is their `body language’ that they know deep down that their argument is weak. However, I am not saying that I won’t ever buy your book. I try to buy every book on the Shroud, even those that I disagree with. And it may be that, while your book’s central thesis that the Shroud of Turin is Jesus’ tallit is wrong, there is still much of value in it, e.g. Ancient linen and Jewish burial practices, etc. Therefore, I look forward to reading reviews of your book from those who have bought and read it. Stephen.","date":"2010-03-12","mins":"9:28 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1144","author":"stephen_e_jones","post":"John has corrected me, for which I thanked him, under the post, “The Gibson Study Really Says Nothing About the Shroud of Turin,” that there is in fact a side strip and seam on the Shroud. However, this is more evidence that the Shroud is just a piece of linen (as the gospels state: Mt 27:59; Mk 15:46 & Lk 23:53), not a finished garment like a Jewish tallit. That is because it would be unlikely that someone would make, and another buy, a finished garment with a seam running throughout it’s entire length. But that would be consistent with the Shroud having been just a piece of linen, which is all the Gospels say it was: “So Joseph bought some linen cloth” (Mk 15:46); intended to be made into maller items of clothing which would not include the seam. Which also raises further problems for John’s theory. Why would Jesus who criticised the Scribes and Pharisees for making “the tassels on their garments (presumably their tallits) long” (Mt 23:5), be wearing a 4.1 metre long tallit, which would be much longer than required as a bed sheet for His 1.8 metre high body? John could argue that this was just the tassels, but the underlying principle is not having ostentatiously long clothing. Related to this is Jesus’ criticism of King Herod’s soft and expensive clothes (Mt 11:8; Lk 7:25) contrasting them with John the Baptist’s outdoors clothing (“made of camel’s hair” – Mt 3:4; Mk 1:6). Yet the Shroud has been variously described as “fine linen,” “fine weave,” “expensive,” and “soft” (References omitted for brevity). Jesus would be a hypocrite if He Himself wore a soft and expensive tallit, while criticizing King Herod’s similarly soft and expensive clothing. Googling on “tallit” and “length” reveals that the largest traditional style tallit today (which is also the largest of all tallits) is “72 x 84” inches “Width x Length”, i.e. 1.83 x 2.13 metres (“Tallit / Prayer Shawl,” a Judaica.com). This is nearly twice as wide, yet half as long as the Shroud’s (~4.1 x ~1.1 metres). In response John may quote this Wikipedia article (since he is mentioned in it and may even have written it) that the typical tallit was longer in the first century: “The ancient Jewish tallit design was different than that known today. Originally it was a large white rectangular garment with tzitzyot [tassels] in each corner and was used as a garment, bed sheet, and burial shroud … Lupia shows the historical development of the tallit when its design began to change during the second half of the first century C.E. And began to take on the forms known today beginning around 1000 C.E. The long tradition of a single orthodox form of the tallit became modified in a more culturally diverse atmosphere and continued to change throughout time until it became permuted and shortened in length as the kitel, tallit katan, tallit gadol, and the more common tallit prayer shawl form know today” (“Tallit: History,” Wikipedia, 11 March 2010). Even if John was able to show that the typical 1st century tallit was ~4 metres long (yet only ~1 metre wide), he has another problem revealed by this Wikipedia article. Which is that, “Originally it [a tallit] was a large white rectangular garment … used as … a … bed sheet, and burial shroud.” In other words, his theory that the Shroud was a Jewish tallit, and not a linen sheet, is a distinction without a difference. For if the tallit Jesus wore was also his bed sheet, with some tassels attached, then absent the tassels, it would just be a bed sheet. But then the tallit of the itinerant Jesus, who often had “no place to lay his head” (Mt 8:20; Lk 9:58), would most likely have been woollen, because of its greater warmth and durability than linen, especially since the same Wikipedia article states that, “Most traditional tallitot (plural of tallit) … are made of wool” (my emphasis). Which in turn raises another major problem for John’s theory. Jesus’ tallit would be expected to show considerable wear and tear from His ~3 years’ public ministry, wearing it by day and sleeping in it at night, in usually rough terrain. Yet the Shroud’s condition is variously described as: “very good,” “surprisingly good,” “remarkably good,” “excellent,” “splendid condition,” and “like new” (References omitted for brevity). The Shroud is consistent with it having been “a clean linen cloth” (Mt 27:59) “bought” in the market place [Gk. Agorasas] (Mk 15:46) by Joseph of Arimathea, but it is not consistent (to put it mildly) with it being Jesus’ well used tallit that had been put back on over His bleeding body that had been scourged and His head crowned with thorns (Mt 27:26 35). Stephen.","date":"2010-03-12","mins":"7:12 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1165","author":"stephen_e_jones","post":"Gail Thanks for reviewing John’s book here. >He then explains that the side strip is not original to the Shroud but added on during the time of the Apostles. This is another flaw in John’s thesis. The side strip is original, it and the main body of the Shroud having been part of the same large cloth that had been cut into three parts, the middle part removed, and the two remaining parts (the `main body’ and `side strip’) then being rejoined expertly such that the threads appear to be continuous across the two rejoined parts. See quote from the BSTS Newsletter, No. 51, June 2000 in a previous comment. >The key to his argument is the identification of the sindon with the tallit … Again, according to all my Greek NT lexicons Gk. Sindon means “linen” not “tallit” (see previous comment). Also, all my 20+ e Sword translations of all 5 places sindon occurs in the NT (Mt 27:59; Mk 14:51,52; 15:46 & Lk 23:53) translate it as “linen” except the Message translates Mk 14:51 52 as “bedsheet” and NJB translates Mt 27:59; Mk 15:46 & Lk 23:53 as “shroud.” None of them translate sindon as “tallit.” >The fact that the Shroud can be shown to be an ancient Jewish tallit demolishes the 1988 C 14 dating and opens up the question of what went wrong. Agreed that if the Shroud was a form of Jewish tallit that did not exist after the 1st century that would be further evidence against the radiocarbon dating of it as medieval. However, even if the Shroud was an ancient Jewish tallit, does not mean it was Jesus’ tallit. Mk 15:46 says that Jesus “bought [Gk. Agorasas “buy in a market place”] some linen cloth” and Mt 27:59 says that “Joseph took the body” and “wrapped it in a clean linen cloth.” But Jesus’ tallit would not have been clean (to put it mildly) having been placed back over his scourged and crowned with thorns bleeding body (Mt 27:26 31; Mk 15:15 20). >The sixth chapter explains how the tallit is torn or cut at burial so that the fringes or tassels in each of its four corners are removed. This was done to the Shroud when strips of cloth were torn off its width at both ends taking these tassels with them, and the long strip replaced by the current side strip. As a look at a full length photo of the Shroud shows, there are no such tears or cuts at “each of its four corners” where tassels would have been torn or cut off. See also “Length Measurements on the Shroud of Turin: Restoration 2002.” And again see above that there is no “long strip replaced by the current side strip.” >The eighth chapter deals with the Greek text of the New Testament showing the choice of words carefully selected by the Evangelists all refer to the same thing, the tallit. Again see previous comment that there is a Gk word, himation (“garment,” “robe,” cloak”) that is mentioned in conjunction with tassels [Gk. Kraspedon “a fringe or tassel”] (Mt 9:20; 14:36; Mk 6:56; Lk 8:44). >… Jesus was wearing his tallit during the Passion and stripped of his garments at crucifixion. … This was won at a dice game by Roman soldiers and was purchased from the soldier who won it by Joseph of Arimathea. Again, the Gospels say nothing about Joseph of Arimathea buying any of Jesus’ garments off the Roman soldiers who cast lots for them (Mt 27:35; Mk 15:24; Lk 23:34). And again the Gk. Word “bought” agorasas means “buy in a market place” (an agora). >The ninth chapter discusses the manufacture of the Shroud fabric as a mixture of cotton and linen and that this type of linen thread was known in antiquity. The Shroud is not “a mixture of cotton and linen.” It is pure linen with minute traces of cotton attributed by textile expert Prof. Gilbert Raes (1973) to the loom it was woven on having also been used to weave cotton. But in fact there may be no cotton in the Shroud, the traces of cotton found being part of a medieval patch (see “The Raes Corner was an early indicator that something was wrong with the carbon 14 dating“). >The conclusion is the summary of salient points and it sums up the case in identification of the Shroud as an ancient Jewish tallit. Again that the Shroud was intended to be the basis of “an ancient Jewish tallit” (which in the 1st century was basically a bed sheet with tassels – “Tallit: History,” Wikipedia, 11 March 2010) is possible. But that the Shroud is Jesus’ tallit is against all the Biblical evidence. And also, Jesus’ tallit would almost certainly have been made of wool (as most were), given that wool was warmer and more durable that linen in the rough outdoors terrain that Jesus moved and slept in for much of the ~3 years of His public ministry. John’s theory has therefore been falsified for reasons stated above and in previous comments. And again I state that I have nothing personally against John, or his theory, and indeed I personally wish that it was true. Stephen.","date":"2010-03-21","mins":"9:35 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1171","author":"stephen_e_jones","post":"John >The theory presented by Dr. Mechthild Flury Lemberg is her theory, not a fact. It is a fact, revealed first by x rays, and available for you and anyone else to see for themselves, that “every thread in the weave of the Shroud is continuous through the seam and matches its corresponding side strip thread in position, thickness, and intensity” (Adler, A.D., 1997, “Concerning the Side Strip on the Shroud of Turin“). And it is a fact that Flury Lemberg personally examined the Shroud during its 2002 restoration and found that the Shroud’s main body and sidestrip are two separate pieces of linen joined by a seam. It is Flury Lemberg’s theory that the main body of the Shroud and its sidestrip were cut and then rejoined at the same time from a larger piece of cloth. And it seems to be the only reasonable explanation of those facts, which as far as I am aware all leading sindonologists (including Wilson and Whanger who originally proposed a completely separately woven sidestrip theory) now accept. If your theory depends on the sidestrip being a completely separately woven piece of linen added to the Shroud at a later time, then you would have to explain how two separately woven pieces of linen match so perfectly across “every thread … in position, thickness, and intensity.” >The Greek lexicons you have do not put sindon = tallit for some reason. Thanks for conceding it. The “reason” is that sindon means “linen” not “tallit”! >All you have done is shown that certain Greek lexicons do not have it, which is no proof at all. They are among the leading NT Greek lexicons, including BAGD which you personally recommended to me. That you have not yet cited a NT Greek lexicon which defines sindon as “tallit” (even as a secondary meaning) indicates, given your claim of extensive research over many years into the meaning of these words, that there is no NT Greek lexicon that defines sindon as “tallit.” >… you refer NOW to the dimensions of the Shroud from the Restoration in 2002 something you NEVER knew until I pointed it out to you. The same is true about the theory proposed by Dr. Flury Lemberg, which you NEVER knew until I pointed it out to you. And I thanked you at the time for your correcting me on these points. But it is not true that I “NEVER” knew them. As I stated later in a previous comment: But Googling on “Turn [sic] Shroud: Past, Present and Future” and “seam” I found a report (which I already had on my computer but had forgotten) on this in the BSTS Newsletter of June 2000 … That is, I actually had previously read that dimensions and side strip information in the BSTS Newsletter, No. 51, June 2000 and had saved it to my computer but had temporarily forgotten it. Anyway, this is another of your ad hominem fallacies of irrelevance. Although I had read this information previously and saved it to my computer, but had temporarily forgotten it, it is irrelevant to the truth of this matter, whether I personally did or did not know about it before you pointed out to me. >Raes … is the expert who did find cotton inside the threads at the time of spinning NOT weaving. Agreed. But it was only minute traces of cotton that he assumed was due to the Shroud being woven on the same loom (quotes can be supplied), not to the Shroud being intended to be a mixture of linen and cotton. And further research has suggested that the cotton in Raes’ sample, which was from the same contaminated corner of the Shroud as the radiocarbon dating sample was taken, was part of a rewoven patch, and there is no cotton in the Shroud itself. >All biblical evidence supports my thesis since my thesis is based primarily on the biblical evidence. But you would need to read my book to find that out. Gail has read your book and I was responding to her review. If she got it wrong, then take it up with her. >It is rather curious that a so called proponent of authentication of the Shroud of Turin is so driven to disprove a viable thesis that proves the Shroud is authentic. I am “driven” to follow the truth wherever it leads. It is of the utmost importance that proponents of the Shroud’s authenticity, test all theories about the Shroud, whether from anti or pro authenticity theorists. The Shroud pro authenticity cause would not be helped but harmed by uncritical acceptance of a false theory about the Shroud, on the basis of that if it were true, the Shroud would have to be authentic. Apart from the ethical problem of knowingly holding a false theory because it is most convenient or effective, anti authenticity critics would eventually discover the falsehood and the Shroud itself would be discredited, especially if it were discovered that Shroud pro authenticity theorists knew about the false theory but kept quiet about it. >One is wondering whose side you are really on. You have no need to wonder. I am on the side of Him who said, “I AM the Truth” (Jn 14:6). And one of my guiding Bible texts is, “Test everything. Hold on to the good.” (1 Th 5:21). You are evidently confusing your theory with the truth, such that anyone who disagrees with your theory is not on the side of the truth. Stephen.","date":"2010-03-21","mins":"9:28 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1087","author":"stephen_e_jones","post":">It is clear that the dimensions cannot be translated exactly as even you admit. John’s original claim was: “The dimensions of the Shroud do not conform to 8 x 2 cubits of any sort” (my emphasis). But now again he attempts to change the subject to “the dimensions cannot be translated exactly” (my emphasis). I made the points (not in this order) that: 1) the Shroud linen (if it is authentic) “is after all, a cloth measured in a pre industrial society,” with the clear implication that it is unreasonable to expect it to conform to modern standards of exact measurement; 2) “the length of the Shroud has been reduced by relic taking,” with the clear implication that no measurement of the length of the Shroud today can be exactly what it originally was; and 3) as to its width, the Shroud in fact does conform to one relevant 1st century measuring unit, the Assyrian King’s cubit of 55 mm, namely 2 cubits x 55 mm = 110 mm, the latter being the most commonly cited width of the Shroud; and the Shroud is only 1 mm wider than 2 Assyrian Royal cubits of 55.6 = 111 mm. I will also add: 4) the Shroud is a fabric that has over the centuries been stretched, particularly lengthwise, including at times with weights, and as STURP member Barrie Schwortz pointed out in an online interview, the Shroud changes its dimensions slightly depending on the relative humidity of its environment, so the criterion of an exact measurement of the Shroud, by modern standards of precision, is inappropriate and illusory. Stephen.","date":"2010-03-04","mins":"9:20 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1084","author":"stephen_e_jones","post":">This agrees with my Interlinear Greek translation: “And having bought a piece of unused linen …” This is a good example of what I am referring to since this is not what the Greek reads. The only points that I originally made regarding Joseph of Arimathea were that: “The Gospels record that Joseph of Arimathea `bought some linen cloth’ (Mk 15:46) hurriedly because `the Sabbath was about to begin’ (Lk 23:53 54).” To which John responded, “As for the Gospel of Mark telling us about the role Joseph of Arimathea played with the Shroud it has been completely obscured by inept translations” (my emphasis). But in response to my further support for my point from Mk 15:46 that Joseph of Arimathea “bought some linen cloth,” John has now chosen not to dispute “the role Joseph of Arimathea played with the Shroud” but instead has raised a different issue, whether the linen was “unused.” This is not a point I explicitly made, nor that I wish to debate, but just happened to be also in the interlinear text of Mark 15:46 that I quoted. Stephen.","date":"2010-03-04","mins":"7:34 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"author":"stephen_e_jones","post":"Janet>You might want to read my book, The Peril of the Sinister Scientist. It's a middle grade novel about a kid who thought he was cloned from the blood on the Shroud of Turin.Thanks but I'm not into novels. However, I have provided a link to your book at Amazon.com so that readers can check it out.You might want to also make a similar comment on Dan Porter's Shroud of Turin Blog under \"Likely Shroud of Turin Bestseller\" where he brings his readers attention to another fiction book about the Shroud, Jerome R. Corsi's \"The Shroud Codex.\"I know your book is fiction, but as a science teacher, I hope it makes it clear to your children readers that it would be impossible to clone the man on the Shroud (i.e. Jesus) from the extremely degraded and fragmentary DNA in the Shroud's bloodstains. I completed a Biology degree in 2004, in which I did a major assignment on cloning, and contrary to Jurassic Park based popular opinion, I found that it probably is impossible to clone a human being even from a full set of DNA. Reasons include: 1) cloning requires manipulation of DNA which damages it; and 2) there are cell cycle timing issues that appear to make it effectively impossible to clone humans. Also 3) most (if not all) governments have banned human cloning. Stephen.","date":"2010-03-17","mins":"5:36 AM","url":"http://theshroudofturin.blogspot.com/2010/03/robert-k-wilcoxs-new-book-truth-about.html","title":"\nRobert K. Wilcox's new book: \"The Truth About the Shroud of Turin\"\n"},{"id":"comment-24196","author":"stephen_e_jones","post":"Stevenson & Habermas (“The Shroud and the Controversy,” 1990, p.113) give three reasons (all from Dr. Frank Dr. Zugibe’s, “The Cross and the Shroud,” 1982, p.165) why the Shroud proves that Jesus was dead. First the body image exhibits signs of rigor mortis (incidentally a problem for the forgery theory even if the forger knew about signs of rigor mortis, why bother depicting it?): “Rigor mortis is observable on the Shroud in several places. The head was bent forward, the feet were somewhat drawn up, and the left leg in particular had moved back toward its position on the cross. Especially visible in the three dimensional image analysis of the Shroud are the retracted thumbs and the `frozen’ posture of the chest and abdomen. As was also noted by Bucklin [Medical Examiner, Los Angeles], the entire body was quite rigid and stiff, occupying some of the positions it did on the cross.” Second, some of the bloodflows are post mortem (another problem for the forgery theory as the distinction between pre and post mortem bloodflow was unknown in the 14th century): “The second evidence of death in the man of the Shroud is the post mortem blood flow, especially from the chest wound. If the heart had been beating after burial, the blood literally would have been shot out onto the cloth. But the blood oozed out instead. Also, a comparatively small quantity of blood flowed, and there was no swelling around the wound. Finally, the blood from the chest, left wrist, and feet separated into clots and serum and was much thicker and of much deeper color than it would have been prior to death.” Third (my favourite), if Jesus’ chest cavity was pierced with a Roman lance (as the Shroud attests), and if by some miracle he was still alive after it, there would be “a loud sucking sound” coming from the spear wound as he inhaled: “Zugibe [Chief Medical Examiner, Rockland County, New York] also mentioned a third piece of evidence based on his medical experience. If Jesus had been alive after the spear wound, the soldiers and others at the site would have heard a loud sucking sound caused by breath being inhaled past the chest wound. Zugibe related that when answering a distress call after a man had been stabbed in the chest, he heard the loud inhaling of the unconscious man all the way across the room. He saw this phenomenon as `a direct refutation of the theory that Christ was alive after being taken down from the cross.'” But then why let the facts get in the way of a good story! Stephen E. Jones.","date":"2013-02-14","mins":"4:30 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"author":"stephen_e_jones","post":"I have copied this comment and my reply to under the post it should have been, \"`Fn Fz': Turin Shroud Dictionary.\" Any further replies to this comment, and my replies to it, must be under my \"`Fn Fz': Turin Shroud Dictionary\" post.Stephen E. Jones Reader, if you like this my The Shroud of Turin blog, and you have a website, could you please consider adding a hyperlink to my blog on it? This would help increase its Google Page Rank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks..","date":"2015-05-16","mins":"6:11 PM","url":"http://theshroudofturin.blogspot.com/2015/05/my-shroud-of-turin-books-and-articles.html","title":"\nMy Shroud of Turin books and articles\n"}]
