[{"title":"An unsatisfactory faith insists upon forensic proofs","post":"I SAY AMEN, AMEN, AMEN (triple Amen it is called) TO THIS STATEMENT.  This person summarize is a few phrases what I said here over and over again in the past months !!!  I agree TOTALLY with every single word of this comment.  He said it all.\nI could even go further when he said “It is an unsatisfactory faith which insists upon forensic proofs.”  In this case, I would ask :  Is it really something we can call faith ???  Good question to meditate…\nAnd I love his first phrase : “When pressed to give his judgment on the shroud’s authenticity, Pope Benedict never went further than to affirm that it could prove a strengthening of faith among those who already believe.”  This is exactly what I said here the other day ! ;-)  The Shroud is here to strenghten the faith, not to convert people.  \nBut I agree with Ron to a certain extend on the idea that the Shroud can also be a good kick start for someone who is not sure about God and who is searching.  But it would be, in this hypothetical case, just the start of a long journey and not the destination.\n\n","date":"December 21, 2011 at 5:56 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5857","author":"Yannick Clément","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"Hey there may be lots of folk out there that need just that little nudge! God does work in mysterious ways ;-)\nDid Dawkins really say that? …LOL\nR\n\n","date":"December 21, 2011 at 6:19 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5858","author":"Ron","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"I’m sure you’re right.  I’m sure the Holy Spirit use this Shroud for the benefit of God (and of course, for the benefit of the persons who start a faith journey because of it).  But the main purpose of the Shroud to me that it can strenghten the faith of many people and help the faithful to finally believe that God is Love and not some Bogeyman sitting on a throne in the Sky with a baseball bat in his hands impatiently waiting to punish the sinners and throw them in Hell !!!  Even after 2000 years, there’s a lot of people who still see God that way (the Old Testament Way) even if it’s not the face of God that Jesus-Christ desperately wanted to show us.  And the Shroud to me is the proof of that.  When you look at this beaten face full of serenity and peace, it doesn’t fit at all with the face of God so present in the Old Testament (and even also in the New sometimes), i.e., the face of a insensitive Judge of the Universe who only applies the Law of Talion…  This face just doesn’t fit with the face on the Shroud.  The face on the Shroud fits better with the words of St-John : God is Love and he’s the one who love us first… \nThis was my spiritual editorial for today folks ! ;-)\n\n","date":"December 22, 2011 at 11:36 am","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5922","author":"Yannick Clément","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"I like Yannick Clément’s “triple amen.” :) \nAnd I like Dr. Peter Mullen’s “unsatisfactory faith.” That is a good challenge, a wonderful challenge. It strikes a note with me, I think this has been bothering me for days and it’s refreshing to hear it. Yes, I need to strive for better faith. We need to strive for better faith. And those who insist on substantial proof need to get on their knees and get busy with God while they are still able. Because there will come a time when it’s too late to acquire faith. \nI googled for the phrase “God of the Gaps” and discovered that’s an actual term. I assumed it meant that people refuse to believe in God until all the gaps are filled (or all the dots connected.)  \nBut actually,  “God of the Gaps” refers to the idea that anything which cannot be explained is assumed to be supernatural. \nI think the term is a little bit obscure. And, I think it’s a false observation most likely coined by people outside the faith. They don’t understand how we think, as Christians. The implication is that Christians are over-eager to label something as supernatural when it might not be. There are some impulsive people who may think like this but I believe most Christians are not so simple-minded.  We are intrigued that the Shroud MIGHT have been created by supernatural means but that doesn’t mean it was, and I think most people know the difference. \nAnyway… I think Dr. Mullen’s statement is related to this issue. True faith is able to accept that our knowledge is and always will be incomplete, until we see God face to face. Incomplete knowledge is an opportunity to **trust** God for what we don’t know, an opportunity to exercise faith. This is “satisfactory faith.”  It is pleasing to God.\n\n","date":"December 21, 2011 at 9:59 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5865","author":"AnnieCee","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"I wrote a paper (unpublished) about the thing called “God of the Gaps”.  I think there’s many people who think about the Shroud in those terms.  When something is not explained yet, some people have a bad tendency to immediately attribute it directly to God.  An act of God if you want.  And history is full of things that were not explained at a certain period of time and during these days, many peoples thought it was an act of God.  Then, science found out the real mechanism of nature behind the phenomenon and those peoples look like fools !  I think the same thing might happen one day with the Shroud is science finally resolve this “mystery” once and for all and explain it in “natural” term.  I don’t think you and I will live long enough to see this happen but who knows ???\n\n","date":"December 22, 2011 at 11:56 am","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5936","author":"Yannick Clément","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"It sort of bothers me a tad, that some folk would conclude because someone is ‘Interested’ in the Shroud: that includes all people involved in it’s study and interested in such, can somehow lack faith???. I’m talking most of us here also!…Sure the Church only agrees that it is a “reminder” of what Jesus did for us, but I believe that is just a politically correct answer. I’ll bet if you asked Pope Benedict what he really thought in private, his answer would be completely different!….Furthermore, If it is JUST a reminder, what is it doing here at all? Really? There are reminders everywhere, everyday, numerous churches with crosses etc; We’re not a simple minded bunch that jump to conclusions and Christianity is not by far a blind faith. Jesus made a statement to this ‘blind faith’, although I can’t seem to remember it well enough to quote it here. No one is making this Shroud a “criteria for faith”, but some believe it is real or think it may be, and thru study of it are trying to find it’s ‘meaning’…\nHow is searching for “forensic proofs” on the Shroud any different from the Insistent historical and literal studies of the Bible? These studies are not that we do not believe, but that we want to understand. I get the impression Rev Mullen may have a bias against the Shroud, as many of the Church do, and it’s nothing new!. Personally, I have no quelm in wanting to understand ‘everything’ I can about the Shroud, especially when it comes to my faith!! In my eyes it just may be a beautiful ‘sign’ or ‘message’ left here by our saviour….Now whats wrong with that? My faith is intact with or without the Shroud.\nThere is something about the Shroud which I cannot explain from the first time I gazed eyes on it, which has me in it’s grasp and has me wanting to know more about it’s providence, if such, but moreso of our Lord Jesus.\nR\n\n","date":"December 22, 2011 at 7:40 am","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5880","author":"Ron","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"Quote : “I’ll bet if you asked Pope Benedict what he really thought in private, his answer would be completely different!”\nI don’t know for the Pope but I can confirm you, my dear Ron, that I’m not thinking differently in private than I do here !  And I’m sure I’m not alone to think like M. Mullen !  Oh, by the way, I don’t have a bias against the Shroud… It’s not because we consider the Shroud as nothing so important for our faith that we have a bias against it !  ;-)  To us (those who think like M. Muller), the Shroud is just a confirmation of the Gospels.  Nothing more, nothing less.\nYou also talk about the “meaning” of the Shroud.  Ever thought about his message instead ?  God is Love and he love so much all mankind that he died for us on the cross and took all the blame, that’s the message and it’s a great one !  To me, the meaning of the Shroud is to be found in this message of love and hope for humanity.\nQuote : “My faith is intact with or without the Shroud.”  I’m really happy it is that way for you Ron.  Really. \nQuote : “There is something about the Shroud which I cannot explain from the first time I gazed eyes on it, which has me in it’s grasp and has me wanting to know more about it’s providence, if such, but moreso of our Lord Jesus.”  I’m just like you !  Even if the Shroud is the center base of my faith, I don’t know why but I’m completely fascinated by it.  Maybe it’s because, as a child of TV, I’m more attracted by images than maybe the older generations…  I think it’s maybe a part of the attraction and fascination I have for this object.\n\n","date":"December 22, 2011 at 11:51 am","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5932","author":"Yannick Clément","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"Yannick I never said you have a bias against the Shroud or that you think different then you say. I was talking about Mullen and the Pope, respectfully. Actually I happen to know that the Pope does believe in the Shroud’s providence, I read it somewhere and he was quoted. Don’t ask me where cause I can’t remember.\nHey I’m okay with whatever meaning you get from the Shroud, I’m glad you found it already and maybe it is as you say, but I’m not convinced thats all it is, hense I keep searching and I believe others feel the same. There may be more to it.\nThanks Yannick, like I’ve said my faith is intact and has been since I was a wee little lad. But it was meant as in that I don’t need the Shroud.\nI think with most people; visual stimulation is of a higher degree then anyother sense. Especially in this age as you say, but I have heard that it is also moreso for men then woman. (I just read that, it is not me saying it) ;-)\nR.\n\n","date":"December 22, 2011 at 4:59 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5960","author":"Ron","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"One last comment for you Ron about faith as teached by Jesus :  One of the most important message of Christ in the Gospels is to have a child faith.  Remember what he said about the children ?  We must become like children to enter God’s Kingdom !  Those who are like them (meaning those who believe with great confidence without needing proofs or without needing to “see”) are the ones with the higher degree of faith in Jesus mind.  I don’t pretend I get this level of confidence yet.  That would be very pretencious !  But I try everyday to go in that direction.  To try to get to this level of confidence which is the higher degree of faith someone can have.  It is the degree of faith the Saint’s have.  And I think that’s what M. Muller wanted to express when he talked about “It is an unsatisfactory faith which insists upon forensic proofs”.  He said that to express the view of the Church : that this kind of faith (I called it the “Thomas faith”) is way below the higher kind of faith praised by Jesus…  Having a faith of a child, that’s what Jesus (God) wants for his children.  I think we’re here on earth for this reason :  To gain more and more confidence.  Why ?  Whithout confidence, how can you be able to love ?  No confidence, no love.  This is as simple as this.\nHere I stop my second spiritual editorial of the day ! ;-)\n\n","date":"December 22, 2011 at 12:21 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5943","author":"Yannick Clément","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"I get what your saying Yannick, and I agree, we all strive to find that “Child faith”, which is not easy in this world. It is a fine course in which to lead our lives though!! …But I don’t agree in what Rev. Dr. Mullen procalims. I get a different sense of his words then you and I think he makes a mistake and very misplaced assumption. The ‘assumption’ being, that it is from a “lack of faith” that people seek more “forensic proofs” or lets call it information from the Shroud. That was my point and I think my analogy to the study of scriptures was a good point to this.\nR\n\n","date":"December 23, 2011 at 2:09 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-6037","author":"Ron","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"Does not Rev.Mullen ‘study’ scripture? All clergy will study scriptures and Why? …to ‘understand’ fully their meaning. The study of the shroud may be no different, it all depends on your view of the Shroud. Some have claimed in their belief the Shroud to be the 5th Gospel,  in a sense I tend to agree.\nR\n\n","date":"December 23, 2011 at 2:19 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-6039","author":"Ron","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"Quote : “The ‘assumption’ being, that it is from a “lack of faith” that people seek more “forensic proofs” or lets call it information from the Shroud.”\nIf it’s not a lack of faith, it’s surely a lack of confidence…  That’s why Jesus call us to try to have a child’s faith.  A child is full of confidence and never ask for a proof to believe in something !!!  We, the adults, then to lose this kind of faith as our rational part grow up.  And then, we start to call for proofs in order to believe !  That’s not the kind of faith that was praised by Jesus.\nSo, for the Shroud, it’s not at all an anti-christian thing to study and reflect upon this relic (whether it’s in a scientific or spiritual way).  Not at all.  It can even strenghten our faith !  So, it’s good.  But the problem would be that someone base ALL his faith in Christ upon this Shroud.  That would be really dangerous…  And this kind of faith would surely be very weak. That’s it.\n\n","date":"December 23, 2011 at 7:43 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-6067","author":"Yannick Clément","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"Having said what I just said, I think it’s important to specify that not having this kind of child’s faith yet (I stand in this position like 99% of the adults) is nothing to be ashamed of.  It’s normal.  But we have to tend to gain this kind of naive faith in a God named “Love”…\n\n","date":"December 22, 2011 at 12:32 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5946","author":"Yannick Clément","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"I thought you said the previous comment would be your last comment, LOL  ;-)\nR\n\n","date":"December 22, 2011 at 5:00 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-5961","author":"Ron","site":"shroudstory"},{"title":"An unsatisfactory faith insists upon forensic proofs","post":"\nYannick Clément :Quote : “The ‘assumption’ being, that it is from a “lack of faith” that people seek more “forensic proofs” or lets call it information from the Shroud.”\nIf it’s not a lack of faith, it’s surely a lack of confidence… That’s why Jesus call us to try to have a child’s faith. A child is full of confidence and never ask for a proof to believe in something !!! We, the adults, then to lose this kind of faith as our rational part grow up. And then, we start to call for proofs in order to believe ! That’s not the kind of faith that was praised by Jesus.\nSo, for the Shroud, it’s not at all an anti-christian thing to study and reflect upon this relic (whether it’s in a scientific or spiritual way). Not at all. It can even strenghten our faith ! So, it’s good. But the problem would be that someone base ALL his faith in Christ upon this Shroud. That would be really dangerous… And this kind of faith would surely be very weak. That’s it.\n“It is an unsatisfactory faith which insists on forensic proofs” …Sorry. I don’t think it’s even a lack of confidence, it’s just ‘Study’ Yannick, thats it. Sure no one should be idolizing this Shroud, I agree, BUT, that is not what Rev.Mullen was implying. He basically implied that anyone who studies the Shroud ‘in depth’ lack faith, he didn’t say confidence, he said “unsatisfactory faith” and he is definitely wrong on that point. You, as well as I and most on this blog, are students of the Shroud are we not? Are our faiths challenged? or are we lacking confidence in our faith?….I think NOT.\nJesus said; “Seek and you shall find”.\nR\n\n","date":"December 24, 2011 at 9:45 am","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","id":"comment-6088","author":"Ron","site":"shroudstory"}]
