[{"title":"Reply  – in small considered instalments – to Thibault Heimburger re my “Sorry Mr.Rogers” posting","post":"I use sciencebod01 as the first part of my email address, followed by the “at” symbol, followed by aol.com, broken up here to make life a little difficult for the spammers.\nI look forward to receiving those photos (but wonder why they are not already in the public domain if they are supposed to be a key exhibit in any debate as the authenticity or otherwise of the Shroud).\n","date":"June 27, 2012 at 10:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/23/reply-in-small-considered-instalments-to-thibault-heimburger-re-my-sorry-mr-rogers-posting-2/","cat":"blood","id":"comment-329","author":"colinsberry","site":"colinberry"},{"title":"Reply  – in small considered instalments – to Thibault Heimburger re my “Sorry Mr.Rogers” posting","post":"” A few days ago I gave you privately the possibility to obtain for free  etc etc…”\nSorry, but I have not the faintest clue what you are talking about Thibault. Privately?  By what means? An email? I have received no email. Nor have I seen a comment on this site or on Dan’s (which would hardly be private anyway). \nWhy privately anyway? Are these images not already in the public domain? Are you not able to provide a link? I hope those pictures are better than the ones I displayed above from the source you mentioned…\nOh, and while I don’t take kindly to people who adopt the overbearing  tone you did in that comment above, I most certainly did not respond with an ad hominem attack. If you think I did, then please accept that was not my intention. I am very happy to discuss  the science – but you are wasting your time telling this retired scientist that such and such was “dismissed ” years ago. Nothing is more guaranteed to get me intensely interested in the grounds on which something or other was dismissed, especially as the objectivity of so many ‘authenticists’ – including I hasten to add some STURP scientists –  has repeatedly been called into question by their resort to novel and often bizarre “crucifixion” or “resurrection” physics, chemistry or physiology. \nBut until I see those images, and have had a chance to study them, I see no point in commenting further.\n","date":"June 27, 2012 at 9:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/23/reply-in-small-considered-instalments-to-thibault-heimburger-re-my-sorry-mr-rogers-posting-2/","cat":"blood","id":"comment-327","author":"colinsberry","site":"colinberry"},{"title":"Reply  – in small considered instalments – to Thibault Heimburger re my “Sorry Mr.Rogers” posting","post":"On 24/6, I received in my mail box a message from “casting a critical eye…” (you), beginning by the words “Hello Thibault; is is kind of you visiting my humble blog..”;\nOn 25/6, I replied using the same way (=privately = it does not appear in your blog). This is the message I was speaking about.\nApparently, it does not work.\nNo, the ME photographs are not in the public domain.\nWould you give me your private email and I’ll send you immediately my previous email.\n","date":"June 27, 2012 at 10:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/23/reply-in-small-considered-instalments-to-thibault-heimburger-re-my-sorry-mr-rogers-posting-2/","cat":"blood","id":"comment-328","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Reply  – in small considered instalments – to Thibault Heimburger re my “Sorry Mr.Rogers” posting","post":"I will not comment your ad hominem attacks. Except that your description of my job is an insult, not only for me but for the many people I try to treat. You obviously don’t know what you are speaking about.\nA few days ago, I gave you privately  the possibility to obtain for free some of the Mark Evans photographs (no answer, no thanks) from the copyrights owner.\nThere are at least 3 of them showing bloodstains from low magnification (with the weave pattern, furrows etc..) to high magnification.\nBy looking at them, you’ll obviously see that you are completely wrong.\nRegarding the proteolytic enzyme (please read carefully the original article), you’ll find the details of the experiment. But, most important your comment ” and when nothing is known for certain about the integrity of the target protein, or the presence or absence of other proteins, e.g those of flax cells that may play a role in image formation and adhesion” is simply a non sense in this context. Incidentally I also have a degree in Biology. \nI’ll probably will not waste my time here.\n","date":"June 27, 2012 at 8:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/23/reply-in-small-considered-instalments-to-thibault-heimburger-re-my-sorry-mr-rogers-posting-2/","cat":"blood","id":"comment-326","author":"Thibault HEIMBURGER","site":"colinberry"}]
