[{"title":"Barbet vs Zugibe: Part 3 on Stephen Jones’ Blog","post":"We’ve already exchanged quite a lot of commentary on the relative merits of Barbet vs Zugibe. My recollection is that the fundamental difference is that Barbet is saying that the weight of the body is mainly suspended by the very high tension in the arms, which must in some way be taken by wrist bones to avoid tearng through the palms; whereas Zugibe claims that the bulk of the weight, maybe some 75%, can be taken by nail(s) through the feet. I don’t recall that Zugibe envisages the feet standing on a pedestal. \nBarbet’s version leads him to conclude that in order to maintain breathing, the crucifarius must therefore exercise some kind of see-saw motion constantly transferring his weight from his arms to his legs and back again.  He cannot maintain this action indefintely so that death is by asphyxiation.  \nZugibe does not see breathng as such a problem, as he claims that the weight being taken by the feet allows the crucifarius to breathe well enough.  So Zugibe is attributing death to shock. I don’t think it can be claimed that this is hair-splitting. \nI personally don’t find Zugibe’s scenario so plausible.  Binding a volunteer’s feet to the upright with a strap, is hardly the same as nailing the feet of a condemned man with all the pain that must have resulted.  However I’m not a forensic pathologist, and the bottom line has to be that only one so qualified can arbitrate between the two hypotheses as to which is more credible. At present I’m not aware what other professional corroboration Zugibe was able to muster for his version.\n\n","date":"December 21, 2013 at 7:36 am","url":"https://shroudstory.com/2013/12/21/barbet-vs-zugibe-part-3-on-stephen-jones-blog/","cat":"science","id":"comment-64083","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barbet vs Zugibe: Part 3 on Stephen Jones’ Blog","post":"My personal opinion as a medical doctor is that both conditions (asphyxia and hypovolemic schock) can be the cause death of a crucified man,\nHaving read Dr, Barbet«s book I was aware that nailing the feet of the condemned to the «stipes» provides no weight distribution to them, Dr. Barbet concluded that with experiencies he did with cadavers he crucified at the morgue of St. Joseph«s Hospital.\nSo being it is not unreasonable to state that death of the crucified would occur when accessory respiratory muscles (mainly pectoralis major, latissimus dorsi and even serratus anterior) activity, working in inverted chain will be exhausted.\nAs I’ve pointed out in  my book I’ve done an experience at my Gym with some volunteer fellows (about 10 as I can recall) which was as follows:\nI asked them ro suspend on a arm weight lift bar with arms spread doing about 65º with the horizontal plane, having no feet contact with the ground.\nAfter some time elapsed ALL of them experienced  shoulder pain and progressive (unbearable ?) dispnea and had to lift their body to relieve respiratory distress,,,,\nCan we conclude that Dr, Barbet was right?\n                                                                        Wish all of you a Merry Christmas\n                                                                          Antero de Frias Moreira\n\n","date":"December 23, 2013 at 8:52 am","url":"https://shroudstory.com/2013/12/21/barbet-vs-zugibe-part-3-on-stephen-jones-blog/","cat":"science","id":"comment-65580","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Barbet vs Zugibe: Part 3 on Stephen Jones’ Blog","post":"Just to clarify some points of disturbed respiratory cycle in a crucified victim,\nIn normal respiratory cycle inhaling iresults from active contraction of the diaphragm muscle, while exhaling is usually passive, resulting from elastic properties of the thoracic wall and negative intrapleural pressure.\nIn a crucified victim thie cycle inhaling/exhaling is greatly disturbed ,air being trapped in pulmonary alveoli and bronchi in exhaling phase ,so the great difficulty the crucified experiences is in exhaling\nThis is of course a theorethical logical assumption, because as far as I know  thank God nobody did such experiences in living persons, the only descriptions of evident respiratory failure and death of crucified-like people were descriibed by Dr. Pierre Barbet quoting Docteur Le Bec- he made a description of an ancient torture done by German Army officers suspending prisioners by their arms with hands tied to a transverse beam, their feet not touching the ground…\nThose victims experienced cyanosis, suffocation and ultimately death.\nTo overcome this abnormal  condition of exhaling impairment in crucified victims, ,accessory respiratory muscles that only work in a forced expiration I mean the Latissimus Dorsi and Pectoralis Major  must work in «reverse chain».\nHow?\nIn normal conditiions these muscles contract and their action is to approach the arms towards the thoracic wall, but in the crucified victim in an attempt to exhale, he uses them as accessory expirators, and at the same time lifting the trunk, because superior limbs nailed at the wrists cannot move.\nWheight is supported by the nailed feet, and the trunk approaches the arms while at the same time extending the partially flexed knees, so the angle of superior limbs with vertical diminishes and finally air can get out of the lungs and a new respiratory cycle begins.\nUnfortunately, the crucified victim has to pay a «high price» to achieve this.\nExperiencing the excruciating pain of neuropathic origin from injury of plantar nerves of the feet  increased by weigh bearing, and median nerves in the wrists, this horrible cycle comes to an end whem the victim is overwhelmed by muscle failure due to depletion of oxygen and energy storage leading to death by asphyxia.\nSurely hypovolemic schock may play an important role depriving muscles from oxygen and disturbing general metabolism and muscle metabolism, and theoretically can be the only cause of death, before respiratory failure occurs,\n                                                                         Antero de Frias Moreira\n                                                              (Centro Português de Sindonologia)\n\n","date":"December 23, 2013 at 11:48 am","url":"https://shroudstory.com/2013/12/21/barbet-vs-zugibe-part-3-on-stephen-jones-blog/","cat":"science","id":"comment-65708","author":"Antero de Frias Moreira","site":"shroudstory"}]
