[{"id":"comment-6838","author":"alan","post":"When I was 19 I had the most incredibly vivid dream I have ever had. In the dream I woke up, got up from bed, got dressed, drove to my church I used to attend when I was a kid and noticed several cars parked around the main entrance. The entire dream was in real time, including the drive to the church. I remember feeling the cold of the aluminum metal on the door, the spring breeze on my skin, the smell of the old carpeting in the lobby. I walked down the front stairs to the basement of the old building where my sunday school classes had been. There were new double doors with a small vertical window above each handle. I can’t explain why I did everyting I did in the dream I just did it. But I leaned over to look through the little window in the door. I saw all my extended family at folding tables arranged like a big “T” with the top of the T furthest from the door my eyes were instantly drawn to the center of the top of the T where I saw Jesus sitting and looking straight at me with a smile. I never stopped to wonder who He was= I knew the split second I saw Him that He was Jesus, no doubt whatsover. I yanked my head back and gasped and grabbed my face and was touching my eyes to feel that they were open, almost in shock, and saying to myself outloud ” oh my word, it’s REALLY HIM, I’M REALLY HERE, I’M AWAKE, AND THIS ISN’T A DREAM!!!” I was SURE I was NOT dreaming. I moved into the room and looked up and he was still looking right at me, as if no one else were in the room. I kept touching my face and even feeling my eyes to know that I was awake and not dreaming, and every time I looked up at Him I gasped and started to hyperventilate I could not keep staring at Him because I felt as if I was really going to faint with joy and being overwhelmed. I could feel His love as if it were a tangible thing going right into me and touching every part of me from the inside I felt amazing, but at the same time like I could fall to pieces from so much joy that I have never experienced on earth, and it was the same each time I looked slowly up at Him “OH MY WORD! IT’S REALLY HIM, I’M REALLY HERE, THIS IS NOT A DREAM.” I had to get close to Him. I just wanted to be near Him He saw through me but loved me so profoundly that I didn’t care about anything ever except being close to Him. I remember my aunt’s gossip, and my big uncle pushed back from the table hearing all their conversations, but I only wanted to and absolutely HAD TO be close to Him. When I got to Him I collapsed at His feet looking down at His feet I wept such tears that as I tried to open my eyes it was like looking down from the top of running fawcettes I never wept like that before I was just so indescribably glad to finally see Him in person, who my heart had longed for all my life to finally see Him for real there. I wanted to ask Him the only thing that mattered to me at the moment but couldn’t speak because of my sobbing, so I naturally just thought to Him, “am I gonna be with You forever?” knowing He heard my thoughts. And He leaned down, took my chin in His hand and gently brought my face up to His and said ” Ooooh yeaaaaaah” in the most loving and heart felt way. Then I woke up and it was morning for real, and I realized it was a dream, but my pillow was soaked with tears. I have shared this dream/ vision with a lot of people and always said there is not a picture that exists that comes close to portraying the immense love and joy in the face that I saw. But when I saw the painting by Akiane, it really stunned me how it looked like Jesus. In my dream there was so much radiance in His face and eyes that it was as if sunlight was coming from Him instead of to Him, and His eyes looked like they were full of sunlight dazzlingly gorgeous, like flecks of gold sparkling in them even though we were in a dull room with flourescent lighting. I’m 44 and I still remember all the details as if it happened this morning. But my faith is in Jesus, not a dream. I do believe I saw Him in person that night though. I believe that we will all recognize Him the instant we see Him, even if it’s across a vast room full of people. I believe that everyone who longs for Him will have the most immeasurable joy to see face to face for the first time the lover of their soul. For now we see dimly, but then we will see Him face to face..","date":"2012-01-12","mins":"2:18 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
