[{"id":"comment-201008","author":"arif_khan","post":"I am grateful and surprised to see my article features on this blog, thank you for posting it and presenting a fair and accurate summary of the points I made in it. A couple of items I wanted to comment on. 1. Sources for ‘Survival’ Theory We can debate about extracts from the differing Gospel accounts or bring up the Quranic verses on the Crucifixion, yet in fact the Shroud itself – if proved genuine – will actually be the best possible ‘eye witness testimony’ as to the events that took place. Over the years I have observed that a large majority of those who study the Shroud of Turin are believes in Jesus and his physical resurrection. When I’ve hoped to get objective and scientific analysis around if the man of the Shroud was still alive or dead often religious belief, especially relating to the authenticity of the account in the Gospel of John, seems to win out. I saw this in the late Dr Fredrick Zugibe’s book. It would be really good to get independent analysis on the different theories from a pathologist. If we do have this I would be very interested in seeing it. 2. Crucifixion does not ‘equal’ death As others have correctly pointed out there are accounts of people surviving Crucifixion in 1st Century Palestine. We know that certain sections of Josephus are interpolated, but have no reason to believe this about sections where Josephus talks about three of his friends hanging on crosses. He asked for them to be brought down, and they are and two do die, but one survives. Crucifixion usually took several days but Jesus’ was cut short due to the Sabbath. 3. Dr. Felzmann I was not aware of the work of Dr Felzmann – thanks to this Blog I will now be able to connect to him. Thanks again for the balanced coverage of the Review of Religions edition, and my article in particular, on this website. I’d be more than happy to keep in touch with the author and other readers..","date":"2015-06-03","mins":"4:02 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-201250","author":"arif_khan","post":"“Actually Pilate was surprised to hear that Yeshu’a died after only three to six hours on the cross since” – someone heavily experienced in Crucifixion. Yes, the scourging would have weakened Jesus, but the idea of Crucifixion was a long drawn out punishment. The pleural effusions do not specifically point to death. Joseph and Nicodemus quickly obtained the body and tended to it with healing herbs – Aloes and Myrrh. In terms of the time of day and time of year – it is interesting how three of the Gospel accounts talks about of ‘darkness’ at the time of the Crucifixion. There is also an earthquake mentioned and people fleeing. While these could me later embelishments, if they occured they would also help allow Jesus to survive..","date":"2015-06-07","mins":"1:52 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"}]
