[{"id":"comment-1459","author":"tersio_gorrasi","post":"It’s impossible an effect without its cause.One would ask: From where the physical laws, including gravity, came from? The physical laws means order, and order means not causality, not chance. Could the bright brain of this scientist at least be affected by his neurologic disease?.","date":"2010-09-28","mins":"8:04 am","url":"https://shroudstory.com/2010/09/24/stephen-hawking-says-gods-not-needed-continued/","cat":"news_&_views","title":"Stephen Hawking says God’s not needed. (Continued)"},{"id":"comment-1426","author":"tersio_gorrasi","post":"It’s just the Man of the Shroud, I believe, Who has all the answers about the mysteries of the Universe we need. There is no effect without a cause. If the Universe began by itself, only following the physical laws, then one would ask” From where such laws came out?” ‘Law’ means ‘order’and the chance only accounts for disorder, not order. This is so that scientists today attempt to “recriate” the Big Bang in the CERN by means of order (the action of human minds) and not by chance!.","date":"2010-09-09","mins":"8:18 am","url":"https://shroudstory.com/2010/09/02/stephen-hawking-says-gods-not-needed-so/","cat":"news_&_views","title":"Stephen Hawking says God’s not needed. So?"},{"id":"comment-201728","author":"tersio_gorrasi","post":"This hypothesis is untenable by all that we know about te Shroud. Even the minimal contact of the resurrected body with the cloth would produce distortions on the image, which don’t agree with we observe on it. Those image features are compatiible too, with the cloth being rectified both up and below of the body, rather than involving it.","date":"2015-06-12","mins":"2:19 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-7169","author":"tersio_gorrasi","post":"Well, unicorns could be easily produced through genetic manipulation over a dozen or less years. Therefore, its existence is theoretically possible!.","date":"2012-01-19","mins":"10:14 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"}]
