[{"id":"comment-3606","author":"tersio_gorrasi","post":"Why not to buy the relic and submit it to radiocarbon dating? I don’t have enough money for this.","date":"2011-08-14","mins":"7:59 am","url":"https://shroudstory.com/2011/08/14/mark-oxley-on-the-piece-of-the-shroud-of-turin-on-ebay/","cat":"books","title":"Mark Oxley on the Piece of the Shroud of Turin on eBay"},{"id":"comment-6709","author":"tersio_gorrasi","post":"This statement is completely absurd and should not be led in consideration. It only repeats Muslim beliefs about Jesus. Even a normal and healthy man would die as soon as the brutal flagellation was done, due to the massive loss of blood and fluids. We have still the physical effort of walking toward the Golgota, the great difficulty of breathing on the cross, and the ultimate spear in the chest, which perforated the cardiac wall via percicardium. Could someone survive at all?.","date":"2012-01-09","mins":"5:45 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-7034","author":"tersio_gorrasi","post":"Once again, Mr Helmut insists on the absurd idea of that Jesus did not die in the cross, mentioning an article of the forensic physician Dr Lorente, that not even has date. Such an article, besides to ignore the spear in the chest, that surely did not come from a pulsatile heart (the blood flowed slowly, rather than in spurts), it not concern about how could an alive person to produce such an image on the cloth that wrapped, him, without any distortion (this coul be easily verified with experiments in voluntary persons). This only reinforces my hypothesis of the time running backwards for all physical events in the space limited within the Shroud. I have had suggested to John Jackson (whick ignored me) an interesting experiment, supposing the Man of the Shroud floating in the vertical position, and the Shroud rectified both ahead and back to Him. The distances of the Shroud rectified this way and the different regions of the body would be measured and such distances compared with the approximate time when the wounds were produced, considering as t0 the time when Jesus was arrested. If my hypothesis is valid, there will be a direct proportion between time and distance.","date":"2012-01-16","mins":"7:47 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-6947","author":"tersio_gorrasi","post":"Dear Mr Helmut My hypothesis is not my phantasy. It’s based on what we can detect in the Shroud and in the Bible itself. See for example Ezekiel 37:4 10, Isaiah 38:8, 2 Kings 20:9 10 and Joshua 10:13. We understand as miracle something extraordinary which has not scientific explanation up today, but perhaps in a future time this explanation would come from new physical laws. This cannot be ruled out!.","date":"2012-01-13","mins":"7:00 pm","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-6913","author":"tersio_gorrasi","post":"It´s Interesting as nobody still thought about changes in time flow as a possible cause in the process of the image formation on the Shroud. Many features could be explained this way. I think about a time flow running backwards over a limited region of the space inside the tomb. Yes, this could be concerned as either science fiction or pseudo science in the present state of the art, but it cannot be ruled out if we want to solve this fascinating mistery. This way, the rate of radiocarbon dating would slow because many C14 atoms returned to they initial state and some features of the Man in the image would look as if He was alive again! One could be surprised as a very old cloth is so well preserved as well (see the tilma of Guadalupe and the Sudarium of Oviedo as other examples).","date":"2012-01-13","mins":"7:20 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-3444","author":"tersio_gorrasi","post":"Very good article. I think that those two forgetful angels found in the sepulcher could have a very important role in the process of the Resurrection. According my viewpoint, they could have placed Jesus’ body in the vertical position (suggested by His hair) changing the gravity and the time space due to their presence in the tomb scenario.","date":"2011-07-27","mins":"8:26 am","url":"https://shroudstory.com/2011/07/25/paper-chase-the-shroud-of-turin-from-the-viewpoint-of-the-physical-sciences/","cat":"news_&_views","title":"Paper Chase: The Shroud of Turin From the Viewpoint of the Physical Sciences"}]
