[{"id":"comment-2920","author":"muzaffar","post":"Leaden Books from Jordan Is there anything new? The recent uproar on the alleged discovery of the leaden book is a phenomenon West undergoes after every few decades. I have a long list of such discoveries which provoked utmost interest for a few days and then were silenced. Studying all the material so far available on line makes it absolutely clear that for some years different interest groups were struggling with each other to secure their interests. It’s rightly been said by some one that it’s just the tip of the iceberg. While I’m writing these lines the couple has taken refuge in an unknown place after an alleged murder attempt. The couple was telling a lot of lies in past few days as they were seeing the credit for the discovery and the future financial gains slipping out of their hands. On the other hand different groups were becoming more and more desperate to get rid of situation which reached its peak in March this year since the discovery of the artifacts. As an archaeologist and a student of early Christianity what strikes me most is the deliberate effort by every participant in this red hot debate to avoid explaining the historical context of this forgery or discovery. I can’t believe for a single moment that all these seasoned scholars has no knowledge of the thousands of leaden tablets (the so called curse tablets)and amulets including some Gnostic leaden books which are being reported continuously for past few centuries. The most one can say is that they are forgeries or copies of such ancient texts if not the originals. The following are the pictures of different Gnostic Leaden Books. Another very important aspect totally neglected so far is the discovery of such leaden books from Granada in 15th and 16th centuries. The very Famous Arabic and Latin“Los Libros Plomo. These leaden books are still cursed by a verity of scholars as forgeries who are failed in my opinion to understand the continuation of translations and alterations in texts of these leaden books. I don’t want to go into further details at the moment. I just want to point out there is very strong evidence that there were text written on leaden books by early Christians (there were several hundred such groups in first three centuries). This practice of engraving sacred texts on lead plates was continued by certain Gnostic sects well into the Muslim era. I also want make it clear that such heated debate only help the text to be destroyed or disappear. They seemed to me no more than magical texts. If genuine and belong to the first centuries of Christianity, they will provide us a rare chance to study some aspects of the lives of people who wrote them. If they are copies or forgeries they still offer much for scholarship. This could only be possible if Jordanian and Israeli authorities realize the importance of being very careful to handle the situation. Hasan Sadia and the couple should be given more time to prepare their minds to tell the world the “whole truth”. Muzaffar Archeohistorian@gmail.com.","date":"2011-04-18","mins":"4:56 am","url":"https://shroudstory.com/2011/04/04/lead-codices-less-than-50-years-old/","cat":"news_&_views","title":"Lead Codices Less than 50 Years Old?"},{"id":"comment-2939","author":"muzaffar","post":"I’m neither standing with the Elkingtons, nor with any Consensus or pressure group. I just want to make my point that texts has been written on lead before and after first century AD. One can’t change this fact even if he or she doesn’t have much confidence in my academic credentials. For details of other Leaden Books please consult: 1. An Inquiry into the Nature and form of the books of the ancients… 1873 London Pp 28 35 2. Septuaginta Studien. II. 1904 Pp.14 17 3. The Gnostics and their Remains. London Pp.147 153 4. Une Excursion Gnostique en Italie.Paris 1852. Plate I tillplate.xii 5. The Septuagent in context. Brill 2000. Pp.267 268 6. Ancient Jewish Magic. Pp.114 and 144 146 etc. 7. Curse Tablets and binding spells from the ancient world.Oxford. 1992 And what about Job 19:24. Muzaffar archeohistorian@gmail.com.","date":"2011-04-19","mins":"12:32 am","url":"https://shroudstory.com/2011/04/04/lead-codices-less-than-50-years-old/","cat":"news_&_views","title":"Lead Codices Less than 50 Years Old?"}]
