[{"id":"comment-8221","author":"dianne_porter","post":"When I lost my last baby I was really unhappy – I knew in my heart there would be no more. I had miscarried at just over three months. Grief is an awful feeling and it can lead to a kind of delerium when the pain of sorrow is really bad. I was parking my car at the local shops and was just wracked with grief. I was sobbing so hard I was lost in it really – it was hile I was in this starte I had a sense of blood falling on my hands. I looked up to see where it was coming from and Jesus was hanging on his cross dripping his blood on me and smiling at me. I asked him how come he was smiling. He said – when I first came up here I hoped you would come. I then asked him what it was like for him and he invited me to come up and see. I went inside his body on the cross and streatched myself into his shape so I was hanging on the cross inside him looking out his eyes so I could see what he saw. My whole sense of it was this most flowing love that could see all of eternity in view – there was no anger inside him just gratitude that we had helped him do the work he came to do. I felt I could hang there as long as possible the pain was so much less than the love flowing though him and out his eyes I forgot about it. I had such a good time there. I looked at the man who nailed Jesus to the cross and I could feel how grateful Jesus was for what the man had done for him. Jesus could not nail himself to his cross – he needed our help to be crucified. He needs our help to heal us too – he needs us to give him our pain so he can tranform it with his love. Thats how he heals us all. For more than six months after this I could see what Jesus saw every time I blinked and it was such a comfort. I now believe God gives us all gifts that heal our souls and helps us to work with him to heal the heartache of the whole world. He does the heling but needs us to help him by sharing the light he gives us with others. He wants to cover us all with his radiance because he loves us so much he can’t help it. This vision was transforming for me and has been a comfort for more that 30 years. I never fell pregnant again so I only have one live child – I lost 6 altogether. I now believe Jesus meets us all at a time and place that makes sense to each of us – even the non believers. When I encounter disbelief I know they havn’t met Jesus yet and leave it at that. Then I pray and ask God to make straight to way of the Lord. Thats what I do now – I watch wait an pray knowing God reveles Jesus to each of us at the right time. Its a nice way to live in peace. Thankyou everyone here for being as honest as you can be no matter what you shared. I have been blessed by you all..","date":"2012-02-14","mins":"12:58 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8264","author":"dianne_porter","post":"Hi Kristin – I call the white light THE BLISS. I was asleep one night and I was awoken by gentle waves of bright light that was so full of intense love I could hardly bear it. The waves of love started on the left side of my head and eventually filled my whole body till only my right foot was out of it. I asked God to leave my foot in this world because there would be no way I would want to come back if I was totally immersed in it. I call them waves of the living light of God that were conscious so I could relate to your post. I don’t believe you had an NDE so much as God blessed you by filling you with his love to combat the harm done to you. He filled you with his hope for the new life he promised you personally when Jesus died on the cross. Gods will is to heal our world and our lives by giving us his own incorruptible life. He was just making a deposit of it in you so you started to get a sense of it and a chance get used to it. God is pretty scary up close and in person – I know if he asked me to die for him I would do it because HE asked me. I know in my whole being he restrains himself to letting us know him as gently as he can because his love is so intense when he reveals his presence we never want to leave it. I am sure you have found this experience in your life has guided your decisions since that time. Thanks for sharing your story. Dianne.","date":"2012-02-15","mins":"4:21 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-18068","author":"dianne_porter","post":"Question 2 – is a tough one. The revelation of Jesus to Saul on the road the Damascus is the biblical evidence for me that the answer is yes. I have slept on my answer because the following explanation is not that easy to share. When Jesus died his blood consecrated the whole earth and everything on it. He restored us to holiness by his action so we have been made fit to serve him. To serve him he has to communicate with us so it figures he appears to us as needed. His death established the Kingdom of God here on earth and he rose from the dead as the great high priest in the new living temple. Jesus completed his work of establishing it on earth when he died. He was a servant of God and showed us how we can be Gods servants by the way we live. My understanding comes from the way utensils used in the Tent of Meeting are treated when the Isrealites wandered round the dessert for 40 years. The Tent of Meeting housed the Tabernackle that was built according to Gods instructions in the dessert. This treatment is duplicated in the Temple built by King Solomon. The utensils were made holy through ritual cleansing and the blood of the sacrifices to God. Only the ritually clean utensils could be used. If any of the people serving in the temple were ritually unclean when they come into the temple area they died – this was well described in instances of service around the Tent of Meeting when they Isrealites wandered around Sinai for 40 years. Today Jesus is called the cornerstone of the new temple – and those who follow him are the living stones of this new temple. God himself teaches us and it is God who completes the work begun in us as we follow Jesus. In this mystical temple Jesus is the great high priest and when he is working he calls on his utensils to help him with it. We are those living utensils. His life and death made us fit for use in this way. If you hang round Christians long enough some will tell you Jesus told me to do this or he appeared to me. Not all Christians have this experience but those who do reveal by their life and actions how compelling the experience is for them. This is also evidence that Jesus has returned to those he has chosen. Many are called but only some are chosen. I have often wondered why the bible leaves out some answers. For me the answer is that Jesus said he would send the Holy Spirit to teach us all things. The walk of faith we take as we follow Jesus prepares us to understand and accept Gods ways and enables us to learn something of Gods point of view. The tricky bit – God is the same yesterday today and tomorrow and yet he is new every morning and he is always doing a new thing : ) I hope my answer helps you find your own answer to your question. Thankyou for asking it I have enjoyed exploring it for myself..","date":"2012-10-22","mins":"7:07 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-17996","author":"dianne_porter","post":"I cannot recall where in the bible but a desciple of Jesus asked Jesus what was to happen to someone else and Jesus said in reply “What it that to you?” The inference is that we are to personally follow Jesus and thats as far as we go. What most of us forget is that God is not limited to the natural order that we live within most of the time. God can make barren women pregnant – Abrahams wife Sarah. Part the Sea – Moses crossing the sea to flee Egypt. Raise the dead – Lazarus. Jesus decended into hell – what was he able to accomplish there? This means there is adequate provision in the ways God does things for those who have not had the opportunity to accept Jesus Christ. How God does that is not for us to know. Rather we are asked to trust God knows how to deal mercifully with his creation he loves so dearly. Jesus teaches us how God does things and it is definatley not the way we usually do things. In the Godly order our responsibility is to do what Jesus teaches us to do and become his desciple regardless of what happens to others – including those we love here. Our obedience and salvation is exclusive to ourselves – we are personally accountable for how we respond to the message Jesus teaches us. As Jesus says – I set before you life and death – choose life. This means we can choose death if we want to. The hard yards of this truth is that God has given us our life and it is in our hands what we do with it. As we apply the lessons Jesus teaches in our own lives the Kingdom of God that is within us is revealed to us. As we get more used to Gods ways we learn how we hate God and how we love God. These are tough lessons. We also learn how much God loves us personally and the hard part – how much God loves our enemies and asks us to learn how to do that too. This last lesson is our expericne of crucifixion and no one is exempt. So the better question is this – How do I manage my own crucifixion and learn how to die to myself and come alive to Christ? I know this is not the answer you were hoping for because I have asked the same question you have asked. This is the answer I was given and it covers about 20 years of my journey as a desciple of Jesus. Choose life and take up your cross. Blessings from Dianne..","date":"2012-10-21","mins":"6:44 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-18405","author":"dianne_porter","post":"No offence taken by me. I am very sad for the loss you are feeling over the suicide whose funeral you attended. When I was that age I made my third attempt to end my life having made my first attempt at 9 years of age. I knew when my effort to crash the car at over 100 mph failed it was God who intervened to prevent me from dying and I was not too happy about it. I felt condemned to a life I hated and I did not try again till oct 1989. It was the last line of my suicide note that said “Be still and know that I am here.” I knew were not my words. God was with me in that awful moment and used my own hand to prove to me he never abandons anyone – we abandon God long before that. God was the only one with me at that awful hour and his presence led me to question my resolve that my life wasn’t worth living. It was those words that led me to seek God and he found me while I was looking for him. It took me years to be still and know God and I am not able to repeat how still I was by my own self will as much as I try too. God himself completes the good work he begins in each of us so we can boast in what He has done rather than what we have done. Do I still feel suicidal? – yes from time to time and I am now 58. When the desire to end my life gets bad I turn to God and I read my bible to help contradict the desire to do so that can become almost unbearable at times. At those times I choose the resist my desires to do evil and choose Gods desires for me to have life and have it abundantly. That is my cross and it is no fun bearing it. I learn from Jesus how to bear the pain I feel and he shows me what he gained for me by the cross he carried and it makes the next breath easier to take. It is not for us to know who is saved and who is lost but rather to live out the faith we have been given by following Jesus as best we can. He shows us how to bear our suffering here when our hour comes to face our own cross and die to ourselves. In baptism we enter his death and come up alive in his new life. That truth has to be worked out in us by faith and that takes time. Gods ways are not our ways so I am confident the young man who suicided was dealt with by God mercifully because that is Gods nature. I trust God. I know some of what God did for me when I wanted to end my life. From that I know that when I really do die he will provide for me then too. I am now confident God provides for everyone when we die regardless of the cause so I leave those things in his hands where I am sure they are safe. That gives me the peace that passes all understanding and its nice to have. Dianne.","date":"2012-10-27","mins":"3:05 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-18083","author":"dianne_porter","post":"I also answered you question 2 at #572 Dianne Porter.","date":"2012-10-23","mins":"4:18 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-18002","author":"dianne_porter","post":"At Michele – #570 Your answer seems so simple but it misses the heart of the question being asked at – #568. The original question if full of campassion and care for those who may not have had a chance to know anything about Jesus – I valued the kindness of the asker and in my answer I have tried to honour that. Thankyou senior 110 for revealing your kind heart – I pray God is able to satisfy your concerns so that you have peace in Gods provision for his enemies and his friends. God loves everyone and everything he made even though he is not loved back. Jesus is good at showing us how we can love God back – that is why I try to live as he teaches – I want God to feel my love such as it is because I want God to know I like his ways and respect him having tasted the fruit of my labour as I have followed Jesus and found that it truly is good..","date":"2012-10-21","mins":"7:32 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-18168","author":"dianne_porter","post":"Thankyou for your feedback – I valued your question and I learnt a lot answering it. Enjoy your journey of Discovering where God is for you – its a very interesting one to take. God loves us and serves us – all he hopes for us is that we love and serve each other so we have a joy that is full and over flowing..","date":"2012-10-24","mins":"2:46 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
