[{"id":"comment-194085","author":"rschneider42","post":"I contacted Barrie Schwortz and talked with him about the John Morgan paper and he confirmed that the image was indeed from the Verne Miller UV F data. So I think we’ll have to roll back to the earlier point in the thread where we were talking about your preposterous view that just because there is a correlation in the sample region that correlates increased fluorescence with younger dates that it must mean the shroud as a whole is younger than the C14 date. Sorry but that doesn’t follow. The question really is why there is a correlation at all with a variable that should have no relationship at all with date, a better correlation than the Bryan Walsh result which showed a spatial correlation. Apparently however, the standard of truth around here leaves something to be desired. Cheers, –Ray.","date":"2015-03-22","mins":"9:46 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194067","author":"rschneider42","post":"BTW Hugh I agree that I should have been clearer in my presentation at St. Louis since it wasn’t clear that it was the “contamination” that fluoresced since it was equally possible that some sort of phenomena suppressed the natural fluorescence of the cloth. Of course the additional content of this overall thread now is claiming that the image was not even a UV F image. If that’s true I’m not sure it changes my conclusion but it would certainly change the interpretation of the data. –Ray.","date":"2015-03-22","mins":"5:25 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194056","author":"rschneider42","post":"Actually if that is true so that Morgan’s data is on a regular photograph it would still be bizarre that it correlates better than the Brian Walsh correlation. The non uniformity of the lighting has been discussed by Barrie in the matter of the Blue Quad Mosaic and similar non uniformities occur in the backlite images. Perhaps we’re just looking at a proxie for distance from the edge of the shroud. That would explain the correlation but not the degree of correlation If this is just a measure of reflectance instead of fluorescence then it is still peculiar that it correlates so well. If your identification of the photograph as incorrectly communicated to Morgan then it merely changes what was measured from fluorescence to reflectance and everything else applies. Why do we get such an excellent correlation? Riddle me that! — Ray.","date":"2015-03-22","mins":"4:46 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194088","author":"rschneider42","post":"I verified that you’re right about some fraction of the initial sample being reserved. It’s not clear that it was half however. That certainly is a likely modifier to the significance of the correlation although it doesn’t make it meaningless only somewhat less meaningful in my judgment. It would have been nice if the carbon labs had been more transparent and accurate about how they managed the samples. It would reduce the confusion. The question becomes which half and how big an effect would be produced? This is probably impossible to pin down. — Ray.","date":"2015-03-22","mins":"10:02 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194071","author":"rschneider42","post":"I think I checked that when I did the original correlation but I don’t recall. So what you’re saying is that because you think half of area one was reserved. The impression I is that the part that was reserved was from the second Arizona sample. In any case I don’t think that claim justifies dismissal of the observed correlation. This is doubly true if in fact the sample is a reflectance image and not a fluorescence image. Frankly I think the fact of the anomalous character of the sample has been demonstrated in spades not only by these observations but by the many others. So this discourse even if it were true would not change the conclusion. –Ray.","date":"2015-03-22","mins":"5:43 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194065","author":"rschneider42","post":"I have to say that that message made exactly no sense to me. The discovery of a correlation between two variables that ought not to correlate means there is something wrong with the sample which is what was to be demonstrated. All the rest is sheer speculation. I notice you don’t engage the data that shows positive results such as vanillin and the mechanical properties of linen. They don’t fit your narrative? Is that it?.","date":"2015-03-22","mins":"5:16 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194054","author":"rschneider42","post":"It’s interesting how Hugh wants to spin the data. The fact of the matter is that a correlation coefficient that high is hard to obtain even with only three points unless there is some linkage. As for wriggling, my main wriggle is the problem presented with the word “contamination” — we don’t know why we get a linear correlation in C14 age measured from the edge of the cloth and we don’t know why we get such a good linear correlation coefficient from the fluorescence data. Because that is so anomalous and unexplained it is primarily evidence that there is a serious problem with the sample. So I certainly admit to making a less than precise use of the word “contamination” — but as I pointed out the actual conclusion I drew was that the sample was inappropriate being clearly anomalous and I pointed out the other problems with it. So I think it is altogether special pleading and not science to pretend on the one hand that the correlation didn’t mean anything and then on the other to suggest that it means the cloth is even younger than the carbon date. I guess having your cake and eating it too is a Hugh Farey specialty. The Carbon 14 date is anomalous. The absence of vanillin is an indicator of a much older date and the additional tests of Fanti, while they need to be further validated, all point to a much earlier date. So the magic C14 date is not the silver bullet that invalidates the shroud’s authenticity. There is way too much evidence on the other side of things to bet on something as frankly problematical as this bizarre C14 date with it’s high Chi square and demonstrable deficiencies. If anyone is wriggling it looks like Hugh. Regards, Ray — Ray Schneider, Ph D Associate Professor Emeritus Bridgewater College.","date":"2015-03-22","mins":"4:34 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"}]
