[{"id":"comment-194715","author":"rschneider42","post":"Of course the problem of creation of the shroud in the middle ages is addressed in the lectures. Such a creation as a minimum would appear to require actually crucifying someone which is hardly something that can be casually explained and then hidden items of fidelity would have had to be added that don’t make sense since they would not be visible such as the dirt from Jerusalem. The early provenance of the shroud remains obscure although the many reasons for the silence are pretty obvious. I think the Hymn of the Pearl is pretty good earth 3rd century evidence that the shroud was known. Then the correspondences with the Sudarium of Oviedo completely destroy the C14 as well as any fabrication in the middle ages hypothesis. To ice that of course one would need something like DNA data which would finally make the correspondences between the two cloths complete if it turns out to be feasible to do such DNA identification..","date":"2015-03-28","mins":"1:34 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194809","author":"rschneider42","post":"I’m quite sure that there are things I left out of my presentations. I put the whole thing together in a couple of weeks. It was a lot of fun catching up on some of my shroud reading. On the electric field theory, I thought it was important because it offers a means of improving the resolution of a vaporagraph type image. It doesn’t necessarily imply a Maillard reaction. Any oxidation might be adequate in a surface layer. The Rogers hypothesis just offers a mechanism for a thin impurity layer which might explain the extremely superficial nature of the image. If Charles Freeman has a mechanism that is plausible or even implausible I’d be happy to include it in the future. I have not encountered it. In fact, when push comes to shove I’m not sure I’ve encountered a really plausible image mechanism yet. They all seem to have substantial defects. Some however are testable and insofar as they are tested we can get an idea of how far they fall short. I’m particularly uncomfortable with mechanisms that demand miraculous intervention or extreme mechanisms that are so implausible that they appear impossible short of miraculous intervention. However, I’m inclined to cover them, especially if they have any basis. I think Coronal Discharge for example, is pretty far out. The degree of work that Giulio Fanti has put into makes it impossible to not say something about it. But I have a hard time seeing how it could actually be the image process. Any ideas would be gratefully received..","date":"2015-03-29","mins":"7:22 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194626","author":"rschneider42","post":"A couple of things. The course was offered through the Lifelong Learning Institute of James Madison University, not Bridgewater College as Russ wrote. The polar molecule idea is quite interesting. The entrainment would be cause by the reaction of the molecule to the ambient electric field. It would cause the molecule to align with the field and should reduce the degree of diffusion and give a mechanism for a sharper image. It is also an hypothesis which can be tested experimentally. For more details the authors of the paper from which I drew the material should be consulted. Http://www.shroud.com/pdfs/stlspicerpaper.pdf.","date":"2015-03-27","mins":"1:43 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-48807","author":"rschneider42","post":"I think it is important that there be no “litmus test” that decides a priori what is acceptable and not acceptable as a hypothesis. You only get a real dialogue going when the only rules are competency and honesty. Investigators, especially investigating something as mysterious as the Shroud of Turin, will disagree and ought to be heard out and any decision made on the basis of the strength of the evidence. Science is always a work in progress and often what was accepted at one point in time proves to be unsatisfactory in the light of new evidence. The conference in 2008 was a model of openness I thought and a very interesting conference. I have every reason to believe that St. Louis will be as well. Regards, Ray.","date":"2013-10-26","mins":"1:19 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-48900","author":"rschneider42","post":"If Russ doesn’t I will! B).","date":"2013-10-27","mins":"10:47 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"}]
