[{"id":"comment-33912","author":"rschneider42","post":"Of course, was there any doubt. There are many things to learn. None of the suggested mechanism come anywhere close to duplicating the shroud except in the most superficial way. There are four keys characteristics and a flock of others that need to be reproduced to duplicate the shroud. The four major ones I call the STAR characteristics. S)uperficial: image only extends a few hundred nanometers into the fibers and then on the surface. They don’t penetrate. T)hree dimensional: intensity varies with cloth to body distance so that rendered with that in mind you get a three dimensional image. A)real Density: the image behaves like a half tone image, all the image elements being the same color (within about 2%) so that apparent density changes are relatively more or less colored areas not changes in color. R)esolution — the image is focused and relatively high in definition. Commonly suggested mechanisms rarely can explain more than one or two of these features and I’ve seen none that adequately explain all..","date":"2013-05-17","mins":"9:22 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-33876","author":"rschneider42","post":"That was certainly fast Dan. I enjoyed watching the video. Those of us who are steeped in all this stuff probably won’t find anything all that new. I was intrigued by the attempt to test the maillard reaction hypothesis and a little disappointed that the result was largely limited to similarity of appearance at the microscopic level. Still it’s a start. It is always striking to me how poorly the results end up compared with the actual shroud..","date":"2013-05-17","mins":"12:35 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34039","author":"rschneider42","post":"“Relic based faith is no faith at all.” — said Louis. I don’t think that faith is baseless. That is unwarranted. Moreover it is also somewhat irrelevant. The question is how the image got on the shroud and what kind of image is it? This is a question of fact which can be explored with science and technology. The testimony of the shroud is something else. It is a kind of 1st century photograph of Jesus Christ if it is authentic. It has been called the Fifth Gospel for it tells the story of the passion rather directly. That however is a religious matter and largely outside the competence of science. The apostle Thomas had to see Christ risen and put his hand into his side before he would believe. Those who believe with less evidence are not thereby better, although Jesus describes them as “blessed”. What is important is the truth and the truth demands evidence. “Faith without works is dead” said James. Perhaps that could be construed to also mean that faith motivates the work needed to gain understanding..","date":"2013-05-19","mins":"1:04 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34044","author":"rschneider42","post":"The problem of course is that you are the one that raised this red herring of an issue. No one, at least not me, raised any such argument and certainly there is no test for “Christ” but that’s irrelevant the question whether the Shroud of Turin is consistent with being the burial cloth of Christ. That’s rather a different question. The Resurrection was the central message of the gospel from the beginning. One can’t prove the Resurrection from the Shroud of Turin. Lazarus was not resurrected. He was resuscitated..","date":"2013-05-19","mins":"1:55 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34049","author":"rschneider42","post":"Of course the difference between resurrection and resuscitation is that the person resuscitated dies again..","date":"2013-05-19","mins":"2:28 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34036","author":"rschneider42","post":"Maillard reaction alone? The Maillard reaction would potentially explain the coloration and the superficiality. It does not explain other characteristics. For that you need a uniform linear transfer mechanism of a reagent that would react with the surface layer in a very limited way since it can’t propagate too far without blurring the image. It has to be collimated so that you’ll get resolution, and the reagent must disappear or be rendered non reactive by transfer through nominally four centimeters of air. The collimation mechanism may be gravity or the electrostatic field (those are the two most obvious fields available). The reagent might be materials in a water solution used to pat clean the body which came off the body in a very fine microaerosol which was neutralized as it was transported through air. Some such process would potentially duplicate the image. Problems are that ordinary gas diffusion would normally tend to blur the image although a massive enough reagent would not diffuse as much and might solve the problem. What I don’t think is particularly justified is a miraculous hypothesis both because the image isn’t perfect and there are image lacuna which suggest the image take up sensitivity is yarn dependent. It might simply be a combination of rare characteristics that coming together allowed the image to be formed. I tend to think of these kinds of events as miracles of the 2nd kind (not supernatural, but extraordinary because of the required cooperation of many natural but rare events)..","date":"2013-05-19","mins":"11:04 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-33935","author":"rschneider42","post":"I thought also that the move towards experimental observation was encouraging. I thought the cloth should have been draped across features of the pig that might create an image rather than just a stain, like some articulated part of the head. None of the examples in the piece were striking unless strikingly wrong is a criteria. There are lots of arguments against the photography example that go beyond the lack of silver on the cloth and the bas relief rubbing is a total loser and frankly looked it on the video. The lack of gradient in the maillard experiment didn’t recommend it very much in the video but at least the discoloration seems to have something like the right characteristics. All in all the emphasis on experiment and comparison may be the best features of the piece..","date":"2013-05-18","mins":"7:17 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"}]
