[{"id":"comment-9485","author":"george_w_foushi_ii","post":"Very well stated Annie…God Loves all of us so much that He is reaching down to many of us to experience certain elements that He knows will reach many that are not a Christian or of a generation that doesn’t read much any more, as a picture tells a thousand stories! Todd Burpo verified the authenticity of Akaine’s painting of Jesus, thus verifying her work is a very real gift from God himself. Praise our Lord and Savior and help Jesus by becoming a fisher of men!.","date":"2012-03-20","mins":"9:47 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9731","author":"george_w_foushi_ii","post":"One should always be skeptical, but in a good testing way, but never ever under estimate the power of our Heavenly Father, Jesus and the Holy Spirit…I can tell you that He is very real, as I too have had a very personal encounter with His blissful presence for over 10 minutes…although I did not visually see him..He touched me while beaming His Love down upon me while talking to me…Satan has no way of imitating what He did to me on that day after my prayer of salvation, on 27 Feb 2010…so even though very few of us are allowed to see through the Vail…never under estimate what He is capable of doing to reach those many down here in this dimension! Todd Burpo and Akaine’s path’s crossed for a very good reason…validation of their stories to those doubters! Keep the Faith…from a close friend of Jesus and Fisher of Men.","date":"2012-03-28","mins":"1:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-10199","author":"george_w_foushi_ii","post":"Very well stated…Mary! And to James I say to you right now, in your own words, just kneel down before your bed one night…or anywhere you feel comfortable, when you are ready and pray to our Heavenly Father that you are hurting in your heart and ask for Him to come into your life (only if you are sincere and this must come from your heart) that you can no longer take this pain and suffering…and that you want to turn your self over to Him and how you want and need Him into your life now…and that you know that you are ready to except Jesus Christ as your Savior! It’s that simple and that’s all you need to do…if sincere and you are truly ready for your life to be changed and except His healing…then your Guardian Angels will be rejoicing and dancing above you…our Heavenly Father will send His No.1 and only begotten son; Jesus Christ…and you will know it…you may not immediately experience some of the physical encounters or the Blissful Love Euphoria beam that was cast upon me for 10 minutes…but you will notice that all the sudden you are relieved…and not alone…and His heal lings have begun…and you will suddenly be more aware of Love…loving everyone around you more…and best of all (in your case) Forgiveness…you will forgive your parents and want to let them know that you Love them…this is the key to resurrect and rekindle compassion and trust…It’s God’s Love…you will be over joyed…but praise Him in all His Glory…it is His Grace that sets you free…don’t be afraid, just do it and start looking forward to the day that the rest of your life on His Earth, will be preparing you for His place in Heaven…I too am praying for you James, right now…Just let God into your life and you will be healed! He is and has been waiting for you…James, all you have to do is ask for Him to come into your life…right now! What a time to pray for your Salvation…on the anniversary of the Pass Over and resurrection of Jesus Christ…Amen! God Loves You So Very Much, George.","date":"2012-04-09","mins":"12:10 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-11740","author":"george_w_foushi_ii","post":"Moses…that’s an awesome story…your father was spared and shown the truth of Jesus for good reason, our Heavenly Father sends His son to touch those of us that are the chosen, we have a greater purpose than most, as we are to continue growing His seed of Faith to as many as possible who cross our paths. I know, at 19 I was thrown through a windshield in a horrific automobile crash that left my best friend temporarily paralyzed. When the first trucker on highway I 95 got to me first, he found me in a praying position unconscious…the minute he touched my back to tell me not to move, I awoken and will always remember at the instant my head hit the glass, which knocked me out cold…I saw what I thought was a tunnel of light beaming down upon me…but it was though I was sitting by my self in a movie theater, and someone had just rewound my life on the movie screen…I was shown my mother giving birth to me and then my entire life story played in front of me, from birth, right up to that moment at the crash! Then as the trucker was trying to calm me, not to move…there was no one else at the seen of the accident…my best friend and college mate; Andy Ryan, was still down in the mangled van that had rolled end over end 5 or 6 times down a 75′ embankment, and he was trapped and couldn’t move from the waist down! Andy later told me on the gurney, being loaded into the ambulance, as I tried to tell Andy how sorry I was, for falling asleep at the wheel, he said; “George, it was the strangest thing, I couldn’t move and I was just waiting for the van to explode in the leaking fuel, that was running everywhere, and it was like God all the sudden opened the two side cargo doors and just lifted me outside where I was safe! The truck driver that had stopped was the only one at the scene of the accident for the first 10 minutes, and when he left me to run down to check on my friend after I told him my best friend, Andy was down there inside the van…he found Andy already laying outside the van! When I went to the police impound area to see the van after I was released from the hospital, to try and collect any of our remaining belongings, inside the van, we noticed the van was rolled into a ball of metal…there was no way any human could have opened the side doors, they were crushed inward and wouldn’t open unless you had a jaws of life! We were too young at the time to realize what had really happened that night on August 16, 1977…either Jesus Christ our Lord and Savior was physically present in Spiritual body at that crash, or our Guardian Angels were quickly pressed into action, to perform His calling. They saved our lives and God planted an image of my entire life before me, in order to show me, that I was not ready for His Paradise…He had more important tasks for me to perform on His Earth. I finally found God at the age of 51 in prison and received my Salvation and baptism by the Holy Spirit in person on 27 Feb, 2010…Jesus spent 10 minutes with me! I could not physically see him, but he came to me in the middle of the night and beamed His Love down upon me. What transpired is completely undescribable for human words to try to properly explain…but as I was floating in His intense beam of Love, He talked to me and purified my soul with the Comforter, it felt like the Sun was literally setting on the roof of the building I was in, it was that intense! The very next day, early that morning, when I got out of my rack, I was completely healed and forgiven, all my regret fulness and sorrow was gone…and I just Loved everyone around me and lost all desires to even swear or talk down to any fellow prisoners…all I could radiate was His Love to others. Then it all came together for me..the purpose of my life..the meaning of life…why we should love our enemy…and give forgiveness to heal…for those of us that are literally touched by Jesus “Joshua” Christ, and healed, have an incredible fulfillment to become His Ambassador on Earth, until He returns…your father like myself, were chosen for a good reason! We have so many souls to show His righteousness to. So we honor your Dad and give many great thanks to our Heavenly Father for saving us, to continue to do His good work on the earth…and we are our Lord’s watchman….we are ready to spring into action and help those in need and sow His seed of Faith…and for that, I am deeply honored to serve my Christ Jesus…Amen, and Thank You Father, Thank You, Jesus for your Holy Spirit! Bless all of you that get His message and understand it…help and pray for those that are lost on this Earth, like me, Satan and greed stole my heart…but Jesus returned it to the rightful owner and poured His Love into me to share with others…Amen!.","date":"2012-05-31","mins":"1:01 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-11788","author":"george_w_foushi_ii","post":"Awesome post Julie…how eloquently spoken…Keep the Faith, somehow I know and fell that I will be seeing you in Heaven…God Blesses you for that post!.","date":"2012-06-01","mins":"8:41 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-18738","author":"george_w_foushi_ii","post":"Http://www.jesusprinceofpeace.com/ Hope this helps…I see they also have a calendar and some good links here to interviews on youtube..","date":"2012-11-02","mins":"11:42 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9484","author":"george_w_foushi_ii","post":"You just nailed it Scotty G…I know, I have been personally touched by Angels in an auto wreck…given visions at an early age to correct my sinful path…and then witnessed Jesus’ presence for 10 minutes the day after my salvation prayer, because I asked our Heavenly Father to show me a sign during my prayer of Salvation! Since 27 Feb 2010, I have witnessed healings and phenomenal answers to my prayers…and He had my sister send me both Todd Burpo and Akaine’s books…God knew how analytical I am, and boy did He verify that He is very real (Big Smile)! Read Luara Hildebrand’s “Unbroken” and give that to all of your friends that are on the fence about God, Jesus and Christianity!!! Amen to all of you that Believe…from a close Friend of Jesus..","date":"2012-03-20","mins":"9:32 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
