[{"id":"comment-191291","author":"john_long","post":"Hello Dan, As the author of all four articles “The SOT’s Earlier History …” I am solely responsible for all the main text and picture explanations – not ABR editors or organization leadership. ABR does not have a major interest in the Shroud, being more concerned with archaeology. As an ordinary member of the ABR fellowship I knew many of their readers had at least a passing interest in the SOT; the ABR leadership is open minded and I am grateful that they provided a means for me to address the Shroud’s pre 15th century history. With many other shroudies around the world I still find Wilson’s basic thesis (tweaked in a couple of areas) the best explanation for its earlier whereabouts. I’ve read Markwardt’s interesting thesis but have not yet studied all its parts in enough detail. Hugh believes that my picture explanation of Schiller’s illustration #595 is unintentionally misleading. “Unintentionally” is certainly correct. I can clearly remember my aim – I wanted to demonstrate the remarkable resemblances between the Shroud and art like the Victoria & Albert Museum threnos (crossed hands, missing thumbs, semi nude, diagonal lines and cloth’s long length – shown later in my article), but didn’t want to suggest that all these 11th 12th cen. Lamentation depictions had as many similarities, hence choosing #595 to introduce the point. What I should have done was to have picked one of the earlier (pre 944) examples Hugh mentions and then said “within a hundred years … Byzantine art often transitions away from these earlier “burial preparation” representations to ones having striking similarities to SOT images.” But does that illustration (#595) suggest an influence from the SOT? Wilson still thinks so noting on p.182 of his 2010 book that the mummy wrappings from before the 11th cen. Gradually gave way to semi nudes on a prominent, large cloth. He references Weitzmann’s “The Origin of the Threnos” – and as I review that paper Weitzmann does seem frequently to note mummy type depictions before the 11th cen.; he uses Schiller’s #595 (his fig. 10, Constance, Rosgarten Museum) as “An innovation of great consequence … is the nakedness of Christ.” To borrow a phrase from Dan Scavone: Why do these often depicted mummy/cloth strip burials before the 11th cen. Suddenly have to make room for ones that look more and more like the Shroud images? I have not seen the Shroud Guild’s Facebook page, but I’m amazed at any assertion that I’m making “false quotations” to spread “bad arguments.” (I’ve probably misunderstood Dan). Of course Schiller did not pose “Why?” – I did. Nowhere did I credit the picture text to Schiller. As I view the way pictures and their accompanying text are presented in books and articles, I don’t see why any experienced reader would be confused. (If a scholar like Schiller had discussed the SOT’s possible influence it would be well known in Shroud literature, and inept for any writer to falsify it). And are the changes (comparing Christ burial art before to that after 944) really a “bad” argument? I’ll let the readership comb through the art historical books and make up their own minds as to how valid Wilson’s insight was. Thanks for giving me a chance to reply. – John Long.","date":"2015-02-17","mins":"1:12 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"id":"comment-191393","author":"john_long","post":"Thanks Hugh – I appreciate your comments and don’t think Dan was being rude. I continue to enjoy his blog each day. The question of the Shroud’s earlier history is a gigantic puzzle, with all of us trying to fit the peices together in the most convincing whole. I do understand your “arrival of the uncovered body without the necessity of the sudden discovery of the Shroud” judgement, but when that uncovered body continues to morph into something like the V&A depiction, I can’t help but feel a recent aquisition of the Shroud had something to do with it. Thanks again – John Long.","date":"2015-02-19","mins":"2:41 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"}]
