[{"id":"comment-204853","author":"2121212123","post":"“…Giulio Fanti’s claim that UV radiation is the only technique that comes close to reproducing the image have not been so corroborated. …” Sorry… Eng. Fanti never claimed that. You are wrong. Dr. Di Lazzaro used VUV (vacuum UV). So, I hope you’ll want to be more exact in your writings. Perhaps you wanted to write: “Giulio Fanti’s claimed that Corona Discharge effects…” or: “Giulio Fanti’s claimed that Corona Discharge and UV effects…” (because he indicated us something similar the “brilliant Body of Resurrected Jesus” that passed through the linen cloth, something similar the Jackson’s hypothesis…). * * * * * Here Particular References: 1 “Forces of the Quantum Vacuum” An Introduction to Casimir Physics Edited by: William M R Simpson (The Weizmann Institute of Science, Israel), Ulf Leonhardt (The Weizmann Institute of Science, Israel) Link: http://www.worldscientific.com/worldscibooks/10.1142/9383 >Forces of the Quantum Vacuum presents a number of theoretical approaches to Casimir, van der Waals and Casimir–Polder forces that have been fruitfully employed in mainstream research, and also reviews the experimental evidence for Casimir forces. … etc. … 2 “Quantum vacuum energies and Casimir forces between partially transparent δ function plates” J. M. Muñoz Castañeda, J. Mateos Guilarte, and A. Moreno Mosquera Phys. Rev. D 87, 105020 – Published 29 May 2013 Link: http://journals.aps.org/prd/abstract/10.1103/Phys Rev D.87.105020 3 “Giant vacuum forces via transmission lines” Ephraim Shahmoona, Igor Mazetsb, and Gershon Kurizkia An excerpt from the abstract: >Quantum electromagnetic fluctuations induce forces between neutral particles, known as the van der Waals and Casimir interactions. >These fundamental forces, mediated by virtual photons from the vacuum, play an important role in basic physics and chemistry and in emerging technologies involving, e.g., microelectromechanical systems or quantum information processing. >Here we show that these interactions can be enhanced by many orders of magnitude upon changing the character of the mediating vacuum modes. … etc. … Link: http://www.pnas.org/content/111/29/10485.abstract 4 Quantum Vacuum Forces Project >A project, sponsored by NASA’s Breakthrough Propulsion Physics Program, to study ways of influencing the energy density of the quantum vacuum with a view to possible applications in spacecraft propulsion. >It is being conducted by a team of scientists from various academic and corporate institutions in the United States and Mexico. Link: http://www.daviddarling.info/encyclopedia/Q/Quantum Vacuum Forces Project.html 5 Quantum energy teleportation. >Quantum energy teleportation, a hypothesis first put forward by Japanese physicist Masahiro Hotta of Tohoku University, proposes that it may be possible to teleport energy by exploiting quantum energy fluctuations of an entangled vacuum state of a quantum field… Links: https://en.wikipedia.org/wiki/Quantum energy teleportation http://www.tuhep.phys.tohoku.ac.jp/~hotta/extended version qet review.pdf So… Perhaps there is an interesting possibility to write a new novel based on a “Black Order of Templar Knights” (…an evocation received by an unknown ET civilization who decided to mock our own World, producing the famous and presumed textile fake) that “presumably produced that Image” [included a chapter on explanations about the lack of investigations into the exact level of sophisticated textile attack to our Christian civilization… !] Or: A case of Applied “Quantum energy teleportation” (= QET). But this Science Fiction seems to be far from our normal Scientific knowledges about the Shroud! B.T.W.: >The 2006 James Rollins novel “Black Order” discusses suspected zero point energy research by the German military during the Second World War… Instead in 2013 Fanti, Baraldi, Basso, Tinti, published their work about “non destructive dating of ancient flax textiles” on “Vibrational Spectroscopy”..","date":"2015-07-07","mins":"10:32 am","url":"https://shroudstory.com/2015/07/06/techno-science-and-the-shroud/","cat":"article","title":"Techno-Science and the Shroud"}]
