[{"id":"comment-62391","author":"jos_verhulst","post":"Hugh Farey : The blood seems to have been chiefly identified because of the survival of erythrocytes – which are sadly lacking on the Shroud. However, Gérard Lucotte (‘Vérités sur le Saint Siaire. Etudes scientifiques récentes sur le linceul de Turin’ 2010, p.147 ff) did observe erythrocytes, and he also publishes (p.273 274) some photographs. Of course, it could be argued that one should reject these observations. But at least his report should be mentioned..","date":"2013-12-19","mins":"11:13 am","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-11032","author":"jos_verhulst","post":"Reminds me of a curious detail that I recently noted in Giulio Fanti’s “La Sindone. Una sfida alla scienza moderna” (2009, p.175): “Recentemente, l’autore è stato informato che una crosticina di sangue, prelevata dalle polveri aspirate da G.Riggi di Numana, risulta mescolata al sudore, in quanto è ricca di cloruro di sodio” (‘recently, the author has been informed that a blood crust, found in the powder collected through aspiration by G.Riggi di Numana, turned out to be apparently mixed up with sweat, that contains very much Na Cl’). So, apparently salt has been recorded, but there was too much salt for the sample being pure blood, with the most natural explanation being that the blood was mixed up with sweat. Of course, this observation illustrates an important point: Na Cl is a very common mineral, that can result from many sources. Besides, it is also very soluble..","date":"2012-05-01","mins":"8:13 am","url":"https://shroudstory.com/2012/05/01/blood-question-wheres-the-salt/","cat":"blood_studies","title":"Blood Question: Where’s the Salt?"},{"id":"comment-14328","author":"jos_verhulst","post":"There is no ‘Lire copy’, only a ‘Lier copy’. Http://en.wikipedia.org/wiki/Lier, Belgium.","date":"2012-07-30","mins":"11:05 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"id":"comment-23062","author":"jos_verhulst","post":"Gérard Lucotte claims to have observed, in the micro debris aspired from the Shroud, 9 smaller erythrocytes that could be of primate/human origin (“Il s’agit sûrement d’hématies humaines” – p.150), and 55 larger ones that are not of primate origin (“elles proviennent probablement d’un grand mammifère domestique” p.179). His book also has some pictures of these red blood cells (p.273 276). Possibly this work is flawed but these claims should be addressed..","date":"2013-01-30","mins":"3:12 pm","url":"https://shroudstory.com/2013/01/30/guest-posting-by-kelly-kearse-distinguishing-human-blood-from-that-of-other-species/","cat":"blood_studies","title":"Guest Posting by Kelly Kearse:  Distinguishing human blood from that of other species"},{"id":"comment-11050","author":"jos_verhulst","post":"If I remember well (I did not look it up), in Adler’s “Orphaned Manuscript” there is a reference to Mc Crone, who found both Na and Cl, among many other elements. In any case, this salt thing is a non issue, ordinary salt being such a common substance. Nobody would accept the presence of Na Cl as a valid indication for the stains being real blood – and rightly so. One could say almost as well that the researchers had to look for the presence of water in the stains, because blood contains a lot of water..","date":"2012-05-02","mins":"1:12 am","url":"https://shroudstory.com/2012/05/01/blood-question-wheres-the-salt/","cat":"blood_studies","title":"Blood Question: Where’s the Salt?"},{"id":"comment-56291","author":"jos_verhulst","post":"I always found Mat.12:40 so remarkably precise, because of the very specific conjunction between the two specifications ‘three days and three nights’ & ‘at the heart of the earth’. Indeed, with a time span of one and a half days at some point on the surface of the earth, will correspond a total of ‘three days and three nights’, as seen from the ‘heart’ of the earth. As seen from the center of the earth, day and night always occur together, in a completely equivalent way. From that very special vantage point, a time span of 12 hours corresponds to ‘one day and one night’. In 24 hours, you wil have a day followed by a night at one side of the earth, together with a night followed by day at the opposite side; so 24 hours 2 days + 2 nights. And so on..","date":"2013-12-04","mins":"6:43 am","url":"https://shroudstory.com/2013/12/04/the-big-3-issue-or-jesus-simply-misspoke/","cat":"blood_studies","title":"The Big 3 Issue or  “Jesus simply misspoke”"},{"id":"comment-23030","author":"jos_verhulst","post":"What are we to think about the observation reported by Lucotte (“Vérités sur le Saint Suaire”, p.147 ff) on erythrocytes found on the Shroud (microscopic material collected by Giovanni Riggi di Numana) with diameters of 12.5 13 micrometer – much too large a value for human blood, according to this author..","date":"2013-01-30","mins":"6:33 am","url":"https://shroudstory.com/2013/01/30/guest-posting-by-kelly-kearse-distinguishing-human-blood-from-that-of-other-species/","cat":"blood_studies","title":"Guest Posting by Kelly Kearse:  Distinguishing human blood from that of other species"}]
