[{"id":"comment-16939","author":"jos_verhulst","post":"I just finished the new book by Thomas Nagel “Mind & Cosmos. Why the materialist neo Darwinian conception of nature is almost certainly false” Oxford UP. Nagel has three good chapters on consciousness, cognition, and value, respectively. For the happy few who are able to read Dutch, there is also this one: http://rothbard.be/bestanden/boeken/HVV web.pdf.","date":"2012-09-26","mins":"8:03 am","url":"https://shroudstory.com/2012/09/26/how-can-physics-and-chemistry-account-for-consciousness/","cat":"other_blogs","title":"How can physics and chemistry account for consciousness?"},{"id":"comment-16","author":"jos_verhulst","post":"The pyrolysis front would be formed by a great number of paths spreading out away from the contact region. Each of these paths will come to a halt abruptly and randomly. The overall result will be a halo of kinds, a set of longer and shorter scorching paths spreading out from the contact region, with the global outlook being something like a fractal halo thinning out with distance. Crucially, it should be explained how such a mechanism could reproduce a scorching signal that weakens with increasing shroud metal (or shroud body) distance. The distance between a non contact point and the contact area is not proportional to the distance between that same point and the metal (or the body). Anyway, I think that your theory can be tested in a very simple way. According to your model, ‘islands of oxidation’ (that is, small islands of scorched fiber surrounded by intact fibers) in image areas without direct contact between shroud and body, cannot possibly occur. This is a claim that could be falisfied by showing a counter example..","date":"2012-02-18","mins":"6:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/18/the-shroud-of-turin-lets-focus-on-that-hemicellulose-coating-on-the-linen-fibres-it-could-explain-a-great-deal/","cat":"cellulose","title":"The Shroud of Turin – let’s focus on that hemicellulose coating on the linen fibres … It could explain a great deal"},{"id":"comment-14","author":"jos_verhulst","post":"“The scorching will initially be confined to those parts of the fabric that are in IMMEDIATE contact with the hot metal…”. This seems to imply that the image would consist of a set of contact points or contact areas (where maximal oxidation occurs) that is surrounded by a halo fading out as a function of the distance to the contact area. There would be no relationship connecting, at a given point of that halo, the intensity of the image to the distance separating shroud and hot metal surface..","date":"2012-02-18","mins":"3:38 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/18/the-shroud-of-turin-lets-focus-on-that-hemicellulose-coating-on-the-linen-fibres-it-could-explain-a-great-deal/","cat":"cellulose","title":"The Shroud of Turin – let’s focus on that hemicellulose coating on the linen fibres … It could explain a great deal"},{"id":"comment-14798","author":"jos_verhulst","post":"I do not believe in Rogers’ Maillard hypothesis, because of the unicity of the image on the Shroud of Turin. Rogers’ theory implies that, in the case of the Shroud, there was a very unusual set of physico chemical conditions occurring together by mere chance and allowing the development of this very special image. However, it is extremely improbabe that (a) the only known case of such an extraordinary image is also an unbelievably complete (frontal & dorsal!) one (for every single complete image, we should expect the occurrence of a plethora of partial images – for instance, from a single hand or leg), and (b) it is improbable to the extreme that the only image thus produced also pops up in connection with the very special man who also happens to have the largest impact ever on human history (one expects that this single image, if produced by mere chance, should be connected with some random burial, and not with Golgotha). This being said, I think that Colin Berry should develop his argument starting from a more complete global representation of the Maillard reaction. For instance, during the different steps gaseous products (water and carbon dioxide) are produced and these should be taken into account. Already during the first condensation step, water is split off, thereby increasing the entropy of the reaction products & pulling the reaction towards the right..","date":"2012-08-11","mins":"4:57 pm","url":"https://shroudstory.com/2012/08/11/colin-berry-so-how-could-ray-rogers-have-got-it-so-wrong/","cat":"image_theory","title":"Colin Berry: So how could Ray Rogers have got it so wrong?"},{"id":"comment-17238","author":"jos_verhulst","post":"For those who need it: http://www.pdfunlock.com/.","date":"2012-10-05","mins":"7:06 am","url":"https://shroudstory.com/2012/10/05/paper-chase-lavoies-paper-from-frascati/","cat":"image_theory","title":"Paper Chase: Lavoie’s Paper from Frascati"},{"id":"comment-16494","author":"jos_verhulst","post":"I fear that doing such an experiment will be a waste of time & money, given that the hypothesis is extremely unlikely a priori, for simple logical reasons. Every hypothesis on the production of the Shroud image should take into account the uniqueness of the image on the Shroud. The Maillard hypothesis proposes a cause for the image that could operate as well on other shrouds; there is no reason why this unique image should happen to be the image of Christ, no less. Neither does this hypothesis, or other hypotheses of the same grain, explain why the image is so surprisingly complete. A viable hypothesis has to take into account, in one way or another, the fact that the image on the Shroud is not the image of some random person, but a complete image of Christ (or at least of somebody sharing a plethora of characteristics with Christ). It is because the image refers to Christ that it can be interpreted as a *sign*, namely as a sign of the ressurection, and a viable theory on the image should explain this particular aspect of the image. Consider also the following. The fact that the image is unique implies that the windows for the physico chemical conditions needed for its production are very narrow; otherwise more such images should be known. But the conditions (ventilation, gravity, pressure of the body on the Shroud…) were certainly different at the upper side resp. The lower side of the body. Nevertheless, the quality of the image is about equal for both sides of the body. The explanation of the image should account for the fact that (a) this is the image of Christ (or a lookalike) and (b) the image is complete and its quality is about equal for both sides of the body. The Maillard theory fails on all these points..","date":"2012-09-19","mins":"2:12 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-11257","author":"jos_verhulst","post":"But there nothing wrong, absolutely nothing wrong, with this lacking of a ‘consensus’. If people want to debate the shroud, they should do so as rational individuals, with each individual thinker pondering the evidence and developing careful reasoning. That’s all that there is to a scientific discussion. Thinking that the position of a protagonist moves somehow closer to the truth, or becomes more trustworthy or reliable, when it is backed by a ‘consensus’, is completely absurd. ‘Consensus’ is for those who believe, not in the power of truth and reason, but in the power of number and amount. This whole consensus thing should be dropped..","date":"2012-05-10","mins":"6:50 am","url":"https://shroudstory.com/2012/05/10/richard-dawkins-challenge-no-consensus-on-the-image-substrate/","cat":"image_theory","title":"Richard Dawkins Challenge:  No Consensus on the Image Substrate"},{"id":"comment-11094","author":"jos_verhulst","post":"It is a bad idea to refer to a ‘consensus’ when making a scientific point. One should not try to add weight to a statement by referring to an underlying ‘consensus’. Truth has nothing to do with ‘consensus’ and the expression ‘scientific consensus’ is, at the bottom, simply a contradictio in terminis. ‘Group think’ cannot be; thinking & judging is, by its very nature, an individual activity..","date":"2012-05-03","mins":"12:00 pm","url":"https://shroudstory.com/2012/05/03/so-is-ray-rogers-hypothesis-out-the-window-by-consensus/","cat":"image_theory","title":"So is Ray Rogers’ Hypothesis Out the Window by Consensus?"},{"id":"comment-14867","author":"jos_verhulst","post":"Again, it should be noted that the gist of the argument offered by Colin Berry is this one: “However, one can always fall back on first principles, and write the Rogers reaction as follows: Putrefaction amines (gases) + reducing sugars from starch etc (solid) — > Maillard reaction products (solid) Straightaway one sees that the entropy change is in principle unfavourable, since it involves a disordered gas reacting to form a more ordered solid.” This seems to be wrong, as far as I can see, because there will be small gaseous products that should appear on the right side of this reaction scheme..","date":"2012-08-13","mins":"2:50 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."},{"id":"comment-14921","author":"jos_verhulst","post":"As I already noted elsewhere, the Maillard hypothesis implies that the image came into existence accidently. It could have been produced as well in some other grave, if only the required physical and chemical conditions by chance were present. There is no special reason why an image thus produced should have formed on the very shroud that envelopped the body of Christ. Neither is there any special reason why the image should be so complete, front & back, although the physico chemical conditions would have been somewhat different at both sides of the body. There is no second example of such an image; not even an image of one single hand or finger is known. Nevertheless, we are supposed to accept that the only one image that came into existence in this natural and accidental way happens to be both a *complete* body image that concerns, moreover, not some random person, but Christ himself. All this is extremely unlikely. A rational explanation should also explain why this unique image is connected with Christ, and why this image is so ‘well done’ (ie why it is so complete)..","date":"2012-08-14","mins":"5:16 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."}]
