[{"id":"comment-214348","author":"jos_verhulst","post":"The often parroted claim “extraordinary claims require extraordinary evidence” makes no sense. Every claim on truth, whether trivial or ‘extraordinary’, should be backed by sufficient evidence..","date":"2015-11-07","mins":"7:28 am","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-201333","author":"jos_verhulst","post":"The fact that we don’t have a lot of burial cloth from antiquity seems immaterial. There is no reason to restrict observations to antiquity. Every single day, there are tons of new cases of death human bodies having been in contact with textiles of all possible kinds, under widely different conditions of humidity, temperature, ventilation, duration etc. No image forming ever seems to occur. IF (note the conditional) the shroud image is genuine and IF it has been produced when the linen was in contact with the dead body, then it would be an extremely exceptional object indeed. And it would be extremely unlikely that this unique & supposedly fortuituous image formation would have occurred in connection, not with some random person, but with Christ himself. There is still a second exceptional aspect: the image of the body, both front side and backside, is *complete*. A natural and accidental process is expected to produce many partial and incomplete images for every single complete image. That the only image known is at the same time also a complete image is exceptional as such..","date":"2015-06-08","mins":"10:22 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-208608","author":"jos_verhulst","post":"Here are UAH satellite temperatures: http://nsstc.uah.edu/climate/2015/june2015/june2015 GTR.pdf Global climate trend since 1978 (=start of satellite measurements): .11°C/decade. Seems the end of the nonsense is not near at all..","date":"2015-08-20","mins":"7:41 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"}]
