[{"id":"comment-191568","author":"jos_verhulst","post":"‘Destructive tests’, including C14 tests, can be done without any additional destruction of the Shroud, because there are still a number of unused samples out there. Especially the smaller piece that has been given to the Tucson lab: this sample should be used to test whether the age gradient observed in the 1988 measurements (Oxford old, Zürich in between, Tucson young) is real or not. This gradient is an objective, unusual and very disturbing aspect of the 1988 C14 dating, and the publication in Nature looks as if the phenomenon has been swept under the rug by the authors on purpose (I say: ‘looks as if’; this is not an accusation). In order to set the record straight, the authors should use the samples that they still possess to clear out this point. They should present a research plan, including a description of the samples that still exist, and a scheme of the statistical tests to be performed for checking the existence vs. Non existence of the gradient. Why is this not done? Where are these residual samples right now? Why the silence?.","date":"2015-02-22","mins":"11:52 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-28702","author":"jos_verhulst","post":"@ Hugh Farey “The Vatican Insider article says categorically that the samples were from 1988, while Fanti’s own 4 point defence refers to 1978.” According to the very last page of the appendix (written by Marco Conca) the samples were collected both in 1978 and 1988: “In sintesi, i campioni pervenuti a Fanti provengono da cinque filtri, depositati da Giovanni Riggi di Numana presso la Fondazione 3 M, che contengono polveri aspirate dall’ intercapedine fra Sindone e ‘tela d’ Olanda’ nel 1978 (‘filtri e f g h) e net 1988 (‘filtro i’)”. This appendix documents the source and history of the samples, and it does so in an entirely satisfying way. The comments by the ‘Centro internazionale di Sindonologia di Torino’ are unreasonable. There can be little doubt that they did not even read the juridical documentation presented by Marco Conca in the ‘appendice’ (p.207 221). I am still working my way through this book, but my first impression is that it is excellent, and bursting with new ideas..","date":"2013-03-29","mins":"7:58 am","url":"https://shroudstory.com/2013/03/29/barrie-schwortz-biggest-issue-so-far-seems-to-be-the-validity-of-fantis-samples/","cat":"news_&_views","title":"Barrie Schwortz:  Biggest issue so far seems to be the validity of Fanti’s samples"},{"id":"comment-57229","author":"jos_verhulst","post":"Zugabe being wrong does not prove Barbet being right. The observation by Bevilacqua ea (‘Do we really need new medical information about the Turin Shroud?’ Injury 2013; p.2) should also be taken into account. According to the test performed by these authors, ‘…the nails pierced the space between the radial, scaphoid and lunate bones…’.","date":"2013-12-08","mins":"6:40 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"id":"comment-29003","author":"jos_verhulst","post":"As a matter of fact, Fanti & Gaeta point the way for checking the validity of the C14 test. The problem with the 1988 test is that the results are not homogeneous, and that this lack of homogeneity has been hidden from view by the authors of the 1989 paper. However, Fanti (p.76 77 in the book) points out again the well known fact that the second, smaller part of the sample given to the Tucson lab has never been used for C14 dating. Importantly, according to the authors,the fact that it was this smaller part that was left untouched, was first concluded from their statistical analysis of the 1988 observations; this conclusion was then confirmed by prof. Timothy Jull from the Tucson lab (the key sentence is on p.76 of the book:”Dopo questi risultati il professore Timothy Jull, direttore del laboratorio di Tucson, in una comunicazione personale al professor Fanti ha ammesso che la parte di telo T2 non fu mai datata dal laboratorio dell’univeristà dell’Arizona, confermando così indirettamente l’elevato grado di attendibilità dei resultati ottenuti tramite la statistica robusta”). If indeed the results are not homogenous, but are showing a linear trend, then a clear prediction can be made concerning this sample that is still in Arizona. If the linear trend is real, then this sample should produce an age that exceeds the previous Arizona measurements in a significant way. This untested sample can be predicted to show an age superior to the values previously measured in Oxford, Zurich and, above all, in Tucson. So instead of arguing and speculating, why not just proceed to a further measurement? After all, the sample is there, and it has been given to the Tucson lab in order to date the Shroud..","date":"2013-04-01","mins":"9:39 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","title":"Alan Boyles Cosmic Log on Fanti’s New Book"},{"id":"comment-57221","author":"jos_verhulst","post":"Anomymous : What I was talking about was dating Fanti’s sample with C14, not Julls’ samples. Fanti’s samples seem to be far too small for C14 dating..","date":"2013-12-08","mins":"5:05 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57220","author":"jos_verhulst","post":"John Klotz : Dating Jull’s samples at Arizona won’t solve anything because the issue is the anomalous nature of the samples which skewed the results. Obviously Jull’s samples would have the same discredited characteristics. Any new testing would have to be of representative material and probably from more than one site. On the contrary, dating the Arizona sample(s) could resolve the question, whether there exists a spatial gradient in the apparent age (as measured by the C14 method) of the Shroud textile. The existence of such a gradient is suggested by the 1988 results..","date":"2013-12-08","mins":"5:03 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-9778","author":"jos_verhulst","post":"In the ‘key points and evidence’ section it is claimed that the observation “the Pray Codex miniatures prove the cloth was in existence prior to 1192, long before the date indicated by the carbon dating” is among the “…own findings” made by Thomas de Wesselow. Isn’t this somewhat absurd? There are a great many books where the same claim has already been made..","date":"2012-03-30","mins":"2:31 am","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","title":"Press Center for The Sign by Thomas de Wesselow"},{"id":"comment-18302","author":"jos_verhulst","post":"He also says, and rightly so, that the ‘volto santo’ of Manoppello IS a painting..","date":"2012-10-25","mins":"5:32 pm","url":"https://shroudstory.com/2012/10/25/must-listen-thomas-de-wesselows-talk-at-shroud-enigma/","cat":"art","title":"MUST LISTEN: Thomas De Wesselow’s talk at Shroud Enigma"},{"id":"comment-9617","author":"jos_verhulst","post":"Apparently, there was also an interview in the flemish newspaper ‘De Standaard’ http://www.standaard.be/artikel/detail.aspx?artikelid=MM3 NSNTH The Dutch translation comes out together with the English version..","date":"2012-03-25","mins":"6:54 am","url":"https://shroudstory.com/2012/03/25/telegraph-article-on-cambridge-shroudie-thomas-de-wesselow/","cat":"books","title":"Telegraph article on Cambridge Shroudie Thomas de Wesselow"},{"id":"comment-14753","author":"jos_verhulst","post":"“…his entire human reality (body, spirit and soul)”?!? This seems a very strange statement coming from a catholic, because the Catholic Church seems to reject trichotomy (=> the human being encompasses a body – soma , a soul psychè , and a spirit – pneuma; (1 Tes.5:23). ), with reference to the Council of Constantinople (869) See: http://www.vatican.va/archive/ccc css/archive/catechism/p1s2c1p6.htm (article 367, and note 237) Of course, there are also dissident catholics, such as Michel Fromaget, who defend the trichotomic view. Http://www.amazon.fr/drachme perdue Lanthropologie Esprit%2522 expliquée/dp/2914338279/ref=sr 1 1?ie=UTF8&qid=1344678100&sr=8 1.","date":"2012-08-11","mins":"5:42 am","url":"https://shroudstory.com/2012/08/11/yannick-clments-summa-theologica/","cat":"news_&_views","title":"Yannick Clément’s Summa Theologica"}]
