[{"id":"comment-191490","author":"o_k","post":"The basic error is that the guy makes a multitude of manipulations of his images (folding, mirroring, translating, the Shroud) and compares things that completely cannot be related directly nor in any reasonable way (like stain above the head on the Shroud with relief’s head). Contrary in case of the Codex Pray for example, relations between each key elements of the drawing and corresponding features on the Shroud are pretty straightforward, and does not need such twists like Paul Gell does. This only shows how desperate the sceptics are, so they try anything, just to discredit the Shroud at all cost..","date":"2015-02-21","mins":"10:27 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-191488","author":"o_k","post":"That’s more Mike, that’s simply Bull$%^&. And a clear violation of every rule of comparing the images. The guy, I presume tried to make a parody of all comparison schemes, especially Vignon marks, and Codex Pray. But his shots were far too short. Looking for accidental correspondences between completelty unimportant and unrelated (or even imaginative) details is easy but finding correspondence between non trivial, independent and clearly defined features that’s significant. But the guy does not feel the difference..","date":"2015-02-21","mins":"10:18 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-191492","author":"o_k","post":"But not my level, Andrea. And that’s the point..","date":"2015-02-21","mins":"10:42 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-191499","author":"o_k","post":"Thibault, you know Andrea’s stance… You are right, Thibault, Vignon is better. Wrong, but better. For the “problem” of Pray codex, no, I do not see differences. Nothing else you have to say, Andrea. I am serious. This statement hardly can be treated seriously..","date":"2015-02-21","mins":"1:14 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-119751","author":"o_k","post":"One note, the text above is of my autorship. I have sent it to Dan, a day or two ago..","date":"2014-05-15","mins":"3:52 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features"},{"id":"comment-119760","author":"o_k","post":"Thanks..","date":"2014-05-15","mins":"4:16 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features"},{"id":"comment-119872","author":"o_k","post":"Sounds heart felt, but is it in fact, true? Iconography has been remarkably consistent, and images of the infant Jesus and his mother are almost always recognisable as such without any label. Yes, Hugh, but they are easily recognizable by their standard attributes (Madonna with Child, for example), but we are talking about physical appearance. Tha Black Madonna of Częstochowa (http://upload.wikimedia.org/wikipedia/commons/5/51/Blackmadonna.jpeg ) is completely different from Raphael’s Madonna della Seggiola (http://upload.wikimedia.org/wikipedia/commons/f/f2/Raffael 026.jpg). Similarly Saint John at Patmos by Velaquez http://www.wikipaintings.org/en/diego velazquez/saint john at patmos looks completely different from Bosch’s http://www.wikipaintings.org/en/hieronymus bosch/saint john the evangelist on patmos 1485 Why isn’t it in the case of Christ? Why one physical look, even when portrayed with sinic features?.","date":"2014-05-15","mins":"7:51 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features"},{"id":"comment-119923","author":"o_k","post":"Why bother, you can simply go straight to the Michelangalo and the Last Judgment: http://upload.wikimedia.org/wikipedia/commons/3/3f/Michelangelo%2 C Giudizio Universale 03.jpg But those are exceptions, and the “classical” look of Christ is firmly established. Contrary to other prophets and saints. The differences in look there are an order of magnitude higher, than some variations on the Christ theme..","date":"2014-05-15","mins":"9:20 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features"},{"id":"comment-136233","author":"o_k","post":"Yes but it indicates little. As I have shown ( https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf ) there is a direct relation between faces on the Shroud and Manoppello. The other, complex issue is whether some images of Christ were modelled on the Shroud , or Manoppello (assuming the latter was Image of Camuliana and Veil of Veronica, according to Pfeiffer’s theory see http://www.acheiropoietos.info/proceedings/Pfeiffer Web.pdf ). There are ways to distinguish which image is based on which model, but we will discuss this later..","date":"2014-07-08","mins":"9:16 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-136231","author":"o_k","post":"Indeed, well job Hugh..","date":"2014-07-08","mins":"8:56 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-136212","author":"o_k","post":"I only want to show that Mandylion was considered by some as something larger than a “little cloth” as it is often asserted by some sceptics. Nothing more, at least so far..","date":"2014-07-08","mins":"7:42 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-134283","author":"o_k","post":"Good posting, Dave. Hugh Farey had commented that what was needed to establish a connection was the discovery of some kind of “smoking gun” clue. I suggest that the “smoking gun” might be found in a close study of the epitaphioi. Truly, I don’t think so. Based on the experience of the HPM debate, even the most evident example will not be the “smoking gun” for any of the sceptics rejecting a priori any existence of the Shroud before 14th century. No “smoking gun” makes any impression on them..","date":"2014-06-29","mins":"6:39 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","title":"Comment Promoted:  The Stavronikita Epitaphios"},{"id":"comment-139146","author":"o_k","post":"Primitive, amateurish overlay, very easy to undermine. See how it should be done in a more proffesional way: https://shroudofturin.files.wordpress.com/2014/06/manopello shroud comparison3d.pdf https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf 3rd part will be soon..","date":"2014-07-18","mins":"11:21 am","url":"https://shroudstory.com/2014/07/18/devastating-news-for-the-mona-lisa-is-she-or-he-a-photograph/","cat":"art","title":"Devastating News for the Mona Lisa?  Is She or He a Photograph?"},{"id":"comment-205294","author":"o_k","post":"I don’t know what you have on mind, Louis. What Byzantine connection? This is circa 1450, the Shroud is already in the West, as well as Veronica. And what the count of Vignon marks I have made myself has to do with it?.","date":"2015-07-11","mins":"4:45 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","title":"Dirk Bouts’ The Entombment"},{"id":"comment-205353","author":"o_k","post":"Louis: I interviewed Manoppello expert Father Heinrich Pfeiffer for two hours and selected only a few Q/Rs for a pdf, which I can send you through Dan if you are interested. Yes, it may be interesting, thanks..","date":"2015-07-12","mins":"4:09 am","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","title":"Dirk Bouts’ The Entombment"},{"id":"comment-205274","author":"o_k","post":"Hugh: Dieric Bouts – Resurrection (detail) See this picture from Treppa & Aszyk book (http://kiw.ug.edu.pl/en/religion/659 ikona z manopello prototypem wizerunkow chrystusa.html): I think it explains all..","date":"2015-07-11","mins":"2:36 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","title":"Dirk Bouts’ The Entombment"},{"id":"comment-61046","author":"o_k","post":"Badde also claims that Martin Luther, when one day came to see Veronica, saw only transparent Veil, with no face image upon it, and went out disgusted that the Pope deceives believers! And later of course came out with 95 theses, and so on. Interesting, but I must find original source of that..","date":"2013-12-17","mins":"3:10 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-145014","author":"o_k","post":"The president in upper right is Kennedy, Clinton or someone else?.","date":"2014-08-20","mins":"2:55 pm","url":"https://shroudstory.com/2014/08/20/face-matching-methods-questioned/","cat":"art","title":"Face Matching Methods Questioned"},{"id":"comment-61039","author":"o_k","post":"Yes, Louis, it is raised by Badde, questioned by Falcinelli, and so the fun goes on. You can see the reliquary here http://manoppello.eu/eng/gfx/rama.jpg.","date":"2013-12-17","mins":"3:00 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-61794","author":"o_k","post":"Thank you Gian Marco. Google translates it this way, but it doesn’t help much: the same as they do with the Veroniken also provide for, be it printed our Lord’s face in a Schweistüchlin, And nothing, because a black bretlin four hatched since henget a klaretlin for, about klaretlin a different, which they auffzihen when the Veronica have, kan Since the poor Hans von those no longer see, because a klaretlin for eim black bretlin, that is because the Veronica geweiset and seen, and God is with great devotion, and much Ablas bey such ungeschwungenen lies. He says something that ‘poor Hans no longer see’, that there is ‘nothing’, but truly I don’t know. What is it ‘klaretlin’? In his book The Face of God, Badde provides an interview with Pfeiffer, who claims that this anti papal pamphlet of Luther was one of the indications that convinced him that Veronica and Manoppello are the same. That Luther saw nothing, except for a linen on black board under strong light the face on Manoppello disappears, as it is presented on the figure above. Similar quotation is provided also by Gaeta, citing from G. Alberigo, Decisioni dei Concili ecumenici, Utet, Torino 1978 pg. 713. But there is nowhere a key word “transparent” one needs rather to guess this, than than to have a clear statement already on a platter..","date":"2013-12-18","mins":"4:41 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-61060","author":"o_k","post":"Louis, thanks for the link. Actually I have Badde’s first book, and plan to buy a second one. I have also books by Gaeta, and Resch, Centini and Wilson. Maybe there will be more soon. I doubt the claim that Chiara Vigo is the world’s lone expert in this field, but nevertheless I respect her opinion. However it is still uncertain whether the material of the Shroud is fine linen (byssus) or sea silk (which is also called byssus). The fact of touch ups contradicts the claim that painting on byssus is impossible. See article by Jaworski (http://www.acheiropoietos.info/proceedings/Jaworski Web.pdf and earlier presentation http://old.enea.it/eventi/eventi2010/Archeiropoietos Image040510/Jaworski.pdf ).","date":"2013-12-17","mins":"3:37 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-61064","author":"o_k","post":"Guys, here is alleged quotation from Luther. Source: http://milujciesie.org.pl/nr/the main topic/the greatest miracle in.html “They claim Veronica’s veil bears the imprint of the true face of Our Lord, when in fact it is a piece of transparent linen, which they hold up for people to see. The poor simpletons see nothing but a clear linen stretched on a black board.” I will further try to find the original source of the quote..","date":"2013-12-17","mins":"3:46 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-60906","author":"o_k","post":"Hey guys, of course there is still a long way to go, but the point of my presentation was not to prove that Manoppello is ‘miraculous’, or matches the Shroud, but is the same cloth that was venerated as Veronica Veil in the medieval Rome, until the begining of 17th century, when it was replaced by the current version, and tradition of public exhibitions suddenly and unexpectedly vanished. The conception that the Manoppello is actually the original Veronica has been first suggested by Pfeiffer around 1990, and quickly dismissed by several ‘authorities’ in the Shroud world, such as Ian Wilson (see article “Rome, Italy. Jesuit professor claims ‘discovery’ of the of the Veronica’ from BSTS #50 http://www.shroud.com/pdfs/n50part1.pdf ). Other resaerchers were also sceptical about this, for example Roberto Falcinelli (see http://www.shroud.com/pdfs/roberto.pdf and http://www.acheiropoietos.info/proceedings/Falcinelli Manoppello Web.pdf ) Here is, in my opinion rather conclusive proof that Falcinelli, Hesemann, Wilson are wrong the Manoppello is Veronica. According to Pfeiffer, it is also Image of Camuliana, and he has several good arguments to support this thesis (see http://www.acheiropoietos.info/proceedings/Pfeiffer Web.pdf ). Why for example Wilson is opposing this? Because actually, the Manoppello is game changer! It is another undesirable factor, that needs to be included in Shroud research, providing fascinating solutions to some problems, but also creating a multitude of others. The whole Wilson’s Mandylion theory has to be seriously revised for example there is another candidate (besides the Shroud) for this role. That’s why Wilson is against Manoppello..","date":"2013-12-17","mins":"11:12 am","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-60945","author":"o_k","post":"Louis: Hesemann is a sort of Vatican insider, but his arguments against Manoppello, presented in his “Die stummen zeugen von Golgatha” edited in 2000, are very poor, and have been refuted by Badde and others. Hesemann assumes that because Manoppello looks (on some photographs) like a painting, it must be a painting, which is wrong, becuase it is definetly not any classical painting. He also claims that Manoppello (measuring 24×17 cm) is too big for old 34×31 cm (Falcinelli claims 31.7×29.5, Badde 32×28 cm, virtually everyone claims different dimension) Vatican frame from 1350. But the outer edges of Manoppello were cut by father Clemente da Castelvecchio in 1608! So the dimensions are different! This also explains why Campin’s Veronica Veil is larger than Manoppello. Sorry, your arguments should be presented in an article or paper, not in bits and pieces with links. Actually what I presented is not my origianl idea. It was alredy presented in the books by Badde and Resch long ago! But, like many other information about Manoppello, have been virtually ignored by some wise guys knowing better! Before I forget, why the big difference between what is seen in Manoppello and the face attributed to Campin? This second face is more like what we see on the Turin Shroud. I see no such big difference. Open eyes, serene face, long nose. Brown hair… It may look like the Shroud, because of dark skin, but this is due to the painting technique it is hard (and missing the point of an artist) to paint a pale, hardly visible face on transparent cloth. But if this is not Manoppello, then how do you explain transparent Veil painted by Campin?.","date":"2013-12-17","mins":"12:16 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-60970","author":"o_k","post":"But let’s not forget that it is only attributed to Campin The author is the so called “Master of Flémalle”, but scholars are quite convinced that he is actually Campin (see http://en.wikipedia.org/wiki/Robert Campin ) Anyway we can be certain that the painting dates back to the 15th century. But what about the teeth and beard, different from what we “see” on the Shroud face? There seems to be evidence that the Manoppello veil was re touched with pigment, however that does not make it a painting. A similar thing is said to have happened with the Guadalupe Tilma and Callahan said that we would have to wait for the pigment to disappear. Here I don’t know what you mean. Of course they are different, because the Shroud image has a different nature than Manoppello. But there are quite convincing studies that both images represent the face of the same man. See study of Resch http://www.acheiropoietos.info/proceedings/Resch Web.pdf , although in my opinion there are some serious flaws in his methodology. Blandina Paschalis Schloemer has also published large format (and large price) album with comparison between Shroud Manoppello Oviedo, suggesting they both show the same face. See also the work of Fanti & Jaworski, (http://www.shroud.com/pdfs/jaworski.pdf ) giving additional corroborate evidence that the face of Manoppello and the Shroud represent the same person (although, contrary what the paper’s title may suggest, the Manoppello has no 3 D characteristics comparable to the Shroud, Jaworski nad Fanti simply use the 3 D processing as additional tool for comparative analysis). And if they represent the face of the same man, thus they must have something in common the question is, what is relation between the two?.","date":"2013-12-17","mins":"1:02 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-61032","author":"o_k","post":"Gian Marco: First thank you for some addtional examples, besides Campin, illustrating the point. And next, let’s analyze your twisted logic and futile attempts to turn everything upside down: We can only conclude that among countless artists who painted a not transparent Veronica veil, there were just a few who painted a trasparent veil, among them the author of the Manoppello veil. Those a few were enough to give us evidence that Veronica Veil and Manoppello are the same and contrary to your fantasies, the alleged author of Manoppello is not among them. Because: 1.) Manoppello is not a conventional painting. 2.) Had Manoppello been just another painting showing transparent Veronica, so where is the prototype? WHERE IS THE PROTOTYPE, Gian Marco? Can’t you distinguish between paintings of the transparent Veil (which is quite ambitious task for painters, so that’s why this feature is rarely shown on pictures), and the transparent Veil itself? That’s how the sceptics loose their minds Gian Marco! Isn’t a dogmatic scepticism a sickness of the mind? And some other issues mentioned: A question for O.K.: How do you know that the Rome Veronica was transparent? Nobody knows what it looked like. The painters who painted a Veronica (at least those who painted before ca. 1600), as far as we know, had never seen the (supposed) original that was in Rome. Really Gian Marco? Back to any book about Veronica Veil! There were regular public exhibitions since 1208, to 1606, as far as I know..","date":"2013-12-17","mins":"2:53 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-47213","author":"o_k","post":"So far I know she actually is a particle physicist, as well as artist..","date":"2013-10-12","mins":"9:48 am","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-47351","author":"o_k","post":"Hugh Farey : I do indeed. An event horizon is the radius from a point at which gravity is so intense that nothing at all can escape from it, and hence cannot effect anything outside it, and therefore cannot be detected. Although Piczek copies this definition fairly faithfully, she ignores the bit about gravity, which is by all known physics the only cause of an event horizon. It is clear she does not really understand it at all. By all means study Piczek’s article carefully. You will find that rather than using any kind of known physics to explain the image on the shroud, she speculates that a wholly unknown process is responsible. That’s not physics, that’s guesswork. Finally, you will note that her idea is rooted in the idea that the shroud must have been completely horizontally flat throughout the image making process, and the the image lacks anatomical distortion when viewed in than light. This is wholly contrary to your understanding of the 3 D nature of the image as explained to me with the help of a video only a few days ago. Hugh, the concept of event horizon is much more general. You mention only a specific example of an event horizon in the Schwarzschild metric, that is classical, spherically symmetrical black hole. Have you ever studied general relativity? I may disagree with some Piczeks claims in the article, but contrary to you, I don’t dispute her qualifications as a physicist (however I truly don’t know when and where she studied physics), based on layman’s misunderstanding of the term ‘event horizon’..","date":"2013-10-13","mins":"5:56 am","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-47251","author":"o_k","post":"“A paper entitled The Event Horizon of the Shroud of Turin on shroud3d.com shows no understanding of particle physics or quantum theory, or even of the meaning of event horizon. Weird.” Hugh, and do you know what the event horizon actually is? I have looked breifly, and see no mistakes in Piczek’s article, perhaps I must delve into the article to check whether it is corrct from the point of physics..","date":"2013-10-12","mins":"1:43 pm","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-191298","author":"o_k","post":"One telling argument against it is that the Image of Edessa showed only the face, and it is asserted that its alleged full length images only became known some time after its transfer to Constantinople by John Curcuas in 944. Still neither you, nor Markwardt understands the point. I suppose Wilson had understood it (and the threat to his hypotheses) and that’s why he twisted his argumentation in his 1991 Holy faces, Secret places. We can say with very high confidence that the Image of Edessa brought to Constantinople in 944 was actually the Shroud (the more I read confabulated relations in “Story of the Image of Edessa” by Porphyrogenitus, the more convinced I am). Nevertheless the question remain: was it the same cloth that was brought to King Abgar 900 years before? They say Mandylion showed only the face. Fine, then look for the cloth that shows only the face. Because of various set backs, military and natural, the superstitious Byzantines saw the need to hide and conceal the cloth under an imperial covenant with God, which was only broken late in the 12th century, when the full image was again revealed. I think the reasons were different. Entirely..","date":"2015-02-17","mins":"4:01 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"id":"comment-191303","author":"o_k","post":"Oskar, I think it is you who fails to understand the point. As persistently stated by Yannick from many years ago, there is not one Byzantine scholar who accepts Wilson’s theory, and I have been slow to accept that, until Markwardt’s paper. Yes. And why should we care about that? As I have shown in this post https://shroudstory.com/2014/01/18/wilson shroudies vs academia another guest posting by o k/ those scholars will never go beyond their very limited horizon of their imagination (which they do lack, as well as the basic knowledge of the Shroud, as well as fundamental ability to weight all the facts and draw reasonable and sensible conclusion). Edessa may have been copied from Camuliana. Is this the only possibility? You say “Look for the cloth that shows only the face” That seems to me an inference to the Manoppello, which is not the Shroud. Yes. But is directly linked to the Shroud, as I have shown in my humble presentation: https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf The Mandylion is reported as being sent to King Louis of France after 1204, and later destroyed during the French Revolution. Was this the same Mandylion that was brought to Constantinople in 944? Was this the same Mandylion that according to the legend was brought to King Abgar circa 30 AD? Nothing here is that simple as those narrow minded Byzantine scholars would like to think. The Mandylion was always deemed to be a face Yes. The question is: why? and yet from after the discovery of Camuliana, we have full length images in illustrations and crucifixes and banners. The Camuliana was brought to Constantinople in 574. The Image of Edessa was rediscovered in circa 544 or shortly before. So the connection with Edessa is just as plausible as with Camuliana. I think Markwardt gives an adequate explanation in his Antioch paper referring to the conversion of Abgar VIII the Great, (not Abgar V), and that may well have been the Shroud which Bishop Avercius Marcellus had temporary custody of from Antioch. It finds an echo in Bardaisan’s contemporary Hymn of the Pearl. Markwardt does not give facts, only another hypothesis. Which is no better than many other, based on pure speculation without solid evidence..","date":"2015-02-17","mins":"6:22 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"id":"comment-191323","author":"o_k","post":"The grounds for claiming that the Image of Edessa was rediscovered in 544 are highly questionable. The story appears to be a borrowing from when the true Shroud was rediscovered in the walls of Antioch as a consequence of the earthquake there in 544. Antioch is the natural apostolic home of the burial cloths. Dave, I think you take Markwardt’s claims too uncritically. Whatever he states, you take it at face value. While my opinion is that Markwardt’s historical essays although containing a lot of interesting informations are based not on solid evidence, but on mere speculations, developed about some minor episodes, developed in quite novelistic fashion. Thus they cannot be considered without a lot of reservations. There is not a slightest indication, slightest document giving as clue that the Shroud was ever in Antioch. On the other hand we have clear testimonies about Image of Edessa being rediscovered in 6th century. We have good reasons to suppose that it was actually the Shroud (further on). The Image of Edessa was always only ever claimed to be a face, and remained so until well after 940. How then could 6th 7th century iconoclastic Byzantines then produce crucifixes, images of the crucifixion, and upper torso icons of Christ, based only on a facial image? Unless perhaps someone knew the true nature of the cloth at that period (memory of which was apparently lost in the iconoclasm period). And I am quite certain that in 944 the Byzantine court knew the true nature of the cloth, but trying to avoid theological scandal, they tried to conceal it. Besides, you don’t need to know the whole image to produce crucifixes. They migh have appeared naturally, without the knowledge of the Shroud. Further there are Byzantine pre 940 references to the Image of God Incarnate, and yet as far as the Byzantines knew, the Edessan cloth was only a face. And there is no indication that the Image of God Incarnate (aka Camuliana, aka Veronica, aka Manoppello, according to Pfeiffer) was anything else but just the face image. Markwardt knew Pfeiffer’s (and Badde) stance, nevertheless he rejected it, pursuing his own imaginative scenario, and dropping the key element (Manoppello) out of the hands. It seems to me you would have a stronger case for the Mandylion becoming the Manoppello, which may in fact be your position. Yes. But not exactly. I have stated many times here, that the Mandylion has never been a single object. Just look at the propsed routes of both relics, Manoppello and the Shroud:Both cloths are candidates for being the Mandylion. And I believe that both cloths actually were the Mandylion, in different historical periods..","date":"2015-02-18","mins":"5:41 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"id":"comment-191380","author":"o_k","post":"Dave B: I am terribly sorry to say so, but your are WRONG, on several issues. Scavone’s Document IV refers to a letter of Constantine VII to his troops in 958. The particular relic is variously described as The Image of Camuliana, The Image of God Incarnate, and the Garment that God wore. There is no reference at all to link the Image of Camuliana with theofórou sindónos. Scavone does not write about that! Furthermore, there is also no indication that Image of Camuliana contained something else but the face. The Mandylion was claimed to be “painted in choice colours” which does not fit a description of the Shroud image, and as yet there are no grounds for presuming that the Manoppello is anything but a painted image. Oh, really? Have you read this? http://manoppello.eu/eng/index.php?go=badania Have you checked my paper: https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf Where is the paint? No matter it looks like being “painted in choice colours”, it is not a painting made by any technique we know. How do you explain the correspondence with the Shroud? There are serious grounds to consider it acheiropoietos, just like the Shroud. However Markwardt in his recent paper also refers to similar incidents occurring in the 6th 7th c. When Christ’s image was used for military palladia, and showed at least the upper torso. Documentary evidence, please. Markwardt’s speculations does not interest me. I recall that Scavone (still apparently a supporter of the Mandylion theory) gives citations indicating that the “Image of God Incarnate” did include a body image, but fails to recognise that this cannot apply to the Mandylion. There are no such citations in Scavone’s paper you linked. After attending to securing the church in Antioch against Chosroes, Bishop Ephraim suddenly departed on a mission to Cappadocia when he might have been expected to stay and rally the populace. On his return to Antioch this is not held against him but he continues in his role as Patriarch, it must have been an exceedingly important mission. It does not prove anything. I suggest that you endeavour to read again Markwardt’s three conference papers on the history of the Shroud in detail including the citations, “Ancient Edessa and the Shroud”, “Antioch and the Shroud”, “Modern Scholarship and the Shroud”, setting aside any preconceived ideas, and see if you can come to a better conclusion. I have read them. And there are no arguments there that would convince me that Markwardt’s heories are anything more than speculations at best, if not just historical novels. Markwardt examines Wilson’s Mandylion theory in considerable detail, and identifies the reasons why it cannot be sustained. The only reasons why it cannot be sustained, are conformism and cowardice of those so called ‘historians” who are not ready to admit that it may be (and probably is in general account) true. That’s why they invent thousands of really trivial problems, just to debunk it at all cost. You know what I must truly say this, even if it may sound brutal. You are really uncritical about Markwardt. You blindly accept whatever he says, but most of his papers are in fact, nothing else but mere speculations without solid evidence, although presented in a nice way. When you look at them with a more critical eye, you will see that they actually add little to our direct knowledge of the Shroud. The number of citations does not reflect the actual value of the paper, really it may even be used to mask actual low content of the article. Markwardt actually copied most of his recent ideas from Pfeiffer, (often through Badde books). Yet what is sad, he seemed to be too much opportunistic to follow Pfeiffeir’s ideas. As frustrated Badde writes, there seems to be some fierce opposition against Manoppello, even among (or perhaps especially) Shroud scholars. They are afraid of another “miraculous image” on the horizon..","date":"2015-02-19","mins":"8:12 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"id":"comment-191216","author":"o_k","post":"They perpetuate the Wilson hypothesis of the Image of Edessa being the Shroud. There is a much better candidate, “The Image of God Incarnate” originally the “Image of Camuliana” Dave. Have you read this? http://www.voltosanto.it/Inglese/paginadx1.php?c=2 Markwardt was perhaps one step from the key to the puzzle. Nevertheless he disregarded it like many others….","date":"2015-02-16","mins":"3:20 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"id":"comment-147718","author":"o_k","post":"Daves, the Manoppello Image is transparent, and has two, slightly different images on both obverse and reverse sides. So the question of left and right sides on Manoppello is quite irrelevant. There is wonderful site on Manoppello that illustrates this: http://manoppello.eu/eng/index.php?go=badania The rest of bibliography and useful links you can find in my papers..","date":"2014-09-01","mins":"6:24 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-191275","author":"o_k","post":"It seems that Pfeiffer identifies the Camuliana with the Manoppello, but the ref does not elaborate on why he thought that. It is not mentioned in this article, but if you read interview with him in Badde, he mentions that the earliest legends concerning Camuliana Image had references to water, that the image was created through the contact with water that echoes the composition and transparency of the Manoppello Veil. It is also mentioned by Markwardt (“Pseudo Zachariah also relates a legend which recites that this linen cloth had been discovered, inexplicably dry, in a garden well located in the Cappadocian village of Camuliana”, pg. 23 of his St. Louis paper http://www.shroud.com/pdfs/stlmarkwardtpaper.pdf ). Notes that Image of Edessa, never reported to be more than an Image of the face Is that a great problem? Note that there were at least three miraculous images reported in 6th century: the Image of Edessa, the Image of Camuliana, and the Image of Memphis,reported solely by Anonymous Pilgrim of Piacenza. The problem is that Wilson, Markwardt and others always assume that there could have been no more than just one true acheiropoietos (the Shroud)..","date":"2015-02-17","mins":"9:22 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"id":"comment-147304","author":"o_k","post":"Hello, Dave, sorry that late, I have been offline for a few days. Use the illustrations in my paper as a guide. They have several congruence points marked for help and confirmation of identity. Use blood marks on the right cheek for help. The pictures I had sent you have correct orientation..","date":"2014-08-30","mins":"7:21 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-148481","author":"o_k","post":"Dave, we are already forward on these matters: https://shroudstory.com/2014/09/02/manoppello shroud and durer a short presentation by o k/ https://shroudstory.com/2014/09/03/an experiment with overlay/ And also: The Manopello image does NOT imitate the “high eyebrows” they drop lower and match the positive image of The Shroud, better than the negative. What do you mean by “positive” and “negative” images of the Shroud, because there may be a little confusion? The “negative” means Shroud visible by naked eye, while “positive” the image seen on photographic negative, I presume?.","date":"2014-09-04","mins":"6:36 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-147783","author":"o_k","post":"OK, it would be a interesting experiment to use Dave Hines imaging overlay with the Manoppello image and the Albrecht Durer painting. Challenge accepted. Wait for results..","date":"2014-09-01","mins":"11:21 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-168153","author":"o_k","post":"Hi Dave! Thanks for all your efforts!.","date":"2014-11-03","mins":"5:25 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144776","author":"o_k","post":"I commend your ingenuity, OK, but I think I could do much the same with Rasputin. I just don’t think the Manoppello veil face looks anything like the Shroud face, and apparent congruences of one sort or another (abeit not the same ones) can be found on almost any pair of faces. So try..","date":"2014-08-19","mins":"11:56 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144926","author":"o_k","post":"Hugh and all. I can give you advice: mark in Paint all the notable features on both faces, in opposite colours (red and blue are the best in my opinion), like I did with Shroud and Manoppello (see my paper: https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf ). Then overlay. The marked features are then clearly visible and easy to compare..","date":"2014-08-20","mins":"5:02 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144777","author":"o_k","post":"I was hoping that by using facial recognition software rather than an overlay technique, it might be possible to get a more objective comparison. I forgot to mention: it would only as much objective, as algorithm used..","date":"2014-08-19","mins":"11:58 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144930","author":"o_k","post":"But really helpful..","date":"2014-08-20","mins":"5:15 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145005","author":"o_k","post":"I challenge anyone in the world, to come up with a better match than this fresco fits into The Shroud of Turin. Show me the photo and I will put it up and look at it. A photo that has NOT been altered and tailor made to fit. Hi David, try this: https://imageshack.com/i/p1vwv Bg Xj https://imageshack.com/i/eyazm0 S Fj.","date":"2014-08-20","mins":"1:39 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145206","author":"o_k","post":"Yes, Dave. Please read my paper again: https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf Especially pages 28 29. Can there be any doubt that those two are directly related? Would you mind if I ask you to do similar You Tube video, like you did with the Shroud & fresco, but this time with Shroud and Manoppello?.","date":"2014-08-21","mins":"6:56 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145508","author":"o_k","post":"Hi, Dave. Wouldn’t you mind maybe to check match between Shroud and the original (Kazimirowski) Divine Mercy image, made by eugeniusz Kazimirowski in 1934, under supervision of visionary Saint Faustina Kowalska? Just for the verification of the work done here: https://shroudstory.com/2014/08/22/another overlay divine mercy image and the shroud of turin/ You can also use later Hyła version from 1944 (http://www.niedziela.pl/gifs/portal/1398253506.jpg ), painted after Faustina death, as a control..","date":"2014-08-22","mins":"5:34 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144768","author":"o_k","post":"See my two papers how to match two faces and find congruences: https://shroudofturin.files.wordpress.com/2014/06/manopello shroud comparison3d.pdf https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf.","date":"2014-08-19","mins":"11:19 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145997","author":"o_k","post":"I don’t as yet know how to use Image J to quantify image density (but may try doing so soon). +scale (of course relative). Remember to adjust B&C first..","date":"2014-08-25","mins":"6:26 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-146002","author":"o_k","post":"Use ‘Thermal LUT’ in ‘Interactive 3 D surface plot’. While there, have also legend marked in ‘Display options’.","date":"2014-08-25","mins":"6:43 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-146058","author":"o_k","post":"Don’t use so much smoothing, Collin. It smears the scourge bloodmarks all around the back: https://imageshack.com/i/ipg Yunm3j https://imageshack.com/i/p4 QXBJR Vj The settings are the same..","date":"2014-08-25","mins":"11:28 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-146111","author":"o_k","post":"Hi OK, here it is Thanks Dave. Very nice. Except that you have made one tiny error, like many before you. You have confused left and right sides. The blood fleck on Manoppello nose is actually on the left side. See once again my paper: https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf , especially pages 28 29..","date":"2014-08-25","mins":"5:06 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-191822","author":"o_k","post":"From the discussion in the ‘Very Disturbing’ topic. These are the Shroud Scope measurements of the Shroud hand: Summary: the lenght from the end of proximal phalanges to the basis of the knuckles + from the basis of the knuckles to the centre of the wound where the nail exited (which is very clearly marked by the dark spot on negative!) is around 11 cm. Here is the photo my hand: The corresponding distance is exactly 11 cm as well (check the ruler). The begining of the scale is in the presumed nail exit, and it is clearly in the wrist. Conclusion: as my hand seems to correspond closely to the hand of the Shroud Man, and the distance of 11 cm from the end of mine finger joints leads to the wrist (one example is enough to demonstrate that), we can say that the nail exit is in the wrist just as both the look on the Shroud and forensic analysis indicate. The probable location of the nail exit is one of those proposed by Zugibe ( http://www.shroud.com/zugibe.htm ) so either the space between navicular, lunate, greater multangular and capitate bones, or so called Z area. End of discussion..","date":"2015-02-25","mins":"1:48 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-191831","author":"o_k","post":"If the cloth was rumpled at the location of the hands then that image would be distorted, and the hands would then appear to be longer than actual. Dave, I can assure you that the cloth was not rumpled and was tightly lying over the hands, following their shape. Just look at the intensity of the image, which is more less constant in the hands area: Had the cloth been rumpled, or not parallel to the hand (which is the case for finger endings), there would be drop or modulation in intensity. But this is not the case here. Actually you can determine the shape and dimensions of hands very precisely if you take effort to make very precise measurements, and use imagination a little bit. That’s how this work is done. The best way of locating the position of the wound is at the wound site itself, using a sufficiently clear image of the outline of the hands. It may be noted there that the blood smear of the wound extends from where the metacarpals of the thumb and fifth finger converge at the wrist carpals to just beyond the junction with the radius and ulnar. If you can’t see it, then you need a better image. The image is clear enough. And this method confirms measurements. The nail exit is in the wrist, in either of the positions indicated by Zugibe. Read his descriptions very carefully: http://www.shroud.com/zugibe.htm.","date":"2015-02-25","mins":"4:28 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-131638","author":"o_k","post":"I regret I see no further point in continuing what to me has been a most frustrating and unrewarding discussion. See, Dave? I warned: O.K. June 12, 2014 at 5:03 pm Dave, I have a feeling that Charles is simply looking for a pretext for another brawl here. As I have no time for this already, I suggest simply ignoring him for this moment..","date":"2014-06-20","mins":"6:27 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131422","author":"o_k","post":"Dave, do not worry. I plan soon to write a paper that hopefully should put an end to this debate about the Pray Codex, once and for all! Just wait..","date":"2014-06-19","mins":"5:19 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-123015","author":"o_k","post":"The icon is a fragment of triptych, of which the central part representing Mandylion is missing.The wings are 28 cm high and 9.5 wide. So the face on the Mandylion hold by Abgar is maybe 2 3 cm..","date":"2014-05-22","mins":"3:30 am","url":"https://shroudstory.com/2014/05/21/more-on-the-abgar-icon/","cat":"art","title":"More on the Abgar Icon"},{"id":"comment-131673","author":"o_k","post":"These discussions are viewed by other spectators and they matter the most. It doesn’t take long to see that we make more sense to them, and that is what matters the most. Mike, it is not so easy. There is such think as eristc and Charles is a master in it. Read this http://coolhaus.de/art of controversy/.","date":"2014-06-20","mins":"8:36 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131750","author":"o_k","post":"Hugh, the Codex Pray has been discussed here so many times, that any mention that Codex Pray must, or mustn’t be related to the Shroud can be viewed as provocation. In fact, I think the dispute is quite easy to solve, but one must have proper methodological approach to it. I try to show it later, as I have no time now to write a new paper, and Dan has no time to post it all around here (he still has an info from me about Kornelimünster relics to be posted). Anyway, Hugh, have a look at this; https://shroudstory.com/2014/06/18/the manoppello this little cloth cannot be further ignored in shroud research/.","date":"2014-06-20","mins":"1:08 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131798","author":"o_k","post":"I have sent my posting to Dan. I want it to be easily viewed by anyone, instead of looking for it in a jungle of comments. I hope Dan will publish it very soon….","date":"2014-06-20","mins":"3:43 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129050","author":"o_k","post":"William Forsyth in his book on medieval French sculpture, which I don’t have in my office at the moment, lists several examples of small circular, always circular, holes in these tomb lids which reflected actual circular holes that had been placed in the Sepulchre in the ninth century but which the iconographic tradition seems to have treated as if they were original. Charles, if you have it (those are pictures, I presume), put a scan or something for us. This may be important..","date":"2014-06-13","mins":"6:14 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129108","author":"o_k","post":"Max, John, everyone, I warned in this thread: https://shroudstory.com/2014/06/11/anticipating the conference dan scavone on evidence of the shroud in edessa/#comments O.K. June 12, 2014 at 5:03 pm Dave, I have a feeling that Charles is simply looking for a pretext for another brawl here. As I have no time for this already, I suggest simply ignoring him for this moment..","date":"2014-06-13","mins":"10:37 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129762","author":"o_k","post":"Hugh: No, what bothers me is that unless I wholeheartedly concur with these opinions, I am a bigoted non believer, selling out to the devil. Is that what you really think? Calm down, Hugh. A week or two ago, I was making a week long discussion with one sceptic (and his friends) on his own forum (so he was moderator, and could do with my posts whatever he want). During that discussion: * I was called moron several dozen times. * I was called “a fanatic” also several dozen times. * I had been once dehumanized and sent for compulsory re education * I was being accused of ignorance in physics and differential calculus. * I was called “philosopher” and “humanist” (that was the worst insult). * My posts were either changed or removed several times. Nevertheless, I prevailed, and my opponent simply run away from discussion under the pretext of “personal commitments”. So sometimes patience pays off!.","date":"2014-06-15","mins":"10:33 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-121131","author":"o_k","post":"Hugh, I adress some of the issues you mentioned in an updated version of the paper, I have already sent to Dan. It also changes one very important argument about the number of nails recovered by Helena, this may have far reaching consequences, so stay tuned..","date":"2014-05-18","mins":"10:55 am","url":"https://shroudstory.com/2014/05/18/paper-chase-a-revolution-indeed/","cat":"art","title":"Paper Chase:  A Revolution Indeed (with revised PDF file)"},{"id":"comment-121371","author":"o_k","post":"Hello, Dan, have you recieved updated version of my paper?.","date":"2014-05-19","mins":"3:49 am","url":"https://shroudstory.com/2014/05/18/paper-chase-a-revolution-indeed/","cat":"art","title":"Paper Chase:  A Revolution Indeed (with revised PDF file)"},{"id":"comment-202933","author":"o_k","post":"Let me know if anyone is interested. About high resolution scans, yes there are interested. A survey? Mere exercise, giving no definite answer. There are more powerful scientific tools. My opinion is that coin images are equivocal you can fit several different coins to those dots on photographs. Plus the probability issue I am thinking about making a Monte Carlo simulation, checking whether the alleged coin images may be real, or mere random noise. But in far future. One more thing Giorgio. Thanks for providing the 1977 conference proceedings. But that’s not what I am looking for. Wikipedia claims that there were several papers, for example J. J. Lorre – D. J. Lynn, “Digital enhancement of images of the Shroud of Turin”, in: Proceedings of the 1977 United States Conference of research on the Shroud of Turin, Albuquerque 1977, Holy Shroud Guild, New York 1977 https://en.wikipedia.org/wiki/Shroud of Turin#cite note 178 That’s what I am intersted. Any chance of finding that?.","date":"2015-06-20","mins":"10:36 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","title":"The Eyes Have It?"},{"id":"comment-188389","author":"o_k","post":"Charles, you have amused me recently. You know why? Because of your interview for the magazine “Do Rzeczy Historia”: http://eprasa.pl/news/do rzeczy historia/2015 02 28 When I saw this article in that so much right wing magazine, I was so amazed that I even purchased that issue! It seemed unbelievable to me that such a magazine (pro catholic and fiercely anticommunist) would ever publish such sceptical article about the Shroud. But it was much clearer to me when I read that interview, and it gave me impression that you had made a fool from yourself there. Really impressive achievement..","date":"2015-02-02","mins":"10:09 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-132022","author":"o_k","post":"Don’t you think that your probabilistic approach should be based on Bayes’ theorem? Otherwise, it just sounds like “dwindling probabilities”. In general, yes. But, you should have noticed that I used only INDEPENDENT details..","date":"2014-06-21","mins":"5:49 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132064","author":"o_k","post":"You may also say that the artist crook was inspired by the pray codex Suppose that it may be possible. Even then, it does not change the fact that the chances that all those features A F are randomly, and simultaneously portrayed in the Pray Codex, without direct reference to the Shroud, are negligible..","date":"2014-06-21","mins":"8:49 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132340","author":"o_k","post":"Thanks, Tristan. It seems standard view on the Pray Manuscript, nothing that has not been mentioned before. The Hungarian Pray Manuscript defends itself well. Those illustrations were derived from the Shroud. Simply, there is virtually no other option that makes sense..","date":"2014-06-22","mins":"3:00 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132329","author":"o_k","post":"Hugh: I think you still don’t understand. Some of the ‘evidence’ is sufficiently common not to require the Shroud as an explanation (the naked body, the crossed hands) How ‘sufficiently’? Can you give an estimate? 1/100 for naked Christ? More or less? I recall you, I gave 6 independent oddities, present both on the Shroud and HPM. What is probability of finding all of them just by chance? That’s the key of the reasoning. The angled slab As I said, this is not a slab. Definitly. Look once again: What is this ‘irrelevant thing in the background’, as you called it? It was not drawn without reason, absolutely..","date":"2014-06-22","mins":"1:49 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132357","author":"o_k","post":"The problem is that a certain “aloof English gentleman living in Australia” is wrong regarding Codex Pray he thinks rectangular shape is tomb cover, (see Bantam 2010, pg. 243) while I have shown conclusively it is the Shroud – look: The object pointed by green arrow is definetly a bench on which angel is sitting that means the rectangular must be the Shroud..","date":"2014-06-22","mins":"4:26 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132361","author":"o_k","post":"Charles: The crucial question – why reproduce the holes, the damage to the Shroud, but not the images, the most important distinguishing feature of the Shroud ? I have to agree that it is beyond my limited imagination but perhaps not beyond yours. Yes, it is beyond your limited imagination, but not beyond mine. The artist didn’t intend to portray the Shroud – he simply inserted some curious elements he saw on the Shroud, presumably in Constantinople. That was simply his vision of Entombmetn/Three Marys scene. No secret code..","date":"2014-06-22","mins":"4:38 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132364","author":"o_k","post":"Schopenhauer, Eristiche Dialektik: http://coolhaus.de/art of controversy/erist31.htm Stratagem XXXI If you know that you have no reply to the arguments which your opponent advances, you may, by a fine stroke of irony, declare yourself to be an incompetent judge: “What you now say passes my poor powers of comprehension; it may be all very true, but I can’t understand it, and I refrain from any expression of opinion on it”. In this way you insinuate to the bystanders, with whom you are in good repute, that what your opponent says is nonsense. Thus, when Kant’s Kritik appeared, or, rather, when it began to make a noise in the world, many professors of the old eclectic school declared that they failed to understand it, in the belief that their failure settled the business. But when the adherents of the new school proved to them that they were quite right, and had really failed to understand it, they were in a very bad humour. This is a trick which may be used only when you are quite sure that the audience thinks much better of you than of your opponent. A professor, for instance, may try it on a student. Strictly, it is a case of the preceding trick: it is a particularly malicious assertion of one’s own authority, instead of giving reasons. The counter trick is to say: “I beg your pardon; but, with your penetrating intellect, it must be very easy for you to understand anything; and it can only be my poor statement of the matter that is at fault”; and then go on to rub it into him until he understands it nolens volens, and sees for himself that it was really his own fault alone. In this way you parry his attack. With the greatest politeness he wanted to insinuate that you were talking nonsense; and you, with equal courtesy, prove to him that he is a fool..","date":"2014-06-22","mins":"4:53 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132474","author":"o_k","post":"Still you don’t understand anything. Even if you give me example of naked Christ, even if you give me examples of circular holes from Holy Speulcher, and so on, you still can’t undermine my reasoning. You have to show that the probability of portaying features A F all together,just by random, without reference to the Shroud, is far greater than, say one in the milion..","date":"2014-06-23","mins":"5:08 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132367","author":"o_k","post":"2) O. K. And his followers. No, the ‘coffin lid’ IS the Shroud despite the other cloths shown on it and the iconographic evidence that this what stone coffin lids look like in these depictions. Query is the shroud folded? Otherwise why are the poker holes running across its whole width? Charles: Look once again: What is an object, that I pointed with green arrow?.","date":"2014-06-22","mins":"4:58 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132384","author":"o_k","post":"What this object can be?.","date":"2014-06-22","mins":"6:15 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132472","author":"o_k","post":"OK: are you not aware of the perils and pitfalls of what is known as “selection bias” (googlable)? I don’t know what exactly type of “selection bias” you have on mind. The presence of L shape holes on both TS and HPM, for example, is absolute and undisputable fact..","date":"2014-06-23","mins":"4:57 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132489","author":"o_k","post":"Schopenhauer, Eristiche Dialektik: http://coolhaus.de/art of controversy/erist24.htm Stratagem XXIV This trick consists in stating a false syllogism. Your opponent makes a proposition, and by false inference and distortion of his ideas you force from it other propositions which it does not contain and he does not in the least mean; nay, which are absurd or dangerous. It then looks as if his proposition gave rise to others which are inconsistent either with themselves or with some acknowledged truth, and so it appears to be in directly refuted. This is the diversion, and it is another application of the fallacy non causae ut causae. Colin: Your example with pack of cards is misrepresentation of my argument. The chance for particular order of cards is about 1 in 8*10^67. But! Suppose you have one pack of cards in particular order (that’s the Shroud). And then you have 10 milion (10^7) of other packs, each shuffled in its own order. (that’s illustrations, like those in the Pray Codex). What is a chance, that among those 10 millon, you find one pack in the same order as the first pack? If you find one such pack, it is very likely, that it was not shuffled randomly someone cheated here. And Mona Lisa/Victoria analogy is also false. I suppose that probability of finding two potraits of four fingered ladies with charming smile is rather cloes to 1 than 0. So poor your case, that you refer to such primitive, flawed tricks, Colin?.","date":"2014-06-23","mins":"7:19 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132383","author":"o_k","post":"‘The artist didn’t intend to portray the Shroud’. Something we can agree in at last ! He didn’t want per se, but he portrayed it and some of its odd elements like L holes, cropped legs, naked Christ etc..","date":"2014-06-22","mins":"6:14 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132523","author":"o_k","post":"This looks much more like a representation of red marble (see The Burial Lamentations by Theophanes the Cretan for a similar attempt) than any weaving pattern. How many times I have to repeat, this zigzag patterned rectangle cannot be a marble nor tomb lid! Look once again: What is an object, that I pointed with green arrow? Can it be anything other than a bench, on which angel is sitting? And as it is a bench, the zigzag patterned rectangle cannot be a lid. Period..","date":"2014-06-23","mins":"11:12 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132062","author":"o_k","post":"Perhaps, but I only included those that the sceptics cannot dispute in any way..","date":"2014-06-21","mins":"8:20 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132528","author":"o_k","post":"Fully naked, arms crossed Fully naked and arms crossed are not independent traits genitals must be covered by something. You need more independent elements, to prove by statistical significance, that common features of both HPM and TS are not by chance..","date":"2014-06-23","mins":"11:45 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132562","author":"o_k","post":"Hugh: Whether the lines behind the angel are a building, a fence, or even a chair Those are not building, nor fence. This is simply a bench. Which definitely refutes the claim that zigzag patterned rectangle is a tomb lid. Then it hardly be anything else but the Shroud. But desperate sceptic will always try to deny the obvious. David Goulet: Clearly the artist, if he did see the Shroud, did not have time to study it closely. It ‘feels’ more like the artist may have been drawing from someone else’s memory then meshing it with his own imagination. I tend to agree with Hugh, who has always maintained that there simply is no direct link between the HPM and the Shroud and playing with probabilities doesn’t change that. You have a different understanding of the term ‘direct link’ than me. Whether artist studied the Shroud, or was drawing from his, or someone’s else memory, is irrelevant. What is relevant, is that there are at least 6 independent peculiar elements, shared all together only by TS and HPM. Which makes extremely improbable that HPM was not modeled on TS. Charles: A summary. Reflections of an arrogant and aloof English historian. It shows that you completely do not understand anything. You simply cannot refute simple my reasoning, instead making long speech hardly relevant to (mathematical) problem. No one, neither Colin, nor Charles, nor Hugh, nor anyone has been so far able to refute my reasoning presented in the article above. I suppose no sceptic is. On the other hand, it seems that many either do not understand it, or pretend not to understand..","date":"2014-06-23","mins":"4:19 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132647","author":"o_k","post":"He’s still got his feet on the marble slab. I really don’t see how interpreting the ‘thing’ as a bench automatically refutes the possibility that the slab is a slab. It’s a complete non sequitur. And as it is a bench (it is the simplest explanation, and hardly can be anything else), how angel can put his feet on angled, moved away slab (especially on the other side of the tomb the alleged bench is behind the alleged red crossed tomb, while alleged slab is in front of it)? Do you really want to clutch at straws and suggest that the artist portrayed such absurd thing, just to defend this slab? Anyway, slab or the Shroud, you have not been able to refute my article. Which is enough to prove with almost certainty the HPM TS connection..","date":"2014-06-24","mins":"5:17 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132566","author":"o_k","post":"Yeah, Colin. As one politician once said: They won’t convince us that white is white, and black is black..","date":"2014-06-23","mins":"4:45 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132563","author":"o_k","post":"Simply: A) May naked Jesus on the HPM be be derived from TS? Yes. B) May 4 fingers, without thumbs on both hands of Jesus on the HPM be derived from TS? Yes. C) May cropped Jesus legs on the HPM be derived from TS? Yes. D) May zigzag patern on HPM represent herringbone weave on TS? Yes. E) May two red smudges on the rectangle on HPM represent blood belt on TS? Yes. F) May the four L shaped circles on the HPM represent poker holes on TS? Yes. The crucial question is: what is a chance of finding all those elements at random on a single card of a Codex? The answer to that question is enough to prove connection between TS and HPM. Nothing else is needed. Discussing anything else is waste of effort, and even detrimental..","date":"2014-06-23","mins":"4:32 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132648","author":"o_k","post":"Sorry not ‘Shroud’ – although it may indeed have been made shortly before 1195 if shown in the Codex – I meant Pray Codex. So Charles, you are already admitting the possibility that the Shroud is actually portrayed in the Pray Codex. But it is more than possibility it is almost certainty..","date":"2014-06-24","mins":"5:20 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132572","author":"o_k","post":"Can’t vouch for incorrect number of fingers however. And on HPM you have all those features together. Probability around one in a milion..","date":"2014-06-23","mins":"5:28 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132651","author":"o_k","post":"BTW. I put ten pounds on six INDEPENDENT horses in six INDEPENDENT races each at a hundred to one and I lost the lot. So much for mathematical probability. Yes, you lost because you don’t understand what probability is. I considered probability for the event that illustrations in the HPM are not directly derived from the Shroud exactly opposite to what I wanted to show. Null & alternative hypothesis do you know what they mean?.","date":"2014-06-24","mins":"5:39 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132673","author":"o_k","post":"And I am still waiting for an answer what’s with Kornelimünster….","date":"2014-06-24","mins":"9:04 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132668","author":"o_k","post":"Jesus fish doesn’t represent Jesus but merely a representation of a fish. It isn’t representation of a fish, but a turtle! ; ).","date":"2014-06-24","mins":"8:21 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132827","author":"o_k","post":"I am sure that there will be people who insist on seeing the Shroud and perhaps even turtles in the Codex but it seems clear to me that the illustrator is linking Jerusalem and crusading within the traditional iconography of the burial and Resurrection scenes. Charles, your opinion is as irrelevant, and as erroneous, like opinion of a guy seeing turtles in the Pray Manuscript. You haven’t been able to refute my reasoning, presented in the article above..","date":"2014-06-25","mins":"3:15 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132831","author":"o_k","post":"I am sorry O.K but your reasoning seems to be on the level of ‘A dog has four legs,a cat has four legs. Therefore a dog is a cat’. Charles, being so wise, tell us all how do you recognize that dog is a dog, and cat is a cat. It’s not reasoning that is important here ,it is LOOKING at the Codex and trying to work out what influenced the illustrator Guess what? in this case a Hungarian working in 1195 at the height of a Crusade fever in Hungary when his king had just taken a vow to go on Crusade. There is no direct link between this and Pray Manuscript whatsoever. At least you cannot prove that. Besides, those illustrations are considered to be older, dating to circa 1150s. I do wish people would not follow Ian Wilson with such complete lack of critical thought. Who cares about Wilson here? He, and his subjective opinions is completely irrelevant here just like yours (and mine). The only think relevant is that there are at least six independent, undisputable similarities between the Shroud and Pray Manuscript and extremely small probability that those similarities are just random, without direct influence of the Shroud. You cannot reject the possibility that Pray Mansucript cannot be influenced by te Shroud. You have admitted this yourself: Sorry not ‘Shroud’ – although it may indeed have been made shortly before 1195 if shown in the Codex – I meant Pray Codex. Those are your words. On the contrary, I can show that an option that those six similarities between Shroud and HPM are just by chance, is so improbable, that every reasonable observer would reject it. You have not been able to show anything against this argument..","date":"2014-06-25","mins":"4:04 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132846","author":"o_k","post":"Dave, first of all, we can be with around 99.9999 % significance certain that there are references to the Shroud in the Hungarian Pray Manuscript. That’s the point. Any other discussion about interpretations, or significance of each element in HPM, is in fact, detrimental. Why? Because dubious interpretations are only play into hands for the sceptics! They can easily dispute them, pretending that they refuted the whole HPM!.","date":"2014-06-25","mins":"6:19 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132836","author":"o_k","post":"In my opinion, Wilson and now OK have made an honest mistake. They also are overstating the parallels and are not being open to the strong counter arguments. Simple question, David, do you understand my reasoning presented above? Yes or no..","date":"2014-06-25","mins":"4:38 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132845","author":"o_k","post":"I agree, David. The Pray Codex is irrelevant unless there is really no other evidence for the existence of the Shroud before 1355. You don’t need it otherwise. Your logic, Charles, is astounding. So is there other evidence for the existence of the Shroud before 1355? If yes, then HPM indeed may be ‘overkill’. And if not, the HPM is enough to prove existence of the Shroud before 1195 showing that 1988 carbon dating cannot be trusted. If it was on the Codex, it would only tell us that the Shroud was in existence somewhere that the Hungarian might have known about, east or west The most important think is that it was in existence before 1195 – and so before 1260 1390 claimed by 1988 C14 dating. It doesn’t say where, but… more likely west Less likely. What indicators do you have for West? None. And for the East you have several documents showing the presence of alleged burial cloths, most notably Robert de Clari’s mention of the sydoines with the figure of Our Lord on it exactly like on the Shroud of Turin. So possibly early medieval, certainly a time when relic cults of this kind were very popular. And when were they not popular? That does not get us much further. That, first of all, refutes 1260 1390 dates from 1988 dating. Which makes the date of the Shroud production unknown all dates are permitted..","date":"2014-06-25","mins":"6:13 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132102","author":"o_k","post":"Hugh, at last. Long post, showing that you still don’t understands the reasoning. So I comment the most important points, without answering all examples. What are the chances that a painting of the dead Jesus which is “wrong” in all these respects owes anything to the Shroud? Astromomically unlikely, I think anyone would agree. And yet there is a painting of the Shroud on the very same canvas! No Hugh, exactly contrary. It is very easy to draw a representation of the Shroud of Turin that has many errors and differences from the original. Just try to do it yourself, from memory, without any photos for aid. Thus the importance of differences is much smaller than similarities. On the other hand, to write ‘out of nothing’ a picture which has at least six pecularities of the Shroud of Turin? Extremely unlikely. May I rephrase Chesterbelloc’s comment: “I don’t know how anyone couldn’t at least wonder about these things, instead of instantly accepting them without reserve.” If you carefully read my post again, you will see that I do not assume that they come directly from the Shroud. I just estimate the frequence of their possible occurences..","date":"2014-06-21","mins":"12:08 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132899","author":"o_k","post":"The fact remains that an art historian is best placed to judge whether the HPM was influenced by the shroud. No Thomas, the art historians are not proper for that job. They are not better qualified than we are. They do not have methodology to determine whether there are direct relations between particular objects (like TS and HPM), and they are often uncritically stuck to their paradigms. They have the knowledge, but not understanding. The best qualified people for that job are in police..","date":"2014-06-26","mins":"5:33 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132897","author":"o_k","post":"We see another sceptic desperately and ignorantly trying to dispute my conclusions. Fine. Let’s show David Mo’s misunderstandings: 1. Errors of knowledge of the medieval art. The percentages assigned to some characteristics are erroneous (very low). Croissed hands, thumbs, etc. See here: https://picasaweb.google.com/112820198650228388541/Lienzo prolong# Excellent gallery, David Mo. It shows how improbable is to find by chance all six elements A F I mentioned in the Pray Codex at once .It supports my view much more than yours. 2. Ambiguity in the concepts. “Similar to” is not mathematically useful. They are similar enough to warrant comparison. And no matter of similarity, for sceptics they are inconvenient enough, that they try to reject them outright, under any slightest pretext. Croissed hands are not a hand over the other. Etc. Crossed hands do not interest me here at all. 3. Confusion between different objects. The shroud of Turin is not a representation of Jesus in the tomb. Confusion present yourself, David Mo. You don’t understand (or pretend not to understand) anything. Fools….","date":"2014-06-26","mins":"5:26 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132958","author":"o_k","post":"My mistake is that I even mentioned those crossed hands in the descritpion above. Actuallly the only point that interest me in A is “Jesus is naked.” The crossed hands potentially can be described as just a consequence of this..","date":"2014-06-26","mins":"1:55 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132036","author":"o_k","post":"I don’t know what you had on mind writing: your probabilistic approach should be based on Bayes’ theorem. Whether: 1 Calculating the probability of an individual Illustration (I or II) having either elements A B C , or D E F (which are of course independent). Or: 2. Combining the probabilities of both Illustrations I & II having all the elements A B C D E F. Of course in the latter case the Bayes theorem plays importance, and should be fulfilled. But I don’t want to delve so deep into mathematical details, approximation of final probability etc. The conclusion is most important here..","date":"2014-06-21","mins":"6:23 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132959","author":"o_k","post":"OK, yes I understand your reasoning. You are saying it’s the totality of the parallels that is significant. But this reminds me a bit of Ten Angry Men. Your verdict is based on totality of available evidence and it seems sound. But Charles and Hugh have demonstrated that the parts (of your sum) can be placed into reasonable doubt — thus negating your overall verdict. The reality is not Hollywood. I knew that the parts can be placed into “reasonable doubt” that’s why assigned probability of around 1/100 fro them. But conjunction of all of them is so improbable, that within all reasonable limits we can reject the possibility that HPM was not influenced by the Shroud. If the evidence was so conclusive, we wouldn’t be having this debate, would we? Because no matter what arguments in favor would be, the verdict certainly is unacceptable by the sceptics. That’s why they resort to anything, splitting hairs, counting on that we, supporters, get lost in all those details, and they triumphally declare their “refutation” of the Codex argument. That’s why we should abstain from any speculations and concentrate simply on reasoning which is quite simple, and I think hardly possible to undermine. However the sceptics, spreading the chaos in cynical way, are preying for (sorry for that term) a sucker, who would fall into doubts and say we’ve got a hung jury on the HPM That’s what they want..","date":"2014-06-26","mins":"2:10 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132967","author":"o_k","post":"Suckers are suckers because they too easily accept a single point of view, right? No, because they are simply naive victims to someone’s else dirty games. Reading minds is quite simple, actually. And 10×10=100, no matter the bias. Probability ratios are maybe a little bit arbitrary, but given what has been presented here by the sceptics, I suppose they are good enough estimate. And whether it is 1/100, 1/50 or 1/1000 doesn’t change the final conclusion, really..","date":"2014-06-26","mins":"2:46 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132974","author":"o_k","post":"Charles, back to the starting point: A) May naked Jesus on the HPM be be derived from TS? Yes. B) May 4 fingers, without thumbs on both hands of Jesus on the HPM be derived from TS? Yes. C) May cropped Jesus legs on the HPM be derived from TS? Yes. D) May zigzag patern on HPM represent herringbone weave on TS? Yes. E) May two red smudges on the rectangle on HPM represent blood belt on TS? Yes. F) May the four L shaped circles on the HPM represent poker holes on TS? Yes. Can you prove the opposite, to any of the point A F? No. I am not interested what the artist actually wanted to depict. The crucial question is: what is a chance of finding all those elements at random on a single card of a Codex? The answer to that question is enough to prove connection between TS and HPM. Nothing else is needed. Can you adress to those points, instead of wasting many words on rubbish talks about Church of Holy Sepulchre, etc. ?.","date":"2014-06-26","mins":"3:32 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132976","author":"o_k","post":"David (Goulet): Charles, your last paragraph makes a lot of sense to this sucker. If you consider Charles, to be honest and free of bias, very well. Your choice. I only warned….","date":"2014-06-26","mins":"3:34 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132105","author":"o_k","post":"I think you can look at this too scientifically and come to a conclusion such as Hugh’s. He is not lokking at it scientifaclly, but desperately. My response for him is already awaiting moderation. We have no idea what was in the mind of the artist of the HPM, whether or not he/she had even seen the Shroud or was just producing an image from hearsay. This question is completely irrelevant in my presented reasoning. Just the frequency of random occurences of A F pecularities. The question becomes is the Shroud that source or is it just another representation? Can you give any idea of another representation?.","date":"2014-06-21","mins":"12:12 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132981","author":"o_k","post":"To the point Charles. We don’t look into the mind of the artist, only on the result of his job..","date":"2014-06-26","mins":"3:58 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132990","author":"o_k","post":"Me again. A) “May naked Jesus on the HPM be be derived from TS? Yes.” No. […] Hugh, do you understand the difference between may and must? English is your native language, not mine. I don’t express necessities but possibilities. And you cannot deny them. “The crucial question is: what is a chance of finding all those elements at random on a single card of a Codex?” Well the answer is: absolute certainty. Because there is such a page. Hugh, do you read with understanding? I wrote finding all those elements at random. That means, without direct relation to the Shroud (then it wouldn’t have been random). Someone just portrayed all those elements from Heveans know what, Holy Sepulcher, Byzantine arts, no matter. At random, that means what is probability of occurence of all those elements, without influence of the Shroud. Don’t suggest too much David’s Mo selection, because it is selection so it is not representative. However, even then it shows how unlikely is to obtain six independent peculiarities with the Shroud simply by chance. “I am not interested what the artist actually wanted to depict.” That is a pity, because I think the intention of the artist is a fascinating question. Fascinating, but not necessary to show the relation between HPM and the Shroud and actually only distracting from it..","date":"2014-06-26","mins":"5:38 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132997","author":"o_k","post":"So yes, I deny the possibility that the Pray man derives from the Shroud. Is that not reasonable? Yes, it is not reasonable. You know why? You wrote: I have been trying to imagine myself as a Benedictine monk who had seen the Shroud, setting off to illustrate a liturgical text. And that’s the error, you and Charles commit. You can’t imagine yorselves as Benedictine monks, trying to guess what the guy who painted those illustrations had on mind. He had his own purpose, you don’t know what, and chose those elements he considered proper for it. You cannot paint those illustrations for him, you just can analyze 800 years later the result of his job. The fact is that there are at least six major, independent peculiar details shared between HPM and the Shroud. And the chance that they are all just combination out of anything but the Shroud, is very minute..","date":"2014-06-26","mins":"6:16 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133073","author":"o_k","post":"I want to adress some points: daveb: On the other hand, O.K. Seems uncompromising in being prepared to concede that there may be significance in the elements present relating to the Jerusalem tomb, as propounded by Charles. He seems concerned that any such concession risks diluting his claim that the artist knew of and intended to represent elements of the Shroud. No, it’s not true. If you read my article once again, you will notice that I have written: F –the four L shaped ‘poker holes’, similar to those that can be found on the Shroud –reference to it, or just another (very strange) decorative pattern (or to the holes in the Holy Sepulcher, or anything)? No matter. Let’s estimate chance for their random occurrence… So I took into account the possibility that those are derived from the Holy Sepulcher or any other source. I do not deny that there may be some references to the Holy Sepulcher in the Pray Manuscript. But when combined with other elements, there is virtually no doubt that the illustrations in the HPM were influenced by the Shroud. Thus Charles’ instigations on the Chruch of Holy Sepulcher are simply irrelevant. They are just distraction (like Egypt and Bayeux). Charles knows that he can’t undermine my reasoning directly (had he been able, he would have done it), so he is running away from it on another topics. Hugh: Three of your identities depend on a conviction that the Shroud and the Pray manuscript are related in the first place… There is no conviction. Contrary, I assumed that Pray Manuscript is unrelated with the Shroud, and estimate what is a chance of obtaining six such similarities at random. And the result in practice exclude that possibility. Read the whole article again..","date":"2014-06-27","mins":"5:51 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132114","author":"o_k","post":"Chris B Last point first, without searching, I believe there are a few sculptures/images showing crossed arms and missing thumbs. Point A is not crossed arms, but nudity. Crossed hands simply cover Jesus genitals, so they are not independent trait. Anyway, those are at most 2 out of 6 elements. Did the HPM artist see the Shroud or not? In the presented reasoning, the answer for this question is actually the final conlcusion, not presumption. Some aspects of the HPM are more certain than others when comparing to the Shroud. E,g. 1. There are certainly missing thumbs on the HPM and Shroud. 2. It is uncertain whether or not the HPM depicts a tomb lid with a zigzag pattern or whether it is the Shroud with its herringbone weave. How do you go about weighting these perceived similarities when calculating probabilities? It seems to be highly subjective and not amenable to this type of comparison. No, it works in different way. I take into account only the facts beyond any dispute on the HPM. So thumbs are certain. The question of whether HPM presents tomb lid, or the Shroud, is actually irrelevant to me (BTW, Ian Wilson thinks it is a lid). The only important thing is that zigzag pattern is similar to the herringbone on the Shroud, and it may (but I don’t claim that it ‘must’ or mustn’t) represent it. Then I try to guess, how large perecentage of illustrations may have similar pattern? Similar with other elements. The conclusion is that drawing all those six peculiar elements similar to the Shroud ‘out of nothing’ is extremely unlikely..","date":"2014-06-21","mins":"1:40 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133137","author":"o_k","post":"Hugh; I don’t believe anybody would look at a zigzag pattern on a rectangular slab and say: “I wonder if that could be depicting a cloth with a herringbone weave,” unless they were previously convinced that the depiction was, indeed, just that I wish to congratulate your ignorance, Hugh. “I wonder if…” Do you understand the difference between hypotheses, and facts? Between necessities and possibilities? Whether the artist depicted by zigzag pattern, the herringbone, or anything else, is a hypothesis. This hypothesis is then checked with other facts. If they fit into it, and all other hypothesis can be rejected, it becames a scientific fact at least unless someone in the future shows it incorrect. Short saying, of course. “Read the whole article again.” No, let’s not, I understand it perfectly and I disagree with it. Let’s try to find something new. No, you have shown that you don’t understand it. That you don’t understand the basic concepts. So how can we discuss then? There is a difference between science and scepticism. Really..","date":"2014-06-27","mins":"2:04 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133141","author":"o_k","post":"Charles: As I said earlier it does not take much to undermine reasoning of ‘A cat has four legs, a dog has four legs, therefore a cat is a dog’ variety. I have a riddle for you, what is a creature that has four legs, barks, and wags its tail? Are those clues enough for you? there were probably a hundred mathematicians qualified to tell him he was talking nonsense. I rather fear the same for our friend O.K. So give one, instead of talking rubbish. Because so far, in mathematics you have shown nothing, our dear ‘historian’. O.K.s argument reminded me of the attempt… You seem to use many words just to show you have nothing meaningful to say..","date":"2014-06-27","mins":"2:10 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133145","author":"o_k","post":"David Mo: O.K. There is a big difference between the shroud of Turin and the other representations of the shroud. […] But there is not a single shroud with the shape of the shroud of Turin. Neither the codex Pray. Draw your own conclusions. Empty words. Everything has been mentioned long ago, and does not undermine my reasoning in any way. I adress one error: We don’t know what the solution of this problem in other shrouds was, because only a shroud (true or false) has come to us. That’s not true, there has been more alleged burial clothes of Jesus, real or not. See for example: http://en.heiligtumsfahrt2014.de/wissenswertes/heiligt–mer/.","date":"2014-06-27","mins":"2:18 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133157","author":"o_k","post":"Fine, Charles. I will try to treat you serious. Where do you find naked Christ or l “poker holes” in the Shroud of Cadouin? ( http://www.qantara med.org/qantara4/public/show document.php?do id=1113&lang=en# ftnref2 ).","date":"2014-06-27","mins":"3:34 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133168","author":"o_k","post":"The shroud of Cadouin is a shroud and is not the naked Christ. I have given you a more plausible explanation for the circular holes on the tomb lid which represent the circular holes drilled by Constantine VII in his marble lid of the tenth century in the Church of the Holy Sepulchre in Jerusalem. The poker holes in case you had not noticed are irregular in shape and vary in size unlike the circular holes on the coffin lid. You have not answered. I remind your words: Probably he did not copy any specific shroud but if he did more likely to be one on public display such as Cadouin. What indicates you that the aritst in the HPM portrayed Shorud of Cadouin? Justify your opinion..","date":"2014-06-27","mins":"4:44 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133180","author":"o_k","post":"IF, repeat IF, he was taking his model from an actual relic of a shroud then, of course, he would have several to choose from but the shroud of Cadouin was probably the best known. So Charles, you have acknowledged the possibility that there is the Shroud of Cadouin portrayed in the HPM. Fine. Suppose this may be true. So why there are L shaped circles on the Shroud of Cadouin portrayed in the HPM? Where had the artist derived from two red smudges on it? Why there is a zigzag pattern on it? What inspired the artist, supposedly copying Shroud of Cadouin, to portray Christ naked , without thumbs, and his legs cropped? You claim that the Shroud of Cadouin may be portrayed in the HPM, so please answer..","date":"2014-06-27","mins":"6:32 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132127","author":"o_k","post":"Charles: ‘The only important thing is that zigzag pattern is similar to the herringbone on the Shroud’ I can’t see any resemblance at all, and even less so if you look close up.’ Your problem. It doesn’t have to be exactly the same like on the Shroud, it just has have ‘something in common’ with it. As does the fact that he chose to end the picture where he did. Http://greatshroudofturinfaq.com/History/Greek Byzantine/Pray Codex/pray3.html He ended just ‘accidently’ cropping legs, like on the Shroud. The Holkham Bible in the British Library of 1330 has a nude Christ on the cross, for instance. Fine. Anything else out of remaining 5? Max clearly believes that the illustrator was trying to conceal the fact that this was the Shroud anyway so this does not help us much. Max’s beliefs are just his own. You still have to cope with the probability of placing all those 6 features A F in a couple of illustrations just by random, without any inspiration from the Shroud..","date":"2014-06-21","mins":"2:38 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133464","author":"o_k","post":"You have put a good epitaph for the codex Pray, Hugh. I agree with almost all. But I don’t consider an sceptical myself on this issue. I find no reason to match the codex Pray to the shroud of Turin. This is not scepticism. Beutiful. One guy who is does not understand elementary logic, praising another one, who does not understand anything here. Simply beautiful..","date":"2014-06-28","mins":"1:41 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133447","author":"o_k","post":"David Mo: If the shape of the shroud of Turin is its most distinctive feature, and no artist has ever represented it till the fourteenth Century (fibula) or sixteenth Century (Clovio and Della Rovere), we must conclude that the shroud of Turin was not known till the fourteenth Century. This is elementary logic. No. This is logical fault! The most distinctive feature does not mean neccessary to be portrayed. See this picture: It is a panel of the altar of the cathedral of Lübeck of the beginning of the Fifteenth Century. There are more coincidences with the shroud of Turin here than in the codex Pray: the beard is divided in two, we can see the wounds of the Passion and the legs are bended. With your logic of more similarities, more copy, we ought to conclude that the artist was copying the shroud of Turin. But it is impossible because the artist has painted an absolutely different shroud both in shape and consistency and it is impossible that any image could have been impressed on this shroud. I have expected that you or someene would bring this faulty argument here. You are mixing two different issues here. The two parameters are: the number of congruences and frequency of them. There is a large number of coincidences in the altar of the cathedral of Lübeck, ideed, and it is possible or even likely, that it was directly or rather indirectly influenced by the Shroud of Turin (the fact that portrayed Shroud is different does not change that). However the key is frequency here. Forked beard is quite common in Byzantine arts, probably copied from the Shroud, but in one particular example it does not point necessarily to the direct derivation from the Shroud of Turin. The 4 L shape circles are, on the other hand, quite uncommon, and it is unlikely that they were derived from anything else but the Shroud of Turin (especially in combination with othere congruences). In short, large frequency of congruences in a population indicates a model. Small frequency of congruences found in one particular example, shows that it is unlikely to be derived from anything else but this model. David Mo, you failed an exam in logic..","date":"2014-06-28","mins":"1:28 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133452","author":"o_k","post":"Time for Hugh: Both the Shroud and the Pray manuscript show a naked man, with his crossed over his groin, and four fingers on each hand. There are no other shroud like signs, and no other points of independent congruence. No facial resemblance at all, no wounds, no double image or indication thereof. Obsessive scepticism turns people blind… What does scepticism mean anyway? Denial? Refusal? Obstinacy? No, it doesn’t. It means Doubt, Questioning, Inquiring. Scepticism is good. It means falling into absurd sometimes. Scepticism is not science. What have we Inquirers brought to this discussion? In no particular order: the beard, the position of the arms in burial archaeology, dozens of images of the Three Marys and Lamentations, the Hookham bible, the Stone of Unction, Egyptian pyramid design, the stairs of St Helen’s, the Shroud of Cadouin. Irrrelevant things add nothing to discussion. They show just how desperate are the sceptics. What have the true believers brought? Is there any other example of zigzags being used to represent herringbone? Is there any other example of a rectangular slab representing cloth? Is there any other example of parallel wavy lines representing blood? Who fails to understand whom here? Who is obstinate, ignorant and intransigent? I understand my opponents. I do not agree with them. Can any of them say the same of me? You failed to understand everything. Your words show it clearly..","date":"2014-06-28","mins":"1:30 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133454","author":"o_k","post":"Charles next: As I have just said ,O.K there is nothing in the Codex to show that he did use the Cadouin Shroud it is simply that there were others on display in the west and he could have seen one You wrote: Probably he did not copy any specific shroud but if he did more likely to be one on public display such as Cadouin. So you claim that the Shroud of Cadouin may be portrayed in the HPM. Then it cannot be a slab from the Holy Speulcher. Then I ask what is origin of L shape circles then? Of naked Christ, with no thumbs? Zigzag pattern and so on? Please answer that. Colin: Tristan: I said no one can be reasonably expected to prove a negative, like this or that feature is NOT inspired by prior knowledge of the TS. Colin, argue with David Mo who claims exactly the opposite..","date":"2014-06-28","mins":"1:31 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133468","author":"o_k","post":"My response for David Mo, after corrctions: David Mo: If the shape of the shroud of Turin is its most distinctive feature, and no artist has ever represented it till the fourteenth Century (fibula) or sixteenth Century (Clovio and Della Rovere), we must conclude that the shroud of Turin was not known till the fourteenth Century. This is elementary logic. No. This is logical fault! The most distinctive feature does not mean neccessary to be portrayed. See this picture: https://www.flickr.com/photos/ana sudani/460090622/in/photostream/. It is a panel of the altar of the cathedral of Lübeck of the beginning of the Fifteenth Century. There are more coincidences with the shroud of Turin here than in the codex Pray: the beard is divided in two, we can see the wounds of the Passion and the legs are bended. With your logic of more similarities, more copy, we ought to conclude that the artist was copying the shroud of Turin. But it is impossible because the artist has painted an absolutely different shroud both in shape and consistency and it is impossible that any image could have been impressed on this shroud. I have expected that you or someone would bring this faulty argument here. You are mixing two different issues here. The two parameters are: the number of congruences and frequency of them. There is a large number of coincidences in the altar of the cathedral of Lübeck, ideed, and it is possible or even likely, that it was directly or rather indirectly influenced by the Shroud of Turin (the fact that portrayed Shroud is different does not change that). However the key is frequency here. Forked beard is quite common in Byzantine arts, probably copied from the Shroud, but in one particular example it does not point necessarily to the direct derivation from the Shroud of Turin. The 4 L shape circles are, on the other hand, quite uncommon, and it is unlikely that they were derived from anything else but the Shroud of Turin (especially in combination with othere congruences). In short, large frequency of congruences in a population indicates a model. Small frequency of congruences found in one particular example, shows that it is unlikely to be derived from anything else but this model. David Mo, you failed an exam in logic. How to discuss with such guy, who is able only to poison the well?.","date":"2014-06-28","mins":"1:44 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133611","author":"o_k","post":"No, Hugh, by irritating me with nonsensical, faulty comments you (I mean all sceptics) won’t show that I am wrong. I have shown that David Mo is wrong and (deliberately or simply foolish) mixes several different issues. The point that you have to resort to such regrettable methods shows clearly; the sceptics actually have no serious arguments against the Codex Pray. Despite 280 comments (I don’t know what is the record for one thread on this blog), none of them was able to give any reasonable, and probabilistically significant (that means the chances for its occurence are not <<1) explanation for all features A F I listed. Instead I have read several gibberish about Shroud not being shroudy enough, zigzags not zigzaging not enough, red smudges not smudgy, a bench not being a bench etc. Plus ancient Egypt and Shroud of Cadouin. Plus mixing necessities with possibilities, probability for one hypothesis with probability of opposite hypothesis etc. Is that a serious discussion? Or just a massive attack against me?.","date":"2014-06-28","mins":"3:41 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133877","author":"o_k","post":"It is just that many of us cannot see any of the distinctive features of the Turin Shroud in the Pray Codex and that is enough to doubt that it was ever portrayed in it. It is as simple as that. This is no justification of anything..","date":"2014-06-28","mins":"7:21 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133627","author":"o_k","post":"I guess we’ll just have to differ. No hard feelings. No. Hugh. There is no draw here..","date":"2014-06-28","mins":"3:59 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132130","author":"o_k","post":"It is a good game when you start to use your imagination. One does not need much imagination to link Pray Codex to the Shroud of Turin, instead of ancient Egypt. The context of the Shroud and illustrations in the Codex are the same, contrary to Egypt..","date":"2014-06-21","mins":"2:59 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134301","author":"o_k","post":"In fact the absence of a casket is additional evidence that the artist was copying directly from The Church of the Holy Sepulchre including the circular holes that we know Constantine drilled into that same lid in order to allow pilgrims to look through to the original rock. Charles. What was the configuration of those holes?.","date":"2014-06-29","mins":"8:54 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134280","author":"o_k","post":"David Mo: Fault of logic? We are sure that a number of copies of the shroud of Turin are genuine. All them without exceptionpresent the characteristic shape of the Turin Shroud. But the HPM is not a copy of the Shroud and its image but simply a psalter with several references to the Shroud! That’s the main difference you seem not to understand. We have also an alleged influence of the Turin Shroud on a number of images of Christ. But you intend to base this influence on some features common to medieval art. The problem is why they are common in medieval art. This matters the Vignon markings issue, for example (which base on frequent congruences with the Shroud). But for the case of HPM, it doesn’t matter the establishment of direct relation between HPM and the Shroud is based on peculiar (and thus infrequent) congruences with the latter. You mix the two different problems. It is you that affirm (inconsequently) that the features that matched the altar and the Shroud were common in medieval art. This claim is mine also. See above. – There is not a L shape in the “holes” of the codex Pray. There are a L form and a P form. You can not find this combination in the Shroud. Of course, I can find. But those P holes on the bottom red crossed rectangle do not interest me at the moment. Just L holes. – It is not evident that the small circles are holes. The same form is used in the codex Pray to the ornaments of the dresses. It is enough to me that they mayrepresent holes on the Shroud. The alleged shroud in the codex Pray is not a shroud; it is the sepulchre. There are several reasons that show this. There is one reason which disproves the allegation of zigzag patterned rectangle being sepulchre. See http://img823.imageshack.us/img823/8435/kj41.jpg There is clearly visible a bench on which angel is sitting. Thus the rectangle cannot be a tomb lid. Whenever I show this, every sceptic plays fool and tries to ignore it under any pretext. A large frequency of congruences in History of Art indicates a style or an iconographic rule. A large frequency of congruences… with what, David Mo? I mean of course a certain object, that can be considered a model. Your way of faulty thinking is evident, David Mo..","date":"2014-06-29","mins":"6:33 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134296","author":"o_k","post":"Would you assume I saw the original Shroud or heard about it. Yes the fact that you came to this site proves that..","date":"2014-06-29","mins":"8:30 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134447","author":"o_k","post":"David Mo: “References” is a euphemism you use to speak of imitated or copied features. The same for “congruences”. What are these if they are not imitated/copied features? I’m not mixing “different problems” I have disentangled verbal games you make. Your complains about the names have absolutely no impact on the case. Bravo! When reality discredits me, the reality doesn’t interest me. Well said about yoursef, David Mo! P holes are out of the game. Whether red crossed rectangle is a marble, or another part of the Shroud, this does not exclude the possibility of influence of the Shroud on Hungarian Pray Manuscript. So I simply do not take P holes into account. The Reign of the maybe is infinite, but we are searching for the truth not the imagination. I suppose. And the truth is based on better or lesser evidences, not on vague possibilities. Those possibilities are compelling enough, to take them serious. The opposite thesis (the HPM has nothing to the Shroud) is also a “vague possibility”. But as I have shown extremely unlikely. O.K.:There is clearly visible a bench on which angel is sitting. Thus the rectangle cannot be a tomb lid. DM: Why not? The angel seated on the lid or on the sepulchre by pointing the finger to the folded shroud is a usual representation of the Holy Women scene. Why not? Because there is a bench, as I have shown! But like other sceptics you have disregarded this inconvenient (for you) fact! Why haven’t you adress that? Because there is no other answer? You maintain the lid, even when proven wrong. That’s just desperate cry: “I must be right, I must be right. This must be lid, must be lid! Every similarities with the Shroud must be wrong! All sindonists are stupid!” I don’t know any image where the angel is seated on the shroud. It would be blasphemy. Unless you prove that, I don’t think so..","date":"2014-06-30","mins":"5:54 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132136","author":"o_k","post":"And BTW, for everyone who thinks it is a tomb lid, instead of the Shroud: What is an angel sitting on?.","date":"2014-06-21","mins":"3:08 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134468","author":"o_k","post":"I assume that O.K saw my earlier post asking about the position the Shroud was displayed when the artist saw the Poker holes, and which of the four sets of poker holes he chose to copy onto whatever he chose to copy them on to. Sorry Charles, I missed it. I assume that O.K and his supporters would argue that the artist is making an accurate representation of what he actually saw. No. As the artist was supposedly drawing from memory, one should expect several inaccuracies there. The point is that several key features (A F), allowing recognition of his source of inspiration, are copied into drawings. O.K. Please tell me what position the Shroud was in so that the observer could see a set of poker holes in the same L position as on the marble lid. In whatever position that L holes were visible no more speculation needed. Please also tell me which of the four sets of poker holes you think he was copying. The L holes http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=5&image=3&lon=1951.0&lat=7122.0 And now, Charles, why did you refuse to answer my question? “What was the configuration of those holes [that we know Constantine drilled into that same lid in order to allow pilgrims to look through to the original rock]?” Instead you have arrogantly asked me several more questions? Why answering mine would be so great problem for you?.","date":"2014-06-30","mins":"8:25 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134473","author":"o_k","post":"Or Charles, perhaps you have already answered that: Charles Freeman June 23, 2014 at 2:32 pm […]However in the first half of the tenth century, the Byzantine emperor Constantine VII covered the tomb with a marble slab but in order for pilgrims to see into it to the original rock he drilled three circular holes, or oculi. (bolding mine) Three holes, Charles. See also Wilson’s article http://www.west.net/~shroud/pdfs/n67part2.pdf See also Polish Wikipedia http://pl.wikipedia.org/wiki/Bazylika Grobu Pa%C5%84skiego#Okres wypraw krzy.C5.B Cowych They all speak about THREE holes. So Charles, you have himself admitted you are poor in mathematics. How did you wanted to turn THREE oculi into FOUR L shaped circles on HPM? Nabber wrote June 23, 2014 at 4:39 pm Freeman’s Oculi: None of your examples pertain. The first example had 3 circles in a row; the second had 4 circles in a square; the third example had numerous holes but none in the shape of 4 in an “L” (nor any “L”), and the last had numerous holes in a large circle. And none of those had anything to do with a tomb. Constantine and the tomb: again, 3 holes; in fact 3 LARGE holes. Again, 4 holes in an L shape is so unique in HPM that it defies normal probability, and yes, they are in the middle of a herringbone weave. So, what Charles? Zigzag pattern is also derived from the Holy Sepulcher? Two red streaks also? Naked Christ with no thumbs and cropped legs as well? Charles if you had thought we could get fooled, you have turned out to be a fool yourself..","date":"2014-06-30","mins":"8:57 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134477","author":"o_k","post":"I am quite certain that above rectangle is the Shroud. Anyway, even had it been a lid (which possibility is excluded by the presence of bench on which the angels is siitting, see http://img823.imageshack.us/img823/8435/kj41.jpg ), it doesn’t change anything in the reasoning presented in article above. I wrote there D –there is a pyramidal/zigzag pattern on alleged shroud/tomb lid E –two red smudges on the surface of shroud/tomb lid </B. As to the bottom rectangle, I don't know what is it. And as it cannot deny the supposed link between HPM and the Shroud in any way, it plays no role in my reasoning..","date":"2014-06-30","mins":"9:28 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134487","author":"o_k","post":"Charles: Perhaps it is because these are NOT the poker holes. Perhaps this, or perhaps otherwise. I maintained this from the begining. If you look front on at the poker holes on the Shroud they do not present an L shape in the same pattern as on the Pray Codex. So THREE oculi from the Holy Sepulchre certainly present, right? And the zigzag pattern is also derived from the Holy Sepulcher? Two red streaks? Naked Christ with no thumbs and cropped legs as well? I have asked Nabber to actually show the examples of circular holes that he seems to know about, but he hasn’t. These are the examples that William Forsyth, an expert on sculptures, know represent the oculi in Jerusalem. If Nabber is right that these are sometime reproduced in a greater number than three then there are no problems with there being four Jerusalem oculi on the tomb lid but we do need to see his examples. So far, I have not seen any of your examples, to back your view. My suspicion , that Nabber can prove unfounded, is that he actually has not seen the originals. My suspicion is that you are desperately wriggling and shirking, after I have shown that you have no arguments at hand, while trying cynically to deceive others. The more gibberish you add the more founded this suspicion seems to be..","date":"2014-06-30","mins":"10:49 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134482","author":"o_k","post":"Perhaps I’m trying to fuse together some of the discussion with Charles and others. One problem I had with the HPM is that the bottom rectangle didn’t ‘make sense’ to me. Truly the problem is not whether something makes sense, or not, but whether a combination of certain elements in the HPM which have their equivalents in the Shroud, is likely or unlikely to occur without the knowledge of the relic. That’s the point. And as it is unlikely, the Shroud must have existed at the time those drawings in the HPM were created. There are many inconsequences in the HPM. So wondering “what the artist had on mind” is actually, in my opinion, quite idle thing. And even detrimental the sceptics may dispute some particular interpretation, pretending that they have refuted the whole HPM Shroud link..","date":"2014-06-30","mins":"10:00 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132146","author":"o_k","post":"I don’t think so. It hardly can be displaced lid look on the image I posted. Check the (weakly expressed) persepctive and compare with upper illustration + position of the angel..","date":"2014-06-21","mins":"3:39 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134642","author":"o_k","post":"Congratulations, David Mo! You have disqualified your intelligence yourself! You know why? Because none of your examples apply! They show simply, what they show: lids On the contrary , there is clearly a bench in the Pray Manuscript.http://img823.imageshack.us/img823/8435/kj41.jpg Two lines left from the angel, one vertical, slightly tilted to the left, one horizontal, slightly upwards, joining angel’s dress. That’s clealry a bench, what else could it be! And that means the zigzag patterned rectangle cannot be a lid! And there is more. Do you even understand my reasoning presented in the article, or is it beyond your limits of comprehension? I have written: There are several key details on both illustrations. Let’s estimate the probability of their occurrence on Entombment/Three Marys scene by random Illustration I: · A –the Jesus is naked, with His hands crossed above pelvis (similar on the Shroud) –let’s assume that such portrayal occurs in 1/100 instances. And so on. The more examples you deliver, the better my case..","date":"2014-07-01","mins":"5:48 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134509","author":"o_k","post":"Charles: O.K. I shall look forward to your (and to anyone else’s) choice of the poker holes. “June 30, 2014 at 8:25 am The L holes http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=5&image=3&lon=1951.0&lat=7122.0 ” But truly, any of the remaining 3 may apply as well. The basic argument is that we have a shroud with two images, apparently unique… Waffling. Colin: back to your laboratory. You are wasting your time..","date":"2014-06-30","mins":"12:46 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134644","author":"o_k","post":"I now have a copy of Forsyth’s book. The images he refers to: “among numerous examples, the three circular holes are represented in the twelftth century on a capital at Modena [I can’t find this], a relief at Monte San Angelo (Foggia) Thank you Hugh. Due to your effort, we are assured that Charles claims have no basis at all. None of the examples presented by you, nor David Mo shows 4 L shaped circles. And as I said in the previous post, more such examples, the better my case showing how unlikely is to find all features A F on one page simply by chance. That’s the basis. And something more From Wilson’s article: http://www.west.net/~shroud/pdfs/n67part2.pdf A depiction of the Entombment on a stone capital of c.1150 in Chartres Cathedral is one of the earliest depictions of these portholes. However, documentary mention of them occurs even earlier, in the writings of a Russian pilgrim called Daniel who visited the sepulchre in 1106 7: And now this holy bench is covered with marble plaques and one has cut in the side three little round windows, and by these windows one sees the holy stone.’ (bolding mine).","date":"2014-07-01","mins":"5:55 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134645","author":"o_k","post":"Hey guys, Thomas, Nabber, Dave B, everyone! May I ask for your confirmation? There is clearly a bench on which the angel is sitting, pointed with green arrow: Do you agree?.","date":"2014-07-01","mins":"6:00 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134647","author":"o_k","post":"Now a version for total morons, and blind: There is a bench, clearly. So zigzag rectangle is not a lid..","date":"2014-07-01","mins":"6:11 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134657","author":"o_k","post":"Agree especially as it is supporting my view..","date":"2014-07-01","mins":"7:35 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134662","author":"o_k","post":"Dave: There is clearly a bench on which the angel is sitting, pointed with green arrow:Do you agree?.","date":"2014-07-01","mins":"8:04 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134697","author":"o_k","post":"Thanks..","date":"2014-07-01","mins":"11:45 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134682","author":"o_k","post":"However hundreds of years later, when not only the Shroud, but its images and its poker holes were known about, it would surely have been the central focus of any iconography about the empty tomb. To omit its discovery in the Three Marys scenes would be to lose one of the most important points of the occasion (the first being the disappearance of Jesus himself). The fact that no other Three Marys scenes give any great prominence to the shroud, even those from well before and well after the Pray drawing, is an indication to me that it had no great prominence, and was, in fact, not known about. Hugh, today we have 21st century. The Shroud is known to the masses. Can you say that the image on the Shroud of Turin is the central point of Christian iconography? Can you, on contemporary (20 21st century) paintings and drawings, find the image of Christ on His burial cloth? Why? Why not? And then use the same reasoning to the 12th century..","date":"2014-07-01","mins":"9:23 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134736","author":"o_k","post":"Charles: Certainly provides a model for the nudity. Sucked out of the thumb. So the artist combined THREE oculi from the Holy Sepulchre, turned it into 4 L shaped, combined it with the ancient myth of Actaeon, and Shroud of Cadouin. Nice try, Charles! LOL!!! I am not emotional about the Pray Codex because even if somebody did prove to me that one could somehow see the Shroud in it it would, as I have said before, prove no more than that the Shroud might be one of the many earlier (such as the Cadouin shroud) rather than later medieval linens claiming to the the real thing. Where do you find A F elements in the Shroud of Caduoin, Charles? The failure to show any wounds on Christ rules out any possibility that the artist could have envisaged this as the Christ who was wrapped in the bloodstained Turin Shroud. Bull^&*% Is this really the only evidence for the existence of the Shroud before 1260? I had not realised that things were quite so desperate!! No. There are more. But this topic is on the Hungarian Pray Manuscript, which is enough evidence for the existence of the Shroud before 1200..","date":"2014-07-01","mins":"2:46 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134749","author":"o_k","post":"I can’ t remember how many supposed ‘genuine’ burial shrouds of Jesus there were around in the Middle Ages […] My point is clear – if we have perhaps twenty five ‘genuine’ burial shrouds from the ninth to the fifteenth centuries In my article devoted to that problem (http://ok.apologetyka.info/ateizm/ile byo pocien pogrzebowych jezusa cz1,749.htm ), I counted 12 alleged burial cloths including smaller cloths, coifs and kerchiefs not including smaller fragments – and still some of them can actually be the same, so that number may be lower. Certainly more in the west than in the east and they certainly start in the west in the ninth century. Then you are wrong. What about Anonymous of Piacenza around 570 AD, and Arculfus, circa 670 AD? They reported burial cloths in the Holy Land, before they travelled to the West. Poor historian you are, Charles… Is there any other field where ‘ research’ has not come up with anything new for thirty years? Biblical exegesis, for example. He may have had a particular shroud, perhaps one of the vanished ones, in mind. There were lots to choose from. And only one that has all those particular details A F. If the Shroud can be ‘seen’ in the Pray Codex there must be hundreds of other illuminated manuscripts which also illustrate the Shroud. They vanished in history, or are waiting for discovery. Or they simply do not copy such peculiar details like the HPM. Anyway it doesn’t change that the Shroud of Turin is portrayed in the latter. Hard to accept defeat, Charles?.","date":"2014-07-01","mins":"4:08 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134857","author":"o_k","post":"For David Mo, surely! Mark 16:5 (NIV) As they entered the tomb, they saw a young man dressed in a white robe sitting on the right side, and they were alarmed. David Goulet, and others: You cannot convince a cynical boor. The only thing you can to do is to show to the public he indeed is who he is a cynical boor..","date":"2014-07-02","mins":"8:16 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134841","author":"o_k","post":"David Mo: The artist of the Pray Codex is particularly anarchic in adorning the sepulchre: two kinds of crosses, pyramidal forms, circles and red zigzags. I don’t think we ought to find a sense to this hotchpotch. Unless we accept that the Pray Codex is derived from the Shroud of Turin conclusion absolutely unaccpetable by dogmatic sceptics. In regard of the other features noted by you, we can search for randomly different features in other paintings and we will found also “astonishing coincidences”. Sure. I have noted above the altar of Lübeck, for example, with more consistent features. If we use vague similarities the task is easier. There are many more coincidence with the Shroud in the HPM then only A F I chose only the independent, and most compelling, which are very rare, and hard to explain otherwise. This is not the case of the altar of Lübeck, on which coincidences found are more “common”, although it still can be influenced by the Shroud in some way (and I suppose it indirectly is). And I remember you that there is not any L shape in the Pray Codex. There is a pair of L+P. It is a significant difference. I don’t think so. There is clearly L shape circles, the same as on the Shroud. As to P on the bottom red crossed rectangle it is hard to say what they, or that rectangle represent, so I simply do not take it into account. It does not exclude the HPM Shroud link in any way. I insist the unique feature clearly shared without any ambiguity by the Shroud and the Pray Codex is the nudity. Very poor evidence to counter the evident dissimilarities between them. There are no dissimilarites which would exclude the HPM Shroud link. As to ambiguity of interpretation of other marks it is not so important. What is important is that they certainly may be atributed to the Shroud, and that the combination of them, without the prior knowledge of the Shroud, is extremely unlikely..","date":"2014-07-02","mins":"6:36 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134870","author":"o_k","post":"Usually yes. But at times, one should show that a boor is a boor and let he cry at his hole!.","date":"2014-07-02","mins":"9:14 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132149","author":"o_k","post":"Where are all remaining sceptics? Gian Marco Rinaldi? Andrea Nicolotti? Colin Berry? David Mo? I call you!.","date":"2014-06-21","mins":"4:01 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135122","author":"o_k","post":"David Mo: Your argument has nothing to do with what we say Charles Freeman, Hugh and myself: Neither yours have with the question of whether HPM was derived from the Shroud or not. The Mandylion was also rarely exhibited and yet we have enough descriptions and pictures of their appearance. The same should be valid to the Shroud. If the Mandylion and the Shroud were one and the same… No, David Mo we do not have enough descriptions and pictures of the Mandylion to be 100 % certain how it looked like. Aside the problem of its similarities and supposed identity with the Shroud. I will try to send some interesting illustration of the mandylion to Dan, so you’ll see. The lack of descriptions or depictions of the Shroud of Turin until the sixteenth century implies that it was not known or did not exist. We are certain that Shroud existed at least from fourteenth century. And there is difference between “was not known” and “did not exist”. The question is simple: Do you know any accurate description corresponding to the shroud of Turin? Previous to the fourteenth century, of course. No. We don’t have any direct representation of the whole Shroud before 14th century. But that not necessarily means that the Shroud didn’t exist, or was not known to the small and priviliged group of people. It seems that the Shroud, and particularly its image, was a byzantine state secret (just like greek fire and silk production), revealed only to the most notable guests. It was publically shown only on a single occasion, in the years 1203 1204, according to my theory, on the order of young Emperor Alexios IV, desperately struggling to remain in power. Then it was sawn by the Robert de Clari, who reported it in his account. But as I said, this all is in fact irrelevenat to my above reasoning about the HPM Shroud link. Nowhere there I adress this point..","date":"2014-07-03","mins":"12:33 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135125","author":"o_k","post":"No, Louis, Wilson’s books are not good in the matter of HPM. I have both 2010 (Bantam) and 1978 (Polish and English version, the English from Penguin). The HPM is only marginally mentioned in them..","date":"2014-07-03","mins":"12:58 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135131","author":"o_k","post":"The author is honest […] and provides a complete picture about what exactly is going on. After reading his latest 2010 book I am not so convinced. But this is a topic for another discussion..","date":"2014-07-03","mins":"1:48 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135137","author":"o_k","post":"For example, read chapter 7 “What’s in the date?” – I can call it with one word: “trash”. Or his attitude towards Marion, Courage, and Castex on page 376 (Bantam edition)..","date":"2014-07-03","mins":"2:06 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135134","author":"o_k","post":"Charles: It may even have been the Shroud of Besancon. Yes, I know this theoretical possibility, obviously. So how can you be sure that it was not the Shroud of Besancon, or another altogether, that de Clari saw? First, we have established that the Shroud of Turin existed before 1200. Second (but this is another topic), we know that there were several burial cloths in the Constantinople, including the shroud with an image of the Christ, that de Clari saw. Third (this is also another topic) we know (from iconographic evidence) that Byzantines were aware of the Shroud’s (of Turin) existence. Fourth, we have no known traces for the Shroud of Turin elsewhere outside Byzantium. So the only reliable conclusion is the presence of the Shroud of Turin in Constantinople, before the Fourth Crusade..","date":"2014-07-03","mins":"1:57 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135164","author":"o_k","post":"David, we debate it only due to refusal of sceptics to accept the evidence of HPM. Refusal of one party to accept the arguments of the other, due to the bias only (while presenting no serious counterarguments), does not weaken those arguments at all. I think the evidence is ‘hard’ enough for every reasonable, unbiased person..","date":"2014-07-03","mins":"4:52 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135169","author":"o_k","post":"O.k. We have absolutely no evidence that the shroud that de Clari saw survived the Fourth Crusade. Nor any other reasonable alternative to the conclusion presented above (“the only reliable conclusion is the presence of the Shroud of Turin in Constantinople, before the Fourth Crusade”)..","date":"2014-07-03","mins":"5:13 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135149","author":"o_k","post":"No, Louis. Chapter 7 is really a trash, written by Wilson who does not understand the basics of carbon dating (I know he is a historian, but learning how to solve a very basic differential equation, or at least gaining some knowledge of the basics of C14 dating, making some simple calculations is not too far for his abilities, particularly as he had some 20 years for it), adheres to the long discredited bioplastic coating theory, and does not understand Benford/Marino and Rogers work at all! It is really a trash, and I know what I am talking about! IW is extremely careful when it comes to “seeing” things on the Shroud. He also mentions Professor Avianoam Danin, but without committing himself. It is not the issue of “seeing” or “not seeing”. It is a matter of respect. For Danin, Wilson has at least some. But for Marion Courage, and Castex he has shown such arrogance, that I wondered whether to write an open letter for BSTS, accusing him of dishonesty!.","date":"2014-07-03","mins":"3:49 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135166","author":"o_k","post":"Louis, I never deny your honesty, but sometimes you are simply naive. IW seems not to understand Benford/Marino and Rogers, as well as Marion Courage & Castex arguments at all. And if needed, I can provide you proper citations from his book to show it. But I don’t think it is a proper thread for that..","date":"2014-07-03","mins":"4:58 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135153","author":"o_k","post":"My description above is not enough for you, Hugh?.","date":"2014-07-03","mins":"4:18 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135186","author":"o_k","post":"Louis, it is not about Ghiberti, nor Flury Lemberg. It is about IW, and what he writes in his book. It is not about one or another particular viewpoint, but about attitude. Hugh: Not at all. But no kidding, Hugh! Just to quote IW (The Shroud: Fresh Light on the 200 yeart old mystery, Bantam 2011. On the radiocarbon dating: pg. 21 22: In 2005 American scientist Dr Ray Rogers, dying from cancer, issued a peer reviewed scientific paper claiming to prove that the Shroud sample used for the carbon dating was cut from an area rewoven during the Middle Ages, instead of having come from the true, original fabric. But as we will see later, even this argument lacks serious substance, and in general the 1988 radiocarbon dating finding has been able to rest unchallenged as science’s overriding ‘verdict’ on the Shroud, snuffing out any evidence, from any discipline, that might suggest to the contrary What counterarguments Wilson presents against Rogers? As we will see, none (he mentions Rogers only twice in the whole book!), but let’s make another quote from his book. So now this ‘trash’ chapter 7 ‘What’s in a date?’ pg. 129 130. More recently it has been claimed, […], that the area of the Shroud from which the radiocarbon dating sample was taken was one which had been extensively rewoven in the Middle Ages (footnote 9 : Marino and Benford 2009). Purportedly the ‘new’ areahad been invisibly matched to the rest of the cloth, so the radiocarbon dating laboratories had unwittingly dated from a piece that was not part of the original cloth but added thirteen centuries later. Thirteen centuries here is ne clue that Wilson completely misunderstands Benford/Marino ideas. But he goes further: Despite this idea having been put forward, even in peer reviewed scientific journals, it has little more going for it than the ‘clandestine switch’ theory. During my eight hour examination of the Shroud back in 1973, high among the priorities was a very carefu search fo any anomalies that may disclose an early historical display method, any ancient fold marks, signs of fastenings, etc. Every area of the linen’s surface that was accesible on that occasion (footnote 10: The dorsal half was not, being above my head, because of the upright display mode) was carefully surveyed from a glancing angle for this purpose, and the area from which the radiocarbon dating sample was later taken was well within my viewing range.(footnote 11: The opposite end of the cloth was not, being well above my head because of the upright mode of display on that occasion.) Not theslightest sign of any compositional difference was apparent. Later, Wilson goes on bringing Vial’s and Flury Lemberg opinions. Anyway, as we have seen, he prefers his own eye examination, back in 1973 (!), when no one had C14 dating on mind, over peer reviewed articles in scientific journals. And later Wilson is going on, describing generalities, how C14 is unreliable, without any proper understanding of the subject. He as far as 2009, despite his visual examination, considered discredited bioplastic coating theory as credible, and believed its presence in the C14 area (see pg. 135, and a footnote 18, that is an e mail from Stephan Mattingly, dated 8 April 2009). About Danin, Marion, Courage and Castex, pg. 376: When none other than Avinoan Danin, Professor of Botany at the Hebrew University, Jerusalem, very forcefully insist on seeing the images of certain plants(footnote 13: Danin et al, 1999 and 2008.), it deserves to be taken seriously particularly given that he can in no way be accused of any pro Christian bias. Most other such claims, however, are extremely doubtful, particularly the Latin, Greek and Hebrew inscriptions which have been ‘seen’ by two French researchers, André Marion and Anne Laure Courage. (footnote 14: Marion and Courage, 1997.) Also the claims of a French ‘scientist’, Thierry Castex, that he has found the Aramaic word ‘found’ written in Hebrew letters. So Danin is fine, but Marion, Courage and Castex are not. And Castex does not even deserve the name of ‘scientist’. Very gentle, Mr. Wilson. Oh, btw: what is in the Wilson’s bibliography? Marion, André, and Anne Laure Courage, Nouvelles Découvertes sur le Suaire de Turin, Paris, Albin Michel, 1997 In fact, I have a polish edition of that book? And I can say, that it is quite technical, for a popular book standard. Here I have question: had IW even read it? Because I have sense that either he had not, or he had not understood it at all. This is the only place where he adresses Marion and Courage saying simply they are bad, without any adressing to it in essential way. It is not about agreeing, or not, with Marion&Courage conclusion, but I am under impression that Mr Wilson had lost a great opportunity to remain silent on the subject (that he probably doesn’t know at all). That’s all so far, I am going sleep. Goodnight..","date":"2014-07-03","mins":"6:28 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135287","author":"o_k","post":"Ladies and gentlemen, please stick to the Hungarian Pray Manuscript topic! Other issues can be discussed in different threads. The sceptics know they cannot cope with the arguments for HPM Shroud link presented in article above, so they try to distract attention on another topics. This is classical “moving the goalpost” fallacy (see http://en.wikipedia.org/wiki/Moving the goalposts ) Pro authenticitists: please don’t get provoked. Thanks..","date":"2014-07-04","mins":"7:06 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135187","author":"o_k","post":"In fact, I have a polish edition of that book? It should be: I have a polish edition of that book (Andrè Marion, Anne Laure Courage, Całun Turyński Nowe Odkrycia Nauki, Znak, Kraków 2000). Great pity it is not available in English. It would save the Marion’s honor from being insulted by some ignorant, and misinformed guys. That’s just what I care about not actually whether there are real inscriptions on the Shroud or not. This will be determined later on..","date":"2014-07-03","mins":"6:34 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135625","author":"o_k","post":"Dave B: I think it unfortunate that the debate seemed to reflect too much the personal agenda of the participants. Thus all non authenticists have insisted that the HPM shows no connection with the TS, while all authenticists have insisted that it does. Clearly both sides have allowed their personal attitudes to authenticity to interpret the HPM. This is not the way to arrive at the truth of the matter. “all authenticists have insisted that it does” It is not precise that I insisted that HPM in general must show connection with the Shroud. No. My article shows a different approach, approach that no sceptic has been able to undermine. I assumed that there is no direct connection between the HPM and the Shroud, and all similarities are random coincidences. Then I tested this hypothesis. It turned out that the chances that all the similarities A F are simply random coincidences aree NEGLIGIBLE. So the conclusion of every reasonable person would be to reject that hypothesis. The HPM is based on the Shroud with estimated 99.9999 % significance that is beyond even the most strict criteria. Of course sceptics want to deny this but they can’t. They are not interested in arriving at the truth of the matter, but simply in DENIAL. Thus they talk nonsense about lids (which cannot change the conclusion in any way) but as I will show in next post their approach is faulty. The problem is that you and several other pro authenticity guys got engaged in the discussion about lids, tombs and Three Marys portrayal and that’s mistake. The sceptics know they cannot undermine my conclusive reasoning, so they try to change a topic, counting on that we get lost in details, and the truth gets dissolved in numerous irrewlevant discussion. That would be their victory so don’t play by their rules!.","date":"2014-07-06","mins":"7:39 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135636","author":"o_k","post":"Too much ‘ All cats have four legs, all dogs have four legs, therefore a dog is a cat’ reasoning! Shut up Charles, it s not ‘ All cats have four legs, all dogs have four legs, therefore a dog is a cat’ reasoning. On the contrary I have shown numerous times your, and your sceptical friends (deliberate!) faults, logical fallcies, lack of proper understanding and dishonest approach. You have shown nothing relevant in this discussion, but have been constantly insinuating and poisoning the well!.","date":"2014-07-06","mins":"8:13 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135674","author":"o_k","post":"Just find that mathematician who supports you! I don’t need it because mathematics defends itself. That is the difference between mathematics and the so called ‘historians’ (and other ‘humanists’ ). The first one does not need to appeal to the so called ‘authorities’ in a toady way like the latter group. It speaks for itself, and that’s its beauty and power and truth. And that’s what you don’t understand Charles as a mere poor ‘historian’ used to gain support by invoking to Academia guys who may be complete morons, may be totally wrong, but have ‘authority’. If you want to undermine my reasoning, try to do it with mathematics if you know it. If you don’t, learn it, if you cant’ learn there is no hope for you. Like no hope to undermine correct mathematical reasoning. We have already broken 500 comments barrier..","date":"2014-07-06","mins":"1:33 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135634","author":"o_k","post":"Why the whole discussion about the lids is irrelevant. From the large number of comments I chose one sentence from Hugh, showing the sceptics approach in the clearest way: They[sceptics] have demonstrated that a large proportion of Three Marys scenes show a skewed slab over a rectagular sarcophagus, a crumpled shroud and an angel balancing like a surfer on the slab. The sceptics logic goes more less in the way: large number of Three Marys scenes show the angel sitting on rectangular slab from the tomb thus the similar rectangle in the HPM must also be a slab. But this is LOGICAL FAULT! It can be described as sweeping generalization (a dicto simpliciter see http://en.wikipedia.org/wiki/Dicto simpliciter) The fact that large number of Three Marys scenes does not mean that similar rectangle in HPM must also be a slab and it isn’t. I showed this many times the presence of a bench on which angel is sitting refutes allegations that this rectangle is a slab. Then it seems that this rectangle is indeed the Shroud.Anyway, the exceptional case of HPM precludes making any generalizations which shows that practically all sceptcs’ arguments are faulty And of course it does not change in any way the conclusion from my probabilistic approach, presented in article above..","date":"2014-07-06","mins":"8:08 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135671","author":"o_k","post":"If these arguments are faulty, then I would be grateful if someone could point out where, with appropriate references, as I have done, rather than simply re iterate opinions I disagree with. Hugh, I have shown this in the post before ( July 6, 2014 at 8:08 am ) Although discussion on the evolving Three Marys scene may be beneficial on its own, it does not apply to the one very specific case which the HPM is. The argument that large number of depictions show rectangular lid on which an angel is sitting, so similar rectangle in one particular HPM must be also a lid, is a faulty generalization. There is no obligation here. Similar with Charles Freeman’s Holy Sepulchre oculi and L shaped holes in HPM. As well as other ad hoc ‘explanations’ by the sceptics. Only connection with the Shroud makes sense a combination of many other potential motives is, as I have shown, very improbable..","date":"2014-07-06","mins":"1:18 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135639","author":"o_k","post":"1) Hugh, you still do not understand the difference between necessities and possibilitites. I never claimed that all those congruences A F must necessarly be derived from the Shroud, but simply that it is possible. And if they are not derived from the Shroud, then the cause of their occurence in the HPM does not interest me as it is irrelevant to my further reasoning. I consider it simply random. 2) The images posted on this blog are usually non representative as they are chosen to illustrate some point and in many cases we should use not only Three Marys but all representations of death and burial of Christ. Also the nudity means full nudity (with only genitals covered), not gently masked by tomb, loin, or something. The same criteria we should apply to thumbs, both should have been non visible when one should clearly see them (that means both hands are easily seen, we do not take into account situations when they are obscured by perspective for example). Anyway whether the true chances are 1/100, 1/50 or 1/200 changes little those are just estimations. I feel good enough. The total number of relevant illustrations (10 million) is also an estimation, and quite high, I think! 3) There are no features in the HPM that would exclude its derivation from the Shroud, contrary to Mona Lisa..","date":"2014-07-06","mins":"8:54 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135684","author":"o_k","post":"Colin: “If you want to undermine my reasoning, try to do it with mathematics” I could have done that 500 comments ago, OK, using Stats and Probability 101. But it was more fun watching you paint yourself into a corner. But you haven’t , neither then, nor now. Some advice: never multiply probabilities, even fanciful plucked out the air ones like yours, unless you are absolutely certain the events are independent. Or have at least no reason to suspect they are dependent. But the features (“events”) of the HPM you cite are almost certainly non independent, given (a) it’s just one carefully selected artist, not a random selection and (b) the work of a poor draughtsman, one who inserts one obscure or ambiguous feature after another into his illustrations (e.g. A lid/door/(rigid) shroud), is likely to introduce others too (stepped pyramid pattern, angel sitting or standing, enigmatic head, enigmatic letter/symbol, and notably those L (and P) shaped circles) that were singled out for attention initially, elevating the HPM to its totally undeserved celebrity status in sindonology. Your attempt to ridicule those features has no basis, Colin. Even if the artist was drunken while drawing, and projected his delirium fantasies, it does not change the fact that there are Shroud like features in the HPM! So those many features you list are not “independent” events.They are characteristics of a carefully chosen ‘outlier (statistically speaking) with serial instances of artistic vagueness (at least to the modern eye). You had no business multiplying your (fanciful) probabilities together. They are almost certainly non independent. Of course they probably are not independent as the HPM was almost certainly based on the Shroud, then they cannot be independent. But if we consider opposite hypothesis that the HPM is not derived from the Shroud we can treat them as independent. And multiply them as independent probabilities. And then see how improbable this hypothesis is. You and others have made a mountain out of possible molehills (but we can’t be sure they are molehills) We are rather patiently and steadily building a mountain out of the small stones. Colin, aka sciencebod aka sciencebod. Your hysterical cries and boasting what a (poor it seems) scientist you are, makes no impression on me..","date":"2014-07-06","mins":"2:23 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135686","author":"o_k","post":"Charles: You have relied too heavily on congruences that are not supported by similar examples of this kind of illustration, you have made up some probabilities from these and then somehow you have managed to make these six congruences which you rate as each only having one in a hundred chance of being probable into over 99 per cent probability overall. That is where I am told, and common sense seems to support, your maths is nonsensical. The more talk of this kind the more you prove your ignorance. When a theorem is proved, it is passed round to experts to see if they support the reasoning – it is not accepted simply because it is expressed in numbers! Are you really so naive mathematically? Proof is a proof, if correct there is no discussion, if not it is worthless. The situation here is more complex, as we have statistics here, but as long as the presumptions are valid (and they still are), the conclusions are also. However, I have never heard mathematics being used by anybody to show whether a work of art, even such an inept one as this, does or does not represent something. That shows how little scientific the art history is. Talking nonsense that’s what sceptics (and Academia) are the best in..","date":"2014-07-06","mins":"2:32 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135691","author":"o_k","post":"No Hugh, it is not the case of Vignon markings. It is a different (and much simpler) case. I explained the difference to David Mo a couple hundreds comments ago: June 28, 2014 at 1:44 pm In short, large frequency of congruences in a population indicates a model. Small frequency of congruences found in one particular example, shows that it is unlikely to be derived from anything else but this model..","date":"2014-07-06","mins":"2:42 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135698","author":"o_k","post":"Let me explain it on example: Vignon marks the alleged congruences with the Shroud face. The frequency of their occurence on byzantine Christ icons is high (above the normal for non Christ figures) so it indicates that for the Byzantines the Shroud was a model for Christ face. HPM the features A F I pointed are congruent with similar features on the Shroud. Yet they are rare enough, that it is unlikely that they were derived from anything else than the Shroud directly (contrary to Vignon marks on Byzantine icons, which might have been simply copied from another icon, and so on). The key is that in both cases there are congruences with the Shroud but different kinds..","date":"2014-07-06","mins":"2:58 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135711","author":"o_k","post":"There’s another principle of statistics that seems to have been forgotten here. Association does not prove causation. Put another way, so called congruences may be entirely coincidental, or maybe given excessive weight due to judgemental bias. Yes Colin. But it wasn’t forgotten, unless by you. If the cause was not the Shroud, there were other unknown causes. And as they were unknown, we can model them with random occurences of each feature A F (that is naked Christ, no thumbs visible, and so on). And as they are random and independent (what may be dependency between naked Christ and L circles?), we can estimate the probability of the coincidental occurence of them all at once which clearly shows that it is astronomically unlikely. And that’s the point. Counting points of congruence to build a case for causation is statistically fraught with hazard unless one gives equal weight to points of non congruence. Sample sizes of one (HPM) do not assist one’s case either. 1. There are no non congruences which would exclude the hypothesis that HPM was based on te Shroud. 2. A sample. We estimate probabilities based not only on HPM, but on several other medieval illustrations of death and burial of Christ, as well as Empty Tomb scene. To make it in a very strict way, one should make proper survey, based on representative sample of hundreds or even thousands of such illustrations something that no one has performed so far. But as we all have experience of several hundreds similar portrayals in mind, due to the frequent discussions on this and similar topics, 1/100 estimate for each feature is good enough to start with..","date":"2014-07-06","mins":"4:00 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135907","author":"o_k","post":"There is one rule: do not use more arguments then needed! If your arguments are sufficient there is no purpose in adding several more dubious ones, which may be challenged by your opponents!.","date":"2014-07-07","mins":"6:26 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135720","author":"o_k","post":"Sorry. OK. It would take too long to address each of your laboured points individually. Sorry Colin that you have nothing meaningful to say on that matter..","date":"2014-07-06","mins":"4:27 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135905","author":"o_k","post":"David Mo: The other examples I put here indicate that the feet (at least one of them) are over the lid/shroud. This one is supported by the empty coffin/sarcophagus, as in the rest of representations at this time. All this obviously discards the “shroud” interpretation. […] On the place where the angel’s is seated: If we have a most common image (the lid or the sarcophagus) we mustn’t abandon it without some relevant reason (the Rock of Anointing). I don’t see any. On the rectangular object under de angel’s feet: Idem and idem plus: if this rectangular object is the same as the some early and Byzantine images of the Rock of Anointing, this says nothing in support of the sindonist thesis. It continues to be a rock, and not a cloth. I clearly stated this on July 6, 2014 at 8:08 am, but you have disregarded this: “The sceptics logic goes more less in the way: large number of Three Marys scenes show the angel sitting on rectangular slab from the tomb thus the similar rectangle in the HPM must also be a slab. But this is LOGICAL FAULT! It can be described as sweeping generalization (a dicto simpliciter see http://en.wikipedia.org/wiki/Dicto simpliciter) The fact that large number of Three Marys scenes does not mean that similar rectangle in HPM must also be a slab and it isn’t. I showed this many times the presence of a bench on which angel is sitting refutes allegations that this rectangle is a slab. Then it seems that this rectangle is indeed the Shroud.Anyway, the exceptional case of HPM precludes making any generalizations which shows that practically all sceptcs’ arguments are faulty And of course it does not change in any way the conclusion from my probabilistic approach, presented in article above.” You repeat that these lines are a rock shelf (before was a bench) but you don’t explain how two simple lines can be interpreted as a rock shelf instead of a bench or an extension of the coffin It cannot be extension of the red crossed “coffin” it is a different angle on a different level, and has no crosses. It is clearly a bench, or a rock shelf serving as a bench. Charles: We are still arguing over inessentials. I agree! All what is needed to prove beyond rational doubt the HPM Shroud connection is in my commented article. No sceptic has been able to undermine it. And there is no need to add anything else to show HPM Shroud conection on the contrary, several dubious additions may be chalenged by sceptics, who then will be claiming thet they would have “refuted” the HPM Shroud link. Pro authenticity: I appreciate your efforts, but giving more questionable arguments in favor is in fact detrimental. And will make this discussion neverending. Keep to the point, then the sceptics have nothing to say..","date":"2014-07-07","mins":"6:22 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135966","author":"o_k","post":"David Mo: he Pray Codex representation of the Holy Women at the tomb present a “large frequency of congruences” with almost all the images of the same scene at this time and place: “Large frequency of congruences in a population indicates a model” –in a population, David Mo. It does not apply to the one particular example (especially such specific like the HPM). So if a feature appears on the large percentage of example in population it is likely derived from a model. But not necessarily on one particular example, where (in specific case) it may be derived from something else. This shows your lack of understanding of the issue. And as to Jamito, if you like screwing, do it yourself. I don’t want to join you for your company..","date":"2014-07-07","mins":"12:24 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135975","author":"o_k","post":"Perhaps. I hardly believe there is anything relevant to add..","date":"2014-07-07","mins":"1:01 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132171","author":"o_k","post":"Hugh: I don’t think we’re getting any further. I don’t think the zigzags look anything like herringbone either, but OK thinks they’re sufficiently similar to warrant a comparison. That’s fine, but it isn’t evidence. Just another peculiar similarity with the Shroud, one can add to registry. And estimate frequency of their random occurence. I also think the whole picture has been trimmed to make it fit the Codex, which explains why Jesus’s feet have been cut off, and possibly the angel’s wing the other side. I may be wrong, but it’s a far more likely reason than a secret allusion to the Shroud. Whatever the reason, the chances for random occurence of it is, I suspect 1/100, or perhaps even smaller. Anyway, the size of the Codex cards is known, so artist could plan it better, had he wanted to portray whole legs. However similar two fingerprints may appear, and however many points of congruence there are, if there are any places where the two prints are clearly different, then they are not the same. Try applying that to the Pray man. Handmade illustrations are not fingerprints. There are always some differences. In this case, similarities are much more important. Have you done your homework and drawn Shroud picture out of memory, Hugh? I don’t know what that shape is behind the angel, nor do I think it relevant. The Pray manuscript picture has three prominent features in the correct configuration for it to be a fairly typical Three Marys, with rectangular tomb, oddly placed lid (if lid it truly be; I have long wondered if it is something else, misidentified, such as the annointing stone), and cloth shroud. See once again: http://img823.imageshack.us/img823/8435/kj41.jpg Can’t you see that the angel is sitting on some ‘chair’ or ‘bench’ to the left? He is definetly not sitting on rectangular shape with zigzag patterns, red smudges and L holes. Besides, compare perspective on top and bottom illustration..","date":"2014-06-21","mins":"5:22 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-136028","author":"o_k","post":"What do you understand by “model”, “frequency of congruences” and “population”? It begins to be a mystery. Perhaps you can explain it better. See July 6, 2014 at 2:58 pm A model a certain object, material, described or imaginary, or a certain style, with characteristic features, which are mimicked in objects derived from it (eg. The Shroud as a model and iconography of Christ) Congruence a feature that on the model that is mimicked on the object derived from the model (eg. Vignon marks, L shaped circles) Population a set of all objects dervived from the model (eg. Byzantine icons of Christ, burial and empty tomb scenes) Frequency of congruences a fraction of all objects within a population sharing a particular congruence (or set of congruences). I hope definitions are clear now. I asked you: “… And you continue without give us a single reason of your interpretation of these lines as a bench. What features of a bench you see? Can you see any form of legs or seat? ” I’m waiting for an answer. Paraphrasing you: the angel is seated; his buttocks is placed in contact with this thing consisting of those two lines as those two lines seem to serve no other function. And it is all clear, especially when compared with corresponding description in Mark’s Gospel (16:5, NIV): As they entered the tomb (inside the tomb), they saw a young man dressed in a white robe sitting (on what?) on the right side..","date":"2014-07-07","mins":"4:45 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-136208","author":"o_k","post":"David Mo: I see here nothing that would contradict my approach and definitions. I will just comment a few paragraphs. First, I would call “a model” in your understanding simply a style, but anyway. In the medieval Art the individual model (another painting, a man) are almost ever undetectable. A few portraits exist as exception. And so is the Shroud an exception, which exist, as you admitted. This is why the aspiration to deduce imitative effects only on the basis of isolated features is doomed to failure.Because an individual feature can be similar to other only by coincidence, But this is the main point, that you still don’t understand! The chances for coincidence of so many so rare features, are simply negligible! especially when it is defined vaguely and one rejects the contradictory elements of his interpretation as you and other sindonists do. They are precise enough to connect them with appropriate elements of the Shroud. And HPM’s “contradictory elements” are only in the sceptics imagination. You paraphrase, proclaim or affirm but never explain anything. If you pretend identify some object X it is necessary to identify the definitory features of this object, what identifies it as an X, not claim some vagueness as “seem to serve no other function”. Two lines are enough for a simple representation of a bench, especially in the very obvious context of this illustration. What “function serve” the lines in the back of the angel? Are they similar to the Pray Codex? I don’t know what lines you have on mind, and it has nothing to the different illustration in Pray Codex. New mistake. Some of us have explained here that the medieval artist does not guide himself by the Bible lecture but by the artistic conventions of his time and the iconic narrative. Who cares what guided a particular artist by? Was he obligued to do anything, because David Mo 800 years later orders him to follow some artistic conventions (which he likely was not even aware of) in his primitive cartoon? You try to complicate in extremely sophisticated way a matter that is very simple. There are numerous rare congruences with the Shroud? Yes. And as the chances for their coincidental occurence are negligible, the conclusion is that the artist simply once saw the Shroud, and inserted some of its elements into his drawing. Similar way kids in kindergarten do..","date":"2014-07-08","mins":"7:13 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-136489","author":"o_k","post":"If you want show that the Shroud is the individual model of the Pray Codex you ought to present serious evidence of it. For the moment you have not do so. I sense that for you no evidence would be “serious” enough because for you by definition no evidence in favor can be. And this is what you don’t understand: that the coincidences between the Shroud and the Pray Codex that you note are neither “rare” nor definite. And the differences are so blunt that no individual relation can be established between the two objects. Commenting such nonsense for the n th time seems a waste of time. I don’t want to play your ridiculous games, David Mo!.","date":"2014-07-09","mins":"5:04 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192182","author":"o_k","post":"Variables that may be dependent are assumed to be independent (maybe there is a correlation between how the hands are depicted, how the fingers are depicted and so on – you can’t assume that there is none without painstaking research). Unless anyone can show us that there is indeed correlation between some of the traits taken for analysis I can treat them as independent. There are no obvious reasons for relation between any two of them. Finally, I love how the author calculates probabilities for the tomb lid as if it were the shroud. I see you don’t understand anything. None of this makes sense, sorry.< Mr/Mrs Skeptic. Your post makes no sense. You have no understanding of what I have written here, nor you have taken any effort to understand it.Instead you choose to believe the nonsense about tomb lids that the same dogmatic sceptics told you to believe. Goodbye..","date":"2015-03-02","mins":"9:28 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192200","author":"o_k","post":"Mr or Mrs Skeptic, I see you have no idea what this whole presentation is about. I have no reason to treat those 6 traits as dependent on each other, as there are no indications of any relationship between each of them. Anyway those 6 features (1 naked body 2 four fingers 3 cropped legs 4 zigzag pattern 5 red smudges 6 L shape poker holes) are so rare on iconographic descriptions that no ‘iconographic tradition’ around them probaly exist. Your skeptical colleagues presented dozens of ‘similar’ illustrations yet they never possesed those 6 key elements from the Codex Pray (at most one or two, but those were rare instances). And that’s the point, the chances to find all those 6 key elements by random at once are close to NULL. If you don’t understand this, then further discussion with you is pointless..","date":"2015-03-02","mins":"11:53 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192237","author":"o_k","post":"Correct your links, then we will talk..","date":"2015-03-02","mins":"6:16 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192243","author":"o_k","post":"Fine ‘Skeptic’. You took some effort to search for illustrations with 4 fingers. Besides that a few of your examples do not pertain, you only strenghten my case (you fell into the same trap like David Mo and other sceptics before you). None of your illustrations show all 6 key features present in the Codex Pray. The more such illustrations you provide the stronger the case for the Codex Pray being unique and witness to the existence of the Shroud before 1200 AD. It’s not up to the critics to disprove you, it’s up to you to prove your case, which means going through the relevant manuscripts and icons and finding the general tendencies. If you can show that there is no iconographic tradition that has Jesus depicted in such and such state, then you can proceed to whatever calculations you can do This is is the part of the job you sceptics have done for me. By providing numerous illustrations that don’t have those 6 key features. I repeat: the more such illustrations you provide, the stronger the case for the Codex Pray being unique. But let me point you in just one direction. That Jesus is naked pretty much implies that his hands will be crossed over his pelvis, for obvious reasons. But not the other way, the crossed hands do not imply nudity. And nudity is the key feature here, not crossed hands (maybe I didn’t explained that in the article clear enough). On all of these images from different eras, including very modern images, the thumb is either barely visible or absent. Why? Because you selected those images. Now when you took such large effort (I admire you for that) answer your question yourself, what is the proportion of illustrations with 4 fingers vs 5 fingers. So here’s one potential correlation, which would leave you with only 2 traits, because then nakedness and 4 thumbs are not necessarily independent. None of your illustrations show full nudity like in the Codex Pray. Why 1 in 100 and not 1 in 20? It doesn’t really matter whether 1 in 20, 1 in 100 or 1 in 1000. The point is that the chance for randon accumulation of so many scarce traits, similar to those spotted on the Shroud, is really negligible. And whether its final numerical value is 1 in 1000, 1 in a million, or 1 in a bilion is not important, the conclusion is important. Versus the fact that the second image shows a tomb lid separately from a shroud. I took into account such possibility but the whole reasoning is totally irrelevant on that, as it doesn’t assume whether the rectangle on the lower illustration is lid or the Shroud, or anything (just the potential possibility of it being the shroud is enough). Besides the bench I found and on which the angel is sitting clearly disproves it being a lid: I am going sleep. Good night..","date":"2015-03-02","mins":"7:01 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192286","author":"o_k","post":"So ‘Skeptic”, I start the list of your errors: Well, that’s the fatal flaw, because if what we see is a lid (and it is a lid) then none of the probabilities matter. There is no such realistic possibility. The comparative analysis with the iconography of the same era shows that the rectangle could only be a lid See those two pictures:They both look similar, fishy like. According to the sceptical logic they are both fish. Then look on another pair of images:They look similar, yes. But they are in fact different. While upper image shows tomb lid, the similar image Pray Codex shows the Shroud. Similarity does not prove identity, just like the visual similarity between shark and dolphin does not prove the latter being fish. This is the fundamental logical error most ‘skeptics’ make..","date":"2015-03-03","mins":"9:36 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192288","author":"o_k","post":"Next: So the explanation of the cut off legs is very simple: the page is in poor condition and was partially cropped. Together with the legs, the angel’s wing, text above, etc. The fact is that the legs are indeed cropped there. This is undisputed coincidence with the Shroud. We don’t bother about any possible alternative explanation for the presence of key traits A F. The very presence of rare non trivial coincidences with the Shroud is important here. The folio is trimmed, I agree. I saw this long before you joined this discussion. But it is irrelevant here. It is of course possible that the crop of the legs is merely accidental. But this could have been as well deliberate decision of the illustrator who put the legs on the very margin to be cut while trimming. So the point C is still valid. “Because you selected those images.” I didn’t really have to try hard to select the images, most are from the first Google Image search pages. But in any case that’s hardly an answer. Why is the thumb absent or barely visible on the images I selected? Because you have selected those images with invisible or hardly visible thumbs. You have admitted this here. Thus the whole your reasoning is invalid, as you introduce bias by selecting the images that favor your claims. Besides lack of thumbs is something different, much stronger than “hardly visible thumbs” or thumbs obscured by geometric perspective. There is no obvious rationale for portraying 4 fingers on the entombment illustration in the Codex Pray, except that illustrator desired to do so for some reason. Nudity is correlated with crossed hands, that’s a fact (because nudity needs to be covered – and if not with a cloth, then with crossed hands, unless we imagine some Austin Powers like visual devices which surely weren’t in use back then ;) ). And it seems that crossed hands are correlated with 4 fingers. So it seems that nudity is correlated with 4 fingers and thus cannot be treated as an independent variable. This whole reasoning is obviously wrong. Your own illustration shows why: Here we have crossed hands, yet no nudity, as the loincloth is clearly visible. And there are 5 fingers visible on each hand. Remember correlation is not the same as implication, although they are related. And implication can go either way, but not necessary both. Nudity implies crossed hands (to cover genitals) of course, so there is correlation between nudity and crossed hands. But crossed hands does not imply nudity nor 4 fingers.. Oh, but it does matter. E.g. 10^ 3.9 may be small, but it is still much better than 10^ 6. (Not that I would agree with this number for the reasons outlined above.) But 10^ 3.9 (close to 1 in 1000) is a small number, even if two orders of magnitude larger than 10^ 6. It is close to null and that’s the main point. The odds for finding 6 tiny features that reasonably coincide with the Shroud just by chance is remarkably small. Small enough to reject it by any reasonable criteria. And that’s the conclusion of the article, which you have been unable to refute..","date":"2015-03-03","mins":"10:25 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192300","author":"o_k","post":"“They look similar, yes. But they are in fact different. While upper image shows tomb lid, the similar image Pray Codex shows the Shroud.” This is incorrect, since the similar image in Pray codex can only show the tomb lid, as I have shown through comparative analysis with numerous other contemporary miniatures. And I can show with numerous other fish photographs that dolphin is a fish as well. Once again: crossed hands don’t imply nudity, but nudity does (with huge probability) imply crossed hands. So you giving me an image of crossed hands without nudity does not in any way address my argument. There seems to be no argument at all. Besides, the whole discussion is pointless as nudity and crossed hands are in fact listed as one point (A, and in fact complete nudity is primary feature there). “But this could have been as well deliberate decision of the illustrator who put the legs on the very margin to be cut while trimming.” LOL? Of course such possibility seems to be beyond your imagination… Any probability calculation [that assumes that the rectangle is the Shroud, although it is of course the tomb lid] *must* account for the absence of the image on the “shroud”… No, it must account only for those features which are considered relevant to the subject, and not some other unimportant details which neither imply relation with the Shroud nor deny it. Even the lack of body image on the purported Shroud does not say anything, as one can give plausible explanation for its absence assuming even direct relation between the Shroud and the Codex). We take into account only a few traits we consider significant and non trivial. The quantity of coincidences is no less important than their quality. No ‘Skeptic’, you failed to refute my arguments presented here. You make basic errors (like making selection among the sample and claiming correlation, or assuming that implication in one way forces implication in another) , and don’t understand the fundamental principles behind the reasoning. But this is rather a norm for ‘smart’ skeptics..","date":"2015-03-03","mins":"2:26 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132175","author":"o_k","post":"I haven’t missed it. I simply have different view. I have checked Pala di Oro. Completely different context than Pray Manuscript, IMHO. For uncropped view, see http://greatshroudofturinfaq.com/History/Greek Byzantine/Pray Codex/pray3.html.","date":"2014-06-21","mins":"5:38 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192315","author":"o_k","post":"Nabber, I don’t think it is worthy of effort. You know that guys like ‘Skeptic’ are argument resistant.They know only their ‘wisdom’. Let the guy be happy. He didn’t refuted the main arguments presented here. In fact he don’t even understand them presenting ‘correlation’ basing on preselected sample, or not catching my analogy with dolphin, which although looks very similar to the fish, isn’t a fish (and similarly the rectangle in Codex Pray although similar to the lid, is the Shroud in fact). Let he consider himself wise’ for a moment. Discussing with fools only gives them higher ‘esteem.’.","date":"2015-03-03","mins":"4:32 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132042","author":"o_k","post":"I am not great on maths but if there are six different elements each of which has no more that a hundredth chance of being right (in other words is almost certainly not the the Shroud), I don’t think you end up with a very high probability overall. I do think that you don’t understand anything Charles. The one in a hundred is purely arbitrary anyway so does not provide a very good basis to start with, why not one in a thousand? Yes, for now it is just estimate. Give me examples of features A F on some illustrations then we will talk about better estimate. If you are depicting Christ being laid out for burial in a shroud and a face cloth as shown in the Pray Codex and you are comparing it with the Shroud, either as original or created, then the possibility of some overlap is bound to be high. The obvious example is the crossed hands (your A) that are known from actual Christian burials and come into art in both east (the epitaphios) and western tradition before 1190 so you can hardly claim this as a unique link with the Shroud it is just an overlap.. I am not interested in direct links only estimation of the rate of occurence. The main point in A is not crossed hands, but nudity the crossed hands are somehow related to it, for obvious reasons..","date":"2014-06-21","mins":"6:30 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192543","author":"o_k","post":"Yawn. You are getting too predictable. It is nothing compared to your predictability, regretful Mr ‘historian’. 1. Feet: I love how you arbitrarily drew long feet. The fact is that only a couple mm are missing, and they are explained by the trimmed edge. A couple mm? Had you been taking precise measurements of the legs on the rest of illustrations from HPM, you would notice that the feet are as long as hands there (or even slightly longer). On 28r we see not the endings, but almost entire feet missing. So I reconstructed them basing on hands lenght, and they are far of the edge. It is contrary to all evidence to suggest that the current margins on that pages are the original margins give or take a centimeter. We’re most probably missing a few cm there, after trimming and rebinding. “Most probably”? Any speculation about the original size of the card is merely a speculation. And the cropped feet are fact and link to the Shroud no matter whether it was accidental cut o rperhaps deliberate attempt to portray another of its feature. Which is the exception, not the rule The whole Pray Codex is exception with its unique Shroud linked features, and not the rule. But how can you differentiate between the rules and exceptions? They apparently don’t teach you that on historical studies, while lecturing analysis. They only teach you to follow paradigmatic guidelines, which is evident by the level of nonsense presented often as ‘historical analysis’. And is evident byt the rest of your comment about the Shroud and the tomb lid. I don’t need to comment that nonsense because i already have done that in previous posts. Thinking outside the box seems beyond you, no matter how many academic publications about the Shroud you will release. The Codex Pray portrays the Shroud of Turin the same Shroud that Robert de Clari saw in Blacherne in 1203..","date":"2015-03-05","mins":"2:09 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192415","author":"o_k","post":"You have asked this yourself: b) assuming that cropped feet have any significance (even though little research would have shown him that the feet were originally there and were trimmed because the manuscript was damaged); 3. We know from the comparison with the medieval manuscripts, the links to which are posted above, that the Pray codex depicts nothing else but the tomb lid.Are they both fish, because they look similar?.","date":"2015-03-04","mins":"2:11 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192552","author":"o_k","post":"““designs” being completely irrelevant to the issue” : That’s funny, Skeppy. The Pray shroud has a design, you know, like cloths do. Your tomb lids don’t — geometrical designs? Ha. Post the picture here and let’s let everyone decide. If there were one, though, it would be a sample set of one, because the rest of your cited tomb lids have nothing of the sort. And as O.K. Pointed out, your “tomb lid” does not have a matching scheme to the sarcophagus. Meanwhile, explain how your magical “tomb lid” in the P.C. Sticks to the side of a vertical side of a sarcophagus. Overall, I can’t believe you’ve ever taken and/or passed a Logic course. Nabber, please stay away from this discussion for a moment. It’s a trap and I am the prey to be hunted here..","date":"2015-03-05","mins":"3:10 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132178","author":"o_k","post":"For everyone: The scene depicted in Pray Codex is Mark 16: 1 6: When the Sabbath was over, Mary Magdalene, Mary the mother of James, and Salome bought spices so that they might go to anoint Jesus’ body. 2 Very early on the first day of the week, just after sunrise, they were on their way to the tomb 3 and they asked each other, “Who will roll the stone away from the entrance of the tomb?” 4 But when they looked up, they saw that the stone, which was very large, had been rolled away. 5 As they entered the tomb, they saw a young man dressed in a white robe sitting on the right side, and they were alarmed. 6 “Don’t be alarmed,” he said. “You are looking for Jesus the Nazarene, who was crucified. He has risen! He is not here. See the place where they laid him. (NIV) I bolded the fragments which show the details depicted on bottom illustration: 1. Three women 2. One angel. 3. Inside the tomb. 4. Angel sitting on the right side (compare with illustration, from women’s perspective) 5. Showing place where Jesus was laid..","date":"2014-06-21","mins":"5:51 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192563","author":"o_k","post":"Oh, BTW, may I ask you Nabber (or Dave B) about something? Our ‘Skeppy’ doesn’t sound like a native english speaker, does he?.","date":"2015-03-05","mins":"5:01 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192625","author":"o_k","post":"Yes, Dan, “psychopath” is maybe a strong word, but I am fairly confident who hides behind the nick ‘Skeptic’. I feel personally targeted by this person, who has a very characteristic style, and probably has a little problem with the control of his emotions. He lost a few discussions with me here and wants to discredit me at all cost. The provocative attitude towards me shows it clearly as well as the fact that ‘Mr Skeptic’ seems to be interested only in this thread about the Codex Pray. As I said once this is a trap, and I am the prey here..","date":"2015-03-06","mins":"10:24 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192640","author":"o_k","post":"Mr Skeptic, your obsession on me is really boring. A) The author did not provide any justification for his probability estimates. The author makes a rough estimation of probability assuming plausible order of frequency for each feature 1/100 for the simplicity of calculation. Whether actual frequencies are in fact 1 in 45 or 1 in 136 are largely irrelevant as the actual values, even if possible to determine, would hardly change the actual conclusion. Besides the author gives the very high limit (10 milion) for the actual number of relevant medieval illustrations (estimates for total number of all medieval manuscripts oscillate about a few millions), thus likely overestimating the final number achieved. B) The author did not provide any justification for treating his probabilities as independent, which can only be established through actual statistical research of the contemporary iconography. The author sees no evidence for any correlation, nor for any plausible connections between discussed features. For example, there is a probable connection between nudity and 4 fingers (a nude figure will almost certainly be exhibited with crossed hands, and there is an abundance of images from different eras with crossed hands which lack thumbs; The attempts to show the connection between two features based on the biased, selective sample have no grounds. 2. Substantial grounds: a) The author claims the cropping of Jesus’ feet as a significant coincidence with the Shroud of Turin, yet there are two facts that undermine this conclusion: a1) We know that as a rule medieval manuscripts had very wide margins, because the scribes knew that their books would be rebound and trimmed several times in the next few centuries. It is thus extremely improbable that the current very narrow margins are the original margins, give or take a few mm. A2) We know that the Pray codex *was* trimmed, because it has some marginal text neatly cropped, which means that the manuscript as a whole did undergo this standard treatment. We cannot determine the original size of the relevant sheets in the Pray Codex. The fact that the text on the upper edge of the codex is cropped is irrellevant as height and width are two independent dimensions. B) The image has to be interpreted first and foremost in the light of the contemporary iconography. As the Codex Pray is unique with its exceptional Shroud linked features, any comparisons with contemporary iconography are baseless. The exceptions defy the rules by definition. This is the basic logic. The contemporary iconography allows for no other interpretation See above. Contemporary iconography cannot be applied for a single very specific example which may go against it. C) The author’s claim that the pyramid like pattern on the tomb lid refers to the herringbone weave pattern is false, because it looks nothing like the actual herringbone weave pattern, which looks like a series of parallel straight fish bones. The interpretation of zigzag pattern as an attempt (even if inaccurate) to portray herringbone pattern is fully justifiable. The author’s claim that the tomb lid is actually the Shroud of Turin is also refuted by comparing the top and the bottom pictures on f.28: the top picture shows Jesus’ shroud, which, with its numerous folds and without any pattern, looks nothing like the rigid patterned rectangle on the bottom image. The difference between representation of the Shroud on top and bottom pictures of f:28r is irrelevant, if one takes into account other contradictory represenations in the Codex. For example f:27 shows Jesus crucified in traditional Byzantine style implying 4 nails used, while there are only three nails on the arm of the cross hold by an angel on f:28v: http://mek.oszk.hu/12800/12855/html/hu b1 mny1 0060.html http://mek.oszk.hu/12800/12855/html/hu b1 mny1 0063.html e) The author only takes into account what he thinks are convergent features, while ignoring the divergent features in his probability estimates. These divergent features include: There are no features that would exclude the hupothesis that the Shroud of Turin is referenced in the Codex Pray. E1) Lack of the image on the alleged shroud. Irrelevant. If illustrator decided not to portray the image on the Shroud for some reason, he had the right to do so. Demands of the skeptcis 800 years so about what the illustrator should and what should not have portrayed are lacking any basis. E2) Lack of the actual herringbone pattern on the alleged shroud. Same as above. E3) Lack of the corresponding pattern on the second half of the shroud (which is actually a depiction of the sarcophagus). The second rectangle on the lower image is irrelevant as it is hard to interpret what it represents. I have never claimed that it has to be the other half of the Shroud. E4) The different number of circles on the two alleged halves of the shroud (4 and 5). See above. E5) Lack of wounds on Jesus’ body. Irrelevant (see description for e1). E6) Jesus’ hands are crossed at the wrists (or even above them), not at all like the hands on the shroud. This sentence makes me laugh. Mr Historian, just look at the later copies certainly derived from the Shroud of Turin: http://greatshroudofturinfaq.com/History/Western European/manycopies.html The position of the hands is exactly the same as in the Shroud of Turin. Conclusion: The main conclusions remains valid: *There are no element that would exclude possibility that the Shroud of Turin is represented in the Codex Pray. *The coincidental appearance of so many peculiar elements connected to the Shroud on the f:28 of the Codex Pray is so improbable, that can be rejected by any reasonable criteria..","date":"2015-03-06","mins":"1:52 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192594","author":"o_k","post":"Skeppy Thankfully, I never claimed to be a historian. ;) Yeah, coming here you never intended to be a historian, especially proffesional medievist, right? Nabber: “Sounds” American to me. It was peculiar to me that he should try to call texture “a design”, though. Oh, really? Doesn’t he sound… Italian instead? His English is of course correct, but anyway… I don’t think this ‘Skeppy’ is entirely new to this blog. I suspect he is rather well known person here, but hiding under pseudonym. And he is looking for personal vengeance on me. Nabber, Dave B and anyone. I would like to ask you for one thing: don’t respond to ‘Skeptic’ anymore. You are dealing with a psychopath, who wants to show his superiority in this topic over me (and the more over you). Haven’t you noticed that Mr ‘Skeptic’ is interested about this thread and only about this thread? And that he made extensive preparation to discuss with me about this thread? And some other characteristic features of his personality?.","date":"2015-03-06","mins":"2:29 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192641","author":"o_k","post":"Nabber, still haven’t you guessed who this ‘Skeppy’ actually is?.","date":"2015-03-06","mins":"1:53 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192645","author":"o_k","post":"Your Admiral Akbar reference finally betrayed you as a 20 something/30 something frustrated atheist, who acts like a teenager. Based on his photography about mid 30s..","date":"2015-03-06","mins":"2:10 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192643","author":"o_k","post":"And one advice Nabber (the same words directed to Dave B and others), don’t get provoked by him. This guy has a doctorate from history and desires to show that he is better than in you in this playground. His favorite tactics is to set several traps and allow the opponents to walk into them unaware..","date":"2015-03-06","mins":"1:59 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192697","author":"o_k","post":"Agreed about Nabber. Skeptic, however, did nothing wrong, he doesn’t care about double standards though ;) Yeah, double faced Mr ‘Skeptic’ does not care about double standards. He is eager to insult others, but he cries that other attack him ad hominem. Perhaps because the discussion turned form the Codex Pray (where all arguments have been actually repeated many times in this long discussion), to the not so mysterious person of Mr Skeptic who seems to have some kind of obsession about attacking my person, and showing that I must be wrong on this, very important for the Shroud history, issue. As for the Codex Pray I stand by what I said. You have not been able to refute my conclusions. And of course Mr Skeptic knows that he failed to maintain his identity secret. That’s why he panically is shouting about ad hominem attacks on him. Because he is afraid that his regretful attempts to deceive readers will be exposed. One another thing: Also, I’m not a historian. That’s the point I can agree. Mr Skeptic you are not a historian, even despite your doctorate from that domain. You are just a poor denialist which you have shown in your recent article..","date":"2015-03-07","mins":"8:10 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192734","author":"o_k","post":"‘Mr Skeptic’ I’m afraid you’re deluded about my person, just as you’re deluded about the Pray codex. I have asked around and searched around and I assume that you think that I am Andrea Nicolotti. Dr. Nicolotti’s knowledge of all matters pertaining to the Shroud is incomparably higher than mine. Oh really? How do you know how much extensive Dr. Nicolotti’s knowledge about all matters pertaining to the Shroud actually is (and whether it is higher than yours)? Unless of course you ‘Mr. Skeptic’ and Dr. Nicolotti are one the same person. And perhaps Dr. Nicolotti’s knowledge about all aspects of the Shroud is fairly limited especially about physical, medical and chemical aspects of the artifact. Perhaps, as he specialize in history, his knowledge about those subject may be practically null. Perhaps he does not understand the physical and chemical characteristics of this cloth, because being historian, he does not need it in his work (although some basic knowledge is necessary for someone who performs research in the subject of the Shroud)..","date":"2015-03-07","mins":"6:54 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192762","author":"o_k","post":"You does not surprise me at all, I have known well that you and your sceptical colleagues are spying me and started a file about me. It is typical, semi criminal way of yours, sceptics to look for and gather any information that may potentialy discredit inconvenient person..","date":"2015-03-08","mins":"3:39 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132043","author":"o_k","post":"Or for the purpose of understanding by mere humanists: I am not great on maths but if there are six different elements each of which has no more that a hundredth chance of being right (in other words is almost certainly not the the Shroud), I don’t think you end up with a very high probability overall. And that’s the point! What is the probability that those six peculiarities, resembling those on the Shroud, were placed on those illustrations just randomly, without reference to the Shroud?.","date":"2014-06-21","mins":"6:39 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192886","author":"o_k","post":"Yes, I have considered. But I don’t think that any interpretation of the Codex Pray elements can be proved as definite. That’s why I prefer probabilistic approach, showing the probability that the Codex Pray images were created without the reference to the Shroud is <<1..","date":"2015-03-09","mins":"4:23 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132264","author":"o_k","post":"Hugh: Not at all. It just isn’t very relevant. It is just that all those odd elements O F are unlikely to happen simultaneously just by chance..","date":"2014-06-22","mins":"5:17 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132267","author":"o_k","post":"Hugh: The angel is usually sitting or standing on or posed by a very oddly angled slab, which I think is artistically and culturally derived from the stone he sat on in the earlier versions Butin the HPM, the angel is not sitting on the slab! Look once again: What is an object, that I pointed with green arrow?.","date":"2014-06-22","mins":"5:44 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132278","author":"o_k","post":"He may be sitting on something else (your green arrow) What is this ‘something else’? The Pray angel has both feet on the slab Yes, he has both feet on this rectangular shape. And he is not standing look at his dress below the waist, it is not straight, as if standing, but rather curved, like sitting. Look back to the Gospel: As they entered the tomb (inside the tomb), they saw a young man dressed in a white robe sitting (on what?) on the right side Compare (poorly expressed) perspective on the upper and down illustration. Can it still be a slab?.","date":"2014-06-22","mins":"7:50 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132280","author":"o_k","post":"The thing in the background is irrelevant It is not, if the artist had drawn it for some purpose..","date":"2014-06-22","mins":"8:06 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132311","author":"o_k","post":"It is up to Max. So what Hugh, do you surrender (maintaining honors), or go further into absurdities (like Charles and his Egypt), defending lost case?.","date":"2014-06-22","mins":"12:35 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132342","author":"o_k","post":"I am sorry that I don’t have your imagination, O.K. I am sorry too, Charles. Lack of imagination and narrowmindness may be a big handicap for someone in the research job. An inability to understand simple reasonings also..","date":"2014-06-22","mins":"3:25 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132325","author":"o_k","post":"Charles: No matter your games, the fact remains, that you cannot give any reasonable explanation for the presence of elements A F, all at once, in the Pray Manuscript, other than inspiration from the Shroud of Turin..","date":"2014-06-22","mins":"1:27 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-175711","author":"o_k","post":"Well what can I say? It’s an excellent article, and what’s more it supports my own observation. It clarifies many misconception and gives much food for thought. Moreover, it seems to provide some crucial information for one of my projects, but what exactly I will reveal when I make it..","date":"2014-12-11","mins":"9:34 am","url":"https://shroudstory.com/2014/12/11/roger-bassetts-clarifying-art/","cat":"art","title":"Roger Bassett’s Clarifying Art"},{"id":"comment-148548","author":"o_k","post":"Hugh, just one should develop some clear and sensible rules not to get lost in all that mess with images. That work is in progress already. My response for P&P claims is already being worked on..","date":"2014-09-04","mins":"1:22 pm","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","title":"Speaking of Matching Faces"},{"id":"comment-77029","author":"o_k","post":"David: My understanding is that the early church tended to go the opposite way and portray Jesus, the Christ, as a perfect human specimen (so too his mother). To then suggest that the Great Healer was himself lame and physical imperfect is counter intuitive, to put it mildly. It would have had to based on some form of physical evidence. Contrary: He had no beauty or majesty to attract us to him, nothing in his appearance that we should desire him. Is 53:2 (NIV) Based on this verse, some of the Church Fathers maintained that Jesus was looking ugly, he was lame, unattractive and so on thus he shouldn’t be portayed. They argued that not his look, but his message is something one should concentrate on. Only later the approach was changed, as it was understood that this verse depicts Christ during His Passion. Hugh: Only later did the long edges acquire a slant of their own, and the shorter edges, sometimes but sometimes not, become vertical. And the question is WHY? Remeber, there were strict rules in painting icons, and no room for experiments. Other interpretations of the suppedaneum is that it is a balance (sheep up – goats down). All those interpretations are most likely later inventions, trying to give answers (and some theological meaning) to principal question: WHY? Because it makes rather little sense from rational analysis. Only if basing on some higher authority it is understandable. Anyway the beginings of this strange feature seem to be shrouded in mystery!.","date":"2014-02-06","mins":"11:59 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-190674","author":"o_k","post":"IMHO, I do think that a limit of 5 comments per day (not only for Max but for everybody) could be an acceptable compromise. I don’t think this is a good solution. During very intense debates (which happen from time to time) the limit of comments per day may be obstacle. Is there maybe a technical possibility to merge all that small comments by Max into single one?.","date":"2015-02-11","mins":"4:44 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-77064","author":"o_k","post":"Those are, of course, later interpreatations. The truth is no one knows why the bar is slanted..","date":"2014-02-06","mins":"3:40 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77036","author":"o_k","post":"But this is not a minor diference, it is a revolution!.","date":"2014-02-06","mins":"12:11 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-191570","author":"o_k","post":"Clever, but this is NOT THE REASON why painting a negative image just like on the Shroud is practically impossible. Painting a mirrored image is relatively easy, just as painting tone inverted (black vs white) image. Those are trivial operations. But those are not what is a secret of the negative. Read my gust posting about that https://shroudstory.com/2014/11/10/guest posting by o k on the shroud as a negative/ And pay attention to the greyscale and contrast..","date":"2015-02-22","mins":"12:35 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191681","author":"o_k","post":"Sampath: I have attempted to explain why the nail wound of the Shroud man is not in the wrist at: http://i.imgur.com/LH4rm E9.jpg. Perhaps you and daveb would like to point out the flaws in it! Hugh, the fact is that any measurements on the Shroud has about 5 mm margin of error. So for two points the error may be as high as 1 cm. My measurements give about 58 mm between N2 and P2, which is about the lenght to the wrist in my hand. Roughly in the places indicated by Zugibe: http://www.shroud.com/zugibe.htm.","date":"2015-02-23","mins":"5:26 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191694","author":"o_k","post":"Because at least one of the thumbs is probably barely visible:.","date":"2015-02-23","mins":"6:37 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191723","author":"o_k","post":"Hugh: No. Your total length now, from the wound to the far end of the phalanx is 59.0 + 51.7 = 110.7mm. My hand being bigger than the Shroud’s, I multiply this by 1.1 to get 121.8mm. On my hand, this takes me exactly to position N3, and not the wrist. As I said before, a single measurement here or there cannot be used to define a position, because an overall match is needed. You need to measure all your own phalanges, compare them to the Shroud’s, multiply the Shroud measurement by any necessary correction factor, and then find the position of the wound on your own hand. I very much doubt you will find your positions very different from mine. On the contrary, on my hand I don’t find my positions very different from what I see on the Shroud, the distance of 11 cm from the end of proximal phalanges leads me to the wrist area, exactly where Zugibe indicates. Your hands are perhaps slightly different, yet comparing with mine (and without using complicated method you described) the results are satisfactory. Dave B: I already did at Feb 23, 5:24am. Why should I repeat myself? Measuring along the hands is useless and Oskar has fallen into the trap of repeating the error. No one knows what the angle of the hand is to the surface of the cloth, and no one knows the length of the phalanges or other related physical attributes of the TSM, nor whether the fingers are cupped. I also mentioned other aspects. Yet we can give quite reliable estimate. The sheet probably followed the surface of the hand quite tighly, as roughly constant intensity indicates (remeber about distance intensity correlation), so the margin of error due to projection is likely to be negligible. We can also get a good guess about the endings of phalanges (as they are marked by slight growth of intensity). And making those measurements we can get quite fine results..","date":"2015-02-24","mins":"6:20 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191695","author":"o_k","post":"“The length from the wrist to the basis of the knuckles should be about the same as the length from the basis of the knuckles to the end of proximal phalanges.” I’m not sure I get that. The yellow bones are longer than the green bones. A comparative study of Hand Segments (http://www.scielo.cl/pdf/ijmorphol/v28n3/art15.pdf) gives every metacarpal as at least 15mm longer than its connected phalanx. By ‘basis of the knuckles’ I mean the protuberance at the ending of the metacarpal, so phalanx+ the neding of the metacarpal. Anyway: Give or take 5 mm, and everything is fine..","date":"2015-02-23","mins":"6:40 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191737","author":"o_k","post":"No, Hugh, measurements taken on my hand give me almost the same results as shown on the two pictures above: about 6 cm for the first measurement (from the wrist to the basis of the knuckle) and 5 cm for the second (from the knuckles to the end of the phalanx. No complicated method is needed..","date":"2015-02-24","mins":"11:24 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191743","author":"o_k","post":".","date":"2015-02-24","mins":"2:01 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-62725","author":"o_k","post":"There is another possibility, Louis:.","date":"2013-12-19","mins":"7:40 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","title":"What Did Jesus Look Like Throughout History?"},{"id":"comment-191750","author":"o_k","post":"The begining of the scale on my photo is exaclty over the wrist, in the position postulated by Zugibe, and suggested by the Shroud. The lenght to the end of proximal phalanges is exactly 11 cm, as you can see on the ruler. It fully corresponds to the pictures presented in my post from February 23, 2015, 6:40 pm. I don’t know why there is discrepancy with your image superposition. Anyway, the end of the ruler should be exactly on your black line in the wound centre..","date":"2015-02-24","mins":"6:20 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-64059","author":"o_k","post":"Remember that this Man was hanging on the cross..","date":"2013-12-21","mins":"7:06 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","title":"What Did Jesus Look Like Throughout History?"},{"id":"comment-63606","author":"o_k","post":"Appearances can be deceptive, remeber. See this page http://manoppello.eu/eng/.","date":"2013-12-20","mins":"6:24 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","title":"What Did Jesus Look Like Throughout History?"},{"id":"comment-186688","author":"o_k","post":"I am happy you have admitted that,Max..","date":"2015-01-27","mins":"1:09 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-184309","author":"o_k","post":"No one knows which group is worse….","date":"2015-01-18","mins":"1:37 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185149","author":"o_k","post":"Besides most likely the Shroud of Compiegne and Sindon Munda from Kornelimünster are two halves of one original subtitute relic about the same length and width of the TS Max, this is not true. See From the webpage http://en.heiligtumsfahrt2014.de/wissenswertes/heiligt–mer/the shroud of jesus “According to tradition, this cloth was used when Jesus was laid in the tomb. It is an artfully woven linen cloth, comparable to an ornamental cover. It is approx. 1.80 m wide and 1.05 m long. Originally it was twice as large. The missing half was given to Charles the Bald in around 875 for the establishment of his monastery in Compiègne, in exchange the abbey received the relic of the holy Kornelius and the holy Cyprianus.” As position of the cut indicates, the original size of this cloth must have been not 4x1m (like TS) but about 1,8 m x 2m.","date":"2015-01-21","mins":"12:39 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185663","author":"o_k","post":"Max: Oskar, methinks you got it all mixed up here. Known as “S Indun Munda” (i.e. “the clean/pure cloth” in clear reference to the Matthean “Sindon Karthara” (Mt 27: 59), the Charlemagne’s original substitute relic (that was twice as large as the Kornelimünster “Sindon Munda”, that is approximately 4m long and 1m wide (the second half used to be kept in Compiègne till it was destroyed at the French Revolution), WAS about the same length and width as those of the TS. Unfortunately not, as the photo shows. See where the cut goes. As today’s half of the “Sindon Munda” in Kornelimünster is is approx. 1.80 m wide and 1.05 m long, and the cut is paralel to the longer edge, the original size of the Sindon Munda must have been about 1.80m x2 m twice as much but in a different proportion (1:1 instead 4:1) than TS..","date":"2015-01-23","mins":"7:10 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-63547","author":"o_k","post":"Louis: I fully agree one cannot jump to hasty conclusions, either that Manoppello is a divine miracle or just a simple painting, like most people do. The publications on Manoppello are usually exaggerated in either way, that’s why it is hard to get balanced and unbiased view on it. But what I want to stress, the Manoppello cannot be ignored, contrary to the temptation of many Shroud scholars. So how many times do you think that Jesus left his image on cloth? Once on the veil, the second time on the Shroud? It has been suggested that Manoppello had been laid on TS, see http://www.sudariumchristi.com/uk/tomb/byssus.htm There are also claims by Fanti and Maggiolo about ‘double superficiality’ of the front TS image, and Jakcson’s ‘Collapse Theory’. So, speaking theoretically, there could be more clothes, shrouds, and napkins with the image of Jesus upon them. Perhaps some radiation created some changes in the byssus yarns… but those are mostly wild speculations now. There is no mention of Veronica in the Gospel, just what can be reasonably be interpreted as a burial shroud. Of course there is no mention of Veronica in the Gospels, and there is no evidence such legendary encounter, but the origin and evolution of the legend is a very complex matter. See Massimo Centini’s Alla ricerca della Veronica for example. There are stories about some miraculous images of Christ (or faithul represantations of how He looked like) circulating since the very early centuries of Christianity. And perhaps based not only on a single prototype. Did you see what Phil Dayvault found in Turkey? In your view is that mosaic similar to what we can extract from the face on the Shroud or does it comes closer to what is seen in Manoppello? I don’t know what you have on mind. For some cappadocian paintings , see http://manoppello.eu/eng/index.php?go=kapadocja It is hard to tell whether those paintings were based more on the Shroud, or on the Manoppello (assuming they are both genuine). That’s why many scholars, ranging from Wilson, would prefer that there is no Manoppello. It solves some problems, but complicates the situation enormously. For example the strand of hair, the most prominent feature, is present on both TS and Manoppello. There is not one, but two possible prototypes and how to distinguish which is which in some cases? But in some others, it is possible. Remember, there were two allegedly miraculous Images of Edessa, and of Camoulia (Camouliana). And there are TS and Manoppello..","date":"2013-12-20","mins":"5:18 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","title":"What Did Jesus Look Like Throughout History?"},{"id":"comment-191691","author":"o_k","post":"I don’t see any significant problem here. The lenght from the wrist to the basis of the knuckles should be about the same as the lenght from the basis of the knuckles to the end of proximal phalanges. That’s in the case of my hand. But it seems that in the case of your hand, the first distance is probably greater than the second, so the proportion is different. Anyway, as I said, my measurements still tell me the nail exit is in the wrist in either of the areas postulated by Zugibe (not Destot’s space!).","date":"2015-02-23","mins":"6:19 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-63115","author":"o_k","post":"Louis : Hi O.K. It could be telepathy(!) but I was thinking about you as the first person who should be asked for an opinion. You gave it, and that means you have chosen the TS face not the “Veronica”! ??? I don’t know what do you mean. The TS and Manoppello faces are compatible, but each is represented in its own unique way. I do not see any contradiction that would force me to choose between the two. As to Divine Mercy Image painted by Kazimirowski based on Saint Faustina visions, here you have some comparisons with TS and Manoppello:http://www.sanctepater.com/2010/04/shroud of turinvilnius divine mercy.html The similarities are fascinating, especially when compared with later and more popular version painted by Hyła after Faustina death. But of course this is hardly a scientific evidence..","date":"2013-12-20","mins":"7:51 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","title":"What Did Jesus Look Like Throughout History?"}]
