[{"id":"comment-52663","author":"o_k","post":"To whom is this comment?.","date":"2013-11-24","mins":"9:43 am","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","title":"A Guest Posting by O.K. :  Blood on the face of TSM?"},{"id":"comment-52710","author":"o_k","post":"Explanation? See once again “The Real Face of Jesus” http://www.youtube.com/watch?v=WNJPJ4 Jw He E 27:00 28:30 Essentially different photographic films or plates have different sensitivity in different parts of the visible spectrum this means that if a plate is more sensitive in red than yellow, red parts of the object (like bloodmarks of the Shroud) are brighter on the photo than yellow parts (body image), and vice versa. The Enrie’s photo were more optimised for yellow body image than for example Schwortz photo this is why they are still (despite some drawbacks) widely used to analyze details on the Shroud. See Schwortz picture the red parts of the image (blood marks) are much brighter then the rest of the body, and so is the facy, contrary to Enrie’s photo. This is not due to different contrasts compare knees and face on both picture’s. On Enrie’s their luminosity is comparable, on Schwortz not, the face is more intense..","date":"2013-11-24","mins":"6:00 pm","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","title":"A Guest Posting by O.K. :  Blood on the face of TSM?"},{"id":"comment-52809","author":"o_k","post":"T& B were not aware or totally overlooked the presence of possible ghost writings and objects, very faint floral images They were aware about ghost writings, at least. And coin partial blood decal tiny patterns were also recorded on the TS fabric on the face area. That’s direction I am trying to go now, most of the image of the face is not recorded by the yellow ‘image’ fibers, but by brownish red blood fibers, according to this hypothesis..","date":"2013-11-26","mins":"8:59 am","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","title":"A Guest Posting by O.K. :  Blood on the face of TSM?"},{"id":"comment-60810","author":"o_k","post":"Well done, Kelly and Thibault! At last someone reminded sceptics, that NOT ONLY Heller & Adler examined the alleged bloodstains on the TS..","date":"2013-12-17","mins":"7:45 am","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-60820","author":"o_k","post":"The ignorance of several anglophones regarding research performed in other countries is tremendous. One should remind, that although STURP performed fantastic job, it was not only the STURP that performed examination on the Shroud, despite what is often stated. Actually STURP asked (and was given) only 96 hours for examination of the Shroud, while remaining 24 (of 120) was given to the Frei and Italians..","date":"2013-12-17","mins":"8:07 am","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-98110","author":"o_k","post":"AS far as I can recall from anatomy if Dr Pierre barbet is right, assuming that the wrist nail pierced the palmar (volar) face of the wrist iabout the middle of the palmar crease, no major arterial vessel is damaged. Now let’s compare with Zugibe hypothesis http://www.shroud.com/zugibe.htm And BTW, in https://shroudstory.com/2014/04/06/more on the y from stephen jones/#comment 97130 I wrote: “One more thing, te bloodmarks on the left arm are very close to the edge of it (see http://img23.imageshack.us/img23/5695/drr7.jpg) they were most likely coming down from the upper side of the hand, the surface of which is more horizontal, then vertical, until spilling down the arms at 55 65° from the vertical.” And also “Roman graffitis showing crucifixion: Puozzola graffiti on the left, Alexamenos graffiti on the right. Those are definetly either † shaped Roman cross (crux immissa) or a T shaped cross (crux commissa) and the angle is definetly less than 80° to the horizontal, perhaps 25 35°, as indicated by the Shroud.”.","date":"2014-04-10","mins":"11:26 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-38829","author":"o_k","post":"Imagine, that there had been bloodied body wrapped inside the Shroud. If someone had tried to take it away from the Shroud, glued to it with dried blood (+ aloe & myrrh) – wouldn’t he rather torn such a thin 4 meter cloth in pieces? It is hardly possible to remove the body leaving not only bloodstains, but also the Shroud itself intact..","date":"2013-07-10","mins":"11:20 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-98157","author":"o_k","post":"A quote from Zugibe: http://www.shroud.com/zugibe.htm The heart is beating and is constantly extruding blood through the wound and I assure the reader that the hand is heavily endowed with blood vessels in vast networks constantly feeding from major blood vessels on both sides of the hand. This would create a large blood smudge with blood all over the hand, wrist and down the arm. This is supported by British Home Office Pathologist James Cameron, a forensic pathologist who indicated that a nail passing through the area of the median nerve would most likely hit a main artery. Every movement on the cross would result in episodes of oozing and over several hours there would be a substantial blood collection..","date":"2014-04-10","mins":"3:56 pm","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98337","author":"o_k","post":"“… most likely hit a main artery …” Very well. Which one?.","date":"2014-04-11","mins":"8:06 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98339","author":"o_k","post":"Dan : Use an image anywhere on the internet. It can be within a document* or on one those free photo sharing sites. Get or copy the image URL, which begins with the letters “http” and ends with “jpg”, “gif” or “png”. Type the red part exactly as you see it below (but type it in black) Paste or type the image URL shown in blue between the two red quotation marks. Img src stands for image source. The less than and greater than symbols make it into something your browser understands; same with the slash. The quotation marks are important to delimit the image URL. *Images in PDF files can be tricky, Sometimes you can extract them with the copy command (right click sort of stuff) and send them to Flickr, Facebook, etc. You can then include them in comments. I don’t know how to do that but that is why we have children. Please don’t ask for technical support above and beyond this because this is the extent of what I know about the subject. Dan, it doesn’t work for me..","date":"2014-04-11","mins":"8:08 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98338","author":"o_k","post":"“… most likely hit a main artery …” Very well. Which one?.","date":"2014-04-11","mins":"8:08 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98353","author":"o_k","post":"Hugh: A beautifully clear image showing that the main arteries to the hand run on either side of the middle of the wrist, and would not be touched, let alone severed, by a nail through the carpals. I recommend reading Zugibe’s article once again, then maybe the doubts will be explained. ONE: The thumb (radial) side of the wrist i.e. The area of the wrist opposite Destot’s Area. The nail could pass through the radial (thumb) side of the wrist through a space created by four other carpal bones; the NAVICULAR, LUNATE, GREATER MULTANGULAR and CAPITATE bones, emerging where the Shroud depicts it. This is a very strong area and the trunk of the median nerve would most likely be damaged by this path. TWO: The upper part of the palm of the hand … NOT THE MIDDLE OF THE PALM. This area is equally as sturdy as either Destot’s Space or the radial area indicated above and would emerge at the site depicted on the Shroud. This area is located as follows; touch your thumb to the tip of your little finger. A deep furrow called the thenar furrow is seen at the base of the bulky prominence extending from the base of the thumb. This area was first pointed out by Monsignor Alfonso Paleotto, Archbishop of Bologna, who accompanied St. Charles Borromeo to Turin in 1598. It may be of interest that he postulated that the nail would have entered the upper part of the palm obliquely, and pointing toward the arm, it would have emerged where the Shroud depicts it. It is of interest that Barbet severely criticized Paleotto’s hypothesis as “anatomically impossible.” Monsignor Paleotto was indeed correct. If a nail is driven into this furrow, a few centimeters from where the furrow begins at the wrist, with the point of the nail angled at ten to fifteen degrees toward the wrist and slightly toward the thumb, there is a natural inclination of the nail to an area created by the METACARPAL bone of the index finger and the CAPITATE and LESSER MULTANGULAR bones of the wrist which we have coined the “Z” area (Fig. 5).","date":"2014-04-11","mins":"8:58 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98377","author":"o_k","post":"Barbet vs Zugibe 0:1.","date":"2014-04-11","mins":"11:19 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98419","author":"o_k","post":"Well Hugh, what would you say for that: http://tiny.pl/qnb8b http://tiny.pl/qnb8z I wouldn’t be so sure that hitting major blood vessel is so impossible. Some interesting video: I estimate that those nails are about 4 5 mm in diameter (about 1/3 of the fingers or 1/4 of the thumb).For comparison the nail from Santa Croce in Jerusalem is claimed to be about 9 mm in diagonal, so twice as much..","date":"2014-04-11","mins":"3:13 pm","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98668","author":"o_k","post":"If blood came out of a wrist wound while the arm was on the ground it still wouldn’t flow along the arm. The point about the plug is that on any first aid course, one is told never to try to extract an obect (such as broken glass or a bit of metal) from the wound, as while it is in place it prevents bloodloss by literally plugging the hole. Cutting yourself on a knife or protusion, or scraping your knee or bashing your head in a car crash all produce masses of blood, but driving a stake through yourself and leaving it there, perhaps counterintuitively, does not. But Hugh,you must remember that victim is not in the static position on the cross, contrary he is constantly trembling with pain, getting convulsions shaking and disturbing the wound. You must take also in the account that he weights 70 80 kg, while hanging on the cross. Much of this weight is pressed on the nails. It is completely different situation than what you describe..","date":"2014-04-12","mins":"8:51 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-97453","author":"o_k","post":"In my opinion it also depends on where you put this nail. See http://upload.wikimedia.org/wikipedia/commons/2/29/Circulatory System en.svg.","date":"2014-04-07","mins":"5:30 pm","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-41768","author":"o_k","post":"Don’t you all have too much money for such wastepapers?.","date":"2013-08-22","mins":"3:35 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41872","author":"o_k","post":"Yannick Clément : This is exactly what happened for Ian Wilson,. Yannick, If I May ask you, what did Ian Wilson to you, so you hate him so much?.","date":"2013-08-24","mins":"5:51 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41905","author":"o_k","post":"Charles, first, Yannick, with respect, has shown nothing that disproves Wilson’s hypothesis. Second: Wilson’s reconstuction, is just only a HYPOTHESIS, and he (Wilson) always claimed so, as far as I know. Most probable IMHO, but it doesn’t mean that I uncritically accept it at all points. Third: Yes there are many possible tracks. The problem with Shroud history up to 1350 is not lack of recrods, the real problem is that there are TOO MANY records, that allows for multiple tracks, how the Shroud possibly came from Jerusalem circa 30 AD to Lirey circa 1350. For example, my own book written in Polish by medical doctor Stanisław Waliszewski, assumes recontstruction based Pietro Savio’s 1957 work, which in my opinion is too archaic for now. It says that the Mandylion was distinct from Shroud, which was the Arculf’s shroud from 670. Fourth: There are definetly many other interesting relics. What is regrettable, they are very often absolutely forgotten in English speaking world. For example Tunic of Argenteuil, it was already shown in 1934 (and once again by Marion in 1997) that blood (type AB!) marks on the back of the Tunic match the wounds of the Man of the Shroud. But who in the English world has ever heard about that? I live in catholic Poland, and in recent years, there were several books about other Christ’s relics than Shroud and Sudarium, and connections between them. But why to accuse Wilson that he “diverted attention from other leads”? Every track is competing with others. But in one instance I can agree, in 1991 Wilson in his book Holy Faces, Secret Places destroyed interest in the Manoppello Image in the English speaking world, despite that he present in his book multiple arguments in favour of its authenticity (which were later presented again by Badde, Gaetta and others). That’s his greatest sin I think. Fifth: Wilson isn’t perfect, I agrre. No one is. Truly I can’t find a single Shroud researcher without a sin. Everyone committed some errors. But I can’t understand such hostility against Wilson. Why? Because he is famous and well known? Jealousy? I don’t know. Sixth and the point: As I read Yannick’s posts, it is absolutely obvious to me that he has some obseesion about Wilson. No matter what the topic is, always, Wilson,Wilson, how bad greedy, awful that Wilson is! This is really an obseesion, it needs some kind of therapy, I don’t know. Everything to destroy Wilson and his Mandylion hypothesis. Personal vendetta, no doubt. I ask why? What has Wilson done to you, my dear Yannick, that you hate him so much? Just I would like to know what the problem is. Besides such attitude is definetly not Christian, my dear Yannick..","date":"2013-08-24","mins":"2:27 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41957","author":"o_k","post":"Matthias : Just on this… Does anyone know anything about the text in the Hungarian Pray Manuscript? We all know the much analysed drawings, how about the text? Might the text provide some context o the pictures? Or are the pictures elements somehow isolated from the text? Would seem unliekly to me. Maybe the text refers to the shroud? Anyone out there can shed some light on this? Text in the Pray Manuscript? Guys here it is: http://en.wikipedia.org/wiki/Funeral Sermon and Prayer.","date":"2013-08-25","mins":"2:06 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41770","author":"o_k","post":"Russ Breault : Dan, I hear dogs love this book! I gave my copy to the dog and he tore it to shreds and had great fun doing it. He seemed to be ready for another and went straight for Inquest on The Shroud of Turin by Joe Nickell. Amazing! Can I have video? ; ) Put it on You Tube!.","date":"2013-08-22","mins":"3:40 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41959","author":"o_k","post":"Not the same?.","date":"2013-08-25","mins":"2:24 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41974","author":"o_k","post":"Hugh: There was perhaps a little confusion here. No one has ever examined the Codex with his own eyes, took some high quality pictures? I don’t think the writings should be so hard to read, if take a close look. Anyway someone wrote them to be read..","date":"2013-08-25","mins":"5:51 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41983","author":"o_k","post":"Yannick Clément : Quote: “Charles, first, Yannick, with respect, has shown nothing that disproves Wilson’s hypothesis.” If this is true, then can you please read WITH AN OPEN MIND this paper of mine (https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment questions about the mandylion hypothesis of wilson 2012 06 28.pdf) and disprove one by one every single facts that I talked about (which all goes against Wilson’s hypothesis) with solid conter facts (not just speculations but facts please)… Note: Since the day I published this paper, I still wait for someone to do that! Some have challenged some points (mainly with the same speculative arguments used by Wilson, Scavone and others). Last comment: It’s so pathetic to see people becoming blind when someone is showing them proofs that contradict their preconceive notions about something that it makes me sick. Yes Yannick. I have read your paper. And I am preparing to refute it, point by point. In my opinion, no point is a deadly threat to Wilson.Several are simply the same argument, repeated again and again. With screamings: “If Wilson’s hypothesis is correct, WHY is this so ???” Most if not all of them, have already been answered in Wilson boks, just to read them again. I don’t have to give absolute proofs WHY this is so. Just plausible explanations, that keep the Wilson’s hypothesis still on the surface. Remember: lack of proof for one thesis, DOES NOT PROVE THE OPPOSITE THESIS. And as I said, Wilson’s theory is just theory. With some modifications, the one that makes most sense in my opinion. Of course you can disagree. I am from Poland, and I have written several articles about the Shroud for one of the Polish apologetics portal. You can see them here, Google translates them quite faithully into English: http://ok.apologetyka.info/ I have even gave a link to your article in one of the footnotes. When I come to write an article about the early histry of the Shroud (so far I end it at around 1200 in Constntinople), I will definetly mention and discuss your points. And as to Wilson, I will add one thing. Yannick, you wrote:”Remember that Wilson is not a professional historian.” I would say (forgeting for a moment that the guy graduated from Oxford): FORTUNATELY! You know why? Because from my experience, if I can be honest, most of the professional historians, historians of art, and especially biblical historians, are ignorant, blind, close minded, and most importantely conformist IDIOTS (of course there are some noble exeptions). That simply follow the tide, no one can move forward with brave, fresh ideas, that goes against the highly authorative society, who made their names by kissing the three letters of their predecessors. It concerns not just the Shroud, but many other issues also. You wrote: “Such a bad manner to perform historical research have contributed a lot to discredit Shroud research (including the few serious Shroud researchers out there) in the face of the scientific community, who, because of Wilson and many others, see sindonology as a big joke.” I want to tell you what I see as obvious truth: for most of the so called “scientific community”, we, the guys who are interested in Shroud research, we are simply pseudoscientic maniacs, of the same sort like those who search for UFO, Yeti or Atlantis. That is true, and that is why the Shroud is considered to be on margin of “serious scholarship”. Despite that usually the level of knowledge of those “serious scholars” about the Shroud is absolutely NULL. Why? Because the Shroud research is politically incorrect. It can shake the basis of our society. And if, for example, Wilson’s hypothesis one day is proven correct, this would be absolutely Copernican Revolution in Byzantine History, and Byzantine Art. That is why the concrete is obviously against it. They would lost their authority and their works, their papers would be nothing more than a trash. That’s I think, everything I have to say in this discussion. At least so far..","date":"2013-08-25","mins":"6:27 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42045","author":"o_k","post":"Dave: Here is a chart from Waliszewski’s book “Całun Turyński dzisiaj”, depicting Savio Waliszewski history of the Shroud, and how it came from Jerusalem to France: Waliszewski, following Savio, assumes that the Shroud of Turin is the same shroud, as depicted by Arculf in 670, which had to be kept in Jerusalem. Even if it was in Edessa, he thinks that it had been moved back to Jerusalem by 550, and the Mandylion is a distinct cloth. Waliszewski then claims that the shroud was moved around 1050 to Constantinople, and later, in 1247, brought to France by Philippe de Toucy. He also mentions Conrad of Krosigk, and Nivelon de Cherisy, who brought parts of the burial cloths from Constantinople after the 4th Crusade. What is very often overlooked, is possibility that there may have been MORE than two burial cloths in the Jesus’ tomb,not just the Shroud (of Turin) and Sudarium (of Oviedo). There could be several other cloths, perhaps even TWO burial shrouds (sometimes people were buried with two, or more). Savio Waliszewki theory may be used as an alternative to the Wilson’s, but I give more credibility to the latter (with several modifications). Yannick, of course, you can have a different opinion. I think the Shroud history may be much more complex than anyone (including Wilson, Savio, Yannick, Charles, Dave and me) imagined. As I said the problem with Shroud prehistory is not that there are no records, but that there are too many records. It may be misleading, forces us to reject some of them. Of course, what to reject is a personal decision of a scholar (no matter if his name is Wilson, or any other), and thus it can always be challenged..","date":"2013-08-26","mins":"6:10 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41986","author":"o_k","post":"No, Yannick, I don’t want to defend Wilson at all cost. And he is not semi god for me. He has a high authority in Shroud world, I agree, but it doesn’t mean he didn’t make any mistake. He made several. In fact, there is no Shroud scholar with whom I agree 100 %. And bad pro authenticity argument, is a good anti authenticity argument. There are many half baked ideas for both pro authenticity and anti authenticity. Just want to make my own honest judgment. I don’t want to decieve myself, nor anyone else. That’s all, I am going sleep, good night everyone. Best wishes Yannick!.","date":"2013-08-25","mins":"6:40 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42072","author":"o_k","post":"Charles: You mean this picture: http://pl.wikipedia.org/wiki/Plik:Ontstaan Lijkwade Giovanni Battista.png or this? Because there are different version of whether the first one was painted by G.B.della Rovera or by Giulio Clovio, and whether the second was painted by della Rovera or by Gaspard Baldouino. (Truly, I still can’t decide whether to buy the newst Wilson’s book in original, or wait for possible Polish edition). Anyway, it is not important. Just as writing that: “Della Rovere showed the elbows of Christ bent and the right hand over the left. Wilson shows the arms straight and the left hand over the right! Della Rovers shows the legs straight down on the ground, Wilson has them bent upwards. This means that the soles of Wilson’s feet are almost full on the ground while Della Rovere’s are at a higher angle.Della Rover, following the conventions of the day, has put on a loin cloth. Wilson leaves it off.” is completely missing the point. Which is that the Man of the Shroud was laid on the one half of the Shroud, and the other half covered him from the top, as those two pictures show. The rest are unimportant details, used by you to discredit Wilson. And just because “Della Rovers shows the legs straight down on the ground, Wilson has them bent upwards.”, Wilson is “not credible”, and the whole Shroud=Mandylion theory had to be abandoned! It is an absurd..","date":"2013-08-26","mins":"11:55 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42056","author":"o_k","post":"Charles:”Can any of Wilson’s fans explain why?” This is the red herring. I can find several similar tiny and unimprotant errors in any book about the Shroud. “I can only say that for myself I never accept anything that Wilson says without checking further.” Me too. But this concerns not only Wilson’s work, but any sources about the Shroud. Double, or even triple check is always recommended. This has nothing or very little to do with Wilson’s credibility. Charles those are just flawed statements of you, put forward as an attempt to discredit Wilson. In other words: propaganda directed at Wilson, to destroy his name. Eristic arguments, very often used why an opinion of X is wrong..","date":"2013-08-26","mins":"7:55 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42134","author":"o_k","post":"Matthias: Just want to remind that Wilson also thought that the rectangular shape is a lid rather than the Shroud. However he still maintained that the Pray Codex is based on Shroud (because of various other elements). It shows that there are many possible ways to interpret the Codex, which , without any doubt, share many similarities with the Shroud. Probably too many, for all of them being purely accidental..","date":"2013-08-27","mins":"10:39 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42157","author":"o_k","post":"Yannick, you have obviously right to criticize Wilson. And you are absolutely right that we cannot trust some scholars just because they are pro authenticity. There were several pro guys who are dishonest (for example Kuznetsov and Garza Valdes), but in my opinion, Wilson is not in that category. You have noted that Wilson is selective, and concealed several things. Right. But also Wilson’s critics are selective, and truly, they don’t understand the point. Remember, it is not because of Wilson the “Academia” does not take Shroud serious. No. It is because of prejudice of Academia. For them, the Shroud is nothing elese than medieval forgery (because carbon dating and lack of records before 1350), and they are not interested that it is not reproducible up to this day.They will gladly accept whatever Nickell, Garlaschelli, Schafersmann, or similar guys will say. Because it is beyond their imagination, that any relics of Christ may have survived up to this day. And in some ways, the Shroud studies are similar to UFO or ghost studies. They are also on the verge between natural and supernatural. And no serious scholar would risk his/her reputation being involved in research of supernatural. Remember also, that “Academia” cowardly adheres to some of their dogmas. One of them is that the Image of Edessa could be only small cloth with just a face image on it. The Wilson’s (but actually he was not the first one who invented it) idea that it could be more, is a heresy for them. And for that heresy, they want to burn Wilson at stake. I have read several comments about Wilson’s theory from “serious scholars” saying that it is bad. Why? Because it is bad, and I, The Great Authority say so (without involving in any factual arguments)! To be Continued….","date":"2013-08-27","mins":"6:28 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42159","author":"o_k","post":"I have read your article “Many questions concerning the Mandylion hypothesis proposed by Ian Wilson !!!” As I said, your arguments are no deadly threat to Wilson’s theory. But nevertheless, some of them are really good questions. But I know the possible answers for them. And there is one thing you should be aware. In my opinion Wilson committed one deadly sin. In his “Holy Faces, Secret Places” he disregarded one very important thing: The Manopello Image! There were probably more than one acheiropoietos! There were two, the so callled Image of Edessa, and Image of Camoulia! See this page: http://manoppello.eu/eng/index.php?go=start Now back to Edessa. I want to say something that most of the Shroudies never concerned. The Mandylion was not a real object. It was an IDEA! It never existed as a SINGLE OBJECT! No. There were several objects that played the role of the Mandylion. I believe the Mandylion transferred to Constantinople in 944 was the Shroud. But this was not the Abgar’s Mandylion! It was The Manoppello Image! The COLOURFUL image of JUST THE FACE, that looks like A PAINTING! It was later lost, rediscovered in Camulia (which was a town near Edessa) and the Shroud (which was transferred to Edessa at later period, possibly around 200 AD and rediscovered in 525 or 544) took its place! But Mandylion had always been believed to be just a face image of glorius Christ with open eyes. However, as Wilson show, it was not a problem to create anothe “Mandylion” from the Shroud. Just fold it eight times, tetrdiplon, you know. And the confusion that lasted up to this day began….","date":"2013-08-27","mins":"6:32 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42128","author":"o_k","post":"Good points Dave! There are many problems with this concept, and I said that I prefer Wilson’s theory over it. I just presented it to show that Image of Edessa theory is not the only one possible (and its opponents like Yannick, may be interested in some alternatives). I consider Savio Waliszewski theory as quite obsolete. Savio’s book (which I don’t have ) is from 1957, while Waliszewski, who is extensively using it (remember he was/is medical doctor if he is still alive, he must be over 100 years old), wrote his book in 1987 (just look at the national borders ; ) So; 1.) Waliszewski, like many older scholars, believed that the Shroud had been gradually shortened over centuries, while its part had been cut and sold as relics. Now, after Dickinson, and cubit measure of the Shroud, we know that this idea was wrong. 2.) Waliszewski (this time following Wilson) thinks that the Shroud perhaps was transferred to Edessa (about 200 AD) and discovered (as a Mandylion) in 525/544, but then immediately transferred back to Jerusalem, as an Arculf’s cloth. Is there any document supporting transfer of the Shroud to Constnatinople circa 1050? No. I don’t know any documents speaking about it. Waliszewski assumes that the transfer took place before Seljuks captured Jerusalem in 1073. However, we know (letter from Constantine VII Porphyrogennetos to his army) that burial linens were already in Constantinople in 958. 3.) Waliszewski qutes Savio that there are no records of transfer of the Shroud or Sudarium to the West following the 4th crusade. We know however, that this claim is incorrect (see Besancon hypothesis) He also mentiones Nicholas Mesarites speech of 1207, at the burial of his brother, suggesting that the Shroud is still in Constantinople. Then he mentions Conrad of Krosigk, and Nivelon de Cherisy, Hugo de Cambrai, and also Robert de Clari, who took back home some fragments of burial linens. Then he goes to Baldwin II who sent another fragment to Louis IX in 1247. We know now, however, that this fragment didn’t came from the Shroud of Turin (see Cesar Barta article: http://www.shroud.com/pdfs/n56part5.pdf ). We can be certain that there were multiple burial cloths in Constantinople in 10th 13th centuries.He assumes that the Shroud itself was brought to France by regent of the Latin Empire, Philippe de Toucy, around 1247. 4.) One of Philippe de Toucy’s descendants was Jeanne, first wife of Geoffrey. According to Savio and Waliszewski inherited the Shroud from her. One of the canons from Lirey, Wulhelm de Baserne was also relative of Philippe de Toucy. I have read Scavone and Markwardt’s articles, thanks. As I said, I prefer Wilson’s theory over Savio’s. I believe that the Shroud was in Besancon circa 1208, but I am critical of Scavone’s explanation how it passed to Geoffrey..","date":"2013-08-27","mins":"9:27 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-52534","author":"o_k","post":"Max, it happens sometimes, I don’t know why..","date":"2013-11-23","mins":"3:24 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-52559","author":"o_k","post":"In Fig 8 1, most of the red particles are found in the top right part of the picture. Here the surfaces of the thread are reddish brown and not at all “as yellow as the rest of the image fibers”. Those reddish brown fibers (serum+haemoglobin ?) are exactly what one would expect if this particular area had been soaked with blood. That’s similar argument I use in an article I sent to Dan, he will have post it by tomorrow..","date":"2013-11-23","mins":"5:38 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-196046","author":"o_k","post":"Excellent video, but contrary to the propaganda of Union Atheists Agnostics and Rationalists actually confirming forensic accuracy of the Shroud. More later..","date":"2015-04-11","mins":"6:38 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196050","author":"o_k","post":"Here you have the illustrations: I see no notable differences, except maybe that the blood of the Shroud Man was likely denser, and his body was suffering severe spasms.","date":"2015-04-11","mins":"7:37 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196218","author":"o_k","post":"It is true that the blood flows on the statue above, especially the one on the right arm, look remarkably similar to Garlaschelli and Borroni’s. They appear to have been dripped on rather than painted. However, they look nothing at all like the interwoven zig zag rivulets that we see on the Shroud. The 100 % accurate reproduction of the blood pattern on the Shroud is of course impossible contrary to Garlaschelli who stood calmly with his clean arms, Man of the Shroud was hanging on the cross with high fever, chills, dirty, sweaty, with his arms covered with blood. Any random shiver could put a blood flow in a different direction. As He was dehydrated, the blood was also likely to be denser, especially shortly before death. As I said, I see nothing in this study that would make the Shroud image anatomically inaccurate. More – I see that this study, contrary to the blusterous claims of the UAAR, managed to replicate more less the general pattern of the blood flows on the Shroud, leaving only some hard to replicate details..","date":"2015-04-13","mins":"8:21 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196214","author":"o_k","post":"Reminder: This is most likely position of the Shroud Man while He was hanging on the cross according to Ricci: All discussions about blood patterns should pertain to this, (or similar) body position on the cross..","date":"2015-04-13","mins":"7:38 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196242","author":"o_k","post":"I can show show photos and comments if necessary. If you have them, please..","date":"2015-04-13","mins":"2:45 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196288","author":"o_k","post":"Garaschelli and Borroni (and Thibault?) have demonstrated that blood will not flow along an arm unless it is well over 45 degree from the horizontal, and the speed of flow means that there is very little time for it to wriggle about as it flows. That’s not great problem, if you observe the actual shape of the blood flows on the left arm: http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=4&image=3&lon=888.0&lat=5159.0 See? Contrary to the right arm (which was nearly vertical), there is no continuous flow from the wrist wound. Instead there is a thin smudge on the upper edge of the arm (which constitutes nearly horizontal surface), and along this smudge, there are several drops falling down the arm at proper angle. All of this is, I think, perfectly consistent with the results of Garlaschelli & Borrini experiments..","date":"2015-04-14","mins":"3:49 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196241","author":"o_k","post":"Because it is anyway, experiment, with some results that should be critically analysed, no matter possible agenda. UAAR claims new experiments put Shroud’s authenticity into doubt. On the argument that forensic experts (Barbet, Buckiln, Zugibe, Hynek, Sava etc.) think different way, they can say that those experts didn’t perform experiments and base only on their opinion, while experimental data performed by Garlaschelli & Borrini show that the Shroud is anatomically inaccurate. The overtone is: you have opinions, we have results, so our arguments are more scientifically grounded, you foolish bigots. Then we (pro authenticity) need to show that their results are 1) not conclusive 2) flawed 3) show entirely different picture than militant atheists would like to see..","date":"2015-04-13","mins":"2:41 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196212","author":"o_k","post":"See also the possible problem about the origin of “blood belt”: The ‘blood belt is more likely not on the body, but blood that was spilled from the side of the body when it was lied on the right side (and not on the back, like in Garlaschelli & Borrini study). The Shroud was also likely not entirely horizontal level, but minimally inclined to the side, so that the blood flowed to the left side. See http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=2&image=4&lon=1669.5&lat=361.5 Was that “propaganda” an agenda driven experiment? Why? I want to better understand your remarks… Most likely. The mark of the sponsor explains why. They most likely made conclusions before, and performed some studies to back it up. Why? To make “scientifically backed” claims, that contrary to near unanimous opinion of medical experts like Barbet, Bucklin, Hynek, Lavoie, Zugibe etc. That Shroud image is anatomically wrong. Based on hasty conclusions from some simplified experiments, and unclear criteria (based on video published, I cannot see any results that would contradict the forensic accuracy of the Shroud). I suppose that the purpose of those experiments is to gave their followers some “arguments” of this kind into their hands. To shout lies that “Garlaschelli & Borrini experiments proved that the Shroud is a fake”..","date":"2015-04-13","mins":"7:32 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196446","author":"o_k","post":"Hugh: In these descriptions, Barbet considers only the twin flows from the wrist wound, not the flows along the arm. With reference to OK’s diagram above, there are three flows from the wound, represented as two short red arrows and one long one. Barbet considers only the shorter two. In order for blood to flow down the arm towards the elbow, his angles have to be considerably steepened. He does not seem to have considered the possibility that the arms may have been bent at the elbow at all. Nevertheless, it would be interesting if Garlaschelli and Borrini were to carry out more experiments with Barbet’s descriptions in mind. But the blood does not flow down in continuous stream on the side of the arm towards the elbow. It flows down on the upper, near horizontal surface of the arm, occasionally dropping down the arms. See: Here is the scheme: In my opinion this is consistent with Garlaschelli & Borrini results. But truly, on part because they actually didn’t simulate such flow..","date":"2015-04-15","mins":"2:36 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196490","author":"o_k","post":"O.K: Your arrows and lines on the pictures are fanciful. You retouch the pictures as you want..","date":"2015-04-16","mins":"3:13 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196651","author":"o_k","post":"I am ready to perform new simple experiments. Some ideas ? Put your blood on the upper surface of the arm just like I have indicated on illustrations, and let it flow down, unless it comes to the arm side. Let we see whether the results are comparable with the left arm of the Shroud Man..","date":"2015-04-17","mins":"5:00 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-188326","author":"o_k","post":"III CONGRESSO INTERNAZIONALE DI STUDI SULLA SINDONE TURIN, 5 TH TO 7 TH JUNE 1998 COMPARATIVE STUDY OF THE SUDARIUM OF OVIEDO AND THE SHROUD OF TURIN http://www.shroud.com/heraseng.pdf Quote from pg. 13: We could ask the following question – what is the probability that two sets of stains formed at random, at different times by different bodies, could correspond to such an extent on flat surface? Although we do not have the answer to this question yet, it is clear that the probability is very small. If we add to this the physical (time involved and formation mechanisms of the stains) and historical conditions, we are left with only one possible answer – everything seems to indicate that both cloths wrapped the same body and this body was that of Jesus of Nazareth, a Jew crucified in Jerusalem under the Roman governor Pontius Pilate on 3rd April 33 (or 7th April 30) at midday, local time, in the place called Golgotha.","date":"2015-02-02","mins":"7:09 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188319","author":"o_k","post":"Exactly Dave B, exactly. The Shroud is a central but only one piece of the puzzle..","date":"2015-02-02","mins":"6:53 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187197","author":"o_k","post":"In short, this is purely nonsensical speculation with no basis.There are no traces of any touch ups, and bloodstains are not positioned accidently but correspond to the anatomical features of the body. This level of detail seems to be far beyond the capabilities of medieval “correctors”. See: http://www.shroud.com/pdfs/ssi01part5.pdf Of course not to mention other aspects, like mentioned serum, lack of any brushstrokes, or concordance of blood type (AB) with those on other relics (Sudarium of Oviedo, Tunic of Argenteuil, Miracle of Lanciano). No, bloodstains wer not added later nor retouched.This is absurd..","date":"2015-01-29","mins":"7:40 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-189432","author":"o_k","post":"Thibault: Sorry but now I am working on another subject: J Image and 3 D. It is nice to hear that, because I too. I can help you if you want. After performing some experiments I came to some important conclusions about 3 D effect on the Shroud. I think we should reconsider it a little bit, particularly in the face area. It seems that banding effects play there much more important role than most people think. I am planning to make some presentation about it. I have a lot of material but no final document yet..","date":"2015-02-05","mins":"3:00 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188452","author":"o_k","post":"Yeah, Colin, yeah. The facts contrary to theory? The worse for them..","date":"2015-02-02","mins":"12:28 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187267","author":"o_k","post":"Colin: The idea that the TS blood is a “serum exudate of retracted blood clots” is one that should be treated with a great deal of scepticism. It appears to be based partly on a failure to see the “formed elements’ of blood, notably red blood cells or even remnants thereof. Bilirubin is far too photosensitive to survive more than a few years, even in dim light, never mind centuries. So how long? Months? Years? How much time of its history TS spent exposed to light (instead of being stored in closed casket)? A few years at max? We don’t know..","date":"2015-01-29","mins":"1:43 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187275","author":"o_k","post":"I wonder there are any living pathologists of similar eminence who are interested in the Shroud. Once was Delage, next Vignon, barbet, Hynek, Sava, Bucklin, Zugibe. Now is for example Svenson, and a few others. Old generations are passing, new generations are coming, new views, new opinions, yet major conclusions stay the same.The Shroud is pathologically flawless..","date":"2015-01-29","mins":"2:36 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187273","author":"o_k","post":"Colin: Alan Adler clearly saw the need to backtrack on his bilirubin hypothesis, but could not bring himself to make that abundantly clear. Note too that there was no attempt to attach exact time scales to bilirubin photo decomposition. So there was bilirubin or not? As we don’t know the exact timescales for bilirubin decomposition, nor the amount of time Shroud spent exposed to light (had it been just 1 % of presumed age, it would be about 20 years), we cannot exclude the posibility of its presence in the bloodstains, as positive results indicate. So this is no way to dispute the presence of the blood on the Shroud nor for postulating any touch ups. Just only to throw some confusion and unrest about the previous conclusions..","date":"2015-01-29","mins":"2:32 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188009","author":"o_k","post":"Your reply has nothing to do with our problem and my request. This is to say: Blood never runs by forming “gracious rivulets” on the hair (neither, by no menas, when transferred by pressing on a cloth). If you think this is possible, show it, please. I have already: https://shroudstory.com/2015/01/04/unique blood marks explained/ See my comment from January 10, 2015 at 9:26 am And also see another article by Rodante to see that the transfer of blood into cloth is possible in proper conditions: http://www.shroud.com/pdfs/ssi07part6.pdf.","date":"2015-02-01","mins":"4:31 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187704","author":"o_k","post":"Thomas: I think skepticism around the head wounds is justified. Surely a crown of thorns digging into the scalp under the hair would not create the kind of rivulets we see on the surface of the hair on the shroud. Surely? Surely it has has made physicians very impressed by the accuracy of those wounds, allowing them to make very detailed descriptions of injuries suffered by Shroud Man. The article of Sebastiono Rodante on this topic is a must read: http://www.shroud.com/pdfs/ssi01part5.pdf Some interesting quotes: “It is necessary to differentiate between puncture wounds caused by a thorn which was implanted in a blood vessel of the head and afterwards removed; and a wound from a thorn injuring a vessel and remaining in situ for a certain period of time. In the first case, there is the issue of blood (arterial or venous, according to the type of vessel injured) until, by the coagulative process at the point of the injury (inside the vessel and in its walls, as well as in the injured cutaneous capillaries)—until a clot forms and therefore the bleeding toward the exterior ceases. In a healthy organism, in which the coagulative factors are normal, this process takes place in a few minutes. Instead, in the Crucified of the Shroud, the crown of thorns must have remained implanted on the head for a certain period of time, either before the crucifixion or during the hours in which he remained on the cross right up until death. In this case, each thorn remaining in situ blocked the issue of blood onto the skin to some extent, depending on the calibre of the perforated vessel. But the spasms of the forehead muscle, contracting because of the pain provoked by the injurystimulus on the sensitive nerve endings and making the infixed thorn move, kept the thornwound open. If the injured vessel was a vein, there was a determination of blood in a slow and continuous flow, helped in its course by the movements of the wrinkling forehead. However, the perforation of an artery of a certain calibre (such as the frontal branch of the R superficial temple artery), by its own arterial pulsation caused movement at the point of perforation.” I would still like to know the basis for your earlier claim that the blood wounds are homogeneous. From you or anyone else. Continued silence means the evidence isn’t there? A contrario, can you give us evidence that those wounds are homogenous? If so, which ones? David Mo: The opinion of these “prestigious” physicians about blood stains is counteracted by the opinions of other “prestigious” physicians, either independent or not. The opinion or these “prestigious” physicians is refuted by personal experience of wounds and the pictures of blood trickles (two of them resented in this forum). Therefore I ask for evidence and suggest an easy experiment that could persuade me. I’m sorry if I don’t do it, Daveb. I am very busy with other works and the burden of proof is not mine. Yeah David Mo. Barbet, Ricci, Caval, Rodante and others (supporting the authenticity) are wrong, and only Baden (opposing authenticity) must be right. You asked for evidence. You have been provided with it. Nevertheless you reject it. It’s only your bias..","date":"2015-01-31","mins":"5:20 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-137694","author":"o_k","post":"Here’s his main site, but I can give links to a couple of highly informative pdfs if you want. Yes, we want. Thank you for providing a link, Colin, indeed very good site..","date":"2014-07-13","mins":"1:15 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-175392","author":"o_k","post":"Hello Nabber. Off topic. You once mentioned on this blog that some archeologist found red old blood on some artifact. Do you have some reference for that? If so, maybe it would be a good idea to send them to Dan..","date":"2014-12-09","mins":"12:55 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"id":"comment-175492","author":"o_k","post":"It is this: http://tinyurl.com/lhprbgh Thanks, Nabber..","date":"2014-12-10","mins":"3:13 am","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"}]
