[{"id":"comment-127611","author":"o_k","post":"This is extremely important info, just one day after an update on Shroud.com. I think Barrie should include it in the recent update. For now I leave to othes evaluation of those info. Unfortunately, it seems we still have no info on how the sub samples were positioned there at least couldn’t find it there. 2007 UK Freedom of Information Act, and now is 2014? I don’t understand something..","date":"2014-06-07","mins":"4:26 pm","url":"https://shroudstory.com/2014/06/07/1988-pictures-and-details-from-oxford/","cat":"carbon_14_dating","title":"1988 Pictures and Details from Oxford"},{"id":"comment-173632","author":"o_k","post":"Louis: Chapter 7 entitled “What’s in a date?” in Ian Wilson’s book “The Shroud. Fresh light on the 2000 year old mystery” gives the reasons why carbon dating is not advisable and he does mention the views of the late John Tyrer, textile expert who worked in Manchester, about the problem of contamination. Sorry, but this chapter is actually a trash, really. Unfortunately 20 years after dating Wilson still didn’t understand basics of carbon dating, nor specifics of that particular 1988 dating of the Shroud, nor the idea of reweave hypothesis by Benford, Marino, Rogers and others, and stuck to the old and long refuted concepts. Joe: Although I believe the evidence is very strong that there was reweaving in the C 14 area, that doesn’t preclude having my opinion that because of the unique nature of the Shroud and the problematic nature of C 14, that the test probably shouldn’t have been done. What’s so unique in the Shroud with regards to the carbon dating? We tried it once, unfortunately we came across interpolated sample, the results were not satisfactory, we had bad luck, it happens, sorry. Why not try once again? But this time with wiser, transparent approach, no blind tests. Remember , to skew a date from 1st to 14th century we need 66 75 % non original material (a simple calculation). That’s really big amount! If we don’t hit unlucky area again (and if we take more than one sample from different areas, we shouldn’t) the results should be 1st century or close. The carbon dating is not so unreliable as they paint it, actually it is more foolproof than fool vulnerable. It’s ridiculous that one questionable test is given so much weight. As I explained above, it is the only serious non authenticity argument. And fanatical anti authenticity desperately needs anything, even a failed scientific examination as the “proof” that the Shroud is a fake. That’s also why I would like the carbon dating repeated. Let it turns 1st century, then I would like to see their mugs. Hugh: The argument that C14 dates are often wrong and that therefore radiocarbon dating cannot be relied on is ilogical and untrue. Agree. I, on the other hand, would stake several dollars that any new radiocarbon test would confirm a medieval date. I would rather put it this way, there is a good bet that the results of another C14 test would be entirely different than those obtained in 1988. I do not claim that right on 1st century target, but different, and probably closer to the 1st century than 14th. Perhaps 1st, but also slight deviations (2nd 3rd century) may be possible..","date":"2014-11-29","mins":"1:55 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173589","author":"o_k","post":"Sorry , but I disagree on this issue. I am fairly conviced that if the C 14 test is repeated and samples taken from a few different “secure” areas (not for example those unfortunate corners), the results would be 1st century or close. Aside from everything that went wrong in 1988, the reason for anomalous 14th century dating was not the breaking of the protocols, lack of precise information on weights and sizes of the subsamples, not lack of additional research, not even conspiracy of some dark forces but extremely unlucky choice of the sample. Had other area been chosen, the result would be probably entirely different most likely proving 1st century provenance. We simply had terrible bad luck that rewoven fragment was sampled. Such things unfortuantely happen. As Murphy law states: anything that can go wrong will go wrong. As Shroud has went multiple examinations, it was obvious that sooner or later something would go wrong not due to the fault of the Shroud, but erronous examination and the results of those erronous test would be used by sceptics as a “proof” that Shroud is a fake.They desired that, so to their satisfaction they saw it happen..","date":"2014-11-29","mins":"7:54 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173654","author":"o_k","post":"But Joe, you certainly know the amount needed to skew results from the 1st century to 14th.(and you know how to calculate it). That is 66 75 % of non original and very modern (16th 20th century) carbon overwhelming majority! It is not like the small contamination by cigarette ash will turn everything upside down! In 1988 we simply had extremely bad luck. Probably had the sample been chosen from area a few cm away, the results would be close to the 1st century! That’s why reweave hypothesis is the only reliable (and quite obvious)explanation of what happened then. The Shroud has been anything but undisturbed for over 500 years and has been in a fire. The Shroud, has been marvelously well preserved compared to other similar cloths which are relaibly dated by C 14 method. You have read the reports about cleaning Shroud samples, the external contamination of the sample was minimal and shouldn’t have any significant effect on the results. Even 1532 fire shouldn’t have great effect, as it affected only a few areas and there is no evidence for some large interchange of carbon atoms with enviroment! As several people at the conference pointed out, if another C 14 test was done and didn’t come out 1st century for whatever reason, the case for the Shroud’s authenticity would effectively be over. And if otherwise, the Shroud’s authenticity would be hard to deny! Let the sceptics be flat Earth believers! We know what went wrong in 1988. All we have to do is simply not to repeat those mistakes. There were many opportunities for the case of authenticity of the Shroud to be over. Had STURP in 1978 found significant traces of paint, the case would be over. Had there be image below blodstains the case would be over. Had there been brushstrokes, the case would be over. Had the bloodmarks proved to be pigment, the case would be over. And so on. Remmeber, the first blood tests in 1973 were negative (this is used by sceptical propaganda up to this day)! Only improved tests from 1978 showed them to be real blood. That’s why I opt for repeating carbon dating. I don’t believe it will turn 14th century once again. Simply I know that 1988 went wrong, I know why it went wrong, and the odds that such unfortunate accident will repeat are in my opinion very small. Just sample a few different areas..","date":"2014-11-29","mins":"5:21 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173844","author":"o_k","post":"No, Louis, you don’t understand what I mean. I simply think that the Resurrection didn’t change the amount of C14 in the Shroud. In my opinion there is no correspondence between miraculous Resurrection and C14 amount and whether we are carbon dating the 1st century Shroud of resurrected Jesus, or 1st cnetury shroud of any other individual, the results should be similar if only the procedure and samples are right. And, before I forget, if the fresh C14 test you are eager to see gives a medieval date will you give up Shroud studies and say the relic is a fake? IF. If grandma had a moustache… I don’t play this. When another C14 dating is made, and the results published then we will be thinking about it..","date":"2014-11-30","mins":"12:20 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173828","author":"o_k","post":"Louis: If the Shroud did indeed wrap the body of Jesus, then no amount of carbon dating will give correct results. Non sequitur. There is no proven relation between the body of Jeus being wrapped in the Shroud, and the C14 amount. If Jesus was once wrapped in the Shroud, the Resurrection event would have affected the cloth permanently. Perhaps. Or perhaps not. Personally, I don’t believe the Resurrection affected C14 amount..","date":"2014-11-30","mins":"11:10 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-192775","author":"o_k","post":"Dear reader. The whole “refutation” by Jackson of the reweave theory is actually one single sentence taken out of the context from the short article that was written by Jackson on the request of Barrie Schwortz. As Barrie writes on his page: David Rolfe’s 2008 BBC documentary features physicist John Jackson, co founder of the 1978 STURP team and founder of the Turin Shroud Center of Colorado, and discusses his new hypothesis regarding the 1988 radiocarbon dating of the Shroud, based on possible c14 enrichment of linen due to the CO (carbon monoxide) in the atmosphere. According to Jackson, a 2% contamination could skew the resulting date by as much as 1400 years. Rather than attempt to describe Jackson’s theory myself, I asked John to write a short article to describe it in his own words. The article can be found there: http://www.shroud.com/pdfs/jackson.pdf We read there: While this hypothesis has been argued on the basis of indirect chemistry, it can be discounted on the basis of evident bandings in the 1978 radiographs and transmitted light images of STURP. These data photographs show clearly that the banding structures (which are in the Shroud) propagate in an uninterrupted fashion through the region that would, ten years later, be where the sample was taken for radiocarbon dating. Aside from some personal considerations (reweave theory was rival for his own carbon monoxide theory, and was proposed by Rogers, with whom Jackson was at odds), not everyone agrees with Jackson assesment of those data. Alan and Mary Whangers claimed in their presentation from 3rd International Dallas Conference on the Shroud of Turin (http://www.shroud.com/pdfs/whanger.pdf ): To help clarify this issue, we examined in detail the area of the C14 specimen on the radiographs. An irregular band of threads with increased radiodensity and extending variably about 5/8 inch (1.7 cm) into the Shroud fabric is noted immediately adjacent to much of the length of the seam that borders the frontal MC. In a close up view of the area where the Raes sample and the single C14 sample were taken, irregularities in some of the weave pattern can be noted on the Shroud fabric adjacent to the seam. (Figure 18) There is significant variability in the radiodensity of both warp and weft threads in this area. Some of the threads angulate, and the continuity of a few seems to be broken. This area is denser and the 3:1 herringbone weave pattern is much less obvious than in the nearby body of the Shroud fabric. Our conclusion is that the radiographs are strongly suggestive of significant alterations in the threads and weave of the Shroud fabric in the area from which the C14 specimen was taken, thus casting major doubts on the validity of the radiocarbon dating. Besides as Hugh described, the patch consist probably of the new threads spliced and glued together with the old. This suggest that repair might have passed unnoticed on the STURP radiographs and transmitted light photographs as there would be (appaerent) continuity of the threads. Beside such continuity is observed also between side strip and main body of the Shroud, even despite we know that they were originally separated (see http://www.shroud.com/adler2.htm ). ..","date":"2015-03-08","mins":"7:06 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192805","author":"o_k","post":"1. It depends on the patch configuration. No one has determined the patch borders at least so far. But I have some gut feelings and sent some materials to Thibault and Joe, and I plan to work upon that. 2. Theoretically yes but it is hard to obtain. The greatest obstacle was, that depending on contamination/interpolation date, about 66 75 % of the carbon content of the samples should be new carbon to skew the date from 1st century to 1260 1390 AD. That leves the reweave hupothesis as the only realistic one. 3. It all depends on the relation between new and old material/threads something which is currently unknown. But as I say, up to 75 % material should be modern (introduced between 1500 1900 AD), for the 1st century date being a real possibility..","date":"2015-03-08","mins":"12:50 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192822","author":"o_k","post":"What neither he nor anybody else seems to have noticed is that the near perfect correlation between the supposed contamination, as revealed by the green corners in both Quad Mosaic and Morgan false colour photos, is inverse, so that the less contaminated sample (Arizona) came out with the youngest date, and the more contaminated sample (Oxford) came out with an older date. Hugh, I have noticed. And I have probable explanation for that fact. I have sent some materials on this matter to Thibault and Joe, and await their assesment before I will voice my opinion on that matter..","date":"2015-03-08","mins":"3:35 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192836","author":"o_k","post":"The point is that quad mosaic actually adds little to our knowledge, it shows that this particular reason is different, which is evident even for the naked eye. The whole question is: what does it actually mean? Contamination? Reweave? Presence of dye (for what purpose), which was confirmed by Rogers direct examination of the samples?.","date":"2015-03-08","mins":"5:30 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192835","author":"o_k","post":"One could say that John Jackson did not refute reweave hypothesis, but in two sentences stated he does not believe it, giving radiograms and transmitted light photographs as justification for his view. Whangers interpret them in other way. Of course one should also take into account, that Jackson had a purpose to dismiss the reweave theory had he accepted it, the whole his ‘new radiocarbon hypothesis’ about carbon monoxide would have no rationale for being proposed..","date":"2015-03-08","mins":"5:27 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192882","author":"o_k","post":"Dave B: Who needs to care what the specific fault is with a non representative sample? Me, for example. Enough questions and enough doubts have already arisen, and the 1988 radiocarbon dating ought not to pose any challenge to evidence for authenticity. Unfortunately, it is not that simple. Because the main problem is not whether 1988 C 14 dating is faulty, but whether it is possible to skew the results from 1st century to medieval. The issue of 1988 C 14 dating requires answering several questions: 1. Are the 1988 test results reliable? The clear answer is NO, they are not reliable. The statistical considerations (X^2 and other statistical tests, presence of gradient among dates), as well as considerations about the region (various anomalies, compared to the centre of the cloth) clearly show us that the results are unreliable and cannot be trusted. But the next question is: 2. Are the 1988 test results wrong? The answer is PROBABLY, based on the tests itself, and Yes based on other considerations. Remember, even badly performed measurements can give true results. To know if the 1988 date is wrong, we need other, historical, chemical etc. Data that would prove the Shroud must be older. Here we have those data (Robert the Clari account, Hungarian Pray Manuscript, Rogers’s vanillin) showing that the Shroud must be much older. But the next question is: 3. Does the Shroud date to the first century? The answer is WE DON’T KNOW. The problem is that most people consider only two options, either the Shroud dates to circa 30 AD, or it dates to circa 1350 AD. But this is oversimplification. Even with the wrong results of the 1988 tests, the Shroud could still be a fake from another era, from the 4th, 6th, 8th century. So the next question is 4. Could the Shroud date to the first century? The answer is also WE DON’T KNOW. To determine that, we should determine whether it is possible to skew the dates from the 1st century to 13th century. For today, given the 66 75 % treshold of the new material introduced, if the 1st century date have to be maintained, and given all the facts we know, the only realistic option for this to be true seems the reweave theory..","date":"2015-03-09","mins":"4:16 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192975","author":"o_k","post":"Dave: The tragedy would be if we were certain that 1988 dating was wrong, yet there was no physical possibility to be as much as 1300 years wrong (being “just” a few centuries wrong still satisfies preconvinced sceptics)..","date":"2015-03-09","mins":"2:10 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192961","author":"o_k","post":"For what I know, Whangers are usually ignored, because of their sometimes bizarre “I think I see” claims. In fact I can’t recall any particular reaction to their paper. In short: Whangers think their way, Jackson thinks his way, Hugh thinks his way, everyone thinks own way, and considers his/her way the best. That’s how the situation looks like nowadays. Everyone is playing separately in its own part of the playground, without much interaction with others..","date":"2015-03-09","mins":"12:38 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192955","author":"o_k","post":"Remember that Whangers’ paper (2005) preceeded Jackson’s article (2008). But neither can be described as the final scientific word on this issue. They just represent the views of their respective authors. The other thing is that sceptics of course took those couple sentence from the short Jackson article, and presented them as the Holy Truth in Wikipedia and other media (http://en.wikipedia.org/wiki/Shroud of Turin#Radiocarbon dating ). I would say that Wikipedia article is somehow biased on this issue aside from being a mess to the large extent. But the problem is that there are several guys watching so that Wikipedia is presenting their view..","date":"2015-03-09","mins":"11:51 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193034","author":"o_k","post":"There is no clear answer for that question. We have no data to estimate that. In fact all dates are theoretically possible right now..","date":"2015-03-10","mins":"6:26 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192970","author":"o_k","post":"And Joe, what is your position on that issue?.","date":"2015-03-09","mins":"1:28 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193050","author":"o_k","post":"Richard: – But, doesn’t that contradict the 95% confidence level? No, confidence level is actually entirely different thing: http://en.wikipedia.org/wiki/Confidence interval It is the probability of the true result being within the mentioned interval (1260 1390 AD in this case), assuming that measurements were performed correctly. If measurement were done incorrectly (which is most likely the case here), 95% confidence level is meaningless then..","date":"2015-03-10","mins":"9:57 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-47907","author":"o_k","post":"Hugh Farey : The main problem with the re weaving hypothesis is that there isn’t any re weaving. It accounts for the C14 error, the history of the shroud makes it likely, and the discovery of cotton seems to suggests its possibility, but the close up photos of two of the sample pieces, together with a close up photo of the area immediately adjacent, show that it just isn’t there. From: http://www.shroud.com/pdfs/marben.pdf “A blinded analysis of a photograph of the Zurich C 14 sample, by Thomas Ferguson & Co. Ltd, world renowned makers of Double Damask Linen, resulted in their perception that the sample was “touched up to prevent unraveling.” They further observed, “We have to say that we see the twill pattern clearly on both sides, but still there is something different left versus right.” (Ferguson & Co., 2000) In a second blinded examination of photographs of both the Zurich and uncut C 14 samples, European trained weaver David Pearson, owner of the French Tailors in Columbus, Ohio, immediately recognized the disparate weave pattern and differences in thread size, stating “there is no question that there is different material on each side…(B)It is definitely a patch.(/B)”[(referring to what we have highlighted in Figure 2 as the pink section)] (French Tailors, 2000). He stated that medieval European weavers would typically try to match the original cloth and then hand stitch approximately ½ inch of new material into the old, such that it was invisible to (B)all but the trained eye(/B). This would ensure the long term integrity of the material, while maintaining aesthetic consistency throughout the fabric. This type of detail to repairs would be consistent with the wealth and devotion of the Savoy family, who owned the Shroud at the time. In a third blinded analysis of the Zurich C 14 sample, by Albany International, Louise Harner remarked that “the float is different on either side of the sample” (Albany International Research Company, 2000). It forms a thick/thin, thick/thin pattern on the right side, whereas the left is much more consistent throughout (see Figure 6). This is probably due to the fact that each side of the pattern was woven independently, possibly corroborating Pearson’s belief that part of the sample was a patch.” All boldings mine..","date":"2013-10-18","mins":"2:07 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47920","author":"o_k","post":"But the book claims that technique described in it is really invisible, and can explain all what we know about 1988 C 14 datingor needs some modifications to adjust it to the now known facts?.","date":"2013-10-18","mins":"3:52 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47909","author":"o_k","post":"So I found that (B) and (/B) (I) doesn’t work (/I), maybe (b) and (/b) ?.","date":"2013-10-18","mins":"2:08 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47906","author":"o_k","post":"Charles Freeman : Perhaps someone can quote from Rogers’ article the part where he shows that the threads themselves are different from the rest of the Shroud and the evidence he provides for this. I have found it difficult to find. He just seems to assume it rather than provide evidence of his own. Has anyone found enough cotton threads to make a difference to the date? The gum that he notes could have been added at any time to an original cloth as, apparently, this was a standard way of protecting cloth that might otherwise have decayed again can someone quote the evidence that he provides to prove that the gum was a dye and not simply a means of strengthening an old cloth. “A gum/dye/mordant coating is easy to observe on Raes and radiocarbon yarns. No other part of the shroud shows such a coating. The early thermal evolution of furfural during pyrolysis/ms analyses, the relatively easy water solubility, the yellow color formed with iodine, and the easy hydrolysis suggest gum Arabic. Gum Arabic is obtained from Acacia senegal and is composed of pentose sugar units. Its presence as a major component in the coatings on the Raes and radiocarbon samples is not a surprise, because it has long been a common vehicle in tempera paints. The radiocarbon sample had been dyed. Dyeing was probably done intentionally on pristine replacement material to match the color of the older, sepia colored cloth. The gum is probably the same age as the Raes and radiocarbon yarn and should have no effect on the age determination. In any case, this water soluble, easily hydrolyzed gum would have been removed completely by the cleaning procedures used on the dated samples[1]. The dye found on the radiocarbon sample was not used in Europe before about a.d.1291 and was not common until more than 100 years later [6]. The combined evi dence from chemical kinetics, analytical chemistry, cotton content, and pyrolysis/ms proves that the material from the radiocarbon area of the shroud is significantly different from that of the main cloth. The radiocarbon sample was thus not part of the original cloth and is invalid for determining the age of the shroud. Because the storage conditions through the centuries are unknown, a more accurate age determination will require new radiocarbon analyses with several fully characterized and carefully prepared samples.”.","date":"2013-10-18","mins":"1:54 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47927","author":"o_k","post":"“A gum/dye/mordant coating is easy to observe on Raes and radiocarbon yarns. No other part of the shroud shows such a coating.” (emphasis mine).","date":"2013-10-18","mins":"4:20 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47931","author":"o_k","post":"As to Jackson and Antonacci, they are somhow biased. Antonacci believes that if increased amounts of certain isotopes (C14, Ca41, Cl36, Cr53) are detectedin the cloth, this would be a direct evidence of Jesus’ Resurrection. And Jackson promotes his another, competitive theory about carbon monoxide contamination (see http://www.shroud.com/pdfs/jackson.pdf ) so he wants to dismiss re weave theory. However, he is not so firmly against it it is mentioned in Siefker&Spicer paper (although it is obviouis that Jackson stays behind it) see http://www.shroudofturin.com/shroud.html However, sceptics love to take Jakcson’s citations out of context. Just see English Wikipedia..","date":"2013-10-18","mins":"4:34 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-48003","author":"o_k","post":"“The combined evidence[emphasis mine O.K.]from chemical kinetics[that means vanillin O.K.], analytical chemistry, cotton content, and pyrolysis/ms proves that the material from the radiocarbon area of the shroud is significantly different from that of the main cloth.” + * three blindly revieved experts claimed that the sample was, manipulated. * spliced threads found in the sample * unacceptable Chi^2 value * probable spatial heetrogenity of the sample as suggested by Fanti, Crossilla, Riani et Atkinson (the most reasonable explanation is different ratio of new vs old threads in different parts of the sample) Little?.","date":"2013-10-19","mins":"6:27 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47922","author":"o_k","post":"Daveb of wellingon nz : in the decision to allow a textile expert, Mme MF, totally ignorant of the subtleties of the TS, to participate in the decision of sampling location MF didn’t participate in decision of sampling location. She was suggested by Chagas, who was Gove’s fellow, and thus rejected by Gonella due to animosities between the two. Genrally dirty politics screwed the whole operation from the begining, and it is not important who is more guilty of that..","date":"2013-10-18","mins":"4:05 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47910","author":"o_k","post":"O.K. : So I found that (B) and (/B) (I) doesn’t work (/I), maybe (b) and (/b) ? Now I hope it should work.","date":"2013-10-18","mins":"2:09 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-48029","author":"o_k","post":"Also from: http://www.ohioshroudconference.com/papers/p09.pdf In terms of the C 14 area in relationship to the water stain, which has been posited to be much older than the 1532 fire and also impacted the sample area (31), photo analysis demonstrates that this latter assertion is incorrect. This photograph, when placed next to an image showing the location of the reserve versus C 14 sample, clearly demonstrates that the entire C 14 sample area was outside the water stain region. The crease can be used as a marker to compare the two photographs and location of the C 14 sample. Further, it is also notable that the reserve sample does not appear to have any water stain markings. According to the illustration of the water stain area, the stain should have gone directly through the mid section of the reserve sample forming a distinct marking discoloration. Since the sample does not show any evidence of a water stain marking, this could very well be explained by the later addition of a patch in this area. Emphasis mine..","date":"2013-10-19","mins":"10:30 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-48027","author":"o_k","post":"Hugh: The comments from invisible weavers mentioned by OK in the Benford/Marino paper are at best unconvincing. It’s not at all clear what they were given to comment on. Was it that very unsharp photo of the Zurich sample that accompanies the paper? If so, the few irregularities noticed by the ‘experts’ are nothing like enough to establish a patch. Do you really think that they showed to the experts this compressed to minimize its size photo that is included in pdf version of their paper? Even the writings on the other figures in this document are not clear enough to be easily readable. But I suppose the original illustrations actually were. If the patch was anything like that illustrated, then at least two of the Arizona dates, and at least two of the Zurich dates, would have been pure, unadulterated patch, while the others would have almost pure shroud. This is not in accordance with the actual dates found. From: http://www.shroud.com/vanhels3.htm “I asked the British Museum for some explications. Dr. Morven Leese explained the LOW Arizona errors as follows : Arizona did not send in FOUR, but EIGHT “paired” dates, each pair measured the same day, with the same set of standards and blanks. The EIGHT “dependent” dates were combined in FOUR “independent dates, given in Table 1 (Nature). Each pair of DEPENDENT dates are combined into an INDEPENDENT date.” What guarantee do we have that other raw data were not manipulated to give the “proper results”? None. And in fact , laboratories and British Museum have all the cards in their hands, they can give us conflicting accounts how the measures were performed, and samples cut, adjusting them to any proposed patch theory. Maybe this seems a little bit conspiratory, but very likely the statistical analysis of raw data was somehow manipulated. Stephen Jones also thinks so. Gonella and Turin Colonetti’s Institute refused to sign the result of the analysis. See also: http://www.ohioshroudconference.com/papers/p09.pdf “Also in the ventral missing corner section, which we hypothesize to consist of restorative surface dyes and what was likely an undocumented “invisible” medieval repair, is the section from which the 1973 Raes sample was extracted for analysis. In this sample, Raes found that the side seam had been attached to the adjacent main Shroud by a 2 ply linen sewing thread (18).By removing the sewing thread, Raes was able to separate his sample into two distinct pieces, which he identified as “Piece 1” and “Piece 2.” Each piece exhibits different characteristics, such as cotton content, lignin content at the growth nodes, and thread size, suggesting two different origins of the yarns.”.","date":"2013-10-19","mins":"10:25 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-48038","author":"o_k","post":"Hugh Farey : Arizona seems to have set aside the thinnest piece of the two samples it received, and cut the other one in half. According to Marino and Benford’s patch hypothesis, Figure 2, one of these halves was pure patch, and the other one mostly shroud, with a little bit of patch at the top. One of these halves was set aside (later to be studied by Freer Waters). And do you understand now, why Jull and Freer Waters claim, that contrary to Rogers, they found no anomalies, no dyes, minimal amount of cotton, in their sample? If this had been the one mostly the original shroud….","date":"2013-10-19","mins":"12:43 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-48030","author":"o_k","post":"Charles Freeman : Who has provided a ratio of old versus new threads in any sample from the Shroud? Who has found an actual cotton thread? Why use cotton THREADS, if there are any, rather than linen threads to make repairs? My point about Roger’s paper not being secure is that there are too many questions left open and assumptions made without sufficient evidence to evaluate them. Rogers tries to cover a lot of ground but only provides ten references for the whole of his paper. It just left me with questions that are unresolved. From: http://www.shroud.com/pdfs/thibaultr7part3.pdf Except perhaps the amount of cotton, all that I found is consistent with Raes’ claims: Gossypium herbaceum inside the linen thread. However, given the amount of cotton I found, there is another possible hypothesis: the mixture could have been the result of a willful act. The spinner could have spun together flax fibers with some cotton fibers as it was sometimes carried on in the Middle Ages (and this is still the case today). This would be consistent with Rogers’ finding of a unique dye on Raes/radiocarbon fibers because cotton is known to retain the colors much more easily than linen..","date":"2013-10-19","mins":"10:46 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47933","author":"o_k","post":"At that time she was not involved in carbondating process, as she was moved away by Gonella, because being suggested by Chagas. Instead, he took Vial & Testore who were really green about TS! So far I remember one of the suggested taking sample from the patch (!), another pointed chest wound and asked: what is that brown stain? (!). They ultimately became experts in TS but post factum. As to MFL, she was not present, and IMHO she is not ignorant, but wants to save reputation of Archidiocese (which organized sampling) and her colleagues..","date":"2013-10-18","mins":"4:40 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-48045","author":"o_k","post":"But who said that the patch must go into straight line? Hugh, draw the division of the sample, and post it somewhere. I still think the patch consists rather of mixed 1st and 16 19th century threads, and the results are average of them. But with little info it is hard to guess how the patch goes..","date":"2013-10-19","mins":"1:37 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-48127","author":"o_k","post":"No, just the threads used must resemble original as much as possible, so usually threads from the same fabric are used. But it was not possible in case of the Shroud repairing one damage would create another in different place of the precious cloth..","date":"2013-10-20","mins":"11:05 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-48141","author":"o_k","post":"Hugh Farey : 1) Nails through the wrists. Whatever the shroud shows, very few artists have copied it. This is not evidence that the shroud was known about before the 13th century. Remmeber Jerome’s manus and authority of his Vulgate Hugh Farey : 2) The crown of thorns. Barbet was probably the first to suggest that the shroud shows a cap rather than a wreath. It appears that practically no artist agrees with him, before or after the 13th century. This is not evidence that the shroud was known about before the 13th century. Remember the Crown of Thorns purchased by Louis IX which was just a twisted circlet, because thorns had already dropped off! Generally very few illustrations before 13th century show crucified Christ with the Crown of Thorns still on His head (the Gospel say nothing about that), and no representation before 1147 show Christ crucified with one nail across both feet. There is radical revolution in representation of Christ passion around 12 13th century, at the time when TS was supposedly in Constantinople..","date":"2013-10-20","mins":"12:27 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48122","author":"o_k","post":"Yes, but could all other explanations be ruled out at this point?.","date":"2013-10-20","mins":"10:49 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48107","author":"o_k","post":"Yes, it is intrigueing, but what about other miniatures in this mansucripts? There are several crucifixion representations in Stuggart Psalter, and they are quite conventional, with little direct cnnection to the TS..","date":"2013-10-20","mins":"9:23 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48143","author":"o_k","post":"You know, for some time I look at the crucifixes in churches and along the roads. 90+ % of them show Christ’s feet nailed with a single nail. And around 75+ % them have the right feet above the left, just like it is represented on the mirror image on the TS..","date":"2013-10-20","mins":"12:40 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48140","author":"o_k","post":"Max Patrick Hamon : O.K., iconographically speaking, then how can you account for the early miniaturist pre forensic insight/premonition/knowledge (if he was not depicting the burial Shroud dorsal image)? How could he possibly be so accurate in his rendition in such a minimum space as that of a miniature while not being a medical examiner and without having any TS negative photographs at his disposal then? Enough with mystery. Let’s face the facts. The image in the psalter is intriguing, but is it evidence or just a clue? A sceptic, like Hugh or Collin, would go this way: * pre forensic insight/premonition/knowledge: flogging was practiced in every epoch, and maybe an illustrator just saw someone being flogged and showed effects of this on the image. Besides it is hard to say something about “accuracy” presented on the image, just a few horizontal marks painted to represent scourges. * position of the flogged Christs, there are thousands of illustrated manuscripts so it is possible that on one example the location of the arms and feet, the representation of the naked Christ etc. Would be the same as on the Shroud. However, in the second point I can see at least three similarities with the Shroud presented simultaneously (nudity, position of the arms, position of the hair, position of the feet is represented in wrong way). Can we estimate what is probability of obtaining those by pure chance?.","date":"2013-10-20","mins":"12:17 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48150","author":"o_k","post":"Hugh Farey : The dorsal image of the shroud very clearly shows the imprint of the sole of the right foot, and not that of the left, showing that the left foot was on top of the right foot…. Remember that TS positive image (the one that can be watched with naked eye) is a mirror one.","date":"2013-10-20","mins":"3:51 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48160","author":"o_k","post":"Turn the photo upside down and you see. The chest wound which was actually on the right side here is on the left contrary to usual depiction, which is reference to Ezekiel as far I remember. The positive image is a mirror one, negative is the correct one..","date":"2013-10-20","mins":"5:59 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48152","author":"o_k","post":"And by the way, see http://en.wikipedia.org/wiki/Crucifix and galleries: http://commons.wikimedia.org/wiki/Category:Crucifixes.","date":"2013-10-20","mins":"4:01 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48157","author":"o_k","post":"Louis: According to the latin verison of Life of Adam and Eve, Adam was buried with three shrouds, so it is entirely possible that more linens were used: See http://www.pseudepigrapha.com/pseudepigrapha/adamnev.htm XLVI 4: And the Lord said again to the angels Michael and Uriel: ‘Bring me three linen clothes of byssus and spread them out over Adam and other linen clothes over Abel his son and bury Adam and Abel his son.’ See also: Remi Van Haelst, THE SINDON MUNDA OF KORNELIMUNSTER, COMPIEGNE AND CAHORS http://resurrectionnowinc.blogspot.com/2011/01/shroud images throughout world.html.","date":"2013-10-20","mins":"4:57 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48163","author":"o_k","post":"Hugh Farey : This only applies to the ventral image. On the dorsal image, which is the one which slows the feet most clearly, of the right foot is the clear one. Hugh, you really don’t realise it, or just don’t want to admit? Look once again. I am quite certain, I did it many times..","date":"2013-10-20","mins":"6:22 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48164","author":"o_k","post":"Truly, I work alone, on rather amateur basis. But maybe in the future? I tried to contact some other researchers, but got no answers so far. If I get more time, more contacts, more friends, more attention….","date":"2013-10-20","mins":"6:25 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48193","author":"o_k","post":"Gian Marco Rinaldi : Hugh: “it is clear that it is the right foot whose imprint is on the shroud”. Of course. Nothing can convince sceptics that left is left and right is right, and mirror left is right, and mirror right is left..","date":"2013-10-21","mins":"4:38 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48198","author":"o_k","post":"Matthias : Hugh is absolutely right Hugh is absolutely wrong, look once again at mirror positive image. The right foot seems to be on top of the left, but it is o f course wrong impression since it is a mirro one..","date":"2013-10-21","mins":"5:34 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48199","author":"o_k","post":"See:.","date":"2013-10-21","mins":"5:44 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48207","author":"o_k","post":"Matthias, and others, see: http://img707.imageshack.us/img707/3316/yqpm.jpg Of course left is above the right, but on the positive image it is REVERSED and that’s what is seen by naked eye. And that’s why most crucifixes show right over the left, opposite what was in reality, and what is seen on the negative images which show the things correct. Hard to understand?.","date":"2013-10-21","mins":"6:44 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48215","author":"o_k","post":"Matthias, and others, see: http://img707.imageshack.us/img707/3316/yqpm.jpg Of course left is above the right, but on the positive image it is REVERSED and that’s what is seen by naked eye. And that’s why most crucifixes show right over the left, opposite what was in reality, and what is seen on the negative images which show the things correct. Hard to understand?.","date":"2013-10-21","mins":"7:22 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48263","author":"o_k","post":"Look once again: Does everyone now understand? Hugh: So go back to your churches and your roadside crosses. OK says that 75% of them have the right foot on top of the left, in direct contradiction to what is shown on the shroud. Can this be true? Yes, exactly, in direct contradiction because positive image of the Shroud is actually a mirror image! That’s why 75 % or so crucifixes since about 13th century show right foot on top of the left, contrary to what Barbet, Bucklin, Zugibe and others say! Because they work on negatives! See http://en.wikipedia.org/wiki/Crucifix and galleries: http://commons.wikimedia.org/wiki/Category:Crucifixes Large majority of them have right foot on top of the left. But before 1147 there was no example of crucifix showing feet nailed to the cross with a single nail. Nobody imagined it..","date":"2013-10-21","mins":"12:04 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48267","author":"o_k","post":"Actually, I could find only one example of crucifix with left foott over the right, overwhelming majority of them have right over the left, or in rare instances, both feet are nailed separately this is the case of all crucifixes before 13th century. See also: http://commons.wikimedia.org/wiki/Category:Paintings of Crucifixion of Christ.","date":"2013-10-21","mins":"12:27 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48274","author":"o_k","post":"Manus used by Jerome in John 20,25 and 20,27 can mean either hand or palm. Up to 20th century Vulgate was considered the most authorative version of the Bible in the Catholic Church..","date":"2013-10-21","mins":"1:12 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48271","author":"o_k","post":"Colinsberry : If generations of artists pre 1357 had seen the Shroud, as we are led to believe, then the wrist wound would have become a standard in Western art, and David Rolfe and others would have one fewer “clinching” point to make in their TV documentaries. The fact that the palm wound was seen as standard can be taken as evidence that no artist had seen the Shroud prior to its display at Lirey, sufficient to influence their art. Remember Jerome’s manus and authority of his Vulgate..","date":"2013-10-21","mins":"1:00 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-46089","author":"o_k","post":"The other candidate is Blessed Sebastian Valfrè who performed some repairs in 1694..","date":"2013-10-03","mins":"5:02 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46093","author":"o_k","post":"Hugh Farey : Alternatively, we can visit http://dwb4.unl.edu/Chem/CHEM869 Z/CHEM869 Z Links/www.all.mq.edu.au/online/edu/egypt/carbdate.htm, which does all the fiddly stuff for you so you can concentrate on percentages. This is something a little bit different than what I presented. The interpretation of those percentages is DIFFERENT than what I marked as X. And also DIFFERENT form 2 % about which Jackson speaks in his paper: http://www.shroud.com/pdfs/jackson.pdf However the three things are frequently confused..","date":"2013-10-03","mins":"5:12 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46096","author":"o_k","post":"Daveb of wellington nz : Thanks, O.K./Hugh, I actually understand all that stuff quite well, as I once had more mathematics than any one civilized human being ought, but am now a little rusty. Query: I’m under the impression that the simple inverse exponential D.E. Doesn’t tell the whole story because of sporadic changes in atmospheric C 14, e.g. Nuclear bomb tests, sunspot and cosmic activity, so that a specific calibration curve is also required, or is that not the case? Yes, you should use years BP. Here you have the curve: http://depts.washington.edu/qil/datasets/uwten98 14c.txt.","date":"2013-10-03","mins":"5:42 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46118","author":"o_k","post":"Hugh Farey : I don’t know how Jackson derived his 2%, or what it really refers to. “Only a 2% carbon contamination relative to the overall carbon in the sample would be required to move a first century date of the Shroud textile to the 14th century.” Well, a 50mg sample of linen contains roughly 22mg of carbon. If only 78% of this sample’s original C14 remains, the sample is about 2050 years old. If 80% of this sample’s original C14 remains (a 2% difference), the sample is about 1850 years old. So that can’t be it. If 0.44mg of modern carbon was simply added to the shroud (2% more than the original amount), then 98% of the shroud’s carbon would be old, and 2% would be modern. This is insufficient to change the apparent date of the shroud by more than a few years. So that can’t be it either. Anyone got any better ideas? Hugh I’ll try to explain it to you. The Shroud was dated to 1260 1390, that is 691 years BP. The carbon dated to 691 years BP has 92 % of the carbon “in the present moment” (that is year 1950). The year 25 AD is equivalent of 1983 BP. It has 79 % of present day carbon. The year 1532 AD has around 96 % of present day carbon. Let’s take the Jackson’s 2 % at face value. But this is not old vs new ratio (which I marked as X) but ADDITIONAL carbon absorbed in 1532 or so, from carbon monoxide. That means the Shroud has 102 % of initial carbon. It is easy to calculate now that carbon monoxide has C12/C14 ratio 8 times HIGHER than average in nature. THIS IS THE BASIS OF JACKSON’S HYPOTHESIS, which he describes in his paper. The percentages means THREE DIFFERENT THINGS: 1.) The old vs new ratio (assuming contamination has average C12/C14 ratio of its epoch). This is the 65 75 % I calculated. 2.) The remaining (non decayed) C14. This is 96 % for year 1532, 79 % for year 25 AD and so on. 3.) Addittional carbon absorbed from atmospheric carbon monoxide. This is Jackson’s 2 % However, as I said, the three things are frequently confused..","date":"2013-10-04","mins":"5:38 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46121","author":"o_k","post":"O.K. : It is easy to calculate now that carbon monoxide has C12/C14 ratio 8 times HIGHER than average in nature. THIS IS THE BASIS OF JACKSON’S HYPOTHESIS, which he describes in his paper. The proper equation is: 100*0.79+Y*2*0.96=102*0.92 Where Y is C14/C12 ratio for carbon monoxide compared to average in nature. Thus: Y =(102*0.92 100*0.79)/(2*0.96) =7.85.","date":"2013-10-04","mins":"5:51 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46119","author":"o_k","post":"Of course C14/C12 ratio..","date":"2013-10-04","mins":"5:39 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46169","author":"o_k","post":"Calculating this we have: || Original date of the Shroud || Date of contamination || Result of measurement || X (new/old) || 1983 BP || 117 BP || 691 BP || 66 % || 1983 BP || 301 BP || 691 BP || 75 % || 1983 BP || 301 BP || 750 BP || 71 % || 1983 BP || 117 BP || 750 BP || 64 % I don’t know where those 50 % quoted by Evin come from probably from manipulating the boundaries (taking higher margin for original date of the Shroud, and the lowest possible margin for actual results)..","date":"2013-10-04","mins":"1:55 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46170","author":"o_k","post":"And one another thing. The actual results for Damon et all were 1273 1288 AD at 68 % confidence level, and 1262 – 1312, 1353 – 1384 AD at 95 % confidence level. The double interval comes from the fact, that the callibration curve is not monotonic, so multiple solutions are possible! See http://www.shroud.com/nature.htm.","date":"2013-10-04","mins":"1:59 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46168","author":"o_k","post":"Hugh Farey : Pick me! Pick me! 1950 is called “the present” by radiocarbon boffins. The year 50 (1st century) is 1900 years BP, and the year 1650 (17th century) is 300 years BP. My calculator (http://dwb4.unl.edu/Chem/CHEM869 Z/CHEM869 Z Links/www.all.mq.edu.au/online/edu/egypt/carbdate.htm) tells me that after 1900 BP there is 79.466% of the original C14 left, and after 300 BP there is 96.436% left. If 34% of the shroud is 1st century, and 66% is 17th century, then the overall percentage of C14 compared to the present day percentage is 90.6662%. This corresponds (my calculator tells me) to a date of 810 BP, or the calendar year 1140 AD. I’m sorry, Max, but we’ll need a lot more contamination than that to make a 1st century cloth appear 14th century. Wrong, Hugh. Your claculator does not convert years BP (which in strict sense, are not difference between date1 and date2 !!!) into years AD/BC. Use data from here: http://depts.washington.edu/qil/datasets/uwten98 14c.txt For example: By definition: 1950 AD || 0 years BP then: 1945 AD || 190 years BP 1865 AD || 117 years BP 1795 AD || 201 years BP 1695 AD || 115 years BP 1535 AD || 301 years BP 1355 AD || 617 years BP 35 AD || 1940 years BP 25 AD || 1983 years BP Remember, the level of C14 in enviroment changes with time, so actually the years BP have little in common with calendar years!!! Results for Damon et al: Arizona 646 years BP Oxford 750 years BP Zurich 676 years BP Unweighted mean 691 years BP.","date":"2013-10-04","mins":"1:47 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46184","author":"o_k","post":"Hugh Farey : How does that seem, OK? Does it make better sense? Hugh, I did all the calculations at #40. Analyzing Stuiver you can see that there are sometimes very steep changes in years BP every 10 years. For example: 1805 AD || 159 years BP 1795 AD || 201 years BP 1675 AD || 172 years BP 1665 AD || 209 years BP and so on. Curiously, the dates 1865 and 1695 are almost the same. 1865 AD || 117 years BP 1695 AD || 115 years BP That’s why Wölfli joked that his step mother’s (or mother in law’s) 50 years old napkin case appeared to be 350 years old..","date":"2013-10-04","mins":"4:07 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46189","author":"o_k","post":"Daveb of wellington nz : There appears to be some confusion as to whether repair was 19th or 17th century: MPH at #29: “Historically and metrologically speaking, the best candidate for the INVISIBLE mending(s) is definitely Princess Clothilde (then with or without the help of the Master of upholstery in the Royal court of Savoy). It/they would perfectly fit with a 66% contaminant amount.” Hugh F at #31: “If 34% of the shroud is 1st century, and 66% is 17th century, then the overall percentage of C14 compared to the present day percentage is 90.6662%. … I’m sorry, Max, but we’ll need a lot more contamination than that to make a 1st century cloth appear 14th century.” Wiki extract on Princess Clotilde of Savoy: “Maria Clotilde of Savoy (Ludovica Teresa Maria Clotilde; 2 March 1843 – 25 June 1911) was born in Turin to Vittorio Emanuele II, later King of Italy and his first wife Adelaide of Austria. She was the wife of Napoléon Joseph Charles Paul Bonaparte.” I assume this is the Princess Clotilde referred to by Max; It fits the 1868 date when she would have been aged ~25. Conclude that if it were Princess Clotilde, repair would have been done in 19th century, not 17th century. Dave: See my posts #39,#40, #41, #46 to avoid confusion. Duches Clothilde performed repairs in 1868, however the equivalent radiocarbon date is almost the same as equivalent radiocarbon date of 1694, when Blessed Sebastian Valfrè was performing his repairs on the Shroud. Now there is one VERY IMPORTANT clue that the Duchess may be responsible for invisible reweave. From: http://www.shroud.com/pdfs/chronology.pdf (read this paper, its really worthy of it) “Entry: #17 Date: 1996 Data Category: Evidence of anomalous nature of C 14 corner and C 14 aspects Evidence: even though Riggi had given assurances that the excised C 14 samples given to the labs were free of foreign threads, The University of Arizona, one of the laboratories that performed the Shroud C 14 dating, documented BOTH RED SILK AND BLUE SATIN IN ITS SAMPLE. Source: Petrosillo, Orazio and Marinelli, Emanuela. The Enigma of the Shroud: A Challenge to Science, San Gwann, Malta: Publishers Enterprises Group, 1996, pg 86” According to Wilson’s 1998 “Blood and the Shroud” (see Figure 20 in Chapter 13, that is diagram of carbon dating sample, and the year 1868 in the chronology of the Shroud at the end of the book, as I have polish edition I cannot give exact pages), the Duchess changed SILK coating of the Shroud, and added BLUE frame to it. At the end of the C 14 sample there was a stitch made by her which was removed..","date":"2013-10-04","mins":"5:00 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46393","author":"o_k","post":"Richard Savage : – I probably missed something (above) dealing with the following — but Michael Ehrlich, head man at “Without a Trace,” told me on the phone that French Weaving required using only thread from the original cloth (taken from less noticeable areas) to do the reweave. If I understood that correctly, French Weaving should have little (if any) effect on the C14 date. The point is that the threads should resemble the original as much as it is possible so the best are taken from the same cloth. But this is not an option in case of the Shroud..","date":"2013-10-07","mins":"4:28 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46085","author":"o_k","post":"We don’t know. It may be either of them, or perhaps somebody else. The most important thing is that the invisible mending has been performed on the Shroud, less who has done it. However, the later date the smaller number of contaminants is required to shift the datings from 1st to 13th 14th century. If this had been performed between 1700 1900 the amount needed is 65 %, if in 1532, the amount is 75 % or so..","date":"2013-10-03","mins":"4:28 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46508","author":"o_k","post":"Hugh Farey : 4) The image may be the result of some painting or natural transfer mechanism which has since been washed off, leaving only degraded fibres behind. Unproven wishful thinking of the sceptics. Hugh Farey : 4) Almost any monochrome painting (or photograph) made full face, with the light from in front and a dark background, shows three dimensional attributes that are at least as good as and often better than those exhibited by the Shroud. This can be tested by any suitable image processing software such as Image J. Wrong Hugh. I tested this using Image J. No monochrome painting or photograph has 3 D properties as good, as has the Shroud and in case of the Shroud they are callibrated to the surface of the cloth, not to the plane in infinity. Check pictures in my article: http://ok.apologetyka.info/racjonalista/jak nie zosta zrobiony caun turynski,473.htm.","date":"2013-10-08","mins":"2:15 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46539","author":"o_k","post":"Guys, could you tell me what is a difference between thread by thread and French reweaving? Because all my knowledge about the latter is based on Benford&Marino papers. I thought it is essentially the same. Thanks..","date":"2013-10-08","mins":"5:17 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46510","author":"o_k","post":"This is also worthy of look:.","date":"2013-10-08","mins":"2:19 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46086","author":"o_k","post":"A few basics of carbon dating: The basic equation is the law of exponential decay, basing on following differential equation: d N(t)/dt = a N(t) where a & N are some constans. Solving it (it is one of the first differntial equations every student gets familiar with) we obtain: N(t)=N0 exp[ at] where N0 is the initial value, and a =1/8270 years (the halflife of carbon dating is 5370 years, thus 5730*ln(2)=8270 years. In order to calculate the amount of contaminants (described here as x) to shift the dates from time t1 to time t2 , we must solve the following linear equation: (1 x)*exp[ t1/8270]+x*exp[ t3/8270]=exp[ t2/8270]. Where t3 is the time where contaminants were added (for simplicitywe take the assumption that all were added at a single time: The solution is: x= (exp[ t2/8270] exp[ t1/8270])/(exp[ t3/8270] exp[ t1/8270]) Thus we have one equation, but TWO parameters: t3, and x. Manipulating them we can change either x or t3 * expressed in years BP, the callibration curve from years BP to BC/AD is available here: http://depts.washington.edu/qil/datasets/uwten98 14c.txt Note that the curve is not monotonic..","date":"2013-10-03","mins":"4:43 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46509","author":"o_k","post":"And also here: http://ok.apologetyka.info/racjonalista/caun turynski faszerstwo niedokonane cz 3,560.htm.","date":"2013-10-08","mins":"2:16 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46884","author":"o_k","post":"Or check this:http://ok.apologetyka.info/racjonalista/caun turynski faszerstwo niedokonane cz 1,558.htm.","date":"2013-10-10","mins":"2:31 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46648","author":"o_k","post":"Hugh Farey : “Wishful thinking.” Not mine, OK. If I permitted myself wishful thinking I would wish that the evidence for a 1st century, natural shroud was convincing, which it isn’t. The image may indeed result from the remains of a process now largely removed. That’s not wishful thinking, it’s merely a statement. Not yours, but that of Schafersmann, Nickell, Garlaschelli and other sceptics who try to convince the public of existence of such mythical agent. But they fail. See: http://www.acheiropoietos.info/proceedings/Heimburger Web.pdf “In order to test this hypothesis, LG had to find some kind of solid non neutral “sensitizer” which, once rubbed onto the cloth and artificially aged, could slightly discolor the cellulose. After testing dozen of salts and solid acids, either mixed with a pigment or even pure, “ none of them“ left any trace on the linen af ter heating and final washing.” Hugh Farey : As for your photos, I note that instead of choosing a “monochrome painting (or photograph) made full face, with the light from in front and a dark background” as I suggested, you selected a heavily side lit picture of Jules Verne to illustrate your point, coloured it in bright greens and blues, and then have the boldness to tell me I’m wrong! Might I suggest that you choose instead the gentleman in the top centre of Diagram 7 of your third reference, and colour it using the greyscale. I did, and obtained a beautiful 3 D representation using Image J. The cheeks, it is true, being as bright as the tip of the nose, do stick up a bit too much – but then so do the cheeks of the shroud under a similar transformation. Hugh, according to your wishes:You see? A total FAILURE, as you have admitted yourself. I checked many pictures, full face, light from the front and so on. Even in perfect conditions, the correlation between distance and luminosity was not so perfect as it is in the case of the Shroud and surface of the cloth..","date":"2013-10-09","mins":"10:29 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46796","author":"o_k","post":"Hugh Farey : What software are you using? Image J, just like you. Hugh Farey : Thank you for at least trying. As it happens your 3 D image of the Shroud face is to me as meaningless as the one of my ‘gentleman in the middle of Diagram 7. Can’t you get rid of that hideous green and blue? Why? Because it shows that the forehead of that gentleman is too much in front? The Image J has an option of using color map and its in my opinion much more informative and useful than grey images. Perhaps it seems that I simply know Image J a little bit better than you do. Hugh Farey : I really think anyone who was not already committed to preconceived ideas about the shroud would think that the first picture is considerably better. And he would be WRONG! Hugh, i know you like to play devil’s advocate, but do you really UNDERSTAND what are the so called 3 D properties of the Shroud image? Because every image or photograph has it. Every monochromatic image has THREE dimensions, the X,Y coordinates and INTENSITY, which is the third dimension (call it Z). So every picture will look 3 D in VP8 or Image J. BUT ONLY IN THE CASE OF THE SHROUD this third dimension can be CORRELATED to the body cloth distance. This is what is popualrly called as 3 D dimensions of the Shroud. However, Petrus Soons argues that besides those, the Shroud has ADDITIONAL holographic properties, which is another distinct way of encoded 3 D information..","date":"2013-10-10","mins":"6:45 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46797","author":"o_k","post":"As 3 D properties..","date":"2013-10-10","mins":"6:46 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46893","author":"o_k","post":"Yes. See once again “The real face of Jesus?”, it is presented well there: However, one remark. The 3 D distortions (which are obvious on the Shroud) and 2 D distortions (which certainly exist, as Mario has shown us in his excellent paper http://www.sindonology.org/papers/latendresse2005a.pdf however they are not major, and symmetrical, so there is very little devaition from what would be seen had the image been projected on a flat surface) although somehow related, are in fact two distinct features and should be not confused. So no, there is no point for sceptics here..","date":"2013-10-10","mins":"3:06 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46087","author":"o_k","post":"Correction: 5730/ln(2)=8270 years. 2^( t/5730 years)= exp[ (ln(2)*t/5730 years)=exp[ t/8270 years] e=2.71828….","date":"2013-10-03","mins":"4:51 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-78636","author":"o_k","post":"Just want to remind one previous post on Dan’s blog: https://shroudstory.com/2012/05/29/clarification quake did not reveal day of jesus crucifixion/.","date":"2014-02-12","mins":"8:14 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-185188","author":"o_k","post":"The failure of several statistical tests, begining with the simplest chi square is important indicator that something was wrong here. But the presence of a gradient (and not just a high scatter) is even more important. It suggests systematic error and is not only consistent but even expected with regards to the interpolated material (reweaving) theory which in fact, is only reliable theory able to explain that fact..","date":"2015-01-21","mins":"4:08 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-185180","author":"o_k","post":"Generally, yes, the average date for the Shroud is 691+/ 31 years BP, which correspondence to about 1280 AD. The calendar date ranges for the C 14 dating of the Shroud are 1262 1312 for 68 % confidence level, and 1262 1312 ,1353 1384 at 95 % confidence level (see http://www.shroud.com/nature.htm Table 3). This means that there is 68 % and 95 % probability that the actual date of the origin is somewhen within mentioned time intervals –assuming of course that the measuremnts and sample were correct (the latter is main point of controversy)..","date":"2015-01-21","mins":"3:19 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-185189","author":"o_k","post":"What is surprising, is that their averaging technique gave the perfect range in relation to the historical documents known in 1988. This is rather coincidence. The first documented appearance in Lirey in 1356 falls within C 14 interval (and only within 2 sigma range) purely by accident, I think..","date":"2015-01-21","mins":"4:11 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-98324","author":"o_k","post":"Hugh: I wouldn’t place a probability on any particular reason for the anomalous dates, but reasonable scenarios can be suggested. One that comes to mind is the possibility of dissolved limestone in the water in which the papyrus grew, or was manufactured. The carbon atoms in limestone can be millions of years old, and contain no C14 at all. As far as I read, water dissolved Ca CO3 exchanges its carbon atoms with atmospheric CO2. King writes (http://journals.cambridge.org/action/display Fulltext?type=1&fid=9226239&jid=HTR&volume Id=107&issue Id=02&aid=9226237&body Id=&membership Number=&society ETOC Session= page 135): Initially it was speculated that this oddity might indicate the presence of an unknown contaminant that would result in an older than expected dating. Subsequent FT IR microspectroscopic analysis by the Swager team at MIT did not, however, identify a specific contaminant (beyond the “orange” spots) Nevertheless, a misdating of an 8th century papyrus to the 4th century BC requires a substantial dilution of its C14 content, and if the pretreatment was known to be that inefficient, it is surprising that the AMS procedure was continued. I will inquire further. According tomy calculation about 11 % of the whole carbon should have been contamination, to switch a 1300 BP date (around 700 AD) to 2283 BP (405 209 BCE, like in the Arizona dating), assuming date of contamination to be 100 000 BP..","date":"2014-04-11","mins":"7:28 am","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-196970","author":"o_k","post":"As I said before, it’s called SCIENCE! Truly Barrie, who cares about science especially when all verdicts are made a priori based on ideological key (no matter in which way)?.","date":"2015-04-20","mins":"4:36 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-98333","author":"o_k","post":"And in the opposite way, assuming the real date to be 2283 BP, and contamination to be 300 BP, around 46 % of the whole carbon must come from the contamination to switch to the 1300 BP, that is circa 700 AD..","date":"2014-04-11","mins":"7:50 am","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-98629","author":"o_k","post":"Hugh, link doesn’t work..","date":"2014-04-12","mins":"5:49 am","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-98636","author":"o_k","post":"Thanks Hugh..","date":"2014-04-12","mins":"6:22 am","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-98173","author":"o_k","post":"Kelly: http://journals.cambridge.org/action/display Fulltext?type=6&fid=9226252&jid=HTR&volume Id=107&issue Id=02&aid=9226251&fulltext Type=RA&file Id=S0017816014000170 http://journals.cambridge.org/action/display Fulltext?type=6&fid=9226256&jid=HTR&volume Id=107&issue Id=02&aid=9226255&fulltext Type=RA&file Id=S0017816014000182.","date":"2014-04-10","mins":"5:39 pm","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-74440","author":"o_k","post":"Perhaps Hugh can provide the percentage of 19th c. Contamination required to skew a 1st c. Date to the 13th c. ?? Dave, we discussed this long ago: https://shroudstory.com/2013/10/03/and then too we have two comments from daveb of wellington/#comment 46168 https://shroudstory.com/2013/10/03/and then too we have two comments from daveb of wellington/#comment 46169.","date":"2014-01-24","mins":"3:47 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-105711","author":"o_k","post":"I did bring up that point in a private email to the author. Joe, you have the audio tape. Who is mentioned there: Rossman, Wasserburg, or both?.","date":"2014-04-29","mins":"8:05 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-51337","author":"o_k","post":"No one knows. Raes sample is somewhere. As to the bloodied threads dissolved with acid?.","date":"2013-11-14","mins":"5:39 pm","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"id":"comment-105718","author":"o_k","post":"So if there was only “Wassermann” and “Jerry”, where did you get info about Rossman from?.","date":"2014-04-29","mins":"8:17 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-105961","author":"o_k","post":"Joe, you seem to contadict yourself. To my question who is mentioned on the tape: Rossman, Wasserburg, or both, you answered: It was a hybrid: Wasserman! But “Jerry” was also mentioned, suggesting Wasserburg. When I asked anothere question, where did you get info about Rossman from, you referrred me to http://www.shroud.com/late02.htm It is written there: Not only does the tape reveal the institution performing the test, but also refers to Dr. Rossman as the person who did the testing. On the tape, Adler further describes Rossman as a leading expert in the niche area of “moon rocks.” So where did Rossman came from? Was it just a guess, combining the phrase “Jerry Wasserman” + moon rocks clue with the closest possible name? Just asking because the claim seems to be a little misleading. You wrote also: In addition to the audiotape of Adler’s interview, we also have the phone records documenting our two brief phone calls to Rossman’s home on the date specified. Are those just the billings, confirming those phone calls indeed took place, or perhaps you have recordings of those conversations?.","date":"2014-04-29","mins":"2:55 pm","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-105698","author":"o_k","post":"My reference to misleading claims was about the distinction between Jerry Wasserman and George Rossman. Couldn’t simply be both Wasserburg and Rossman involved in that 1982 test? That would explain apparent inconsistences, as I hardly believe the whole job was performed by a single person..","date":"2014-04-29","mins":"7:49 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-125080","author":"o_k","post":"Hugh: A Dictionary of Greek and Roman Antiquities (1890): Some flagella found at Herculaneum consist of several short chains with knobs of metal at the end, attached to a short handle. Http://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.04.0063:entry=flagrum cn.","date":"2014-05-27","mins":"3:00 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-124995","author":"o_k","post":"Thomas: Has anyone ever proposed that the Shroud man might be a flagellant from the 1300′s? Such a notion is consistent with the flagellation marks. Thoughts? Yes, I had to refute such absurd claims here http://ok.apologetyka.info/racjonalista/caun turynski faszerstwo niedokonane cz 2,559.htm.","date":"2014-05-27","mins":"6:44 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-125229","author":"o_k","post":"In short, my opponent suggested that the forger was inspired by medieval flaggelants, whom he saw just outside the window. Then he gave a quote describing medieval flagrum, which consisted of several needle spikes. I responded that it is a perfect description of a whip that has not been portrayed on the Shroud, and then I referred (via Wilson) to Herculaneum, excavated several centuries after first Shroud display in Lirey. Although, contrary to Wilson, I did not assumed that the flagrum as described on the Shroud, must have been exclusive to the Roman empire, however, I claimed that it would be strange coincidence that the shape of the whip would fit what was excavated at Herculaneum (I assumed in good will that those reconstructions are based on items found there).Next I referred to Ricci’s reconstruction of the flogging, where Jesus was tied to short (circa 60 cm) column (the alleged relic of it still exist in Rome!), leaning down, and being beaten by two Roman opressors from each side of the back. Then I argued that the scourge marks on the Shroud are not distributed randomly, but follow specific pattern, contrary to the contemporary drawings. In short it is unlikely that the scourge marks on the Shroud are inspired by medieval flagellants. Especially if we additionally take into account all the remiang crucifixion marks..","date":"2014-05-28","mins":"6:28 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-194057","author":"o_k","post":"Rschneider42: Remember whar I wrote above: About Morgan & Schneider: in Table 2 we have the mean of 3.9807 integrated over 298 pixels for Arizona (Area 1). As we know half of the sample was retained , this mean that actual integrated area is ~ 150 pixels thus the mean of 3.9807 is definetly false. Thus the whole regression of Schneider is actually meaningles..","date":"2015-03-22","mins":"4:49 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194048","author":"o_k","post":"As you can see, even if only the left half of the Arizona sample was tested, it still shows a smaller proportion of Morgan’s “different chemical composition” than the Oxford sample. I know what you mean. I had been aware of before you raised this issue. But first of all, we know that Oxford used the whole sample. Arizona only half, we don’t know about Zurich. This makes a lot of options. And the contours of the samples on this picture do not correspond precisely with sample borders. About Morgan & Schneider: in Table 2 we have the mean of 3.9807 integrated over 298 pixels for Arizona (Area 1). As we know half of the sample was retained , this mean that actual integrated area is ~ 150 pixels thus the mean of 3.9807 is definetly false. Thus the whole regression of Schneider is actually meaningles..","date":"2015-03-22","mins":"3:01 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194045","author":"o_k","post":"For example, half of the Arizona sample was not dated… This completely changes the picture. Repeat this before you want jump into hasty conclusions Hugh….","date":"2015-03-22","mins":"2:23 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194074","author":"o_k","post":"Rschneider4: The impression I is that the part that was reserved was from the second Arizona sample. No,there were two retained parts Arizona 2, and half of the Arizona 1. See https://shroudstory.com/2013/11/10/the mysterious arizona piece/ In any case I don’t think that claim justifies dismissal of the observed correlation. It fully justifies dismissal. Simply, the input values do not reflect reality. Frankly I think the fact of the anomalous character of the sample has been demonstrated in spades not only by these observations but by the many others. So this discourse even if it were true would not change the conclusion. –Ray I can agree with that..","date":"2015-03-22","mins":"6:15 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194038","author":"o_k","post":"Exactly, John. We, with Thibault and Joe, are currently working on the issue..","date":"2015-03-22","mins":"1:39 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194066","author":"o_k","post":"Thanks, Louis, I have read it before, so you don’t have to wave it in front of my eyes ; ) Excellent interview..","date":"2015-03-22","mins":"5:17 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194271","author":"o_k","post":"Fine, Hugh, I commend you for your inquiry. But this makes more questions then answers. In fact, your placement of the Jull sample (I checked it independentyl, and seems correct) scores own goal… at least for Jull. I will try to explain that later, but first I would like to hear Thibault’s opinion on that matter. I sent him and Joe (in private e mail) some of my thoughts on that, and I won’t go into hasty conclusions, before they express their opinion. Because the matter is grave serious. Other issues. Your calculation of percentages, Hugh, is incorrect. Based on http://depts.washington.edu/qil/datasets/uwten98 14c.txt 25 AD =1983 BP The 1988 result =691 BP 1535 AD =301 BP 1695 AD=115 BP 1865 AD =117 BP Date of intrusion: Proportion of intruded material 1535 75% 1695 67% 1865 67 % 1950 (0 BP) 62 % The correlation between Z score and age: As you can see on the picture below, the Z score on Morgan’s Fig. 12 has clear linear, geometrical pattern due to the triangle like shape of that stain As we know, there is a correlation between average age of the samples, and distance from the edge. This has been shown by Walsh. As triangular shape of the Z score fluorescence also is related (geometrically) to the distance from the edge, then the apparent anticorrelation between the age of the samples and average Z score is actually trivial and adds nothing to our knowledge. You cannot use correlation tool in brainless way, and say, “there is correlation” so this and that automatically must be true. This is the fundamental mistake many poor scientist commit..","date":"2015-03-24","mins":"9:11 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194259","author":"o_k","post":"That would seem quite arbitrary to me, and it must depend on when the additional material was added in. For example, if say the material was added in only a year ago, then I should think the proportion would be very much less than two thirds. Not much less. There is a strict mathematics behind that and depending on exact date of repair, the amount of new material should be no less than about 66 % (75 % if repair was made in the 16th century). Here you have a callibartion curve: http://depts.washington.edu/qil/datasets/uwten98 14c.txt As you can see, due to the variations of amount of C 14 in atmosphere, the C 14 date for the last 300 years (since around 1660) oscilates at around 100 200 years BP. This makes carbon dating of artifacts younger than 300 years pointless. At about 100 years BP we obtain the necessary proportion of about 66 % (two thirds). At about 300 BP the proportion is around 75 %. That’s the greatest obstacle for any theory attempting to explain why the 1988 datings were skewed..","date":"2015-03-24","mins":"5:53 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194303","author":"o_k","post":"The half life of C 14 atom is 5730 years, thus tau =5730/ln2 =8267 years (say 8270) The average date for the Shroud =691 BP this is fixed value, you cannot change that!!! http://www.shroud.com/nature.htm 25 AD =1983 BP The date of contamination from Stuiver et al (Ox Calc gives similar results, no significant difference). Now: X contamination proportion The equation: EXP( 691/8270)=(1 X)*EXP( 1983/8270)+X*EXP( Date of contamination/8270) Transforming: X*[EXP( Date of contamination/8270) EXP( 1983/8270)] =EXP( 691/8270) EXP( 1983/8270) Thus: X=[EXP( 691/8270) EXP( 1983/8270)]/[EXP( Date of contamination/8270) EXP( 1983/8270)] The best thing is to create a program or an Excel sheet to have all this equations at hand..","date":"2015-03-24","mins":"4:34 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194293","author":"o_k","post":"“Your calculation of percentages, Hugh, is incorrect.” Dangerous words. Your use of a calibration table from 25 years ago is quaint, but I use Ox Cal, which uses the latest (2013) refinement to convert BP to Calendar dates and vice versa, and http://dwb4.unl.edu/Chem/CHEM869 Z/CHEM869 Z Links/www.all.mq.edu.au/online/edu/egypt/carbdate.htm to convert years BP to a percentage of C14 and vice versa. Also I used 50 AD (1950 BP) rather than 25 AD (1980 BP) as my 1st Century standard. The differences are minor, but I believe my calculations are as correct as your own. Gotcha, Hugh. I know what you are doing wrong. I checked, Ox Calc callibration curve is similar to that Stuiver et al. But your use of that online calculator is mindless. This is actually primitive tool, that (contrary to what you think), does not convert AD/BC dates into BP dates. I put the following data into it: The original 1st century date 1900 years (50 AD) The 1550 AD 400 years 1350 AD 600 years. Result: 85 % 1750 AD 200 years Result: 75 % 1950 AD 0 years Result: 67 % With the very respect, Hugh, but have you really thought that i won’t find an error? This is nothing personal. I really have a high respect for you. But you simply make mistakes, like everyone. Nevertheless, I really think you are a very promising Shroud researcher. More promising than many “stars” in the Shroud world (no matter pro or const authenticity). How true. I would never dream of being so incompetent. I was quoting, verbatim, from a Professor Emeritus of Mathematics… Truly,mathematics doesn’t interest whether one is Professor of it, or someone who failed all the exams and now is cleaning streets. It is interested only whether one is right or wrong in his/her reasoning..","date":"2015-03-24","mins":"2:33 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194272","author":"o_k","post":"And BTW: this photo above does not show the full lenght of C 14 sample it should be about 1 2 cm longer, further from the edge..","date":"2015-03-24","mins":"9:23 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194306","author":"o_k","post":"Yes, Hugh, but my results are those correct..","date":"2015-03-24","mins":"5:08 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194042","author":"o_k","post":"Hugh, I wouldn’t put too much weight in R^2 for linear regression based on just three points (which are in fact nothing but average values over some non homogenous areas) The matter is much more complex. There are other issues that should be taken into account. For example, half of the Arizona sample was not dated… This likely changes the true values of average z score (Table 2 in Morgan paper) significantly which means that the whole Schneider correlation is actually pointless..","date":"2015-03-22","mins":"2:10 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-122199","author":"o_k","post":"“the pious practice of sharing Major Relics of the Holy Shroud was, according to tradition, continued by the first three Savoy Lords who possessed it, although they, unlike some of their predecessor Guardians, never purposely removed fragments from their areas with the image of the Corpus Sancti (Holy Body.)” This is strange. The only portions of the Shroud that looks missing,are the ends of the side strip around the edges (not including wholes in the patched areas, plus Raes and C 14 sample). No image areas were taken from the Shroud. Some older publications assumed that the Shroud’s lenght were shortened from 5 meters to approximately 4.4 by cutting material for relics, but there are strong counterarguments against that. Another fact confirmed by His Majesty was that it was traditionally affirmed, that at one point in the past, the edges of the Lenzuoli (Sheet) had become so tattered as to cause embarrassment or criticism of the Custodians, and those areas were repaired and rewoven using identical techniques, but obviously with similar, yet newer, materials containing dyes and other medieval manufacturing ingredients, in an attempt to better blend the new sections in, as best possible, with the original fabric. Both corners? Because on the quad mosaic photos presented in Benford/Marino paper, both outer corners around the missing parts of the side strip have similar greenish color, indicating differences in chemical composition (http://www.shroud.com/pdfs/benfordmarino2008.pdf see Figure 5) The problem is its interpretation are those rewoven, or simply dirty areas? The presence of the similar green color on the other corner was always, in my opinion, one of the greatest challeges to the validity of quad mosaic argument for reweave hypothesis..","date":"2014-05-20","mins":"3:54 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122184","author":"o_k","post":"Max, please stop spamming the comments. It won’t help you to get attention, while it disturbs the others..","date":"2014-05-20","mins":"3:32 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-209599","author":"o_k","post":"I haven’t read this paper yet, but first, and fundamental question that comes to my mind: Did the authors of this paper have performed examination of original Shroud C 14 samples, like Rogers did? If it is the same kind of Shroud “science” like Garlaschelli presents with his “reproductions” of the Shroud, tan it’s likely a trash. I am under impression that our sceptical friends are trying to discredit the whole Shroud science, by producing carefully prepared nonsense, and sending them to peer review journals for publishing (to have some arguments for propaganda purposes). Although those journals are peer revieved, I suppose the revievers have actually little knowledge about the Shroud. That means, even what is in peer reviewed journals, isn’t a guarantee of good science..","date":"2015-09-04","mins":"1:40 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209600","author":"o_k","post":"To give an example: CRAIG, Emily A. And BRESEE, Randall R. – Image Formation and the Shroud of Turin http://www.shroud.com/pdfs/craig.pdf Although published in peer review Journal of Imaging Science & Technology, actually it has been completely dismissed by all Shroud science as a nonsense (and right!)..","date":"2015-09-04","mins":"1:47 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-210143","author":"o_k","post":"Campbell wrote a 17 page report that I’m having trouble locating it electronically. Http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Home files/Updated report on the Consideration to the Uniformity and Effects of the Fabric in the Shroud of Turin 5 1.pdf.","date":"2015-09-11","mins":"4:19 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209871","author":"o_k","post":"Marco: even if there is no evidence at all to support this pseudoscientific hypothesis Oh, really? Then why the title of the editorial is: There is no mass spectrometry evidence that the C14 sample from the Shroud of Turin comes from a “medieval invisible mending”. Instead of simply There is no evidence that the C14 sample from the Shroud of Turin comes from a “medieval invisible mending”. Without bolded words? Why did you need to insert them? Or maybe there is some other evidence, besides disputed mass spectrometry? Rogers wrote in his TCA paper (p. 193): The combined evidence from chemical kinetics, analytical chemistry, cotton content, and pyrolysis/ms proves that the material from the radiocarbon area of the shroud is significantly different from that of the main cloth. The radiocarbon sample was thus not part of the original cloth and is invalid for determining the age of the shroud..","date":"2015-09-08","mins":"3:39 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209602","author":"o_k","post":"From the short extract presented by Dan (have you read the whole article?): In conclusion, the unspecific qualitative chemical tests presented by Rogers are in no way confirmed by instrumental analysis (mass spectrometry). No diagnostic peak in the pyrolysis mass spectra indicates a significant difference in the two samples, besides hydrocarbon derived contamination. Therefore, none of the presented data supports the conclusion by Rogers. Have Garlaschelli et al. Performed any tests (on what)? Have Garlaschelli et al. Performed mass spectrometry (of what)? Have Garlaschelli et al. Considered all the arguments presented by Rogers in his paper? Have Garlaschelli et al. Detected any contaminant in C 14 corner, that Rogers haven’t found (what kind of contaminant? By what tests?). Or maybe Garlaschelli et al. They found some slight weakeness, or inexactness, in one of the arguments Rogers presented in his paper, and exploited it, pretending that they have “debunked” Rogers? These questions need answers before we go any further. The work of the late Dr. Rogers has been exploited to support a pseudoscientific hypothesis which is in no way confirmed by the reported data. Regardless of the debate on the hypothetical authenticity of the Shroud, the scientific community and the general public can only be misled by this paper. B%##&*t!.","date":"2015-09-04","mins":"2:36 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209617","author":"o_k","post":"No tricky games. What about cotton? What about dye? What about vanillin? Claiming that a couple of figures from Rogers can be interpreted different way, and suggesting that the Rogers is wrong because of that (wrong in the whole, not some minor details) is really a low blow..","date":"2015-09-04","mins":"5:24 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209605","author":"o_k","post":"I have an access to Thermochimica, fortunately, and I can say that for all the questions (except the last “Or maybe Garlaschelli et al. They found some slight weakeness, or inexactness, in one of the arguments Rogers presented in his paper, and exploited it, pretending that they have “debunked” Rogers?”) I presented in post from September 4, 2015 at 2:36 pm, the answer is NO! Garlaschelli et al. Haven’t refuted Rogers..","date":"2015-09-04","mins":"2:48 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209666","author":"o_k","post":"Hugh: I have been thinking about the vanillin, and in particular Rogers’s comment regarding its decay: “However, some reasonable storage temperatures can be considered to give a range of predicted ages. If the shroud had been stored at a constant 25°C, it would have taken about 1319 years to lose a conservative 95% of its vanillin. At 23°C, it would have taken about 1845 years. At 20 ◦C, it would take about 3095 years.” These figures were derived by direct extrapolation of his version of the Arrhenius equation as it applies to vanillin. By an exactly similar extrapolation, we find that if the temperature was 140°C it would have taken 2 minutes. This means that if the Shroud were ever in a box which became heated to extent that silver melted, there would be no vanillin present, regardless of how recently it had been made. If the shroud had been produced between a.d. 1260 and 1390, as indicated by the radiocarbon analyses, lignin should be easy to detect. A linen produced in a.d. 1260 would have retained about 37% of its vanillin in 1978. The Raes threads, the Holland cloth, and all other medieval linens gave the test for vanillin wherever lignin could be observed on growth nodes. The disappearance of all traces of vanillin from the lignin in the shroud indicates a much older age than the ra diocarbon laboratories reported. The fire of 1532 could not have greatly affected the vanillin content of lignin in all parts of the shroud equally. The thermal conductivity of linen is very low, 2.1 × 10 −4 cal cm −1 s −1 ◦ C −1 ; therefore, the unscorched parts of the folded cloth could not have become very hot. The temperature gradient through the cloth in the reliquary should have been very steep, and the cloth’s center would not have heated at all in the time available. The rapid change in color from black to white at the margins of the scorches illustrates this fact. Any heating at the time of the fire would decrease the amount of vanillin in the lignin as a function of the tempera ture and time heated; however, different amounts of vanillin would have been lost in different areas. No samples from any location on the shroud gave the vanillin test. Rogers, “Studies on the radiocarbon sample from the shroud of turin” p. 191. Could the Shroud survive without much damage 2 minutes at constant 140°C ? Rogers FAQ in question 4) http://www.shroud.com/pdfs/rogers5faqs.pdf If the image were a scorch or any part of the Shroud had been heated enough to make significant changes in the rates of decomposition of any of its components, we would see changes in the structure of the flax fibers and blood. The blood still evolves hydroxyproline on mild heating, and the cellulose crystals are largely undistorted. Image and control fibers show identical crystal properties. The image is not a scorch. The cloth was not heated, not even boiled in oil..","date":"2015-09-05","mins":"2:17 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209673","author":"o_k","post":"Not achieving 140°C We are not talking about peak temperature but average for relatively long time of a couple minutes. What about bloodstains? Other biological material on the Shroud? What would be effect of the high temperature? Anyway, Rogers claims that Raes threads (about 10 cm from burnhole) gave positive for vanillin, contrary to all other areas of the Shroud. This shows that there is interpolated material in this corner, regardless of any other considerations about true age of the Shroud..","date":"2015-09-05","mins":"4:10 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209737","author":"o_k","post":"One thing for you, Joe. Bella, Garlaschelli & Samperi write in their “paper”: Among those, a popular one is the so called “invisible mending”, disclosed by S. Benford and J. Marino and based on the analysis of low resolution (JPEG format) pictures of the Shroud. Can you adress this issue? The whole “paper” is one bunch of weasel words, and misleading statements..","date":"2015-09-06","mins":"11:15 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209607","author":"o_k","post":"Sorry guys for spamming, but this is such a scam, one could only expect from the sceptical guys like Garlaschelli, Nicolotti and Rinaldi. The only thing Garlaschelli et al. Did, was to send editorial to “Thermochimica” saying they disagree with interpretation of Figs. 4 5 from Rogers work, disregarding all other arguments Rogers presented. And based on that, they immediately jump to the conclusions, claiming that the Rogers has been discredited (if you look closely at their wording, they only say that one single argument has been discredited, but this is still only their opinion). And the last paragraph with invectives… have “Thermochimica” really passed that? This is the “science” of those sceptical bastards!.","date":"2015-09-04","mins":"3:25 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209844","author":"o_k","post":"Simply, by comparison of the style of two papers. The paper of Rogers, although hard to follow, looks very professional and comprehensive approach to the problem. The paper by you, much shorter, looks like nitpicking, insinuations, playing tricks with the words etc. The paper of Rogers is based on the analysis of the samples coming from the Shroud. The editorial by you is just an attempt to attack credibility of Rogers. And besides it contains some fundamental errors in reasoning, clearly visible even to non specialists in that domain..","date":"2015-09-07","mins":"3:47 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209739","author":"o_k","post":"As I wrote, the whole this “paper” is one bunch of insinuations, weasel words and misleading statements. Typical. Here are some samples (weasel phrases bolded): In 1988, three independent laboratories dated this object between 1260 and 1390 (95% confidence interval, 2 σ) by means of the C14 analysis. […] No one has hypothesized this before 1988 (before C14 analysis gave an “undesired” date for the linen); no textile experts who could examine the Shroud in person during the collection of the C14 sample reported any evidence of this late addition. Thus, we read with great surprise the above mentioned article, 1 which, by means of mainly mass spectrometry analyses, concludes that the C14 sampling area might indeed be different from the rest of the cloth, giving credit to the theory known as the “invisible mending” Although this can be debated, we will assume that all the samples that Rogers tested do come from the Shroud of Turin. The work of the late Dr. Rogers has been exploited to support a pseudoscientific hypothesis which is in no way confirmed by the reported data. Regardless of the debate on the hypothetical authenticity of the Shroud, the scientific community and the general public can only be misled by this paper. The last sentence summarizes this paper well. It is like pleading guilty by the pseudoscientists who wrote this crap..","date":"2015-09-06","mins":"11:25 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209845","author":"o_k","post":"…Unfortunately I have not enough chemical background to comment… ———– So, how can you decide that the paper that Rogers published in Thermochimica Acta in 2005 is correct, and that the one we published in Thermochimica Acta in 2015 is wrong? And besides there is an interesting acknowledgement in this editorial: Authors thank Andrea Nicolotti and Gian Marco Rinaldi for a helpful discussion. I am very curious, what a “helpful discussion” may provide Andrea, a historian, in a paper regarding chemistry… No offence, of course..","date":"2015-09-07","mins":"4:00 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209743","author":"o_k","post":"Sorry Hugh not I started this game. No double standards, if they are fouling, we cannot stay silent, and say the game is fair. I know too much what to expect from those guys. And “peer reviewed” does not mean true. It can be also cynically exploited..","date":"2015-09-06","mins":"12:18 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209749","author":"o_k","post":"If anyone has any evidence that the laboratories were not independent The “three independent laboratories” became catchphrase of the skeptics, but it is misleading, as it contains little true. First they actually dated the three parts of the same sample (which skeptics usually don’t mention). Second the “independence” of those three laboratories was very questionable although we could say measurements themselves were performed independently, the fact of communication between laboratories has been admitted (I don’t have much time now to look for specific references). That nobody desired a 1st century radiocarbon date The more important point is that Bella, Garlaschelli & Samperi write No one has hypothesized this before 1988 (repairs) See the list by Marino & Prior: http://www.shroud.com/pdfs/chronology.pdf http://www.shroud.com/pdfs/addendum.pdf that Rogers’s paper was not mainly dependent on mass spectrometry Not only, and not mainly. From the abstract of that paper: Preliminary estimates of the kinetics constants for the loss of vanillin from lignin indicate a much older age for the cloth than the radiocarbon analyses. The radiocarbon sampling area is uniquely coated with a yellow–brown plant gum containing dye lakes. Pyrolysis mass spectrometry results from the sample area coupled with microscopic and microchemical observations prove that the radiocarbon sample was not part of the original cloth of the Shroud of Turin. Rogers based his conclusion on the combination of factors. Bella, Garlaschelli & Samperi disregarded this, on the basis that the rest are “unspecified” chemical tests. Even the title of their paper is misleading: There is no mass spectrometry evidence that the C14 sample from the Shroud of Turin comes from a “medieval invisible mending”. The point is that most of the public won’t even notice bolded words… that Rogers’s samples were unquestionable See Thibault’s papers from St. Louis: http://www.shroud.com/pdfs/stlheimburgerpaper.pdf http://www.shroud.com/pdfs/stlheimburgerppt.pdf or that his hypothesis was not pseudoscientific The only comment is the question: why TCA allowed such statement to be published?.","date":"2015-09-06","mins":"1:01 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209764","author":"o_k","post":"MB: If he wrote something different somewhere else, this is irrelevant. Of course… Who cares about checking all the information available, when the goal is to slander long dead person? Skeptical “science”….","date":"2015-09-06","mins":"5:02 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209771","author":"o_k","post":"I suppose that not everyone is happy of the presence of prominent Shroud scholars on Ahmadiyya Muslims convention, who have recently adopted some fringe ideas in the Shroud community, that Shroud shows that Jesus survived the Crucifixion (the view absolutely unacceptable by any Christians). Such presence may give some credence to this clearly dead claim, and that’s why anger..","date":"2015-09-06","mins":"6:02 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-98430","author":"o_k","post":"“Of course priests should marry. Jesus was married!!!” Actually, I think so but not because of the GJW Yeah, that’s awkward!.","date":"2014-04-11","mins":"4:20 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"id":"comment-40897","author":"o_k","post":"O.K. : Lets assume 70 % of new material vs 30 % of old. Then: If the repair was performed around 1865 or 1695, we have: Year BP Year (closest) 632.5 1385 (633 BP) or 1305 (627 BP) If the repair was performed around 1535, we have: Year BP Year (closest) 771 1275 (767 BP). Almost exactly where carbon dating pointed! Sorry, I meant that radiocarbon pointed at 1273 1288 AD at 68 % significance. The mean date is of course 691+/ 31 BP. Http://www.shroud.com/nature.htm.","date":"2013-08-10","mins":"9:48 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-40911","author":"o_k","post":"Hugh Farey : Yes, I follow your reasoning. 70% of the Carbon dating area must be 16th century or later. That’s all the weft and nearly half the warp threads, or maybe 7/10 of both. Not neccesarily. “The diameter of the Shroud warp and weft threads is slightly different” (from Siefker & Spicer paper). And so are their volumes. And so perhaps weights of XVI century vs I century are slightly different. Remember that the average weight of the Shroud is 20 25 mg/cm^2, while weights of the samples were 36 43 mg/cm^2. EXPLANATION, PLEASE. Hugh Farey : So, 1) Try examining Barrie Schwortz’s photos at http://www.shroud.com/pdfs/arizona.pdf. The piece photographed contains about 45 threads. If the interweave theory is correct, around 30 are new and 15 old. Can you identify which are which? Can invisible weaving really be that invisible? How can you VISUALLY distinguish between 16th century, and 1st century thread? If they are mixed together, I see no way. That’s why they call it INVISIBLE. For my untrained eye, weft threads on Arizona sample seem darker, however that’s just my own impression, and don’t be suggested. Hugh Farey : 2) The next photo that needs examining closely is the x ray of the foot of the cloth in http://www.shroud.com/pdfs/marben.pdf. (Figure 7). It is poorly reproduced here, but very clearly in Schwalbe & Rogers, Physics and Chemistry of the Shroud of Turin. There is continuous warp and weft banding right through the C 14 area, and no evidence of interpolated threads, although Benford and Marino, using a very poor copy in their paper, think they see one ‘break’ in one ‘intensity’ line. I don’t argue, because I consider the patch going probably much deeper into cloth, than Benford and Marino thought. Hugh Farey : 3) Next, the actual dates of the Damon Nature paper have never been queried by statisticians, let alone massacred. The best analysis of the data is by Riani, Atkkinson et al, who do demonstrate, using the data which they do not query, that there is indeed a clear chronological progression along the sample area. This accounts very well for the anomalous chi squared value and its 5% significance, and does indeed suggest contamination, but it does nothing to suggest that any part of the sample area is from the 1st century. Don’t manipulate my words. I haven’t said that statisticians showed that the cloth is from 1st century. I know what is the purpose of statistical tests. They simply show that 1260 1390 interval is UNRELIABLE, and the true age of the Shroud IS STILL UNKNOWN. The Shroud is probably older than 13 14th century (because of unknown younger contamination), but statistical tests DOESN’T SAY HOW MUCH! It could be from the 1st century, it could be from the 11th century. WE DON’T KNOW. We know (or better use the word ‘suppose’, as there are no certainities in statistics), however, that we cannot trust Damon et. Al results. Note: if the reweave had been PERFECT, that is 7/10 ratio would be the same through the WHOLE SAMPLE (that means the threads would be spliced everywhere), the statistical tests would have shown NOTHING they would argue that the data is consistent. Just like the data for Oxford and Zurich were self consistent, it was Arizona which showed that something is strange with the sample, see Remi van Haelst paper:http://www.shroud.com/vanhels3.htm So the hypothethical reweave was not so perfect, and anomaly was detected in statistical analysis. Hugh Farey : 4) Finally, however invisible mending is carried out, it results in the new threads running alongside the old threads for some distance as they merge. Sadly I don’t have the much touted Shroud App, as I don’t have an i Pad, but if the HD image is as clear as they say, it will surely be possible to examine the area around the C 14 excision and post a screen grab showing these parallel weavings. If the interweaving hypothesis is true there must be hundreds of them. Once again: How do you VISUALLY distinguish between 16th century, and 1st century thread? And once again, for all those who still believe in 1988 carbon dating: IF IT HAD BEEN SO GOOD, SO WHY WAS IT SO BAD?.","date":"2013-08-10","mins":"1:36 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-40964","author":"o_k","post":"Hugh: “The average weight of the shroud. I can’t find when this was established. When was the shroud weighed – and how?”. Pierluigi Baima Bollone in his “Sindone, 101 domande e risposte” (Ed. San Paolo, Cinisello Balsamo (MI) 2000) claims that the Shroud with ALL additions (patches, holland cloth etc.) weighted 2.5 kg. Emanuella Amrinelli in her “La Sindone – Un’immagine Impossibile” (Edizioni San Paolo – Cinisello, Balsamo (MI), 1996) is more precise 2.450 kg. The Shroud is 437×111 cm. Thus the average weight WITH ALL ADDITIONS is 50.5 mg/cm^2. The sample of 7×1 cm, of the Shroud itself, weighted 300 mg, that is 42.85 mg/cm^2. The larger cut part of 8.6×1.6 cm weighted 478.1 mg (36.89 mg/cm^2). The average weight of the Shroud itself is based on textile analysis. Maria Grazia Siliato in “Sindone Mistero Dell’Impronta di duemila anni fa” (Edizioni Piemme Spa., (AL) 1997) quotes 4 analyses: A. Timossi: 23 mg/cm^2 G. Raes 25 mg/cm^2 R. A. Morris 25 mg/cm^2 G. Riggi 20+/ 3 mg/cm^2 Hugh: “Or is the rather precise mg/cm2 number an over precise conversion of what was originally not much more than a guess, based on the overall weight and size of the whole thing?” I can understand variety of say 25 %. But an error of 40 110 %? No way, Hugh, no way. Hugh: “flax fibres have a density of about 1.45g/cm3” The Shroud is about 0.34 mm, that is 0.034 cm, thick. Assuming 1cmx1cmx0.034 cm cuboid, and that threads occupy 50 % of its volume, we have a result of 24.7 mg/cm^2. To be 42.85 mg/cm^2, they must occupy 87 % of its volume. Hugh: “My explanation for the anomaly is the inaccuracy of the quoted mass of the whole shroud, coupled to local variations in weave density. Can you account for the increased density of the C 14 area?” “Local variations” you say. Thus, YOU HAVE ADMITTED WITH YOUR OWN WORDS THAT THERE WERE VARIATIONS IN C 14 AREA..","date":"2013-08-11","mins":"9:25 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-40966","author":"o_k","post":"Hugh: “I don’t know what visual difference there would be between 16th and 1st century thread. I was arbitrarily assuming that there was some!” Hugh, don’t be naive. Had it been so, the whole C 14 dating would have been unnecessary ; ) Hugh: “Apart from that, new thread might be visibly thicker/thinner, looser/denser or even rougher/smoother. A demonstration that 15 of the Schwortz sample threads look different from the rest would be convincing, but I don’t find that.” Hugh, in every population of 45 threads, no matter of age, there would be 15 or so that are “visibly thicker/thinner, looser/denser or even rougher/smoother.” From Siefker & Spicer paper (L2.0): “Due to the fact that the threads and the cloth are handmade, both the number of fibers per thread and their diameter vary up to 50%” Hugh: “The banding seems clear right the way across the photos. Are you suggesting a patch over, say, 20cm wide and high? Only that would account for the uninterrupted stripes that are clearly observable.” Maybe. Maybe the patch goes much deeper than everyone thought, with new vs old threads ratio gradually changing. BTW: the bandings go interrupted from the main cloth to he side strip, but WE KNOW that the side strip was carefully re attached to the main cloth. So perhaps it is possible. Hugh: “However, to suggest that that means that no information at all can be derived from the radiocarbon results is absurd. Assuming that the raw data is acceptable, and at no point do our statisticians dispute that, a collection of 12 independent dates between 1200 and 1400 cannot be rejected with a simple, “It could be from the 1st century, it could be from the 11th century.” Statistically, that’s an imprecision vastly more unlikely than the precision quoted by the Nature paper.” Hugh: If 12 pairs of 1st and 17th century threads blended together were carbon dated, each of the 12 datings would reveal the date of around 1000 AD. The average of 12 measurements would also be around 1000 AD, and statistical tests would show that the results ARE PERFECTLY CONSISTENT. The average spin of the electron is 0, but the only possibilities are either +1/2 or 1/2. I assume that you know a little bit about the basics of statistics. Statistical analysis show that the ASSUMPTION of normal (gaussian) distribution centered around 691 years BP, SHOULD BE REJECTED. Thus, WE ARE IN THE MIDDLE OF NOWHERE. The carbon dated material consist of a mix of older and younger material. IT IS UNKNOWN WHAT IS THE RATIO AND AGES OF OLDER AND YOUNGER. Manipulating those parameteres, the Shroud may be from 11 century AD, or 11 century BC. Hugh: “In this case, you don’t have to distinguish between threads of different ages; you simply have to show a bit of anomalous weaving, where two threads run alongside each other for a few millimetres, as the new thread is woven into the pattern. As I say, there must be hundreds of places where that happens.” Perhaps thousands. And it not necessarily may be a problem. Remeber that the threads have limited lenght. Wilson in his 1978 book, Appendix D, gives a register of samples taken from the Shroud in 1973. The mentioned threads are 8 up to 28 mm long. Anomalies in weaving may be present everywhere, even at the opposite end of the cloth..","date":"2013-08-11","mins":"9:50 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-40981","author":"o_k","post":"Still, only 7×1 cm part weighting 300 mg is important. That gives 42.85 mg/cm^2 Only little less then 50.5 mg/cm^2 for the whole set: Shroud +backing cloths. So what? Yes, the Fee Waters & Jull has the proper density. But it had never been carbon dated (so the results of Damon et. Al NOT neccesarily may apply there, that means WE DON’T know its true age). Have you ever considered the possibility that this is NOT a patch, but ORIGINAL part of the cloth? Hugh: “Finally, I suspect that shroud cloth has local density variations all over. They are artefacts of the properties of the original hanks of thread of which it is made, and do not indicate patches of interweaving.” They may be undistinguishable from patches for a naked eye, without proper scientific examination. If you had not read this already: http://www.shroud.com/pdfs/chronology.pdf and Addendum: http://www.shroud.com/pdfs/addendum.pdf.","date":"2013-08-11","mins":"1:59 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-40987","author":"o_k","post":"Hugh, I don’t want to prove that this area was patched. I only want to show that patch hypothesis cannot be so easily rejected, as those who defend C 14 dating claim. Relying mostly on Flury Lemberg’s opinion. We can end this discussion at this point, if you want..","date":"2013-08-11","mins":"2:12 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-41214","author":"o_k","post":"My argument is that if the side strip had been re attached to the main cloth, in the way that the bandings go uninterrupted from main cloth into it, so perhaps reweaved part with the same weave as the original cloth (but consistng of the mix of new nad old threads) could be reattached to it without interrupting the bandings. But that’s just my observation, and better don’t refer to me.The side strip is attached with stichings, and several possible seams have been reported in the C 14 area you have them in the papers I presented. BTW: Uninterrupted bandings argument is probably taken form this paper by Jackson http://www.shroud.com/pdfs/jackson.pdf He is presenting there an alternative (IMHO less plausible) theory of C 14 error, and from obvious reason he wants to dismiss other competing theories like reweaving. But sceptics very often take out of context this one particular sentence from Jackson’s paper, to prove that C 14 dating was correct..","date":"2013-08-13","mins":"4:50 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-41201","author":"o_k","post":"Richard Savage : – So far, the banding seems to preclude the reweave hypothesis… Richard, of course I wanted to say: “BTW: the bandings go UNINTERRUPTED from the main cloth to he side strip, but WE KNOW that the side strip was carefully re attached to the main cloth. So perhaps it is possible.” So IMHO it does not preclude reweave. Richard read this: http://www.shroud.com/pdfs/chronology.pdf and Addendum: http://www.shroud.com/pdfs/addendum.pdf There you find more info. I’m getting a little bit tired of this discussion..","date":"2013-08-13","mins":"2:08 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-41190","author":"o_k","post":"Richard Savage : – I had never seen the “deeper” possibility discussed. Can you refer me to something? No. Just my thinking..","date":"2013-08-13","mins":"10:28 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-40896","author":"o_k","post":"Maybe, anyway this is now a history. The only hypothesis that makes sense to me is that this particular corner was once torn apart (which is quite plausible, because it was the place where Shroud was usually held during various exhibitions etc.), and had to be carefully reconstructed, thread by thread using linen, perhaps with some minor cotton contaminants. There are various opinions whether it is possible, but if it is, there would be no visual difference to original cloth. Warps original, wefts new. All carefuly attached to original cloth. There are several stitches in that area, one made by Princess Clothilde (Wilson, Blood & Shroud, figure 20). Anyway, we know now that the sidestrip is identical like the rest of the cloth, and was carefully aattached to main body. So it is perhaps posibble. Now some calculations using data from here: http://depts.washington.edu/qil/datasets/uwten98 14c.txt Year Year BP 1865 117 1695 115 1535 301 25 1983 Lets assume 70 % of new material vs 30 % of old. Then: If the repair was performed around 1865 or 1695, we have: Year BP Year (closest) 632.5 1385 (633 BP) or 1305 (627 BP) If the repair was performed around 1535, we have: Year BP Year (closest) 771 1275 (767 BP). Almost exactly where carbon dating pointed! Remember, that the Damon et al 1988 paper was massacred by statisticians. Remmeber C Hi square value of 6.4, later corrected to 8.43 (or 8.76) by Haelst and others. Remember that the average weight of the Shroud is 20 25 mg/cm^2, while weights of the samples were 36 43 mg/cm^2. Then, I would like to quote a classic, to all those who still mantain that carbon daitng results are fine. IF IT HAD BEEN SO GOOD, SO WHY IS IT SO BAD?.","date":"2013-08-10","mins":"9:42 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-40883","author":"o_k","post":"Just one note, Hugh. Hugh Farey : I think the word ‘unconditionally’ is important here. ‘True scientists’ don’t accept anything ‘unconditionally.’ However, I can understand very well their accepting the date as established. 1) In their “Evidence for the skewing of the C14 Dating” paper (http://www.shroud.com/pdfs/marben.pdf), Benford and Marino present a diagram of where they think a patch was attached. However, this would only produce the required dates if the 12 sub samples actually tested were cut in ribbons from top to bottom of the original same strip. If the samples were cut ‘horizontally,’ then one would expect some dates to be entirely 16th century, some to be entirely 1st century, and only, possibly, a middle one to be a mixture of the two. As we know, a substantial portion of the Tucson sample was not dated at all, but retained. The dated fractions would therefore be almost entirely 16th or 1st, with no intermediates. We also know that the Zurich sample was first cut horizontally into two pieces, and then these two further divided. The dates obtained by the Zurich labs do not match a “patch” scenario. . You mean this: https://encrypted tbn1.gstatic.com/images?q=tbn:A Nd9 Gc T Eb S Enu9 X 8at5 N6 R Eam U Yuo Av Fj AZ Ud RV0u Efj4w7 Ofx g b5 Q ? But this is not a diagram of the patch! This a GRAPH for proposed percentage of 1st vs 16th centuries material in the carbon dated sample. BTW: the patch not necessarily must come from 16th century. Several repairs were made later, for example in 1694 by Sebastian Valfrè, and in 1868 by Clotilde of Savoy, the latter IMHO is the main suspect..","date":"2013-08-10","mins":"6:58 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-215979","author":"o_k","post":"Thanks Pam, that’s a paper that has to be studied in depth..","date":"2015-12-09","mins":"7:09 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-75959","author":"o_k","post":"Hugh, I would be interested in exactly opposite, an occasion (except the Shroud) when a carbon date has been “investigated until the anomaly is explained.” rather than “routinely thrown out”. If carbo date is evidently wrong, than it is usually thrown out 9and perhaps even unmentioned) due to unknown anomalies, and no one cares about the reasons. It would be simply a waste of time and not worthy of efforts..","date":"2014-02-02","mins":"9:33 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75960","author":"o_k","post":"Charles O.K. One case that is well known is the third century AD martyrs Felix and Regula whose purported bones (in Zurich, I think) dated from 50 BC. 50 BC is circa 2050 years BP 200 AD is 1850 AD, 300 AD is circa 1750 AD. I would say that 200 years offshot is nothing surprising and happens sometimes… Remember that C 14 dating is not a precise, but a statistical measure, and some deviation is expected..","date":"2014-02-02","mins":"9:37 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75994","author":"o_k","post":"Maybe, or maybe not. Truly, we don’t know either way..","date":"2014-02-02","mins":"12:28 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75961","author":"o_k","post":"For those who are interestd, here are the results of internal, paleographical, and C 14 dating of some of the Dead Sea Scrolls: As anyone can see, there are conflicts of about 200 years in some instances. (from James C. Vander Kam, Manuskrypty znad Morza Martwego, Cyklady 1996, str. 31, Tabela 1).","date":"2014-02-02","mins":"9:42 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75966","author":"o_k","post":"“p.n.e.” means BC, “n.e.” AD or CE, “Data wewnetrzna” internal dating, “Data paleograficzna” paleographic dating, “Data AMS” AMS dating..","date":"2014-02-02","mins":"9:52 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75938","author":"o_k","post":"There are some intriguing cases where bones supposed to have been of Christian martyrs are actually found to be pre Christian Examples?.","date":"2014-02-02","mins":"8:03 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75977","author":"o_k","post":"There are possibilities of contamination that makes the samples apparently older peat or some other contamination with old organic materials, fossil fuels, and so on, although it is usually much easier to make the apparently samples younger..","date":"2014-02-02","mins":"10:38 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75976","author":"o_k","post":"Hugh: There; I’ve done what you wanted. Any chance of finding one for me? Check #13, and this: http://en.wikipedia.org/wiki/Carbon dating the Dead Sea Scrolls When 4 Q258 (#24) was tested at Tucson its result was so anomalous (129 255 or 303 318 CE) that the laboratory was asked to retest another sample from the same document. The second test (#21) yielded a result (50 BCE 130 CE) that was deemed more satisfactory. If there are some systematic anomalies in many datings in one particular region, then of course some reasearch of its nature is performed. But not in every single case of anomalous dating. There are simply no resources for that. Besides, and taking the matter in a little bit cynical way, in case of anomalous dating both the customers and the Carbon dating labs have common interest in throwing it out. The customer because he is not interested in revealing that his conclusions are in conflict with “infallible” C 14. The laboratory because it can mantain reputation of its own reliability, and general myth of C 14 infabillity..","date":"2014-02-02","mins":"10:35 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-48527","author":"o_k","post":"Just posted it for others. It is obvious to me that Jones is wrong on this matter..","date":"2013-10-23","mins":"1:12 pm","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-48534","author":"o_k","post":"Has anyone noticed that in case of all 4 samples (Shroud and controls) Arizona has the greatest scatter of the results, while the two others have much smaller? Look for example: http://www.shroud.com/nature.htm Table 1: Sample 1 (Shroud) Arizona max: 591 BP Arizona min 701 BP, Difference 110 BP Oxford max: 795 BP Oxford min 730 BP, Difference 65 BP Zurich max: 733 BP Zurich min 635 BP, Difference 98 BP Sample 2 (Control) Arizona max: 996 BP Arizona min 829 BP, Difference 165 BP Oxford max: 980 BP Oxford min 915 BP, Difference 65 BP Zurich max: 1036 BP Zurich min 890 BP, Difference 146 BP Sample 3 (Control) Arizona max: 2137 BP Arizona min 1838 BP, Difference 299 BP Oxford max: 1990 BP Oxford min 1955 BP, Difference 35 BP Zurich max: 1984 BP Zurich min 1886 BP, Difference 98 BP Sample 4 (Control) Arizona max: 825 BP Arizona min 602 BP, Difference 123 BP Oxford max: 790 BP Oxford min 710 BP, Difference 80 BP Zurich max: 760 BP Zurich min 646 BP, Difference 114 BP IN ALL CASES SCATTER OF ARIZONA > ZURICH >OXFORD ! In what order the datings were performed? 1. Arizona 2. Zurich 3. Oxford. THIS IS VERY SUSPICIOUS!!! Dan please, post it on the blog..","date":"2013-10-23","mins":"1:44 pm","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-48525","author":"o_k","post":"Schafersman is nothing but &^%*%$. This guy cannot argue in other ways than insulting everyone around, and boasting how smart he is, while others are nothing but “pseudosciensce”.And his obssesion about polarizing microscope is it a kind of fetish for him?.","date":"2013-10-23","mins":"1:01 pm","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-48538","author":"o_k","post":"Scatter of all samples including controls? I said: IN ALL CASES SCATTER OF ARIZONA > ZURICH >OXFORD ! And the chronological order of datings was 1. Arizona 2. Zurich 3. Oxford. Do you think this is accidental. According to the protocoles all laboratories had to work independently and at the same time! But it is very likely that ALL raw data were secretly manipulated to look crispier, or some info between laboratories was shared how about sample properties so the results look better. Everyone who had laboratory courses during his studies knows how strong the temptation is to “improve” results, so they are closer to expected!.","date":"2013-10-23","mins":"1:56 pm","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-48546","author":"o_k","post":"Hugh: Forget error bars, and callibrations for a moment. Just look at Table 1, BP dates only, max and min. I checked it half a dozen times, I cannot see error of mine. The regularity is quite obvious..","date":"2013-10-23","mins":"2:55 pm","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-47009","author":"o_k","post":"One interesting thing, the dates 1260 1390 were announced on press release on 13th October 1988, however, “Nature” received paper ON 5 DECEMBER. With unacceptable Chi^2 value of 6.4, which meant that the RESULTS ARE INCONCLUSIVE and should be rejected. The true date of the Shroud was thus UNKNOWN (the 1260 1390 was just only average of the Shroud and possible alien contaminants). However on 13th October it was PUBLICALLY announced that the Shroud was a FORGERY, and all who thought otherwise were idiots, while MAINTAINING SILENCE on unacceptable Chi^2 value. This is nothing but MANIPULATION. Only after such sensational announcement the results were sent to “Nature”, which in turn, COULDN’T AFFORD to simply reject the paper. In my opinion, the place for Tite, Sox, Hall, Hedges, was definetly in prison. Even despite the mesurements themselves were properly done..","date":"2013-10-11","mins":"8:12 am","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","title":"Low Level Fraud? and more"},{"id":"comment-48549","author":"o_k","post":"Hugh Farey : Apart from getting your first max and min muddled, you’re quite correct about the raw data, but it translates into almost the opposite of what you claim when calibrated. Your suspicions cannot be said to be supported by your observations. Forget callibration, just scatter of BP data. Calibration (which depends on absolute values of BP dates not difference between max and min) can only distort the dating intervals due to the shape of calibration curve. The BP dates are what is actually measured. And the results of Oxford are less scattered for Zurich, which are less scattered than Arizona. For both the Shroud and all the samples. This matches the chronological order in which all the laboratories performed their datings. Can be this an accident?.","date":"2013-10-23","mins":"3:15 pm","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-48522","author":"o_k","post":"See callibration curve: http://depts.washington.edu/qil/datasets/uwten98 14c.txt.","date":"2013-10-23","mins":"12:49 pm","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-47060","author":"o_k","post":"“Nothing whatsoever can be deduced about regions of the linen even 1cm away from the sample.” That’s right. The other parts of the Shroud can be dated to 14th century as well as 1st or any other. We cannot conclude on the measures performed outside the cut sample. The rest are attempts to shift responisbilties from archidiocese to laboratories and vice versa. However, both sides can be blamed for 1988 carbon dating fiasco..","date":"2013-10-11","mins":"1:56 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","title":"Low Level Fraud? and more"},{"id":"comment-47181","author":"o_k","post":"Micheal Winter, quoted in Petrosillo & Marinelli’s “Enigma of the Shroud”, at the end of the chapter about Viking horn dated to 2006 AD..","date":"2013-10-12","mins":"5:46 am","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","title":"Low Level Fraud? and more"},{"id":"comment-47054","author":"o_k","post":"Deviation from postulated statistical distribution of the results. The high values of Chi2 have a very little chance of being obtained if the postulated distribution is correct. That means that the chance that our null hypothesis (the t5 distribution of the results centered around 691 BP, that means 1260 1390) is correct, are very slim. In other words: the results ARE NOT RELIABLE..","date":"2013-10-11","mins":"1:46 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","title":"Low Level Fraud? and more"},{"id":"comment-192479","author":"o_k","post":"John. Why don’t you try to educate the CNN “expert” yourself on his own profile? Don’t forget to send him Rogers’ as well as Benford & Marino papers..","date":"2015-03-05","mins":"7:08 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-47055","author":"o_k","post":"However even had Chi2 been within acceptable boundaries, that would NOT exclude that the datings were wrong due to rewaeving or any other reason..","date":"2013-10-11","mins":"1:47 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","title":"Low Level Fraud? and more"},{"id":"comment-192722","author":"o_k","post":"Hello Dave. A few months ago we talked about image overlaying and Manoppello. I asked you about making the similar video like that https://shroudstory.com/2014/08/19/matching faces is it possible/ with Manoppello and Shroud faces I sent you. Do you plan to make it?.","date":"2015-03-07","mins":"4:16 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192732","author":"o_k","post":"Dave Hines: Because of this, the video requires narration along with the images and I need more knowledge of it’s history before I can present it. I must have a more complete understanding of the image and it’s history before I present it. It is good to know you have devoted your time for this task. As to additional information of it, most important links are within my presentations: https://shroudofturin.files.wordpress.com/2014/06/manopello shroud comparison3d.pdf https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf Also there is a nice academic publication in English about it: https://shroudstory.com/2014/11/01/new publication on manoppello veil/ Of course the book “the Face of God” by Paul Badde is must read..","date":"2015-03-07","mins":"6:30 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193189","author":"o_k","post":"A lot of information about Manoppello is available on this site: http://manoppello.eu/eng/ Louis: Both Giulio Fanti and Paolo Di Lazzaro identified the cloth as linen. Although he does not talk about this in the interview posted yesterday: Thanks for the interview, I enjoyed it much. It is not easy to dismiss the Manoppello veil as a painting Yes it is very easy for several “experts” who “know better” Thomas de Wesselow is one example. Kelly: Mouth is open on veil, closed on Shroud. Mouth is open on both cloths: Shroud and the Veil. On both cloths teeth are actually visible (see my post https://shroudstory.com/2014/07/11/teeth reconsidered/ ) This is crucial here, as you will see next. I would like to reveal some of the improved overlays of the Shroud/Manoppello faces on which I have been working for some time: Here you have a Shroud negative image with some details marked (including teeth for example). Here is Manoppello with slightly adjusted color balance and marked features (and rotated by the angle of about 2 degrees) Here is 1:1 overlay of both of them. Any comments?.","date":"2015-03-12","mins":"5:39 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192733","author":"o_k","post":"Dave Hines: The Manoppello image looks like a painting, it does not look authentic, yet could very well be authentic, I believe it is possible the cloth did make contact with Jesus and color was added by someone after. How that was done? I don’t know. But it looks that way. Contact image with color added later. Part Original, Part Not Original. Here you fragment of the scan of right eye from Aszyk Treppa book: The average size of the threads on Manoppello is about 0.12 mm yet there are some extremely sharp details (like the iris border ) marked on 1 2 threads! For me it’s simply unimaginary how could such thing been obtained with human hands..","date":"2015-03-07","mins":"6:43 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193252","author":"o_k","post":"Hello Kelly: 2. What happened to the rest of the mustache/beard on the veil relative to the Shroud? Who knows? ; ) Generally one should stress out, that although the faces on both Shroud and Manoppello are supposed to be the same, and represent the same person, they are not identical in every detail. Contrary to popularised phrase, Manoppello is not a positive of the negative image on the Shroud, not in technical sense. There are some differences, notably the open/closed eyes, the more prominent beard and mustache on the Shroud image (although this still may be illusion, as the imaging mechanism on the Shroud depends on body cloth distance, also modulated in masterful way by several lighter and darked bands across the cloth so the initial visual impression may be misleading, and one should not trust it too much), as well as slightly different position of lips and opened mouth. Yet this does not undermine the conclusion The hypothesis (whether realistic or not) is that those are two images taken at disitnct time moments, just before (the Shroud) and just after the Resurrection (Manoppello). The key is to determine whether those faces actually are meant to represent the same person, and it seems yes. 3. For me, the main things with overlays is what about control images, i.e. Doing the same analysis on 3 unrelated bearded men there has to be a certain amount of overlap between all of them how much, I think, can be relatively subjective. The cloning enthusiasts show a pretty reasonable morphing/overlay of Prince William & the Shroud, including bearded & clean shaven PW versions. The cloning enthusiast rarely (in fact never) work so methodically as I do. Their morphing presentations may be visually stunning, but they are most likely erronous – which can be shown, if studied carefully, point by point. As far as I remember, I cannot recall any morphing experiment that used marked features of the face (like I presented above) to show whether the positions of common details on both images actually correspond with each other, whether the proportions are actually the same etc. And absolutely no callibration. When you look at one face at one moment, and on another next moment, you may be visually deceived, and suppose they are the same, even if they are entirely different. And in another way, even if the two faces are actually the same, if overlay is performed badly, you can be under impression that they are different. So the need for as much clarity as possible and objective criteria is evident. Here you have my callibration images. I based my measuremnts on both Shroud Scope and Sister Blandina atlas, which contains live size images with callibration distances. Even then, the actual size of both these images remained uncertain and there is still a possibility of a few % margin of error. Generally, the most important criterion, is not the perfect overlay of images (which may give false positive results sometimes), but the correspondence of wound marks. In my previosu presnetation I have shown a dozen or so congruence points, showing that those two faces are actually related to each other beyond coincidence: With the knew, better and more detailed overlay their number will likely grow. Do the front & back images of the veil superimpose/overlay precisely or is there some drift? As I have only obverse side of the Manoppelo, I can’t directly answer that. Yet as the differences between obverse and reverse sides of Manoppello concern only minor details (and even that cannot be taken as proven, as much depends on light conditions when pictures were taken it has been observed that different conditions led to different details perceived, more details in Treppa Aszyk book), I suppose that yes..","date":"2015-03-12","mins":"7:30 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193301","author":"o_k","post":"0. The controls: One should be careful with controls and interpret them carefully. Of course it is entirely possible to find a face with similar proportions, but one should think about what it means. For example Roberto Falcinelli wrote a paper sceptical about Manoppello, arguing that it was painted by Durer, due to some ambiguos phrases in some old art history books and visual similarity with his famous Christ like self portrait. I responded to him and compared his self portait with Manoppello (see https://shroudstory.com/2014/09/02/manoppello shroud and durer a short presentation by o k/ ). The match is perfect, but it does not mean that Manoppello was painted by Durer (which is as likely as the theory that Leonardo faked the Shroud) rather the other way around, that Durer was influenced by Manoppello. On the contrary, the similarity of wounds is very significant showing that both images (Shroud and the Veil) are intended to represent the same person. The question is: why? 1. The banding issues on both the Shroud and the Veil are entirely different things, as image mechanisms on both cloths seems to be entirely different. The Shroud is monochromatic image, in which the intensity of coloration depends on body cloth distance (the 3 D effect). There is also some influence of lighter/darker bands which modulate the intensity. On the contrary, the Veil is polychromatic, and does not include the 3 D effect similar to that of the Shroud. There are other issues like the transparency and the alleged presence of multiple images encoded in it, which are visible under different lighting conditions. There are of course bandings on Manoppello, yet their relation with the images have not been explored yet, as far as i know: 2. See above. The issues regarding the Veil are entirely differnt then that of the Shroud. On the Veil we don’t have the real bloodstains (probably) but rather images of bloodstains. 3. Unfortunately not yet. I talked with some people who saw it, and they claimed that one needs to see it live, because the photographs do not reflect the whole aspects of this image..","date":"2015-03-13","mins":"4:42 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193304","author":"o_k","post":"Treppa performed extensive photographical documentation of the Veil under different lighting conditions. He took a series of photographs at different light angles and compared details (below are some scans from his publication): The most impressive of details seem to be strand (which has been noted and discussed previously by Fanti & Jaworski, see http://manoppello.eu/eng/pdf/research.pdf and http://manoppello.eu/eng/index.php?go=kosmyk and ) and mouth:I must say however, that I have some reservations about some of those claims. There is still possibility of visual illusions coming into place, and one should be careful in interpretation of such phenomena..","date":"2015-03-13","mins":"5:28 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193303","author":"o_k","post":"Well, the best thing to discuss multiple images is to read Treppa & Aszyk publication: http://kiw.ug.edu.pl/en/religion/659 ikona z manopello prototypem wizerunkow chrystusa.html.","date":"2015-03-13","mins":"5:27 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193941","author":"o_k","post":"Hi OK, Your placement is correct. Overlay film is nearly done. Stunning match. When the Manoppello image is displayed and photos are taken, sometimes they are displaying the back side of cloth with rights and lefts reversed. Just like The Shroud, some photos are the mirror image and others the true image. I did not know Manoppello Image was a double sided image when I started this, Mirror image on one side and the true image on the other. That caused delays and confusion. I did the overlay both ways. Slow motion fades and zooms. Fined tune match. Margin of error 1 or 2 millimeters right or left, up or down at the most. If it is off at all. Near Perfect. I compared it with the Pantocrator and another. 3 overlays in total. Nice,looking forward for a final result..","date":"2015-03-21","mins":"5:50 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193306","author":"o_k","post":"“Your comment is awaiting moderation.” So we have to wait for details to come….","date":"2015-03-13","mins":"5:29 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194257","author":"o_k","post":"Thanks Dave. Congratulations on your great movie. I still have impression that you might have placed Manoppello a mm or two too high, but anyway good job. It is hard to place it 100 % accurate for the first time (to minimalize the possible shifts from ideal position), so many different approaches are necessary. I leave aside your personal interpretation of number 3. I disagree with some of the “3” coincidences of yours, but you have right for your own opinion. Very good job..","date":"2015-03-24","mins":"5:38 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-31476","author":"o_k","post":"If I may revive this old topic. I have a very interesting book written by Andre Marion, and Gerard Lucotte, titled Le Linceul de Turin et la tunique d’Argenteuil (Shroud of Turin and the Tunic of Argenteuil). What they write in it? 1.The blood on the Tunic of Argenteuil has been confirmed to be AB, and as Kelly Kearse pointed, it is not true that the old blood always reverses to AB. 2.They found cristals of urea attached to erythrocytes in the blood. It suggests that the owner of the Tunic suffered from hematidrosis sweating blood, just like Jesus in the Garden of Gethsemane (Luke 22:44). 3. The blood marks on back of the Tunic, were compared to those from the back side of the Shroud, first in 1934, and later in 1997, using Marion’s computer models. They correspond to each other. 4. As for C14 dating, the Tunic was buried beneath the ground in the parish gardem dyring the French revolution. It was probably contaminated then, so radiocarbon dating is not reliable..","date":"2013-04-21","mins":"10:47 am","url":"https://shroudstory.com/2011/11/03/modified-geiger-counters-to-measure-holiness/","cat":"carbon_14_dating","title":"Modified Geiger Counters to Measure Holiness"},{"id":"comment-193587","author":"o_k","post":"Hello Dave, you haven’t posted any images, so I cannot comment on that..","date":"2015-03-17","mins":"5:12 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-31490","author":"o_k","post":"It has been studied by Metchild Flury Lemberg in 1973 1974. According to her, the main relic consist of remmants of ancient 1st 4th century cotton (or wool, there are conflicting versions) Roman cloth, attached to much later layer of cloths from 1512, 1890 and 1891, for strenghtening of the structure. It is probably the outer Tunic, and that of Argenteuil is the underside tunic, worn directly on the body. So the two are not in conflict, actually, and both can be authentic. BTW.: In Poland, there is a very interesting album by Catholic journalist Grzegorz Górny, titled “Świadkowie Tajemnicy” (Witnesses of Mystery, Inquest of the Relics of Christ) http://en.rosikonpress.com/dzial 51/towar karta 150/Swiadkowie Tajemnicy.html Although uncritical at times, but very interesting, and recommended by Barrie Schwortz: http://www.shroud.com/books.htm.","date":"2013-04-21","mins":"2:23 pm","url":"https://shroudstory.com/2011/11/03/modified-geiger-counters-to-measure-holiness/","cat":"carbon_14_dating","title":"Modified Geiger Counters to Measure Holiness"},{"id":"comment-100848","author":"o_k","post":"Charles: as there are other relics or phials of Jesus’s blood ,etc, documented amend they can’t all be authentic. Really Charles? Have you performed all necessary research on the subject? Calculated all the volume of blood they contain? Checked blood types? Or just it is your sceptical dogma that they can’t be all (or any of them) authentic?.","date":"2014-04-18","mins":"2:29 pm","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","title":"Okay, we will need to wait several weeks"},{"id":"comment-172800","author":"o_k","post":"Remember that this paper is 20 years old..","date":"2014-11-24","mins":"9:00 am","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"id":"comment-172848","author":"o_k","post":"Which excludes any external contamination as significant factor (remember we need ~66 75 % of new material to skew the date from 1st to 13 14th century). The only viable possibility is that the majority of the sample consists of interpolated threads =reweaving hypothesis..","date":"2014-11-24","mins":"4:28 pm","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"id":"comment-172852","author":"o_k","post":"Yes Hugh, I have been fully aware of that even before our first discussion on the topic. But I would say not that is “almost certainly wrong”, but almost certainly correct, and confirmed. I am glad however that by narrowing options we are coming to the final solution of the 1988 carbon dating puzzle..","date":"2014-11-24","mins":"4:55 pm","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"id":"comment-172651","author":"o_k","post":"Hello everyone. I know this argumentation from Maria Grazia Siliato’s book, Całun Turyński: Tajemnica Odbicia Postaci sprzed 2000 lat (original title ‘Sindone Mistero Dell’Impronta Di Duemila Anni Fa’), Wydawnictwo M , Kraków 1999 pg. 36 38. Yet the problem is much more complex, as we don’t know precise weights and sizes of the radiocarbon samples. Silliato adopts that the entire sample cut by Riggi was 8.1cm x1.6 cm, weighting 478.1 mg (thus surface area of 12.96 cm^2 and average density of ~37 mg/cm^2). Then that it was trimmed to rectangle 7cm x1cm , wieght 300 mg (7 cm^2 surface area, 42.85 mg average density). Yet those numbers are not precise, and different values are also quotred. This has great impact on average density. For example G. Fanti, F. Crosilla, M. Riani, A.C. Atkinson, A robust statistical analysis of the 1988 Turin Shroud radiocarbon analysis, Proceedings of the International Workshop on the Scientific Approach to the Acheiropoietos Images, ENEA Frascati, Italy 4 6 May 2010 http://www.acheiropoietos.info/proceedings/Riani Web.pdf quoting Walsh suggest different size of the sample that is 8.1 cm x2.1 cm =17.01 cm^ 2 for the whole 478.1 mg sample (thus giving density of ~28 mg/cm^2 ), and 8.1×1.6 for reduced 300 mg sample which corresponds to the 23.14 mg/cm^2 density. But on the other hands the trimmed part circa 8.1 cm x0.5 cm (which is also more trianglethan rectangle like) would have ~ 44 mg/cm^2 density, if calculated as rectangle, and the absurd 88 mg/cm^2 if calculated as triangle. The fragment retained in Arizona (Rachel Freer Waters, Timothy Jull , Investigating A Dated Piece Of The Shroud Of Turin, RADIOCARBON, Vol 52, Nr 4, 2010, p 1521–1527 http://digitalcommons.library.arizona.edu/objectviewer?o=http%3 A%2 F%2 Fradiocarbon.library.arizona.edu%2 F Volume52%2 F Number4%2 F33737617 d6e4 4797 ba23 fb8e0f303abe ,see also Report on the STERA, Inc. University of Arizona Radiocarbon Dating Laboratory Macro Photography 30 August 2012 http://www.shroud.com/pdfs/arizona.pdf ) has a size of approx. 0.5 cm x 1cm and the weight of 12.39 mg, thus the density is 24.78 mg. Basing on Shroud Scope I suppose that the size of the whole radiocarbon sample was closer to 8.1 cm x2.1 cm than 8.1 cm x1.6 cm. I think the average density of what was dated can estimated as ~ 30 mg/cm^2 that is maybe a little bit heavier than average for the whole cloth, but not much. I once thought that those density calculations had great significance for re evaluation of 1988 carbon dating, but now I don’t think so that their importance is only marginal. There are other, much stronger arguments that 1988 dating was flawed. And one final note the 41.65% of new material is not enough. To skew the carbon dating from 1st to 13th 14th century one needs that 65 75 % of the sample to be interpolated material (depending on date of interpolation). This leaves invisible reweaving as practically the only viable option..","date":"2014-11-23","mins":"5:56 am","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"id":"comment-48523","author":"o_k","post":"Gian Marco Rinaldi : I wonder what are the other nine lines of evidence. The historical record agrees with the C14 result. There is no evidence pointing to the first century, unless you want to consider the Tiberius coins. Here http://www.shroud.com/pdfs/doclist.pdf and here: http://www.shroudofturin.com/shroud.html But nothing can convince biased, fanatical Shroud haters that left is left, right is right, mirror right is left, and mirror left is right..","date":"2013-10-23","mins":"12:53 pm","url":"https://shroudstory.com/2013/10/23/quote-for-today-on-carbon-dating/","cat":"carbon_14_dating","title":"Quote for Today on Carbon Dating"},{"id":"comment-101633","author":"o_k","post":"Thanks Hugh. What concerns me more, is the carbon dating of the Tunic of Argenteuil and the Sudarium of Oviedo, particularly the later. All those objects are considered to be related to each other, as there is evidence they were worn by one and the same person. Just to remind everyone: The (wool) Tunic of Argenteuil has been carbon dated twice: * first dating, by Saclay: 1480 +/ 30 years BP, that is 530 650 AD at 95 % * second dating, by Archeolabs 1260 +/ 40 years BP, that is 670 880 AD at 95 % The Sudarium of Oviedo has also several times. Various accounts exist: Dating in the 80s, by two laboratories: Tuscon and Toronto: * 653 786 AD Toronto , and 642 769 AD (in other version 642 869 AD) Tuscon. Micheal Hesemann, on the other hand, reprots 540 869 AD * Mark Guscin reports (http://www.shroud.com/pdfs/n65part6.pdf): Just weeks before the congress took place, new samples from the Sudarium were subject to carbon dating. Five samples were dated from five different cloths –three of them came up with the expected date, while the cloth from an Egyptian mummy returned a date of any time in the 19th or 20th centuries. The laboratory immediately concluded that the cloth (and the mummy) were fakes. The sample from the Sudarium was dated to around 700 AD. Scientist César Barta spoke about the carbon dating process, emphasising the fact that if carbon dating is always absolutely accurate, then we could just as well finish the congress there and then. However, there were several points to bear in mind– in specialist carbon dating magazines, about half the samples dated come up with the expected date, around 30% with an “acceptable” date, and the other 20% is not what one would expect from archaeology. The laboratory used (via the National Museum in Madrid) said they were surprised by the result and asked if the cloth was contaminated with any oil based product, as oil is not cleaned by the laboratory processes used before carbon dating and if oil is present on a sample, the date produced by carbon dating is in fact the date of contamination. Finally, the history of the Sudarium is very well established and there are definite references to its presence in Jerusalem in AD 570 and at the beginning of the fifth century. Micheal Hesemann in a recent book (“Chusta Chrystusa, Naukowcy na tropie zmartwychwstania” pg. 230 232, that is polish edition of “Das Bluttuch Christi”) gives some more details. The dating was performed by Beta Analytic Inc. From Miami, and the result was 660 890 AD, similar to the Archeolabs dating of the Tunic of Argenteuil. What is the source of contamination, assuming all those relics date from the time of Christ? In case of the Shroud it is most probably the invisible reweave that’s the only non conspirational and non sci fi thesis hat makes sense. But what about Tunic and Sudarium. We should remember that the Tunic was buried in Parish garden by Abbot Ozet during French revolution, and is heavily contaminated by both organic and non organic contaminant. Marion and Lucotte suggested it was contaminated by calcium carbonate and performed some tests which showed that it is not entirely removed by cleaning procedure, but I don’t believe it was the sole factor in the case of Tunic. Than one should ask question what about Sudarium? Most probably it is wax it was found all over the surface of the Sudarium. But is that amount enought? Some calculations: I assumed the true age of the relics to be 1983 BP, roughly the time of Christ. The date of contamination to be 200 BP, roughly 17th 19th century (see http://depts.washington.edu/qil/datasets/uwten98 14c.txt ). Thus the amount of contamination to skew the carbon dating is : * for Miami dating of Sudarium, and Archeolabs dating of Tunic, 1260 BP (670 880 AD)=38 % * for Saclay dating of the Tunic, 1480 BP (530 650 AD) =26 % Now assume that the source of contamination is wax, roughly 80 % of which is carbon. Thus the amount of contamination: *for Miami dating of Sudarium, assuming 44 % of linen consisting of carbon =25 %, assuming assuming 25 % of linen consisting of carbon =16 % * for Archeolabs dating of Tunic, assuming 50 % of linen consisting of carbon =28 % * for Saclay dating of the Tunic, assuming 50 % of linen consisting of carbon =18 % Possible? I don’t know. Weighting other evidence for authenticity of those items it should be possible. Another puzzle with carbon dating to solve..","date":"2014-04-20","mins":"7:53 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . ."},{"id":"comment-101428","author":"o_k","post":"Some unrelated question, the mass amount of carbon in linen is about 25 %, right? What is in the wool? Anyone knows? I would like to make some calculations….","date":"2014-04-19","mins":"5:58 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . ."},{"id":"comment-101713","author":"o_k","post":"Henrik: Very interesting given the historical hints that the shroud may have been boiled in oil some time before 1500, Antoine de Lalaing: “To prove if it was the true Shroud, it was boiled in oil, tossed in fire, laundered different and numerous times. But one could not efface nor remove these imprints and marks of our sweet Lord.” From Ray Roger’s FAQ (response to question 4 see http://www.shroud.com/pdfs/rogers5faqs.pdf): Image and control fibers show identical crystal properties. The image is not a scorch. The cloth was not heated, not even boiled in oil. (emphasis mine). Hall claimed that the contamination of Oxford sample was no greater than 1 % The contamination was not reason for anomalous C14 result in case of the Shroud. In case of the Sudarium or Tunic of Argenteuil it is probably different..","date":"2014-04-20","mins":"2:16 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . ."},{"id":"comment-125463","author":"o_k","post":"With statistics one should be extremely careful. The main problem are not numbers but interpretation. One should always remeber that radiocarbon dating is in fact, a statistical measure the C 14 decay is probabilistic process, the total number of C 14 atoms remaining follows Poisson distribution (but in practice we use Gaussian distribution to which Poisson converges for high counts of atoms). Theoretically it is possible for the Shroud to be from the 1st century, while dating randomly gives the range of 13th 14th century but the purely random chances for this are negligible (“one in trillions or so”). However, if there is a patch, the assumption of randomness must be thrown out. It is calculated that for 1st century Shroud and 16th century patch approximately 75 % of the material must be a patch, to give circa 13 14th century result. But what the chances are that the proportion is 75 % (and not 20 % or 90 %), we cannot say it is beyond the domain of statistics. We cannot give a number. It is a pity that several people, including Stephen, do not understand this. The problem of equivocation of terms may lead to much confusion..","date":"2014-05-29","mins":"7:21 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-101596","author":"o_k","post":"Thank you Hugh. Mark Oxley writes: The conversion factor between the weight of the Turin Shroud cloth and its carbon weight is 24%. (see http://www.shroud.com/pdfs/oxley.pdf ). You claim ~40 %. May humidity play some role? In case of wool, we all know how it absorbs water, so mass amuont of carbon should be lower. According to http://en.wikipedia.org/wiki/Beeswax , An approximate chemical formula for beeswax is C15 H31 COOC30 H61, thus ~ 80 % of it is carbon. Thus for Oxley’s 24 % , and 75 % new vs old ratio (assuming circa 16th century contamination) needed to switch the date of the TS from 1st to 14th century, the amount of wax contamination must be approximately 47 % (let’s say 50 % for 66 % new vs old, assuming later 17th 19th century contamination, it needs to be 37 %). Possible? Hardly, I think, but one must finally detemine the sizes and masses of the samples their average density should be 2x average density of the TS..","date":"2014-04-20","mins":"4:44 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . ."},{"id":"comment-89690","author":"o_k","post":"Is there a real possibility (just possibility) that this piece may contain some evidence for the so called ‘invisible mending’ theory, put forward by Benford & Marino, and supported by Rogers, Villareal and others? May it be the real motivation why this sample is still kept secret from the public? Not suggesting anyone being dishonest of course….","date":"2014-03-16","mins":"4:45 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-125530","author":"o_k","post":"Yes, Hugh, but the problem is that we cannot just “pick a random percentage between 0 and 100.” The chances for contamination percentage are not random factor. That’s why all those considerations are in fact meaningless..","date":"2014-05-29","mins":"1:56 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-125551","author":"o_k","post":"Stephen is either right or wrong when he says, “it would be a miracle if the Shroud being first century `just happened’, by a combination of chance factors, like contamination and medieval repairs, etc, to have a radiocarbon date of 1325 +/ 65, only 25 30 years before the Shroud’s first appearance in undisputed history.” He is wrong. Such coincidence, although strange, is entirely possible if we assume reweave hypothesis but extremely unlikely for other hypothesis like oil wax contamination, neutron radiation, carbon monoxide enrichment or so. For several reasons, that I do not discuss here. However one should note that actual results are not so perfectly centered at 1325 +/ 65. The results in Nature are (Table 3 http://www.shroud.com/nature.htm) AD 1273 – 1288 at 68 % confidence (that is 1 sigma) and AD 1262 – 1312, 1353 – 1384 at 95 % (2 sigma) confidence. So coincidence with first presentation of the Shroud at Lirey in 1356 is rather accidental than related, IMHO. Important note: confidence and significance are two different terms! Or, are we thinking that there is no way to 1) know the odds, which is one thing, or there is no way to 2) know if Stephen is right, which is something altogether different. This could be the subject of the year. There is no way to know the odds that contamination or patch would appear. That’s not the purely random factor that we can estimate..","date":"2014-05-29","mins":"3:16 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-125542","author":"o_k","post":"Let me ask the dumb questions. Are the odds against getting a 1325 +/ 65 date astronomical? Is there any way with math to show that he is right or wrong? Depending on point of view. The question “Are the odds against getting a 1325 +/ 65 date astronomical?” is imprecise. It can be interpreted in various way, depending how you set a problem. Even if the cloth is from the 1st century, with no contamination, patches etc., obtaining 13th 14th century date is theoretically possible, but not even astronomically but cosmologically unlikely. But if there is a patch or contamination, considering it this way makes no sense. There is no way to calculate the odds. As you can see, all depends on primary assumptions. There is always a risk of equivocation..","date":"2014-05-29","mins":"2:49 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-210386","author":"o_k","post":"Nothing ends the Bella et al. Editorial is a manipulation. Which can be shown..","date":"2015-09-14","mins":"1:40 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210341","author":"o_k","post":"The scope of manipulations by Bella and colleagues is horrific. I think someone has to deal with it..","date":"2015-09-14","mins":"3:15 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210390","author":"o_k","post":"Yes, Thibault there will be an answer. You don’t have to even have an expertise in this field to show that this whole editorial is a pseudoscience. Just careful analysis of their wording and paper content… I wrote: “Bella et al. Editorial is a manipulation. Which can be shown.” I have sent Dan some of my observations on that. I hope they will be published..","date":"2015-09-14","mins":"3:18 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210451","author":"o_k","post":"The first one who is mixing things up is “Professor” Marco Bella..","date":"2015-09-15","mins":"9:55 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-211196","author":"o_k","post":"About pseudoscience, here it is what is written on Wikipedia: ————— Pseudoscience is a claim, belief or practice which is incorrectly presented as scientific, but does not adhere to a valid scientific method, cannot be reliably tested, or otherwise lacks scientific status. Pseudoscience is often characterized by the use of vague, contradictory, exaggerated or unprovable claims, an over reliance on confirmation rather than rigorous attempts at refutation, a lack of openness to evaluation by other experts, and a general absence of systematic processes to rationally develop theories. A field, practice, or body of knowledge can reasonably be called pseudoscientific when it is presented as consistent with the norms of scientific research, but it demonstrably fails to meet these norms. ———— Decide by yourself what can be considered pseudoscience among “invisible mending theory”, Rogers’ paper and our editorial, using as benchmark the above definition. Your editorial, Marco. Obviously. Don’t teach your grandmother how to suck eggs..","date":"2015-09-25","mins":"3:24 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210732","author":"o_k","post":"And any possible implications of that?.","date":"2015-09-19","mins":"2:21 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-70730","author":"o_k","post":"The question might have to be whether Dr Rossman, despite his extra terrestial mineralogical expertise, is sufficiently expert in the matter of carbon dating organic matter using the equipment which Caltech seems to deny it possesses. Yes, Dave this is what is a greatest concern here. Could FTMS be used to perform carbon dating? In theory yes. I don’t know about practice. But alleged dates seems to be quite accurate, so maybe they have some validity. Obviously neither Rossman nor Caltech are interested in having their names linked with the TS. But I don’t believe that nothing happened. Look at the Caltech statement: He has never been involved in age dating studies and has no expertise in the area. But the basic principles of C 14 datings are not so hard to understand we count ions, just what FTMS does. Furthermore, the Division of Geological and Planetary Sciences has never had FTMS instruments. But what about other Divisions? Generally, although those results are highly suspect, and hardly reliable, if there is some truth in them, it can be another indication that TS dates to the begining of the Common Era. And if dated thread had been a spliced one this would explain a 1000 year difference. If FTMS were completely unsuitable for C 14 dating, then there would be probably no making sense results at all..","date":"2013-12-31","mins":"9:37 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"},{"id":"comment-125689","author":"o_k","post":"This madness should stop. I am thinking about compiling some paper about the results of all datings of the Shroud of Turin, Sudarium of Oviedo and the Tunic of Argenteuil, as they are related objects. The issue is in fact much more complex than most people think. The only problem is I have little time now..","date":"2014-05-30","mins":"6:52 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","title":"The Collapse of the Fraud Theory"},{"id":"comment-70664","author":"o_k","post":"Hugh: You mention the weird, unverified, undocumented caim that a secret test was made of an unauthorised, unverified thread by a scientist improperly making use of an AMS machine out of hours, mysteriously coming up with two dates, 800 years apart, with an average of 600 AD. I wish I knew more about it, but it says nothing about the regular process of C14 dating as a procedure, and still less about the conduct of the three official laboratories. If it suggests anything, it does not suggest a splice, but a 7th century Byzantine fake. If you haven’t heard about this already, check this: http://www.shroud.com/late02.htm (see “Caltech Responds To Benford/Marino Claims”). Actually the story is repeated by several sources, for example Mark Antonacci’s Ressurrection of the Shroud as well as 1993 Zenon Ziółkowski book Spór o Całun Turyński. There were witnesses for that claim, and although Caltech and Rossman deny this took place, I hardly believe it. We can be certain one thing, FOR SURE SOMEONE IS LYING HERE! The strange results (200 AD one end of the thread, 1000 1200 AD another) can be easily explained if the thread had actually been a splice of two threads, one from 1st century, and another from 16 19th. The presence of starch was also reported..","date":"2013-12-31","mins":"5:06 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"},{"id":"comment-125925","author":"o_k","post":"Hugh: I will discuss all those issues later, in more papers when I have more time. The controversies surrounding C 14 datings are in fact much more complex than most people think, but I’ll explain the matter later..","date":"2014-05-31","mins":"11:17 am","url":"https://shroudstory.com/2014/05/31/were-both-ventral-and-dorsal-corners-of-the-shroud-rewoven/","cat":"carbon_14_dating","title":"Were both ventral and dorsal corners of the Shroud rewoven?"},{"id":"comment-70633","author":"o_k","post":"Apart from a few conspiracy theories, there is nothing to suggest that the actual carbon dating was badly carried out or inaccurate Except: * Unacceptable results of statistical tests of significance (Chi square was one of them Damon et .al actualy refuted themselves when they presented Chi^2 value of 6.4) * Attested presence of cotton, silk, and blue satin in Arizona sample (Riggi himself admitted that “fibers of other origins had become mixed up with the original fabric”) * Three textile expert blindly suggesting the Zurich piece was rewoven, when blindly reviewed by Benford and Marino. * The works of Adler suggesting different chemical composition of C 14 sample, than the rest of the Shroud. * The works of Rogers suggesting presence of dye in the Raes/C 14 area & negative tests on vanillin on the main TS fibers, contrary to Raes/C 14 samples. * The works of Villareal suggesting the presence of splices in Raes/C 14 area, as suggested by Benford&Marino. * The presence of cotton fibers in Raes/C 14 area, contrary to Raes sidestrip and the main area of TS * The results of Riani, Atkinson, Crossilla and Fanti suggesting there is a spatial trend in C 14 area, which is hard to explain otherwise than by patch hypothesis. * The supposed unauthorized C 14 dating of one Raes thread, which gave the results circa 200 Ad for one end of the thread, and 1000 AD (some sources claim 1200 AD) for the other it is quite probable that this thread was actually a splice. * The contradiction with iconographic data (Pray Codex for example) * The contradiction with Sudarium of Oviedo, another Shroud related object, which existence can be asserted back to the 7th century at least. * The contradiction with the Tunic of Argenteuil, another Shroud related object, which existence can be asserted back to circa 800 AD at least. The C14 date of roughly 1300 plus or minus 60 years or so has been accepted both by the ‘authenticists’ (who think the date accurately measured a blend of 30% 1st century and 70% 16th century fibres) and the ‘non authenticists’ (who think the date accurately measured unmixed 12th/13th century material). The average date is unquestioned, the problem is that the quality of the measurements is questioned (statistics show they are probably unreliable) and the conflict with other data..","date":"2013-12-31","mins":"3:19 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"}]
