[{"id":"comment-193543","author":"o_k","post":"It’s interesting Joe. Maybe it was from some other purported burial cloths. Remember, in Constantinople there were three alleged burial cloths of Jesus, as I have shown here: https://shroudstory.com/2014/05/11/the three byzantine burial cloths of jesus/ Maybe it was a piece of one of them and there is still a chance that this may be authentic piece of Jesus other burial cloths (even if not coming from the Shroud of Turin)….","date":"2015-03-16","mins":"6:16 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-208358","author":"o_k","post":"There is an update on Barrie’s site, if someone is interested: http://www.shroud.com/latebrak.htm#summer.","date":"2015-08-16","mins":"5:26 am","url":"https://shroudstory.com/2015/08/16/another-st-louis-shroud-of-turin-conference-in-2018/","cat":"conference","title":"Another St. Louis Shroud of Turin Conference in 2018?"},{"id":"comment-193480","author":"o_k","post":"John. May I ask you one thing? Have you ever made any single college or University course on quantum mechanics? Just asking..","date":"2015-03-16","mins":"6:05 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-211105","author":"o_k","post":"Colin, why don’t you try yourself? Or do you have $$$ up to the hilt?.","date":"2015-09-24","mins":"3:42 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-193501","author":"o_k","post":"Fine, John. Simply there are many people who misuse the term ‘quantum’ while actually having no knowledge whatsoever about quantum mechanics. That’s why I am asking. Another thing is that my experience teaches me that the long speeches using a lot of rhetorics usually indicate that the guy has little meaningful to say about the subject, and simply wants to make impression on his audience. This style is maybe more suitable for lawyers than scientists who usually use shorter and more specific style of expressing their views. This is nothing personal. Just general thoughts. I am sure the basic terms like self adjoint operator, eigenvalues and eigenvectors are not strange to you..","date":"2015-03-16","mins":"9:14 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-211107","author":"o_k","post":"Expenses? Certainly – but all hobbies involve some expense. If mine weren’t for linen, chemicals, microscope etc it would be for bikes or golf clubs or craft beer… Similar issue. Anyway:.","date":"2015-09-24","mins":"3:58 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211102","author":"o_k","post":"David, the problem is what you consider “objectivity”. The problem is that nowadays, we are being manipulated from all sides on unparalleled scale. All media, TV, radio stations, newspapers, internet portals have their own point of view, which they often want impose the public. Being really ‘objective’ this days is really hard task. And in the world of the Shroud, it is even harder. Everyone has his or her opinion on all relevant matter, and judging who is right, and who is wrong, is extremely hard, especially for inexperience person. Which is often utilized by some people mostly sceptics, but not only who try to spread confusion, blur the image, raise thousands arguments against usually accepted view (no matter if those arguments are nonsensical for those who have expertise), multiply the problems, issues , “what ifs”, and so on. Thus raising uncertainty and mistrust in usually accepted results resulting eventually in a growing number of preys, who disappointed by apparent lack of “objectivity” and with heads full of doubts easily swallow the “alternative concepts” prepared by those who spread confusion, no matter those “alternatives” are actually rubbish. When you deal with such controversial topic as the Shroud, be prepared for plenty of half truths and manipulations. And don’t get caught!.","date":"2015-09-24","mins":"3:31 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-51066","author":"o_k","post":"John Klotz : Now that I think of it, the actual the core of all Revelation is knowledge. The [P]ower of the Shroud is the knowledge it reveals to us. I know that I am not alone when I say that there was a moment when studying the Shroud, I felt for the first time, I began to understand the suffering that resulted from the passion and crucifixion of Christ. And I believe, that the FACTS revealed by the Shroud point to only one direction: the Resurrection. (For example: the existence of rigor mortis, the lack of evident putrefaction and the image in itself) Applying Occam’s Razor to the Shroud, the Resurrection is the simplest explanation of the Shroud. Really. Fully agree..","date":"2013-11-13","mins":"6:57 am","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-211103","author":"o_k","post":"I am grateful for Barrie for his interesting comments in one article on the orthochromatic film that Enrie used and the way it distorted the images on the Shroud. In the Santo Stefano complex of churches in Bologna there is a chapel dedicated to the Shroud which is still using a Jackson / Jumper computerised three dimensional model of Christ based on these distorted images. Charles, shut up with this nonsense..","date":"2015-09-24","mins":"3:33 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-98725","author":"o_k","post":"However, the Shroud is not a hologram, in any of the various senses of the word. Hugh, I know that those are artificial holograms based on Enrie, but Petrus Soons deeply disagree with you: http://shroud3d.com/home page/introduction holographic observations in the shroud image holographic theory All these observations pointed to the fact that there is a great probability, that apart from the 3 D distance information in the gray scale of the image there could also be holographic information hidden in the Shroud. If it confirms (Shroud photographs from multiple angles desirable), then… good bye sceptics!.","date":"2014-04-12","mins":"12:42 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-126054","author":"o_k","post":"Who is the scientific comittee of the conference?.","date":"2014-06-01","mins":"4:47 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126315","author":"o_k","post":"Andrea, Charles. Based on the modest sources available to me, and using some simple deduction , I can easily show that there were actually three different presumed burial linens in Constantinople: https://shroudstory.com/2014/05/11/the three byzantine burial cloths of jesus/ It was proposed first time on 1910 and repeated many times. Yes. Hynek in his 1937 book treated it as an established fact. I think it is important to stress that the Blachernae collection of relics had nothing to do with the imperial collection in the palace at the other end of Constantinople. I think this argument is meaningless based on the analysis of the unusual situation in Constantinople in 1203 1204..","date":"2014-06-02","mins":"2:26 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126416","author":"o_k","post":"Charles: The collection of relics in the imperial palace was well protected and survived the 1204 sacking. The Blachernae chapel was open to the public with regular processions and displays of its relic collections ( as seen by de Clari). It got sacked in 1204 as it was so exposed on the coastline and a long way from the centre of town. There is absolutely no evidence or reason for moving a relic from the safety of the imperial palace ( where the emperors jealously guarded their impressive collection)to the exposed Blachernae in these troubled years. Another point to clarify. De Clari saw a shroud in the Church of Mary in Blachernae – he makes this quite clear. Charles, I understand your point well but this is not the slightest problem for the presence of the Shroud in Constantinople, as one can give several plausible hypothesis for moving the Shroud from Bucoleon into Blachernae and back. There is one scenario I give in my article http://ok.apologetyka.info/ateizm/ile byo pocien pogrzebowych jezusa cz1,749.htm If you, or someone else asks, I can give a summary of it, but not at this moment, I am quite busy..","date":"2014-06-03","mins":"2:41 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126519","author":"o_k","post":"O.K. As there is not the slightest piece of evidence that any of the jealously guarded relics in the imperial palace were transferred outside the palace, surely it is futile to speculate why such a transfer might have taken place. Let’s just accept the de Clari saw a cloth with perhaps only a single image of Christ on it (cf. The Besancon Shroud) in the Shrine dedicated to the Virgin Mary, theotokos in the Orthodox tradition, in the Blachernae district of Constantinople. There is absolutely no reason to link it with any relic in the imperial collection. Charles, it is futile only for the convinced sceptics. There is one very valid reason why the shroud might have left his well guarded home at Bucoleon: the newly installed by the crusaders young emperor Alexios IV. Here is the translation of the key paragraph from my article: And then the shroud with image of Christ appears in Blachernae. In the same temple, where Byzantines in the year 860 were praying before the veil of Virgin Mary for the repulse of the Rus. Now, every Friday there is raised (Robert de Clari literally writes that it “raises”) a shroud with a visible figure of Christ – that is, someone greater than even the Mother of God. Had this show been performed there for a long time? Nothing indicates that, although it is known that during the Kommen period emperors started to prefer Blachernae Palace instead of the Great Palace, or the Bucoleon Palace. But in 1203 Constantinople, everything was possible. For example, that Alexios exhibited previosuly carefully hidden from the eyes of the common people burial linens; to calm down the people and convince them about divine support for his rule. The same people who could at any moment throw him out of throne which eventually happened..","date":"2014-06-03","mins":"11:51 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126526","author":"o_k","post":"Sorry,OK ,nothing that would convince a historian. De Clari does not report any crowds there and it was in the hippodrome that the emperors rallied support. Probably the cloth had probably been exhibited on a regular basis for centuries just as the icon of he Virgin in the same church had been. Rather nothing would convince a sceptic. For Zdzisław Pentek, the polish translator of de Clari’s chronicle, there has been no doubt that the shroud refferred by de Clari was actually the Shroud of Turin. To exhibit a holy relic on hippodrome instead of church? If you read Holger Klein ( and you must if you want to speculate about the relics in Constantinople) you will see that there’d were other relics that were paraded by emperors in the streets at times of crisis, e.g. Fragments of the True Cross and favoured icons that were always placed higher in the hierarchy of relics than any of the burial linens. Yes but this does not apply to the Shroud moreover with the image of Christ. The common people are unworthy of seeing the splendor of the God man himself. That’s how they thought. Methinks it is you who are fitting the story to your agenda! I have performed many fittings in my life, and I know that some of them are good some are not. But this is basic tool we fit the story to the data, both you and me. The problem is whose fit is better. There are of course some weak points in all those testimonies about the presence of the Shroud in Constantinople something you, Andrea, and other sceptics want to exploit. But the evidence for the presence of the Shroud in Constantinople is quite strong especially when one combine iconographic arguments with historical documents. And BTW, as I presented, we can be sure that there were at least three different burial (including one with the image) cloths stored in Constantinople the fact one should always have in mind..","date":"2014-06-03","mins":"12:37 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126552","author":"o_k","post":"OK. What we need is evidence. There is no evidence of any transfer. There is no evidence for most of the events that took place, as they were simply not recorded by historians. And that’s not a problem. Do you know how far out of town the. Blachernae chapel is? About 6 7 km from Bucoleon palace circa 1 h walk. Many people on the countryside, even today have longer way to go to church on Sunday. How ever would an emperor expect to rally support there? Th e emperor would appear in the hippodrome next to the imperial palace to rally support in the largest arena in he city. The relics would be paraded in the streets around the hippodrome. Byzantines liked much subtler way. The barbarian crusaders are walking on the streets of the City of Constantine. But no worry, the Christ Himself raises on His Shroud in popular Blachernae church so everything will be fine. God favors the new emperor. That’s the message to deliver. This still does not mean, of course, that the Blachernae Shroud was originally in the imperial palace as, although there is no evidence for this, it could have been bought to the Blachernae Church much earlier and directly from Jerusalem as the robe of the Virgin Mary was. “Although there is no evidence for this…” Charles can’t you see that you use double standards? One another important note. Several authors report that Nikephoros Kallistos (14th century ) reported that Empress Pulcheria placed burial linens of Christ in Blachernae church, when it was built. Quite possible. We know that circa 1380 a fragment of burial linens was sent from Constantinople to the bishop of Suzdal, and later Metropolitan of Moscow Dionysius I long after the Shroud of Turin was displayed in Lirey. But we do know also that there were THREE different relics of Jesus burial cloths in Constantinople, including one with the image. Evidence here https://shroudofturin.files.wordpress.com/2014/05/burial linens of constantinople.pdf Charles, I recommend reading this before playing next games..","date":"2014-06-03","mins":"2:59 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126565","author":"o_k","post":"Where Nikephoros Kallistos reported that Empress Pulcheria placed burial linens of Christ in Blachernae church? Massimo Centini in “Alla Ricerca della Veronica” claims that in his “Church history” I. 32 33. I looked for the primary source, but unfortunately couldn’t find it in english..","date":"2014-06-03","mins":"3:55 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126573","author":"o_k","post":"Thank you, Andrea for your ad hominem attacks..","date":"2014-06-03","mins":"4:31 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126108","author":"o_k","post":"Yes, I meant reviewers – I have no doubt that the works will present good level, but I am concerned how prestigous they are. On another forum, I am currently massacring one fool, who wrote one silly sceptical article on the Shroud, and is refusing to accept any accept any paper except Damon et al, because Nature has impact factor of 38 or so, while Thermochimica Acta has around 1..","date":"2014-06-01","mins":"1:22 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126748","author":"o_k","post":"So Andrea, if you are so wise, tell us all what Kallistos actually wrote. At least you correct some misleading statement..","date":"2014-06-04","mins":"7:48 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126958","author":"o_k","post":"Nicephoros in Historia ecclesiastica XIV,2 nd XV,14 speaks about the translation at the Blachernae of the burial bands (ἐντάφια σπάργανα) of Holy Mary by Empress Pulcheria. One question for clarification: is there clearly specified that those ἐντάφια σπάργανα belonged to Mary?.","date":"2014-06-05","mins":"2:28 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126109","author":"o_k","post":"And BTW Joe, what do you think about the topic presented here https://shroudstory.com/2014/05/31/were both ventral and dorsal corners of the shroud rewoven/.","date":"2014-06-01","mins":"1:23 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127012","author":"o_k","post":"So can you provide us full quotations of appropriate verses? If there is so clearly stated that those are Mary’s ἐντάφια σπάργανα , so how the misconception with Jesus’ burial linens might have arised?.","date":"2014-06-05","mins":"7:31 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127100","author":"o_k","post":"You can find the text in Migne, PG 145 147. All Migne is online. Fine Andrea. You fulfilled your job, after I deliberately put a largely irrelevant note, that Several authors report that Nikephoros Kallistos (14th century ) reported that Empress Pulcheria placed burial linens of Christ in Blachernae church, when it was built. Actually I found this site http://www.ellopos.net/elpenor/greek texts/fathers/migne patrologia graeca volumes.asp?pg=13 some time ago looking for Kallistos, but downloading from it seems to be a little complicated..","date":"2014-06-05","mins":"3:16 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127216","author":"o_k","post":"Thanks, Andrea. As not being a professional historian, I try to utilize whatever I have at hand. That means I have torely on others. This does not mean that I don’t try to reach primary sources for verification purposes. So far, you haven’t refuted the conclusions from that paper..","date":"2014-06-06","mins":"2:32 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127281","author":"o_k","post":"2) Yes, I refer to your paper. The Greek text is wrong, the translation is not consistent with the text, the Latin text is quoted in an uncorrect way The Greek text is from Scavone, and the translation is his own paraphrase. Which latin text is quoted in uncorrect way (and what does it mean?). Any more errors?.","date":"2014-06-06","mins":"8:16 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127251","author":"o_k","post":"My aim is not to refute your paper. I have tried to explain that I consider your method unreliable, so from my point of wiew it is useless to start discussions about papers written in such a style. I think that now we have clear our positions, and we can draw our own conclusions. Thank you for the discussion. Thank you, I understand your point of view. Being an amateur historian, my sources are obviously limited, but it does not mean that I am not trying to perform critical analysis of whatever I have (and reach primary sources, if possible). But of course one can be only as good, as his sources. You wrote Sindonologists and internet are the only source for you, it seems. The few texts quoted in Greek and Latin sometimes are wrong, sometimes the translation does not correspond to the original. Does it refer to the quotations in my paper, or is that just a general reflection? I honestly admit that you can be very helpful sometimes when you are not prejudiced or irritating..","date":"2014-06-06","mins":"6:12 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127289","author":"o_k","post":"Andrea, maybe it is ‘contrary to your principles of seriousness’ but it may be a good lesson for me, as a poor, naive, copying everything sindologist. If you tell me what’s really wrong there, I will not repeat those mistakes again and again..","date":"2014-06-06","mins":"8:45 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127285","author":"o_k","post":"No matter, everyone knows that I am not professional historian. And I give my sources. And this paper is not ‘scientifical’ in your understanding of this term. I asked: which Latin text is quoted in uncorrect way (and what is the significance of this)? And whether are there more errors, that I copied from others? I simply want to know this..","date":"2014-06-06","mins":"8:34 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127349","author":"o_k","post":"Holy people, what a hate! The only good thing that, in my opinion, you could do, is to cancel a lot of pages from your “Apologetyka” websites. But I am sure you are not going to do it. So, what you call “a good lesson”, it is only the occasion for you to correct some mistakes, without changing the general approach of your website, that I do not approve at all. What do you even have against Apologetyka.info website? It is not even mine, but friend’s who allows me to publish articles there. It’s approach is, as the name suggest, Christian apologetics. Do you have something against it? Why? Have you even read those websites? Are you even able to do so (I know there is a Google translator, but anyway)? Czy znasz język polski, Andrea? As to the my article, do you even understand what this article is about? You claim it is not correct, but do not give explanation why. If it is indeed incorrect , then I want to know the reason. Publishing an article is an invitation for criticism which may be beneficial even to the author. But you refuse it, instead crying something about “99% sindonologists.” Truly I don’t want to be in those 99 %, rather in the 1 % that check the sources, but I am still learning it. Don’t you help me, Andrea?.","date":"2014-06-06","mins":"2:16 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126113","author":"o_k","post":"1. Joe, it is not this, the problem is propaganda. You know, ufologists also organize conferences, and Shroud sceptics like to compare us to them. That’s why I want to assure that the papers are properly reviewed by real specialists in appropriate field (history, medicine, physics, chemistry etc.), because sometimes I have to deal with guys who argue in the way: IF for Nature=38, for Thermochimica Acta=1, thus Damon et al. Is better than Rogers. 2. I don’t ask about Evaristo, but rather about how significant Quad mosaic argument is, and whether it is possible that the other corner is rewoven as well. And please, it would be good to post an answer for the second question in this topic https://shroudstory.com/2014/05/31/were both ventral and dorsal corners of the shroud rewoven/.","date":"2014-06-01","mins":"1:34 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-162052","author":"o_k","post":"I don’t understand, may I ask you for explanation, Andrea?.","date":"2014-10-13","mins":"2:23 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-135275","author":"o_k","post":"Fragments of Rogers book are available on Google Books: http://books.google.pl/books?id=p n84sc4ay YC&printsec=frontcover&hl=pl#v=onepage&q&f=false.","date":"2014-07-04","mins":"6:20 am","url":"https://shroudstory.com/2014/07/04/anticipating-the-conference-barrie-schwortz-on-ray-rogers/","cat":"st_louis_2014","title":"Anticipating the Conference:  Barrie Schwortz on Ray Rogers"},{"id":"comment-162063","author":"o_k","post":"I suppose, but let Andrea speak, if he has courage to do so..","date":"2014-10-13","mins":"3:04 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-169889","author":"o_k","post":"Wait for my response to that paper, Dan will post it this evening..","date":"2014-11-08","mins":"12:12 pm","url":"https://shroudstory.com/2014/11/08/another-st-louis-paper-available-the-halo-study/","cat":"st_louis_2014","title":"Another St. Louis Paper Available: The Halo Study"},{"id":"comment-133355","author":"o_k","post":"Test comment.","date":"2014-06-28","mins":"12:20 pm","url":"https://shroudstory.com/2014/06/26/anticipating-the-conference-bruno-barberis-on-the-two-ways-of-understanding-the-shroud/","cat":"st_louis_2014","title":"Anticipating the Conference:  Bruno Barberis on the Two Ways of Understanding the Shroud"},{"id":"comment-133444","author":"o_k","post":"Test posting.","date":"2014-06-28","mins":"1:27 pm","url":"https://shroudstory.com/2014/06/26/anticipating-the-conference-bruno-barberis-on-the-two-ways-of-understanding-the-shroud/","cat":"st_louis_2014","title":"Anticipating the Conference:  Bruno Barberis on the Two Ways of Understanding the Shroud"},{"id":"comment-128868","author":"o_k","post":"Dave, I have a feeling that Charles is simply looking for a pretext for another brawl here. As I have no time for this already, I suggest simply ignoring him for this moment..","date":"2014-06-12","mins":"5:03 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128879","author":"o_k","post":"No, I think Charles has logic on his side. If you think the Shroud is a 13th or 14th Century creation, then you won’t be particularly interested in working on its earlier history; if you think it is the Mandylion of Edessa, then you need look no further; but if you think it may be genuine but definitely not the Mandilion, then another route to France (and other reasons for it not appearing till 1350) would be well worth pursuing. I don’t know any professional Byzantine scholars who are interested in the Shroud, but if Charles thinks there is stuff to explore, then let them explore it! Hugh,in that case I recommend you reading Remi Van Haelst, The Sindon Munda Of Kornelimunster, Compiegne And Cahors somewhere down on this site: http://resurrectionnowinc.blogspot.com/2011/01/shroud images throughout world.html.","date":"2014-06-12","mins":"5:42 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-132674","author":"o_k","post":"From the Life of St Nino (4th century woman who brought Christianity to Georgia, her life was written around 3 4 centuries later): ‘As they found the linen early in Christ’s tomb, whither Pilate and his wife came. When they found it, Pilate’s wife asked for the linen, and went away quickly to her house in Pontus and she became a believer in Christ. Some time afterwards, the linen came into the hands of Luke the Evangelist, who put it in a place known only to himself.’ http://books.google.pl/books?id=Tv3mx Vzr F o C&printsec=frontcover&hl=pl#v=onepage&q=Luke&f=false Luke was a companion of Paul….","date":"2014-06-24","mins":"9:21 am","url":"https://shroudstory.com/2014/06/23/anticipating-the-conference-frederick-baltz-proposes-a-new-reference-to-the-shroud-of-turin-in-galatians/","cat":"st_louis_2014","title":"Anticipating the Conference:  Frederick Baltz proposes a new reference to the Shroud of Turin in Galatians"},{"id":"comment-132476","author":"o_k","post":"And if I may ask: will be my info about Kornelimünster relics, which are being displayed at this moment, published or not? Maybe it is not directly related to the Shroud of Turin, but anyway, it may be useful for some historical research..","date":"2014-06-23","mins":"5:19 am","url":"https://shroudstory.com/2014/06/23/anticipating-the-conference-frederick-baltz-proposes-a-new-reference-to-the-shroud-of-turin-in-galatians/","cat":"st_louis_2014","title":"Anticipating the Conference:  Frederick Baltz proposes a new reference to the Shroud of Turin in Galatians"},{"id":"comment-130194","author":"o_k","post":"Off topic, Dan I hope you received my e mail with addendum to the Manoppello Shroud paper. And also the previous one about the problems with Shroud Scope..","date":"2014-06-17","mins":"7:02 am","url":"https://shroudstory.com/2014/06/17/anticipating-the-conference-robert-villarreal-on-an-alpha-particle-image/","cat":"st_louis_2014","title":"Anticipating the Conference:  Robert Villarreal on an Alpha-Particle Image"},{"id":"comment-134886","author":"o_k","post":"This one seems to be good, and I am looking forward towards it. I have been for a long time inclining that the traditional Barbet’s single nail through metatarsals of both feet is unlikely for several reasons. I preferred two nails theories, but such combined approach may be interesting, as it may potentially explain all questions about feet position and bloodmarks..","date":"2014-07-02","mins":"10:38 am","url":"https://shroudstory.com/2014/07/01/anticipating-the-conference-paul-maloney-on-the-stance-of-the-feet/","cat":"st_louis_2014","title":"Anticipating the Conference:  Paul Maloney on the Stance of the Feet"},{"id":"comment-126810","author":"o_k","post":"The key word here is, I think, speculations. But we will see..","date":"2014-06-04","mins":"2:02 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-135637","author":"o_k","post":"Joe, may I have a question for you? You once mentioned that you and Sue took the photo of Zurich sample (which you gave the textile experts for analysis) from Gino Moretto’s book. Can you confirm that? Because it seems I have this book within sight..","date":"2014-07-06","mins":"8:16 am","url":"https://shroudstory.com/2014/07/06/put-st-louis-on-the-map/","cat":"st_louis_2014","title":"Put St. Louis on the Map"},{"id":"comment-161360","author":"o_k","post":"Mechtild Flury Lemberg wrote an article on the reweaving – I haven’t got the reference as I am in Greece that showed her full examination showed no sign of any reweaving. Http://www.shroud.com/pdfs/n65part5.pdf (and illustrations: http://www.shroud.com/mechthild.htm ). But her conclusions seem to be completely wrong, for several reasons the latest reprot by Donna Campbell seems to be one of them: http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Home files/Updated report on the Consideration to the Uniformity and Effects of the Fabric in the Shroud of Turin 5 1.pdf But later on. She took Rogers, Benford, Marino to task for failing to explain where they thought the reweaving might actually be presumably it had to stop somewhere but they provided no evidence where. I am currently quite certain where the approximate border between patched and non patched area were but this would require writng a long presentation to show that, and I am currently too busy for that..","date":"2014-10-11","mins":"12:43 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-161379","author":"o_k","post":"Were you a member of the 2002 restoration team ? Were you or are you in contact with the people who performed the restoration ? No I just watched some photographs and read some papers on the C 14 the same photographs and papers that you have read, as they are publically available and I used some reasonable analysis of all the facts +some gut feelings. I can guess with great probability where the patch began and went through, and where it ends. There is nothing in Donna Campbell’s paper that suggests that any of the visible threads are not integral to the cloth. There is a phrase: “However, there are signs in the Shroud sample that direct the notion of mending or reweaving of the actual woven fabric.” (pg. 16) and there is a list of notions, suggesting this sample is anomalous. It does not prove alone that the new material was added, of course, however combining with direct examination of the threads (performed by Adler, Rogers, Villareal , Heimburger and others), we can be 99 % certain that there is somehow interpolated material there. Add to this the statistical and regression analysis it all makes sense. Contrary to Flury Lemberg theories about dirt, sweat and oil which we can say have been conclusively discredited..","date":"2014-10-11","mins":"1:40 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-161387","author":"o_k","post":"Maybe I am 99% certain there is none afer all. So how can you explain the failure of significance tests and the presence of gradient among the samples? The estimation of where the borders of the patch were, is pretty simple, trust me. I’ll try to show it to you this evening, so please wait..","date":"2014-10-11","mins":"2:28 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-161605","author":"o_k","post":"Hugh: 2) Results from a single sample are satisfactory as long as it is representative. It is true that this has been seriously questioned, but it not true that it has been discredited. On the whole, I find insufficient reason to doubt that the sample was indeed representative. As you will see, it has been discredited even in the Nature report itself! http://www.shroud.com/nature.htm 3) The chi squared test is a measure of similarity, it not something you pass or fail. If there is a 95% or greater chance that two results are of the same provenance, the hypothesis that they are is, by convention, considered established. If the chance is is less than 95%, then the hypothesis is not considered formally established. This is not the same as saying that it has been disproved. The figure for the Shroud is 94%. Not true! The Chi square for Shroud, as stated in Nature, is 6.4 for 2 degrees of freedom. The critical value for 5 % significance (we can than state that for a random there is only 5 % chance for obtaining higher values than critical) is 5.99, that is LOWER than 6.4 The significance for 6.4 value, 2 d.f. Is only about 4 %. The results stated in Nature fail this (and as Remi van Haelst has shown several others) significance test, which means that there is a systematical error the results are BIASED and cannot be considered credible. See http://calculus calculator.com/statistics/chi squared distribution calculator.html 4) Riani and Atkinson’s chronological gradient is significant, and indicates some discrepancy along the length of the radiocarbon sample strip. It does not discredit a medieval date at all, nor demand any interweaving, although some contamination may be possible. As it is significant, we can throw out 1260 1390 AD date! And as we have no further reliable data, in theory any othere date + later contamination/interpolated material is possible, both medieval and 1st century. And we can say there is no external contamination (I mean oil, dirt, sweat etc.) that may account for a chronological gradient (assuming those contaminants are not uniformly distributed). In the ‘Supplemetary information’ recently released from Oxford (http://c14.arch.ox.ac.uk/embed.php?File=preprints.php ) we can read ‘Yields are very good and higher than is usually found by for similar processed by the manual method’ i.e. Meaning that the samples were very little contaminated!. Neither Rogers was able to observe any significant contamination, which he should have spotted , had it been there! The only reliable explanation for the chronological gradient is the reweave hypothesis the presence of interpolated material in different ratio along the sample. 5) Rogers’s discovery of various contaminents may contribute to an understanding of the chronological gradient described above, but is not in itself any evidence of an interweave. Some of his conclusions, such as the use of a water soluble gum, lack credibility. No he wrote “In any case, this watersoluble, easily hydrolyzed gum would have been removed completely by the cleaning procedures used on the dated samples” (http://www.shroud.it/ROGERS 3.PDF pg. 193). And how can you say that his conclusion lacks credidibility on what basis? 7) The presence or absence of vanillin could be significant, as I have already said. So how do you cope with that? 8) Gilbert Raes discovered no differences between his sample and the Shroud. Later studies on the Shroud itself have attempted to show that the cotton content, if any, of the rest of the Shroud does not match that of the Raes sample. Whether the cotton is relevant or not is, as I have said above and many times before, dependant on rather better estimations of its quantity and location than have been determined so far. Dave B answered that..","date":"2014-10-12","mins":"6:54 am","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-161426","author":"o_k","post":"The estimation of where the borders of the patch were, is pretty simple, trust me. I’ll try to show it to you this evening, so please wait. Unfortunately not today. Maybe tomorrow, maybe later. Anyway, Poland 2:0 Germany..","date":"2014-10-11","mins":"6:00 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-161707","author":"o_k","post":"Hugh: my last sentence in this section should read “The figure for the Shroud is considerably less.” (I’m guessing about 85%). Do not guess, use calculator instead: http://calculus calculator.com/statistics/chi squared distribution calculator.html However, my principle point remains the same. Assuming the same sample was being tested, the probability of obtaining the Shroud results by chance is only 1 in 20. This is not a very high probability, and it falls below the chi squared 0.05 value of 5.99 (95% sure that the values are from the same sample). As I say, this means that the hypothesis that the measurements are from the same sample is not considered formally established. This is not the same as saying that it has been disproved. As I say above, there is still a good chance that they are. It’s not that. One should be extremely careful in understanding what all those terms mean. Generally we can say, that SIGNIFICANCE is the probability of OBTAINING the result of TEST STATISTICS as stated value or above, ASSUMING (this is the key here) the random scatter. That is if all scatter is random, what is a chance that the result will be x or higher. The point is that if the obtained value is higher than critical value (which is a little bit arbitrary, depenent on significance level we choose as critical), we should reject the ASSUMPTION that there is nothing but random scatter. In short: 5 % is NOT a probability that there is only a random scatter but the probability of obtaining value higher than critical, if there is ONLY random scatter. I cannot agree with your next point, which is that the Riani/Atkinson findings mean that the medieval date must be rejected altogether. A row of dates along a plank of wood, for example, also show a chronological gradient, but are not, on that basis, rejected altogether. The reasons for the gradient along the wood are different, and better understood, but the principle is the same. Riani and Atkinson’s findings say nothing about the overall accuracy of the date of the Shroud. This is apples and oranges. We know that there is a row of dates along a plank of wood, because trees grow for several years contrary to the Shroud. And Riani/Atkinson do not say that medieval date must be rejected only that 1260 1390 is unreliable. The Shroud may be from 12th, 7th, 1st century, or 3rd century BC we don’t know its true age. But what we know, we cannot consider 1260 1390 as reliable, as there is a mix of older and newr material, of unknown relative ages and ratio! Why Rogers’ water soluble gum would have been applied I can’t understand. As you say, that would have been washed off by the cleaning process. It would also have been washed off by a shower of rain. What was it for? It is a nonsense revealing your purpose. You try to imply that manipulator deliberately used some water resistant materials, so that dye would have not been removed during pretreatment cleaning process. It makes no sense. And what rain shower? the Shroud was carefully protected from any rains..","date":"2014-10-12","mins":"1:17 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-161739","author":"o_k","post":"Rogers identified a water soluble gum, which does not, to me, make sense. It doesn’t matter that it makes no sense to you. As Rogers was professional, I trust, he he was capable of establish what was actually (and what was not) on the C14 threads he received from Gonella. And if he claimed it was plant gum with alizarin dye, I have a good confidence that it actually was plant gum with alizarin dye, with no evidence to contrary. And no sweat, oil, dirt, as he mentions none. Thus the apparent gradient shouldn’t be attributed to contamination of that form, as does Flury Lemberg which is one of the several nonsense in her article..","date":"2014-10-12","mins":"3:35 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-36659","author":"o_k","post":"Dave:Yes, I can fully agree with what you wrote. “The world is very much wider and more complex than Old Europe may perceive.” And I can say also that “the world is very much wider and more complex than Anglosphere may perceive.” Just both sides should not ignore themselves, and listen what interesting the other has to say..","date":"2013-06-10","mins":"7:07 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-161743","author":"o_k","post":"What I am querying is the convention of the 95%/5% pass/fail criterion. The 0.05 border between acceptability and rejection is a sensible, if conservative, way of deciding whether a hypothesis should be accepted or rejected. If rejected, of course, that does not mean it is wrong, simply that it has not been confirmed to be right, by this convention. Http://www.shroud.com/nature.htm Table 2. The Control 1, Chi square value 0.1, significance 90 % The Control 2, Chi square value 1.3 significance 50 % The Control 3, Chi square value 2.4 significance 30 % The Shroud, Chi square value 6.4 significance 4 % !!! It definitely should have ring the alarm bell. But they instead chose to pretend that nothing happened. That all was fine and Shroud conclusively proved medieval..","date":"2014-10-12","mins":"3:45 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-36449","author":"o_k","post":"Louis: look at that page: http://manoppello.eu/eng/index.php?go=start Max: Maszloch writes his page (in Research section): “Traces of pigments were also found in other parts of the picture. Their presence may be explained by the custom of putting copies against the original in order to sanctify them. The analysis of the Image in infrared light did not show any sketch for the picture or any corrections whatsoever.” Also Falcinelli claimed that he had found some traces of paint. Besides, can we say 100% that the Veil is made of byssus, since it has not been removed from behind the glass since 18th century? Jaworski&Fanti paper can be found here: http://manoppello.eu/eng/pdf/research.pdf.","date":"2013-06-08","mins":"1:40 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36454","author":"o_k","post":"One “Holy Towel” from Constantinople was purchased by king Louis IX, transferred to Sainte Chapelle in France in 1247, destroyed in 1792 during French Revolution..","date":"2013-06-08","mins":"2:23 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36442","author":"o_k","post":"Thanks Max. I have read books of Badde, and Gaeta on the Manopello, as well as Falcinelli’s articles. I also have read Wilson’s “Holy Faces, Secret Places” where he presented a LOT of arguments in support of Manopello being Veronica (later picked up by Badde), and further in that book he DISREGARDED them in favor of a few 1620s copies which resembled the Shroud. Probably because he assumed IN ADVANCE, that Veronica must be nothing else than just a copy of the Shroud. Thanks to Wilson, no Anglophone wants to hear now about Veil of Manopello, which is a big shame. I asked just, when you claimed that the eyes on Manoppello are “man made” whether that meant that someone in the Middle Ages or Renaissance wanted to “correct” them with paint. Because Fanti and Jaworski claims that they are artifacts in 3 D processing of the Veil, and also some minor traces of paint have been found on the veil..","date":"2013-06-08","mins":"11:42 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36458","author":"o_k","post":"So we have, if I remember correctly: A: The Shroud. B The Veil of Manoppello In Byzantium there were TWO images considered as miraculous: A1 The Image of Edessa, known also as Mandylion or Tetradiplon AND B1 The Image of Camoulia, which was located near Edessa. The Image of Edessa was rediscovered in 525, or 544 CE. The Image of Camoulia served as Imperial Banner already in 574. According to Pfeiffer, the Image of Camoulia was sent to Rome in 705, just before the first iconoclasm began. In 944 the Mandylion was brought to Constantinople. By 969 (letter of Emperor Constantine VII Porphyrogennetos to his troops) Byzantine Empire had also alleged shroud of Christ among its collection of relics. If Mandylion=Shroud, then the original Mandylion had to be replaced by a copy. In 1204 the shroud with the image of Christ was stolen from Constantinople, according to Robert de Clari. By this time, the tradition of Veronica in Rome began. In 1247 the “Holy Towel” (probably the copy of Mandylion, to replace the original) was sent by Latin Emperor Baldwin II to Louis IX. He sent him also a 30 cm strip from the shroud of Christ, part of which is now in Toledo, and we know it doesn’t come from the Shroud of Turin it had to be another linen. It complicates more and more….","date":"2013-06-08","mins":"2:38 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36459","author":"o_k","post":"Yes, I have read this: http://www.acheiropoietos.info/proceedings/Jaworski Web.pdf But Jaworski writes in Conclusions: “However, at present the results obtained by Fanti point to the linen as a more probable material of the Veil”.","date":"2013-06-08","mins":"2:45 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36463","author":"o_k","post":"Louis: 1. Don’t you miss Fr. Pfeiffer with Fr. Resch? The latter claimed that Manoppelo is the Veronica, as described in traditional story, imprinted during the way to Calvary. BTW: look at Resch’s paper: http://www.acheiropoietos.info/proceedings/Resch Web.pdf 2. About open eyes: proponents of Manopello usually maintain that imprint was made just after resurrection, when Jesus was alive, healthy safe and sound, opened His eyes, took His first breath in new life etc. Truly, we don’t know. But actually, we cannot be certain that eyes on the Shroud are really closed, since intensity of imaging depends on distance (and it is roughly the same with the eyes open and closed) +all the controversies about coins..","date":"2013-06-08","mins":"3:12 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36467","author":"o_k","post":"Louis; I agree, I am not a big fan of Resch research and his methodology, and I think if one can fit Manoppello to Good Shepherd, than probably he can fit it to anything. “Look at the expression, with Jesus, if it really is him, looking kind of sleepy, not like someone who has just broken the bounds of death.” Have you ever seen anyone just after breaking the bounds of death? ; ) “Did you read what Arie Kindler of the Kadman Numismatic Museum in Tel Aviv told Father Bulst, as given in one of the answers in the interview?” Even if I did, I don’t remember now, please remind me..","date":"2013-06-08","mins":"4:10 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36471","author":"o_k","post":"Dave: The Russians? NOOOOO….. Actually Poland, in 1939 had “luck” of being invaded by both Nazi Germany (1st September) and the Soviet Union (17th September). And in 1945 they installed communist there for over 40 years.Here you have some history lesson: http://www.youtube.com/watch?v=u2w VV5 On B Vw Anglophone xenophobia? Truly I was once very symphatetic towards Anglophones, British and Americans. And I still try to be. However, after several discussions with Anglophones about various topics, I realised that Anglophones (not all, but unfortunately general) usually appreciate only THEIR POV. Simply they think, that if something is not written in English, than it doesn’t exist (and are not even aware of that!). That frustrated me much. For example, every child in Poland knows that Churchill (and especially that idiot FDR, who was nothing more than Stalin’s puppet) “traded” Poland to the Russian sphere of influence in Yalta in 1945, but how to explain it, to American or British? Their ignorance is sometimes tremendous, at least form the Pole’s point of view..","date":"2013-06-08","mins":"4:51 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36465","author":"o_k","post":"Don’t yoy mix, of course..","date":"2013-06-08","mins":"3:15 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36486","author":"o_k","post":"Dave :”I am fully aware of the Polish situation. NZ along with other Anglo countries provided refuge for very many Polish children soon after WWII, at the behest of a NZ Catholic priest, Fr Owen Sedden, later a renown bishop in Auckland. I was at College with many of these refugees, a few of them evidently badly ravaged from their experience in German concentration camps. A Polish architect served as an early mentor during my engineering cadetship, so I am informed of general Poish perceptions of the relative merits of both Russians and Germans.” Nice to hear it so! “A few Polish ladies have also informed me that my surname matches that of an evocative Jewish settlement ‘Belz’ which I believe is near Lvov (now in Ukraine). ” Yes. What is exactly your surname? “However it now seems that many Europeans have forgotten the links with their past and instead prefer to welcome jihadists within their borders while those with other more sympathetic cultures are excluded. We may have saved you from being obliged to speak German, but I doubt if we can save you from being obliged to speak Arabic instead.” Don’t worry, we are Poles. We haven’t gone crazy with the so called “tolerance” and political correctness, like many Western European countries have. We still keep our traditions in mind, and hardly believe we let the Arabs (who are still very few in Poland) dictate us their terms. Not that we are xenophobic, simply some things (like gay marriages) won’t pass in our country..","date":"2013-06-08","mins":"7:12 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36482","author":"o_k","post":"Louis: “Now would you tell me what kind of expression you would expect? Have you seen the paintings of the triumphant Jesus, after the Resurrection, by the great masters?” I expect that the kind of expression would be COMPLETELY different than our expectations, like it usually turned to be. I have seen the paintings of triumphant Jesus, but they all just come from imaginations of great masters. When we finally come to the other side, we will be really surprised. “There is more in the box: how come the face on all those icons and paintings, beginning with the sixth century encaustic icon preserved at Saint Catherine’s Monastery in the Sinai desert, correspond to the face on the TS and not to the one seen on the Manoppello veil?” I said something different. Resch fitted Manoppello Veil face proportions to the Good Shepherd, who is completely not Shroud type. Some sceptics tried to ridicule this method trying to fit Shroud face to that of Leoanrdo or Buddha, see http://greatshroudofturinfaq.com/Crazy/leonardo.html Dan: “The arguments continue: The face on the Shroud looks like Leonardo. Yes, it does, somewhat. It looks like many people sporting beards. Picknett and Prince go further. We are told that very precise comparative measurements to Leonardo’s face have been made. No they have not! Very precise measurements have been made to a drawing. Leonardo believed in ideal proportions. He wrote about them. He made drawings to demonstrate this. He used those proportions in his drawings and paintings. The best that can be said is that the face of the man on the shroud compares favorably to ideal proportions.” The same can be said about Good Shepherd. That’s why I have second thoughts about Resch’s efforts. Besides, I have read his book, and found a lot of silly errors. “Button like objects over the eyes: Have you seen what Professor Tamburelli produced?” Yes. I think the coins are probably there, but theoretically speaking, we cannot rule out open eyes..","date":"2013-06-08","mins":"6:53 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36487","author":"o_k","post":"The interviews? They are listed here: http://manoppello.eu/eng/index.php?go=wywiady They are all in Polish yet..","date":"2013-06-08","mins":"7:19 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36506","author":"o_k","post":"Jesterof: “Thank you, O.K. I am fluent in Polish.” Jeśli znasz język polski, to mogę Ci powiedzieć, że ostatnio napisałem kilka artykułów polemicznych z twierdzeniami z pewnego ateistycznego portalu. If you know the Polish language, I can tell you that recently I have written several polemical articles l with the claims from a certain atheist website: http://ok.apologetyka.info/racjonalista/znienawidzona tkanina i jej wrogowie czy caun turynski nalezy uznac za faszerstwo,429.htm http://ok.apologetyka.info/racjonalista/w potrzasku bredni prawdy i poprawdy na temat poplamionych krwia relikwii pasyjnych,432.htm http://ok.apologetyka.info/racjonalista/jak nie zosta zrobiony caun turynski,473.htm Even if you are not so fluent, the Google can translate it into English, sometimes better, sometimes worse..","date":"2013-06-09","mins":"4:29 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36507","author":"o_k","post":"Louis:” Fair enough. One query: do you mean it is possible that Jesus was laid in the sepulchre with his eyes open or are you saying that because of the Manoppello veil?” I think it is rather unlikely, that they left His eyes open. But knowing properties of the Shroud image, we could not determine if the eyes are really open or close. Just wanted to remind it. However the button like objects suggest they were closed..","date":"2013-06-09","mins":"4:54 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36516","author":"o_k","post":"Max: Here are the Conclusions of Prof. Jaworski Regarding Marine Byssus (Sea Silk) and the Veil of Manoppello: “The brown color of byssus threads originates from the pheomelanin pigments; its marker (BTCA) was detected by HPLC after degradation. […] Future detailed investigations on byssus properties (including color changes) are desirable and they are possible even if the examination of the original Veil of Manoppello will not be available.” Are we refferring to the same paper http://www.acheiropoietos.info/proceedings/Jaworski Web.pdf ? Becuase I can’t find those quotes there. Besides there is one probelm: if Marine Byssus cannot be painted, and there are some minor traces of pigment, especially in the eyes area (Saverio Gaeta shows them in his book on Illustrations 40 41 42), then we have contradiction. The word byssus can refer either to high quality linen, or Sea Silk. Chiara Vigo considers Manopello as composed from the latter, but what about traces of paint?.","date":"2013-06-09","mins":"6:44 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36504","author":"o_k","post":"Jesterof:Thank you, O.K. I am fluent in Polish. To miło mi to słyszeć ; ).","date":"2013-06-09","mins":"4:15 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36535","author":"o_k","post":"Louis: That no open eyes are seen, is only our IMPRESSION, due to the fact that we are used to identify face features on normal pictures. But the Shroud isn’t normal monochromatic photo, in which the luminosity of each ponit depends reflectivity of the material. On the Shroud the relation is different, the intensity of image points is correlated with the distance of the cloth and NEVERTHELESS WE SEE IT JUST LIKE THE NORMAL PHOTO! Very few people realize how MARVELOUS it is were all points of the face in the SAME DISTANCE from the cloth, we would see nothing, but the blurred contours of the face, just like on this image: http://ok.apologetyka.info/upload/ap upload/articles/15/2013/05/2 calun.jpg Do you understand it now?.","date":"2013-06-09","mins":"9:34 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36521","author":"o_k","post":"Max Patrick Hamon : O.K., the true fact is the first time I saw the original MV, I did think myself it was linen Byssus. Now with Pr Jaworski’s studies, it might be marine Byssus as well (Pr Jaworski ‘almost’ convinced me). More independent research is needed though, I do agree. Grey lead and rust as pigments can be dyed not just painted. Max, but what about this: Uploaded with Image Shack.us.","date":"2013-06-09","mins":"7:30 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36525","author":"o_k","post":"But I have read this paper: http://www.acheiropoietos.info/proceedings/Jaworski Web.pdf and found quotes are a little bit different, to my confusion..","date":"2013-06-09","mins":"7:38 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36542","author":"o_k","post":"Yes, I knew that the relic send to Louis IX was the frame, but what was within it? There are more questions: 1. When exactly Veronica/Manoppello arrived in Rome? 2. When it left Constantinople? 3. What was the Abgar Image? The TS or MV? 4. In Constantinople, there were AT LEAST two alleged shrouds of Jesus. One with the imprint of Jesus, that Robert de Clari saw (presumably our TS) and another one, from which 30 cm strip was sent to Louis IX, part of which is in Toledo now, and as César Barta pointed (http://www.shroud.com/pdfs/n56part5.pdf) was DISTINCT from the TS. 5. If the Abgar cloth is MV, and MV is Image of Camoulia, how it arrived there from Edessa? 6. There are TWO alleged dates of the discovery of the Mandylion: 525 CE and 544 CE. Why? 7. What about another alleged shroud of Christ, venerated in Jerusalem in 670 CE, according to Arkulf’s relation? 8. What about Shroud of Besancon? 9. What about alleged Templars Mandylion? Etc. I can understand the negative attitude towards Manoppello among some Shroud scholars. It solves some problems, and create a multitude of others! Remember, the Manopello Veil is SMALL CLOTH. That’s what was a major problem for many opponents of the Wilson’s hypothesis (Yannick Clement for example).What’s more MV is COLORFUL cloth (just like in the earliest versions of the Abgar’s legend). Weren’t the two (MV and TS) confused sometimes?.","date":"2013-06-09","mins":"11:03 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36546","author":"o_k","post":"What exactly do you want to translate? San(c)tam toellam/trellam tabule insertam” (“La sainte Treille [d’argent surdoré]/une bouette and so on is a mix of Latin and French, and I won’t help here. Ask Max..","date":"2013-06-09","mins":"11:11 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36522","author":"o_k","post":"Sorry: http://img594.imageshack.us/img594/4078/59a08d7d5ad44215a54644a.jpg.","date":"2013-06-09","mins":"7:32 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36543","author":"o_k","post":"What do you want to translate?.","date":"2013-06-09","mins":"11:04 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36610","author":"o_k","post":"#69 Louis: There is 99.9% chance that the Church of the Holy Sepulchre is the correct place. There are several good arguments for it (paradoxically some of them were once used by critics of it). Besides: There is a very interesting album about relics of Passion, by Grzegorz Górny and Janusz Rosikoń, called Świadkowie Tajemnicy (Witnesses to Mystery). Http://en.rosikonpress.com/dzial 51/towar karta 150/Swiadkowie Tajemnicy.html It covers most relics: The Shroud, The Manopello, The Oviedo, Trier, Argenteuil, True Cross, Holy Nails, and so on. It has a lot of good info, but unfortunately is uncritical at times, and I found a few errors, and can sense strong dependency on Hesemann’s “Silent Witnesses of Golgotha”. They claim that there will be English edition. We will see. But it may be interesting to jesterof, who knows polish..","date":"2013-06-10","mins":"6:32 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36548","author":"o_k","post":"“The magnification of Manopello cloth. High resolution images of professors Giulio Fanti and Doanto Vittore allowed for confirmation of the lack of pigment in the ares between threads. The shine of the threads led the expert Chiara Vigo to bring a hypothesis that the threads are composed of byssus. Especially the right eye of The Face shows traces of colour of one pupil, perhaps from the initiative of Someone who wished to give more strenght to the glance”.","date":"2013-06-09","mins":"11:21 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36623","author":"o_k","post":"It is not clear whether Michael Hesemann, the author of the books about UFO is the same Michael Hesemann who is author of books about religion, besides, even if was in his youth, Hesemann is considered as reliable author, who is often an expert on various TV documentaries about religion and relics, just example: http://www.youtube.com/watch?v=421ndxg Rje E.","date":"2013-06-10","mins":"10:49 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36632","author":"o_k","post":"Louis:”By the way, last week you commented that you also knew Polish, so would you be able to tell us in a few lines what Górny and Rosikon are trying to convey? Thanks.” I am a native Pole. You have a short description and table of contents (in english) on their page: http://en.rosikonpress.com/dzial 51/towar karta 150/Swiadkowie Tajemnicy.html Górny is a catholic journalist. He created a catholic conservative magazine Fronda in the 90s and also writes articles for other similar magazines. So he is definetly pro authenticity, but not too zealous. He depends on others (as I said, some fragments look like rewritten from Hesemann, and the chapter about Tunic of Argenteuil is simply a shortened version of Marion and Luccotte’s Le Linceul de Turin et la tunique d’Argenteuil), and there are some mistakes I was able to find also in other books (for example he wrote that Eusebius first mentioned the Image of Edessa, which is obviously not true). Remember, he is just a journalist. It is a good book, but one should take it with some care. Plus many very good pictures. And here you have a picture of Schwortz with that book in hand: http://www.idziemy.com.pl/wiara/calun przywrocil mi wiare/ ; ).","date":"2013-06-10","mins":"1:32 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36624","author":"o_k","post":"Barrie Schwortz thinks it is worthwhile: http://www.shroud.com/books.htm.","date":"2013-06-10","mins":"10:53 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36434","author":"o_k","post":"Max Patrick Hamon : It has “living eyes” neither the Holy Face of the TS nor the Holy Face of The Manoppello Veil have (I personally made a macrographic study of the latter’s eyes. There are man made. So are they painted, or simply someone tried to “improve” them?.","date":"2013-06-08","mins":"9:12 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36638","author":"o_k","post":"There is also an excellent Canadian TV series “In Search of Holy Treasure” :http://www.youtube.com/watch?v=I8 Qsl Qb ZY5 U It contains 13 episodes: 1. Shroud of Turin 2. Holy Grail 3. Tomb of Jesus 4. Holy Spear 5. Holy Cross 6. Sudarium of Oviedo +Veil of Veronica (unfortunately nothing about Manopello) 7. Crown of Thorns 8. Marian Apparitions 9. Noah’s Ark 10. Holy Coat of Trier, Holy Tunic of Argenteuil, Holy Cap of Cahors, and something else I don’t remember. 11. Ark of Covenant 12. The Blood Miracle of Saint Januarius 13. Summary. It was run on one polish TV channel devoted to religion last year. Very well and balanced. Why do I write this? Because of my alleged Anglophone xenophobia. Simply found that most of the English world simply doesn’t know anything about many other relics besides the Shroud and Oviedo (the latter thanks only to Guscin and Benett), which have sometimes very interesting connections to the Shroud. I found this ignorance terrible..","date":"2013-06-10","mins":"1:53 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-45176","author":"o_k","post":"Dave, the Nathan Wilson’s results are very poor, and have most of the faults of painting hypothesis. You can see 3 D reconstruction on his page, poor quality, but it is obvious that 3 D fails. And N. Wilson admitted himself that he made no microscopic examination of his results..","date":"2013-09-23","mins":"6:23 am","url":"https://shroudstory.com/2013/09/23/this-is-one-very-good-way-the-story-is-being-told/","cat":"event","title":"This is one very good way the story is being told"}]
