[{"id":"comment-129429","author":"o_k","post":"Why don’t you ask German Trappist nun and iconographer, Sister Blandina Paschalis Schloemer and German Art Historian Professor Heinrich Pfeiffer what they think of you opinion? Methinks you are just AN AMATEUR as far as archaeological image analysis/cryptanalysis is concerned. Methinks they are also amateurs as to the image matching, and interpretations coming from it. And so do I. I think the proper people for that job are not in the academic Institutes of Art History, but rather in police department. There is certainly a possibility of false positives here. Meanwhile, as to the mouth, here is a scan from Treppa’s book. Treppa made in September 2008 150 photographs of the Manoppello, documenting it under different lighting conditions. And that’s what he found:.","date":"2014-06-14","mins":"10:11 am","url":"https://shroudstory.com/2014/06/14/imagej-used-to-compare-the-shroud-of-turin-and-the-manoppello-image/","cat":"3d","title":"ImageJ Used to Compare the Shroud of Turin and the Manoppello Image"},{"id":"comment-129363","author":"o_k","post":"Thanks Dan, but I think your description does not reflect the full content of that paper so I recommend reading it to everyone..","date":"2014-06-14","mins":"5:56 am","url":"https://shroudstory.com/2014/06/14/imagej-used-to-compare-the-shroud-of-turin-and-the-manoppello-image/","cat":"3d","title":"ImageJ Used to Compare the Shroud of Turin and the Manoppello Image"},{"id":"comment-129434","author":"o_k","post":"Georga7: It is Genoa Mandylion, see Pfeiffer’s article from SSI: http://www.shroud.com/pdfs/ssi10part3.pdf.","date":"2014-06-14","mins":"10:18 am","url":"https://shroudstory.com/2014/06/14/imagej-used-to-compare-the-shroud-of-turin-and-the-manoppello-image/","cat":"3d","title":"ImageJ Used to Compare the Shroud of Turin and the Manoppello Image"},{"id":"comment-129531","author":"o_k","post":"Hugh: I don’t understand why Rasputin fails your test. I didn’t even use the photo you used: I used a pencil sketch as it was more full face. Perhaps this is the reason why Rasputin failed this exam (besides the photo seems to be reversed). Anyway, in his second term he is much better: However, it is not the most important whether Rasputin’s face proportions matches the Shroud or not. Even in the latter case, you can always find some face with appropriate proportions. That’s the case of false positive matches, which I underline this I haven’t considered in this paper, it was not my purpose there. I wrote: For now, I leave aside assesment of how good and significant is this match between Shroud and Manoppello faces. The purpose of my paper, was merely to show the abilities of Image J +some interesting features. So every ‘shroudie’ can make own, even quite really serious research. And of course, opportunities that may arise, if some other Shroud related relics (like Manoppello) are genuine. Hugh, if you have Corel Draw, I can send you via Dan my comparison template..","date":"2014-06-14","mins":"3:17 pm","url":"https://shroudstory.com/2014/06/14/imagej-used-to-compare-the-shroud-of-turin-and-the-manoppello-image/","cat":"3d","title":"ImageJ Used to Compare the Shroud of Turin and the Manoppello Image"},{"id":"comment-129397","author":"o_k","post":"Quite possible. We can try. I have no time for this already, but maybe Hugh will provide us the pictures..","date":"2014-06-14","mins":"8:40 am","url":"https://shroudstory.com/2014/06/14/imagej-used-to-compare-the-shroud-of-turin-and-the-manoppello-image/","cat":"3d","title":"ImageJ Used to Compare the Shroud of Turin and the Manoppello Image"},{"id":"comment-129407","author":"o_k","post":"Thank you, Hugh. Can you also provide us pairs of images, that is pure Shroud, and Shroud with texture (with the same Image J 3 D Surface plot parameters)? You know, adjusting those pictures to the proper size and position is a couple hours work and I am not sure if you have done it..","date":"2014-06-14","mins":"9:11 am","url":"https://shroudstory.com/2014/06/14/imagej-used-to-compare-the-shroud-of-turin-and-the-manoppello-image/","cat":"3d","title":"ImageJ Used to Compare the Shroud of Turin and the Manoppello Image"},{"id":"comment-129419","author":"o_k","post":"Hugh, Rasputin fails the exam: http://imageshack.us/photo/my images/822/tlpa.jpg/ Here you have my Manoppello adjusted Shroud face from Shroud Scope: http://imageshack.us/photo/my images/842/zrxgb.jpg/ Adjustment is still not ideal, but allows for some playing in Image J. You can download Manoppello from the Wiki: Have fun!.","date":"2014-06-14","mins":"9:52 am","url":"https://shroudstory.com/2014/06/14/imagej-used-to-compare-the-shroud-of-turin-and-the-manoppello-image/","cat":"3d","title":"ImageJ Used to Compare the Shroud of Turin and the Manoppello Image"},{"id":"comment-129416","author":"o_k","post":"I think that mouth is also half open also on the Shroud. Simply jaw is falling due to gravity, even despite the use of chin band. Beside it is claimed that in the Manoppello there are multiple images encoded with different levels of mouth openness. Maybe it is just optical illusion, or maybe….","date":"2014-06-14","mins":"9:38 am","url":"https://shroudstory.com/2014/06/14/imagej-used-to-compare-the-shroud-of-turin-and-the-manoppello-image/","cat":"3d","title":"ImageJ Used to Compare the Shroud of Turin and the Manoppello Image"},{"id":"comment-129423","author":"o_k","post":"The same with (hopefully) corrected links: Rasputin: Shroud face:.","date":"2014-06-14","mins":"9:54 am","url":"https://shroudstory.com/2014/06/14/imagej-used-to-compare-the-shroud-of-turin-and-the-manoppello-image/","cat":"3d","title":"ImageJ Used to Compare the Shroud of Turin and the Manoppello Image"},{"id":"comment-211333","author":"o_k","post":"Cannot you wait for me? Maybe I have something to say about that? 51 slides and counting..","date":"2015-09-27","mins":"7:27 am","url":"https://shroudstory.com/2015/09/27/more-3d-discussion/","cat":"3d","title":"More 3D Discussion"},{"id":"comment-176088","author":"o_k","post":"The picture http://www.wikigallery.org/paintings/236501 237000/236615/painting1.jpg is variously attributed as either painted by Giulio Clovio, or Giovanni Battista della Rovere. I found also another version, which seems most probable to me, that there two versions of this image, first painted by Clovio, and later copied by della Rovere. As to this image: https://shroudofturin.files.wordpress.com/2014/12/image thumb24.png?w=171&h=240 it was painted by Jean Gaspard Badouin (1590 1669), according to the caption in one of Barbara Frale’s book..","date":"2014-12-13","mins":"9:37 am","url":"https://shroudstory.com/2014/12/13/is-there-an-art-historian-in-the-house/","cat":"3d","title":"Is there an art historian in the house?"},{"id":"comment-211360","author":"o_k","post":"Wait for my paper about 3 D effect on the Shroud. 69 slides so far and counting. We have reached banding issues..","date":"2015-09-27","mins":"2:01 pm","url":"https://shroudstory.com/2015/09/27/more-3d-discussion/","cat":"3d","title":"More 3D Discussion"},{"id":"comment-176126","author":"o_k","post":"Much food for thought. Nevertheless, I wouldn’t rely on that picture too much, as it simply has too small resolution of 306×72 pixels, and is a JPEG. As jpegs filter out higher image frequencies, and use interpolation, thus the image looks smoother and probably more realistic than in reality. Not to say that this is miniature and not subtle and superficial as the Shroud. Here you have the enlargment of original image fragments. The individual pixels are easily seen. That’s why my advice is not to trust the 3 D representation too much..","date":"2014-12-13","mins":"3:24 pm","url":"https://shroudstory.com/2014/12/13/is-there-an-art-historian-in-the-house/","cat":"3d","title":"Is there an art historian in the house?"},{"id":"comment-176089","author":"o_k","post":"Yes, those are two different pictures. Look at the upper captions of the paintings , which read ‘Il verissmo ritratto…’ If you compare the two images you can notice that the second line of the caption, begining with ‘Dei Nostro Salvatore’ is slightly moved right on one of the pictures, compared to the first line, while at the same level on another..","date":"2014-12-13","mins":"9:43 am","url":"https://shroudstory.com/2014/12/13/is-there-an-art-historian-in-the-house/","cat":"3d","title":"Is there an art historian in the house?"},{"id":"comment-211363","author":"o_k","post":"When it will be published? When I will finish it and I don’t know when. Credentials? Let’s say I know and understand what I am writing about (contrary to many guys with “credentials”, if I may be truly)..","date":"2015-09-27","mins":"2:19 pm","url":"https://shroudstory.com/2015/09/27/more-3d-discussion/","cat":"3d","title":"More 3D Discussion"},{"id":"comment-211379","author":"o_k","post":"If someone is interested, a lunar eclipse has just begun. 82 slides and counting….","date":"2015-09-27","mins":"8:14 pm","url":"https://shroudstory.com/2015/09/27/more-3d-discussion/","cat":"3d","title":"More 3D Discussion"},{"id":"comment-211347","author":"o_k","post":"Http://opticalengineering.spiedigitallibrary.org/article.aspx?articleid=1075454.","date":"2015-09-27","mins":"9:09 am","url":"https://shroudstory.com/2015/09/27/more-3d-discussion/","cat":"3d","title":"More 3D Discussion"},{"id":"comment-175964","author":"o_k","post":"Yes I see that, but it’s very subjective – I think this, you think that. I thought there was something about your colour spectrum adjustments that helped objectify your point. Hugh, color images are used only for more objective quantification of data that’s why I recommend using them (instead of just viewing reliefs under various angles, which may be visually misleading). The principle behind them is the same as beyond color scale on this astrophysical charts: (The caption is “Polarization of X ray and gamma ray Emission” , probably in significance values).","date":"2014-12-12","mins":"5:33 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175937","author":"o_k","post":"Guys don’t get fooled! The Beauchamp/Wilson shadow FAILS 3 D TEST! TS on the left, Beauchamp/Wilson shadow on the right. The distortions due to different illumination are obvious. This is because the original painting on glass is imperfect, as it is extremely hard to accurately render the perfect 3 D effect (intensity vs body cloth) via painting..","date":"2014-12-12","mins":"1:34 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176129","author":"o_k","post":"Normally, Thibault. He used tricks described by me here https://shroudstory.com/2014/11/10/guest posting by o k on the shroud as a negative/ and loaded it to Image J. Yet I have some reservations about this result. Please read my post her https://shroudstory.com/2014/12/13/is there an art historian in the house/#comment 176126.","date":"2014-12-13","mins":"3:42 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176135","author":"o_k","post":"No tricks I assure you – just my usual routine with Image J. The 3 D enhanced image above was posted after cropping off the Image J settings. Here’s the same image with those settings. Click to enlarge. Colin you used 16 pixel smoothing for 306×72 pixel image????!!!! YOU BASTARD!!! Do you even know what you are doing????!!! This: One big smeared stain!.","date":"2014-12-13","mins":"4:09 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176139","author":"o_k","post":"Showing that you actually don’t understand anything. Doesn’t it ring a gaussian bell to you?.","date":"2014-12-13","mins":"4:27 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176144","author":"o_k","post":"Give it a rest OK. Your ‘expertise’ with Image J is entirely subjective. Try normalizing imprints against their real life subjects if you want to match my objectivity. No Colin, your ‘objectivity’ means ignorance in this case. Like unfortunately most of other guys playing 3 D in Image J not understanding what actually they are doing. I asked: doesn’t it ring a gaussian bell to you? So now a few illustrations for dummies: http://imageshack.com/i/f0 Qs E3 Rhp Will make it 3 D: http://imageshack.com/i/ex Imwrpkj Now go smoothing: http://imageshack.com/i/p1 M Gpp Slj Remmeber, as you use extensive smoothing you will always get bell shape in the end. As the shape of the cloth draping the body was also similar, the effect looks more realistic, but actually it is MISLEADING. Remember this lesson once for a lifetime..","date":"2014-12-13","mins":"4:49 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176145","author":"o_k","post":".","date":"2014-12-13","mins":"4:50 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175944","author":"o_k","post":"Even worse, I think http://shroudofturinwithoutallthehype.files.wordpress.com/2013/11/dsc09048.jpg?w=640&h=480.","date":"2014-12-12","mins":"2:58 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176152","author":"o_k","post":"Colin: What point are you trying to make? Is there any point at all, or are you simply trying to bamboozle us with your playtime antics? That you are doing everything WRONG all the time, and don’t understand the principles that rule this play. Here are the settings. Grid 512, Smoothing 16.0, Perspective 0, Lighting 0, Both boxes (xy and invert) left blank, Scale 2.02, z scale 0.15, Max 100%, Min 0%. Note the sizeable number that have NOT been altered from Image J’s default values (and as I said earlier, I’ve been using Image J for close on 3 years, guided initially by my ‘normalization’ experiments to ensure that my choice of settings is not entirely subjective Maybe one choice settings values is satisfactory for some old chap that uses one solution that worked fine for him for the whole lifetime, but in these times, if you cannot adapt to the situation, you are finished. Or in other words: THERE IS NO ONE PERFECT SETTING of Image J values that can be used in every situation! All depends on the picture you use. Its greyscale limits, resolution, properties, etc. You need to adjust them every time to obtain good results and whatsmore not distorted results. For example, in the case of Battista image, you used a smoothing with a 16 pixel radius gaussian, while the image was only 72 pixels wide. What did you expect to obtain? You got bell shaped torso and hands, but actually this only reflects the shape of convolving kernel, nothing more! If you turn the heat map on (where the true data are), all you can see is a smeared, meaningles stain! Colin, do you know the rules how this machine works? The smoothing is nothing more but applying gaussian blur. Read yourself about this http://en.wikipedia.org/wiki/Gaussian blur It is actually nothing more than convolving the image with 2 D gaussian (I hope you still remember what convolution is). Look at the wiki to remind yourself what it is, pay attention especially to the animation: http://en.wikipedia.org/wiki/Convolution.","date":"2014-12-13","mins":"5:46 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176268","author":"o_k","post":"In short, 16 pixel smoothing on 1000 pixel wide picture is safe, but on 72 pixel wide is not. The point is not to remove the influence of convolving gaussian kernel entirely, only not to make it dominant feature of the 3 D reconstruction which happens if you use relatively high smoothing settings compared to the image size. The smoothing scale of about 1/100 of original image size is usually good, but of 1/10 and higher is not. And I still think it is best visualised using thermal LUT mode. Load it, and play with smoothing. When you see your image reduced into smeared stain, you know the smoothing setting is too high..","date":"2014-12-14","mins":"6:18 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176159","author":"o_k","post":"Hugh: This is a pity, because you might have a valid point. However, as you have no idea what image Colin was using, your very precise “16 pixel smoothing for 306×72 pixel image” is mere guesswork. This is not a guesswork! Those are exactly the parameters provided by Colin! I reconstructed Colin’s 3 D, and I know that he is doing things completely wrong. Actually not for the first time. As I observe this blog (and enter his own from time to time) I know that this a constant way he is doing this thing (and not only he). Most people playing Image J simply don’t understand what they are doing, and they set a high smoothing, which looks effective, but actually is deceiving! That’s why insist on using color map. I agree that this image may be an artifact of the software, especially as the painting seems to be completely flat and without shading. However, if I carry out exactly the same procedure with the Shroud (using the image at http://www.world mysteries.com/sar 2wiki5.jpg), with a screengrab of 1168 x 292 pixels, and exactly the same settings, I get a remarkably similar picture. Even with that picture, you cannot get much: It has 786×150 pixels, about twice as much as Collin’s. But still its minimum. Here you have 3 D with 16 pixel smoothing: As you can see, it’s useless. Here is with 2 pixel smooth: Now it’s much better. But the image is of course flat, I agree. That’s what one should have expected. The truth is that it would obviously be best if the Smoothing was zero, but the “noise” over the Shroud makes it almost unrecognisable in that case. No, Hugh, zero smoothing is almost NEVER best option. And actually, as the Shroud image is halftone, smoothing is necessary, otherwise had we got high enough resolution image, and no smoothing, we would see no 3 D effect at all. Exactly because the halftone effect in a strict sense the Shroud image is flat, or rather needle forest. What we should do is to use moderate smoothing to eliminate impurities, extreme pixels and so on. I think I must make at last this presentation about 3 D properties of the Shroud. People must learn how to properly use those toys, at last. Unfortunately I don’t have much free time now..","date":"2014-12-13","mins":"6:39 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176456","author":"o_k","post":"Hugh, Colin. Obviously with modern software, some knowledge about the Shroud properties, and what one wants to obtain, making an artificial computer image of the face with 3 D rendering is easy but you have all those technical helps, that allows you to “cheat”. It is not that the Shroud has some miraculous property that allows only itself to be 3 D enhancable. No. Modern printed replicas of the Shroud also have this property inherited from the original (see below): It is possible in theory to obtain 3 D relief of face or body via ordinary painting, or photography. I never denied this. Yet in practice, it is extremely hard, so no satisfactory results have been obtain so far (the other thing is that there were no purpose for that). The problem gets more complicated if you want to obtain subtle, low contrast image with 3 D and negative properties. Simply as you have only your eyes at disposal (like medievals) this task is virtually beyond human capabilities. The problem only complicates further when you use some tricks, with making bas relief reflections, experimenting with scorches, acids or other chemicals (and so on), thus in fact introducing more parameters, which results in that the space for making errors is only increasing. The principle is very simple, but implementation very hard. More tomorrow..","date":"2014-12-14","mins":"6:48 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176457","author":"o_k","post":"Just a direct link to images..","date":"2014-12-14","mins":"6:48 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175956","author":"o_k","post":"Criteria? Resemblance to the original mold in case of the crucifix or to the human face, in case of copies of the Shroud face. I have seen many attempts to copy the Shroud, or (usually) just the face of it. But neither of them was good enough to fool a kid that he was looking at the relief of the real person, like in the case of the Shroud. That is the “criteria” and what we actually understand by 3 D effect. To make a crude imitation of face, or even a rough imitation of 3 D relief of the face, everyone can. But to make convincing relief that’s much greater challenge, satisfied by no one so far. Because like I said, every child would recognize that those are not faces or reliefs of real person just rough and primitive artificial imitations. Hugh, look at this picture: This is a car. Look next at this picture: http://tinyurl.com/nm23mzc Is that a car also? It has wheels, it has a body, it has lights, just like cars have. But is that really a car? This is the difference between the Shroud and the attempts to reproduce it..","date":"2014-12-12","mins":"4:31 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-177010","author":"o_k","post":"Anoxie, cosmology is such a field, that there is say 50 % of science, and 50 % of philosophy in it. So our philosphical assumptions influence our conclusions. Similar issue is with the Shroud. So far Einstein’s general relativity and FLRW model is holding up well against rivalries but is that an ultimate description of the Universe, as a whole? Are our assumptions correct? Rember that we don’t know the true nature of Dark Matter and Dark Energy those are simply parameters of the model ‘taken out of the whole cloth’. With certain values adopted, they fit observations well, but what they are in reality, Heaven (or Hell) only knows. See also this: http://mnras.oxfordjournals.org/content/397/1/431.full.pdf+html So far it seems our Universe is flat. But this is a borderline situation, like hitting a zero out of the whole real numbers set. Slight deviation in minus, and we have open, hyperbolic geometry of the infinite Universe. Slight deviation in plus, and we have closed, finished spherical Universe with Big Crunch..","date":"2014-12-16","mins":"1:24 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-177029","author":"o_k","post":"O.K. “So small deviations in new observation, and still Big Crunch may happen.” No. Quote from your link: “Constraints on the total energy density of the Universe, Omega Ttot, have improved spectacularly in the last two decades”. Planck has improved these constraints, no big crunch ahead, this is precision cosmology. No borderline situation. Anoxie, this is something different. It seems you don’t understand the FLRW models (no problem with that). In short there are three classes of FLRW metrics (see http://en.wikipedia.org/wiki/Friedmann%E2%80%93 Lema%C3%A Etre%E2%80%93 Robertson%E2%80%93 Walker metric#Hyperspherical coordinates ) 1) with k>0 (which can always be rescaled to k=+1), that is finite, closed Universe and Big Crunch 2) with k<0 (which can always be rescaled to k=+1), that is infinite, open Universe, no Big Crunch 3) with k=0 (EXACTLY ZERO) that is flat, infinite Universe, no Big Crunch. So far measurements indicate that k=0 with lower and lower margin of error. But unless k is EXACTLY zero, both 10 and 2) scenarios are possible. Had k=0 this would be extreme coincidence (with, as I said, exactly ZERO probability for random occurence) indicating that the Universe is tuned by some Higher Power, whatever defined (God, or some higher laws of physics, whatever you prefer). Planck, WMAP and other measurements can improve constraints on our cosmological parameters, assuming that our cosmology model is correct (so far it passes succesfully all the tests) but cannot assure us with 100% certainity that the predictions of those models are correct. Especially as there is possibility of some unknown physics, impossible to test experimentally on Earth, coming into action..","date":"2014-12-16","mins":"3:00 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176930","author":"o_k","post":"Colin: http://arxiv.org/abs/1303.5062 http://arxiv.org/abs/1303.5076 So far, Einstein and FLRW rules, several alternative theories lying down, Universe is accelerating and flat. The other thing that probability of obtaining a flat Universe is exactly ZERO. So small deviations in new observation, and still Big Crunch may happen..","date":"2014-12-16","mins":"7:43 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-177048","author":"o_k","post":"Perhaps the most remarkable possibility is that a vanishing or negative local curvature (ΩK ≡ 1 − Ωtot ≥ 0) does not necessarily mean that our Universe is infinite. Perhaps, or perhaps there is still eventuality of Big Crunch. We simply don’t know. And we can end this off topic discussion at this point..","date":"2014-12-16","mins":"4:25 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175522","author":"o_k","post":"‘The painting process was very efficiently carried out, which suggests that the painter must have been well experienced. First, he painted all the outline shapes with unmodulated local colour, then he added the interior details and modelling. To create a three dimensional impression, light and dark lines were added, and sometimes cross hatched shading. . . . Though the painter worked with care, sometimes he blocked in local colour, where he should have left a blank for adding in details of a different colour. These mistakes have become visible because some of the details painted on top are now lost.’ From the report on the Zittau Veil in Villers (ed,) The Fabric of Images, p.104. Three dimensional impressions, details of the original painting now lost? Gives some clues to me when comparing the Veil to a similar linen cloth such as the Shroud. Charles, it only shows your ignorance about the problem discussed..","date":"2014-12-10","mins":"7:50 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175946","author":"o_k","post":"And BTW, here is Giulio Fanti’s analysis of Nathan Wilson’s theory, from 2005 Dallas conference: http://www.dii.unipd.it/ giulio.fanti/research/Sindone/Pres WILSON.pdf.","date":"2014-12-12","mins":"3:11 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175537","author":"o_k","post":"“Charles, it only shows your ignorance about the problem discussed.” I don’t think comments like this help move the discussion in any direction. If one has a problem with Charles’s quotation in relation to the Shroud, one has a duty to explain what it is, so that we do not simply revert to yes it is no it isn’t bickering. Hugh, according to your wishes: Charles mixes techniques commonly used in paintings to give visual impression of 3 D features (perspective, fog effect etc.) with actual encoding of supposed 3 D information about the shape of the supposed body enveloped in the Shroud. Those are obviously two completely different things, but may confuse someone who does not understand the difference..","date":"2014-12-10","mins":"9:49 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175545","author":"o_k","post":"CB: One can make a scorch as superficial as one wishes, simply by testing its scorching power as it cools with small wads of linen, until the required degree of faintness is achieved. How?.","date":"2014-12-10","mins":"10:56 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175557","author":"o_k","post":"Colin, even if there has been some control of scorch intensity, there is another problem: http://en.wikipedia.org/wiki/Naked eye#Small objects and maps Observing a nearby small object without a magnifying glass or a microscope, the size of the object depends on the viewing distance. Under normal lighting conditions (light source ~ 1000 lumens at height 600–700 mm, viewing angle ~ 35 degrees) the angular size recognized by naked eye will be round 1/60 degrees = 0.0175 radiant.[citation needed] At a viewing distance of 16″ = ~ 400 mm, which is considered a normal reading distance in the USA, the smallest object resolution will be ~ 0.116 mm. For inspection purposes laboratories use a viewing distance of 200–250 mm,[citation needed] which gives the smallest size of the object recognizable to the naked eye of ~0.058 0.072 mm(~55 75 micrometer). The accuracy of a measurement ranges from 0.1 to 0.3 mm and depends on the experience of the observer. The latter figure is the usual positional accuracy of faint details in maps and technical plans. Remember, you are during medieval, you have no microscope for checking your results….","date":"2014-12-10","mins":"11:54 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-127821","author":"o_k","post":"Remember that in Image J (or VP8 or any other similar software or device ) it is in fact very hard to obtain realistic looking mold of human face or body using Shroud images, simply due to the scaling relations (which are irrelevant to the cloth distance intensity correlation, which is the key of the so called 3 D effect). Depending on Z scale parameter, the mold of the face can be too much extended, or resembling bas relief. Visual assesment can be very misleading. I think the best way is still using ‘Thermal LUT’ and color scale. It is quite objective. Nevertheless, one can obtain quite interesting results. One day I’ll show something interesting that I did some time ago.","date":"2014-06-08","mins":"5:18 pm","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","title":"Speaking of 3D"},{"id":"comment-211694","author":"o_k","post":"B.T.W.: I noticed three orthographic errors Thanks, corrected. In any case I believe you forgot to take into account what wrote Ray Schenider on this subject (“banding phenomenon”) Where exactly?.","date":"2015-10-03","mins":"7:37 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-175560","author":"o_k","post":"If there is any end..","date":"2014-12-10","mins":"12:04 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-211658","author":"o_k","post":"Most 3d images are based on a linear relationship between intensity and distance. If the relationship in the Shroud were different, lets say exponential, this would very clearly indicate the nature of the mechanism Linear relationship always can be taken as a first approximation. I am not certain whether Shroud image properties allow higher order approximations. To make so, you need to gather many more points (selected in unbiased, representative way) than just 13..","date":"2015-10-02","mins":"12:03 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211901","author":"o_k","post":"Thanks folks for your responses. I will try to adress at least some of the issues raised. Sorry I have little time nowadays to adress all. Piero: Here a vague example of short bibliographic reference: “MTF resolution of images obtained without an acquisition system” by Giulio Fanti and Roberto Basso http://tinyurl.com/orgjg3x Thank you for the paper, and a careful orthographic check of my paper. A lot of good papers get lost nowadays in the flood. Hugh: 3) OK’s comparison between my examples of 3 D qualities and the Shroud is grotesquely unfair. In Part 2, Slide about 18, OK places the Shroud and five examples of photos of forward facing faces lit from in front in a single group, and by manipulating Image J to suit the Shroud image as best it can, shows that the others are not as satisfactory as the Shroud image in 3 D terms. This is disingenuous. Why manipulate all the images using the Shroud’s parameters? If you want, try yourself and show us results. I can assure they cannot produce 3 D images on the order of accuracy of the Shroud. 2) The ‘banding’ between the cheeks and the hair is largely a myth. OK claims that there are two bands of lighter warp threads on either side of the face, and removes them with some digital manipulation to achieve his wider and more ‘realistic’ image. I invite the reader to try to track these light warp bands upwards and downwards beyond the extent of the Shroud face. It can’t be done. The two light bands are not a feature of the cloth, but a part of the image, and should not be treated differently by darkening them up. The bandings on the Shroud are real and evident. See: or http://shroud2000.com/Image Gallery/Set2/027 27.jpg See also your own paper https://shroudofturin.files.wordpress.com/2014/08/banding.pdf The presence of lighter and darker bands is clearly visible on both Durante and Enrie, extending beyond image areas. Halftone: Of course the scanned image I used is not perfect, in that it is much overcontrasted. I put it here merely as demonstration. But has a very good spatial resolution, below single threads. Giorgio, that’s why I discourage using jpegs for comparisons (like the one you presented), as they filter out higher frequencies of the image for compression of the data. Thus micro details of the image (like individual threads color) are diluted. The max practical resolution of the Shroud image is about 0.3 mm the average Shroud thread diameter. This is the size of a single dot. As I demonstrated, it is easily possible to obtain realistic 3 D rendering out of dots image I used, with the use of blurring filters. Without this, you get only a “needle forest” of peaks roughly the same intensity in the place of dots. That’s the halftone. And whether the color intensity of individual fibers is the same everywhere, or varies by a few percent around the cloth, is a secondary issue. More later..","date":"2015-10-06","mins":"11:47 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211907","author":"o_k","post":"As a curiosity: magnifications and histograms of several Shroud images: Enrie, scanned by me from Paul Badde’s book cover, bmp Enrie, presented by Giorgio, jpeg:Durante, obtained from Shroud Scope, saved as bmp:Unfortunately imgur seems to reduce the max resolution of those images. But it is clear that in the case of Durante and Giorgio images, their bad resolution due, due to the compression results in greater greyscale range. The intensity is not concentrated in dots (even though those dots are overcontrasted in case of scanned image but still printer dots there are far smaller than the size of the threads) but dissolved away to the neighbouring pixels, resulting in various intensity among them. And here is magnification of Enrie taken from Marion & Courage book: View post on imgur.com.","date":"2015-10-06","mins":"1:33 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211956","author":"o_k","post":"Clever, Hugh, but good eye would catch several anomalies (“fatal errors”) where face features are wrongly positioned: Maybe if you paint your whole face white, the results would be better. The transmitted light photographs at http://shroud2000.com/Image Gallery/Set2/027 27.jpg clearly show that the banding is continuous right though the areas of the burnmark patches, and is therefore an artifact of the Holland cloth. This does not prove the bandings are not present on the Shroud cloth. Non sequitur. The bandings are clearly visible on transmitted light, UV, Enrie and 2002 Durante (check your own paper) when the Holland cloth was replaced. Thus they are not artifacts of Holland, nor lighting conditions, nor anything but are really present on the Shroud cloth and affect (modulate) our perception of the Shroud body image. Whether in active or passive way (that is whether they have theirs role in image formation process) is another issue..","date":"2015-10-07","mins":"6:01 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211922","author":"o_k","post":"Hugh, haven’t you read my presentation thoroughly? Had you, you would know that I do not accept monocolor perspective images, as they are misleading. As to the transmitted photographs, as far as I recall they were made when Riggi ripped off a part of the Holland cloth from the Shroud to have a look at the backside of the latter. The lightbulb was placed between Shroud and the Holland, if I recall correctly..","date":"2015-10-06","mins":"5:13 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211986","author":"o_k","post":"Hugh: However I do say that my photo is a much better 3 D representation of a face than the Shroud is. Can you justify your view? imilarly, I do not say that there are no bands on the Shroud. There clearly are. What I do say is that these bands are not bands of differently coloured threads. They are made up of the different shadows of the two different directions of herring bone ribs, of clusters of threads of different thicknesses, particularly at the spines of the herringbone. They do not indicate that the cloth is differently coloured, so that some sort of correction factor needs to be applied to make the image more accurate. Whatever those bands are, they clearly affect our perception of the Shroud image. In case of the face, if you remove effect of their modulation, you will get much more flat and broader representation of the face. This is what we should have expected from body cloth vs intensity relation regarding the sheet loosely wrapped around the face scenario. With bandings modulation applied, the face looks much more face on photography like, with its illusion of shadowing to create a visually attractive portrait. As you can see from transmitted light photographs, for example, the darker and brighter vertical bands are positioned in exactly right places to make emphasis on protrude, extended nose (due to its higher intensity on negative images), attenuated sides of the cheeks, left hair more intense (forward) than right (to give a correct impression of right tilt of the face). This is very hardly a coincidence! Finally, regardless of any of the photos or reproduction styles used, the half tone hypothesis says that no image bearing fibre on the Shroud image is lighter or darker than any other image bearing fibre. This is demonstrably untrue, just by looking at them in Mark Evans’ micrographs. Can you post two most striking examples? It is very hard to determine whether all image fibres are indeed the same intensity. But this is not so crucial, as the visible structure of the Shroud body image is created at thread level, not fibre level, out of those halftone “dots”, in the places where threads form a herringbone weave. The more colored fibres, the greater dot size, and thus we have a halftone amplitude modulation, which results in image and its apparent 3 D..","date":"2015-10-07","mins":"5:15 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211958","author":"o_k","post":"Giorgio: We have no standards. No standards you can’t measure actual. I agree, we have no standards. It is because we do not compare actual photographs here, but digital reproductions of photographs, in various file formats and various, unknown parameters. That’s why it is hard to make definite conclusions here about actual parameter values. That’s why I wrote in Part 1, Slide 5: “Caveat: As the image from the cover is already set at max contrast, this is not a proof of the halftone effect of the body image it is merely a demonstration of this usually accepted property.” I would like to inform the you and the readers that the original file I have is over 1 gig raw RGB scanned. It would be good to share or at least present some of its fragments (perhaps high magnification) in other formats than jpegs. Offset prints have a high degree of acutance. I’m assuming the cover that OK used was printed at either 133 dpi or 175. That means there are either 175 or 133 halftone dots in a line per inch. By definition, an offset print at 133 or 175 dpi is far from high resolution. I think it is a little bit higher. But this is largely irrelevant. As the average Shroud thread diameter is about 0.3 mm or 0.01 inch, the max practical resolution of the Shroud image is about 100 dpi. And if photographs can reach further, this doesn’t matter actually. But in his defense, I believe OK is correct to state that the Shroud acts as a half tone. The results of the half tones do increase the image formation contrast and acutance. If the image mechanism produced a continuous tone, most of the body’s details would be lost. And that’s the main and most important conclusion regarding this particular issue, we both agree with. The body image acts as a half tone, which affects 3 D rendering. Here is 3 D rendering out of your photo, with 0 smoothing. The “needle forest” is apparent: View post on imgur.com.","date":"2015-10-07","mins":"6:26 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211989","author":"o_k","post":"Giorgio. The dynamic range is problematic (and actually largely irrelevant here), because each photography would have it different. But the 3 D property is intrinsic property of the Shroud’s body image, that is largely irrelevant on exact photography parameters (assuming of course that the photography is not spoiled, and you can get any relevant info out of that). If you can just reach the individual thread level with your photograph (any photograph), you can reproduce 3 D rendering out of it. You can overcontrast, or saturate your image dots (like in my case of book cover picture), but as far as you can see individual threads (so the image is not blurred at the begining like most of the low resolution pictures available in the Internet) on your photograph, you can reproduce (with appropriate smoothing) 3 D rendering. This is due to the halftone, AM of the body image. IMHO, if the imaged substrate was not on the herringbone linen, Dan and I may not be hosting websites about the Shroud. Exactly. The weave of the cloth is a substitude for the lack of precise contours..","date":"2015-10-07","mins":"5:27 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211960","author":"o_k","post":"Sampath: My interests go for the Slide 7 of Part 3. I think most probably either possibility of 1 or 2 or the combination of 1 and 2 was the cause for the formation of image on the Shroud of Turin. Definitely neither 1 nor 2 way of projecting the body image on the cloth. I discussed why not 1 on Slides 22 26. And 2 would result in large, contact like 2 D distortions, particularly for the nose area (see leftmost picture on Slide 3). Mario Latendresse in his paper https://www.academia.edu/9063899/The Turin Shroud Was Not Flattened Before the Images Formed and no Major Image Distortions Necessarily Occur from a Real Body wrote We have also conjectured that the mechanism of projection is probably neither normal to the skin, nor to the sheet, and not really perpendicular to gravity, References but is probably following the shortest path to the sheet. And I agree with him that this is most likely way of projection..","date":"2015-10-07","mins":"6:37 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-212049","author":"o_k","post":"Sorry:.","date":"2015-10-08","mins":"10:05 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-212048","author":"o_k","post":"I don’t think so. Here you have death mask from Joe Acetta’s paper: http://www.shroud.com/pdfs/stlaccettapaper.pdf And 3 D plot: View post on imgur.com Although it may be visually impressive, there are clearly some “fatal errors” which distort the 3 D rendering of the face..","date":"2015-10-08","mins":"10:05 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-212160","author":"o_k","post":"Giorgio: So I conclude, based on my own preconceived notion, that the dot by dot body to cloth correlation is flawed, since the cloth is convex and concave. The dot by dot body cloth distance correlation makes no sense, because it would create a “needle forest”. You need to get smooth image, by blurring or averaging several neighbouring dots to get some 3 D results. The whole correlation approach is actually flawed, due to several reasons. I briefly analysed them in Part 2 (see Slides 10ff.). The first reason is that merely calculating correlation coefficient is not everything to describe 3 D. And another reason is that its value can be biased, depending on the (non representative) selection of body points taken for account. One weakness of Jackson & Jumper paper is that they took into account only 13 points. While this is enough to show there is some correlation, it still should be treated as preliminary result. Following claims about precise maximum range, for example, should be treated as overstretching of the results, beyond their reliability. I would like the viewer first read this quick explanation how we perceive images compared to still images. This show us that while analysing Shroud images, we must eliminate influence of our subjective perception as much as possible. That’s why insist for example on using color scale (‘Thermal LUT’ mode) instead of merely rendering of the 3 D shape. The scale is much more objective, although does not guarantee absolute objectivity. And another thing we should remember the scale is relative, and not absolute. Uncalibrated. As I mentioned above, there is no max range reliably determined we can clearly throw out 3.7 cm from Jackson&Jumper based on simple and little accurate linear regression on small sample. To get a reliable value of max range we need to build a model of body shape, determine how the linen wrapped it, determine the body cloth distances, determine the relative intensity of corresponding areas (not merely points!), and compare the results. And go to the second and further iterations… Extremely laborous work. But to make things even more complex, there is more. The image is not merely a body cloth distance map. As I have shown, the intensities of several areas are modulated by bandings, and there are likely other effects at work. The body image of the Shroud is extremely,/B> sophisticated and complex. Not some kitchen science Joe Nickell, Luigi Garlaschelli or Colin Berry could make. Negative image composed of several halftone dots, amplitude modulated, with isotropic distribution, resulting in apparent 3 D effect corresponding to the body shape, with no contours and boundaries, composed of several bundles of surface colored outermost fibers on the surface threads. Add to this operating by bandings modulation, inherent to the cloth due to the diferently bleached yarn batches, for the purpose to give the body figure (and particularly face) a more visuallly attractive apparent look. Incredible mastery. The fact is that the Shroud body image fools our eyes. It was meant to do so. The body image shows us details (like nose swelling for example), that technically are not there. The Creator of the Shroud plays jokes with our perception. He wants us to perceive the image in appropriate way. He watches whether we resolve His riddles, for example about correct position of the Man’s of the Shroud hair. Whether we are smart enough to play His game. Diddly Squat: We quickly realize that the notion about some sort of body cloth distance is the epitome of begging the Circulus in Probando question, “it is so because I think it is so”. OMG we don’t know jack about 3 D and body cloth distance. Everything done in Padua and Colorado is based on this odd bit of imagination posing as science. But in the science 90 % of it is actually such a “Circulus in Probando” approach! And it’s no problem! Had you any experience in this field, you would know that! For example: why there is a periodic shift in radial velocity of a star? Because there is an extrasolar planet in orbit around it! Why there is extrasolar planet around some star? Because there is a periodic shift in radial velocity of that star!… https://en.wikipedia.org/wiki/Doppler spectroscopy It is what we call a working hypothesis. We assume some explanation of a phenomena, and test its reliabilty, as well as explanatory power. We test also other, alternative hypotheses. If a working hypothesis works, we stick to it, otherwise we adopt some alternative explanation. In the case of the Shroud and 3 D effect, we suppose that there is a relation between image intensity and the distance between the cloth and supposed body wrapped within it. The data show that this is clearly a case, definitly there is such a relation. But I cannot in absolute manner prove that such relation hasn’t been faked and there has been no body wrapped within a sheet at all. Similalry, I cannot prove in absolute manner that such a periodic shift in a star’s radial velocity is due to the interaction between it and planet(s) orbiting it (and not due to some other effects). All I can do, is to test this hypothesis, and test alternative solutions to the problem. So far, all attempts to “fake” the body cloth vs intensity relation of the Shroud, have failed..","date":"2015-10-09","mins":"4:35 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211247","author":"o_k","post":"Dear Reader. I have in plans making a comprehensive presentation about 3 D properties of the Shroud, how they manifest, how they should be interpreted etc. This will be also some kind of review of opinions on the topic. I have a lot materials and substantial experience experimenting with this. What I have in shortage, is free time to make it. So please be patient..","date":"2015-09-26","mins":"5:28 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"id":"comment-211657","author":"o_k","post":"I do not consider chemistry here, Piero. Just image properties. Another idea: you can show what is the result about the Image (in particular: the Face) trying to equalize (using a proper software, etc.) the “banding phenomenon”… See part 3..","date":"2015-10-02","mins":"11:58 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211324","author":"o_k","post":"40 slides so far and counting. There will be many more..","date":"2015-09-27","mins":"5:30 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"id":"comment-211254","author":"o_k","post":"There are some distortions in the Shroud and that’s good news. They should be there, and they are designed in a perfect way very unlikely the accidental reason. I will show it in my presentation paper, on which I am currently working..","date":"2015-09-26","mins":"8:17 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"id":"comment-211266","author":"o_k","post":"Oh Hugh, I don’t even have a will to read it all over. I am working on my presentation about. Wait some time because there are many issues that need to be adressed. I hope I will find a time to finish it. Otherwise – I will release in series..","date":"2015-09-26","mins":"1:09 pm","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"id":"comment-211251","author":"o_k","post":"What I really recommend so far, is watching “The real face of Jesus?” over and over again. It is invaluable source of information: https://www.youtube.com/watch?v=WNJPJ4 Jw He E.","date":"2015-09-26","mins":"7:14 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"id":"comment-171575","author":"o_k","post":"I am assembling a chronological sequence of art that shows how iconography similar to that of the Shroud starts appearing in western art about 1300. Yes, Charles, but can you explain the reason for that change? Have you familiarised with my own small study: https://shroudstory.com/2014/05/18/paper chase a revolution indeed/ ? My answer is that it was opposite way than you claim, that is the Shroud had a crucial impact on the iconographic revolution of 12th 14th century. That explains both things: 1) why there is similarity (if one may call it) between Shroud and 14th century iconography 2.) what is the origin of the 14th century representations of the crucifixion and entombment. Your opposite claim may answer 1.) but not 2.) So mine is better in that issue..","date":"2014-11-16","mins":"10:12 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-177490","author":"o_k","post":"Unfortunately Lazarus did not have a burial cloth like Jesus. If he had a burial cloth like Jesus then his body image also would have got printed on that burial cloth. I have read that the alleged burial shroud of Lazarus is today in Autun in France together with other his relics so perhaps your hypothesis may be checked….","date":"2014-12-18","mins":"5:01 am","url":"https://shroudstory.com/2014/12/17/a-gedankened-image-forming-process/","cat":"image_theory","title":"A Gedankened Image Forming Process"},{"id":"comment-211267","author":"o_k","post":"About 3 D and all the related effects..","date":"2015-09-26","mins":"1:10 pm","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"id":"comment-171686","author":"o_k","post":"Charles: Is Colin going to look at the faded Zittau Lenten Veil in the church museum at Zittau in Saxony? This is a painted linen from 1472, much larger than the Shroud (8.2 metres by 6.80 metres), with 90 separate paintings on the linen. It had survived relatively intact until the Second World War when it was looted by some Russian soldiers who used it to cover a steam bath. This alone caused the pigments to fall off in some areas and it was then left in the damp so parts were very faded. […] Then there is the Adoration of the Magi, no 35, in Diane Wolfthal’s The Beginnings of Netherlandish Canvas Painting , Cambridge UP 1989 now in the Museum of Prints and drawings in Berlin. Here the images seem to have suffered from abrasion but much of the original remains intact, allowing one to see how a particular painted linen might have decayed. I allowed myself to bold key phrases. As you can see those examples work against your hypothesis. Paintings don’t decay uniformly, but for your theory the Shroud being painted prop, must have lost all of its pigment, and yet leave residual image. With negative characterstics, 3 D feature, lack of directionality in Fourier spectrum etc., which all you ignore and really I think you don’t even understand. That makes your theory pseudo scientific garbage..","date":"2014-11-17","mins":"5:11 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171593","author":"o_k","post":"Charles, one simple question. Have you read my own presentation: https://shroudstory.com/2014/05/18/paper chase a revolution indeed/ ?.","date":"2014-11-16","mins":"1:29 pm","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171691","author":"o_k","post":"David Mo: Lack of depictions is contradictory with wide influence Attributing so big importance to a semi concealed object is impossible. The fame and diffusion of the Shroud begins only in the 16th. Only in your mind. The source doesn’t have to be widely known to have wide influence. Furthermore, your alleged explanation is fanciful. (See my comment to John Green). A fanciful explanation is not better that ignorance. Babble. Charles: The most profound revolution In iconography in the later thirteenth / early fourteenth century was t He emergence of blood cults relating to the scourging and crucifixion. So it is not just the Crown of Thorns in place, but blood flowing down the hair, along the arms, and from the wounds and the scourging marks covering the whole body. All this has, of course, been well covered by scholars, Caroline Walker Bynum in her Wonderful Blood, James Marrow in his works on Passion iconography( where he dates the emergence of all over scourging to 1300) and Jeffrey Hamburger who is particularly interested in the emergence of these aspects in Southern Germany. The iconography of the Shroud, the all over scourging, the pattern of the blood flows, fits well into this change and so one can argue for the creation of the images on the Shroud then. Charles & David Mo: If you are so wise (but only in your own belief), than how do you explain following things (see my presentation: https://shroudofturin.files.wordpress.com/2014/05/crucifixes by century 1.pdf ) the reduction of number of nails presented in crucifixion portrayals, from 4 to 3? the fact that roughly 90 % portrayals of crucifixion with 3 nails (dominant since 14th century, but the change already begins in 12th !) shows right foot atop of the left, just like the positive image on the Shroud indicates? This cannot be explained by plagues, wars and social changes in the 14th century!!!.","date":"2014-11-17","mins":"6:14 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171918","author":"o_k","post":"David Mo: I’m sorry but your presentation about crucifixion is worse than the other that we have discussed here about Fourier transform. There are not clear conclusions, no criterion to selection, unwarranted inductions and an absolute misunderstanding of the History of Art. This is comical.Does it mean that your understanding of this topic is even worse than (your complete ignaorance) about Fourier? Or simply you cannot find any reasonable counterarguments, so you are forced to subsititute them with slurs, like ususal? I cannot answer to your questions because they are incorrectly stated. For example, you asked: “ the reduction of number of nails presented in crucifixion portrayals, from 4 to 3?” Is my english so bad, or do you not understand simple issues? Before 14th century overwhelming majority of portrayals showed Christ crucified with 4 nails (feet nailed separately). Since 14th century onwards overwhelming majority of Western type crucifixion portrayals (I do not include Orthodox, which always portarayed both feet nailed separately) show 3 nails, feet nailed together, and what’s more in ~90 % instances the right foot is above the left, just like the positive Shroud image indicates. And you, instead of explaining the reasons of this radical revolution, are talking without sense about Velazquez, who is just the exception proving the rule..","date":"2014-11-18","mins":"1:57 pm","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172070","author":"o_k","post":"David Mo: There is not “radical revolution”. The Crucifixion with trhee nails existed long before 1350. For example these pictures from the Britishh Library. […] The artist of the Shroud continues a stylistic previous tendency that was growing before 1350. (13th century!). Once again you have mocked yourself! In my paper (https://shroudofturin.files.wordpress.com/2014/05/crucifixes by century 1.pdf ) I wrote (pg. 38): •As we can see, between 12th and 14th century there is also a dramatic change in portrayal the number of nails that pierced the feet –from 2 to 1. •Ian Wilson in the chronology of the Shroud at the end of his 1998 book „The Blood and the Shroud” mentions under the date 1149 first known instance 3 nails portrayal, on the bronze baptismal font in Tirlemont (Belgium). •Also the overwhelming majority of portrayals show right foot above the left. Why not 50 50? Of course the change didn’t start in the 14th century, but about 200 years before (if the first illustration you provided is indeed from the 4th quarter of the 11th century, than congratulations, you have found earlier such representation than Wilson) but the trend grow slowly, and only since the 14th century 3 nail model became dominant up to this day. Have you even read my presentation with understanding? Have they taught you this ability in school? I am sorry that you didn’t understand why I have spoken of Velázquez, for it is an explanation of this change of paradigm It is an explanation of nothing Velázquez lived in the 17th century, 300 years after the revolution, and his portrayal with 4 nails was exception in this period. You have not any proof nor hint that the evolution of this tendency has been caused by the Shroud. This is wishful thinking. Yeah, yeah the change from 4 nails to 3, and the fact that 90 % of portrayals show right foot above the left is irrelevant. This is just what the Shroud shows. And there are no other explanations for those. You are ridiculous. Go back learning how to draw viable conclusions David Mo, and then return..","date":"2014-11-19","mins":"10:35 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172195","author":"o_k","post":"David Mo: If we have a tendency toward an end (substitution of the 4 nails by 3) that begins in a point and grows toward another, you cannot say that the cause of the arrival to the end is in the half of the process. If you had done the simple quest I have suggested you would had understand that the change from 4 nails to 3 is progressive. You will find no crucifixions with three nails in the early centuries of Christianity. Scarcely one in the 11th century. Some in the 12th century. Many in the last half of the 13th century. And then there are few crucifixions with 4 nails in the 14th century. Etc. And once again you have shown your lack of understanding of the topic. Yes, the first represenatation of Christ crucified with three nails appear in 11th 12th century, and their frequency arises through 13th century and become dominant in 14th century. The Shroud surfaces in Lirey ~ 1356, when 3 nails model is well established. But you have ignored one crucial thing, well known from the reconstructed history of the Shroud. During Crusade period, in 11th 12th century many noble Latin guests visited Imperial Court in Constantinople, and sometimes were even given privilage to see imperial collection of relics (check Daniel Scavone’s article http://shroudstory.wordpress.com/about/acheiropoietos jesus images in constantinople the documentary evidence/ ). At the same time first 3 nail portrayals start to pop up. As we are almost certain that the Shroud was in Constantinople at that time, this is probably the reason. The rumors about three nails used during crucifixion began to spread (even if their origin remained unknown), and the change occured. And BTW, you contradicts yourself in your statements 1. You cannot provide an “explanation” of all the particularities of the History. Chance or the limits of knowledge are important determinant in historical explanation. You are an ignorant in History if you don’t know this. 2. In absence of any explanation you cannot accept the first explanation that comes to your mind. Specially when we are spoken of particular in History. You are an ignorant in History if you don’t know this. And later you state: The change from four to three nails is evolutionarlly explained by the same rules than explain the change of vertical horizontal compositions of the Crucifixions to the sinuous forms. That is to say, from the Romanesque art to the Gothic. According to 2. You cannot accept this “explanation”. And according to your other words: And you are not even the slightest hint. Nations need strong evidences. And you have not even the slightest hint. And according to 1. You cannot explain every phenomenon of history. What does not prevent you from providing an “explanation” via some evolutionary babble without any basis I suppose that in your obstinacy you simply cannot accept the only sound explanation – the influence of the Shroud of Turin..","date":"2014-11-20","mins":"5:48 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172408","author":"o_k","post":"David Mo: Yes. The theory of the wide influence of the Shroud over the medieval Art has the same degree of certainty than the confusion between the Mandylion (or de Clari) and the Shroud. This is to say, nil, zero, null. Only in your closed mind. “By the way”, not, because the word “explanation” has a diverse sense in both cases I mentioned. 1. When a particular occurrence is a cause (or determinant condition) of another particular occurrence. This is the model of explanation in natural sciences. A determinate event a under determinate laws and circumstances determines the occurrence of b. 2. In History (of Art) a particular event is explained when it is coherent with a model or frame. In this case, other alternative were possible in the same circumstances. The model M (a style, for example) determines that a particular occurrence α is not compatible and tends to disappear. But M is compatible with a, b, or others. And so, the actual occurrence of a can be explained. All we can say in our issue is that the solution of the three nails was coherent with a change of composition typical of the pass from the Romanesque (tectonic) to the Gothic (a tectonic). The first was a solid composition based on predominance of vertical and horizontal lines, and the second with a sinuous composition. That’s why History of Art has actually little in common with “hard” science it has descriptive power only but not explanatory while the true hard science should not only describe phenomena but also explain it. What would be value of physics, chemistry, geography, astronomy, had it only described their relevant phenomena, and provided no explanation why they do happen? But it seems that most art historians.are simply learned to assign artworks to a few standard drawers, and they lack imagination or the ability to think outside the scheme. That’s why there is so little utility from History of Art in the Shroud studies the discipline has no suitable methods for this kind of task. Saying that event is “coherent” is actually meaningless it can be coherent with multiple models or frames, and thus giving us no unambiguous answer. Yes, three nails are coherent with a sinuous composition but that implies nothing. Correlation does not imply causation. And there is no reason why four nails wouldn’t have to be coherent with Gothic art. No Mo, you have provided no reliable reason for sudden revolution from 4 nails to 3 in the 12th 14th century and there certainly must have been some cause for this effect. It was not merely an artistic caprice that can be labeled as a change of style. It must have been some much more concrete thing. The only expalantion is the Shroud..","date":"2014-11-21","mins":"2:14 pm","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171564","author":"o_k","post":"Charles. Have you, after all those errors in weak sides pointed out so far, abandoned your hypothesis?.","date":"2014-11-16","mins":"8:11 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172411","author":"o_k","post":"David Goulet: “As such, it makes more sense to claim that the Crown of Thorns (or the Shroud) were products of the artistic development, rather than that the artistic development was derived from the relics.” Or perhaps neither had any influence on each other at all. Unlikely. The correspondences are too strong to be results of independent processes. Hugh: I also mentioned in an earlier response to OK that I was not convinced by his explanation for the wrong foot being atop. The Shroud clearly shows a wound in the right side and a left foot atop. Artists could either follow this (assuming, as we do, that the Shroud was a mirror inversion), or reverse it (assuming that the Shroud was a straight painting), but in fact the crucifixions said to be derived from it show the wound in the right side but the right foot atop. Hugh, I adressed those issues on pg. 41 46 of my presentation. See in particular slide ‘How artists perceived the Shroud” on pg. 44. You have there famous della Rovere painting, and there is clear that he mixes left and right sides. The side wound on Jesus body is obviously on the right side (on the Shroud it seems to be on the left, but in reality is on the right) but the hands are crossed right over left, just like the positive image on the Shroud shows. The mistake you make is that contrary to what you imagine, people were not (and still often aren’t) quite as rational, as yourself or you want them to be. The lack of consequence in the portrayals was very common. Aside from della Rovere you can point as examples the transfers of the side wound on the depictions Shroud of Besancon from left to right and vice versa, or the Pray Codex: On the first illustration we see Jesus crucified in traditional Byzantine representation which would imply 4 nails: http://greatshroudofturinfaq.com/History/Greek Byzantine/Pray Codex/pray1.html Yet on another illustratrtion, on the beam of the cross hold by angel we see only three nails (and the side wound on right side): http://greatshroudofturinfaq.com/History/Greek Byzantine/Pray Codex/pray4.html I don’t accept that the Shroud was somehow hidden from the Byzantines but exposed to tourists from Europe, But although you cannot accept it, all seems that it was indeed like that the ordinary Byzantines had no access to the Shroud, except for a short and extraordinary period of 1203 1204. The existence of the image on the Christs’ burial shroud was Byzantine state secret. Just read Nicholas Mesarites and his vague and allusive statements in his 1201 homily. The paradox is that Westerners probably knew much more the existence of the Shroud than ordinary Byzantines. It is very wide topic why it was in that way, and we have no place here to discuss it in detail. But we will return to that in another thread, as we will be gradually gathering and explaining all the pertinent issues. Nor that the four nails of Helena had anything to do with it, as they were as well known to Western Christianity as to Eastern. No source give the precise number of nails recovered by Helena. Gregory of Tours claims four, but his number is merely a guess. As such, it makes more sense to claim that the Crown of Thorns (or the Shroud) were products of the artistic development But you have no reason for the sudden manifestation of that development except the arrival of the relics..","date":"2014-11-21","mins":"3:00 pm","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172510","author":"o_k","post":"Running out of arguments, David Mo? In your desperate attempt to search for fallacies in my reasoning, you have not noticeced that you are making several own. O.K. Is falling in a logical fallacy: “correlation proves causation, is a logical fallacy by which two events that occur together are claimed to have a cause and effect relationship. The fallacy is also known as cum hoc ergo propter hoc (Latin for “with this, therefore because of this”) and false cause.” (Princeton.edu) Yes, “correlation does not imply causation”, but on the other hand causation makes correlation. That means two correlated features may be cause related; correlation does not invalidate causation. The problem is to show reliable cause effect relation and in some cases it can be done, in others not. It can be reasonably postulated that the Shroud image caused appearance of three nails crucifixion portrayals, but on the other hand can you formulate any reasonable casual relationship between sinuous composition and three nails (or even common cause for the two)? I hadly believe, this seems to be only time coincidence. This fallacy is common to all the sindonists who claim to a causal relation from the Shroud to some artistic features when they observe a coincidence between both. Obviously, the Shroud is not the cause of the “dramatic” (¿?) change of the number of nails in the 14th century, that is the result of a previous evolution, as you have accurately pointed. Obviously you don’t understand what the cum hoc, ergo propter hoc is. It is fallacy only if you cannot provide reasonable hypothesis explaining relation between the two (substituting explanation with the relationship, that’s what YOU have actually done with sinuous composition and three nails), not that you postulate the relationship itself. Had it been so, then practising science would be virtually impossible. The second fallacy is the hyperdeterminism. They don’t conceive that we have not an answer to every problem. So, if they find no answer they invent imaginative solutions. Ray Rogers informed on this fallacy. But some sindonists only read or retain what interest them. Once again you don’t understand what you are writing. The fact that we cannot provide answer to every problem does not mean we cannot provide to this one particular problem. And we can, it is the influence of the Shroud. The reduction of nail number was certainly due to some reason. And the only reliable reason seems to be the Shroud’s influence. But that’s an unacceptable explanation for some obstinent Shroud sceptics who would resort to anything only to deny it. Even to their own misunderstanding of logic. But this is another fallacy: argument from personal incredulity. Back to school, David Mo, to learn again how to formulate correct reasonings. The more you write, the more ignorance turns out of you..","date":"2014-11-22","mins":"7:52 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172420","author":"o_k","post":"Hugh: if I understand it correctly, attempts to demonstrate that the Shroud influenced art, by means of two specific “dramatic” changes – the 13th century “dramatical increase” in depictions of Crown of Thorns,, and the 12th 14th century “dramatic change” in the number of nails. However, David Mo pointed out that these changes were already beginning in the 11th century, and you agreed, now suggesting that the “dramatic change” began then, when “noble Latin guests” visited the Imperial Court in Constantinople during the Crusades. The dramatic change now takes over 300 years, which weakens the force of the word “dramatic,” don’t you think? I assumed that everyone knows those basic elements of reconstructed Shroud history so I didn’t mentioned it directly in the paper. I though it was obvious. The word ‘dramatic’ is used here rather in the sense of ‘radical’ than indicating a pace, which was indeed slow in the 12th century, but in the 13th century, when Shroud was in Western hands, it increases, and by 14th there is a dominance of 3 nail model. The 1239 purchase of the Crown of Thorns did not inspire a dramatic change, it was in the middle of a very gradual change. You should separate the transition from 4 to 3 nails, and the Crown of Thorns those are two independent issues, although mechanism is very similar. And there is indeed a total radical change in the case of Crown (contrary to more gradual transition from 4 to 3 nails), before 13th century there are virtually no depictions with Crown, while by 14th there are no without. Western crucifix makers in 1150 knew more about the appearance of the Shroud than Byzantine crucifix makers. I do not claim that Western crucifix makers knew more about the appearance of the Shroud, than Byzantine, simply they heard unspecified rumors that Christ was crucified with three nails, while their Orthodox colleagues adhered stricter (and still do) to the conservative tradition. The access to the Shroud and the shape of Byzantine iconography was strictly controlled by Byzantine hierarchy, on the West there was more liberty. Most lists of Constantinople’s relics are of Western (or generally foreign) provenance. When I said that this was as well known to the West as to the East, you now say nobody knew how many nails were discovered after all No Hugh, I said: ‘No source give the precise number of nails recovered by Helena.Gregory of Tours claims four, but his number is merely a guess.’ There is a difference between ‘no source give the precise number’ and ‘no one knew’, Helena certainly knew how many nails she recovered. You have relevant links on pg. 35 of my paper. And there is one very curious instance, The Cave of the Treasures , the syriac apocryphal text from 6th 7th century (yet including much older material, probably originating from 2nd 3rd century Edessa) speaks explicitely about THREE nails..","date":"2014-11-21","mins":"4:45 pm","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171576","author":"o_k","post":"Charles. Obviously I am interested in the comments of specialists who are looking objectively at the Shroud as an artefact, not from those who appear to have made up their minds already as their views may be prejudiced. Me too, so that exclude yours. No. O.K., certainly not any hypothesis contained in my History Today article. Charles, have you read my own recent presentations: https://shroudstory.com/2014/11/11/why the images and bloodstains were not painted on/ https://shroudstory.com/2014/11/10/guest posting by o k on the shroud as a negative/ Do you know what the photographic negative is? How do you explain lack of directionality in FFT spectrum (do you even know what’s that)? What about 3 D qualities, etc., etc. On History Today website it writes: In the November edition of History Today, Charles Freeman, in a remarkable piece of historical detective work, reveals the truth about the origins of the Shroud of Turin. They claim you “reveal the truth”. What is this truth? Are you able (or even competent) to defend it against charges? Or, like a classic said: “The Goral (Highlander) epistemology says there are three truths: Holy truth, truth likewise and s#%t truth”, and yours is of that third kind, and your article serves only to get some little money and deceive a few gullible people?.","date":"2014-11-16","mins":"10:26 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-200074","author":"o_k","post":"Giorgio, a little bit off top. A few months back I asked you whether it is posssible to publish the “Proceedings of the 1977 United States Conference of research on the Shroud of Turin.” on the HSG website. You confirmed that yes, but still up to this date those documents are not published. Do you still plan to make them available online? It would be great help for researchers. Thanks..","date":"2015-05-24","mins":"8:40 am","url":"https://shroudstory.com/2015/05/24/colin-berry-on-rogers-and-arnoldi-paper/","cat":"image_theory","title":"Colin Berry On Rogers and Arnoldi Paper"},{"id":"comment-172513","author":"o_k","post":"So maybe a decaying body can leave an image. John, see this: http://www.shroud.com/pdfs/ssi26part5.pdf Sometimes decaying bodies leave some less or more clear imprint but having little in common with what we see on the Shroud..","date":"2014-11-22","mins":"7:58 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-92714","author":"o_k","post":"It seems to be a formal follow up of Jackson’s video Dan posted here maybe a year or so ago The article dates back to the 1984..","date":"2014-03-24","mins":"12:46 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92594","author":"o_k","post":"Louis: see http://www.shroud.com/pdfs/ssi11part4.pdf.","date":"2014-03-24","mins":"5:11 am","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-191504","author":"o_k","post":"At least, a 2 D painting of the shroud also show so called 3 D properties using J Image, even better than the TS. There is a problem with J Image. I suppose that only apparently,Thibault. Can you post here your images (via Imgur http://imgur.com/ or similar service), please?.","date":"2015-02-21","mins":"2:33 pm","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-52433","author":"o_k","post":"Thibault HEIMBURGER : Try again to use your camera (at the beginning, it’s difficult) but it is the only way to obtain HD pictures of a larger area (low magnification). This is the only way to see the color pattern at thread level on some adjacent (weft and warp) threads. Or simply using scanner with high DPI settings..","date":"2013-11-22","mins":"4:27 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-200089","author":"o_k","post":"Yes..","date":"2015-05-24","mins":"1:25 pm","url":"https://shroudstory.com/2015/05/24/colin-berry-on-rogers-and-arnoldi-paper/","cat":"image_theory","title":"Colin Berry On Rogers and Arnoldi Paper"},{"id":"comment-127010","author":"o_k","post":"“It could be three dimensional for many reasons” What are those reasons? (beside cloth body distance) The whole statement is imprecise. Every image is 3 D, as it has 2 spatial coordinates + intensity (X,Y,I). The point is that the intensity I correlates with cloth body distance (which is also imprecisely defined Jackson, Jumper & Ercoline used simply vertical, or Z distance)..","date":"2014-06-05","mins":"7:25 am","url":"https://shroudstory.com/2014/06/05/everymans-vp8/","cat":"image_theory","title":"Everyman’s VP8"},{"id":"comment-127099","author":"o_k","post":"It all depends on used picture some are better , some worse. Generally, the better quality picture (that is usually bigger in size), the better 3 D effect. Always on the begining go Image>Adjust>Brightness contrast. Use moderate smoothing (a few pixels) it reduces noises, but also dissipates smaller structures. Grid size always the highest 512.Usually Min=0 %, Max=100 %. Perspective =0. Play with z scale and/or smoothing. Other parameters are less important..","date":"2014-06-05","mins":"3:06 pm","url":"https://shroudstory.com/2014/06/05/everymans-vp8/","cat":"image_theory","title":"Everyman’s VP8"},{"id":"comment-127293","author":"o_k","post":"Only Craig & Breese images have quite similar effect, I do not yet fully understand why. Or maybe I do. Probably they simply thrown more dust in appropriate areas, imitating Shroud face at negative images. Yet still I think their artwork has inferior quality to the Shroud, and is of course inconistent with many of the latter’s characteristics (lack of any paint, whether in liquid or solid dust form being the first of them)..","date":"2014-06-06","mins":"9:16 am","url":"https://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/","cat":"image_theory","title":"Good 3D from a conventional photograph"},{"id":"comment-139643","author":"o_k","post":"Yes, Dan. Today astronomy is in fact more image analysis, using sophisticated software and images from various sky surveys that are publically released. In fact anyone can make research, provided that he or she has sufficient knowledge and abilities to do so. Look at some sites of the astronomical surveys: NED: http://ned.ipac.caltech.edu/ SDSS: http://www.sdss.org/ I would like to have similar database for Shroud studies! The great help is that in astronomy there is one standard, and very portable format of graphic/data files, that is FITS: http://en.wikipedia.org/wiki/FITS It is strange to me that it is used widely only in astronomy, and not in other scientific areas. But perhpas this will change..","date":"2014-07-21","mins":"8:49 am","url":"https://shroudstory.com/2014/07/21/creative-ideas-that-work/","cat":"image_theory","title":"Creative Ideas That Work"},{"id":"comment-127096","author":"o_k","post":"We get good 3 D from a conventional photograph. The other three, not so good. Not true!!! Just look what I have done with those images in Image J (using high smoothing for visualisation purposes it lowers high narrow peaks like noises and edges):Remember NEVER use original colors or grayscale in Image J. Due to specific projection it MAY BE VERY MISLEADING!!! Use Spectrum/Fire or Thermal LUT instead!.","date":"2014-06-05","mins":"2:58 pm","url":"https://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/","cat":"image_theory","title":"Good 3D from a conventional photograph"},{"id":"comment-127259","author":"o_k","post":"Dan: O.K. I understand why not to use original colors because it includes the underlying image. Is grayscale, here different than gray? Yesterday I wrote: “Every image is 3 D, as it has 2 spatial coordinates + intensity (X,Y,I). The point is that the intensity I correlates with cloth body distance (which is also imprecisely defined – Jackson, Jumper & Ercoline used simply vertical, or Z distance).” So I discourage using original colors or greatscale and rotating 3 D models, as the shape of it may be distorted by the persepective from which we observe it. So the true 3 D images (defined like above) may not look 3 D, or opposite not true 3 D may look like true 3 D. The best way is to use Thermal LUT with infront view like here: The color scale (which is quite objective ) serves for 3 D. It is like looking at topographic map. You must then analyze whether the shape looks like real human body, of course taking a linen laid on him into account. Photographs never satisfy this, as far as I tried they always have too ‘hot’ foreheads due to them being large flat surfaces..","date":"2014-06-06","mins":"6:32 am","url":"https://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/","cat":"image_theory","title":"Good 3D from a conventional photograph"},{"id":"comment-98667","author":"o_k","post":"Anything new? Is Robert the new L’enfant Terrible of skeptical explanations? No and no. Nihil novi sub sole..","date":"2014-04-12","mins":"8:44 am","url":"https://shroudstory.com/2014/04/12/indifferent-to-gravity-jesus-hair-floomfs-out-and-falls-to-his-shoulders/","cat":"image_theory","title":"Indifferent to gravity, Jesus’ hair floomfs out and falls to his shoulders"},{"id":"comment-127280","author":"o_k","post":"Hugh: I don’t know how you feel that the picture in your llnk demonstrates any satisfactory 3 D encoding. It is a little bit qualitative rather than quantitive evaluation. Do not consider green areas those are almost certainly surface contamination, blood & dirt etc. White areas are most probably contact areas, nose, beard, eyebrows, cheeks, front of the forehead. Bluer areas are farther than that. The sides of the cheek are in the dark bands, or are either covered by some headband, or perhaps it is due to the darker bands passing there. You should also consider smoothness of the brightness curve compare to the contact scorch images on the left (from Głowacki). Generally it needs some experience to know what to look for, (and what not to look), but one can easily see that the Shroud image is distinguished in comparison to others. Only Craig & Breese images have quite similar effect, I do not yet fully understand why. Generally, I think about putting a kind of a gallery of 3 D images comparing the Shroud and and its attempted reproductions. Had I only enough time for this….","date":"2014-06-06","mins":"8:10 am","url":"https://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/","cat":"image_theory","title":"Good 3D from a conventional photograph"},{"id":"comment-98728","author":"o_k","post":"Some people think that some barely visible features on the Shroud were more visible in the past, and depicted on some old icons of Jesus. Anyway, there are no evidence for the Shroud being brighter in the past.The fact that originally white Shroud yellowed with time (thus the contrast with the image was getting smaller) may also play some factor in the perception of the image..","date":"2014-04-12","mins":"12:49 pm","url":"https://shroudstory.com/2014/04/12/indifferent-to-gravity-jesus-hair-floomfs-out-and-falls-to-his-shoulders/","cat":"image_theory","title":"Indifferent to gravity, Jesus’ hair floomfs out and falls to his shoulders"},{"id":"comment-51415","author":"o_k","post":"Complete failure, Collin!.","date":"2013-11-15","mins":"6:59 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51808","author":"o_k","post":"Yannick Clément, I presume? What’s happened, Dan blocked your account? If so, I would like to appeal to Dan, to allow for your return to the forum..","date":"2013-11-17","mins":"6:04 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51496","author":"o_k","post":"Myrrh and aloe? I’ve read that Baima Bollone used some threads with blood mixed with spices for spectroscopic comparisons..","date":"2013-11-15","mins":"2:56 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51420","author":"o_k","post":"Who has eyes, let he look. First look on his left image, which Colin himself admits it is too hot, too dark. And definetly not smooth and continuous. Next look on second, “superficial” image. Is it Jesus, or Superman while flying, with his cape?.","date":"2013-11-15","mins":"7:29 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51501","author":"o_k","post":"But BB had whole threads at his disposal, while Rogers had only fibers form the sticky tapes..","date":"2013-11-15","mins":"4:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51648","author":"o_k","post":"For instance, the ranks of even the most determined authenticitists are split between the “washed” and the “unwashed” (referring to the body, of course, not the people!) Why entirely washed? Anointing with spices isn’t enought to disturb the scourge wounds? Well, perhaps this item was in use: http://en.wikipedia.org/wiki/Basilica of the Holy Blood#Relic of the Precious Blood.","date":"2013-11-16","mins":"4:09 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-50022","author":"o_k","post":"No it is because our eyes are oriented horizontally. We perceive 3 D on the basis of paralax, and such shift has to fool our mind..","date":"2013-11-05","mins":"6:52 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50018","author":"o_k","post":"Sorry Collin, but distortions and distortions are different things. One must be aware what he is talking about. In the Shroud, there are no major lateral (2 D) distortions. They would certainly be had the cloth was in direct contact with the body (and BTW, no 3 D would be visible then), but this is not the case. There are some minor lateral distortions (contrary to what is often said), and that’s good because it indicates that the cloth wrapped the real body. And they can be used to solve some pseudo arguments of the sceptics, for example Schafersman tried to “prove” the Shroud being fake, because eyes of the TS Man are too high. But see: http://ok.apologetyka.info/upload/ap upload/articles/15/2013/06/calun27.jpg and this: http://ok.apologetyka.info/upload/ap upload/articles/15/2013/06/rysunekxxi.jpg Mario Latendresse has shown that if the cloth was laying on the body like blue line on this picture http://ok.apologetyka.info/upload/ap upload/articles/15/2013/06/rysunekvii.jpg no major 2 D distortions would occur. And there are also 3 D distortions, which are different than 2 D distortions. They are also consistent with thesis that Shroud wrapped the real body. And they are tough nut to crack for any fans of idea that bas relief was instead used by the forger..","date":"2013-11-05","mins":"6:39 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50024","author":"o_k","post":"Sorry it doesn’t matter, forget the previous one..","date":"2013-11-05","mins":"6:55 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-49999","author":"o_k","post":"Anoxie : Once, again, forget about 3 D and think of spatial information. The shroud produces a “good 3 D” means constrast is roughly correctly correlated one way or another to spatial information (body shroud distance ?). Yes. Anoxie : A photograph produces a “bad 3 D” means contrast is badly correlated (but still more or less slightly correlated) to spatial information. Only in very specific cases, when the light is stable and coming directly in front of the object or person, there are no shadowed area, reflectivity of all the object’s surface is the same (the best is if the whole thing is painted white, like Nicholas Allen did with his model) etc. In practice, it is almost impossible to obtain. Anoxie : Jackson ‘s experiment based on a photograph with emitted light attenuated through water gives an “excellent 3 D”, means correlation between contrast and spatial information is very good (experiment is designed this way). Yes, but one must remember what spatial information. Because in the case of the Shroud it is not the distance from body to camera, but from body to linen, which varies point to point. That’s why the 3 D relief of TS Man’s body is slightly distorted, because one must take into account the way the linen drapped the body. And Jackson experiment was in small scale. Compare with difficulties to obtain it with 180 cm model, and of course in the medieval times!.","date":"2013-11-05","mins":"5:01 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-131625","author":"o_k","post":"Off top. Dan, have you received also my e mail, about Kornelimünster relics? Can you manage to deal with it, and produce a posting? I see that you are bombarded with several e mails, and overwhelmed with work. I fully understand that. Nevertheless, if I can voice my opinion, those Kornelimünster relics are more urgent case, then for examle “Anticipating the Conference” postings. But of course you decide it is your blog. I’ll try to slow down for a few days..","date":"2014-06-20","mins":"5:39 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","title":"Maybe a New Image Hypothesis?"},{"id":"comment-49718","author":"o_k","post":"I described it above, see #4.","date":"2013-11-03","mins":"9:17 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49723","author":"o_k","post":"No, herringbone pattern is not considered here..","date":"2013-11-03","mins":"9:32 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49722","author":"o_k","post":"Dan : The questions is what does the 3 D data represent, 1) cloth to body distance, 2) elevation from a plane (which is what we plot) or 3) something altogether different that we believe is 3 D data (such as proposed if it is some sort of trick photography). I don’t think it is cloth to body distance, even approximately or inaccurately. I don’t think it is a painting or a photograph or a scorch o graph or anything like that. Cloth to body distance. The problem is, we don’t know how the image of the body was projected on the Shroud, that means what is relation between body points and cloth points There are four major hypotheses: 1. Vertical projection (as assumed by Jackson and Antonacci) 2. Projection perpendicular to the surface of the body 3. Projection perpendicular to the surface of the cloth 4. Projection at the lines of minimum distance between cloth and the body (supported by Mario Latendresse and I also consider it most likely) See my figure: Usually all 4 models create very similar results, so they are rarley discussed. However they are vital to the study of 2 D and 3 D distortions present on the Shroud, and to image creation mechanism. There are some mathematical subtleties which can be crucial in this case..","date":"2013-11-03","mins":"9:31 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49725","author":"o_k","post":"Colinsberry : Perhaps you could answer a question for me, OK. When references are made to the importance of cloth body distance, that involves a radiation model (yes?). So differences in image intensity that are supposed to represent differences in cloth body distance are assuming that Newton’s Inverse Square Law is operating (yes?). But all the radiation models I have seen that lack imaging lenses etc have to assume collimated (“unspread out”) radiation. But why would that obey Newton’s Inverse Square Law? No, the Newton’s Inverse Square Law plays no vital role here. Jackson assumes that there is some opaque medium (like air in case of the UV), some “cloud” that is responsible for intensity distance correlation, according to the law: I=I(0)*exp[ tau] , where tau is optical depth of the medium. Colinsberry : So there has to be some other reason for the fading of image intensity that is unrelated to radiation (yes?). That means other mechanisms of image imprinting have to be considered (yes?). Reminder: there are three chief mechanisms for transfer of thermal energy between two bodies – assuming it is thermal energy that has produced the tan coloured dehydration products of linen carbohydrates – namely radiation, conduction and convection. Raymond Rogers had no time for radiation models. Nor do I. So forgive me if I switch off when folk refer blithely to cloth body distances. That is not dispassionate objective science. It is (more often than not) agenda driven, subjective “science”… I believe that the Shroud image has to be examined as a product of conduction (primarily) and convection effects, involving very close contact between subject and cloth. Conduction requires zero distance of separation, but convection probably allows a little more, maybe a few mm, possibly a cm or two at most. But conduction and convection are accommodated better in models that assume the correctness of the radiocarbon dating… In case of the Shroud only conduction plays a vital role, radiation and convection are usually negligible. Conduction requires direct contact, while on the Shroud there are areas which were not in direct contact with the body. That’s one of the reasons why schorch hypotheses makes no sense, because it is binary, either there is a contact or no. So 3 D always fails, even despite the image looks like 3 D. On the contrary the Shroud image has quite smooth gradation of greyscale..","date":"2013-11-03","mins":"9:40 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49689","author":"o_k","post":"Hey Dan. One must understand what 3 D on the Shroud really is. Every monochromatic image has three dimensions, the X,Y coordinates and intensity, which is the third dimension (call it Z). So every picture will look 3 D in VP8 or Image J. But only in the case of the Shroud this third dimension can be correlated to the body cloth distance (what Jackson &Jumper have shown). This is what is popualrly called as 3 D properties of the Shroud. However, Petrus Soons argues that besides those, the Shroud has additional holographic properties, which is another distinct way of encoding 3 D. Information. Http://shroud3d.com/ So if Soons is right, the Shroud is both height field (as you write on your page http://greatshroudofturinfaq.com/Science/Image/heightfield.html) and a holography (which was invented in 1940s, and popularised after invention of laser in 1960)..","date":"2013-11-03","mins":"6:27 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49691","author":"o_k","post":"One final thought on the “impossibility” of making a photograph that has 3 D qualities: it is not impossible, or even very difficult. If a front lighted facial portrait is taken in a chamber where a uniformly distributed, moderately dense grey or black “fog” is present, less light will reach the receding portions of the face due to absorption of the light by the fog. Furthermore, of the light that does reach the more distant parts of the subject, more of the reflected light necessary to make the photograph will be absorbed on the way back to the camera, increasing the distance dependent contrast even more. Yes, in theory it is possible. Anyway VP8 was designed to process photography. But there are two major problem. First: the lighting must be full face, and stable which is hard to obtain (even Secondo Pia had problems with lighting back in 1898, not to say about medieval). The second problem is that the intensity is not correlated to the plane in infinity (what to the high degree can be assumed in case of planetary images taken by space probes) but to the distance between body and the cloth, circa 0 4 cm, so some 3 D distortions will appear (for example cheeks are higher than the space between them and the nose). So one must simulate this. Is it possible to do so? In theory yes. One must create a bubble from transparent glass or plastic, with specifically designed shape that represents the shape of the cloth wrapping up the body. And then fill it up with some opaque liquid. Creating such bubble is extremely complex task even in the era of computers and robots! Something like that on much smaller scale (only small model of the face) however was presented in the brilliant The Real Face of Jeus See http://www.youtube.com/watch?v=vs96a Pyw2i8 (from 6:00) and http://www.youtube.com/watch?v=k Ann82g4 Cag.","date":"2013-11-03","mins":"6:42 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49744","author":"o_k","post":"Has anybody experimented with non linear relationships, does anyone know, say exponential – twice the darkness corresponds to four times the height? That would be interesting, I think. As far as I know, no one yet. The linear approximation (the first order of Taylor’s series of unknown relation) is usually good enough for previous uses. But of course checking higher orders would be good to improve the results..","date":"2013-11-03","mins":"10:35 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49746","author":"o_k","post":"But one may try, even Image J has some mathematical functions to process the images..","date":"2013-11-03","mins":"10:42 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49713","author":"o_k","post":"Dan I have sent you my small presentation showing 3 D representations of US presidents official portraits, from Obama down to Kennedy, showing how much difficult is to obtain Shroud like 3 D properties on normal photographs. Besides, here is a comparison of the Shroud 3 D properties with the scorch images, created by one sceptic, whose article I refuted: http://ok.apologetyka.info/upload/ap upload/articles/15/2013/06/rysunekxxii.jpg.","date":"2013-11-03","mins":"8:45 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-214586","author":"o_k","post":"Hey guys, Louis, piero, daveb, Hugh, Dan, everyone! Haven’t you noticed something more general; that Marco Bella and his friends (I am quite sure Gian Marco Rinaldi is very active in this, perhaps Andrea Nicolotti,maybe Garlaschelli, and likely more unknown friends of theirs) are very passionatley looking for any information that may be useful to denigrate their opponents in the field of Shroud research. I am quite sure this gang has started personal files on several of you, especially more prominent in Shroud research and discussion on this blog. I am certain the started my file. So watch out yourselves, because they may already know what you don’t want to be known! These awful methods were widely used by security services in the Communist block countries..","date":"2015-11-13","mins":"6:52 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","title":"Nevertheless, the images are real enough!"},{"id":"comment-214657","author":"o_k","post":"Including one intact shroud. More details, please. As far as I know, Akeldama is the only one (except our Shroud of Turin) relatively “intact” 1st century Palestine burial shroud. The rest are just fragments..","date":"2015-11-16","mins":"9:21 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","title":"Nevertheless, the images are real enough!"},{"id":"comment-42484","author":"o_k","post":"Google translation (with my corrctions): But the image is. Inexplicable. Ray Rogers believed that his theory of the Maillard reaction is able naturalistic way, without resorting to miracles, explain the origin of the image on the Shroud. Rogers was a chemist, carried out the appropriate experiments and found that the appropriate conditions this method can get the color of individual fibers with properties such as the Shroud. But he was not a physicist and was not really interested in the practical impossibility of obtaining such perfect macroscopic properties macroscopic of the image through a process of gaseus diffusion. How is it possible to create such an unusual image not denying the statistical laws of thermodynamics? Rogers concluded that there is no point in considering this problem, just happened to such an incredible event and we can only investigate a posteriori how it naturally happened (this does not mean that the theory of Rogers denies the resurrection, just does not take it into account). Maybe so, maybe there was such quite unbelievable event in theory it is not impossible. Only so improbable, that sooner I would expect that the outdoor Olympic swimming pool to freeze by itself in the summer heat (which is also theoretically possible) … and why it happened jus tonly in the case of the individual who had suffered exactly the same passion as Passion of Jesus of Nazareth described in the Gospel with whom perhaps he can be identified … unless Someone guided by the invisible hand the track of each molecule of ammonia … Resurrection of Jesus and the cration of the image could take place even without the flash … but also in a miraculous way!.","date":"2013-08-31","mins":"7:51 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-42515","author":"o_k","post":"But the place of burial is maybe 20 30 metres from it..","date":"2013-08-31","mins":"3:55 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-42481","author":"o_k","post":"Dave: An extract from my article written in polish: “Ale wizerunek jest. Niewytłumaczalny. Ray Rogers sądził że jego teoria reakcji Maillarda jest w stanie w naturalistyczny sposób, bez odwoływania się do cudów, wyjaśnić powstanie wizerunku na Całunie. Rogers był chemikiem, przeprowadził odpowiednie eksperymenty i stwierdził że przy odpowiednich warunkach da się tą metodą uzyskać zabarwienie poszczególnych włókien o właściwościach takich jak na Całunie. Ale nie był fizykiem i nie interesowała go tak naprawdę praktyczna niemożliwość uzyskania tak doskonałych makroskopowych właściwości wizerunku w wyniku procesu gazowej dyfuzji. Jak to możliwe utworzyć tak niezwykły obraz nie zaprzeczając statystycznym prawom termodynamiki? Rogers uznał że nie ma sensu rozważać tego problemu, ot zdarzył się taki nieprawdopodobny wypadek i my możemy jedynie a posteriori dociekać jak to się w sposób naturalny stało (nie oznacza to że teoria Rogersa zaprzecza Zmartwychwstaniu, po prostu w ogóle nie bierze go pod uwagę). Może tak się stało, może nastąpił taki zupełnie niewyobrażalny wypadek –w teorii nie jest to niemożliwe. Tyle że tak nieprawdopodobne, że prędzej bym się spodziewał że odkryty basen olimpijski w letnie upały sam z siebie zamarznie (co też jest teoretycznie możliwe)… I dlaczego zdarzyło się to akurat w przypadku osoby, która przeszła dokładnie identyczne męki jak opisywane w Ewangelii męki Jezusa z Nazaretu, z którym być może jest po prostu tożsama… Chyba że czyjaś niewidzialna ręka kierowała torem każdej cząsteczki amoniaku… Zmartwychwstanie Jezusa i utworzenie wizerunku mogło się odbyć również i bez błysku… ale w równie cudowny sposób!” Czytaj więcej na: http://ok.apologetyka.info/racjonalista/dzieje caunu turynskiego wedug leszka zuka z racjonalisty cz 2,629.htm.","date":"2013-08-31","mins":"7:41 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-167884","author":"o_k","post":"I definetly agree that it is a must read paper, but it has been long ago easily available on the Barrie’s site..","date":"2014-11-02","mins":"7:26 am","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","title":"Paper Chase:  A Significant Paper by Mario Latendresse"},{"id":"comment-202967","author":"o_k","post":"Recently I was surprised to watch a documentary by Mark Guscin visiting a colleague of Marion at the Paris Institute of Optics who explained more or less. Since years ago Guscin had been one of the worst critics of Marion’s work (on linguistic grounds only) now in this recent documentary it seems that he does not completely rule out the possibility. Don’t be naive, gabriel… http://www.shroud.com/pdfs/n74part4.pdf This summer I was working on a new Shroud documentary, filming in France aqnd Italy. The main topic of the film is the supposed inscriptions on the cloth – anyone who has read my articles in the BSTS and http://www.shroud.com concerning this aspect of Shroud studies will know my opinion thereof very well. In my opinion, they are just a figment of the imagination, from looking at the 1931 Enrie photographs of the Shroud, which were lit by raking light and therefore show up all the creases and imperfections in the cloth, giving rise to all kinds of objects that can be “seen” on the linen. […] The example at hand concerns the “inscriptions”. A garbled mess of pseudo Latin, pseudo Greek and pseudo Aramaic using theological ideas and titles that were coined later than the death of Christ, but claimed by some to be proof of the Shroud’s authenticity. Professor Garlaschelli did an excellent job with a practical demonstration of how unlikely (if not impossible) it is for the random letters some can see to have been imprinted onto the Shroud in the way they are “seen” In other words p&**s them off. I got engaged in the “inscriptions” issue, only because producers paid me money for that… Aside from the (very complex) issue whether there are any actual inscriptions or not. I hardly believes guys like Guscin or Wilson (with due respect ) are qualified or have a knowledge to voice their proffesional opinion on that. The cynicism of some guys in the Shroud world (no matter pro or anti) never stops to amaze me….","date":"2015-06-20","mins":"3:55 pm","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"id":"comment-202898","author":"o_k","post":"The problem is that the Shroud of Turin is not a classical image, just like a photograph, where you can clearly define tiny detail. It’s actual a kind of heat plot of a 3 D model, where intensity is correlated with distance from the cloth. Looking at the Shroud as mere photograph can be very misleading. What we see are not strictly speaking, say visible details of the face, but mere variations in intensity, usually associated with different facial features. If there is no variation of the distance to the cloth, there is no variation in intensity, and the image is blurred, generally speaking. Maximum resolution? There is no one single answer on that. Dependent on region it can be higher or lower. There are areas where details about 1 mm in size can be resolved, and there some where there is uncertainty of 5 mm and more. That is shortly speaking. In fact the matter is a little bit more complex, but it would need to wirte a paper on that..","date":"2015-06-20","mins":"4:04 am","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"id":"comment-52818","author":"o_k","post":"Kelly Kearse : O.K. Thanks, in these previous burial cloths, is it known if aloe & myrrh were included? Was specifically wondering on the two quick questions if the more recently developed images (snake, etc.) done in the above studies had been evaluated for superficiality & treatment with a reducing agent. I believe aloe was included as a part of that system? Veil of Antinoe? I don’t know. It was a veil used used to bury a Christian in Egypt circa 500 AD. The only informations I have are second hand, however an article by A M. Dubarle was presented in Shroud Spectrum International #26 , March 1988, see http://www.shroud.com/spectrum.htm Several other instances of images on the burial cloths are briefly presented in André Marion &, Anne Laure Courage Nouvelles decouvertes sur le Suaire de Turin – Editions Albin Michel, Paris 1997, based on earlier work of Arthur Loth from 1910: La photographie du Saint Suaire. As to Jospice Mattress Imprint, the full photograph is presented here: http://holyshroudguild.org/uploads/2/7/1/7/2717873/can the jospice mattress imprint.mht 2.pdf Definetly different from the Shroud. As to images ofsnakes etc. Developed during earthquakes, see http://www.acheiropoietos.info/proceedings/De Liso Web.pdf.","date":"2013-11-26","mins":"11:05 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-202907","author":"o_k","post":"Does anyone detect any kind of pattern in the variation of resolution, or do observers see it as random? The “desing” of image is definetly not random especially in the face area. It is true that the image is actually a kind of density plot, corresponding to the body cloth distance but that’s not entire truth. As I have observerd, bandings play a key role in defining the image, and make it a photograph look like (especially in the face area). This is extremely unlikely for a “blind” natural process. More about that I will write in a paper but definetly not before July, as I have some more urgent work to do now..","date":"2015-06-20","mins":"5:43 am","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"id":"comment-202908","author":"o_k","post":"One more general comment. Theoretically speaking, the maximum achievable resolution is the size of the thread , or about 1/3 mm. It is unlikely you can go lower, unless the imaging mechanism was able to code the resolution on single fibers but this would require some extensive and difficult processing of the images to check. Human eye resolution can go an order of magnitude lower. Https://en.wikipedia.org/wiki/Naked eye#Small objects and maps Of course, in practice the resolution depends on relative intensity of neighbouring regions. If they do not vary greatly, the resolution is low if they vary, the resolution is high..","date":"2015-06-20","mins":"5:59 am","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"id":"comment-52848","author":"o_k","post":"Just reminder, that one shouldn’t be naive in case of the politicians. If it pays off to them, they can be militant atheists very active in communist organizations, if otherwise, they can publically bend on their knees in the churches and kiss icons and crucifixes. You cannot separate Russian history from the Russian Orthodox Church. Absolutely agree!.","date":"2013-11-26","mins":"5:05 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-52846","author":"o_k","post":"Since he is a practicing Russian Orthodox Christian, Vladimir Putin wears a cross given to him by his mother Reminder for Louis and others: he was once a communist and a KGB agent..","date":"2013-11-26","mins":"4:40 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-52852","author":"o_k","post":"A few comments about my POV: It is evident that Vladimir Putin went to see Pope Francis and talk to him about the plight of Christians in the Middle East, an issue other “Christians” like Obama, Kerry, Rajoy and so on are not worried about. I have absolutely no trust in tsar Putin. In the rest of the gentlemen mentioned as well! Remember: You cannot separate Russian history from the Russian Orthodox Church Absolutely you cannot! The Byzantine links between Russian Empire and Russian Orthodox Church, the alliance between throne and altar, use of religion as an instrument of politics, were something absolutely unparalleled in the West. Russia is not the West, naive Westerners usually do not understand this country and its imperial ambitions. That’s one must remember, before talking about butchers from Chechenia and other issues. That’s also why I disagree with another statement: Pope John Paul II made a mistake by looking at the world from a Polish made lens, influenced by Cardinal Stefan Wyszynski during the Communist regime there. It took him some time to realise that extreme right wing regimes could promote massacres too. What happened to Archbishop Romero? It’s not so simple, and its not about the Polish made lens. It is not that he supported, or even turned the blind eye to the right wing regimes, he opposed them as well as left wing. As to Russia, he wanted reconciliation but Russians didn’t want it. Remember he was from Poland. And Russian/Soviet Empire always considered Poland to be subjugated within their sphere of influence. But absolutely agree with this: Well, forget politics and politicians for a while, the discussion is about relics,icons and what they can mean to important figures..","date":"2013-11-26","mins":"5:47 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-52810","author":"o_k","post":"Kelly Kearse : With this model, could there have been other burial cloths that were imprinted during history? Two quick questions: do you know if their superficiality is similar to the Shroud image; also, are the images formed in that system sensitive to treatment with a reducing agent (diiamide)? There were some instances where body (or rather parts of the body) images were recorded on burial cloths. But the scarce descriptions indicate they are usually not Shroud like, and rarely superficial, most likely Volckringer patterns. The best example is now lost Antinoe image, the face image on the burial napkin which penetrated three or four layers of the cloth, as descriptions claim.","date":"2013-11-26","mins":"9:09 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-49801","author":"o_k","post":"Dan, can you post my quick response to Hugh Farey that I have sent to you, please? Regards, and thanks in advance..","date":"2013-11-03","mins":"5:18 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-52769","author":"o_k","post":"An alternative of this for some, might be an energetic event involving a body, in combination with the Maiilard. Yes I also thought about that. I think it is the only way to explain some of the alleged holographic properties of the Shroud, with properties at thread and fiber levels. Diffusion of some agent, activated by a mild radiation: If a statue were used, is it reasonable to speculate that it might it still exist out there somewhere? Or is it more likely that it was melted down soon after use to cover one’s tracks? Kelly, can you read (with a help of Google Translator, of course) the ending of my article (just above and below the final image)? http://ok.apologetyka.info/racjonalista/jak nie zosta zrobiony caun turynski,473.htm Because there is an answer to your question ; ) If you cannot, I can translate it to you, because it’s really funny!.","date":"2013-11-25","mins":"4:54 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-49947","author":"o_k","post":"Hugh: The Shroud is definetly different from the others. I sent to Dan my response to your work, he posted it but only in the form of picture, not pdf I sent. The faces you analyzed look clearly distorted under Image J, even if it is not so clear with monochromatic output. That’s why I use thermal scale. To Anonymous: By the way, it is exactly the same thing for the natural images of plants or flowers throught the process known as the Volckringer pattern effect! But around here, nobody seem to be willing to accept the fact that there is other known natural process that can produce an image on an object (in this case, it is a sheet of paper) with good 3 D data, which came from a natural (but still not fully determined yet) interaction between a biological thing (in this case, it is vegetal) and the sheet (of paper) Volckringer pattern is mostly a contact process, and hence different from the image on the Shroud, were non contact areas were also imprinted. Plants, leaves and flowers are mostly flattened inside the book (so they are in contact with the paper) the corpse is not..","date":"2013-11-04","mins":"7:06 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49803","author":"o_k","post":"Nice, thanks, but I think that posting a scalable pdf which I sent, would be a better solution..","date":"2013-11-03","mins":"6:21 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49959","author":"o_k","post":"See Dan’s post , #20 I guess. Look at this black lady on bottom right. Do the humans have foreheadsso extended in front of the face? And next look at gentleman in the center left. The right side of his face is much more in front than the left. And so on. Contrary to the Shroud, when if one takes into account a correlating function describing how the linen was laying on the head (and body in general) everything is quite fine, only bloodmarks are making some mess..","date":"2013-11-04","mins":"8:08 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50001","author":"o_k","post":"David Mo: You are not making a lot of spelling mistakes, your claims to discredit the Shroud are simply wrong. 1. Let us suppose that the Shroud was supported by the body as Jumper, Jackson or Latendresse imagine. The fabric weight would make some parts, small or large, would adhere to the skin, producing zones of distance 0 and, therefore, intense coloration. In addition, the cloth should present some wrinkles well visible when it would be extended. This is so even in Latendresse’s forcibly reconstruction where the fabric is unnaturally stretched out. None of these things are visible in the image of the shroud. Or it is impossible the shorud was laying on the corpse or the 3 D theory is false. They are visible http://ok.apologetyka.info/upload/ap upload/articles/15/2013/06/rysunekxxii.jpg Let us suppose that the Shroud was flat (an additional mysterious force is needed, but this is not the topic here). Some parts of the body would be farther than 5cm. From the fabric (calves and abdomen, for example) and would be invisible. Or the Shroud was not flat or the 3 D theory is impossible. The Shroud was not flat, I support Mario in this case. 1. Radiation or vapour there was once an orthogonal (vertical) projection from body to image. So orthogonal or vertical? Because there are at least four hypotheses: 2. Different colour intensities are produced by distance between body and cloth. 5 cm is the standard distance at which the image disappears (sindonist say). Some say 5 cm, some 4 cm, others 2 3 cm, we don’t know precisely. But the 3 D information could not have been caused by some kind of contact with the shroud, because large deformations would be visible. Mario showed that’s not true..","date":"2013-11-05","mins":"5:09 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50003","author":"o_k","post":"Hugh: Yellow line flat reference surface. Red line linen in strict contact with the body Blue line linen how it approximately wrapped the body in reality. It would be silly to say that any of these images carries accurate relief data: that was never my point. What I do claim is that the shroud carries no more 3 D information than any other such picture, and I don’t think my claim has been demonstrated false yet. Yes Hugh, the amount of data in the Shroud and normal photographs is the same; X,Y coordinates and Intensity or Luminosity as the third dimension. The problem is that Shroud offers much better correlation with distance to the cloth than any photo with distance to camera. And remember distance to the cloth, and distance to the flat photographic plate are two different things (the latter much easier to obtain than the first)!.","date":"2013-11-05","mins":"5:16 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50028","author":"o_k","post":"Yes, Hugh, but the Shroud is a) miraculous, b) 1st century or c) at the least ‘natural’ or derived from an original body covered with an original cloth not just only because 3 D effect, or negativity, or non directionality, lack of pigment etc. Alone It is a combination of unique traits that makes it likely to be a) and/or b) and/or c) Even though some simplified statements are presented in popular media..","date":"2013-11-05","mins":"7:03 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-155272","author":"o_k","post":"Discussing this is a waste of time. Gentlemen, it cannot be ruled out that the world is ruled by Martians, who mind control all the goverments, and faked all the footage of Mars from all the probes that surveyed it, to cover a presence of their civilization. Just like it cannot be ruled out that Shroud is a painting, made by completely unknown technique, that leaves no traces of pigment, no brush strokes, no directionality, outlines, etc. This is the same way of paranoid thinking, having nothing in common with scientific inquiry. Another aspect comes to my mind. We can rule out in practice that the Shroud is a painting. But thinking about another artifact claimed to be acheiropoietos, The Manoppello Image. Can we, based on our present knowledge, hi res scans, UV fluoroscence, transparency of the Veil, etc. Rule out that Manoppello Image is a painting? Or is still, perhaps a theoretical way to paint it somehow? With such quality: http://manoppello.eu/eng/gfx/oblicze14.jpg BTW: Mario, I haven’t heard a voice from you, since I gave you that Manoppello photographs to be installed in Shroud Scope. What is your decision, do you want to install it or not?.","date":"2014-09-24","mins":"5:32 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-137032","author":"o_k","post":"I don’t know what would make you convinced. The fact that alleged teeth are in propoer place and proper size? Plausible explanation of their visibility?.","date":"2014-07-11","mins":"6:03 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-137067","author":"o_k","post":"Piero: thanks , interesting links. As to the reason of sardonic smile, hard to determine. I thought about some infection, particularly of tetanus (see http://en.wikipedia.org/wiki/Tetanus ), but it seems that it would take too much time for symptoms to develop fully. Hynek, as I said, claimed that symptoms similar to that of tetanus may develop simply from exertion of crucified, but I don’t know. We need an opinion of qualified physician. Poison? Maybe. It seems that Jesus drank a little while on the cross, particularly in the last moments of His life (see Matthew 27:48, Mark 15:36, Luke 23:36, and particularly John 19:28 30 ).","date":"2014-07-11","mins":"8:23 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-137070","author":"o_k","post":"Hugh: I don’t think any teeth are visible on the shroud. I don’t think the mouth is open. Confront it with Sudarium data. I think the ‘lip’ that is visible below the ‘moustache’ is the man’s lower lip. The ‘teeth’ are below the lower lip, which means that they would only be visible by some sort of X ray effect through the skin. You think this, you think that… Have you performed any measurements, Hugh (like I have)? Do it you will see that alleged teeth are exactly where they suppose to be. I do not believe the Shroud is an X ray of any sort. Nor do I. I think the ‘teeth’ are an artifact of the banding due to differences in the warp yarn which can be seen throughout the Shroud. And this banding strangely produces structures which are in the proper place, and proper size for teeth. Another strange coincidence… ?.","date":"2014-07-11","mins":"8:29 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-137125","author":"o_k","post":"Hugh: Approximate distance from the tip of the nose to the upper row of teeth: http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=11&image=2&lon=1444.1&lat=6073.0&ms=10,146,23.0,1448,6078,1446,6024 Approximate distance from the chin to the lower row of teeth: http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=11&image=2&lon=1444.1&lat=6073.0&ms=10,146,35.4,1464,6103,1463,6186 Teeth height: http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=11&image=2&lon=1445.0&lat=6073.0&ms=10,146,14.9,1450,6076,1451,6111 Teeth width: http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=11&image=2&lon=1445.0&lat=6073.0&ms=10,146,49.4,1387,6098,1503,6096 Here is approximate sketch of the teeth: In fact only two right bottom premolars (?) are clearly visible in their whole outlook. The rest needs to be guessed, mainlyon breaks between them, and in particular the one long break between upper and down rows of teeth. To me it seems that the brightest one (presumably an incisor) is in the exact centre of the mouth (you have no arrow to that one). There are darker patches on either side, one of which (the other incisor? why should it be darker than the other?) You aremaking a mistake. The brighest “tooth” is not an incisor, but simply a blood mark flowing down through mouth area. All teeth should have comparable brightness. Generally there are two options. Either: A: The mouth is closed, and teeth should not be visible. B: The mouth is open, and teeth should be visible. I see no serious obstacles against accepting option B. Particularly as it is in agreement with both Sudarium of Oviedo, and Manoppello Veil data..","date":"2014-07-11","mins":"12:07 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-137176","author":"o_k","post":"So what Dan (and others), still not convinced?.","date":"2014-07-11","mins":"3:46 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-137219","author":"o_k","post":"Like usual, Hugh ; ) I just add that those teeth are well visualised on some 3 D representations. See this: https://shroudofturin.files.wordpress.com/2014/06/image42.png.","date":"2014-07-11","mins":"6:20 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-137183","author":"o_k","post":"Let’s step back ….who really cares? True. Absolutely true..","date":"2014-07-11","mins":"4:28 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-137036","author":"o_k","post":"And both have better than Colin….","date":"2014-07-11","mins":"6:06 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-171921","author":"o_k","post":"Collin, all the other issues aside, first one basic thing. You claim that the Shroud was created in the 1350s to imitate Veil of Veronica, believed to be a sweat imprint of the face of Jesus. However it seems most likely that the original Veil of Veronica WAS NOT a pale sweat like imprint, but rather this: See also https://shroudofturin.files.wordpress.com/2013/12/image thumb43.png?w=600&h=525 And read those articles by Fr. Pfeiffer: http://www.voltosanto.it/Inglese/paginadx1.php?c=3 http://www.voltosanto.it/Inglese/paginadx1.php?c=2.","date":"2014-11-18","mins":"2:19 pm","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-116069","author":"o_k","post":"Dislocated right shoulder is no new discovery. It has been known for a long time. This Image J 3 D reconstruction of the TS man shows it very clearly:.","date":"2014-05-10","mins":"9:27 am","url":"https://shroudstory.com/2014/05/10/the-colin-berry-dislocated-shoulder-theory/","cat":"image_theory","title":"The Colin Berry Dislocated Shoulder Theory"},{"id":"comment-116100","author":"o_k","post":"It is likely that Mel Gibson was influenced by the Shroud image to shoot the scene where Jesus’ right hand is nailed to the cross after being pulled to the “right length” by the centurion. The scene is derived from Anne Catherine. The notable difference is that in this case left hand is stretched.: When the executioners had nailed the right hand of our Lord, they perceived that his left hand did not reach the hole they had bored to receive the nail, therefore they tied ropes to his left arm, and having steadied their feet against the cross,pulled the left hand violently until it reached the place prepared for it. This dreadful process caused our Lord indescribable agony, his breast heaved, and his legs were quite contracted. They again knelt upon him, tied down his arms, and drove the second nail into his left hand; his blood flowed afresh, and his feeble groans were once more heard between the blows of the hammer, but nothing could move the hard hearted executioners to the slightest pity. The arms of Jesus, thus unnaturally stretched out, no longer covered the arms of the cross, which were sloped; there was a wide space between them and his armpits. (from http://www.catholicplanet.com/ebooks/Dolorous Passion.pdf).","date":"2014-05-10","mins":"10:23 am","url":"https://shroudstory.com/2014/05/10/the-colin-berry-dislocated-shoulder-theory/","cat":"image_theory","title":"The Colin Berry Dislocated Shoulder Theory"},{"id":"comment-171939","author":"o_k","post":"Whatever it was or wasn’t based on, have in mind the correspondence between the two images: https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf (see particularly pg. 28 29).","date":"2014-11-18","mins":"4:09 pm","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-171949","author":"o_k","post":"Collin, this is just a reminder of concurrence between the Shroud and Manoppello, which cannot be simply left without an explanation. Dependent on which image is older if the Shroud, than why its features are cloned on Manoppello, and vice versa. Or perhaps, like pro authenticity claims, they are both authentic and miraculous relics from the 1st centrury Tomb of Christ. Anyway, you cannot concentrate on one and ignore the other. Just mentioned this, because you have adressed the Veronica topic..","date":"2014-11-18","mins":"4:53 pm","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-131121","author":"o_k","post":"No one interested yet?.","date":"2014-06-19","mins":"3:10 am","url":"https://shroudstory.com/2014/06/18/the-manoppello-this-little-cloth-cannot-be-further-ignored-in-shroud-research/","cat":"image_theory","title":"The Manoppello:  This little cloth cannot be further ignored in Shroud research!"},{"id":"comment-131719","author":"o_k","post":"Thanks Piero. Perhaps I had seen this report once, but cannot recall when or whether it was indeed this. The general problem with any examination, spectroscopic or otherwiese, is the impossibility to remove glasses. They are obstacle they produce reflexes, and are not transparent to every band of electromagnetic spectrum. Anyway, I see it extremely unlikely for Manoppello to be a painting. I have a question/challenge for all sceptics. Hugh, Gian Marco, anyone. If this is indeed a painting, how has it been made?.","date":"2014-06-20","mins":"12:04 pm","url":"https://shroudstory.com/2014/06/18/the-manoppello-this-little-cloth-cannot-be-further-ignored-in-shroud-research/","cat":"image_theory","title":"The Manoppello:  This little cloth cannot be further ignored in Shroud research!"},{"id":"comment-132527","author":"o_k","post":"What is your comment (…apart the problem with the wavelength to use during examinations) about the spectoscopic analyses on little blood stains ? Spectroscopic analysis are of course possible. There is some minor problem with glass, which has its systematic effect on transparency indifferent wavelenght, which should be taken into account. According to interview with prof. Jaworski (see http://www.manoppello.eu/html/jaworski.html , only polish version, sorry, try Google Translator), the glass is not transparent in the UV band that is responsible for byssus fluorescence. The blood should be no great problem, but if you want to know my opinion, I doubt that those blood stains are real blood. Rather images of bloodstains..","date":"2014-06-23","mins":"11:41 am","url":"https://shroudstory.com/2014/06/18/the-manoppello-this-little-cloth-cannot-be-further-ignored-in-shroud-research/","cat":"image_theory","title":"The Manoppello:  This little cloth cannot be further ignored in Shroud research!"},{"id":"comment-36107","author":"o_k","post":"I have a question here: has ANYONE here (except me) actually read Barbara Frale’s books? Because Jones is not even citing them, just some press reports. To criticize someone’s theory one should at least familiarize with the work, and not just dismiss it basing on what is wrtiten in the media and (perhaps primary) on prejudices. I don’t claim Frale must be right. Just to be fair..","date":"2013-06-04","mins":"4:48 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36146","author":"o_k","post":"I meant to say:”he is NOT citing them in his publication”..","date":"2013-06-05","mins":"3:47 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36117","author":"o_k","post":"I don’t say she is completely truly… just asking whether anyone here (except some Italian sceptics whose opinion is obvious) actually read her books. I know that hypothesis is not her original invention she only further developed previous conceptions but that’s not the point. The presence of the letters cannot be either proved nor disproved currently and rejecting Frale’s interpretation a priori seems not to be quite fair..","date":"2013-06-04","mins":"5:53 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36257","author":"o_k","post":"Daveb of wellington nz : Jones’ account of the frustrating attempts by Ian Wilson to obtain the corroboration he sought, matches the account by Wilson himself. Because it is simply based on Wilson’s account, is it so really hard to check the footnotes? daveb of wellington nz : I fear that she ought to have demonstrated rather better bona fide than she seems to have managed to date. Yes, she was not particularly honest, but skilfull at promoting her books. Nevertheless, I have no heart to condemm her so strongly. She didn’t make any breakthrought, but nevertheless her opinion is worthy to be analyzed. Daveb of wellington nz : One enlightening comment I became reminded of, was that the hood over the head was very likely placed there after death, probably for the portage to the tomb, as the gospel accounts refer to Jesus looking down at his mother Mary and disciple John, which would not have been so recorded if he had been hooded. I don’t see any connection between placing the hood, and Gospel episode. The problem is that, contrary to Jones, presumably Schwortz, Dan, and others, I have read Marion Courage and Frale’s books. I know their arguments, while being under impression that critics are in fact TOTALLLY ignorant of them. And for me, the Jones article, based mainly on press reports, opinions of anti authenticity, and of Guscin (negative on assumption!), is totally UNRELIABLE, BIASED and MISLEADING. That frustrates me a lot! The critics are not even interested what Marion, or Castex, or Frale have to say they ASSUME IN ADVANCE that they MUST be duped! Where is the respect here?.","date":"2013-06-06","mins":"5:37 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36278","author":"o_k","post":"O.K. : The main problem is THAT THEY ARE FRENCH (OR ITALIAN)! So, not being OURS, they MUST be WRONG! So had they been American, or British or Australian, I hardly believe there would be ANY problem with accepting their claims..","date":"2013-06-06","mins":"7:50 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36277","author":"o_k","post":"Max Patrick Hamon : BTW Stephen Jones is not reliable either. He is just a Shroud scholar who keeps compiling what others have said or written to make his own opinion, he is definitely NOT a Shroud researcher. The problem is that opinions of non anglophone scholars (like Marion, Castex, Frale and others) are usually IGNORED in English speaking world. Their books or articles have not been published in English so they don’t exist, or MUST be unreliable. I am from Poland, outside of any major Shroud research centers. And I can see clearly that there is strong national bias in Shroud research: mainly some mad rivalry between American and Italian scholars, but also with others. And I think that the major problem with Ugolotti/Marion/Castex and others is not Enrie’s pictures, not bandings, not numerical artifacts, not even pareidolia. The main problem is THAT THEY ARE FRENCH (OR ITALIAN)! So, not being OURS, they MUST be WRONG!.","date":"2013-06-06","mins":"7:49 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36284","author":"o_k","post":"The topic of Templars has nothing in common with supposed writings, of course..","date":"2013-06-06","mins":"8:45 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36281","author":"o_k","post":"Daveb of wellington nz : 1) Frale picked up Wilson’s hypothesis of about 1978… Dave, I have read Wilson’s book, I have read Frale’s book, I have read Wilson’s objections to Sabbatier testimony. You don’t have to retell me it again. I don’t consider Sabbatier’s testimony as a solid proof o f Templar’s possesion of the Shroud, just another hint, that MAY support it (ligneum/lineum what is the difference in the mouth of tortured man with poor command of latin?) Besides, the topic of writing has nothing in common with supposed wirtings on the Shroud. And Sudarium of Oviedo also. Daveb of wellington nz : 2) The “Sudarium of Oviedo” is widely believed to have been the “cloth over the head rolled up in a separate place by itself” referred to in John 20:7 8. Dave, look at those websites: http://manoppello.eu/eng/index.php?go=sudarium http://www.sudariumchristi.com/uk/tomb/byssus.htm The one thing I disagree is that Sudarium was left on the face..","date":"2013-06-06","mins":"8:28 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36145","author":"o_k","post":"There is SOMETHING, that MAY be considered as writing. Whether it actually is, or not, we are not sure yet..","date":"2013-06-05","mins":"3:46 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36286","author":"o_k","post":"Daveb of wellington nz : 1) Frale picked up Wilson’s hypothesis of about 1978 that … Dave, I have read Wilson’s book, I have read Frale’s book, I have read Wilson’s objections to Sabbatier testimony. You don’t have to retell me it again. I don’t consider Sabbatier’s testimony as a solid proof o f Templar’s possesion of the Shroud, just another hint, that MAY support it (ligneum/lineum what is the difference in the mouth of tortured man with poor command of latin?) Besides, the topic of Templars has nothing in common with supposed wirtings on the Shroud. And Sudarium of Oviedo also daveb of wellington nz : 2) The “Sudarium of Oviedo” is widely believed to have been the “cloth over the head rolled up in a separate place by itself” referred to in John 20:7 8. As the facial image on the Shroud is no less clear than the rest of the image, it would not seem to have been included in the burial. There has been discussion on this site as to what role it may have had. One idea had been that it served to conceal the face during the crucifixion to spare passers by from witnessing the facial grimaces of the agony of the execution. However in view of the verses in John 19:25 30, it would seem unlikely to have been in place before death. Immediately before his death, He speaks to his mother and to John, and is offered vinegar. A more likely explanation seemed to me that it served to conceal the death rictus from passers by during the portage to the tomb. However I recall that there has also been some comment on the differences in the blood stains which may shed more light on the matter, if it can be shown that the blood on the head cloth occurred before death or not. Dave, look at those websites: http://manoppello.eu/eng/index.php?go=sudarium http://www.sudariumchristi.com/uk/tomb/byssus.htm The one thing I disagree is that Sudarium was left on the face..","date":"2013-06-06","mins":"9:30 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36346","author":"o_k","post":"Dave.:”Notwithstanding the header on both Dan’s and Stephen’s postings, both topics were included in Jones’ original posting and so are legitimate topics for further comment.” Sudarium was not mentioned in Jones article. And the only thing that connects Templars with supposed wrtings on the Shroud is controversial persona of Barbara Frale. Jones, who is completely ignorant about her attempts to interpretate Marion Courage and Castex findings, is simply attackng her ad persona, for her dishonesty. But all the sins of Frale do not imply that her interpretation is wrong! O.K.: “The one thing I disagree is that Sudarium was left on the face.” Dave.:I don’t know that anyone claimed that it was left on the face.[..] I don’t know what you’re disagreeing with! Sister Blandina Paschalis Schlömer claims it was left on the face, look at her reconstruction of burial cloths layout: http://www.sudariumchristi.com/uk/tomb/byssus.htm and here: http://manoppello.eu/eng/index.php?go=sudarium Besides, there is another relic which is claimed to be the hood placed over Jesus’ head after His death. It is Holy Cap of Cahors. It has supposed bloodstains. Robert Babinet claimed that those alleged bloodstains match the head wounds of the Man of the Shroud.","date":"2013-06-07","mins":"5:25 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-36144","author":"o_k","post":"Sorry, but the article of Jones about writing, with all respect, is nothing but a PURE NONSENSE. Has Jones even read Marion and Courage’s “New discoveries on the Shroud of Turin” , or Barbara Frale’s books (which I have on my bookshelf)? I presume he has not, because he is citing them in his publication. So how can he reliably assess the validity of their claims? Based on prejudiced opinion of sceptics? On some news articles? What about Castex and his results: http://thierrycastex.blogspot.fr/ ? Jones didn’t write a word about it..","date":"2013-06-05","mins":"3:45 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","title":"The Writing on the Shroud:  A Stephen Jones Update"},{"id":"comment-183458","author":"o_k","post":"And also my small guest posting in this topic: https://shroudstory.com/2014/11/10/guest posting by o k on the shroud as a negative/.","date":"2015-01-15","mins":"5:30 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183498","author":"o_k","post":"In fact, OK, you have it wrong re Garlaschelli’s proposed mechanism. It’s not positive to negative at all. His imprinting of the prominences of a real human being via powder frottage etc creates a negative immediately, because the parts that are brightest in a photograph (nose, brow ridge etc) are imprinted most heavily, and thus tone reversed on the imprint. If the attached pigment were chemically to etch the linen (“acid impurities etc”) and s subsequently drop off with ageing, wear and tear etc, one still has the same tone reversed, i.e. Negative image Yes, Colin, you are right about Garlaschelli. Yet I can imagine (in theory) similar mechanism with tone inversal, so the original image would be positive which is much easier to make. But of course in it still seems entirely implausible in practice. In http://www.acheiropoietos.info/proceedings/Heimburger Web.pdf uou have following quote (pg. 2 3): ” LG wrote [8]: “Of course, the results do not look like the actual Shroud of Turin: rather, they look the way the Shroud must have looked shortly after it was made. The image is much more visible, the pigment is still there and there are no water stains and burn marks”. LG found that the only way to obtain a “fuzzy image” more or less similar to the TS image was to use a dry powder rather than a liquid: “it is nearly impossible, when “painting”with slurry, to obtain the soft tones and the shading effect which are generated almost automatically when rubbing with a dry powder. Also, it is very difficult to spread a thin, even layer of slurry over large areas like the chest”. Following LG complete hypothesis, the TS man was actually “painted” using this way (the only mean to obtain a rather fuzzy image like that of the TS). Because, according to LG, natural red ochre is necessarily contaminated by traces of acidic materials (like humic acids, organic impurities, various salts…), this foreign “reacting” material might be responsible for the degradation of cellulose. Meanwhile the pigment itself fell down with time. In order to test this hypothesis, LG had to find some kind of solid non neutral “sensitizer” which, once rubbed onto the cloth and artificially aged, could slightly discolor the cellulose. After testing dozen of salts and solid acids, either mixed with a pigment or even pure, “none of them “left any trace on the linen after heating and final washing. (boldings mine O.K.) LG recognizes that it is “ a major drawback in this kind of reproduction attempt”. Because the presence of water “seems to be” necessary for the chemical sensitizer to come in contact with the fibers, LG performed then another experiment described below..","date":"2015-01-15","mins":"8:58 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183518","author":"o_k","post":"Here are 3 D enhanced results of Wilson’s experiments, compared to the actual Shroud. It is obvious that they are hardly the same quality. The large distortions of Wilson Beauchamp image are evident: Here you have the original Beauchamp template. It should be noted that it has no bloodmarks that distort 3 D effect in the original Shroud (yet can be removed). Http://www.shadowshroud.com/images.htm.","date":"2015-01-15","mins":"10:43 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183545","author":"o_k","post":"“The fact that she, as an expert, did not think the Shroud was anything special as a an artefact or work of art is significant .” Insignificant? Expert? Anything special? This is madness. Authenticity question aside, I would like to point one interesting observation. Here we have Wikipedia’s article ‘History of photography’ http://en.wikipedia.org/wiki/History of photography It goes as follows: The history of photography has roots in remote antiquity with the discovery of the principle of the camera obscura and the observation that some substances are visibly altered by exposure to light. As far as is known, nobody thought of bringing these two phenomena together to capture camera images in permanent form until around 1800, when Thomas Wedgwood made the first reliably documented although unsuccessful attempt. In the mid 1820s, Nicéphore Niépce succeeded, but several days of exposure in the camera were required and the earliest results were very crude. Niépce’s associate Louis Daguerre went on to develop the daguerreotype process, the first publicly announced photographic process, which required only minutes of exposure in the camera and produced clear, finely detailed results. It was commercially introduced in 1839, a date generally accepted as the birth year of practical photography.[1] We have also another Wikipedia article ‘Timeline of photography technology’: http://en.wikipedia.org/wiki/Timeline of photography technology * 1725 (circa) – Johann Heinrich Schulze makes fleeting “photographs” of words by using stencils, sunlight, and a bottled solution of chalk and silver nitrate, simply as an interesting way to demonstrate that the mixture inside the bottle darkens where it is exposed to light. * 1800 (circa) – Thomas Wedgwood conceives of making permanent pictures of camera images by using a durable surface coated with a light sensitive chemical. He succeeds only in producing silhouettes and other shadow images, and is unable to make them permanent. * 1816 – Nicéphore Niépce succeeds in making negative photographs of camera images on paper coated with silver chloride, but cannot adequately “fix” them to stop them from darkening all over when exposed to light for viewing. And so on. There is one crucial omission here: 30 (circa) 1350 (circa) The Shroud of Turin, the first photographic negative ever is created. Becuase, no matter the question authenticity, the Shroud of Turin is the first photography ever created, several centuries before Schulze, Wedgwood and Niépce. That’s a fact. And just due to its primacy, it deserves appropriate mention in the annals of photography but what’s strange it is completely absent there! Why? Isn’t it just because it is the Shroud of Turin?.","date":"2015-01-15","mins":"2:07 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183525","author":"o_k","post":"Yellowing of lignins is best achieved with sunlight containing wavelengths that are in the near uv, i.e. 360 390nm Bleaching of paper on the other hand is best done using daylight fluorescent lamps with ample wavelengths in the blue end of visible spectrum, i.e. 420 510nm. Why the difference? Uv light has energy sufficient to break chemical bonds that then initiates oxidation and yellowing reactions. Bleaching? Blue visible light, when absorbed by the yellowed lignin products, causes self sensitization with production of active singlet state oxygen, still molecular but a peculiar electronic configuration, different from ground state triplet oxygen. Singlet oxygen has a tendency to add across the conjugated double bond systems that are responsible for yellow colour causing bleaching. Don’t let anyone tell you that bleaching or yellowing of linen, paper etc is a simple predictable process, or that it would have been mastered by our medieval forbears. Yes, they left newly woven linen out in the fields, exposed to sun, in order to bleach until chlorine bleaches were discovered, but that’s about the extent of it. Primitive photo photography? More moonshine than sunshine if you ask me. Yes, Colin, especially interesting is where you can get enough blue, or UV light in the medieval. The Sun? See this:.","date":"2015-01-15","mins":"10:59 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183488","author":"o_k","post":"Here you have Giulio Fant’s paper about experiments with Nathan Wilson theory: http://www.dii.unipd.it/ giulio.fanti/research/Sindone/Pres WILSON.pdf Although of course a kind of photography, it still lacks certain attributes of the Shroud. Essencially it is a photograph of a painting, with almost all its drawbacks. And thus can I imagine that the shroud might be an “accidental” negative created from a positive painting, maybe even something from Constantinople? Chemistry? Theoretically, it is possible that the body image is in fact negative residual image of painted positive image, due to some chemical agent reacting with linen. That’s the favorite (and completely unverifiable) postulate of the sceptics (Schafersmann, Nickell, Garlaschelli), to explain presence of the image and absence of the pigment at the same time. Yet, in practice, such scenario seems totally implausible. And no such mythical agent has been found so far..","date":"2015-01-15","mins":"8:19 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183812","author":"o_k","post":"Hugh: “Three dimensional characteristics of the Shroud image”, IEEE Proceedings, October 1982 and “Correlation of image intensity on the Turin Shroud with 3 D structure of a human body shape”, Applied Optics, Vol.23, N° 14, 15 July 1984 are absolute MUST READ about 3 D features. A quote from the latter (pg. 2252): Figure 12 17 show contrast enhanced artist attempts and VP 8 reliefs of experimental images. Generally, all images exhibit some correlation with facial relief, showing that an artist is capable of producing shaded images that contain some degree of distance correlation. However, all VP 8 images are different from each other, although they were all generated from the same facial shape. This implies that an artist, when viewed as an information transfer process (for distance), is to some extent stochastic in nature. This is in contrast to other mechanisms discussed below, which are capable of repeatabilty in producing shading structures. Figures 12 15 show the rigorous and freehand attempts of artists A and B. These images, when compared to the Shroud VP 8 reliefs, do not seem particularly convincing and in general have masklike quality. Each image posseses relief deformities, for example in the lip regions. The VP 8 reliefs of the rigorous compositions do not show significant improvement over the freehand versions, which suggests that the artist mechanism has a limit as to the precision by which distance information can be transferred. In Figs 16 and 17 the VP 8 reliefs are noticeably improved and in our opinion approach somewhat the quality of the Shroud image. However, these images are the result of the artist copying a distance encoded photograph with the contrast restrictions removed. Here you have 3 D enhancment of the video clip you posted. Of course in thermal scale , which is the most objective: This is certain failure..","date":"2015-01-16","mins":"5:52 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-184320","author":"o_k","post":"I can see only 2 explanations: 1) Lalaing lied. 2) These “experiments” were performed only on a tiny part of the shroud image which are perhaps not visible today because of the 1532 fire (??). Or perhaps those are slightly exaggerated descriptions of Shroud damages prior to 1532 fire. The presence of ancient watermarks and poker holes might have created the story about trials by fire and water..","date":"2015-01-18","mins":"3:53 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-54375","author":"o_k","post":"And if you find that, please explain how the cloth was draped over the corpse to maintain the perfect correlation of gray tones made by the reaction. I would put it different way; whether in position in which the corpse was laid, and the cloth drapped over it, the perfect correlation of gray tones made by the reaction can be maintained (IMHO probably not). See this article by Fanti & Marinelli: http://www.sindone.info/FANTI4 A.PDF.","date":"2013-12-01","mins":"1:27 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54288","author":"o_k","post":"Those are micropoperties, and interpreter is interested only in macropoperties..","date":"2013-12-01","mins":"7:17 am","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-42919","author":"o_k","post":"Yannick Clément : Quote: Even if this was true that Rogers wasn’t convinced that his own hypothesis could account completely for the high resolution (note that I’m still very doubtful that it was really the case since I don’t find any statement of that nature in any of his writings), this could not be seen as meaning that something supernatural must have come to “patch” the hole!!! Thinking like this is truly doing a magical thinking, which, in essence, is completely unscientific. But why unscientific? And why supernatural? It is normal in science that if some phenomena cannot be explained within boundaries of old theories, new theories with new speculative entities are being proposed, some are later rejected, some confirmed. For example, neutrinos, they were once proposed as a “patch” for the “whole” in particle physics, and later they were discovered. And no one calls it “magical thinking”..","date":"2013-09-04","mins":"3:09 pm","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"id":"comment-53945","author":"o_k","post":"Hi Hugh, if I amy throw my two cents: “There is no correlation in a photograph between the density of the imprint and the distance to the object.” In theory, of course this is true In theory it is both true, and false, dependent on conditions and purpose remember VP 8 was designed to process photographies. However, in detail, it would be truer to think of four or five such spheres squashed together, a big one for the forehead, a small one between two slightly larger ones for the nose and cheeks, and another for the chin. Each sphere appears equally bright where its surface is tangential to the plane in front of the face, which is why in the shroud, and in many photographs, the forehead, nose, cheeks and chin all appear more or less equally bright, and more or less equally high on an Image J repesentation. The more angled the surface of the ‘sphere’, the sides of the nose say, or the slopes of the eye sockets, the more different they are in intensity from the ‘flat’ frontal surfaces, and the greater the appearance of distance. But remember also about: * shadowed areas on the face. * secondary reflections. * variations in albedo, even for statue painted white, that was used by Nicholas Allen. * light directionality and stability. In this way, by coincidence more than anything else, the distance/intensity colouration of the shroud image, which is probably real, resembles the distance/intensity colouration of a photograph. In case of the Shroud, the correlation is definetly not by coincidence. I’m not sure what the parameters of this observation are. Photos of people, as I have demonstrated on this blog, do show this correlation, Very poor correlation, compared to the Shroud. While the full moon appears quite flat. Is this due to our inability to resolve contrast at such high illumination, given that the background is so dark? I don’t know. No, it’s much complex matter. Generally we can adopt a simple model saying that reflected light splits into two components: * light reflected according to the law of reflection (the angle of incidence equals the angle of reflection) (specular reflection) * light scattered in all directions.(diffusion reflection) The overwhelming majority is the second component. Thus the surface of them moon seen at any angle is similar, but not identical. In fact, the luminosty of the full moon is more than twice half moon. The diffusion reflection mechanism is the way VP 8 works in case of the planets. But for our eyes, the relative differences in distance between each part (center or edges) of the moon are too small to see any effect. And the variations of albedo due to the moon’s topography (dark lunar maria, bright uplands) are differences of much larger magnitude..","date":"2013-11-29","mins":"4:33 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54376","author":"o_k","post":"BTW, Girorgio, I have sent via Dan my response to your e mail..","date":"2013-12-01","mins":"1:29 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-42931","author":"o_k","post":"Of course, the fact that some natural theory has gaps, doesn’t automatically “prove” the Resurrection, or any theories assuming that the Image on the Shroud is a direct effect of it. But it doesn’t mean we are not allowed to assume some additional factor, whether within confines of our current knowledge of nature (some influence of electromagnetic field? additional chemical reactions?), or outside of them (Resurrection?). The notion that “you can’t use an unknown to prove another unknown” is nonsense. You can use it, and it is frequently used (just example of neutrinos I mentioned). The one thing you need, is to discover one of those “unknowns” and make it “known”..","date":"2013-09-04","mins":"3:41 pm","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"id":"comment-42925","author":"o_k","post":"Yannick Clément : Quote: Resurrection of Jesus and the creation of the image could take place even without the flash … but also in a miraculous way! My answer: If this magical thinking was true, then can you explain to me why God was such a poor “artist” that he was even able to produce a complete body image on the cloth? Effectively, the UV photo study done by Miller and Pellicori of STRUP proved that the body image was not totally complete in some parts, like the feet region and also the back of the knee (dorsal image). Read my comment again, so maybe you will understand the point..","date":"2013-09-04","mins":"3:32 pm","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"id":"comment-42940","author":"o_k","post":"Yannick Clément : Also, as I said in my long guess posting, the fact that Rogers became convinced that the image chromophore was located only in a thin layer of carbohydrates impurities (along with the most probable fact that the image formation was very mild and happened at normal temperature) just reinforced his idea that the image formation process must have been completely natural… Is it so hard to understand? Non sequitur. Yannick Clément : My answer: Of course Rogers had some anti supernatural bias for simple and good reason that he was a real scientist. Science should never open the door to any supernatural event that could “patch” the holes left by someone’s hypothesis. Never. This would be like going back to the Middle ages. Yannick, my dear friend… you sound like a MILITANT ATHEIST now. And I am really convinced that you have VERY DISTORTED perception of what scientific inquiry is, and what ISN’T. Your notion above is similar to what positivists and other philosophers of science abandoned about 100 years ago (however it is still present in popular imagination, and even by some scientists with little or no philosophical background). Science should be open for all possibilities. With the approach presented above, the scientifc progress would have halted around year 1900. Just want to remind that I am NOT against Rogers theory. Just want to say, that even if correct (and this is doubtful, and far away from being proven because contrary to someone’s beliefs, it has very serious problems), in my opinion it is AT MOST half of the explanation..","date":"2013-09-04","mins":"4:23 pm","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"id":"comment-42932","author":"o_k","post":"Yannick, do you really know what is “a real scientific inquiry”? Because I am under very strong impression that you have a very distorted vision of it (shared by Rogers BTW). You can call “unscientific” whatever you wants, but this doesn’t mean all others must agree..","date":"2013-09-04","mins":"3:44 pm","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"id":"comment-42950","author":"o_k","post":"Quote:”My answer: Science should follow closely the scientific method, which only take into account all the known data and observations.” And contrary to your claims, I think that the Rogers hypothesis is FAR AWAY from that. What about 3 D effect, or no side images, for example? Besides what are the “known data and observations.? There are many controversies about them. What about possible secondary images (coins, inscriptions, flowers)? If their presence is confirmed, this would be something that Rogers’ theory CANNOT explain so that’s why IMHO there is so great opposition against them (pareidolia is just a convenient excuse). Quote:”And when you do this concerning the Shroud without any preconceive notion regarding the Resurrection, you have some good chances to come to the same conclusion than Rogers versus the image chromophore (i.e. Located only in an impurity layer and nothing else). No problem yet. Quote: “And once you came to such a conclusion and consider the scientific truth that no known form of energetic radiation seem to be able to color only such a thin layer of impurities without affecting at all the underlying linen fiber, ” No special problem yet. Comment: I don’t think that the radiation hypothesis must be “that right explanation”, it also has its own specific problems, just like hypothesis of gaseous diffusion has own. And unless any of them (radiation or diffusion, I don’t favor any of them) overcomes its specific difficulties, they cannot be treated as explantion how the images were formed on the Shroud. Quote: “that’s when you have no otheir choice than to highly favored a natural formation process for the body image.” As I said, non sequitur. The fact that the image is located just only on impurity layer BY NO MEANS proves that formation process for the body image was only natural. It MIGHT (but didn’t HAVE TO) have some supernatural component.And perhaps it is impossible to either prove or disprove its presence..","date":"2013-09-04","mins":"5:18 pm","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"id":"comment-42871","author":"o_k","post":"An extract from my article written in polish: “Ale wizerunek jest. Niewytłumaczalny. Ray Rogers sądził że jego teoria reakcji Maillarda jest w stanie w naturalistyczny sposób, bez odwoływania się do cudów, wyjaśnić powstanie wizerunku na Całunie. Rogers był chemikiem, przeprowadził odpowiednie eksperymenty i stwierdził że przy odpowiednich warunkach da się tą metodą uzyskać zabarwienie poszczególnych włókien o właściwościach takich jak na Całunie. Ale nie był fizykiem i nie interesowała go tak naprawdę praktyczna niemożliwość uzyskania tak doskonałych makroskopowych właściwości wizerunku w wyniku procesu gazowej dyfuzji. Jak to możliwe utworzyć tak niezwykły obraz nie zaprzeczając statystycznym prawom termodynamiki? Rogers uznał że nie ma sensu rozważać tego problemu, ot zdarzył się taki nieprawdopodobny wypadek i my możemy jedynie a posteriori dociekać jak to się w sposób naturalny stało (nie oznacza to że teoria Rogersa zaprzecza Zmartwychwstaniu, po prostu w ogóle nie bierze go pod uwagę). Może tak się stało, może nastąpił taki zupełnie niewyobrażalny wypadek –w teorii nie jest to niemożliwe. Tyle że tak nieprawdopodobne, że prędzej bym się spodziewał że odkryty basen olimpijski w letnie upały sam z siebie zamarznie (co też jest teoretycznie możliwe)… I dlaczego zdarzyło się to akurat w przypadku osoby, która przeszła dokładnie identyczne męki jak opisywane w Ewangelii męki Jezusa z Nazaretu, z którym być może jest po prostu tożsama… Chyba że czyjaś niewidzialna ręka kierowała torem każdej cząsteczki amoniaku… Zmartwychwstanie Jezusa i utworzenie wizerunku mogło się odbyć również i bez błysku… ale w równie cudowny sposób!” Czytaj więcej na: http://ok.apologetyka.info/racjonalista/dzieje caunu turynskiego wedug leszka zuka z racjonalisty cz 2,629.htm Google translation (with my corrections): But the image is. Inexplicable. Ray Rogers believed that his theory of the Maillard reaction is able naturalistic way, without resorting to miracles, explain the origin of the image on the Shroud. Rogers was a chemist, carried out the appropriate experiments and found that the appropriate conditions this method can get the color of individual fibers with properties such as the Shroud. But he was not a physicist and was not really interested in the practical impossibility of obtaining such perfect macroscopic properties macroscopic of the image through a process of gaseus diffusion. How is it possible to create such an unusual image not denying the statistical laws of thermodynamics? Rogers concluded that there is no point in considering this problem, just happened to such an incredible event and we can only investigate a posteriori how it naturally happened (this does not mean that the theory of Rogers denies the resurrection, just does not take it into account). Maybe so, maybe there was such quite unbelievable event in theory it is not impossible. Only so improbable, that sooner I would expect that the outdoor Olympic swimming pool to freeze by itself in the summer heat (which is also theoretically possible) … and why it happened jus tonly in the case of the individual who had suffered exactly the same passion as Passion of Jesus of Nazareth described in the Gospel with whom perhaps he can be identified … unless Someone guided by the invisible hand the track of each molecule of ammonia … Resurrection of Jesus and the creation of the image could take place even without the flash … but also in a miraculous way!.","date":"2013-09-04","mins":"7:25 am","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"id":"comment-73398","author":"o_k","post":"Dave: There should then be a short section of cloth, clear of the head, on which there is no image, and we would see a gap not less than about 30cm between. There is course no gap seen at all, but the frontal and dorsal images at the crown abut each other. Provision of a head band does not resolve the issue at all and I consider it of no relevance. Nor do I accept Chris B’s assertion that the dorsal head image is actually a water stain. This issue might be resolved by a VP8 3 D image of the dorsal head image, but I don’t recall ever seieing one. However the blood stains from the cap of thorns are visible there, the outline of the hair pretty well matches that on the frontal image, and on the better negatives the pigtail is clearly visible. No more then 20 cm. There is definetyl a gap, I measured it, the result is about 18 cm. When I compared with my head everything was fine. As to 3 D image recopnstruction, I did one. No image atop of the head: See those pictures: The question how the Shroud was wrapped around the head is one of the biggest enigmas of the Shroud. There are no clear answers, and the tensions of the cloth could have made it folded in completely unpredictable way. Near horizontal aspect of the cloth over the face, and near contact with the hair are only two suggestions, neither of which is the true solution I think, it was rather somewhere in the middle of them, with corners possibly protruding away from the contact with the head. Just see the Mario Latendresse’s experiments: http://www.sindonology.org/papers/latendresse2005a.pdf Gerard, John, Louis and others: I’ve often wondered about this lack of image. My thoughts are a napkin that is tied under the chin a chin band that covered the top of the head. Another possible explaination is perhaps “the other cloth” mentioned in the gospel was placed at the top of the head. Of course such cap was used. Moreover it was probably preserved, and it is known today as the Cap of Cahors: http://books.google.pl/books?id=J Es5bm L B5o C&pg=PA73&lpg=PA73&dq=Cap+of+Cahors+%22relic%22&source=bl&ots=Zb0 TC0t Lp H&sig=yz N Rv Suvts80v3z V1m ATL Um28c&hl=pl&sa=X&ei=GBLX Ut Ol G m O7 Qb Lzo Gw DQ&ved=0 CGIQ6 A Ew BQ#v=onepage&q=Cap%20of%20 Cahors%20%22relic%22&f=false.","date":"2014-01-15","mins":"7:43 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73481","author":"o_k","post":"Dave: However I see no reference to an image being on the Cap, only matching blood stains. If there is no image on the Cap, and only an indistinct image on the Shroud, this might reinforce the thought that the imaging action was essentially vertical. We don’t know, perhaps there could be an image on the Cap, but it has not been noticed for obvious reasons. Anyway, it would be good to check it. Louis: Thanks, OK. The band and helmet of thorns are two different things. I would like your and David Goulet’s views on the sides of the face image I have no definite opinion on that. There were many theories suggested. But first, we should clarify what are we talking about. The space between cheeks and hair? Or outside the hair. If we are concerned about the former, there are some suggestions that those spaces are actually darkened due to yarn bandings, as raised by Rogers and others, see https://shroudofturin.files.wordpress.com/2012/03/image37.png Barbara Frale put forward a theory that strips of papyry with ‘death certificate’ and ID of the body was glued to the face in this place. There were also suggestions, by Marion & Courage, that wooden supports for head were used during the burial. The would have kept the Shroud over the face, just like on this picture http://ok.apologetyka.info/upload/ap upload/articles/15/2013/06/rysunekxi.jpg, other suggested solid spices to perform similar function. The outer space is most likely a chin band, perhaps Cahors. This could perhaps explain also the lack of image in space between cheeks and hair, however I am not certain about this. It is also posiible that the sides of the face were actually imaged on the Shroud, but they were obscured by hair, which we see on the front image. Or they were at large distance from cloth – the Shroud is over 1 m wide. There are many options, as you see. It is hard to give definite answer..","date":"2014-01-16","mins":"6:14 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73583","author":"o_k","post":"Ada Grossi, Jewish Shrouds and Funerary Customs: a Comparison with the Shroud of Turin https://www.academia.edu/2427474/Jewish Shrouds and Funerary Customs a Comparison with the Shroud of Turin in 1st International Congress on the Holy Shroud in Spain   Valencia April 28 30 2012 ed. Centro Espanol de Sindonologia CES  “In a nutshell, the ritual operations to perform on a corpse to honour the dead (Kevod Ha Met) can be thus summarized: the family of the dead had to take care of funeral and burial within the day when the death occurred, before sunset, because it’s not allowed leaving a body unburied overnight41; the body has to be constantly watched and those who keep vigil are free from precepts and prayers42; the first thing to do is to close the eyes of the dead43 (possibly by the firstborn, remembering Gn 46:4)44, then the jaw and every orifice” “Jewish funerary customs, as seen above, required to bind the deceased’s jaw to keep it close”.","date":"2014-01-18","mins":"4:37 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-89147","author":"o_k","post":"There is only one man who could ever have discovered a secret method of creating the Shroud image just prior to the 14th century: the English polymath Roger Bacon, 1220 1292. Dave; Please don’t forget that I first came with that idea (although obviously I don’t believe it) so copyright reserved by me ; ).","date":"2014-03-15","mins":"6:38 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-89318","author":"o_k","post":"The problem is that for a month time my Internet provider has been suffering some kind of breakdown most probably a cable is broken somewhere, as me and a few of my neighbours have no connection. They had promised they woul have repaired it by 13th this month. On 13th I received a message that it will be not until 31st but I have little trust to them. I bought some provisional alternative, but with limited transfer, used only for the basic needs to check mail or so. No You Tube or any extensive searching of the Internet. I hope they will finally make it work..","date":"2014-03-15","mins":"4:22 pm","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-170774","author":"o_k","post":"David Mo: First you scream insolently: I’m sorry but this work is useless. A lot of relevant data are missing; it is applied on photographs of dubious quality and not on the originals and it forget that the current theories about painting in the Shroud don’t defend a traditional painting, but the rests of a painting not made with the traditional brushes (fingers, ink pads or similar). Furthermore, the bibliography is practically nil. I would like to know other studies about directionality and Fourier method (FFT) in the field of History of Art. For example: in the debate about the autenticity of “la Bella Principessa” (see here: http://www.theguardian.com/artanddesign/2011/sep/27/lost leonardo da vinci portrait# ) there was much talk about the directionality of the brush strokes but I don’t remember nothing about the FFT. And then you bashully admit: I don’t think the OK’s paper is speaking of directionality of the light, because this is a problem that has nothing to do with FTIR (this is what i know in study of fakes of art) or FTT (I don’t know) If you cannot differentaite between FTIR (Fourier transform infrared spectroscopy, see http://en.wikipedia.org/wiki/Fourier transform infrared spectroscopy ), and simple FTT (Fast Fourier Transform http://en.wikipedia.org/wiki/Fast Fourier transform ), then I can say only one thing: despite your boasts how smart you are, you are in fact complete IGNORANT. Read this: http://en.wikipedia.org/wiki/Art forgery#Digital authentication Statistical analysis of digital images of paintings is a new method that that has recently been used to detect forgeries. Using a technique called wavelet decomposition, a picture is broken down into a collection of more basic images called sub bands. These sub bands are analyzed to determine textures, assigning a frequency to each sub band. The broad strokes of a surface such as a blue sky would show up as mostly low frequency sub bands whereas the fine strokes in blades of grass would produce high frequency sub bands.[15] A group of thirteen drawings attributed to Pieter Brueghel the Elder was tested using the wavelet decomposition method. Five of the drawings were known to be imitations. The analysis was able to correctly identify the five forged paintings. The method was also used on the painting Virgin and Child with Saints, created in the studios of Pietro Perugino. Historians have long suspected that Perugino painted only a portion of the work. The wavelet decomposition method indicated that at least four different artists had worked on the painting Wavelet analysis is similar technique to Fourier analysis, in fact it is a kind of generalization of it. Back to learning, David Mo..","date":"2014-11-12","mins":"4:29 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170781","author":"o_k","post":"That’s all you have to say, David Mo? Go to school, maybe you’ll learn something..","date":"2014-11-12","mins":"5:26 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170784","author":"o_k","post":"Of course FFT not FTT, everyone mispells it, so I also have to….","date":"2014-11-12","mins":"5:37 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170821","author":"o_k","post":"I believe an MDI study would be very worthwhile. Yes. But that’s completely different thing than what I have presented here..","date":"2014-11-12","mins":"8:49 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170786","author":"o_k","post":"I think all of you mix several things: spectroscopy of electromagnetic spectrum (visible, IR, UV, X ray etc.), with simple decomposition of image via Fourier transform (that is transition from real space, showing XY location of points to the wave vector that is spatial frequency space, with coordinates UV). It is the latter that I have done. It has nothing in common with light direction, or with any chemical analysis of it via spectroscopy..","date":"2014-11-12","mins":"5:44 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170818","author":"o_k","post":"You fool! You think you outsmarted everyone, including STURP, but you don’t know basic things like what FFT or negative is! Quicksearch, and you have this: http://download.springer.com/static/pdf/951/chp%253 A10.1007%252 F978 3 7908 1856 7 7.pdf?auth66=1415799362 2e492fee31de42511b1e7743af756f8b&ext=.pdf , especially chapter 4.3 Fourier Spectra.","date":"2014-11-12","mins":"8:39 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170881","author":"o_k","post":"When I first posted this, it was for free, bad thing I haven’t saved the entire book then….","date":"2014-11-12","mins":"2:51 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170824","author":"o_k","post":"And BTW John, may I ask you as a lawyer? May I now openly claim that Charles Freeman is delliberately deceives people, especially readers of ‘”History Today”? Are those evidence we presented sufficient enough to maintain this statement, without accusation of libel?.","date":"2014-11-12","mins":"9:23 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170858","author":"o_k","post":"Hugh, do you have Marion Courage book? You mentioned once you were intending to purchase it. There is clear description of this property in that book..","date":"2014-11-12","mins":"1:13 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170864","author":"o_k","post":"There is also the possibility that the ‘paint’, if there was any, was dabbed on vertically, and the blood dripped on with a pipette. In these cases too, no directionality would necessarily be created. Hugh, see this: Normal image of hexagonal mask. FFT of it. You can play with it yourself in Image J, or GIMP, for example. In Image J use option Process>FFT>FFT, and see yourself! I suppose FFT would rather detect painting dabbed vertically, similarly like it analised hexagonal mask. Simply, our minds are not adapted to create totally random images, which would turn out isotropic in Fourier domain. There will be always deviations from randomness..","date":"2014-11-12","mins":"1:47 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170860","author":"o_k","post":"Yes, FFT recognises the weave. I wrote on page 4: Besides several dots, corresponding to the weave (and a cross, which is simply artifact of the limited size of the box), we see that the spectrum is quite isotropic, with no preffered directions..","date":"2014-11-12","mins":"1:15 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170819","author":"o_k","post":"Http://link.springer.com/chapter/10.1007/978 3 7908 1856 7 7.","date":"2014-11-12","mins":"8:40 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170888","author":"o_k","post":"When other people I am talking to think it is quite obvious, if only from looking at the depictions in Beldon Scott. That shows with whom you discuss those issues, Charles. But us you cannot fool. So the directionless can simply mean that the paint was applied in a fairly fluid form. Yeah, yeah, and you obtain marvelously clear photonegative while liquid paint is spreading across the cloth…. I would assume that Colin is reading all these books before he gets carried away with his own esoteric solutions. It really does seem that he hasn’t mastered the basics of medieval painting on linen yet but it might be wise to do so so that someone somewhere might take him seriously! All those books won’t replace empirical evidence..","date":"2014-11-12","mins":"3:25 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171003","author":"o_k","post":"Mo, the more you mouth of in this topic, the more evident is that your knowledge is null. Some literature: http://ciam.inra.fr/workshop ssiab9/sites/ciam.inra.fr.workshop ssiab9/files/slides/jeud/Jacobsen SSIAB9.pdf http://people.math.aau.dk/~robert/publications/thesis.pdf https://web.math.princeton.edu/~ingrid/VUB/WOLFF SENIOR THESIS.pdf http://journals.istanbul.edu.tr/iujeee/article/view File/1023013434/1023012655 Niyazi http://homepages.cae.wisc.edu/~ece539/fall10/project/Luo rpt.pdf http://alexanderdbrown.com/research/digital analysis paintings.pdf http://etopia.sintlucas.be/3.14/Daubechies Eng.pdf And so on (search for ‘Fourier’) Hugh: I have been looking for some references to the FTT applied to the forgery in arts and I don’t find anything. This is a very different situation for Discrete Wavelet Transform (DWT) Of course you don’t know that Wavelet analysis is just a generalization of Fourier analysis, working on the same principle (it is simply more practical in painting analysis, so that’s why it is preffered). You don’t know basic things, but you pretend to be the smartest. The material of FFT seems to be photographs. I suppose that Marion and Courage worked on high definition microphotographs. But comparing this kind of photographs with others extracted from a magazine is useless. O.K. Is comparing too very different kind of things and the results cannot be homogenous. You suppsose… I am quite certain you haven’t read Marion & Courage work. And my own small presentation as well. As you can see, if there is possibility to obtain some good quality photographs (in any way, whether scanned cover,or other high definition photo in book or magazine) the results are good enough to be included in presentation, and make some conclusions from it. You don’t know basics, and you dare to teach me not only me, but Lorre, Lynn, Marion, Courage (who claim the same as me) and others? I understand even less why he analyses the common pictures of a coin scratched with a pencil. He seems to think that there is somebody who thinks that the shroud was made with pencil and a coin. Astonishing. The more astonishing is who wrote on November 9, 2014 at 10:58 am those words: Everybody has done sometime a negative image. It suffices to rub a paper on a coin with a pencil. Furthermore, I have done a negative image with a pencil and a finger in 5 min. Where is the mistery? First you were so confident, no mystery in the Shroud image, it is like to rub a coin with a pencil (you were not the first one, nor probably the last to repeat this nonsense) and know you run away, you allege me that i think that and so on. You little poor sceptical coward, have you forgotten your own words? Spreading innuendos is the best you can?.","date":"2014-11-13","mins":"5:37 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170880","author":"o_k","post":"I’m sure I misunderstand, OK. What exactly demonstrates directionality? Is it the number and distribution of the little vertical and horizontal bars across the x and y axes? As I say, I look forward to exploring the FFT function on image J myself. It looks fascinating. I hope you know what the wave vector is http://en.wikipedia.org/wiki/Wave vector You can see that in my presentation. The isotropic means no directions are preffered so we should see roughly circular Fourier image in the center. If image is directional, we see some prefferred frequencies (or better say wave vectors). If it has some structure, then it has equivalent structure in Fourier representation..","date":"2014-11-12","mins":"2:49 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170906","author":"o_k","post":"Now a few demonstrations for educational purposes: A square FFT of it A square with its edges smoothen by gaussian blur FFT of it A square FFT of it A circle convolved with 50 pixel radius gaussian FFT of it A quasi random noise (actually it is a fragment of sum of several CCD read outs during dark expositions) FFT of it The same quasi random nosie , but this time with 3 radius median filter applied, showing that this nosie is not entirely random. FFT of it..","date":"2014-11-12","mins":"4:55 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171052","author":"o_k","post":"None of these works speaks about FFT. Only one says hat the Fourier transform is useful for detect brush strokes ( by a student; not publshed). This is explicitely refuted in the others. Etc., etc. Your list is as useless as your work. If I have time I will put here some very interesting extracts. Are you joking? Do you even know what FFT is?.","date":"2014-11-13","mins":"10:52 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171057","author":"o_k","post":"As I use it apparently I know ; ) So you first, do you know what FFT is?.","date":"2014-11-13","mins":"11:17 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171244","author":"o_k","post":"BTW: I have simulated a simple model of image made using vertical dabbing. I made this image in 10 minutes in Paint using spray imitation, with various intensity, placing dots in as much random places , as I could: Then I applied Gauss filter with 4 pixel radius: Here is FFT of the first image, and below a second one:Although the Fourier images are axially symmetrical, yet I think there is a good chance we would recognize that those pictures were artificially made..","date":"2014-11-14","mins":"3:30 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171233","author":"o_k","post":"David Mo: No much, but surely more than you, because you make alleged supportive references that actually are refutations of your presentation (?). You pretend to be wise guy, but the more you take voice, the more ignorant you turn out. Obviously you don’t know what the Harmonic Analysis, or FFT is, and everyone who knows laughs at you. And of course you don’t understand what those paragraphs are about. The papers presented discuss the issue of distinguishing between the original paintings and the copies of them, using as one of the tools Fourier or wavelet analysis of image areas in search for brush strokes (best visible in infrared but that does not mean that they cannot be seen in visual light) and then via some statistical analysis of frequencies (characteristic for some individual artist) determination whether the painting came from the same or different hands. They don’t deny that brush strokes leave some directional information in Fourier domain, only that such analysis is not always enough to determine whether painting is an original or a copy. We have much simpler task to determine whether there is some directional information in Shroud images, associated with hand made manipulations (there is no, as you can see). It has been ad rem, now ad personal: Mo, I don’t know what’s greater, whether your ignorance or or your arrogance! You don’t even know what FFT is (to your information Fast Fourier Transform is an algorithm, or even the whole family of algorithms for convenient calculation of numerical Fourier transform, with as few operations as possible http://en.wikipedia.org/wiki/Fast Fourier transform, but in jargon the term is used for the operation itself), you don’t understand what those papers are about you haven’t performed similar analysis even on amateur basis, and you dare to claim you are wiser not only than me, but Lynn, Lorre, Marion and Courage as well! As you cannot prove your points yourself, in your intellectual misery, the all you can do is to take some extracts of some publications out of context, and then DEMAND others to disprove your point, while you’ll be judge, saying what’s correct or not! It is not only in this thread that you try this primitive trick to hide your lack of competence! As I am regular on this blog, and discussed with you not once, I know your awful style! David Mo, “great expert in everything”. Great ignorant actually! That’s all for you, because discussion with such guy like you is a waste of time. You have asked yourself for so many invectives you got what you deserved. Had you some respect, instead of pride, arrogance, and spreading insinuations, we would have talked in different way..","date":"2014-11-14","mins":"2:40 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171250","author":"o_k","post":"Http://en.wikipedia.org/wiki/JPEG#JPEG compression JPEG uses a lossy form of compression based on the discrete cosine transform (DCT). This mathematical operation converts each frame/field of the video source from the spatial (2 D) domain into the frequency domain (aka transform domain.) A perceptual model based loosely on the human psychovisual system discards high frequency information, i.e. Sharp transitions in intensity, and color hue Screenshot in TIFF doesn’t help here, as it is merely a screenshot of JPE Gs so information is lost anyway. Thus FFT of JPE Gs usually look ‘Shroudlike”..","date":"2014-11-14","mins":"4:19 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171398","author":"o_k","post":"Hugh, re Garlaschelli. I said that I don’t recommend using JPE Gs for Fourier Analysis, due to reasons described above. Yet this Garlaschelli photo, although being JPEG, has resolution high enough,so some FFT analysis can be performed. But first look at Garlaschelli himself making his image. Take care especially about his hands moving. (16:59 onwards) Garlaschelli uses different technique than what I understand by the term ‘vertical dabbing’. My understanding is making small spots by multiple single touch ups by small brush (or using pippette), to create an image. But Garlaschelli’s approach is entirely different. He uses large sponge , an inch or so in size, roughly the nose width, to rub a pigment down into cloth laying on bas relief. In strict technical sense it isn’t a ‘painting’ as he doesn’t use his hands to make a form of the image, instead he only reflects the shape of bas relief his hands are used only to apply pressure to the sponge. And as his sponge is large (a few cm^2, that is the size of area usually analysed via FFT), in theory there should be no directionality (but of course this method is hardly suitable to make fine detailed images). In theory, of course. But in practice he cannot hesitate from moving his hands. Here are some of my analyses of various fragments of Garlaschelli’s image: Hair area: Nose area: Beard area: As you can see, he leaves directionality information in Fourier domain..","date":"2014-11-15","mins":"8:36 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171254","author":"o_k","post":"A you have in the Wiki quote above, JP Gs eliminate higher frequencies in Fourier domain, which are equivalent of small scale structures in real domain. Small scale structure =high frequencies. Large scale structure =low frequencies..","date":"2014-11-14","mins":"4:46 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171432","author":"o_k","post":"Hugh, if you cannot see sufficient distinction between Garlaschelli and the Shroud, see this, the FFT of (almost) the whole face:Garlaschelli Enrie. Even despite Shroud has photo has more defects (I mean bandings and bright vertical streaks going up and dow n remmeber while performing FFT analysis AVOID sharp edges), at extreme contrast its FFT is much more isotropic than Garlaschelli direction of the movement of his hands while rubbing is reflected in the Fourier spectrum. FFT analysis is actually a really powerful tool..","date":"2014-11-15","mins":"2:02 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171437","author":"o_k","post":"Hugh, do you know what diffraction and interference is (and perhaps studied mathematical derivation of it)? The formalism is the same here. For now check once again my models I posted on November 12, 2014 at 4:55 pm Square, circle and so on. If the model is fairly symmetric, than Fourier image of it is also symmetric. If not, and some directions are preffered, then those directions are portrayed also on Fourier image. So for example the long long horizontal streak in low frequencies on Garlaschelli’s FFT shows there is a distinguishable horizontal regular structure comprising several vertical bands with low frequency (that is large spatial distance between them)..","date":"2014-11-15","mins":"2:49 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171442","author":"o_k","post":"Well, I’ve tried this too now, and I don’t get the same image. How do you put your images up here? If I knew, I’d show you what I get. Otherwise I may have to bother Dan again with a pdf! Hugh, do you use images I post here? Unfortuantely it seems that Imageshack reduces the resolution of images I post. For example the Garlaschlli fragment from the previous post that I use is 1131×1380 pixels, Enrie has 1782×1674 pixels. Probably that’s the problem..","date":"2014-11-15","mins":"3:07 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-30883","author":"o_k","post":"Gabriel : But as I mentioned before, currently the major limitation to start a serious study is that most probably, a supercomputer would be needed. Why? Do you know how “primitive” was Marion equippment compared with what we have today? In his 1997 book he complains 16 bit 1024×1024 pixels is too much for 1.44 MB floppy… Compare it with today’s possibilities. Many advanced processing of tens, or hundred images (for example astronomical images from CCD plates) are performed on normal, commercially available PC computers. I don’t see any problems here.The only problem is quality and availability of images, and finding a proffesional guy to do the job, and present it in peer review. And good will of scientific community not to ignore his results due to bias and misconceptions. Please try to search ‘Marion’ in shroud.com browser. You will find very little, criticism of his findings by Guscin, for whom the inscriptions make no sense (but he isn’t image proccessing expert, so his opinion is not valid), and a few sceptical comments by Barrie Schwortz (which cannot be considered as serious refutation of Marion’s results). Nothing more. Not even obituary or in memorian for Marion, who died in 2009!.","date":"2013-04-15","mins":"12:59 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-59499","author":"o_k","post":"I don’t know why, but this method fails.","date":"2013-12-14","mins":"4:11 pm","url":"https://shroudstory.com/2013/12/10/how-to-insert-an-image-in-a-comment/","cat":"news_&_views","title":"How to insert an image in a comment"},{"id":"comment-170459","author":"o_k","post":"I do not understand: what do you mean by “default greyscale” of a color photo. The histogram of greyscale values rigth below first Shroud image..","date":"2014-11-10","mins":"4:32 pm","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"},{"id":"comment-30903","author":"o_k","post":"Why? We know what to look for. Just process the new images (with many different algorithms preferably), as well as the old 1931 Enrie, 1978 Miller, perhaps even 1898 Pia for additional control, and check whether allegedly seen letters (coins and flowers as well) are in the places where they were claimed to be..","date":"2013-04-15","mins":"3:19 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30906","author":"o_k","post":"Yannick Clément : If letters would really be on the Shroud, that would mean there would be some ink residues or another substances there that make them visible. Actually, Barabra Frale in her book “Shroud of Jesus of Nazareth” makes a hypothesis that those letters are indeed imprinted by ink residues. She speculates (quite reasonably for me, but I don’t claim she must be right) that those letters were some form of ID card for a corpse, written on reused fragments of papyri, and reflected on the Shroud. Being so faint, currently they are observable only on close ups of negative image. Yannick Clément : This is not imagery techniques that could determine if there is something or not in these spots, it is a proper chemical analysis of some tiny samples of fibers taken in these areas (which could be, of course, backed up by a proper imagery analysis but only as a confirmation tool for the first set of analysis). Actually imagery techniques (that means photografy) had determined that the corpse of crucified man was wrapped in the Shroud. From 1898 to 1973 there was no access to the Shroud, no samples, no chemical analysis. Just the pictures to analyse. To determine whether or not there are letters, we don’t need chemical analysis. Just clear images to identify the letters without subjective interpretation and argues whether one sees the things or not. Determining their nature (how they were formed) is the other thing, of course. Yannick Clément : That’s what I think and, personally, I have great doubts about the presence of such letters on the cloth. But that’s just my feeling of course. So let’s dispel the doubts. Give us definite answer: are they there or not. I think it is probable. The letters are too big (circa 1 cm high) and, in some cases (PE Zo, and SB) too clear to be just artifacts or optical illusion..","date":"2013-04-15","mins":"4:10 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30993","author":"o_k","post":"To answer to all your doubts and concerns: 1. Marion writes in his book (co authored with Courage), that they had only images of the front face of the Man of the Shroud. 2. They were asked to verify previous claims of Marastoni, Ugolotti and others, about inscriptions around the face. 3. They used certain criteria to eliminate pareidolia effects. For example, the letters must have been at least 1 cm large (which eliminated alleged Hebrew letters, and coin inscriptions, which are smaller), they must be present in groups of at least two, similar size, similar intervals between them, positioned in straight lines, and so on. So the probability that they are photographic artifacts, wevae imperfections or similar effects is small. 4. Marion and Courage devoted more than 20 pages for descriptions of technicalities and their methods of numerical processing. In the article, adressed to his colleagues , Marion didn’t have to explain in detail his methods, just the results. 5. Barbara Frale claims that the inscriptions were written on strips of papyri, sticked to the head with primitive glue, made from flour and water What I would like is if someone tries to reproduce Marion’s results, using much better computer devices and software, and utilizing Haltadefinizione images. To confirm, or disprove previous claims. To show whether there are those letters and/or coins, flowers etc. (so everyone can “see” them, just like they see the body image, and not just “think they see”) , or to prove that they are just pareidollia. That’s all. It doesn’t need chemical analysis to do so. One doesn’t have to wait 20, or 50 years, until they allow to re examin the Shroud to check whether there is an ink or not, in the places where purported letters are expected to be. I think some don’t see the wood for trees. BTW: I’m from Poland and I have both Marion Courage, and Barbara Frale’s books edited in Polish. Have they ever been edited in English? Did anyone had opporunity to read them?.","date":"2013-04-16","mins":"5:30 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30904","author":"o_k","post":"BTW: link to the abstract of Marion article: http://opticalengineering.spiedigitallibrary.org/article.aspx?articleid=1075454.","date":"2013-04-15","mins":"3:20 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-31090","author":"o_k","post":"Latendre : But if you see some inscriptions on the Shroud, how do we determine that it was intentional or related to a real object? You cannot eliminate these faint images as pareidolia unless you have the author of these images telling you so. The face on Mars, what was its probability to occur over a sample of images? I do not think it was close to zero, say, below 10^ 6. For example, DNA matching, it has to be very close to zero, such as 10^ 20, to be considered non accidental. There is a clear model to evaluate these probabilities (it has a simple model that works very well). This is what the probability has to be to be considered a non accidental image: pretty close to zero. You need a model to come to such an evaluation. We have no such model and it does not look simple to create such a model. Yes, but even if you have a model, you need some criteria. How low probability that those images are created randomly do you accept? 10^ 6, 10^ 10? Or lower? It is hard to say how much improbable must be the results, to exclude the possibility of pareidolia. Going into absurd, one may say that the whole body image on the Shroud may be pareidolia. Optical illusion. If one sees the clear structure of letters, say “OF NAZARETH” or “SHROUD”, does he/she have to calculate the probability that the inscription he/she sees has formed in result of random process? And check whether it is below stated significance level? Not everything may be calculated. The main question is: could someone re verify Marion, Filas and others results using the latest HD images, and modern hardware, software and more advanced methods? To check whether those old claims may be refuted, or are still valid, or even increase the chances of them to be actual objects..","date":"2013-04-17","mins":"2:33 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30850","author":"o_k","post":"Mario Latendresse : 2) The Shroud 2.0 app image resolution does not offer that high resolution of 20 µm per pixel, it offers a lower one. The app highest resolution offers an image of about 13300 pixels wide over the width of the Shroud. This is about 12 pixels per mm. This is about 4 times less resolution that the scanned image of 2008. That is, Haltadefinizione could offer images of the Shroud with at least 4 times more resolution than the Shroud 2.0 app is offering at the highest resolution. 3) Having said that, the Shroud 2.0 app offers a very high definition image of the Shroud and an app of very good quality. But could it be enough to identify (after digital processing to remove noise, weave and improve contrast) letters found by Marion in the 90s (about 1 cm high), and coin images claimed by Filas and others (circa 1 mm in size)?.","date":"2013-04-15","mins":"5:22 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"}]
