[{"id":"comment-73922","author":"o_k","post":"I wish to congratule Hugh Farey great job as a new editor of BSTS Newsletter. Good job, Hugh! There is only a minor problem with article “The Mystery of the invisible patch” http://www.shroud.com/pdfs/n78part9.pdf On page 4 (31) , where you write “The exact configuration is not known, but this diagram illustrates a possible one:”, there is a lack of this diagram below. Is it possible to fix it, or can you show us this diagram?.","date":"2014-01-21","mins":"9:36 am","url":"https://shroudstory.com/2014/01/21/18th-anniversary-for-shroud-com/","cat":"news_&_views","title":"18th Anniversary for shroud.com"},{"id":"comment-47288","author":"o_k","post":"Yes, but one question remains, being folded it is 80×45 cm or 39×22 cm (approximately)?.","date":"2013-10-12","mins":"4:43 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47569","author":"o_k","post":"Max, the problem is we still need two more cloths… In Constantinople, there were at least 3 cloth, the current TS, and two others. Conrad von Krosigk (or Kroigk) took back to Halberstadt from the 4th Crusade parts “de sindone eiusdem et de sudario”, while Nivelon de Cherisy to Soissons part “de sindone munda”. Robert de Clari took to Corbie parts “de sudario Domini in duobus locis”. And last, but not least, french king Louis IX bought from the A Ltin Emperor Baldwin II 25×35 cm part of burial linens, which were distinct from TS, see http://www.shroud.com/pdfs/n56part5.pdf According to Kersten&Gruber, part of the sudario was made from cotton, while part of Louis IX linens currently stored in Toledo is made of linen..","date":"2013-10-15","mins":"10:58 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47356","author":"o_k","post":"Because today it is anachronistic, but in fact it is worth studying because in every legend is a grain of truth! See:http://en.wikipedia.org/wiki/Acheiropoietos Monastery.","date":"2013-10-13","mins":"7:55 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47577","author":"o_k","post":"I know Kersten&Gruber duo, and their conspiracy theories. However, the historical part of their book tracing the Shroud from Palestine to Turin (they NEED it for their absurd claims) is quite good and reliable..","date":"2013-10-15","mins":"12:45 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47579","author":"o_k","post":"Not only, in case of Halberstadt they checked themselves. And it is the only source I know which mentions what is actually stored in Halberstadt..","date":"2013-10-15","mins":"1:14 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-46984","author":"o_k","post":"Daveb of wellington nz : O.K.: You are therefore saying that the author (final readactionists) of John’s gospel did not understand the Greek terms ‘sudarion’ and ‘othonia’. Yet there must be any number of instances where these terms were also used in other ancient Greek texts. The translations given in the Perseus lexicon, are presumably based or at least influenced, by such ancient usages. No Dave, the author of John’s gospel knew what he understood by the terms ‘sudarion’ and ‘othonia’ but unfortunately we don’t know what exactly he had on mind. The ‘sudarion’ can be either large shroud or small napkin. It is traditionally translated as napkin, because it was used in this meaning in some other places in the Bible. However, this choice does reflect only the views of modern translators, not neccesarly that of Saint John..","date":"2013-10-11","mins":"6:08 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-46905","author":"o_k","post":"I think the exact meaning of ‘soudarion’, and ‘othonia’ in the Gospel of John will never be known. Just want to remind that ‘soudarion’ which was placed upon the head that Arculf saw in Jerusalem around 670 AD had eight feet of lenght. Or… eight cubits according to some manuscripts. I am currently making an article, list of all burial cloths of Jesus venerated through ages in all parts of the world. And I can say with great probability what burial clothes were kept in Constantinople untill 1204. Not only the current Shroud of Turin, but also several others, and I can make a good guess about their dimensions and role during Jesus’ buneral..","date":"2013-10-10","mins":"3:51 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-46986","author":"o_k","post":"Angel : O.K. I read somewhere years ago there were five pieces of cloth associated with the crucifixion of Jesus. Don’t know if this is correct, but I interpret the statement to include the following: 1. Muslin garment Jesus wore every day. 2. Cloak that was associated with the casting of lots by the Romans. 3. Shroud 4. Head Napkin (Sudarium) 5. Strip of linen that held the head napkin in place and was tied at the neck OR the loin cloth. What are your thoughts? Angel The list is much longer. There were perhaps several other pieces of linen used during the burial, perhaps even the second shroud. I could give you a long list of relics venerated at various parts of the world, however I still write an article about it. However, look at those links: 1. Joan Carroll Cruz, “Relics” (this is the book from 1984, and fortunately almost entire first chapter is available at Google books): http://books.google.pl/books?id=2 Nut W Xete Ng C&printsec=frontcover&hl=pl#v=onepage&q&f=false 2. A hypothesis by Gino Zaninotti, suggested at the times when Sudarium of Oviedo an Manopello Veil were almost unknown were almost unknown: 3. A hypothesis by Balndina Paschalis Schloemer: http://www.sudariumchristi.com/uk/tomb/byssus.htm (see also at the site of Juliusz Maszloch, where are several pictures of those cloths: http://manoppello.eu/eng/index.php?go=sudarium The alleged giant 6.50×3.50 m size of Kornelimünster shroud was probably due to the wrong conversion of the units, feet were probably mistaken for ells) 4. Some of the interesting notes about the relics of Kornelimünster and Aachen can be found in Grzegorz Gorny & Janusz Rosikon book “Witnesses to Mystery” which soon will be available in English: http://www.amazon.com/gp/product/158617844 X/ref=s9 simh gw p14 d0 i1?pf rd m=ATVPDKIKX0 DER&pf rd s=center 2&pf rd r=14 J64 JMBS7 BKNA7 ZDK5 A&pf rd t=101&pf rd p=1389517282&pf rd i=507846.","date":"2013-10-11","mins":"6:32 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47182","author":"o_k","post":"Max Patrick Hamon : Reminder for O.K.: In 799 CE, a monk arrived at Aix/Aachen sent by Patriarch George of Jerusalem, Max, I know this. Just I am not convinced about Sindon Munda and Shroud of Compiegne were two halves of the same cloth. And the mention that Kornelimünster’s Sudarium Domini was originally 6.50×3.50 m (while today it is 39×22 cm) seems odd to me. Whether the Charlemagne relics came from Jerusalem or Constantinople has actually little meaning, as most of the relics from Jerusalem eventually landed at Constantinople. Remember, Charlemagen had to marry empress Irene in 802 AD, which eventually didn’t happen. However Riant, Exuviae 216f: “Hoc est sanctuarium quod in capella imperiali Constantinopolim ad presens continetur:. . . Item pars linteaminum quibus crucifixum Christi corpus meruit involvere iam dictus Arimatensis Ioseph, in supradicta imperiali capella continetur. Syndon enim, pars quoque Corone Christi, ex Karoli Calvi dono, habetur Carropoli Gallie. Item Manutergium regi Abgaro a Domino, per Thadeum apostolum, Edesse missum, in quo ab ipso Domino sua ipsius transfigurata est ymago.” suggests the copies of the burial cloths were sent from Constantinople..","date":"2013-10-12","mins":"5:55 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47002","author":"o_k","post":"Max I did some calculations. The alleged original size of Kornelimünster sudarium (part of Charlemagne collection) was about 650×350 cm. The Shroud of Compiegne (also part of Charlemagne collection, destroyed during French revolution, or according to a different version during washing in 1840) had size of about 237×125 cm 650/350=1.857 ~15/8=7.5/4 =1.875 237/125=1.896 ~15/8=7.5/4 =1.875 Further: Kornelimünster 650 cm/7.5 =86.66666667 cm 350 cm /4=87.5 cm Compiegne: 237 cm/7.5=31.6 cm 125 cm/4 =31.25 cm – this is foot measure. The approximately 87.5 cm could be ell measure. So most probably Shroud of Compiegne was confused with Kornelimünster sudarium (which is only 39×22 cm), and units of measure were confused. The size of the Shroud of Compiegne corrsponds with the size of the shroud (or sudarium) that Arculf saw in Jerusalem in 670 AD. However I believe that neither Shroud of Compiegne nor Kornelimünster sudarium were original burial cloths they were simply copies of the cloths stored in Constantinople around 800 AD..","date":"2013-10-11","mins":"7:58 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47209","author":"o_k","post":"Max, I don’t ignore the further history of the cloths (after 814 AD), but it has rather little meaning here. Much more important is what the Charlemagne’s collection of burial cloths actually were, and where they came from. ““Just I am not convinced about Sindon Munda and Shroud of Compiegne were two halves of the same cloth.” On which historical and factual ground? ” Gorny&Rosikon (pg. 298) write that Sindon Munda (stored in Kornilmünster) allegedly was to be used to transfer the body from the cross to the tomb. Beside its size is 180×105 cm, while the Compiegne shroud was, according to Hesemann 237×125 cm (other sources claim it to be 245 cm long), so the widths don’t fit, (unless data for Compiegne are wrong). “4/How long will you ignore the veil mesasuring 3,50x6m, proceeding from Antiocha in Syria is made of byssum fabric, is 16 TIMES FOLDED UP ONTO ITSELF and preserved in a gauze like protective fabric and tghus reduced to the size of a napkin? ” Max, do you have any sources for that? Gorny&Rosikon mention only that it measures 39×22 cm. Pierluigi Baima Bollone in his “Sindone, 101 domande e risposte” claims its original size was 615×352 cm, but today it measures only 39×22 cm, so I assumed it was either cut from the larger cloth, or its measures are wrong. And I think using 6×3.5 m cloth during burial is quite impracical. Max do you have primary documents for Charlemagne’s relics? Becuase I am not sure how much reliable the original tradition about them is. Due to complicated political relations around 800 AD Charlemagne could obtain his collection of relics from Jerusalem, as well as from Constantinople, and some perhaps via Rome. Charlemagne possesed several relics, or rather “representative relics” or “brandea” (that means copies): 1). Shroud of Compiegne, currently destroyed 2). Sindon Munda, currently stored in Kornelimünster 3). Sudarium Domini, currently stored in Kornelimünster 4). Linteum Domini, the towel used to dry the Apostles’ feet, currently stored in Kornelimünster. What’s interesting, another towel was among the Constantinople’s relics sent by Latin Emperor Baldwin II to king Louis IX, see https://shroudstory.com/page/5/ So the other cloths were probably copies of those stored in Constantinople (or in Jerusalem, and later transferred to Constantinople). Besides those, Charlemagne possesed also: 5.) The Holy Tunic of Argenteuil 6.) The nail 7.) Eight thorns from the Crown of Thorns. 8.) Jesus’ loincloth, currently stored in Aachen and terribly bloodied. And several others..","date":"2013-10-12","mins":"9:37 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47185","author":"o_k","post":"Daveb of wellingon nz : I don’t see that this argument holds water. Either the writer of John’s gospel knew Greek or he didn’t. The fact that he chose that language to write in, suggests that he was confident in it. The scriptures are not the only writings written in Greek, there are any number of Greek classics. So there must be any number of examples where the words ‘othonia’ and ‘soudarion’ are used. We have ‘towels’ in locker rooms, and princes wear ‘fine linen’. The lexicons are presumably based on a lot more than what a few writers of a minor Jewish sect set down in 1st century Palestine! It is not the problem with the dictionaries. The problem is that some words can have multiple meanings like in the case of ‘sudarion’ and ‘othonia’. Just like the words ‘cloth’ and ‘linen’ can have multiple meanings in English. ‘Sudarion’ can mean either small or large cloth. The problem is what to choose. And translators usually chose to translate it as ‘napkin’, based on other places in the Bible where it is used in that meaning so they think in this case it is also, but this is not certain. However, the Shroud o f Turin is also refered as ‘Sudario’ on some of the older paintings of it..","date":"2013-10-12","mins":"6:08 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47212","author":"o_k","post":"Correction:for the towel used to dry the Apostles’ feet https://shroudstory.com/2013/09/29/blood from a picture of christ links to the shroud/ However: 22cm x16 =352 cm, it works. In other direction: 615 cm/16 =38.43 cm, it also works quite well. Does it mean the Sudarium Domini is folded 16×16 =256 times?.","date":"2013-10-12","mins":"9:47 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47215","author":"o_k","post":"Max, or anyone, do you have Remi Van Haelst’s paper ‘The Shroud of Kornelimunster” from The 1998 Turin Symposium? I would like to check some info in it..","date":"2013-10-12","mins":"10:15 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47221","author":"o_k","post":"Is it this, presented on this site? http://resurrectionnowinc.blogspot.com/2011/01/shroud images throughout world.html.","date":"2013-10-12","mins":"10:40 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47263","author":"o_k","post":"Max, I wish to thank you for drawing my attention to some aspects, so I could find very interesting Remi van Haelst’s article. And now please refrain from malice. Max Patrick Hamon : Gorny & Rosikon should have done their homework regarding the Sindon Munda and Sudarium Domini too. Who are those guys? Journalists, so they may be inaccurate (and sometimes they are). Max Patrick Hamon : O.K., “And I think using 6×3.5 m cloth during burial is quite impracical.” Oh really? Have you ever made any attempt to reconstruct Yeshua’s burial? BTW 5 6 persons are needed. What do you know exactly about Judean/Jewish burial? Have you never heard of what a sovev (Heb.) or soudara (Aram.) is? Yes, I know. The problem is that there was a dust layer at the backside of the TS, so it had been probably in contact with the surface of the tomb, which wouldn’t have been a case, had giant Sudarium Domini enveloped the whole TS. Max Patrick Hamon : Do you really think a 3.50x6m towel was really needed to dry the Apostles’ feet? Are you serious? I never claimed that. I was checking the Sudarium Domini dimensions if it was really folded 16 times in each direction. There are some strange things in Remi van Haelst’s article. For example he claims: (about Sindon Munda): “We see a number of “crux commissa (+)”, “crux decussata (x), eight rayed stars, resembling a Maltese cross. This stars may be assumed to be related with some ancient cult of a Divinity or the Sun veneration. Further a number of groups of FOUR white horses and twisted snakes. This representation points in the direction of the ancient cult of “Mithras, the snake killer”. This cult was, in the era of Christ, very popular among the Romans military, in Minor Asia. Returning home, they took the cult with them.” Looking at the pictures of it (http://www.manoppello.eu/index.php?go=sudarium and in Gorny&Rosikon) I don’t see any such features. (about Sudarium Domini) “Today the immensly large SUDARIUM, folded 64 times, has the shape of a rectangle of about 80 x 45 cm. In spite of the 64 layers, the red backing cloth remains visible !” Judging from the pictures and other descriptions, it is much smaller, 39×22 cm..","date":"2013-10-12","mins":"3:28 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47270","author":"o_k","post":"I base on Riggi’s analyisis from 1978, described by Wilson in his “The Blood and the Shroud” (in chapter 8). Besides, your mention “16 TIMES FOLDED that is folded in 16 layers.” is arithmetically wrong, as the surface of 39×22 cm cloth is 256 times smaller than 615×352 cm cloth. Remi Van Haelst claims it is 80×45 cm and folded in 64 layers..","date":"2013-10-12","mins":"3:48 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47271","author":"o_k","post":"If it had been so, then (237+180)cm x105 cm=417×105 cm, almost the size of the TS (however if we take 245 +180 it is 425 cm). Max, are you aware what consequences for reconstruction of the TS history it can have?.","date":"2013-10-12","mins":"3:56 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47287","author":"o_k","post":"Thanks Max, I thought first about its connection with the Arculf’s Shroud, which according to some manuscripts, was not 8 feet, but 8 cubits long. Now I have to rewrite some parts of my article..","date":"2013-10-12","mins":"4:41 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47358","author":"o_k","post":"Max: Still something doesn’t fit here. Riant, Exuviae 216f: “Hoc est sanctuarium quod in capella imperiali Constantinopolim ad presens continetur:. . . Item pars linteaminum quibus crucifixum Christi corpus meruit involvere iam dictus Arimatensis Ioseph, in supradicta imperiali capella continetur. SYNDON ENIM, PARS QUOQUE CORONE CHRISTI, EX KAROLI CALVI DONO, HABETUR CARROPOLI GALLIE (emphasis mine). Item Manutergium regi Abgaro a Domino, per Thadeum apostolum, Edesse missum, in quo ab ipso Domino sua ipsius transfigurata est ymago.” (quoted by Scavone: http://shroudstory.wordpress.com/about/acheiropoietos jesus images in constantinople the documentary evidence/ footnote 34. The list is dated to about 1190). So the Sindon Munda came from Jerusalem, Edessa via Harun al Rashid, or from Constantinople? I am still not convinced that the Arculf’s sudarium is the same as Kornelimunster’s Sudarium Domini. I found some interesting article: http://www.copticchurchreview.com/Coptic/Home files/2003%20 Winter.Vol24.%234.pdf Page 111: “According to the report of the 7th century Coptic bishop John of Nikiou the monks of the Metanoia Monastery at Kánobos used to venerate several famous relics of Christ. In addition to a part of the venerable Cross of Christ, they also possessed the napkin, the sacred mandylion with the imprint of the holy face and the towel with which Jesus had girded himself when he washed the feet of his disciples.” Sacred Mandylion that Antoninus of Piacenza saw in Memphis in 570 fine. The towel fine. But what is a napkin? Could it be a Sudarium Domini?.","date":"2013-10-13","mins":"8:30 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47275","author":"o_k","post":"Max: “This a typo I corrected see above” But 80×45 cm is 8×8, not 16×4.","date":"2013-10-12","mins":"4:01 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47361","author":"o_k","post":"In the text here: http://www.tertullian.org/fathers/nikiu2 chronicle.htm there is a mention of the towel and the mandil, but not of the napkin..","date":"2013-10-13","mins":"8:50 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-192354","author":"o_k","post":"There is one minor sentence I disagree: biblical scholarship is predominantly Protestant ??? Candida Moss, one of the “experts” in the recent CNN show is catholic for example http://en.wikipedia.org/wiki/Candida Moss But except for that the post is good: To my knowledge, that is where things stand with most Jesus researchers. They don’t know what to do with the Shroud. And so they do nothing. After all, the Shroud is not a “text” and does not enter the historical record until the fourteenth century. Moreover, Shroud science, or “Sindonology,” requires professional expertise in numerous scientific disciplines, none of which biblical scholars are qualified to adjudicate. I sign both hands below that..","date":"2015-03-04","mins":"3:41 am","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","title":"After CNN"},{"id":"comment-95921","author":"o_k","post":"It is nothing new, we all have known this for a long time. What bothers me is this: Final paragraph: Whoever made the Shroud must have been a skilled forger to create the correct blood spatter for a crucifixion. The alternative is that they made the right pattern by chance. “It could be that the artist just decided to draw the rivulets of blood parallel to the arms for artistic reasons,” says Borrini. Why do they have automatically assume that Shroud is a fake?.","date":"2014-04-02","mins":"4:22 pm","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?"},{"id":"comment-39844","author":"o_k","post":"Quote from Fulbright paper: “Another important example is the girdle (or sash) of Rameses III, who reigned during the middle of the twelfth century B.C.E. It is characterized by an intricate design and excellent workmanship. It is woven in five colors, in a design consisting of 3:1 herringbone twill, alternating with 4:1 and 5:1 herringbone twills. This sash is 17 feet in length and tapers in width from 5 inches down to a little less than 2 inches [28].” Reference[28]:”A. Braulik,Altägyptische Gewebe, A. Bergstrasser, Stuttgart, p. 8 with fig.2 (1900). Braulik describes several other examples of ancient Egyptian textiles woven in various herringbone patterns. This girdle is also described in T. D. Lee, “The Linen Girdle of Rameses III,” in Annals of Archaeology and Anthropology of the Liverpool Institute of Archaeology, Vol. V, pp. 84 96 (1912). More readily accessible is Fr. E. Wuenschel’s discussion of several very ancient herringbone twills in “The Truth About the Holy Shroud,”American Ecclesiastical Review, pp. 10 f., (1953), heavily dependent on Braulik. Tyrer,op. Cit., p. 21, describes the Rameses girdle as “a plain lift weave,” unlike descriptions by Braulik, Lee and Wuenschel. Possibly the alternating herringbone weaves comprised a decorative edging.”.","date":"2013-07-27","mins":"7:26 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-47281","author":"o_k","post":"Wha really interests me now is: 1) whether http://resurrectionnowinc.blogspot.com/2011/01/shroud images throughout world.html has the original Remi van Haelst’s article from the 1998 Turin Symposium 2.) What is the size of Kornelimunster’s Sudarium Domini? 3.) From 1) “We see a number of “crux commissa (+)”, “crux decussata (x), eight rayed stars, resembling a Maltese cross. This stars may be assumed to be related with some ancient cult of a Divinity or the Sun veneration. Further a number of groups of FOUR white horses and twisted snakes. This representation points in the direction of the ancient cult of “Mithras, the snake killer”. This cult was, in the era of Christ, very popular among the Romans military, in Minor Asia. Returning home, they took the cult with them.” I can’t see them on the picture http://www.manoppello.eu/sudarium/kornelimunster sudarium.jpg Had the claim above (about links to Mithraism) been right, this Sindon Munda has nothing to do with Jesus’ burial. 4.) Whether Shroud of Compiegne and Sindon Munda from Kornelimünster were two parts of the same cloth, 417×105 cm, which is very close to the dimensions of TS..","date":"2013-10-12","mins":"4:24 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-159904","author":"o_k","post":"The presence of a few strange fibers, in itself, has no significant effect on C14 dating. The important point is however, that they may indicate that the sample had been manipulated in the past..","date":"2014-10-06","mins":"3:30 pm","url":"https://shroudstory.com/2014/10/06/black-thread/","cat":"news_&_views","title":"Black Thread"},{"id":"comment-50555","author":"o_k","post":"Kevin Moran, Observations by Microscopy of the Sticky Tape Samples Taken from the Shroud by Dr. Max Frei in 1978, British Society for the Turin Shroud Newsletter No 41 http://www.shroud.com/pdfs/n41part3.pdf , Optically Terminated Image Pixels Observed on Frei 1978 Samples http://www.shroud.com/pdfs/moran.pdf There is no doubt that Frei tapes had been in contact with the Shroud. The large number of pollens compared to only a single speciman found on STURP tapes can be easily explained by the fact that STURP tapes had regulated minimal presuure (in order not to leave traces of glue on fabric), while Frei used ordinary tapes and much greater pressure. The STURP members (including Schwortz, read his interview with Górny) are envious about this up to this day. The other fact are insinuations without evidence, spread by Nickell, Schafersmann and some other scoundrels after Frei’s death utilizing the fact that dead cannot argue..","date":"2013-11-09","mins":"10:27 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50773","author":"o_k","post":"So what about Baima Bollone, whose team is NEVER mentioned by the sceptics? He had much greater material at his disposal, the whole threads, not only tapes. And he also confirmed presence of the real, human blood. So we have two independent teams that concluded the “bloodstains” are real blood. If we count Garza Valdes and Tryon, who examined the material taken illegally in 1988 we have three teams confirming real blood on the Shroud. Blood vs Pigment: 3:0.","date":"2013-11-11","mins":"10:44 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-192437","author":"o_k","post":"He is correct, however, that a majority of biblical scholars come from a Protestant background. Maybe in the US, where protestants are still majority. Globally, situation is probably different. I haven’t checked any statistics but I hardly believe that there are fewer Catholic biblical scholars (anyway Catholic Church is still the greatest one) than Protestant biblical scholars in the world..","date":"2015-03-04","mins":"5:33 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","title":"After CNN"},{"id":"comment-50560","author":"o_k","post":"Anoxie : I mean the first round (C 14 dating) should be closed before thinking of the next one. There is a serious suspicion concerning the sampling. Though, for 25 years, no physical or chemical analysis has been done on the radiocarbon sample retained by the University of Arizona ? They had been, but they were performed by Arizona nad self serving. Http://digitalcommons.library.arizona.edu/objectviewer?o=http%3 A%2 F%2 Fradiocarbon.library.arizona.edu%2 F Volume52%2 F Number4%2 F33737617 d6e4 4797 ba23 fb8e0f303abe For me it is quite probable that the sample preserved by Arizona is actually part of the original Shroud, but which was not dated, so 1260 1390 does not apply here!.","date":"2013-11-09","mins":"11:36 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50753","author":"o_k","post":"And what about Baima Bollone and his team? They also discovered blood independently of Heller & Adler, but for sceptics like Nickell, Schafersman, Collin and Charles the don’t even exist!.","date":"2013-11-11","mins":"8:13 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-192665","author":"o_k","post":"Https://shroudofturin.files.wordpress.com/2014/10/image4.png?w=244&h=337 http: //shroudofturin.files.wordpress.com/2014/10/image4.png?w=244&h=337 (In the latter link I put a space after http: ).","date":"2015-03-06","mins":"6:06 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192228","author":"o_k","post":"Thibault. Have you received the sketch of my paper via Dan?.","date":"2015-03-02","mins":"3:54 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192660","author":"o_k","post":"Simply put a direct link to it, Thibault..","date":"2015-03-06","mins":"5:52 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192666","author":"o_k","post":"Maybe try again. Sometimes it works, sometimes not: http: //shroudofturin.files.wordpress.com/2015/01/image23.png (In the latter link I put a space after http: ).","date":"2015-03-06","mins":"6:08 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-214745","author":"o_k","post":"Jackson’s hypothesis starts with an invalid inference (inference 3 in his paper at https://shroud.com/pdfs/ssi34part3.pdf). He assumes that the cloth MUST have been in two different configuration. This is completely false and easily demonstrated to be false. More on this at http://www.sindonology.org/reviews/review Jackson90.shtml. Common sense has left some Shroud researchers. Agreed Mario. I wholly agree with what you said including the last sentence. I demonstrated that forcefully flattened Shroud hypothesis is untenable in my recent paper about 3 D (especially Part 3). Https://shroudstory.com/2015/10/02/the definitive word on 3d from ok/.","date":"2015-11-17","mins":"1:58 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-192724","author":"o_k","post":"Thibault: Below that word, I tried to copy and paste an image..And failed. Thus my following posts (how to put an image in a comment ?). I’ll try tomorrow. Please send an image you want to post to me. I’ll make a try..","date":"2015-03-07","mins":"4:24 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-110019","author":"o_k","post":"Louis, wait until you watch my response, I posted to Dan….","date":"2014-05-03","mins":"3:24 pm","url":"https://shroudstory.com/2014/05/03/dont-tell-barbara-frale/","cat":"news_&_views","title":"Don’t tell Barbara Frale"},{"id":"comment-194508","author":"o_k","post":"Hugh: What I do is to adjust one picture (without changing the aspect) so that the level of the eyes and the level of the mouth match, as I have in my picture above. When that is done almost any picture of anybody blends quite well, including Prince William. Therefore you have only a single distance. Thus any picture will match as you have complete freedom in adjusting the scale. Hugh: 5) There is also a claim (at 1:35) that the Manopello image must have been laid against the Shroud image for the match to be so perfect. However resizing photographs to fit each other does not support any such claim. To do that you would have to produce actual measurements of similar features of the two images, which has not been done, either here or, I believe, anywhere else. Dave Hines: GOAL: Determine exact length of the skull of Man In the Shroud, next overlay will be based on the points you map out. Hugh: No, David. I do not believe that any objective skull length can be established for the Shroud image. My guess could be no better than yours, and neither need be accurate. Far better to use the level of the eyes and the level of the mouth, as I did above. This actually has been done. See my post from March 25, 2015 at 1:32 pm: You have absolute scale thre, based on data from Shroud Scope, and Sister Blandina Paschalis Schloemer atlas of overlays for Shroud/Manoppello/Oviedo. According to Sister’s measurements (pg. 28 29) the distance on Manoppello from tip of the nose to the tuft of the hair is 134 mm, while distance on the Shroud between two folds is 237 mm. My own measurements with Shroud Scope give about 227 mm. The difference is about 4 5 %. The whole Manoppello dimensions are circa 24×17.5 cm. The Shroud’s are circa 442×113 cm. The size of both cloths is known within a few %. So given uncertainites of callibration, and the fact that the fabrics might have changed their size a couple % through the centuries, we can say that both faces on Shroud and Manoppello have exactly the same size, with a max 5 % +/ margin of error..","date":"2015-03-26","mins":"4:52 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194387","author":"o_k","post":"See Hugh this: Here you have a callibration of Shroud and Manoppello. Contrary to Depp face, they are truly 1:1 overlayings. It is not only the proportions, real life size of the Shroud face corresponds exactly with the real life size of Manoppello Face. More You have several similar wounds, blood marks, and other tiny details. Here, on the old chart you have a dozen of them, but actually there is likely to be many more there. Here you have Shroud and Manoppello marked and overlayed. As you can see the correspondence is really significant. No Hugh. Shroud and Manoppello are not the same level as Shroud and Depp, or Prince William..","date":"2015-03-25","mins":"1:32 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194414","author":"o_k","post":"Anyways, how do you upload a photo on this site? There is no place to attach a file, how are you getting a photo uploaded on here Upload your picture on Imgur http://imgur.com/ and place a direct link in your comment..","date":"2015-03-25","mins":"5:59 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194675","author":"o_k","post":"Hello Dave. All my callibrations you have in my post above from March 25, 2015 at 1:32 pm. They are partially based on Shroud Scope, and partially on callibration by Sister Blandina in her book pg. 28 29. According to sister the distance between precisely two points marked (two ends of green arrow) is 237 mm. My Shroud Scope mesurements give 227 mm instead. Still according to Sister, the distance between tip of the nose and top of the hair strand on Manoppello is 134 mm. This fairly precise correspond with the dimensions of Manoppello image (24×17.5 cm). Remember that absolutely accurate callibration is impossible. There is always an uncertainity, but no higer than 1 2 %. The overlays are based on Sister Blandina values of 237 and 134 mm. However, I discovered that scaling down Shroud image to about 0.97 factor (which is equivalnet of about 230 mm) gives better results..","date":"2015-03-28","mins":"4:52 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-214062","author":"o_k","post":"Hello Barrie. Thank you for your update to the shroud.com, and inclusion of my humble presentation about 3 D effect. I have a one, very minor issue: You wrote in the entry ” (Holy Tunic of Argenteuil To Be Displayed in 2016) http://shroud.com/latebrak.htm#tunic ) : Although not directly related to the Shroud of Turin. Actually, several comparisons between bloodstains on the Tunic and the dorsal image on the Shroud have been performed, one back in 1930s, and more recently by late Andre Marion in 1997. Here you have two scans from Marion & Lucotte book “Le linceul de Turin et la tunique d’Argenteuil” (which provides excellent overview of the scientific reasearch of the Tunic):They claim there is a match. If so, then we should say that the Tunic is directly related to the Shroud and very important material evidence..","date":"2015-11-01","mins":"1:42 pm","url":"https://shroudstory.com/2015/11/01/fall-update-to-shroud-com/","cat":"other_sites","title":"Fall Update to shroud.com"},{"id":"comment-214083","author":"o_k","post":"Here are the Google Books fragments of Polish edition of that book (I have a paper version, which is my primary source of information about the Tunic): http://tinyurl.com/ow3jjw8 Or you can ask our French speaking friends. There is also a chapter in Grzegorz Górny’s “Witnesses to mystery” which summarizes the research: http://tinyurl.com/o5m4ye3.","date":"2015-11-02","mins":"4:36 am","url":"https://shroudstory.com/2015/11/01/fall-update-to-shroud-com/","cat":"other_sites","title":"Fall Update to shroud.com"},{"id":"comment-70838","author":"o_k","post":"Russ Breault : This speaks volumes about Mc Crone’s legendary arrogance. I would trust the science of Adler and Heller long before I would give any credence to Mc Crone. He was wrong on the Vinland Map too. Well, Wikipedia claims he was not so much wrong about Vinland Map, but that doesn’t concern the Shroud at all. Http://en.wikipedia.org/wiki/Vinland map#Analysis of ink Just for everyone’s info. I wouldn’t concern so much his work on Vinland Map, because it is irrelevant to the Shroud, and someone may find this claim inaccurate this would disrupt our efforts on promoting the Shroud..","date":"2014-01-01","mins":"10:24 am","url":"https://shroudstory.com/2013/12/31/favorite-stupid-stupid-science-picture-for-2013/","cat":"science","title":"Favorite Stupid, Stupid Science Picture for 2013"},{"id":"comment-178153","author":"o_k","post":"Hello Giorgio. I have some questions about your questionnaire. First, it seems that one person is able to fill it multiple times. Second, when coming to part two, about Rogers’ Thermochimica Acta paper, there is such question: There are clear evidences that the threads excised for the radio carbon data was representative to the cloth How should we understand that question? Obviously, according to Rogers findings they were non representative to the original Shroud, and thus 1988 carbon dating results are invalid. But this does not mean that they were not excised from the original Shroud of Turin. Simply they were part of rewoven corner area and the same applies to the Raes sample. That explains purported anomalies (starch, Z spun of one thread and so on) there is no need to assume that the samples was swapped or faked by some unidentified forces. As we can see even in mid 80s there were clear suspicions that this corner is non original nevertheless they took a sample for 1988 carbon dating form there. And other thing, Giorgio, that I would like to ask. Is there any chance to obtain Proceedings of the 1977 United States Conference of research on the Shroud of Turin, Albuquerque 1977, Holy Shroud Guild, New York 1977,/I> ?.","date":"2014-12-21","mins":"5:27 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"id":"comment-178181","author":"o_k","post":"Thanks Giorgio..","date":"2014-12-21","mins":"9:04 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"id":"comment-131368","author":"o_k","post":"Hello, Barrie. Perhaps I will have a couple interests to you. The first one is, do you plan to include infor about newly released materials from Oxford, regarding 1988 carbon dating (see https://shroudstory.com/2014/06/07/1988 pictures and details from oxford/ )? They came the same day as the latest update on shroud.com, and they may be highly important. The second one, I will send on an e mail..","date":"2014-06-19","mins":"2:48 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"id":"comment-131383","author":"o_k","post":"Hello O.K.! Yes, I intend to include it in our next update, which will go online as soon as the Archdiocese of Turin activates their reservation system. I just got two e mails from you but there was no message in either. Hello Barriee. On you place I would consider those infor from Oxford as ‘breaking news’, and put it immediately on the site. I had some temporary bugs with e mail. The message should bein 4th or 5th e mail from me..","date":"2014-06-19","mins":"3:15 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"id":"comment-28941","author":"o_k","post":"I don’t know if you haven’t seen this: It’s in Polish, and the author seems to support authenticity of the Shroud and Manoppello Veil. Very impressive..","date":"2013-03-31","mins":"8:40 am","url":"https://shroudstory.com/2013/03/31/he-is-risen-he-is-risen-indeed/","cat":"news_&_views","title":"He is Risen!  He is Risen indeed!"},{"id":"comment-46029","author":"o_k","post":"Max: this is misunderstanding. I never claimed that Wilson developed ANY theory about Duches of Savoy and C14 corner. I just said that Wilson informs us in his 1998 “Blood and the Shroud” that Duchess was performing some repairs in this area in 1868. “Besides this mending, I also take into account a second most likely contaminating factor: RAINWATER mixed either with ASHES or limestone dust.” This is theory developed by André Marion, Gérard Lucotte in “Le linceul de Turin et la tunique d’Argenteuil : Le point sur l’enquête” about carbon dating of the Holy Tunic of Argenteuil. I remind that it was dated to 530 650 AD (Saclay) and 670 880 AD (Archeolabs). However the Tunic was heavilly contaminated as during the French Revolution in 1793 1795 it was buried by abbot Ozet in the parish garden. I did some calculations ( http://ok.apologetyka.info/racjonalista/w potrzasku bredni prawdy i poprawdy na temat poplamionych krwia relikwii pasyjnych,432.htm ) and conluded that this calcium carbonate theory is barely satisfying in respect to the Tunic (however I don’t think it was the only factor), and definetly inadequate to the Shroud..","date":"2013-10-02","mins":"3:19 pm","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-46035","author":"o_k","post":"And remember that in calcium carbonate (Ca CO3) only 12 % of its molar mass is carbon. In case of some lipids it is about 90%. In case of linen it is about 25 %. I don’t know what is percentage of carbon in wool The Holy Tunic of Argenteuil is made of it..","date":"2013-10-02","mins":"5:18 pm","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-46030","author":"o_k","post":"In case of the carbon dating of the Holy Tunic (and Sudarium of Oviedo as well) about 36 % of carbon should come from contaminants. But in the case of the Shroud about 65 75 %..","date":"2013-10-02","mins":"3:21 pm","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-46082","author":"o_k","post":"Max Patrick Hamon : O.K., the contaminants are 50% (according to Pr Evin) and 66% (according to Jackson) NOT 75%! Such a contaminant amount just cannot be explained by a medieval or early sixteenth century invisible mending in se. Sorry, but if the patch was made in 1532 or around this date, the amount of contaminants MUST be 75 % to shift datings from 1st to 13th 14th century. If it was made in 19th century that amount is 65 %. I calculated it personally, besides it is very easy to calculate and every high school graduate who had advanced program of mathematics could easily calculate that. However it is possible that invisible mending to exchange about 75 % of sample mass: all wefts and perhaps a few warps (wefts are ususally thicker than warps). In fact IT IS THE ONLY non conspiracy and non sci fi theory able to explain the shift of dates and the ONLY theory that there are proofs for. Max Patrick Hamon : Besides rainwater as additional or sole contaminant present in the Turin Shroud could be linked to a specific 1st c. CE Judean purifying ritual: living water or rainwater mixed with ashes. This has nothing to do with the theory developed by André Marion, Gérard Lucotte in “Le linceul de Turin et la tunique d’Argenteuil as their theory is only developed for the Argenteuil Tunic. Circa 1st century? Max THIS CHANGES NOTHING in carbon dating!!! Do you understand that ???.","date":"2013-10-03","mins":"3:33 pm","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-46083","author":"o_k","post":"Max see this table: http://depts.washington.edu/qil/datasets/uwten98 14c.txt.","date":"2013-10-03","mins":"3:34 pm","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-46116","author":"o_k","post":"Yes it changes nothing because the contamination comes from the 1st century! Any additional carbon from 1st century is IRRELEVANT in case of C14 dating..","date":"2013-10-04","mins":"5:21 am","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-46120","author":"o_k","post":"Max, look at this thread:https://shroudstory.com/2013/10/03/and then too we have two comments from daveb of wellington/#comments.","date":"2013-10-04","mins":"5:42 am","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-46132","author":"o_k","post":"Max Patrick Hamon : O.K., would you bet your house on it? This is the basics of carbon dating, Max. The Shroud could be purified with ashes, boiled with oil, spread with lard , contaminated in whatever way in the 1st century, and this would change nothing for the carbon dating. Because anyway all the carbon would come from the 1st century. The contamination must be LATER, from 16th 20th century to change the dates. Definetly NOT EARLIER..","date":"2013-10-04","mins":"6:53 am","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-46130","author":"o_k","post":"Max Patrick Hamon : Typo: 1950s Yes Max, but no one except me has understood the Wölfli’s joke with his step mother napkin case. See: http://depts.washington.edu/qil/datasets/uwten98 14c.txt 1945 AD 190 years BP 1675 AD 172 years BP.","date":"2013-10-04","mins":"6:47 am","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-45947","author":"o_k","post":"I have seen worse examples..","date":"2013-09-30","mins":"2:43 pm","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-45953","author":"o_k","post":"Daveb of wellington nz : I recall MPH expressing the opinion some months ago, something along the lines that the reweave was done not in the 12th century as has been sometimes stated, but at some time around the 18th – 19th centuries, by a princess in the House of Savoy. They would certainly have the resources to commission such work. That might explain the shift in dates. But I’m not aware that there is any record of the work being carried out, which seems surprising. It was princess Clothilde of Savoy, in 1868 she was doing some repairs on the Shroud, in the vicinity of future C14 sample. Wilson writes about that in “Blood and the Shroud”..","date":"2013-09-30","mins":"4:13 pm","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-97929","author":"o_k","post":"Thibault: When can we expect a paper of yours, if may I ask? Looking forward to it..","date":"2014-04-09","mins":"4:32 pm","url":"https://shroudstory.com/2014/04/09/i-too-can-be-a-practitioner-of-peudocience/","cat":"news_&_views","title":"I, too, can be a practitioner of p$eudo$cience"},{"id":"comment-43801","author":"o_k","post":"David Goulet : The majority of these, if authentic, are relics. The Manopello is dubious as a relic, more likely a work of art. None stand as enigmatic signs like the Shroud. They do not carry the same mystery — namely the mode of image formation. Not they are not worthy of deeper study and historical appreciation — but they simply do not spark the imagination like the Shroud does. Your call for more patience, however, is well taken. When the time is right, when the technology is ready, when the Church is in the mood — the science will get done. They do not carry the same mystery? The Manoppello, relic or not (I am not a fanatic, and open for any possibility) for example is claimed to have holographic properties, there are several images (with open and closed mouth for example) encoded in this transparent veil. Tunic of Argenteuil it was already determined in 1934 (and once again by Marion in 1997) that the blood marks on the back of the Tunic match with wounds of the Man of the Shroud! The blood of the Tunic has been determined as AB, the same as on the Shroud and Sudarium. What’s more the crystals of urea attached to blood cells were found on the Tunic, indicating that it’s owner, sweated with blood, just like described in Luke! Investigations into purpoted nails, remmants of the cross, 9as weel as Good Thief’s patibulum, still kept in Rome) may give valuable information about methods of Roman crucifixion. And you say that they do not carry the same mystery. I think you are totally wrong! They SHARE the same mystery as the Shroud! Together with it, they are a part of much greater image! The other relics contain many complemtary information, which may be great help in Shroud research! Sadly they are still not appreciated in the Shroud world. The large amount of info they contain is still IGNORED by most of the Shroud research, especially in the English world. Not only because this world doesn’t know about them. It doesn’t want to know about them! And THAT’S A SHAME!.","date":"2013-09-11","mins":"1:40 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43828","author":"o_k","post":"Dear Barrie. It is a pleasure to exchange a few words with you. But Falcinelli’s (who is rather sceptical about Manopello) paper is not the final word about it. There are several others, more pro authenticity papers both on http://www.shroud.com, and on http://www.acheiropoietos.info/proceedings/proceedings.php including new updated studies by Falcinelli: http://www.acheiropoietos.info/proceedings/Falcinelli Manoppello Web.pdf , Jaworski http://www.acheiropoietos.info/proceedings/Jaworski Web.pdf , Pfeiffer: http://www.acheiropoietos.info/proceedings/Pfeiffer Web.pdf and others..","date":"2013-09-11","mins":"5:18 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43813","author":"o_k","post":"David: I’ll have to delve more into the Manoppello (based on your comments). See this page, although created by believer, it is really good: http://manoppello.eu/eng/ You will see what English Shroud world has ommited so far..","date":"2013-09-11","mins":"2:35 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43806","author":"o_k","post":"Yannick Clément : I even think there are many in America and in Europe… Especially those who are agnostics about questions like God or the Resurrection of Jesus. I don’t see any problem to form a team like that and the one who could initiate the project is the Vatican itself via his Pontifical academy for science. And start everything from the begining, forgetting experience of STURP, Italians and any other Shroud resaerchers accumulated over the years. No Yannick. It was the same pretext that was used to move away the STURP from the Shroud in 1988. No Yannick. Agnostics are by no means better choice for Shroud research than catholics. They may be biased as well as the believers. The personal honesty is, I think, independent from religious believes. And one another thing: the preconviction that the nature of the image must be purely natural, is the same BIAS, like preconviction that it must be supernatural. NO DIFFERENCE HERE, contrary to naive vision of Yannick still thinking like 19th century positivists. The problem with Vatican is, I think, not that they don’t want to give the Shroud to the scientists, but they don’t know WHOM should they give it. There are many camps of Shroud researchers, and mad rivalisation, unbelievable envy even among the pro guys effectively DISCOURAGE Vatican from allowing for further examinations. The main question is WHO SHOULD PERFORM FURTHER EXAMINATIONS? Who? Whom give the Shroud to? No matter the choice, there will be always a cry of the others who will not have been given the ‘toy’ to play..","date":"2013-09-11","mins":"2:20 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43830","author":"o_k","post":"Hello Barrie. Congratulations with your excellent website! BTW: I am from Poland, and your Google translated A Message From Your Host into Polish sounds extremely funny ; ) Especially: “jestem Żydówką” (I am Jewish woman ; ).","date":"2013-09-11","mins":"5:22 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43812","author":"o_k","post":"I know who agnostics are. And I would say there are some ‘militant agnostics’ also! There are no unbiased people, believe me.Religious affilation in the Shroud research plays rather minimal role, if any. And I don’t see the reason why should we exclude catholics for example. Agnostics are by no means better than anyone else. However the ideology and philosophy plays important, or even crucial role in Shroud research and interpretating of the results. You believe that the image on the Shroud is purely natural. Some believe that it must be supernatural. Both opinions are on equal footing. But they are both just BELIEVES, and nothing else. Don’t mix science with philosophy, Yannick!.","date":"2013-09-11","mins":"2:32 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43819","author":"o_k","post":"Yannick Clément : The most important thing is this: do they have already developed or publicly defended one or more image formation process (supernatural or not)? If the answer is yes, then such a person should be left out of the project in my opinion… Too much danger of bias. I have the better solution, neutralise the bias with the opposite bias! Create a team from those who believe one thing, and those who believe the opposite thing. And let them cooperate and test their ideas..","date":"2013-09-11","mins":"2:50 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43971","author":"o_k","post":"But that was completely different situation, as there were no data available before Shroud examination in 1978 (which was done not only by the STURP, but by Italian team also, which is often forgotten!).","date":"2013-09-12","mins":"2:35 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43788","author":"o_k","post":"Guys, haven’t you all forget that there is not just the Shroud (and the Sudarium) to examine. There is a plenty of other relics, such as Tunic of Argenteuil, Manopello Image, Holy Cap of Cahors, Seamless Robe of Trier, Holy Nails, Corwn of Thorns in Paris, that still await for proper examination! Many of them have possible connections to the Shroud, and some of them were even widely reported (for example results of research of the Tunic of Argenteuil), but not heard in the Angloshephere. The world doesn’t end on the Shroud. There is a plenty of other discoveries, of which most of the ‘Shroudies’ are not even aware of! The new research is continuously on the way, and stop crying that the Vatican doesn’t allow for new direct examination of the Shroud..","date":"2013-09-11","mins":"12:15 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-52976","author":"o_k","post":"To Hugh: OK. Your measurements are impeccable. Why so many people disagree with them is beyond me. But they do. Who, and why? As you can see, the dorsal image without feet is shorter than ventral, which is fine, but dorsal image with feet included (which add about 20 cm) is longer and that’s also fine. The problem is that those details are often ommitted, and confusion begins then. If the cloth were tied under the knees, then there should be a non image band on both ventral and dorsal images Why? The cloth could be tied from the outer, non image (at least visible to the naked eye) side. The rest of the issues in next post..","date":"2013-11-27","mins":"4:52 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-52977","author":"o_k","post":"Hugh, I would like to explain some certain issues: And all that projection business – of course I understand. All the suggested radiation directions and cloth configurations are attempts to show how “anatomical perfection” would look when it appeared on a cloth. The trouble is, as I said before, that each of these possibilites has its adherents, all of whom think that the others’ versions are completely untenable, and would result in a distorted appearance. […] All of them begin with the assumption that the shroud image is not, in itself, anatomical perfection, but a projection thereof. Trouble is, none of them agree how to achieve it. And actually, that’s completetly normal situation in science! There are rarely single accepted theories usually there are many competing models competing models that try to explain more or less a given phenomenon, say the solid state physics, nuclear physics (there is no single good model of the atomic nucleus!), in astrophysics, and in many other branches of “exact”science, not to say about less exact (economy, sociology, history, archeology, psychology and so on). So such disagreements in case of the Shroud are something that should be expected. There is no final, widely accepted model yet, and the space of possible parameters is very large. But there are several good models, which explain various issues the problem is how to reconcile these models with each other. So some another manipulations with the parameters have to be undertaken, which is very tedious and difficult work (there is no simple indicator that would say we are going in a right direction). Remember, there are more than a dozen parameters! However, even exising models give slightly different, but still relatively satisfactory results. Actually there are probably no serious abnormalities in the image of TSM, at least no beyond some acceptable limits. Only some sceptics, like Nickell, Schafersman and their followers probably smoke some herb, so they see some terrible distortions. If the cloth were tied under the knees, […] there should be considerable lengthening of the upper legs as the cloth passes over the knees. Dependent on the model, there could be either lenghtening or shortening. The next post will be about Piczek and her approach..","date":"2013-11-27","mins":"5:18 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-199302","author":"o_k","post":"Faith dies first society next..","date":"2015-05-16","mins":"5:49 pm","url":"https://shroudstory.com/2015/05/16/christianity-in-sharp-decline-in-the-u-s/","cat":"news_&_views","title":"Christianity in Sharp Decline in the U.S."},{"id":"comment-52984","author":"o_k","post":"Isabel’s Piczek approach and reasons behind it: Hugh, you wrote: Piczek thinks that both the top and bottom of the shroud were horizontal, and the shortness of the legs is due to the foreshortening that comes from projecting the bent legs vertically upwards and downwards. See once again this: and this: Piczek assumes that the body (hovering in the air, but that’s unimportant detail here) was popjected vertcally on the Shroud floating flatly in horizontal position above and below (see model 1. And yellow line on the pictures above). Why she assumes so.?The key is her methodology. Piczek is an artist, a painter. See a picture of her, while she climbs up on the ladder to see live model posing: What does she see staying on the ladder, above the model? This: She sees her model not from the perspective of the Shroud wrapping the body (because it is hard to imagine such perspective, even for the alleged Shroud forger that’s another reason why his existence is doubtful), but from the perspective of someone who sees the body staying above it from the perspective of flat horizontal plate. And while she claims: “The professional arts cannot find any such discrepancies and distortions in the anatomy of the Shroud Man, which cannot be explained experimentally and which would prove it to be a painting.” she assumes that the image was projected on the Shroud exactly in this way, vertically on flat surface. Is it fully precise approach no. This is only the first approximation, but actually this first approximation is good! Some minor corrections may be applied, using more sophisticated tools (models how the Shroud wrapped the body presented by Jackson and others, some computer simulations like performed by Fanti and the one which is being made by Mario Latendresse), but general conclusion seems to be valid, there are no great abnormalities visible in the TS Man..","date":"2013-11-27","mins":"5:45 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-56933","author":"o_k","post":"For the Holy Nails and their comparison with the one that was found in Jehohanan’s ossuary, see Witnesses of Mystery, Chapter 3. They were roughly 16 cm or 6 7 inches long. According to Micheal Hesemann’s study (this is what Górny relies on) the most probable candidates for authentic Holy Nails are those kept in Rome’s Santa Croce in Gerusalemme, and the one kept in Santa Maria della Scala in Siena, which was brought there from Constantinople in 1359. Other sources claim that the third nail, used for feet is kept in Trier since Helena times, with small portion in Toul. Of the nails that St Helena recovered, Constantine is said to have used one in his helmet, and converted another into a bridle for his horse. Only small fragments of the nails were probably used for that purpose. Through centuries, the small portions were removed from the original Holy Nails and distributed around the Europe, sometimes melted or attached to new nails. That’s why there are about 36 Holy Nails around Europe..","date":"2013-12-06","mins":"9:30 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-52915","author":"o_k","post":"Hugh: It is often stated that the dorsal image represents a taller man than the ventral image (which should be the other way round if the back of the cloth was flat on a ledge and the front was draped over a figure. Short ball: Isabel Piczek thinks that the front legs are too short, and attributes this to the fact that they were bent, with the knees well off the group, in which case there should be no image of the back of the legs on the cloth. Unless the cloth was raised and tied with a stripe or another cloth. Rigor mortis, lying on a stone pillow, even floating above the surface of the tomb, all these have been suggested by authenticists to account for what they see as patently inaccurate anatomical details. John’s simple faith in anatomical perfection, in short, doesn’t stand up to scrutiny. No Hugh, you simply do not understand the issue. Floating above the surface of the tomb has nothing to do with anatomical perfection, it is just a simple model of flat projection, assumed by Piczek. Which is one of many suggested models see this and this The different model you assume, the different results you obtain. And in fact the anatomical perfection hides in those ‘patently inaccurate anatomical details’, (slight distortions) suggested by those models..","date":"2013-11-27","mins":"7:03 am","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-56981","author":"o_k","post":"And what of it? From Jehohanan’s ossuary wee know the kind of nail that was used for crucifixions. Not too small, and not too large. Now one must find idea how to safely remove the nails from the body, and take the corpse down. We don’t know the exact way it was performed, but it was somehow. There were some suggestions, as far I remember that they sawn off the Jehohanan’s legs, as the nail was stuck in the wood..","date":"2013-12-06","mins":"6:07 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-57094","author":"o_k","post":"Was the stipes stuck permanently in the ground (concreted, perhaps), or slotted into a hole, so that the whole cross could be laid flat for easy assembly and disassembly? Slotted into a hole a stone ring (11.5 cm in diameter) serving for that purpose was found in the Church of the Holy Sepulchre in 1986, see Witnesses of Mystery pg. 310 313..","date":"2013-12-07","mins":"9:28 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-57090","author":"o_k","post":"Hugh: I am also critical of Barbet’s reconstruction although possible, for me it is unlikely. We don’t know how the taking from the cross was performed exactly however we can be certain it was somehow. We don’t know whether 3 or 4 nails were used. We don’t know a lot, actually most of the details. That’s why more research is needed, comparison with archeological findings, source material etc. Remember, Barbet died in 1961, the sciensce has gone ahead since that time. Did they use a fresh one every time? Probably yes at least in Paestine, as such wood would have been cosidered impure by the Jews who had their influence even on the process of executions. The wood supply in Judea would be certainly some problem, but we don’t know the frequency of executions in Jerusalem, during the Roman rule in the 1st century. 3 executions a week for 60 years? 3×52=156 executions a year, 9360 during 60 years of Roman rule. The population of Jerusalem at this time was 30 70 thousand. Was the stipes stuck permanently in the ground (concreted, perhaps), or slotted into a hole, so that the whole cross could be laid flat for easy assembly and disassembly? Unlikely from the reasons mentioned above the fresh wood would be needed each time, besides new studies of the Shroud and the Tunic of Argenteuil suggest the whole cross was carried by the convicts. Alternative scenarios? Creative challenges? Anybody can do that. Some suggestions can be derived for example from the alleged visions of Anne Catherine Emmerich, see Chapter L “The descent from the cross” http://www.ccel.org/ccel/emmerich/passion.pdf Although almost certainly fiction composed by Clemens Brentano (there are many discrepancies with our current knowledge of the relics), it may give some creative ideas..","date":"2013-12-07","mins":"9:08 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-57691","author":"o_k","post":"Leonardo da Vinci, Vermeer, Giotto… It is strange to me, that no one has suggested Roger Bacon yet!.","date":"2013-12-10","mins":"11:46 am","url":"https://shroudstory.com/2013/12/10/maybe-vermeer-made-the-shroud-of-turin/","cat":"humor","title":"Maybe Vermeer Made the Shroud of Turin"},{"id":"comment-57738","author":"o_k","post":"Camera obscura fails! Due to many reasons, vignetting for example..","date":"2013-12-10","mins":"5:09 pm","url":"https://shroudstory.com/2013/12/10/maybe-vermeer-made-the-shroud-of-turin/","cat":"humor","title":"Maybe Vermeer Made the Shroud of Turin"},{"id":"comment-159459","author":"o_k","post":"Http://www.shroud.com/latebrak.htm.","date":"2014-10-05","mins":"5:30 am","url":"https://shroudstory.com/2014/10/04/look-for-an-update-to-shroud-com-maybe-tomorrow/","cat":"news_&_views","title":"Look for an update to shroud.com maybe tomorrow"},{"id":"comment-96141","author":"o_k","post":"There is one think worth notice, the blood flows on the left of the arm are actually very close to the arm’s edge, so they were actually flowing on the upper side of the arms. Off topic: See […] for Lord Nelson’s bloodstained glove, […] for JF Kennedy’s shirt, […] for Abraham Lincoln’s collar, or […] for King Charles I’s shirt. Ah… The modern “relics”. Why no one is disputing their authenticity, contrary to the Christian relics?.","date":"2014-04-03","mins":"8:56 am","url":"https://shroudstory.com/2014/04/03/more-on-the-y-crucifixion-with-pictures/","cat":"news_&_views","title":"More on the “Y” Crucifixion with Pictures"},{"id":"comment-96145","author":"o_k","post":"And as for a forger making it red – adding red paint would probably do, such as madder root dye. I remember that this possibility was excluded in one of the STURP’s papers, but I can’t recall in which. I’ll do some search..","date":"2014-04-03","mins":"9:07 am","url":"https://shroudstory.com/2014/04/03/more-on-the-y-crucifixion-with-pictures/","cat":"news_&_views","title":"More on the “Y” Crucifixion with Pictures"},{"id":"comment-51911","author":"o_k","post":"Charles Freeman : John. The reason that I am a genuine sceptic is that in my experience of working on medieval relics there has not been one that has yet been traced back the first century. So scepticism about the Shroud being the exception is the default position. Charles, Goebbels could be proud of you. DO YOU HAVE A SINGLE ARTIFACT THAT CAN BE DOCUMENTED BACK TO THE FIRST CENTURY?,/u> Charles Freeman : So far I have not see any scientific evidence that provides a specific date within the range of 1 35 AD. One of the favorites of the sceptics’ propaganda. There is evidence! It is HIM who provides chronological evidence! Who else he can be?.","date":"2013-11-18","mins":"2:30 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51917","author":"o_k","post":"Commitment in spreading half truths and ordinary lies, you have, I must admit this, Charles..","date":"2013-11-18","mins":"2:50 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51929","author":"o_k","post":"Charles Freeman : ‘Commitment in spreading half truths and ordinary lies, you have, Charles.’ When I read this kind of thing, I feel that I must have won the argument! No, leaving Goebbels aside you didn’t answer my question: DO YOU HAVE A SINGLE ARTIFACT THAT CAN BE DOCUMENTED BACK TO THE FIRST CENTURY?.","date":"2013-11-18","mins":"4:22 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-56967","author":"o_k","post":"Very few actual crucifixion nails survive. Namely 4 5: 1. The one used to crucify Jehohanan 2. The one used to crucify Jesus (?), currently in Santa Croce in Gerusallemme, Rome 3.The one used to crucify Jesus (?), currently in Santa Maria della Scala, Siena 4.The one used to crucify Jesus (?), currently in Cathedral of Trier. 5 (?) The one used to crucify Jesus (? or possibly used to join the beams of the cross), currently in Holy Lance (Saint Maurice Lance) in Hofburg, Vienna. Have I missed any other?.","date":"2013-12-06","mins":"3:53 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-52179","author":"o_k","post":"Thibault HEIMBURGER : I am disappointed. I provided the pictures and what ? So many “comments” without any kind of connection to the subject ! There are so many questions without answer. More later, if necessary. And I don’t see any kind of interesting discussion. Please look at the pdf and give me/us your comments and most importantly your ideas/questions.. Colin wrote: “I now believe I know how it was done, to produce a very faint image, with pale yellow fibres, as per these welcome pictures, mainly but not exclusively on the more superficial crowns.” This is a testable claim. Colin, I have seen you experiment on your blog. Interesting. You asked me to provide high resolution microphotos. Now, you have them. I would like to see your high resolution microphotos to compare them with the ME photos. Thibault, just being curious. What do you think about this: http://ok.apologetyka.info/racjonalista/caun turynski faszerstwo niedokonane cz 3,560.htm (Figures 13, and XXIII). One sceptic tried to reproduce the TS image via schorch & iron technique. I refuted his article, but nevertheless his (failed) attempt is interesting enough to hear a comment of an expert about it..","date":"2013-11-20","mins":"5:42 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52185","author":"o_k","post":"No problem. The guy (his name is Aleksander Głowacki) tried to utilize hot cloth iron technique he was pressing the surface of the cloth laid on the bas relief. The final result is of course very far from the Shroud, but how would you describe its flaws in more technical terms? I guessed (based on your paper) this is VLS (Very Light Schorch). His results may be a good example of some shortcomings of his method. If you could give us a small lecture here we would be grateful. BTW: How to obtain STURP papers listed here: http://www.shroud.com/78papers.htm Are there some requirements, any credentials needed, or just I should e mail to Barrie Schwortz and write: “could I ask you for those papers because I am interested in the Shroud”. Because in my articles I used secondary sources, if some primary sources were available to me, this would be very beneficial for me..","date":"2013-11-20","mins":"6:05 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-30413","author":"o_k","post":"Or maybe this is a real chance, to resolve, once and for all, the issues about coins, flowers, letters etc. To confirm, or disprove their actual presence, and verify the observations made on 1931 Enrie phoots..","date":"2013-04-11","mins":"5:59 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-30513","author":"o_k","post":"How much do they provide? Could that, what they offer, be used to verify the presence of coins, letters, and flowers? Digital image processing is routine in our times. Image formation process aside, this can be very promising direction in current Shroud researches. There is no access to the Shroud, but there is an access to the images. That can check the old claims. Push them from “disputed” label into heaven of “established”, or hell of “disproven”. This can potentially give powerful arguments into the hands of pro authenticity camp. IF the inscriptions are confirmed, they may be a very strong proof that the cloth belonged to Jesus. IF coins are confirmed, it may prove that Shroud dates back to the times of Pilate. IF Palestinian flowers (claimed by Danin) are confirmed, then we know that the Shroud was present in Palestine, during spring season. What if they are disproved? No serious problem. Nothing gained, nothing lost….","date":"2013-04-12","mins":"3:34 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-30479","author":"o_k","post":"Of course, I say about proffesional imagery analysis. I don’t see any obstacles, preventing this to be done. Such analysis by an expert was done at least once by Andre Marion and his team, in the mid 90s. Marion was clearly a specialist in the field of image analysis, and I can’t understand why his observations are largely ignored in the english language Shroud community (except that, I think there is some certain bias against French researches, that I have noticed). Of course, the discoveries by Marion have been challenged, but actually, they were NEVER disproved. Barrie Schwortz objections doesn’t convince me. They are no serious charges. I have Marion Courage book, and it clearly states that analysis were done not only on 1931 Enrie’s photos, but also on 1978 Miller’s and STURP pictures. If one looks on his results (without the letters contours superimposed), some of the letters are quite clearly visible, and they are too large structures, to be merely considrd artifacts, or optical illusions. I don’t say I am 100 % certain that Marion is right, and there letters on the Shroud. But it is very plausible, and further examination of digital HD images may confirm this or show that they are indeed optical illusions, or aritfacts on Enrie photos..","date":"2013-04-12","mins":"9:43 am","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-74432","author":"o_k","post":"And.","date":"2014-01-24","mins":"3:30 pm","url":"https://shroudstory.com/2014/01/24/nice-editor-touch/","cat":"news_&_views","title":"Nice Editor Touch"},{"id":"comment-45918","author":"o_k","post":"Just being curious, what is Dmitry Kuznetsov’s otchestvo? The letter A. Stands for what name of his father?.","date":"2013-09-30","mins":"10:14 am","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"id":"comment-45941","author":"o_k","post":"Especially by the sceptics..","date":"2013-09-30","mins":"2:27 pm","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"id":"comment-52527","author":"o_k","post":"BTW: Dan, I sent a small article for posting here on the blog..","date":"2013-11-23","mins":"2:41 pm","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","title":"On Wild Ducks"},{"id":"comment-214687","author":"o_k","post":"ISIS didn’t come out of nothing… A must read for all those interested WHO stays behind this diabolical group: http://www.independent.co.uk/news/world/middle east/how saddam husseins former military officers and spies are controlling isis 10156610.html http://www.huffingtonpost.com/entry/putin assad isis 560d7db0e4b0dd85030b2368.","date":"2015-11-16","mins":"5:16 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-214711","author":"o_k","post":"Not to the same extent. They were used sometimes as instrument of power, but where not so closely associated with it as Orthodox Church..","date":"2015-11-16","mins":"7:33 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-214697","author":"o_k","post":"Mutual relationships between Eastern Orthodox Church and the power (whether in Byzantine Empire or its successor Russia) have always been very close and both the Church and Autocrats used each to back own interests. Church was instrument for Power, and Power was used to bolster position of the Church. You must remember this when assessing political position of Orthodox Church..","date":"2015-11-16","mins":"6:37 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-134843","author":"o_k","post":"I wonder how, I wonder why Yesterday you told me ’bout the blue, blue sky And all that I can see is just a yellow lemon tree I’m turning my head up and down I’m turning, turning, turning, turning, turning around And all that I can see is just another lemon tree..","date":"2014-07-02","mins":"6:40 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","title":"Part of a Comment Promoted:  A Question for Today"},{"id":"comment-182228","author":"o_k","post":"I can say how is in Italy. All images of the Shroud are under copyright. If you want to publish it, you must ask the commettee for the shroud in Turin So it seems that the same images can be published in US for free, while you need permission to publish them in Italy. While gold dust to researchers, it’s hard to see any obvious commercial value. There is a commercial value if you want to publish a book containing them, you have to get a deal with Barrie. That’s income for his fundation, allowing him to maintain the activity..","date":"2015-01-09","mins":"5:54 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","title":"Photographs of the Shroud and Copyright"},{"id":"comment-134847","author":"o_k","post":"This is simply argument to the future fallacy one could say as well that one day someone will find definite proof of Shroud’s 1st century origin..","date":"2014-07-02","mins":"7:12 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","title":"Part of a Comment Promoted:  A Question for Today"},{"id":"comment-182229","author":"o_k","post":"See this: http://commons.wikimedia.org/wiki/Commons:Reuse of PD Art photographs.","date":"2015-01-09","mins":"6:02 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","title":"Photographs of the Shroud and Copyright"},{"id":"comment-40432","author":"o_k","post":"Russ, have you checked english wikipedia article about the Shroud? http://en.wikipedia.org/wiki/Shroud of Turin There are several guys, ncknamed Fergus M1970 and Wdford, and perhaps a few other, who are actively working to make it a disaster, and and nothing more than anti authenticity propaganda..","date":"2013-08-04","mins":"1:07 pm","url":"https://shroudstory.com/2013/08/04/remember-when-nobody-had-heard-of-the-shroud-of-turin/","cat":"humor","title":"Remember When Nobody Had Heard of the Shroud of Turin?"},{"id":"comment-212494","author":"o_k","post":"Hugh, the weave structure applies to the negative images of bloodmarks as well. Check my old presentation about FFT: https://shroudofturin.files.wordpress.com/2014/11/shroudfft.pdf.","date":"2015-10-14","mins":"2:03 pm","url":"https://shroudstory.com/2015/10/11/removing-weave-pattern-from-images-of-the-shroud-of-turin/","cat":"other_sites","title":"Removing Weave Pattern from Images of the Shroud of Turin"},{"id":"comment-212279","author":"o_k","post":"I really recommend looking at this post of the Author: http://espacial org.blogspot.com/2015/09/imagenes fft1.html Very infomrative about applications of FFT for image clearance..","date":"2015-10-11","mins":"5:23 am","url":"https://shroudstory.com/2015/10/11/removing-weave-pattern-from-images-of-the-shroud-of-turin/","cat":"other_sites","title":"Removing Weave Pattern from Images of the Shroud of Turin"},{"id":"comment-212277","author":"o_k","post":"Good effort. But nothing new. As Gabriel mentioned, such filtering can be done in other freely available programs such as Image J (Process >FFT>Bandpass Filter). But I don’t want to discourage, contrary, looking forward to more contributions. Regards.","date":"2015-10-11","mins":"5:07 am","url":"https://shroudstory.com/2015/10/11/removing-weave-pattern-from-images-of-the-shroud-of-turin/","cat":"other_sites","title":"Removing Weave Pattern from Images of the Shroud of Turin"},{"id":"comment-146026","author":"o_k","post":"Agreed. But truly, I am under impression, that if I had to name those who have rested on their laurels, there will be many great names mentioned. Sadly, I think many great Shroud scholars from 70 80s, and even 90s, are either dead, or have their best years behind. Not discounting, nor disputing their achievements, and actually having great respect for them, nevertheless I think it is time for a new generation of Shroud scholars to take the baton. We need new people, fresh minds, fresh ideas, fresh insight, to carry on with further Shroud research. The advent of Internet makes it much easier achievable. I think the future of Shroud reasearch, in absence of the access to the cloth itself, is not only in the laboratories, nor at the conferences, but in the places like shroudstory, where people may virtually gather and exchange insights, thanks to your efforrt Dan..","date":"2014-08-25","mins":"9:01 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","title":"Resting on Our Laurels"},{"id":"comment-146010","author":"o_k","post":"What many beliefs about the shroud need to be confirmed? Colin, to his credit, has not rested on his laurels. Many others have not. Many have. Many do. Whom do you have on mind?.","date":"2014-08-25","mins":"7:22 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","title":"Resting on Our Laurels"},{"id":"comment-134356","author":"o_k","post":"Yeah… Nevertheless, this face on Manoppello with a moustache shaven is a mystery, isn’t it?.","date":"2014-06-29","mins":"4:45 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-134299","author":"o_k","post":"We discussed those issues here: https://shroudstory.com/2014/05/15/even in china they know jesus characteristic features/ The Wikipedia article “Depiction of Jesus” is relatively good, despite several drawbacks. Colin: Not wishing to be provocative (would I ever be such a thing?) I’m coming round to the view that the TS man does not necessarily have a beard and moustache. My wife agreed with me instantly in the case of moustache. The Manoppello Image also has no moustache visible, although it has been proven that it shows exactly the same face as the Shroud. See: https://shroudstory.com/2014/06/14/imagej used to compare the shroud of turin and the manoppello image/ and https://shroudstory.com/2014/06/18/the manoppello this little cloth cannot be further ignored in shroud research/.","date":"2014-06-29","mins":"8:47 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-134360","author":"o_k","post":"I don’t know what exactly you have on mind Louis..","date":"2014-06-29","mins":"5:00 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-134475","author":"o_k","post":"Louis, Dave B. Easy, guys! Debating with several chaps who play unfair (because they cannot otherwise) may indeed be frustrating at times, but I still control the situation. They cannot refute my arguments, so they want to force me to insults, to declare their victory. But they won’t succeed. My goal is not to convince them that HPM was based on the Shroud I know that convincing fanatics is impossible. No. The purpose is to show everyone they are wrong and dishonest. So either they admit that HPM was based on the Shroud, or they turn out to be complete morons. Let they fear..","date":"2014-06-30","mins":"9:11 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-134304","author":"o_k","post":"If you study my second article, I list there twelve. And I suppose there are more!.","date":"2014-06-29","mins":"9:03 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-180320","author":"o_k","post":"Here you have 3 D property of the Shroud in practice..","date":"2014-12-31","mins":"10:47 am","url":"https://shroudstory.com/2014/12/31/shroud-of-turin-picture-of-the-day/","cat":"2015","title":"Shroud of Turin Picture of the Day"},{"id":"comment-44842","author":"o_k","post":"This is not the answer. I asked who dispute the method (electronic stereo microscopy) used by Thiede to identify alleged Nu in the second row of 7 Q5, and on what basis. I know the identification of 7 Q5 is controversial. And I know that some from the infamous “Academia” will never aceept its identification as Gospel of Mark (for obvious reasons)..","date":"2013-09-20","mins":"10:04 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-44838","author":"o_k","post":"Louis: “The problem was that he did some computer searching and assumed that the disputed letters belonged to a Marcan text. He did not like it when I had to mention his computer searching in the article I had written, however the method employed by him to identify the letters is rejected to this day.” Rejected by whom? And why?.","date":"2013-09-20","mins":"9:25 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-44843","author":"o_k","post":"And BTW: I have Thiede’s book “The Jesus Papyrus”. And I know that Thiede was absolutely certain that 7 Q5 is Mark. And I also know that Thiede maintained that the gospels were written down BEFORE 70 AD, contrary to usually maintained opinions by most literary scholars basing on often quite absurd assumptions..","date":"2013-09-20","mins":"10:08 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-44744","author":"o_k","post":"Hi Dave. The problem here is that nothing here is consistent with other results. History: The relic certainly existed in the 4th century, and was lost in 455 till 1492. So it is either original, or forgery created in Helena’s times Paleography: According to Thiede and the Israeli experts asked by Hesemann the writing on Titulus dates back to the 1st century AD. So it can’t be deliberate forgery, it is either the original or a faithful replica of original. Carbon Dating: It dates the relic between 980 and 1146 AD. So it can’t be original. Nor it can be a forgery, because the script of the 1st century was certainly unknown around 1000 AD! But it can’t be also a faithul replica, because the original was already lost in that time. So carbon dating is in conflict with two other scientific disciplines! Which is right then?.","date":"2013-09-19","mins":"5:26 pm","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-44865","author":"o_k","post":"Louis: Amen. Fully agree. Just wanted to know whether someone could undermine the validity of Thiede’s identification of one particular letter nu in 7 Q5. Which is, of course, not necessary to show that Gospels were written before 70 AD. One note: Thiede quotes calculations of Albert Dou, spanish professor of mathematics, who claimed that the probability that 7 Q5 is not Mark is like 1:900 000 000 000. Of course, as always the question is whether Dou’s assumptions and modellings are valid..","date":"2013-09-20","mins":"12:05 pm","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-44941","author":"o_k","post":"Dave: Dating the Gospels is pretty simple, if using some common sense and starting from Luke’s Acts. They end in 62 AD in Rome, and don’t mention death of Paul, which occurred in 64 or 67 AD. So they can be very easily dated to 62 63 AD (had they not been part of the Bible no scholar would ever doubt this dating). Because Acts were preceded by Gospel of Luke, written rather short period before, the Luke can be dated to around 60 AD. The final (Greek) version of Matthew can be dated to about the same time, because most of the critics consider Luke and Matthew being written parallely. Now Mark. As it seems that both Luke and Matthew depend on Mark, it must be earlier, perhaps around 50 AD. Now finally John. He knows earlier Gospels, and mentions Peter death, but doesn’t mention destruction of the Jerusalem. So he wrote his Gospel perhaps around 70 AD, but the date could as well be later. Now how those dates had been screwed by the modern critics. First response to what you wrote about Papias: “reading from Papias that Mark was Peter’s amanuensis and wrote as he remembered, then if Papias can be relied on, it might be inferred that Mark wrote after 65 AD”. Papias NEVER claimed that Mark wrote after Peter’s death. Next: destruction of the Temple. You wrote: “However some exegetes read into Mark 13 that the temple is still standing, whereas in Matthew and Luke this is no longer the case.” This is the main argument of those who claim that the Gospels cannot be dated before 70 AD. However it is based on COMPLETELY FALSE presumption, and has a hidden statement of non believe in Jesus’ meesianic claims. The very ambiguous prophecy of destruction of the Temple is in Mark 13, Matthew 21, and Luke 21. According to the critics, it was put in the Jesus’ mouth to make him a prophet. Thus they suggest, that Jesus COULDN’T be a prohpet, and couldn’t predict it. But if you are a Christian and believe that Jesus WAS a Prophet and Messiah, this is obviously PURE ABSURD. Nonsense. And even if Jesus hadn’t been a prophet such prophecy claimed by him would have been nothing impossible. There are plenty of “prophets” today who herald the end of our civilization, the same was in Palestine of the 1st century, when apocalyptic and messianic expectations were very common (just to mention Essens). Many Jews considerd Temple as corrupt. The Temple was once destroyed, by Babyloninas in 586 BC, so why couldn’t this happen again. In political situation in Palestine, when uprising against the Romans could start every moment, the eventual destruction of the Temple was very easy to predict. And one final note: THERE IS NO PLACE IN THE GOSPELS WHICH CLAIM THAT THE PR Op HECY HAD FULFILLED..","date":"2013-09-21","mins":"5:40 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-44958","author":"o_k","post":"So once again: “I don’t buy it, arguments too flimsy, too much wishful thinking.” The same is even more true about approach of the modern critics dating the Gospels after 70 AD. They depend more on wishful thinking and absurd reasoning. If anyone was using the approach used to discredit biblical stories to any other classical literature (Tacitus, Herodotus, Thucydydes, Suetonius and so on) he would be considered a madman. Because biblical and classical studies are in fact two different worlds. And modern critics are not interested in searching for the truth but rather in gradual denial of Christianity. 1). Oral tradition. It was certainly there. It was also AFTER the Gospels were written. Several additional informations can be possibly found in the early Church Fathers Writings, as well as some Apocrypha. The unwritten Tradition is still important part of Catholic and Orthodox Christians. But this absolutely doesn’t exclude the possibility that Gospels were written before 70 AD. “The Parousia was soon expected and there would be little point in setting them down in writing until it became apparent that eye witnesses were dying out, and the Parousia was not as immediate as they had imagined.” This is another myth. Based on what on some remarks in the Paul’s letters (who wrote himself that the date of Parousia is uncertain) and on THE GOSPELS! Which, according to this version, shouldn’t be written because early Christians didn’t need them. Besides it is not certain that all early Christians would expect Parousia within their lifetime. Remember, the prophecies of Jesus were quite ambiguous, as all the prophecies have to be. Most commentators see the words of Jesus “Verily I say unto you, there are some of them that stand here, who shall in no wise taste of death, till they see the Son of man coming in his kingdom.” (Matthew 16:28) to the Transfiguration of Jesus. Read Benedict XVI “The Jesus of Nazareth” for example. 2).”The argument from Luke’s Acts, I believe will not stand up. There is too much discrepancy between Paul’s own teachings in his epistles and Luke’s interpretation, for Acts to be contemporaneous with Paul.” This is another nonsense. Remember, what we write about ourselves usually differs from that what others write about us. “There is no need for Acts to record the death of Paul, and this is a flimsy argument to assert that Acts predates it.” At the end of Acts, Paul is alive and well. Why? Why does Luke not mention at all his ultimate fate? There is no piece of evidence that he wanted to write the third volume, after Gospel and Acts, as some claim. 3).”If Papias has Mark as Peter’s amenuensis, why does he then say that Mark wrote as he remembered, but not in the right order, as if Peter was not then available to correct any errors that Papias believed Mark had got incorrect?” The chronological order is not important. Can you find A SINGLE hitorical or biographical book which maintains it through the whole text. And according to Christian tradition, Mark was later Bishop of Alexandria and died circa 68. See: http://en.wikipedia.org/wiki/Saint Mark Some commentators place the Peter’s first visit to Rome around 45 50 AD. 4). As I said the argument from destruction of the Temple is simply absurd. 5).”I see the final redactors of the gospels, particlarly Matthew and Luke, not so much as original authors, but more as editors each with a specific purpose, who assembled a mix of oral traditions and written material, set their own particular viewpoint upon this material” And that’s right, because they certainly used some earlier material. Most probably, Matthew took some notes during the Jesus lifetime (Papias mentiones that), which formed the basis of later Gospels. Some traits of it perhaps can be found in the apocryphal Gospel of Thomas (with several gnosticisms added later). Remember, Jeremiah had a secretary, Baruch. So why Matthew couldn’t be Jesus’ secretary? The Thiede writes about that in his “Jesus Papyrus”. Of course the modern criticism created another absurd viewpoint that Matthew was illiterate. Then later Mark wrote his Gospel, basing on Peter and Matthew’s notes. This served as a basis for Matthew to write a final form of his Gospel, and for the Luke. Remember, there was no copyright in the 1st century. “before the gospels attained their final form.” The textual variations in Gospels are very minor. This, and internal logic of the text suggest that they were written in a form very close to today’s relatively quickly. Their slow evolution is another myth of critics. Who it should be underlined are not interested in searching for “the truth”, but rather in practicing negationism..","date":"2013-09-21","mins":"7:55 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-44964","author":"o_k","post":"Dave: Try to think about what I have written again and again. The points I presented are not just mine. Once, I was thinking the same way you do. But good texts of several apologists like Carsten Peter Thiede, Peter Seewald (who recently wrote very interesting biography of Jesus, recommended by Benedict XVI), and some Italian apologists like Antonio Socci (a little bit sensationalist but nevertheless very interesting), Andrea Tornielli, Mc Dowell and others (like Jan Lewandowski, my friend from Apologetyka.info forum) opened my eyes. “argument from destruction of temple not absurd but accepted by Catholic scholars” yes but it doesn’t mean anything. It was accepted after Vaticanum II, when there was too much tendency to be “modern” and “progressive”. The Catholic scholarship before 1960s usually accepted dating before 70 AD based on the end of the Acts,just as I presented. Check Daniel Rops for example. The more I delve in the topic, the more convinced I am that the biblical critics live in completely different world than normal people. I know it is hard to accept this now, just like it is initially hard for most people to accept that the Shroud is genuine, for example. It is not a mystery that biblical critics invent their theories not to seek the truth, but to destroy the credibility of Christianity. And later present those theories as “scientific” and “absolute” truth. And several other scholars, even the Catholic ones, fall into this trap, because they are afraid of being “non scientific”. This is herd instinct. The attitude of Biblical critics is typical, because being anti Christian is popular since the time of Enlightment circa 1700. Even Barrie Schwortz, a Jew, noticed that. You now how absurd theories of Nickell, Garlaschelli, Schafersmann and others about the Shroud are presented in popular media. The same is true about Biblical Scholars. The same was true about several myths about “bloody” Inquisition, alleged medieval belief in flat earth, and so on. Have you ever engaged in polemics with militant atheists? I did and I know the dirty tricks they use..","date":"2013-09-21","mins":"9:45 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-134514","author":"o_k","post":"O.K. You are doing a good job,but, you know something? Write a pdf paper where all your arguments can be stated, refuting what your opponents say, and post it. It will save you a lot of time and energy. Louis, it is not that. Everything what is needed to prove HPM Shroud connection is in hat article, every word of it remains valid. No need to add anything new. The purpose for which I sacrifice my time and energy is to show everyone that the sceptics have actually nothing to say. They cannot undermine the evidence of the Hungarian Pray Manuscript. Every their attempt has shown to be futile. Thus giving us in practical certainty to the existence of the Shroud before 1200 that is before the 4th crusade, and Robert de Clari’s relation about the presence of the shroud with a figure of Christ in Constantinople. So now in every discussion with every sceptic maintaning that the Shroud didn’t exist before 1260 1390, one can refer to that thread about about HPM, and say we have undeniable evidence, the HPM. No sceptic has been able to undermine it. And no will..","date":"2014-06-30","mins":"1:18 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-44880","author":"o_k","post":"It is not even certain that Qumran documents should even be linked to the Essens, or at least maybe not all. It is possible that several groups were hiding their documents in caves, and those could be plundered well before 1947. Another possibility is that the Essens studied Christian literature, from curiosity or for polemical purposes for example. And also relations between Christians and Essens are completely unknown, some scholars claim the hostility, others sympathy, some (but this is fringe theory) think that the Essens created Christianity, while others (even Christian apologists) think that some of the Jesus’ disciples actualy came from Essen society, or joined Christians later. Theories, no proof for any of them. About what the majority of the sholars hold: these are only opinions and guesses. No solid facts. Most of them believe that Gospels cannot date back before 70 AD. There is still a widespread (and completely unjustified) myth that all of the Apostles were illiterate, or that first Christians were too primitive/didn’t have need to write their memories. And of course ‘oral tradition’. Yes it was important, but it absolutely doesn’t mean that the Gospels couldn’t be written quite early, within the first 20 30 years. Another myth is that early Christians could be nothing more than local Palestine sect with maybe a few hundred believers. And the more I study the topic, the more convinced I am that this is COMPLETELY WRONG. The speed of Christianity spread in the 1st century (and primary among higher classes) was incredible..","date":"2013-09-20","mins":"4:15 pm","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-44810","author":"o_k","post":"Dave: I looked back to Thiede and Hesemann, and indeed, the relic was found again in 1143 by Cardinal Gerardus , and then hidden in wall again in 1146. Perhaps the replica was created then, and also hidden (why?). So if the thing discovered in 1492 is a replica, so then next question comes: where is the original? Perhaps still somewhere inside the walls of Santa Croce di Gerusalemme! Fascinating! Remember what is preserved now in Rome is only a PART of the Titulus Helena split it into parts, one part was left in Jerusalem, one traveled to Rome. The Jerusalem part probably traveled later to Constantinople, as it is mentioned in Byzantine relic inventories. So far I remember it was even transferred to Louis IX (and then finally lost during French Revolution), but I must check within my sources where I found it..","date":"2013-09-20","mins":"4:54 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-45175","author":"o_k","post":"Dan, being Anglican you probably are unaware of the topic of Eucharistic Miracles, but the story is well known and described in several books (mostly written by Catholics, unfortunately I don’t have any of them right now at hand), although of course primary documents are hard to get, like usually in those cases..","date":"2013-09-23","mins":"6:17 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"id":"comment-45182","author":"o_k","post":"There has been around 130 Eucharistic Miracles accepted by the Catholic Church. The first one, and most widely known, is Eucharistic Miracle of Lanciano, said to happen around 700 AD (although the earliest documents that survived date back to 17th century). It has been examined in 1971 by prof. Odaoardo Linoli, a pathologist. He confirmed that it consisted of real heart tissue and human blood, of the TYPE AB. The same blood type that was found on the Shroud of Turin, on Sudarion of Oviedo, as well as on the Tunic of Argenteuil. I have seen scan (probably pirated) of his report (in Italian) in Internet, but it seems to be gone right now. His results were later confirmed by WHO experts. I have not seen the document, and don’t know who the experts were, but I have seen the picture of the report’s cover in one book. See this page for example: http://www.therealpresence.org/eucharst/mir/lanciano.html A few years back, in 2009, the alleged Eucharistic Miracle happened in Poland, in small town of Sokółka. For a few months it was the main topic in the media, and later the issue went quiet. So far I read, the medical specialists gave positive opinion, now the matter is being examined by the Vatican..","date":"2013-09-23","mins":"7:04 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"id":"comment-44814","author":"o_k","post":"Dave: “I’m not sure why you argue that the 1st century scripts were unknown in 1000 AD. If the original had badly deteriorated during the first millenium, then Lucius or someone else may have thought to create a replica from what then remained.” The inscription from Titulus was examined by several specialists in paleography: Hannah Eshel, Gabriel Barkay, (specialists of Hebrew), Leah di Segni, Israel Roll, Ben Issac and Carsten Peter Thiede (Greek/Latin). All of them confirmed that the script dates back to the 1st century. Remember there was no such a discipline paleography in 1146. The alleged forger couldn’t fake it to imitate the 1st century script (and even didn’t have a need to do so) had he not have the ORIGINAL within the sight of his eyes. Charles:”When he dated a papyrus of Matthew to the first century AD he said it compared well with scripts from the papyri found at Herculaneum that were, of course, covered by lava in 79 AD. All looked good until Robert Bagnell, and others, pointed out that the papyrus from Herculaneum was actually first century BC and so Thiede had found something truly remarkable a gospel of St. Matthew dating to before Christ was born.” I think it is not a big problem,(especially if it concerns just a single example). The margin of error in paleography can still be around 100 years (or even more). Styles of writing sometimes evolve slowly, sometimes rapidly. The range 1st century BC 1st AD is still acceptable. You are just trying to troll now..","date":"2013-09-20","mins":"5:11 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-45429","author":"o_k","post":"Kelly: No I am basing only on descriptions in popular books about that case (and unfortuantely I don’t have any of them at hand in this moment). Nicola Nasuti OFM Conv, “The Eucharistic Miracle in Lanciano”, Grzegorz Górny Janusz Rosikoń, “Dowody Tajemnicy” (Evidence of Mystery) However, as I said, I have seen a picture of a cover of 1976 WHO report in that latter book, so the story is not invented, I think..","date":"2013-09-25","mins":"5:01 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"id":"comment-45430","author":"o_k","post":"The fragment about Linoli’s determination of blood type as AB is very brief, but it refers to methods developed by some A. Fiori, and V. Siracusa. Kelly, you are a specialist of that field, could you tell us all whether there is real chance, that Linoli’s blood typing as AB may be a false positive? So far I know there were very little of possible contamination in Linoli’s samples. And one another thing. Andre Marion and Gerard Lucotte in their book about the Holy Tunic of Argenteuil claim that the blood on the Tunic was also determined to be AB, in 1985 by some dr Saint Prix, unfortuantely they give no reference to that work..","date":"2013-09-25","mins":"5:17 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"id":"comment-45375","author":"o_k","post":"Kelly and others. So far I have read Linoli’s examination had been verified multiple times in 1976 and 1981 (on the other sample taken in 1970) and his 1971 conclusions had been confirmed. The scan of original 1971 Linoli’s paper (in Italian) can be found here: http://www.mediafire.com/download/2j2j8qalrmcrlb4/Lanciano+Article+16 45 35.pdf but I am not sure whether this is legitimate (that means legal) copy..","date":"2013-09-25","mins":"9:14 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"id":"comment-45431","author":"o_k","post":"Louis: The ultimate fall of Communists was unavoidable (due to nature of Communism itself), so what’s that prophecy? (LOL).","date":"2013-09-25","mins":"5:25 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"id":"comment-45450","author":"o_k","post":"Louis, calm down. And let’s not talk about politics (and politicians). Just said that some happenings in politics are very predictable, even without supernatural revelations. For example, that some (in fact most) politicians are idiots. And in fact I believe the revelations of Fatima were genuine..","date":"2013-09-25","mins":"7:31 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"id":"comment-45440","author":"o_k","post":"Louis : O.K. The reference was to the Communist regime in the former USSR in what is known as the “Fatima revelation” and Lúcia, Francisco and Jacintha, of the Marto family, were very small children, who probably knew next to nothing about regimes and politics. There is a very big difference between what you see in Lourdes, France and what is felt in Fatima, Portugal. Louis, that was only a joke ; ).","date":"2013-09-25","mins":"6:32 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"id":"comment-173820","author":"o_k","post":"If someone has an answer to my questions, I remain here waiting. 1) documents before 16th century saying that in Besançon there was a shroud with an image of Christ; 2) documents before 16th century saying that in Besançon there was a shroud; 3) documents before 18th century (i.e. Before the forgery of the 826 manuscript of Besançon) saying that Othon de la Roche had a shroud. Waiting for what? It is well known that even if such documents were found, you will label them ‘forgeries’. But if the documents we have already, are not enough for you, and you don’t know (nor want to know) how to extract important information out of them, and make valid conclusions, your loss. That’s a difference between a good historian, and primitive negationism. That’s why I have low respect for historians and other ‘humanists’ (not all of course). The inability to think outside schematic methods. It seems they don’t teach them at studies. The better for their old ‘authorities’ and masters have their a^&&# secure..","date":"2014-11-30","mins":"10:23 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174105","author":"o_k","post":"And sceptics, like Andrea Nicolotti, Ph. D. In medieval history, are able to believe a conspiracy theory that two separate faked obscure document were fabricated in perfect concordance, for actually no purpose in the 18th century (200 years before the interest arose around them) a thousand miles away! What’s more pseudoscientific? They have no evidence for forgery, yet they shout FAKE, FAKE, FAKE, it MUST BE A FAKE! Of course it must be fake as it is inconvenient for them it must be fake..","date":"2014-12-01","mins":"5:41 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174106","author":"o_k","post":"So is there any other contemporary evidence that Otho possessed the Shroud? Contemporary no, except maybe for this chest from Ray sur Saône castle , which has not been dated yet. Yet we should be happy with what we have those are maybe the last crumbs of the true story, that somehow managed to survive in some controversial documents. This situation is not the only one. Actually, except for a few inscriptions, we have no contemporary accounts for Alexander the Great conquests (and many other ancient historical events) the surviving relations were written 300 500 years later..","date":"2014-12-01","mins":"5:46 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174110","author":"o_k","post":"David Mo: You could read Nicolotti’s article about the false Ordine Costantiniano Angelico Di Santa Sofia here: http://www.giornaledistoria.net/index.php?Mestiere=557 D0301220202755772070305732771 (In Academia.edu also) I have read this long ago, and in fact there are no convining arguments that the letter of Theodore Angelus is a fake one. Actually it is mentioned there only in one or two sentences. In his paper, Andrea claims that because there are some historical and genealogical errors in some documents in the Chartularium, so the entire set of documents must be thrown away as forgery. This allows him to throw inconvenient documents about the Shroud and Santa Casa in Loreto as well..","date":"2014-12-01","mins":"6:06 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174199","author":"o_k","post":"Even without my book – that will explain HOW the forger invented the history on the beginning of 18th century, and WHO is the forger – it is obvious that the “Othon history” is false. So who is this forger?.","date":"2014-12-01","mins":"2:02 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174284","author":"o_k","post":"Andrea Now I have identified the author and the sources he manuipulated and falsificated So did he bring this coffer in the Ray sur Saône castle? You cannot disregard it! Sorry, but your reasoning is not conclusive. More when I return home..","date":"2014-12-02","mins":"5:43 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174327","author":"o_k","post":"Andrea: This is not question of subtle interpretation and analysis, is only normal exegesis of the sources. This is what you don’t understand, there are more subtleties here, and “normal analysis” fails. But first of all I must explain something. I don’t buy the whole Scavone’s story about fire, stealing the Shroud from Besancon cathedral, re appereance in Lirey, Jeanne de Vergy commisioning painter to make a copy, replacing one Shroud for another, etc. It makes no sense to me for various reasons. I am not even specially interested whethere there was some Shroud in Besancon before 1523. The only thing that interests me is whethere Othon de la Roche possesed for some time the Shroud sacked from Constantinople in 1204. Not SOME documents, but ONE document: this manuscript 826, of the 18th century. […] But the question, as I said, was just explained many years ago: the author of this treatise, in 18th century, said for the first time that Othon had a shroud (500 years later the 1204), when until that moment ALL historians in Besançon said that the Shroud arrived in Besançon some centuries before and by another way (all ignorant?). He quoted some sources, declaring that these sources attribute to Othon the translation of the Shroud. But it is not true, they did not. He manipulated them in a evident and also shameful. He is very ignorant, and for example says that a certain historian was at Constantinople on 1204, when the historian was born AFTER 1204. And so on. For that, Vignon and Zaccone (they are not “Skeptics”) understood that the manuscript 826 was written by someone who INVENTED the link between Othon and the Shroud, to defend his shroud (a normal painting). Now I have identified the author and the sources he manuipulated and falsificated, but, I repeat, it was enough what Vignon and Zaccone wrote to have a correct idea about the problem. You don’t get it. You missed basic thing, even if you identify author (by name), even if you identify sources he used (the question arises here: have you identified ALL sources he used?), it is still not enough. The author of MS826 confused historical facts, perhaps even manipulated sources I can agree with that. But it is irrelevant as it DOESN’T PROVE that he INVENTED the whole story about Othon. He perhaps luckily found good track, yet he was unable to present it in a convincing way, so he made mistakes or perhaps even tampered with the sources. Nevertheless this doesn’t mean that the information about Othon is INVALID. True informations may be present even in the most unreliable documents: forgeries, legends, apocrypha, romances, poems yet one must be skillful enough to extract them. Let me put it this way: The Theodore Angelus letter, the MS 826, the tradition of Ray sur Saône castle are very weak sources each on its own. Yet together although seemingly independent from each other they provide complementary informations, they back each other and make coherent whole. So either they reflect the true story that Othon once possesed some Shroud looted from Constantinople, or are parts of some really BIG conspiracy for some obscure and meaningless purpose in 18th 19th century..","date":"2014-12-02","mins":"1:59 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174728","author":"o_k","post":"Aljone, I have to do a little correction: it is not true that STURP team did not want C14 testing. They asked it. Look at this communicate of the STURP (october 8, 1981): https://www.shroud.com/78conclu.htm All shroudie websites with this text have suppressed from it a sentence: “No carbon 14 measurements have been done. Unless and until permission is given to use part of one thread of the Shroud, such an essay must wait”. They tried to do it. Now, they prefere forget it, and cancel the sentence. Andrea, so do you claim that the original summary of STURP conclusions contained this sentence, and it was deleted on Barrie’s site?.","date":"2014-12-05","mins":"4:32 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174791","author":"o_k","post":"Thibault: http://www.luther2017.de/en/25923/now hunger cloth torn lent tradition survives reformation Obviously nothing in common with the Shroud….","date":"2014-12-05","mins":"4:37 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175071","author":"o_k","post":"Baima Bollone used clear threads as controls..","date":"2014-12-07","mins":"4:59 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174912","author":"o_k","post":"The STURP 1981 Summary was admirably neutral, if uninformative on the nature of the image. The drip feed of thinking and research that emerged later from its leading lights was of an entirely different character. Jackson’s collapsing cloth idea presumed authenticity. Rogers’ Pliny era theorizing re starch and saponins presumed authenticity. Adler’s “trauma bilirubin” to account for unnaturally red looking blood presumed authenticity. Do I need to continue? “We can conclude for now that the Shroud image is that of a real human form of a scourged, crucified man. It is not the product of an artist”. This is not too neutral Colin, Andrea. What would you consider ‘neutral’?.","date":"2014-12-06","mins":"8:36 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174922","author":"o_k","post":"Placing into quarantine – at least temporarily – all previous hand me down narratives etc that are more a matter of faith than established fact. For example?.","date":"2014-12-06","mins":"9:16 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175192","author":"o_k","post":"David Mo, recentely, your ignoration has been shown on several issues. Nevertheless you still pretend to be the smartest on every topic. I would like to ask you one thing: stop your insinuations, please..","date":"2014-12-08","mins":"4:06 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173661","author":"o_k","post":".","date":"2014-11-29","mins":"6:18 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175349","author":"o_k","post":"Simply some sceptics are frustrated now, because they have been recently shown wrong and ignorant. So in their rage, they rampage with insinuations,and try to show that everyone else, (STURP in particular) must be wrong, and they are the wisest on this planet. I suggest everyone simply ignoring their screams for a moment, until everything calms down..","date":"2014-12-09","mins":"6:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173791","author":"o_k","post":"Hugh: First, read my discussion with Andrea in this thread: https://shroudstory.com/2014/10/28/dan scavone responds to charles freemans article/#comments Second: As to the letter written from the Emperor Alexius V Mourtzouphlus to Pope Innocent III in 1204, see http://www.shroud.com/pdfs/n76part4.pdf Third: The Besancon Shroud (the one that existed since at least 1523) had an image, see Vignon http://www.holyshroudguild.org/weuenshel collection provided by google.html The problem is its relation with the Shroud of Turin. It is supposed that Otto de la Roche possesed the Shroud of Turin circa 1205, and the Shroud of Beesancon is simply its copy, made either on behalf of Otto, or several centuries later..","date":"2014-11-30","mins":"8:14 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173585","author":"o_k","post":"Andrea Jicolotti: It is obvious, as the Shroud of Besançon with image was displayed first time on 1523. Because, I have said many times, the Shroud of Besançon did not exixt on middle age. Oh really?.","date":"2014-11-29","mins":"7:31 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173782","author":"o_k","post":"Andrea: 2) documents before 18th century saying that Othon de la Roche had a shroud. Answers: 0. The 1205 letter of Theodore Angelus to the Pope Innocent III, Plus 18th century MS 826 manuscript saying about Otto. That’s enough..","date":"2014-11-30","mins":"7:48 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173792","author":"o_k","post":"Oskar, I do not want to start discussions with you, but the letter of Theodore Angelus is a forgery, and does not make the name of Otto nor tell something about shrouds with images or shrouds in Besançon, and the 18th century MS 826, as we know, was written 500 years after, and it is a falsification of medieval sources, as Vignon, Zaccone and other know and explained many years ago. Why don’t you want to discuss with me? Are you afraid of that? Indeed the pace, when you were running away from discussion with me in this thread https://shroudstory.com/2014/10/28/dan scavone responds to charles freemans article/#comments was really impressive! I asked you when the letter of Theodore Angelus was forged (century)? You answered on November 1, 2014 at 3:09 pm: probably from xvi to xix Later you claimed on November 1, 2014 at 3:57 pm: All fake Chartulariums are falsificated to give importance to a family or institution that has no importance and wants to have it. So the forger of the cartulary created a fake diploma of Constantine XI, with a false genealogy of his family; and then, to make believe that his family had in the past important relics, made a false dowry which contained the stones of the home of Our Lady of Loreto, a false report of translation of the relics of the martyrs of Otranto to naples and our false letter to the pope where is said that they possessed the Shroud. When the letter was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time). The forger was not very able, and did not know the Greek; it is easy to see that the document is not authentic. When I showed the letter to the most important experts on this field, Luca Pieralli and Otto Kresten, in five minutes they confirmed my opinion. Then I asked on November 1, 2014 at 4:07 pm Anyway, next round. What about 18th century “sources” (fake according to you), that is one source, that is presumably one part of MS 826 manuscript which originated the story about Otto de la Roche, and the Shroud of Besancon? Did the forger from De Angelis Family also put his fingers in it? Then you ran away. You seemingly understood. But you cannot run away from that question. It will catch you no materr how far you will be trying to escape..","date":"2014-11-30","mins":"8:23 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173795","author":"o_k","post":"Andrea, I asked you a simple question: “did the forger from De Angelis Family also put his fingers in it (MS 826)?” The one on which you can answer either ‘yes’ or ‘no’..","date":"2014-11-30","mins":"8:40 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173794","author":"o_k","post":"Because I know that our ways of thinking are too much different, Yes, but that’s in plus. Had our discussions not been so confrontational, this combination of different thinking styles would be a big bonus. But because it is as it is… so in our discussion it is impossible to find a common point of starting. Or rather common conclusion. Normally people discuss to find some final consensus. And normally you do not have informations that I do not know, so I do not learn from you. Bad thing for you of course. Therefore, our discussion is useless. Oh really? Or maybe simply… inconvenient for one side. And, as I have just said, I do not consider a blog a place for deep discussions, but only a place to share informations. Why not? Here you have some of the greatest specialist on the Shroud of Turin on Earth..","date":"2014-11-30","mins":"8:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173800","author":"o_k","post":"I have just answered to this. “When the letter [from De Angelis Family] was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time” in all the books about the Turin Shroud. So, it was natural for the forger put the shroud in Athens. This is the first possibility. Not only in Athens but 1205 AD Athens! Ruled by Otto de la Roche! Nice and extremely improbable concordance of forgeries! The other one, less probable, is that the forger read the book of Dunod de Charnage (1750) and his followers, where was written that a shroud was translated to Athens on 1204. So, he did’nt know the manuscript 826, but its printed summaries. But, I repeat, this is less probable. Even less probable! But here comes the third factor here. The coffer from the Ray sur Saône castle: http://www.acheiropoietos.info/proceedings/Piana MYHS Web.pdf Did the conspirators installed it there?.","date":"2014-11-30","mins":"9:05 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173810","author":"o_k","post":"Concordances in modern forgeries are not strange nor extremely improbable. Yeah, yeah, dependent what concordances. You are creating a nice – I must say this – conspiracy theory – a faked document in Besancon archives (as far as I remmebr MS 826 has two parts FOR and AGAINST the Shroud of Besancon), a faked coffer installed in some old castle of some old chevalier house, and a forger from some Sicilian clan, a thousand miles away, creating a faked document basing on some old and forgotten books on both Shrouds (of Besancon and of Turin) and then placing it in some forgotten by everyone Chartularium, a copy of which will be rediscovered opnly in 1981! Makes it any sense? One day I was in a little “castle” in Piedmont where the owner, showing us a room with a 18th century bed, said that “Napoleon slept there”. And I said to him: “But we do not have any document saying that Napoleon went in this village, nor that slept here!” And he answered: “Oh yes, he did it. The bed is the proof”. Perhaps he indeed slept there!.","date":"2014-11-30","mins":"9:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173815","author":"o_k","post":"If your historical methods (only yours) are right, ALL medieval shroud (by dozens) are authentic, because all have modern documents forges stating their authenticity. And Napoleon slept everywhere. Do you see why is useless our discussion? Yeah, yeah, Andrea, you try to throw mud on me, as I have shown the absurdity of your conclusions. As Emanuella Marinelli pointed: (http://www.shroud.com/pdfs/n74part8.pdf pg. 13) Here, Nicolotti’s method is thus: if a document is controversial, then it is false. If a document is authentic, then what it is written in it is false. If what is written is true, it cannot refer to the Shroud that is now in Turin That’s why convincing you is futile. But exposing your intellectual dishonesty is is not. BTW: have you ever tried to count the number of alleged burial cloths through centuries?.","date":"2014-11-30","mins":"9:58 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-138888","author":"o_k","post":"Dan, have you forgotten? https://shroudstory.com/2014/05/03/the shroud of turin and the horns of the devil/.","date":"2014-07-17","mins":"6:20 am","url":"https://shroudstory.com/2014/07/17/the-man-of-the-shroud-has-horns/","cat":"tinfoil_hats","title":"The Man of the Shroud has Horns?"},{"id":"comment-202528","author":"o_k","post":"Wasn’t there the document about King’s Umberto last will regarding the Shroud? I think I have seen it somewhere (and there was no mention about Shroud staying in Turin), but I don’t bet anything on that..","date":"2015-06-17","mins":"1:17 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-37751","author":"o_k","post":"Why no opponent of coins, letters, flowers etc. Observed on the Shroud claims that the body image is nothing else but pareidolia? A random shape in the human form, that everyone thinks represents real human (but it is nothing else but optical illusion). Just like other random shapes are claimed to be real objects. This was just an irony, of course..","date":"2013-06-22","mins":"11:02 am","url":"https://shroudstory.com/2013/06/22/the-phoenix-pareidolia-but-the-most-famous-apparition-of-jesus-is-the-shroud-of-turin-a-piece-of-14th-century-linen/","cat":"news_&_views","title":"The Phoenix Pareidolia:  But the most famous apparition of Jesus is the Shroud of Turin – a piece of 14th century linen"},{"id":"comment-201350","author":"o_k","post":"We read. Simply no one wants to do anything this season. (except the own duties we have to do…).","date":"2015-06-08","mins":"3:32 pm","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","title":"The Pope and the Tramps"},{"id":"comment-110644","author":"o_k","post":"It is not a joke, Louis. Some interrogated Templars claimed that their purported idol was demon like. For example Raoul de Gizy mentioned that it “seemed to him that it was the figure of a certain demon, called in French un maufé, and that whenever he saw it such a great fear overcame him that he could scarcely look at it except with the greatest fear and trembling.” As we can see, if you fold a Shroud at least in the half, (or even better, leaving just the face) you can see figure that may look quite devilish, with those horns (created by watermarks) atop of the head..","date":"2014-05-04","mins":"6:56 am","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","title":"The Shroud of Turin and the horns of the Devil."},{"id":"comment-149271","author":"o_k","post":"Josie, see those links: Official site of the Holy Face Sanctuary http://www.voltosanto.it/Inglese/index.php Sudarium Christi Website http://www.sudariumchristi.com/uk/start/index.php Holy Face of Manoppello Blog http://holyfaceofmanoppello.blogspot.com/ Volto Santo di Manoppello, the Holy Face by Juliusz Maszloch http://manoppello.eu/eng/ Several articles from 2010 ENEA Frascati Conference http://www.acheiropoietos.info/ John Iannone, The Veil of Veronica: Fact or Fiction? http://www.shroud.com/pdfs/iannone2.pdf For more sceptical view, see Roberto Falcinelli’s “The Veil of Manoppello: Work of Art or Authentic Relic?” from the 3rd International Dallas Conference on the Shroud of Turin (2005). Http://www.shroud.com/pdfs/roberto.pdf Besides, see my papers on that: https://shroudofturin.files.wordpress.com/2014/06/manopello shroud comparison3d.pdf https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf.","date":"2014-09-07","mins":"11:54 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"id":"comment-110824","author":"o_k","post":"You don’t catch it, Andy. It is obviously a water stain, but in the eyes of frightened Templar who has not seen the image before, but he has heard some rumors about some secret (and possibly heretical) cult in the order? This is not ridiculous..","date":"2014-05-04","mins":"11:28 am","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","title":"The Shroud of Turin and the horns of the Devil."},{"id":"comment-198257","author":"o_k","post":"Yes. In the right bottom corner..","date":"2015-05-04","mins":"4:45 am","url":"https://shroudstory.com/2015/05/04/tweeted-picture-for-today-are-we-there-yet-almost/","cat":"2015","title":"Tweeted Picture for Today:  Are We There Yet? Almost!"},{"id":"comment-59865","author":"o_k","post":"Dan, if I may ask, what is Anglican theological opinion on the Our Lady of Guadalupe? I suppose it varies among Anglican Communion, but is there a fundamental necessity of opposition, or its potential genuineness is acceptable to some branches of Anglicanism?.","date":"2013-12-15","mins":"10:25 am","url":"https://shroudstory.com/2013/12/15/what-if-there-is-a-breeze/","cat":"science_and_religion","title":"What if there is a breeze?"},{"id":"comment-60195","author":"o_k","post":"Louis, Vincenzo, and everyone: None of the top Shroudies I know (except Father Pfeiffer, who I interviewed) believe that Manoppello houses the Veronica. Due to various reasons, mostly ignorance, prejudices, unbelief, the lack of trust in some sensational claims (understandable), favor of tradition maintaining Veronica in Vatican (Hesemann) and unjustified conviction that there could be only a single ‘miraculous’ cloth, that is the Shroud. In fact, the biggest fault is on the part of Ian Wilson, who in 1991 Holy Faces, Secret Places, after presenting several good arguments in favor of Manoppello, suddenly (and delibaretely it was inconvenient for his Mandylion=Shroud theory, at least partially) rejected this identification based on relatively weak arguments. If you want a proof that Manoppello=Veronica, see this 15th century painting:.","date":"2013-12-16","mins":"7:30 am","url":"https://shroudstory.com/2013/12/15/what-if-there-is-a-breeze/","cat":"science_and_religion","title":"What if there is a breeze?"},{"id":"comment-59980","author":"o_k","post":"Regarding Manoppello, Benedict XVI went there and was received by Father Carmine Cucinelli, and he did not seem to have been impressed with the face I would put it in a different context, the fact that he went there, is rather notable gesture, given the fact that Vatican still maintains (contrary to Pfeiffer and his followers) that Veronica is still in Rome. It is however important to stress that Ratzinger is German, just like Pfeiffer, Badde and Paschalis Schloemer, the biggest advocates of Manoppello..","date":"2013-12-15","mins":"7:49 pm","url":"https://shroudstory.com/2013/12/15/what-if-there-is-a-breeze/","cat":"science_and_religion","title":"What if there is a breeze?"},{"id":"comment-59973","author":"o_k","post":"Louis : O.K. Pope Paul VI : It was mentioned in 30 Giorni years ago. That’s correct, Manoppello has some touch ups and a lot more examination will be required. Still I am not convinced that Paul VI didn’t believe in any private revelations after NT times (do not confuse with the public revelation which ended with the Book of Revelation), but leave it out. As to Manoppello, more unbiased examination is of course welcome..","date":"2013-12-15","mins":"6:37 pm","url":"https://shroudstory.com/2013/12/15/what-if-there-is-a-breeze/","cat":"science_and_religion","title":"What if there is a breeze?"},{"id":"comment-52244","author":"o_k","post":"Contrary to what is often said, the mass, almost industrial production of fake relics in the Middle Ages is only anothe popular anti catholic myth, dating back at least to the times of Reformation and later Enlightment. Just like myths that medieval Church maintained the Earth was flat or “bloody Inquisition” (yes, it committed some crimes, but total number of its victims through 500 years is estimated to be 10,000 15,000, that is on average one heretic was burned every two weeks) those, delliberately distorted stories began circulated, and became facts. Only today, the truth is being revealed. Remember Pars pro toto. The large widespread of relics was due to the fact, they were usually split into more and more tiny fragmenst and distributed around the monarch and churches of the whole Christian world. Because the rule saying “even the tiniest fragment of the relic is equivalent to the whole”, there were often considered in documents as the whole relic, not just part. Thus the large wood of true crosses. Thus about 36 Holy Nails, while actually there were only 3 4 nails that pierced the body, and 6 7 nails used to join the beams of the cross and Titulus (that one is in Colle van d’Elsa in Tuscany). Most of those 36 nails are actually tiny fragments separated from the original Holy nails (which are, according to Hesemann, most likely in Rome’s Santa Croce in Gerusalemme, and in Siena, and I suspect the third one is in Trier). Thus many original Crowns of Thorns, which were actually single thorns from it. And so on. Forgeries of course sometimes happened it would be strange if there had been none. But while studying catalogues of relics, I came to believe that actually most of the relics are authentic, at least in some sense sometimes they are original relics, sometimes tiny portions of them, sometimes simply copies that came in contact with original, and later, with the loss of documents, their true identity was simply forgotten. Deliberate fakes are in my opinion,rather very small minority. Because I believe that most people are actually true, Because I believe that most of the people were actually honest, and only small number of them were fraudsters..","date":"2013-11-21","mins":"5:33 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-60384","author":"o_k","post":"Louis, I could post some papers in the future under my full name, but currently I value my privacy, for some reasons. “Holy Faces, Secret Places” is an excellent book, the problem is that it is a book with a priori thesis, thus Wilson discarded some facts inconvenient to his theory, mainly the Manoppello Cloth, virtually demolishing interest about it in anglosphere, for 20 years. Hesemann’s “Die stummen zeugen von Golgatha” is also an excellent book, for me almost a Bible about the relics of Christ. One can even call Górny & Rosikoń “Witnesses”, illustrations to Hesemann. But it also is not inerrant, his (too) easy dismissal of the Manoppello is one of the errors present in this book. As to the proof that Manoppello=Veronica, I sent it to Dan, I hope he will publish it soon..","date":"2013-12-16","mins":"1:45 pm","url":"https://shroudstory.com/2013/12/15/what-if-there-is-a-breeze/","cat":"science_and_religion","title":"What if there is a breeze?"},{"id":"comment-59964","author":"o_k","post":"Dan, thank you for your answer. I though that greater problem is not the relic as a relic, but rather the claimed Marian apparition, with specific catholic symbolisms. We all know the protestant opposition to the veneration of Mary, less so Anglican. Pope Paul VI believing that there was no revelation after the NT. Louis, I would like to see the evidence for such statement. Like the Manappello cloth if it looks like a painting IT IS A PAINTING. Vincenzo: Manoppello is definetly not a painting (despite some touch ups), at least not any classical painting we know. Your look lead you astray..","date":"2013-12-15","mins":"6:02 pm","url":"https://shroudstory.com/2013/12/15/what-if-there-is-a-breeze/","cat":"science_and_religion","title":"What if there is a breeze?"},{"id":"comment-52813","author":"o_k","post":"O.K. There is no evidence that relics from the passion of Christ were venerated before the discovery of the ‘True Cross’ by Helena in the 320s. There is no evidence of many things, as the written records before the 4th century are relatively scarce, and relics were usually hidden. But if there is a record by Origen that early Christians venerated the so often ridiculed relics of the manger where Jesus was born, so why should we assume that some relics (like the Crown of Thorns) of the Passion, preserved by judeo christian community of Jerusalem were not venerated? Actually the whole discovery of the True Cross by Helena was possible only due to the unbroken tradition among Jerusalem community about the location of Golgotha and the Tomb, and memory that the Cross was buried somewhere there. The relics and sacred places were definetly venerated, even at distance. There are no serious reasons to assume otherwise, despite some regrettable attempts undertaken by some Protestants and rationalists to undermine the Catholic and Orthodox tradition. What do you mean by ‘duly certified’? There was no coherent system of certification I mean that in most cases (most but unfortunately not all), the relics stored in today’s churches and palaces were checked about their provenance, those crappy fakes sold to the ordinary people by some suspicious dealers were usually not accepted, although various abuses happened sometimes. If relic came from Rome, Jerusalem, Constantinople etc., that’s fine. If came from a local craftsman, the church or monastery’s reputation was at risk, especially if church investigation was undertaken. On the other hand, the emperors, kings and duches also wanted to have guarantees of relics authenticity, even though some forgeries were made to increase political prestige. The topic is very complex, but definetly not black & white, but most people were actually honest. Nowadays, similarly, there are also some archaeological forgeries, but overwhelming majority are genuine findings..","date":"2013-11-26","mins":"9:44 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52763","author":"o_k","post":"Charles Freeman : there is no record of Christians venerating relics before the fourth century. Pure nonsense! Acts 19:11 12 (NIV) (http://www.biblegateway.com/passage/?search=Acts%2019&version=NIV;KJV ): God did extraordinary miracles through Paul, 12 so that even handkerchiefs and aprons that had touched him were taken to the sick, and their illnesses were cured and the evil spirits left them. The Martyrdom of Polycarp (died between 155 169 AD), Chapter 18 (http://www.newadvent.org/fathers/0102.htm): The centurion then, seeing the strife excited by the Jews, placed the body in the midst of the fire, and consumed it. Accordingly, we afterwards took up his bones, as being more precious than the most exquisite jewels, and more purified than gold, and deposited them in a fitting place, whither, being gathered together, as opportunity is allowed us, with joy and rejoicing, the Lord shall grant us to celebrate the anniversary of his martyrdom, both in memory of those who have already finished their course, and for the exercising and preparation of those yet to walk in their steps. Origen, Contra Celsum 1:51 (http://www.newadvent.org/fathers/04161.htm): With respect to the birth of Jesus in Bethlehem, if any one desires, after the prophecy of Micah and after the history recorded in the Gospels by the disciples of Jesus, to have additional evidence from other sources, let him know that, in conformity with the narrative in the Gospel regarding His birth, there is shown at Bethlehem the cave where He was born, and the manger in the cave where He was wrapped in swaddling clothes. And this sight is greatly talked of in surrounding places, even among the enemies of the faith, it being said that in this cave was born that Jesus who is worshipped and reverenced by the Christians. So here we have the manger, that Hugh was interested in. And so on. The relics were venerated since the very begining of Christainity. Actually, they were venerated by judaism before Christ was even born: 2 Kings 18:4 (NIV) http://www.biblegateway.com/passage/?search=2 Kings%2018&version=NIV;KJV#fen NIV 10029b He [Hezekiah] broke into pieces the bronze snake Moses had made, for up to that time the Israelites had been burning incense to it. (It was called Nehushtan.) The point here is not that he destoyed a relic (it is nowhere stated that God ordered him to do so), but that the relic was preserved. And now the passage about the power of relics: 2 Kings 13:20 21 (NIV) http://www.biblegateway.com/passage/?search=2 Kings%2013&version=NIV;KJV Elisha died and was buried. Now Moabite raiders used to enter the country every spring. 21 Once while some Israelites were burying a man, suddenly they saw a band of raiders; so they threw the man’s body into Elisha’s tomb. When the body touched Elisha’s bones, the man came to life and stood up on his feet. Charles, can you stop spreading old worn out anti catholic lies from the times of Reformaton and Enlightment?.","date":"2013-11-25","mins":"2:38 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52764","author":"o_k","post":"Charles Freeman : Everyone knew there were fakes around – see Guibert of Nogent’s Treatise on Relics from the early twelfth century when he complained that authentic relics were being driven out by fakes and miracles were being deliberately set up. The problem got much worse after the Fourth Crusade when unscrupulous operators took advantage of the flood of relics coming in from Constantinople to create their own. Pope Innocent III had to insist, in 1215, that bones be given proper reliquaries and it was often said you should not trust a relic as coming from Constantinople unless it had a reliquary with Greek writing on it. Pope Innocent also set up commissions to test whether a miracle was genuine or not – and these commission accounts can be fascinating reading with many miracles thrown out as unsupported by any evidence! That’s actually why we can trust that the relics venerated across Europe up to this day are duly certified contrary to what was illegally sold at some markets in medieval Europe, and is still today: Read this (with a little help of Google Translator): http://www.dziennikpolski24.pl/pl.php/aktualnosci/malopolska/1270170 kup sobie relikwie sw piotra apostola.html still it is very likely that those frahments on sale were actually genuine. Charles Freeman : people began noticing that this was the third head of John the Baptist Or the third fragment of the very same head, see http://www.dailymail.co.uk/news/article 2159578/John Baptist bones theory Scientists claim positive tests 1st century relics.html <a href=\"#comment 52749\" (or,dare I say it, the fourth burial shroud of Jesus) they had come across. Should I give you a full list from my still yet unpublished (44 pages and growing) article? Should I explain that more than a single Shroud could have been used?.","date":"2013-11-25","mins":"3:54 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52816","author":"o_k","post":"I am told that if you ring them up to ask which of the seven heads of John the Baptist is the right one, they will tell you the one in Damascus. Don’t ask me how they know this but they certainly accept that the others are not the real thing. So let’s check those seven heads. Let’s list them according to this CNN article: http://edition.cnn.com/2010/WORLD/europe/08/12/bulgaria.john.baptist.relics/index.html 1. John the San Silvestro in Capite, Italy: The Rome church claims to have John’s head; parts of a reliquary on display date from the 13th century Comment: see http://www.atlasobscura.com/places/the head of st john the baptist at san silvestro in capite The most of the skull, especially the front seems to be a reconstruction, as the eye sockets are filled. 2. Notre Dame d’Amiens, France: John’s head is said to have been brought back from Constantinople in 1206 after Crusaders sacked the city Comment: see http://www.atlasobscura.com/places/the head of st john the baptist at amiens cathedral This is the front fragment of the head, sold to Louis IX by Baldwin II of Constantinople. 3. Umayyad Mosque, Syria: Damascus’ great mosque is built over the site of a church dedicated to John, whose head is said to be contained in a shrine in the prayer hall Comment: No details available. Probably some fragments of the skull, before most of it was transferred to Constantinople via Antioch. 4. Residenz Museum, Germany: The Munich museum claims to have John’s head; one of a number of relics collected by Bavaria’s Duke Wilhelm V in the 16th century Comment: See http://jltraveling.wordpress.com/2013/04/19/residenz museum reliquary collection/ Just like a San Silvestro, possibly some fragments and reconstruction of the rest. 5. Topkapi Museum, Istanbul: Chronicles suggest John’s right arm was transferred from Antioch to Constantinople in 956 by Byzantine emperor Constantine VII Comment: The reamining fragment of Constantinople. No details available so far. 6. St. Macarius Monastery, Egypt: A crypt and relics said to be John’s, mentioned in 11th century manuscripts, were discovered during restoration work in 1969 Comment: No info about the head, as far as I know. 7. Cetinje Monastery, Montenegro: The Orthodox monastery, which dates from the 15th century, claims to have John’s mummified right hand Comment:No info about the head, as far as I know. Seven different heads? Or maybe seven different fragments of the very same head?.","date":"2013-11-26","mins":"10:23 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52825","author":"o_k","post":"O.K. Since when has the CNN been a source that scholars use for listing relics? Are you really suggesting that whenever anyone claims to have part of John the Baptist it is genuine? Charles, if you have better source, than present it to us. Actually, I used more sources, and I know about more relics of Saint John the Baptist, but the CNN’s list was the most convenient to use. I think we must agree to differ. I spent three years researching medieval relic cults and noted how they rose and fell, new relics turned up from nowhere, often without any provenance, there were battles between rival monasteries over who had the true body of so and so or the better phial of Christ’s blood and, with a thousand year gap between the time of Christ and the Middle Ages, virtually no relic had any evidence of its provenance anyway. Yeah, yeah, yeah, we all know this. If you don’t want to believe in authenticity of any of them, you have a right to do so but please, stop spreading old Elizabethan era myths about Catholics and their relics. The exact provenance might have been lost in most cases, but not the most important info its ID, that this piece is a relic of this or that Saint. You do not seem to be aware of the serious theological objections to relics on the grounds that they encouraged the worship of objects at the expense of God. One of the greatest of the fourth century theologians , Basil of Caesarea, put it as follows: ‘ As the sun does not need the lamplight, so also the church of the congregation can do without the remains of the martyrs. It is sufficient to venerate the name of Christ, for the Church is his bride, redeemed by his blood.’ I am Catholic, and those Protestant objections are not of interest to me. I have nothing against Protestants, except that if someone has no tradition of its own, let he not try to destroy the traditions of others. I assume that you don’t live in Europe but if you are over here, do wander around the sacristies of some medieval Catholic churches – you will hardly believe that there were quite that many saints in existence as you will find parts of in the reliquaries and that is after the church cleaned out so many in the late nineteenth century. I live in Europe, and I know that relics were divided into almost infinite fragments. Remember pars pro toto, part for the whole. This was the reason of the great widespread of relics. But not as great, as the widespread of anti catholic lies..","date":"2013-11-26","mins":"12:32 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52841","author":"o_k","post":"Charles: 1) Sources. If you make a modest investment in my book Holy Bones, Holy Dust, Yale 2011 you will find nine pages of sources so you should be able to pick and choose that you want for your own work. Incidentally as you will see from the Yale US website reviews, it was warmly received by the Catholic press. Charles, I am not interested to push my money into your pocket. If you have something against my own conclusions, than present it here. Because in the case of St. John the Baptist head(s), it seems that I did more research, and presented more facts in one hour (and for FREE!), than you in three years. Basil of Caesarea was not a Protestant. It is a perfectly appropriate Christian response to fear that material objects become a subject of worship in themselves although i would not go so far as to destroy relics because of this. And what does this have to do with the authenticity of the relics. You don’t want to venerate relics fine. But preserving historical memory, and objects which might have been contact with real people (no matter whether St. John the Baptist or Michael Jackson) that’s the thing..","date":"2013-11-26","mins":"4:02 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52246","author":"o_k","post":"But what in the end is the point of relics? The point is they are simply our historical heritage like any other museum artefacts. No matter if they are relics of Jesus, Saint Peter, Mother Teresa, Muhammad or Buddha. They need to be preserved. The hateful attempts to destroy the relic undertaken during the Reformation and the Enlightenment, and in the 20th century by sinister ideologies, are nothing but horrible barbarity. The relics don’t have to be venerated but nevertheless should be treated with respect, because of history they tell us..","date":"2013-11-21","mins":"5:43 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52365","author":"o_k","post":"And the swaddling clothes? Wood from the manger? Mary’s breastmilk? * Mary’s breastmilk this is indeed a really hard case to defend. * Swaddling clothes they were part of Byzantine clooection sold to Louis IX and stored in Paris Sainte Chapelle. Another swaddling cloth are stored in Aachen since Charlemagne, they are in my opinion most likely the copies of their Byzantine equivalents. Reminder, disposable diapers are mass produced only since 1948 (see http://en.wikipedia.org/wiki/Diaper#Disposable ). In the past, swaddling clothes were washed and re used, no one thrown them away so easily as today. So it is not impossible that they were stored in Jesus’ family as a reminder of His infant days. * Wood from the manger? Hugh, have you ever been in the countryside? The wooden mangers are often used there for decades, if not longer. The same manger were Jesus was born, was probably still used to feed animals 40 years later, when Jesus was crucified and later raised from the dead. After his ascencion, his mother Mary could still remeber the place and the manger where she gave birth to Her Child, and the manger could be preserved. Hugh, except maybe such extreme examples like Mary’s milk, the ‘absurdity’ of most relics is only an illusion of sceptical mind, lacking any imagination, and tied to a seemingly reasonable (but actually completely irrational) beliefs..","date":"2013-11-22","mins":"5:41 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52844","author":"o_k","post":"Hugh, Charles: As the characters and events in the New Testament have some historical reality behind them,there would have been at one point some authentic relics from the first century. The difficulty lies in tracking those few that have survived the long centuries into the medieval period and beyond. “The relics stored in today’s churches and palaces were checked about their provenance.” Really, how? The older the relic is purported to be, the less likely there is to be any provenance at all. A 19th century bishop’s seal is not, in any sense of the word, ‘provenance.’ “If a relic came from Rome, Jerusalem, Constantinople etc., that’s fine.” No, it’s not. There was, by the 19th century, absolutely no way of knowing where most Middle Eastern relics had come from except by tradition, and usually no evidence of the tradition more than a few centuries further, if that. You still don’t understand the rule? But this is so simple, and reminds well known model in statistical physics, known as Markov chain with a short memory. Suppose there is a relic X of a saint Y (from the very 1st century) in a town known as Godforgotwhere. The exact provenance of the relic X is unknown, except the citizens of Godforgotwhere remeber that they obtained the relic (with all certificates) from Paris. Those certificates from Paris however say nothing where the relic was obtained. However a few hundreds years before, they knew that the relic X from Paris came from Rome, based on further, now lost documents. Next, they in Rome knew that the relic X came from Constantinople, because they had appropriate documents. In Constantinople, they knew the relic X came from Antioch. In Antioch they knew the relic X came from Jerusalem. In Jerusalem they knew the origin of relic X, that it originated from saint Y. So: The trace of relic X Godforgotwhere <— Paris Paris <— Rome Rome <— Constantinople Constantinople <— Antioch Antioch <— Jerusalem Jerusalem <— Saint Y. Godforgotwhere <— Paris<— Rome<— Constantinople<— Antioch<— Jerusalem<— Saint Y. Now all the intermediate steps can be forgotten! The only important info: Relic X of Saint Y in a town of Godforgotwhere <— Saint Y. That's how it works in practice. Unless one link cheats the ID of the relic is well saved. And the results see Shroud of Turin, Sudarium of Oviedo, Tunic of Argenteuil. The scientific examinations revealed that they are almost for sure genuine, there is no way to fake them..","date":"2013-11-26","mins":"4:17 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52318","author":"o_k","post":"On the whole I side with Charles Freeman and think that it is vastly improbable that any single artefact currently residing in the various churches and archives of Europe was ever in contact with any member of the holy family. Those are the doubts most people have at the begining, but if one looks at it deeper, then he discovers that this was only his initial misconceptions. Why vastly improbable? Becuase we are used to the fact that most of the items belonging to us will not survive the trial of time? But actually this notion is flawed. In today’s modern world, few care about preserving their own items, they are considered worthless, and eventually end in a trash. And we think the same rule applies to the ancient relics of the Holy Men & Women who once walked on this Earth. But this is not true. The precious items which belonged to them, or their reamins, were considered the most precious treasures of their followers, and they were carefully maintained and handed through generations, with tradition (often only by word of mouth) what, and whose actually they were. Documents got burned, details became mixed and confused, legends originated but the most important information, whose this relic was, was still preserved, up to this day. Some relics (like the Shroud or Holy Tunic of Argenteuil) were buried and hidden with only some message, some letters describing their origin nad history, only later to be rediscovered. Hugh you greatly underestimate the power of human tradition. Valuable items can really be preserved through centuries or even millenia if there are only people devoted to store and guard them (instead of destroying them due to fanatical zeal), even risking their life. The sceptics approach, in fact, can be even treated as a some kind of insult to their notable sacrifices. While deserving the greatest honor, the guardians of the relics are instead treated as fraudsters or gullible people. It is easy to say: “I don’t know where this thing came from, so it must be false”, much harder to give it a trust and spend some effort trying not only to preserve it, but also find its real history. Some were certified on the basis of possibility rather than certainly. A wooden beam in Jerusalem: a piece of the cross; it’s not impossible. But what about a wooden beam excavated at the ruins of the ancient pagan temple (built delliberately to desecrate the place which Christian tradition maintained the execution and burial of Jesus was performed there) with attached Titulus describing who and for what crime died on this cross? Not only it is possible, it is actually very likely! Our ancestors were not so stupid and naive, as we think, actually, I am more more and convinced of that, they were much smarter, reasonable, down to earth than we are. What about other relics, preserved by judeo christian community of Jerusalem? Crown of Thorns, first mentioned in 409 AD, Holy Nails, Holy Tunics and so on? The researches of the Shroud of Turin, Sudarium of Oviedo, Tunic of Argenteuil, suggest, if not prove, that they are very likely to authentic. So if those were preserved, why should I assume others were not. Read preface of Górny’s Witnesses to Mystery. And have more faith not religious, but in humans. Http://en.rosikonpress.com/dzial 51/towar karta 150/Swiadkowie Tajemnicy.html.","date":"2013-11-21","mins":"7:40 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-215810","author":"o_k","post":"Mario, I have a question for you. As you know , the classic Wilson’s theory mantains that the Shroud in mandylion form was folded in tetradiplon form, essentially the way on the picture below: This corresponds with several depictions of Mandylion in extended (wider than longer) form, e.g.: http://tinyurl.com/qfbaj2z as well as famous Abgar icon: But the problem is that the dimensions of the Shroud folded this way are approx. 110×55 cm. But the Sainte Chapelle Mandylion frame, brought from Constantinople had roughly 60×40 cm dimensions; this far too small for such representation. Http://www.sindonology.org/sainte chapelle.shtml#ans:small or large What is your opinion about that matter?.","date":"2015-12-07","mins":"1:03 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215780","author":"o_k","post":"I see your point, Mario, but I think it is Colin’s contention (and I agree with him) that if anybody at all knew what the image actually looked like, it would have become common knowledge, or at least common legend. “It would have leaked”, says Colin, and I think he’s right. IT HAS LEAKED!!!: If you really want to see what my face looks like, I am sending you this linen cloth, on which you will be able to see not only the form of my face, but the divinely transformed state of my whole body. Codex Vossianus Latinus Q69..","date":"2015-12-07","mins":"5:29 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215902","author":"o_k","post":"Mario: If you were holding a piece of cloth of 110 cm, it would not look that way. As a matter of fact, I have a piece of cloth the size of the TS and folded as described at http://www.sindonology.org/sainte chapelle.shtml#ans:small or large (that is to fit in the reliquary of the Sainte Chapelle, 60x40cm) , and when I hold it, it looks like on this icon. The folding proposed by Wilson would not fit in the reliquary of the Mandylion as described (in size) by the inventories of the Sainte Chapelle. The problem is that when folding the Shroud the way described at your website (“One of the simplest way is to fold the Shroud twice widthwise (giving four layers), which gives a folded width of about 28 cm, and thrice lengthwise (giving eight layers), which gives a folded length of about 54 cm. This folded Shroud has a total of 32 layers, for a thickness of around 1.2 cm (32× 0.39 mm ≅ 12.48 mm), but because a folded cloth has some fluffiness, it will be between 2 to 3 cm thick, depending if it is bound in a trellis or not. The folded Shroud is 54 cm long by 28 cm wide, which fits nicely in the reliquary of the Mandylion (about 5 cm deep, 60 cm long, 40 cm wide), leaving a few centimeters all around the Shroud at the bottom of that box, and enough space to attach a trellis lengthwise.”) you don’t get the face visible. But the facial image of Mandylion was publically displayed at least in 944 (and perhaps in 1032)! Symeon Magister recounts that while Constantine could see the faint image in its details (eyes and ears: ophthαlmoύς κaι oτα) his two brothers‑in‑law and rivals for the throne could barely make out an outline, see https://shroudstory.wordpress.com/about/acheiropoietos jesus images in constantinople the documentary evidence/ Document II. And take also into account the Jackson’s study on foldmarks: http://www.shroud.com/pdfs/ssi11part4.pdf The extended, wider than longer portrayal of Mandylion, is one of the most often featured characteristics of it (although not unique), see the gallery in Wilson’s presentation: http://www.shroud.com/pdfs/wilsonvppt.pdf See also the Templar Mandylion from Breton Calvary: http://www.cirac.org/infos uk/shroud.htm There are perhaps ways to fit the Mandylion face into the Sainte Chapelle reliquary (something similar to the way below), but they are quite bizarre, and do not correspond to the known depictions. How do you reconcile the dimensions of Sainte Chapelle reliquary with known depictions of Mandylion? In my opinion, this is the only serious argument against the Mandylion Shroud identity hypothesis..","date":"2015-12-08","mins":"12:17 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215916","author":"o_k","post":"Mario: I have checked Gregory Referendarius’s sermon from 944, and Constantine Porphyrogenitus’ The story of the Image of Edessa, and they do not specify whether the mandylion was publically displayed in 944 AD. When I return back to m house I will check other materials. Meanwhile, I await your comment for that illustration: http://tinyurl.com/zpozqbb Chronography of John Skylitzes, cod. Vitr. 26 2, folio 131a.","date":"2015-12-08","mins":"2:08 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215812","author":"o_k","post":"There were some claims: https://shroudstory.com/2014/11/08/another st louis paper available the halo study/ but I do not see the matter conclusive (see my criticism: https://shroudstory.com/2014/11/08/a detailed response to the halo study/ ).","date":"2015-12-07","mins":"1:11 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-56644","author":"o_k","post":"The most progressive and humanitarian judicial system of its times..","date":"2013-12-05","mins":"7:27 am","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","title":"You need to read both lines of the headline"}]
