[{"id":"comment-52988","author":"o_k","post":"Hello, Barrie, sorry that I post here, but I am interested in obtaining those STURP papers listed here: http://www.shroud.com/78papers.htm Is there any fromal procedure, required, some reference or credentials needed?.","date":"2013-11-27","mins":"6:30 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall"},{"id":"comment-52993","author":"o_k","post":"I have sent the message..","date":"2013-11-27","mins":"7:10 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall"},{"id":"comment-214354","author":"o_k","post":"I asked you about an event horizon in general, not black holes (which it seems you also understand little). I don’t need metaphors, I need concretes..","date":"2015-11-07","mins":"10:27 am","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-214347","author":"o_k","post":"Isabel Piczek described the image as an event horizon. Scientifically, the most commonly known event horizon is the observable last gasp of matter as it is sucked into a black hole. John, one simple question. Do you know what an event horizon in general is?.","date":"2015-11-07","mins":"7:14 am","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-214355","author":"o_k","post":"The often parroted claim “extraordinary claims require extraordinary evidence” makes no sense. Every claim on truth, whether trivial or ‘extraordinary’, should be backed by sufficient evidence. Of course, but the point here is different. What evidence do you need to show that there is an alien artificial megastructure orbiting some star? Do you think that mere peculiar light curve is sufficient evidence for such a bombast claim? Or not?.","date":"2015-11-07","mins":"10:29 am","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-78322","author":"o_k","post":"The camels of Abraham. The classical example of clutching at straws and looking for any alleged problem, just to undermine the credibility of religious tradition. See http://en.wikipedia.org/wiki/Camel#Domestication Dromedaries may have first been domesticated by humans in Somalia and southern Arabia, around 3,000 BC, the Bactrian in central Asia around 2,500 BC,[14][62][63][64] as at Shar i Sokhta (also known as the Burnt City), Iran.[65] Abraham lived circa 2000 1800 BC so he could have possessed camels. The only problems are those the sceptics have with religion. I am not Biblical literalist, but I believe that Biblical stories from Abraham onwards are essentially historical..","date":"2014-02-11","mins":"10:46 am","url":"https://shroudstory.com/2014/02/11/abraham-and-his-camels-the-shroud-of-turin-how-did-we-get-here/","cat":"other_blogs","title":"Abraham and His Camels & The Shroud of Turin. How did we get here?"},{"id":"comment-78451","author":"o_k","post":"Http://en.wikipedia.org/wiki/Israel Finkelstein The one guy who thinks that because the Temple of Solomon was not found anywhere outside the Temple Mount (where archeological excavations are impossible due to the political reasons), indicates it never existed..","date":"2014-02-11","mins":"7:49 pm","url":"https://shroudstory.com/2014/02/11/abraham-and-his-camels-the-shroud-of-turin-how-did-we-get-here/","cat":"other_blogs","title":"Abraham and His Camels & The Shroud of Turin. How did we get here?"},{"id":"comment-97185","author":"o_k","post":"Beyond the scorch hypothesis,I think that this new paper will give some interesting questions about the TS body image. We look forward to it..","date":"2014-04-06","mins":"5:02 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-78446","author":"o_k","post":"We thank Israel Finkelstein and Thomas E. Levy for insightful comments that helped improve the manuscript. Truly, just the mention of Finkelstein says everything to me about thecontext and the purpose of such reports….","date":"2014-02-11","mins":"7:33 pm","url":"https://shroudstory.com/2014/02/11/abraham-and-his-camels-the-shroud-of-turin-how-did-we-get-here/","cat":"other_blogs","title":"Abraham and His Camels & The Shroud of Turin. How did we get here?"},{"id":"comment-183070","author":"o_k","post":"Dave B: OK: I need no one on this web site to tell me how to write my stories. People may either accept them or reject them and I don’t mind either way. Fine, I understand, nevertheless I would like to show that there may be another approach to the problem. And I prefer to gradually introduce it, so to give people chance to understand it themselves. I have already indicated that Creation in Gen II is an extremely ancient story, it was probably based on some kind of oral tradition.[…] Nevertheless, like all primal mythologies, it has its own particular truth which mainly operates at the symbolic and psychological levels, and which spoke to the people then and can speak to us now. However, I see it as essentially a primitive attempt to explain the human situation, which works primarily at the symbolic and psychological levels, and as an attempt to explain the origin of evil. As far as I know, from your own words, you are a Catholic, right? If I may ask you a question: do you believe it? Do you believe that it explain the origin of evil? I do not demand from you belief in the story taken literally, like Biblical fundamentalists do. Nevertheless, the main question is, do you believe it? Historical and scientific accuracy is actually irrelevant here – I wrote that this story shouldt be analysed in neither scientific, nor historical, but mythical perspective. One remark: the fact that this story is a myth, doesn’t make it just moralistic fiction..","date":"2015-01-13","mins":"2:16 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-183553","author":"o_k","post":"PHPL: What I notice concerning this debate is that believers , either willingly or not, are in a position that they have to speak on behalf of God. Does God approve of what they say concerning him ? Do they get it right or is it an endless irrelevancy ? There is still the Bible and Catechism to confront with. God is not silent in this debate, and has a Word to say. Aljones909: Again, it’s astonishing the contortions theists will engage in to deny ‘the problem of evil’. If any theists are still following this I’d ask one question: Do you find any of O,K.’s explanations credible? Please study them. Infinities, broken fingernails and all. It’s astonishing how much atheists horizons and imagination are limited. Aljones are you afraid of infinities? Besides, this is not the explanation of “the problem of evil” yet. It is just an auxiliary argument that total elimination of evil in this world is pointless and futile. That you cannot make this world perfect. “As the residents of each of these worlds do not know the alternatives, their perception of evil is actually the same. Thus elimination of some forms of evil (or we can say forms in which the evil manifests) won’t make the world any better.” This is the most ludicrous nonsense – and it’s easily testable. A simple comparison: Cambodia 1975 1979 versus Denmark 2010 2014. Bringing such examples shows you still don’t understand anything Cambodia and Denmark are within the same world. So anyway, different direction. Assume that you want to eliminate evil from this world, and you have divine powers to do so. So you have eliminated childhood brain cancer and other evils. You have eliminated earthquakes, diseases, ability to murder, ability to rape, ability to take bribes, to steal candies, and even broken fingernails. No ability to make any physical harm, nor any crimes. You can do that. Fine. But I would like to hear your answer on those two questions. Have you eliminated all evil? Do men feel happy in your ‘perfect’ world?.","date":"2015-01-15","mins":"2:58 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-183076","author":"o_k","post":"This may be helpful: http://www.vatican.va/archive/ENG0015/  P1 C.HTM.","date":"2015-01-13","mins":"2:27 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-183224","author":"o_k","post":"You can’t admit there is a qualitative difference between millions of cancer sufferers screaming in agony and a broken fingernail? Your god, his mind filled with infinities, thinks it’s much of a muchness. Is that where rationalising theism leads you? It is something different. I don’t say that in our world broken fingernail is as much great evil as cancer (because obviously it isn’t) but it is evil anyway. Another analogy. Suppose we can give weights to different kinds of evil (which is not true in general, yet allows us to discriminate between “greater” and “lesser” evils). Let’s assume also that God is infinitely good by definition (so we can assign God +∞ symbol). Let’s assign number 0 for those things that are morally neutral, that they contain no evil at all. Then let’s assume that the most terrible evil in this world is childhood brain cancer. Let’s assign to it a number 10. In this scale we can assign 1 for broken fingernail. So we live in the world with “the range of evils” from 10 (the most terrible evils) to 0 (no evil). Yet in theory there could have been another world where there happens Evils More Terrible than Childhood Brain Cancer (EMTCBC). Let’s assign for EMTCBC 100. So in this world relation between EMTBC and childhood cancer is like relation between childhood cancer and broken fingernail. Then let’s consider another hypothetical world, where there is no childhood cancer, and the greatest evil is a broken fingernail. So we have 3 potential worlds for God to create: a)World with EMTBC as the most terrible evil. Scale of evil: 100 to 0 b)World with childhood cancer as the most terrible evil. Scale of evil: 10 to 0 c) World with a broken fingernail as the most terrible evil. Scale of evil 1 to 0. At first glance seems that the world a) is more terrible than b) which is also more terrible than c). Yet there is no difference between 100, 10 and 1 in comparison to God’s +∞ ! And each of this worlds can be rescaled so the relative scale between the most terrible evil in each of them will be always from 1 (the most terrible evil) to 0 (no evil at all). As the residents of each of these worlds do not know the alternatives, their perception of evil is actually the same. Thus elimination of some forms of evil (or we can say forms in which the evil manifests) won’t make the world any better. David Mo: I repeat you: I have put here five possible solutions to the problem of evil and God. Do you have any evidence in favour of one of them? No. Neither of those 5 “solutions” may be true, as they are not the only ones possible. There is at least a sixth solution. My “limited perspective”? You cannot explain the contradiction of God and evil.[…] But the problem of contradiction between God and evil is different because it implies facts and logic. Facts: the existence of sufferings. Logic: contradiction between good and evil. We have no means to test any hypothetical solution Neither your facts, nor your “logic” are complete. And as they are incomplete, you cannot say there is a contradiction between omniscient, omnipotent, omnibenevolent God and existence of evil. Aljones909: What (or who) do you think is the source of this evil? That’s the question! We can say: definitely not God. Then seek for an answer: who?.","date":"2015-01-14","mins":"9:58 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-184119","author":"o_k","post":"Aljones909: The reference scale is our own conscious experiences. The problem is that this is only your subjective scale. You don’t have any objective scale. You simply have no comparison with other worlds that could have been potentially created by God in some of which there could be evils in comparison with childhood brain cancer would be minor discomfort, while in others too tight underwear might be the most “extreme”evil. Yet, from there would be still “terrible suffering” from the perspective of entities living in such world. I challenge any theist to tell me they can’t distinguish between an agonising toothache and the discomfort of too tight underwear. This is something entirely different which I described many times. It is not about greater and lesser evils, it is about “extreme”, “moderate” and “minor” evils within the same created world. If you’re suggesting that an omnipotent and omniscient god can’t create beings that are free of moral defects then one thing is certain Yes he can – robots without free will programmed to be “good”.Perfect world according to some atheist thinkers realised in 20 21st century in Soviet Union, Maoist China, North Korea and so on..","date":"2015-01-17","mins":"6:03 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-184004","author":"o_k","post":"Aljones909: There is a sad fact about this horrible, interim world that theists should note. Most people are happy. Yes. So you see this world is not as bad, as terrible that some guys complaining about the problem of evil would cry. But this does not mean that people would be happy in the “perfect” world I suppose rather opposite that had we lived in such a “perfect” world no man (nor woman) would be happy. David Mo: You persist in doing incorrect questions. Incorrect? Or maybe contrary, correct, but just inconvenient for you? Neither Aljones nor I are “perfects” and we don’t intend to imagine a “perfect” world. The problem implied as far as I am concerned is the incompatibility between a perfect God and the existence of the extreme evil and suffering. So if you don’t insist on creating perfect world, you should not insist on the “problem of evil”. Because this (apparent) paradox would be still present if there is ANY evil and suffering in this world. As I am trying to show, you cannot objectively state what is “extreme” and “moderate” or “minor” evils. The terms “extreme”, “moderate”, “minor” does not describe absolute, but relative properties. You can of course describe evils as “greater” and “lesser” and set them in order, but to state that some of them are “extreme” or “moderate” you need reference scale. You and aljones do not understand that and thus fall in another fallacy. Had some now “extreme” evils been eliminated by magical intervention, other, lesser evils would become “extreme”. If one likes to play with such “rationalists'” sophisms, he needs to know precise meanings of what he states. You can ask to the parents of a child unexpectedly healed of a cancer of brain if they are happier. They will look at you as if you were mad. Yes. However the point is that if you heal a child from brain cancer you will make the world better. But not necessarily if you magically eliminate brain cancer from this world. Catholics believe that God does intervene in this world, performing miracles curing diseases for example. There are hundreds of such instances verified by Vatican and many more unverifed. I suppose you don’t believe that, but assume those reports are true. Can you then state that God does not interest about the sufferings of His poor children on Earth? What I (and you) don’t understand is why this perfect god don’t gives us this perfect world directly without doing suffer innocent children. No David Mo, I understand why. It is you that don’t understand and thus don’t understand the Christianity at all. I don’t know if men would feel happy in a “perfect” world without any evil, but if you are a Christian, you ought to believe that. Jesus of Galilee had promised a Kingdom of eternal bliss and the Christian churches promise the Heaven for the good men and women at least. Serial killers and brain cancer will not exist in this world… I suppose. Yes. Could perfect God create a perfect world? Of course. Both Paradise described in the Book of Genesis and future promised Kingdom of God are such worlds. But why our current world is not such one? Because there is one minor problem… To help you realise what the problem is I want to ask you another question. With divine powers you can eliminate brain cancer easily but how would you eliminate serial killers (and other criminals)?.","date":"2015-01-17","mins":"5:58 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-184302","author":"o_k","post":"You go on: “too tight underwear might be the most ‘extreme’ evil. Yet, from there would be still ‘terrible suffering’ from the perspective of entities living in such world.” The idea you’ve presented above is plainly nonsensical. See Denmark/North Korea. Nonsensical? Give them a world where the most terrible suffering is too tight underwear + long enough lifespan, so that they can feel it. You will see, that from their perspective, the suffering would be no smaller then in concentration camp in (unknown for them) North Korea. They will be complaining the same melody, about terrible and inhumane conditions due to the too tight underwear. On the contrary people living in North Korea can be extremely happy if their Supreme Leader orders them to be so. But you don’t claim that this is perfect world,don’t you. “Yes he can – robots without free will programmed to be “good”.” The christian heaven will be populated by robots? No by perfect entities with their own free will. Angels (those who remained faithul to God) are perfect entities, not robots and have their own free will, humans can be also such like them..","date":"2015-01-18","mins":"12:28 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181343","author":"o_k","post":"Hello Dave B! I had resolved to contribute no longer to the web site, as I have too often found it an exercise in fruitless frustration, but had relented in the case of this particular off topic. Don’t get discouraged! Your views are always welcome. Discussion with hard minded may always be hard, and bringing some frustrations, yet may bear fruits particularly to others. Sharing your vast experience and life gathered wisdom is always appreciated..","date":"2015-01-04","mins":"5:14 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181242","author":"o_k","post":"OK: Murder of children is the most awful and striking example of Evil. You can add sexual abuse if you want. I consider it a kind of torture. I’m not interested in casuistic. So fine, David Mo. Having been in the place of God, wou would make murdering and sexual abusing of children physically imposible. Fine, I understand your motives. But evil doesn’t end here. You can do harm against children also in other ways. What about brutal spanking of children? Or psychological intimidation of children? Would youmake them physically impossible too?.","date":"2015-01-04","mins":"6:26 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180997","author":"o_k","post":"Once again we see non believers hypocritical cries that God is not perfect and that they, to their satisfaction, have found an unresolvable contradiction negating existence and/or atributes of God. But of course their conviction is as always, totally unfounded, and based on false premises. So David Mo, as you seem to know good and evil, may I ask you a few questions? You wrote: An omnipotent god could maintain the absolute freedom of will without the freedom to kill innocent victims. There are a lot of things we want to do and we cannot do. We are limited creatures. Why we have no limit to killing children? Why God impedes to us a lot of deeds and not the killing of children? If God doesn’t do so is because he wants the absolute evil. As you consider yourself wiser than God, having been in His place, you would impose absolute ban on killing children. No one is physically able to kill a child. Fine, you prevented great evil of child murders. But evil does not limit to the murdering of innocent children. You can do other evil deeds against children. What about sexual abuses against children? Being in the place of God, would you make them also physically impossible?.","date":"2015-01-03","mins":"6:36 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181457","author":"o_k","post":"Very pretty comment but it seems you have not read my points 1.a.3, 2.a. And 2.b. And you don’t answer my questions. I suppose this is a way to resign from the debate. David Mo, your questions and the whole approach to the problem is extremely naive like most of the non believers. You think you found contardiction between God attributes but this contradiction is only in your mind. I could explain it, but first I urge you to answer my questions: Having been on the place of God would you make doing evil physically impossible?.","date":"2015-01-05","mins":"8:29 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181619","author":"o_k","post":"David Mo, aljones909: “Evil” is a very extensive concept without precise boundaries. I see you are slowly withdrawing. First you demanded that God should not allow evil at all (“The problem is philosophic: the concept of a god which is good and creates (or tolerates) the evil is an oxymoron.”). And now you claim you cannot say precisely what is evil and what is not as it has been expected, because you are not omniscient contrary to God, and cannot predict all consequences of all events, apparently bad or good. No matter, let’s go further: I suppose I wouldn’t be specially worried about malicious hearsay, blasphemies, kicks in some arses and so on. But I would be specially concerned with the extreme evil and the suffering of children. I suppose that a more efficient guardian angel would suffice. So blasphemies, spreading hearsay, some minor violence, yes but suffering of children no. So you are introducing some new ethical standards, new reality, where some bad deeds are allowed (physically), while others not. Are you sure those are certainly “lesser evils” than children sufferings? So children cannot suffer, but adults (and children grow up of course) can. Nice concept of equality and justice. Some people categories must suffer, while others are saved from that. Nice segregation. Most normal humans, if they had knowledge of the situation and they had the power to act, would have intervened in a heartbeat. In the immortal words of Christopher Hitchens “heaven watched on with indifference”. So what Heaven should have done? Sent a bolt of the blue and some angel police or peaceking forces intervention? Now is your turn: Why God needs the extreme pain of children? The answer would become clear when you realise something. And to help you realise this, one another question, my dear unbelievers. Do you want to compulsory enforce no evil on this world? Making all harm, doing all bad things physically impossible? Would such a world have been better?.","date":"2015-01-06","mins":"8:31 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182023","author":"o_k","post":"Thomas, there is an answer to the problem of all powerful, all knowledgable, all good God. But before I will tell you why there MUST be evil on this world, someone must answer my question that unbelievers here try to avoid, that is “Do you want God to make ALL harm (no matter whether human inflicted or “natural”) physically impossible? Yes or No?”.","date":"2015-01-08","mins":"5:23 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181652","author":"o_k","post":"Rer route a few neurons in Herr Fritzl’s brain? How about a stroke after his first rape conviction in 1967? Nice methods you’d like to be applied in every such case. Do you think a world with childhood brain cancer is better than one without childhood brain cancer? I would like to abstain from the answer on whether the world with childhood brain cancer is better than the world without it. It is not that simple as some people think. Anyway my question was about absolute properties. Do you want God to make all harm (no matter whether human inflicted or accidental) physically impossible?.","date":"2015-01-06","mins":"12:47 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182021","author":"o_k","post":"Aljones909 My opinion is that the christian god does not exist. The question therefore makes no sense. What you seem to be repeatedly evading is the charge that the christian idea of god is utterly incompatible with the amount and varieties of evil we see. You also failed to explain why the christian heaven can be free of evil while (presumably) populated with free willed entities. All this dancing around without a straight answer leads me to think you are not terribly comfortable with the topic. If you think a world with childhood brain cancer is better than a world without childhood brain cancer then please explain WHY. The basic question YOU evade: Do you want God to make ALL harm (no matter whether human inflicted or “natural”) physically impossible? Yes or No? We cannot go any further until someone gives an answer to that question..","date":"2015-01-08","mins":"5:18 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182141","author":"o_k","post":"David Mo: You propose to resign to our reason and I propose to use it because I think to resign to use the critical reason is a dangerous thing. It is the foundation of tyranny (physical or mental tyranny Shut up with this nonsense and insinuations, and instead answer that question: Do you want God to make ALL harm (no matter whether human inflicted or “natural”) physically impossible? Yes or No?.","date":"2015-01-09","mins":"4:21 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182352","author":"o_k","post":"Dave: Do you get the point of it all, yet??!! I’m talking about the real world here, not some artificial medieval mental construct of it! Dave, I understand your point, but I think the approach for the problem should have been a little bit different. Could God create a perfect world without pain, harm and suffering? Of course he could. He is not a human engineer limited by the laws of nature. Recall yourself first chapters of Genesis. The Paradise described there was exactly such world, and so is expected messianic Kingdom of God. The problem lies elsewhere. Once again I would like to refere you to Genesis….","date":"2015-01-10","mins":"6:20 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182202","author":"o_k","post":"Of course there should be: You cannot objectiely state what is “extreme” evil and what is only “moderate” evil..","date":"2015-01-09","mins":"1:38 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182201","author":"o_k","post":"No one gave a simple answer yes, or no. Nevertheless, as I am moderately satisfied with the answer, I can go further. David Mo: There is a misunderstanding here. Aljones and I don’t postulate the elimination of any evil There is no misunderstanding, but your attempts to mislead and distract people from what you HAVE actually said. I remind you: January 2, 2015 at 3:16 am The relation between science and God is not a problem. Science works pretty well without the God hypothesis (you know, Laplace). And the believers in God (most of them, at least) have no problem with science. The problem is philosophic: the concept of a god which is good and creates (or tolerates) the evil is an oxymoron. Here you stated that the all good, all powerful God tolerating evil (ANY evil) is a contradiction => such God (esencially the Christian God) doesn’t exist. And that’s completely wrong. But the appalling effects of some extreme forms of evil, that are two different things. You can objectiely state what is “extreme” evil and what is only “moderate” evil. From the God’s all powerful perspective all, even the most terrible evils of this world may be just “moderate” and very easy to fix and amend in the future world. That’s the first fallacy you made. In my metaphoric supposition of a “guardian angel” (some inhibitory mechanism against aggression), this one will be able to stop the criminal offender when he has started (but not accomplished) the act. So, the evil exists. It is the criminal intention. And the freedom for evil is preserved. If the problem is preserve both freedom and evil. A “guardian angel” which would make perpetrating crime impossible… Your naivete is extreme… Like all those fools who don’t even consider what they postulate. I suppose you haven’t read this book? It came to my mind immediately when you formulated the problem http://en.wikipedia.org/wiki/Observation on the Spot Wizja Lokalna by popular Polish s f. Writer Stanisław Lem. On margin I must say that he declared himself atheist, for similar reasons that you claim (the imperfect world) although actually his relations towards religion were extremely complex and equivocal (for example Catholic priest was present at his funeral). Here you have a part of the summary of that book: The other state, Luzania, constitutes the most significant treatment of the topic of an “ideal state” in Lem (and many would argue, in all science fiction). Their most prominent accomplishment is the creation of “ethicsphere” (compare “atmosphere”). They have produced huge numbers of molecular sized nanobots called “bystry” (“quickies” in English) that serve to control matter in the ‘quickated’ areas. The primary function of the ‘quickies’ is the enforcement of the laws of ethics as physical laws (hence the word ethicsphere). Hence, it is a physical law in Luzania that it is not possible to hurt an individual physically. If you try to strike your neighbor, your hand will be stopped by the suddenly increased air viscosity, (although you will not be hurt either). If you try to drown, the water will push you out. Doing non physical harm, such as by pestering, criticizing, and otherwise mentally tormenting people is still possible, although in such a case the ‘quickies’ would probably help the victim to walk away from the attackers. There is a large protest movement in Luzania of people who want to end the ethicsphere, and a major element of their activities is trying to inflict harm on anybody just to prove the possibility of doing so, but they have not succeeded yet. Here you have your “ideal state” where evil is apparently eliminated, and making harm to any living entity impossible. Unfortuantely this turns out not to be a paradise but hell instead. A terrific totalitarian state with totalitarian control over its citizens. One of the most terrific prisons you can imagine. That’s your ideal world. That’s ideal world you unbelievers demanded God to create. But this does not mean that ideal world is impossible. No. There is one another element Lem missed (or didn’t look at it in a proper way). I can say that Hugh is close to answer. He mentioned it in his recent post but didn’t follow it so far..","date":"2015-01-09","mins":"1:29 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182434","author":"o_k","post":"Dave: I understand your view, yet I don’t consider this picture complete. I sense it misses some crucial element. Once again I recommend going back to Genesis myth. And analyze it in its proper, mythical perspective. This could only be possible if the innate property of adaptability was implanted in them. It required a struggle between competing individuals for dominance, and the dissolution of those unable to adapt, in fact a “selfish gene”. This pervades all of Creation, is the product of a wise God, but has consequences for the problem of evil. For God made not death: neither hath he pleasure in the destruction of the living. For he created all things, that they might have their being: and the generations of the world were healthful; and there is no poison of destruction in them, nor the kingdom of death upon the earth: It’s not a “selfish gene” created by God to boost evolution the principal source of the problem. Or in other words: He didn’t used this application as an optimal solution, knowing all its side effects. The way the world and the entire universe was created is evidently the best solution that is possible to be created. Had it been true, the afterlife messianic world should be no better, despite God’s promises. Perhaps, due to circumstances THIS world has created in the best way it could have been. But what were those circumstances, so even the Almighty decided to engineer the world in this way? What was the source of His difficulties? However, the problem only occurs because of the importance they all give to anthropocentrism Maybe right… I would liken David Mo and other such commentators to the comforters in Job, or as in my story, to idle uninformed sidewalk oglers who ask “Why didn’t you do it differently?” Comforters in Job? I sense they deserve different, far worse counterparts….","date":"2015-01-10","mins":"5:07 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181792","author":"o_k","post":"Ajones909: I’m suggesting that there are an infinite number of ways an all good, all powerful deity could act to prevent egregious evils. No doubt, but you still miss the issue of the problem. And it is not about making us different monkeys or more feminine. What withdrawal? The concept of God is incompatible with the existence of evil. No. Only your way of thinking is incompatible with the proper understanding of the problem. It is like explaining quantum mechanics in terms of classical physics. Demagogical arguments about suffering of poor children completely miss the point. Thomas: Maybe God is an incredible force for good and peace, who strives for perfection, but for whatever reason (evil forces, or “interference” between realms: like radio interference) cannot achieve it on our physical earth. You are coming closely to what I want to show, but you still lack one key element. Recall yourself Garden of Eden story, as well as temptation of Christ (and maybe Job as well). Of course non believers don’t understand the essence of Christianity. And the same fundamental question to all: Do you want God to make all harm (no matter whether human inflicted or “natural”) physically impossible? Yes or No? Without answering this we cannot go further..","date":"2015-01-07","mins":"5:46 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182435","author":"o_k","post":"The mythical story of Garden of Eden is present in the Holy Bible not without a reason, and not just only as imaginative, legendary attempt to explain the beginnings of humanity, or merely a moralizing tale….","date":"2015-01-10","mins":"5:12 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182744","author":"o_k","post":"Aljones909, you still don’t understand. By “external intervention” that means by some kind of Higher Power, or essencially divine intervention. There still will be evil in the world as a whole, but in different forms, and its total amount in the Universe won’t change. What we can do is to lessen the effects of evil in our limited, human scale. Giving aid to poor, hungry people is a good thing, but turning stones to bread, and thus total elimination of hunger is a diabolical temptation..","date":"2015-01-12","mins":"2:50 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182360","author":"o_k","post":"David Mo: Sorry, but in this novel (Regreso a Entia>/i> in Spanish), he is not speaking of God but he is making a parody of the communist system. This is not only a parody of the communist system. Although not speaking about God, he discusses the disastrous effects of playing God, an attempts to eliminate evil. This topic in fact appears in many of his stories. And “ethicsphere” doesn’t differ at all from your conception of “guardian angels” introducing permament police state against aggression. It is exactly the same. Both stories deal with failures caused by human limitations. Good ideas with bad means. Yes. And complete elimination of children suffering for example, is also a good idea… We are not speaking of finite men and totalitarian systems but about a perfect entity called “God”. We are speaking about finite men, I can assure you. About finite men like you who considering themselves wiser than God would like to dictate Him how He should have organize this world. Isn’t it what you and aljones909 are doing? I have said “any evil” nowhere, with or without capital letters. I’m sorry if my sentence confused you. Don’t try to deceive us! It was obvious what you meant, and your sneaky attempts to persuade us to you meant something different than what you meant won’t help you. You stated (January 2, 2015 at 3:16 am): “The problem is philosophic: the concept of a god which is good and creates (or tolerates) the evil is an oxymoron.” Of course “the evil” means “any evil”. Later, when you realised your mistake (that’s I suppose why you held back from answering my question ) you tried to mislead us that your position was different: Aljones and I don’t postulate the elimination of any evil, but the appalling effects of some extreme forms of evil, that are two different things This is the most absurd sentence I have read to you. Every moralist knows that good and evil are gradual attributes. Aljones909: “You cannot objectiely state what is “extreme” evil and what is only “moderate” evil.”. Extreme evil is childhood brain cancer. Moderate evil is when I get soap in my eye. It is nice to see that we have such moral authorities knowing better than God from His throne what is good and what is bad, what is “extreme”, and what is “moderate” evil in the cosmic perspective… So elimination of only some forms of evil? So some other forms of evil can be tolerated (by God I assume)? Which ones? How can you state then that God tolerates all forms of evil? Maybe from His perspective all forms of evil still present on this world are only “moderate”? Maybe He spared us some much more “extreme” forms of evil that none of us even can imagine (far worse than childhood brain cancer)? Don’t you see that those human cries about “extreme” evil are nonsense from this perspective? Had even childhood brain cancer and other evils you consider exteme would have been eliminated from this world by Allmighty God, there would be still other forms of evil considered “extreme” by entites living in your imaginary “better” world? This is nonsense… And the pain that a child suffers now is never erased by future events. It is pain. Perhaps only God knows. But then his knowledge is not comprehensible for human beings and you are defending irrationalism. There are many things in this world that are not comprehensible for human beings, yet they are real. Do you call them also “irrational”? Thanks them, that the first caveman were “irrational”. Had they been “rationalists” we would still live in caves right now..","date":"2015-01-10","mins":"7:21 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182533","author":"o_k","post":"David Mo: It is incomprehensible for moralists, for me and for you. But if you say that you can assert something about “God” (“God exists”, “God is good”, “God is omniscient”, etc.), you are an irrationalist. Your attempts to cast calumniest towards me are just… irrrational. NOTE: It is not only “moral authorities” that think so. Every normal human being thinks that spiting in the neighbour’ soup is a qualitatively different evil to kill a child. Let me answer it in this way. Of course from the human, limited perspective spiting in the neighbour’ soup is a different, smaller evil than killing a child. Yet God’s perspective is different. He can for example turn bad deeds into much greater good. Classical example may be the story of Joseph in Egypt, while being sold by his brothers into slavery (definitely extremely bad deed), in the end due to God directing the events, this saved his whole family from hunger. We don’t know all consequences of our deeds. It may turn out that apparently small evil would have in the end much greater consequences than great evil. Of course this doesn’t modify moral responsibility, which is greater for greater crimes (like rape or murder) than smaller ones (cursing in public), yet we cannot say that total elimination of some forms evil by external intervention will make that there will be less evil in the Universe. It (evil) will simply change its form, and we will still be as far from Paradise, as we have been. If I can give a similar example from another area: Every child knows than there are ten natural numbers in the range of 1 to 10: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 There are 5 odd numbers in the range 1 to 10: 1, 3, 5, 7, 9 There are also 5 even numbers in the range 1 to 10: 2, 4, 6, 8, 10 So it seems that there is fewer (just half of them) odd (or even) natural numbers, than both of them. Yet if we take a range from 1 to infinity, their quantity is the same: 1, 2, 3, 4, 5…. 1, 3, 5, 7, 9…. 2, 4, 6, 8, 10… By analogy, treating unlimited God within limited range of human perspective is simply erroneous..","date":"2015-01-11","mins":"5:49 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182535","author":"o_k","post":"Dave B: You are Catholic, just as me, right? However, I see it as essentially a primitive attempt to explain the human situation, which works primarily at the symbolic and psychological levels, and as an attempt to explain the origin of evil. As I said, the story is present in the Holy Bible not without reason. And it is not just a primitive reflection of clumsy efforts of primitive society to explain orignin of evil… It is not primitive. And it is much deeper than most people think. I do not regard it in any way as an historic account of the rise of humankind from the primordial slime. And you shouldn’t have. The basic error, committed by both Biblical literary creationists, as well as their evolutionary materialist, Dawkins style opponents, is to assume that the Creation and Garden of Eden stories can be put in historical perspective, as certain, concrete events with space time coordinates. While it is obvious (even from the Bible itself!) that this perspective is wrong, and looking for any localisation of the Garden of Eden on this planet is futile.. I wrote: analyze it in its proper, mythical perspective. As far as I recall C.S. Lewis wrote some very interesting essay on relation between myth and Christian faith… Rather than relying on such mythology, I have offered an entirely different approach based on what Science can tell us about Creation, Science, science, science, it endangers us with going into scientism, or even scientology… I think we should look beyond human pracised Science. And beware from committing positivist fallacy… A little change of perspective may be beneficial, really….","date":"2015-01-11","mins":"6:33 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180599","author":"o_k","post":"Is it not a miracle that the universe is understandable (Einstein)? Is it (the Universe understandable)? Or maybe we just conceive some crude and rough approximations to describe how it works?.","date":"2015-01-01","mins":"2:54 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-183067","author":"o_k","post":"Aljones909, David Mo: It is funny! All these comments and you finally agree with me! No, I don’t agree with you. You simply misses my point, which I haven’t fully voiced yet. You still don’t understand what I mean and this (inability to make this world perfect) is just a part of explanation. My conclusion: Why have we to worry about a contradictory god that we don’t understand? How can we state anything about an entity that we don’t understand? God is not contradictory simply your perspective is limited, and focused on the worng aspect. And we don’t need to understand fully some entity to state something about it. We don’t fully understand star evolution, or functioning of living cells, yet we can state something about those matters. “If egregious suffering did not exist non believers would just complain about stubbed toes”. Exactly! For such entities, who would not know “more serious” (from our perspective) pains (like cancer), this would be “extreme evil.” Their suffering, apparently insignificant (from our perspective) would nevertheless be the same. The ‘problem of evil’ addresses the world as it is Not only, because we need to consier also alternatives, other worlds that could have been instead of ours. Childhood brain cancer is no different to a broken fingernail? This is evil, and this is evil. Of course one seems to be much more serious but only from our perspective. Not from the unlimited perspective of all infinite good God. Imagine yourself that they stole you 10 $. That’s bad. Then imagine yourself that they stole you 1000 $. That’s worse (100 times), isn’t it? Yet assume you are very rich, you own say 100 000 000 000 =100 billion $. What’s then the difference between stealing 1000 $ and 10 $ (respectively 0.00000001 and 0.0000000001 of your total money)? Little. The main problem is not whether they stole from you 1000 $ or 10 $, but the fact of stealing. Similarly with infinite good God. The main problem is the presence of evil, its scale is irrelevant. Of course, in limited human perspective there are greater and lesser evils, yet this can only be callibrated versus human scale. What’s the difference between 0.1, 10, 100, 1000 versus infinity? Belief that Evil can be eliminated (or even reduced as a whole) via God’s magical intervention, and elimination of physical ability to kill, rape, steal, as well as natural disasters and diseases, is just extremely naive. Turning stones into bread is no solution. This is no way. But still there is another way. To know which, you must know what actually is the source of evil. If men had donkey heads their god would be “dunkeyform”. You pagans, didn’t change since Antiquity..","date":"2015-01-13","mins":"1:51 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182847","author":"o_k","post":"If you eliminate the extreme evil perhaps the amount of evil continues to be infinite (sic) but without any extreme evil. How many times should I repeat that you cannot objectively state what is “extreme” evil and what is only “moderate” evil (especially from the cosmic perspective)? For Paris Hilton a broken nail tip may be extreme evil. Had there been no childhood brain cancer, no starvation and no earthquakes, the equivalents of David Mo would cry in such Universe that God is bad , because he didn’t prevent such extreme evils like broken nail tips and kids dying from overeating. On the other hand, you cannot be certain whether God has not spared you potentially much more terrible (in human sense) evils than human brain cancer, as humanity doesn’t experience them. Total elimination of some forms of “extreme” evil imposed by Higher Forces won’t make this world any better. It is impossible, in this world. And costs could easily outweight the apparent benefits. Simply other forms of evil would become “extreme” then. In Lem’s novel, which I gave as an example, the introduction of “ethicsphere” didn’t change Luzania for better. The lowest criminal statistics are usually in totalitarian states. And so on. You cannot fix the world in this way..","date":"2015-01-12","mins":"2:49 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-65200","author":"o_k","post":"Hugh Farey : Yes indeed. How convenient. Way back in January I made up some equally reasonable figures of my own and determined that about 20 men had died in exactly the same way as Jesus.. Could you give us an insight of your calculations?.","date":"2013-12-22","mins":"7:49 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65968","author":"o_k","post":"Dave: Your numbers are wrong. The Hugh’s expected value of 20 men crucified like Jesus is further reduced down by factor of 4x3x2x500=12 000, giving the expected value of 1/600, or 0.001666667. This suggest that it is very improbable that the TS Man could be someone other than Jesus, if we assume that the creation of the Shroud of Turin is purely accidental (we do not consider deliberate forgery). There are some mathematical subtleties here, but we don’t go into to much details. I agree with the rest of the comment..","date":"2013-12-23","mins":"5:35 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65190","author":"o_k","post":"Hugh: You can always perform an estimate, a calculation similar to that one preformed to Baberis, to check what is a chance that TS Man is not Jesus, but someone else. To remind you: Barberis assumed: 1. The TS man was wrapped in the shroud: 1/100 victims of crucifixion 2. The TS man was crowned with thorns: 1/5000 3. The TS man carried cross: 1/2 4. The TS man was nailed to the cross 1/2 5. The TS man has a spear wound in the chest 1/10 6. The TS man was quickly buried without washing: 1/20 7. The TS man left tomb within 2 days: 1/500 Thus the probability of coincidence in an instance of a single crucified man is 1/200 000 000 000. Next, Barberis assumed that between 7th century BC, and 7th Ad there were 2 billion people, and 10 % of them (200 000 000, totally absurd number) were crucified. Thus the probability that the TS Man is someone different from Christ is less then 1/1000 I have performed my own caclulations, slightly modifying Barberis assumptions: 1. The TS man was aged between 30 nad 40 years 1/3 2. The TS man was crowned with thorns: 1/5000 3. The TS man was scourged: 1/2 4. The TS man has a spear wound in the chest 1/10 5. The TS man left tomb within 2 days: 1/10 000 Thus for a single man :1/3000 000 000 Next I assumed that it is certain that crucified victim was a Jew (jewish burial in a simple Shroud, and so on), and no more than 1 million Jews were crucified. Thus the probability that the TS Man is someone different from Christ is less then 1/3000 Of course one can take different assumptions and numbers. But the conclusion remains. The chances that TS shows some different crucifixion victim than Jesus are negligible..","date":"2013-12-22","mins":"7:12 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65509","author":"o_k","post":"Hugh on 25 January: Finally, although I have said that I think estimates of probability are naive, I think that of behalf of the ridiculous consensusees, I’ll try to make one. I’m going to claim (and I challenge anyone to produce archaeological or historical evidence against these), that 25% of all crucifixion victims did not have their legs broken but were stabbed as a confirmation of death, that 5% were mercilessly flogged before being crucified, and that 1% were treated to a spiked helmet or crown. Assuming these three treatments were independent, then 1 in every 8000 crucifixions had injuries similar to those on the shroud. Let us suppose that the Romans crucified Jews for about 400 years, at a rate of 1 a day except during rebellions when the number rose to 500 a day according to Josephus. Let’s go for a total of 160 000. That means that 20 were crucified in the same way as Jesus. Of those, one left a shroud that remains to this day. I wonder which one… So we have, according to Hugh: 1. The TS man has a spear wound in the chest 1/4 2. The TS man was crowned with thorns: 1/100 3. The TS man was scourged: 1/20 Thus for a single man: 1/8000, and for 160 000 crucified, it gives the expected value of 20. BUT! Lets add some additional features characteristic for Jesus and the TS Man: 4. The TS man was heavily beaten in the face 1/4 5. The TS man was aged between 30 nad 40 years 1/3 6. The TS man carried cross: 1/2 7. The TS man left tomb within 2 days: 1/500 It reduces the odds to 1/600.","date":"2013-12-23","mins":"7:30 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-66013","author":"o_k","post":"Anyone of then might have merited a mock helmet. Just want to remind that there were not so many candidates for a ‘king’ in Roman dominated Israel in 1 century BC 2nd AD. The rightful king must have come from the Davidic line, and even Hasmonean dynasty considered themselves a ‘temporary’ kings. Wikipedia gives a list of Jewish claimants http://en.wikipedia.org/wiki/Jewish Messiah claimants There are various anti Roman rebels among them, but as far we know, no one except Jesus, a shepherd Athronges, and Simon bar Kokhba (who probably died in combat) claimed to be the Messiah, or ‘the king of the Jews’. There is still something interesting about the Crown of Thorns which gives us some insight about Pilate views on the Jesus, but I will tell it on other occasion..","date":"2013-12-23","mins":"6:44 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-130767","author":"o_k","post":"Great image Dan, I fully understand how you must feel now, being bombarded by mails from Yannick and me!.","date":"2014-06-18","mins":"11:14 am","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-171562","author":"o_k","post":"Hugh, the really stunning thing is that Messrs Damon, Donahue, Gore, Hatheway, Jull, Linick, Sercel, Toolin, Bronk, Hall, Hedges, Housley, Law, Perry, Bonani, Trumbore, Woelfli, Ambers, Bowman, Leese and Tite signed this Nature papers without any questions, and neither reviewers from Nature had any second thoughts, moreover, several other educated people, specialists in natural nad physical science, and even carbon dating specialists raised no objections, while the Nature paper itself (the infamous X^2 valueof 6.4) shows there is something odd here. Http://www.shroud.com/nature.htm Moreover, I once heard a radio (an internal station of one Catholic University) interview with one specialist in carbon dating (who also published an interesting textbook on carbon dating, easliy available online), the interview was published on his private website (which makes clear that the author is atheist). The topic of the interview was of course the Shroud of Turin and scientific examination of it. What can I say about this roughly 15 minutes interview? As far as I study the topic of the Shroud I have never heard such insolence, such arrogance, such pride, such overconfidence in 1988 carbon datings (called by the intervied “the only true scientific examination” ), such contempt for other scientific examinations of the Shroud (he once mentioned 3 D examination of the Shroud questioning “what’s that a kind of study?”)., Even the interviewer, it was apparent from her voice, that she began to lost patience. In the latter part of the interview, when our proffesor reminded himself what audience would listen to that, mentioned that as (according to him) it would be miracle had the results be skewed from the 1st to 14th century so the only hope for all authenticist is miracle, that maybe something happened during Resurrection that changed the results but no other way. But it was obvious, even if not voiced, that he didn’t intend to believe that, and this suggestion was brought forward more to ridicule proponents of authenticity (some of whom, as we know, adhere to this theory, absurd for atheists and not only), than as serious hypothesis. That’s it, the attitude of some people, particularly radiocarbonists to the Shroud. And even despite I don’t believe the 1988 results were duped (like Stephen E. Jones claims), yet there seems to be conspiracy, even if unorganized (call it conspiracy of silence or something similar). Simply, the Shroud, the most controversial object on Earth, is inconvenient for some circles, who would like to discredit it at all cost!.","date":"2014-11-16","mins":"8:02 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171578","author":"o_k","post":"No, I can’t accept that. All those people signed the Nature papers without any questions! Really? Have you any evidence for that? And the reviewers from Natures had no second thoughts? Really? Have you any evidence for that? Even carbon dating specialists raised no objections? Did they not? Maybe they looked for some but couldn’t find any. Yes I have evidence their names listed in the headline: http://www.shroud.com/nature.htm No one voiced any questions, at least in public. Because if you voice an objection, then it means you believe in flat Earth, that’s why! Carbon dating is inerrant! Triumph of the science over superstitions! And we, who still believe the Shroud is authentic, are just poor, gullible, uneducacted, unenlightened, bigoted people This is heading for conspiracy on a scale Stephen Jones can only dream of. Hugh, wake up, that’s the world we live in. Do you think there are no “forbidden topics” here? The open secret conspiracies, of which you cannot speak, because it is politically incorrect? The dark forces trying to shade their wicked deeds? No Hugh, I am not conspiracy theorists. I don’t believe that free masonry rules the entire world or any nonsense of this kind. Yet there are things for saying which you can be ostracised. And funniest thing is that those who believe in conspiracy theories (UFO, Moon landing hoax, Bilderberg group) are so absorbed by them, that they cannot notice real conspiracies..","date":"2014-11-16","mins":"10:52 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-160146","author":"o_k","post":"Are there marks of coins or not? I think not. Max thinks there are. Others agree with one side or the other. And that’s it. They are there and they are not. My position is that the issue cannot be resolved. Maybe in a few days I will make some presentation showing why I think so if I mobilise myself to make it. I have little motivation so far..","date":"2014-10-07","mins":"11:39 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157659","author":"o_k","post":"Even the same photos where Whanger, Danin or Baima Bollone see all those things If you have those photos, of such quality. Have you, Gian Marco?.","date":"2014-09-29","mins":"8:23 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157627","author":"o_k","post":"No Yannick! No! Remember, NEVER rely on an opinionion of a single archeologist especially biased archeologist! Read this: http://en.wikipedia.org/wiki/Joe Zias The PBS documentary Secrets of the Dead: Shroud of Christ, which aired in April 2004, presented new and controversial claims that the Shroud of Turin was the authentic burial cloth of Jesus. Several experts disputed these opinions, since carbon dating tests performed in 1988 placed its origin 1300 years too late. Specifically, Zias noted that the shroud depicts a man whose front measures 2 inches taller than his back and said, “Not only is it a forgery, but it’s a bad forgery.” As Zias is completely biased on the subjecct (and completely ignorant on the topic of the Shroud of Turin, since the argument that ventral image is longer than dorsal is one of the most often raised by the sceptics, and one of the easiest to refute), it was obvious that he would say ‘No’ for every your question! The FACT is, that when the matter is controversial and ideologically sensitive, for every archeologist that says ‘Yes’ to the issue, you can find another that says ‘No’ (and vice versa)..","date":"2014-09-29","mins":"5:53 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-161389","author":"o_k","post":"Does anyone else share my hypothesis that Max Patrick Hamon’s contributions are spoof ones, deliberately obscurantist nonsense to see how far he can wind everyone up? I have a feeling that yours are the same, Charles..","date":"2014-10-11","mins":"2:36 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157728","author":"o_k","post":"I just remarked that one should use scientific quality photos, not those bad quality jpegs,which are many in the Internet, and you start your tirade, Gian Marco. The fact that you cannot see what others see, does not mean those items cannot be present there. We cannot say that coins and flowers were not used in ancient Jewish burial customs, simply because Gian Marco Rinaldi cannot see them on the photos of the Shroud of Turin. It is simply another example of sceptics’ usual flawed logic..","date":"2014-09-29","mins":"1:32 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157745","author":"o_k","post":"Oskar, can YOU see the flowers and coins, whether in scientific quality or bad quality photos? And please note that the proponents themselves use bad quality photos. I have indicated the very same photos that were used by Bauma Bollone. He sees the letters of the inscriptions on them. If you see them you can answer my question in my previous comment. If you don’t see them, you cannot say that it is only I who do not see. With regards of coins I can say to you, I see them. And at the same time I can’t see them. Because actually the matter is not about seeing or not seeing things, but about interpretation of what is seen. But it seems that understanding this is beyond comprehension of most people especially sceptics. I don’t have opinion about flowers yet. And it doesn’t matter whether you are the only one who doesn’t see, or some other too. As I wrote, we cannot say that coins and flowers were not used in ancient Jewish burial customs, simply because Gian Marco Rinaldi (and others) cannot see them on the photos of the Shroud of Turin. Neither opposite conlusion, because some people claim they see. I’ll explain this later in some presentation..","date":"2014-09-29","mins":"2:42 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157997","author":"o_k","post":"AN: I am convinced that I am not able to discuss with people who see flowers, coins, and other things on the shroud, and also with those who see the Shroud in the code Pray. It seems pointless to me to discuss what I consider the evidence. Simply, my brain works differently and so there is no chance that I can discuss on this topic. I have to shut up. So why not to give up the Shroud matter, if that’s the situation, in your opinion? P.S. No sceptic has been able to undermine reasoning I presented here https://shroudstory.com/2014/06/21/discussion about the pray codex and its relation to the shroud is over/ about Pray Codex including you (I am certain you read this)..","date":"2014-09-30","mins":"9:57 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-159523","author":"o_k","post":"See Mark Antonacci The Resurrection of the Shroud, pages 105 108: http://books.google.pl/books?id=h8b S Vu Yz Mjo C&printsec=frontcover&hl=pl#v=onepage&q=coin&f=false Interestingly, after Shroud of Turin researchers discussed the appearance of a coin over the eye of the man in the Shroud and drew connections with ancient Jewish burial customs, Hachlili changed her interpretation of her findings, She stated her new belief that the coins found at Jericho had been placed in the mouth, not on the eyes. (pg. 105) I have bad feelings about this….","date":"2014-10-05","mins":"10:37 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-158000","author":"o_k","post":"I was not able to remain in silence, only because sometimes the argument seems to me very fun and I cannot resist… Go to the specialist..","date":"2014-09-30","mins":"10:11 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-159528","author":"o_k","post":"Ian Wilson, The Turin Shroud, Penguin Books 1979, pg. 260: “But Jackson could not rest. He began searching his library, hunting out references to ancient Jewish burial practices. In an article in the 1898 Jewish Quarterly Review he found the information he was looking for. It was a custom, the article said, among Jews and certain other nationalities to lay coins or pieces of potsherd over the eyes when laying out a corpse for burial, the intention being to keep deceased from seeing the way by which he was carried to his lat home.3″ Footnote: “3. A.P.Bender. ‘Beliefs, Rites and Customs of the Jews Connected with Death, Burial and Mourning’, part IV, Jewish Quarterly Review, VII (1895), pp. 101 3. Bender quotes the practice from J.G. Frazer, Journal of the Anthropological Institute, XV p. 71, who in turn quotes Bodenschatz, Kirchliche versfassung der heutingen Juden, IV p. 174, and Gubernatis, Usi funebri, p. 50. Archeological evidence for the practice is lacking due to Jewish corpses being put in ossuaries after decomposition. But it is by no means unlikely.”.","date":"2014-10-05","mins":"11:05 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-161749","author":"o_k","post":"If it was not Roger Bacon, then it was no one else! My copyright..","date":"2014-10-12","mins":"3:50 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-134846","author":"o_k","post":"Stop laughing, Dan, this is in fact quite serious issue. For some time, I am wondering why the Manoppello face has almost no moustache visible (only some traces of it left and rigt to the mouth). And I have shown that the faces on the Shroud and Manoppello are the same! (see https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf ) On the contrary, COMPARATIVE STUDY OF THE SUDARIUM OF OVIEDO AND THE SHROUD OF TURIN claims: 4. The man whose face the Sudarium covered had a beard, moustache and long hair, tied up at the nape of his neck into a ponytail. ( http://www.shroud.com/heraseng.pdf) It is at least theoretically possible that what we may see on the Shroud as a moustache, may in fact be illusion. Impactogram? Quite possible. We can say, in some sense, that the Shroud “impacted” the Man’s face..","date":"2014-07-02","mins":"7:10 am","url":"https://shroudstory.com/2014/07/02/is-the-beard-of-the-man-of-the-shroud-an-impactogram/","cat":"other_blogs","title":"Is the beard of the man of the shroud an impactogram?"},{"id":"comment-54207","author":"o_k","post":"“Scientific truths are not collective consensuses of viable facts. Legal truths are. A legal truth can be overturned, and often is, on appeal. A real truth can’t be.” Quod est veritas?.","date":"2013-11-30","mins":"4:07 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-54191","author":"o_k","post":"A scientific fact is not achieved “beyond reasonable doubt” but beyond any doubt at all Rather opposite way..","date":"2013-11-30","mins":"1:18 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-54208","author":"o_k","post":"“Scientific truths are not collective consensuses of viable facts. Legal truths are. A legal truth can be overturned, and often is, on appeal. A real truth can’t be.” Sorry: Quid est veritas?.","date":"2013-11-30","mins":"4:12 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-159906","author":"o_k","post":"Ancient contemporary historical documents in accessible archives are usually confined to ruling houses, conquering generals, and accounts of wars, seldom to notable religious reformers unless they formed part of the establishment. I wonder what contemporary historical documentation there might be for the existence of Lao Tzu, Siddartha Gautama (founder of Indian Buddhism), Confucius, or for that matter Moses. Yet as with Jesus, their movements survive them. Last year, I had read an interesting book on those matters. The title was Walter Vogel Ojcowie religii (original German title was Die Religionsstifter, ‘The founders of religion’). It had biographies of following religious figures: Moses, Buddha, Muhhammad, Akhenaten, Zoroaster, Confucius, Laozi, Mani, Guru Nanak and Bahá’u’lláh. Except for the two last figures from the relatively modern period, it seems that the life of Jesus is the best documented..","date":"2014-10-06","mins":"3:40 pm","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","title":"Jerry Coyne Once Again"},{"id":"comment-159914","author":"o_k","post":"And biography of Jesus, of course..","date":"2014-10-06","mins":"4:21 pm","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","title":"Jerry Coyne Once Again"},{"id":"comment-148328","author":"o_k","post":"Daniel Mc Kinley (Pinna and her Silken Beard: A Foray into Historical Misappropriations) does a lot to dispel the mythology that has grown up around it (particularly with reference to transparency in ancient textiles), albeit without reference to Manoppello http://www.wbrg.net/biblio/index.php?media id=3103&show=detail&buchstabe=M Any pages of particular interest?.","date":"2014-09-03","mins":"2:08 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-148348","author":"o_k","post":"Gian Marco, what do you want to achieve? You asked Piero “how do you know that the veil is made of sea byssus?” and I, ironically answered for him that he knows because Chiara Vigo thinks it is made of sea byssus. I don’t know whether she is right, or not. It is a secondary matter for me at this moment..","date":"2014-09-03","mins":"4:43 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-148272","author":"o_k","post":"I agree..","date":"2014-09-03","mins":"9:15 am","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-212163","author":"o_k","post":"The STURP members payed most of their campaign of research by themselves. I am not sure that someone did actually receive a salary. In this way, one does not select the best scientists, but just those who strongly believe in the “mystery”. People who finance the research should be distinct from the scientists actually operating. 1. Who pays Garlaschelli and you? 2. Get out of there..","date":"2015-10-09","mins":"4:38 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-148301","author":"o_k","post":"Because Chiara Vigo thinks so, that’s why, Gian Marco..","date":"2014-09-03","mins":"12:05 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-46385","author":"o_k","post":"Becuase it cannot be detected on photo. So far I remember, it was Heller & Adler (possibly also Baima Bollone, and Giorgio and Frache on samples taken in 1973) who cleansed bloodstained fibers from image areas and determined that there was no image beneath the blood clots. Of course checking all the fibers is impossible,but if the number of examined fibers (from various regions) is large enuogh, one can clearly establish that there is no image beneath bloodstains..","date":"2013-10-07","mins":"1:34 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46330","author":"o_k","post":"It was probably some of the sceptics. For them, until we check every thread under every bloodstain whether there is image or not, the question of “no image under bloodstains” remains open. But of course such approach is nonsense such doubts are raised only to make insinuations, for propaganda purposes. But you should know the tricks used by the sceptics and how to deal with them..","date":"2013-10-06","mins":"5:23 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46400","author":"o_k","post":"Hugh: such examinatons using Shroud Scope can be misleading, as there are no white and yellow colors on the Shroud, the color of image and background is the same, the only difference is its intensity. The fibers with image have their own colored layer (of controversial nature), which can be visually examined with microscope..","date":"2013-10-07","mins":"5:23 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46469","author":"o_k","post":"Is very rare up to today..","date":"2013-10-08","mins":"8:31 am","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46515","author":"o_k","post":"But if it has, then what Max? 825 at this time the Mandylion was still in Edessa, while iconoclasm was still raging in Byzantium..","date":"2013-10-08","mins":"3:03 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-193361","author":"o_k","post":"Hugh: I think I can say with some authority that the crosspiece is always in front of the body and never makes contact with the back at all. OK’s diagram which seems to show the whole cross strapped to the back is wholly unrealistic. What’s more, given its length, the cross presses on the top of the shoulders and does not abrade the shoulderblades. This is Marion’s analysis, not mine of what both the Shroud and the Tunic show for some reason. I hope he knew what he was writing about, as he was performing those experiments. The position of the cross is strange to me as well, but maybe there was some rationale behind that (falls?). If this is not done, then the cross piece would either be simply nailed directly across the upright, or have a mortice cut out for a tenon in the upright to fit in. In the first case it would be very difficult to stand the completed cross up with a body hanging on it (the Good Thief’s beam looks like this), and in the second the crossbeam would have to be much thicker than suggested (maybe 15cm or so) to accommodate both the tenon. According to Gaza Valdes the Good Thief Patibulum has a mortice. It does not have to be wide only to fit the tenon. As to weight, my cross was made of 6″ x 4″ (15cm x 10cm) pine and weighed about 50kg. However, I only carried it; I don’t know how stable such a narrow cross would be to hang a victim on. I bet it weights much more than 130 kg. With proper support, no problem.","date":"2015-03-14","mins":"1:44 pm","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-171608","author":"o_k","post":"Hugh: These scientists, many of whom are still alive and some of whom I have corresponded with, think that the sample tested was sufficiently representative to give a reasonably accurate date for the Shroud Yeah, but the fact remains that Nature data fail several statistical significance tests and strangely, they don’t care, don’t see a problem in it. Why should they, as those were measures made by themselves, why bother them that they did something wrong in their job? If any of them had thought that the result was ‘statistically meaningless’ they would have said so, and if that was so of a majority, the report would have reflected that. They had no reason to hide their objections to the sampling on purely statistical grounds Really, for what purpose? It was their work, their paper, another addition to the list of publications which determines their careers. Why should they raise any objections? It was against their interest. The idea that they signed it “without any questions” “with no second thoughts”, or frightened that they would be classed as flat earthers is not tenable. In fact, the whole matter was engineered in the way, that nobody had any interest in disputing the results. The scientists remember they were not freelance, idealist explorers of the Nature (I mean the Universe, not the journal). They were part of scientific teams. And like in every team, there is a leader, and the subordinates and there is also “team spirit”. To raise objections against the leaders, to break the team in the matter of principles? No way. And that of course means putting your career at risk. The Nature. As you remember, the results were first announced on the press conference on 13th October 1988. The paper was sent to the Nature only by 5th December, published 16th February. Now rhetorical question: do you really think that Nature could afford rejection of that paper? Do you? The radiocarbonists. They certainly have no interest in disputing the 1988 results, and thus the reliabilty of their method as a whole, by admiting that there may be errors. No matter their personal believes. The other scientists? Who would dare to question 1988 carbon datings, risking his or her reputation as the scientist? The carbon dating is a well established scientific method, questioning it is like, I don’t know, questioning special relativity, or human evolution, or something. You need really good arguments to do that, and withstand fierce opposition. So, in that way Tite & co. Silenced everyone except for a few fringe “shroudies” who can be ridiculed as pseudoscientific maniacs/fanatics and in fact the whole conspiracy theories (Stephen E. Jones’ alike) are very on hand for them serving as a proof of their point, that the “shroudies” are just a bunch of pseudoscientific maniacs. This is the position favored by hard anti Shroud propaganda, and I had to deal with that stance not once..","date":"2014-11-16","mins":"6:22 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-193369","author":"o_k","post":"Dave remember that after Third Serville War, Crassus ordered crucifixion of some 6000 rebel slaves on the road from Rome to Capua. There were no stipes there before. All 6000 had to be constructed from scratch..","date":"2015-03-14","mins":"5:51 pm","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-193418","author":"o_k","post":"Piero: Unfortunately I have only the latter book Le linceul de Turin et la tunique d’Argenteuil where discussion of the subject is rather brief and does not go into details. Unfortunately I have no news about the radiocarbon dating of the cross of the Good Thief … Have you found the inherent news? No. I don’t think that this piece of the cross has ever been properly examined. Instead there is a paper about the “Titulus Crucis” : I have expresseed my view about Titulus in this post: https://shroudstory.com/2014/01/22/titulus crucis a fascinating guest posting by o k/.","date":"2015-03-15","mins":"9:28 am","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-193371","author":"o_k","post":"To raise the whole cross requires ropes, some tricky logistics in hoisting, and backfilling with tamping to anchor the upright in its hole, to ensure that it stays securely vertical. I don’t think it requires ropes, or tricky logistic. Just a hole drilled in advance in the rock, a stone ring also prepared in advance and 3 4 strong men to raise a cross with a convict (total weight 130 150 kg) and put it into the hole. It can be performed relatively easily. Nor can carrying the patibulum only be called a myth. But the usual claim that the whole cross was too heavy was certainly a myth..","date":"2015-03-14","mins":"7:04 pm","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-149596","author":"o_k","post":"It’s an old theory, which now seems to be discredited, for several reasons. One of them is that it is hard to imagine that had some pieces been cut from the ends of the Shroud, the lenght/width ratio would be so close to 4:1..","date":"2014-09-09","mins":"4:40 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149945","author":"o_k","post":"It supports my view that sceptics are not able to challenge the Shroud’s authenticity in open fight, and may at most engage in partisan activity. Nabber, if may I ask, if Charles is throwing grenades, while Hugh is planting mines, then what are the tactics of other major sceptics, Collin Berry, Gian Marco Rinaldi, Andrea Nicolotti, David Mo etc. What is their weapon of choice?.","date":"2014-09-10","mins":"1:20 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149866","author":"o_k","post":"A discovery! Paper “What the Shroud is and (it) is not” presented at Valencia 2012 conference discusses this and several other related and unrelated issues. This is not a new discovery for me. On November 18, 2013 at 1:41 pm, I wrote: Ian Dickinson, The Shroud And The Cubit Measure, British Society for the Turin Shroud Newsletter No 24 http://www.shroud.com/pdfs/n24part6.pdf The lower limit of Assyrian cubit: 54.3 cm The average of Assyrian cubit: 54.6 cm The higher limit of Assyrian cubit: 54.9 cm Dimensions of the Shroud 437×111 cm The lower limit of Assyrian cubit: 8.05×2.04 The average of Assyrian cubit: 8.00×2.03 The higher limit of Assyrian cubit: 7.96×2.02 There is some minor problem here, according to César Barta, What the Shroud is and it is not (point : it IS NOT a single piece), I Congreso Internacional de la Sábana Santa, Valencia 2012 01 28 http://www.shroud.com/pdfs/bartaveng.pdf the investigations of the distance between the primitive fold and the selvage corresponds to one half of the original width of the fabric: 58.6 cm. And if this was the half of the shroud at the end of weaving, the total width would be double: 117.2 cm more or less. But in that case, the Shroud was 6.2 cm wider when leaving the loom than currently. If we take this into account, than: The lower limit of Assyrian cubit: 8.05×2.16 The average of Assyrian cubit: 8.00×2.15 The higher limit of Assyrian cubit: 7.96×2.13. Curiously, it is today that the Shroud is 8×2 Assyrian cubits, with margin of error no greater than 3 %. It is possible (though I am not in favor of this) that side strip was deliberately cut and sewn again to obtain a perfect Assyrian 8×2 cubit measure The compromise is average of the two: 56.6 cm. Then the Shroud is 7.72×2.07 cubits. If we take approximate Shroud dimensions as 440×110 cm, and a cubit measure of 55 cm, then we have exactly 8×2 cubit proportion. I hardly believe this is accidental, no matter what Barta’s “primeval fold” analysis suggest. I think better explanation is that when first folded after removing from the loom, the Shroud was simply not folded precisely in its half, for some reasons,.","date":"2014-09-10","mins":"7:39 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149876","author":"o_k","post":"It is also worthwhile to check dimensions of the Sudarium of Oviedo. Http://www.sindonology.org/sudarium/sudarium Measurement.shtml They are stated as 84×53 cm. My measurements gives closer to 84×54 cm. What’s interesting, this may also relate to the cubit measure, although not so precisely as in the case of the Shroud. The proportion is close to 3:2 (actually between 1.55 to 1.6). A napkin approximately one cubit long, and one and a half cubits wide..","date":"2014-09-10","mins":"8:21 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149871","author":"o_k","post":"It is worthwile also to look at Ada Grossi’s paper Jewish Shrouds and Funerary Customs: a Comparison with the Shroud of Turin https://www.academia.edu/2427474/Jewish Shrouds and Funerary Customs a Comparison with the Shroud of Turin in 1st International Congress on the Holy Shroud in Spain   Valencia April 28 30 2012 ed. Centro Espanol de Sindonologia CES  On pages 6 7 she has very interesting section 1.3 “The Shroud’s dimenison”. Although she is sceptical about the significance of the “cubit argument” in fact her own arguments point to the exactly opposite conclusion! On November 19, 2013 at 7:55 am, I wrote: Yes, there are some uncertainities, but regularity of Shroud dimenisons expressed in integers is striking! It suggests that the original TS dimensions hasn’t changed much through centuries. The units that were used to measure the size of the TS were either cubits circa 55 cm long, or ell measuring 110 cm, that is 2×55 cm. Or, according to Ada Grosii: “Thus, the Shroud’s length would be 56 tefachim (436.8 cm) and its width 14 tefachim (13+1, that is 109.2 cm = 101.4 + 7.8 cm); on the other hand, always keeping in mind that these measurements are approximate, we could also evaluate the Shroud’s dimensions by the tefach sochek (9.33 cm), and we would obtain even more interesting numbers: 47 tefachim (438,52 cm) by 12 tefachim (11+1, i.e. 111.96 cm = 102.63 + 9.33 cm).” 7 tefachim = 6 sochek =1 ammah (cubit). 7 *7.8 cm=54.6 cm =1 Assyrian cubit! 6*9.33 cm =55.98 cm. Thus the opinion of Grossi: “This line of reasoning certainly suggests great caution: playing with numbers, any result can be achieved” is unjustified, if we only keep some rules, only the results that Shroud dimensions allow can be obtained. So the Shroud measures 14×56 tefachim, or 48×12 sochek (the number 47 is “almost” 48, the measure sochek is probably slightly overestimated), or 8×2 cubits. 7 tefachim = 6 sochek =1 ammah (cubit). Very simple and useful conversion factor..","date":"2014-09-10","mins":"7:58 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149963","author":"o_k","post":"Calm down, Nabber. Playing with guys like Charles has always required a lot of patience. I think it is not because the Shroud or any pro Christian arguments challenge their views, various atheists, agnostics, “secular humanists”, “rationalists” etc. Try to discredit Christianity. In their view it is simply some outdated superstition, no matter what apologists say. No argument would challenge their (atheists) view, simply because they “know better”. The true reason why some guys try any cynical tricks to discredit Christianity is different. It is not because they feel their worldview is challenged. Contrary, they simply want to challenge Christian worldview. To show that they are “wiser” and better” then simple, “naive” believers. Pride, that drives their action. And the fact that they cannot refute Christianity? No matter. Attacking those “naive” Church followers is simply addictive. The best way is usually to ignore those provokers. Or ridicule them once and for all. Never get irritated. I have recently read one of the most foolish book on the Shroud that have been written in a few recent years. It adds absolutely nothing to our knowledge of the Shroud. I plan to make a review of it in a free time. The title is “The Sign: The Shroud of Turin and the Secret of Resurrection” by Thomas de Wesselow..","date":"2014-09-10","mins":"2:53 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149955","author":"o_k","post":"Hi Nabber. You have read Charles’ books? Are they really so bad, as suggested by this short passage in the Wiki article? http://en.wikipedia.org/wiki/Stolen body hypothesis#Removal by Jewish leadership.","date":"2014-09-10","mins":"2:14 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149489","author":"o_k","post":"As far as I know, she never used steam iron that was deliberately disseminated nonsense..","date":"2014-09-08","mins":"4:01 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-55589","author":"o_k","post":"Abrasions on the shoulders of the man of the Shroud, particularly on the dorsal image of the right shoulder, indicate that he carried a heavy object, such as the transverse beam of a cross. The man on the Shroud has cuts to both knees, especially to his left knee, indicating an unprotected fall onto a hard surface. A Roman crucifixion victim was made to carry the horizontal crossbeam tied to his outstretched arms and placed across the back of his neck This is outdated info. New studies suggest the whole cross was actually carried, not just transverse beam, see http://www.acheiropoietos.info/proceedings/Glori Web.pdf But if the crossbeam had been in direct contact with his scourged shoulders, the lacerations would have widened, but on the Shroud, they have kept their shape. This is consistent with the man on the Shroud carrying his cross under which was a garment protecting his scourge wounded shoulders And this garment is the current Tunic of Argenteuil, of which Jones is still not aware. The Andrè Marion’s comparison of the blood marks on the Tunic and the Shroud, suggest not only the two objects belongedto the same person, but also that this person carried the whole cross..","date":"2013-12-03","mins":"7:20 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","title":"The Science of Logical Forensics"},{"id":"comment-150020","author":"o_k","post":"If the side strip was sewn during Byzantine times, and a strip removed to centralise the image, this may explain the dispersal of various relics purporting to come from the burial cloth, although I am unaware of how many of these purported relics show the herring bone twill pattern, if they still exist. I recommend reading section It IS NOT the burial linens of Constantinople of Barta’s paper. And also mine: https://shroudstory.com/2014/05/11/the three byzantine burial cloths of jesus/.","date":"2014-09-10","mins":"6:15 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-55672","author":"o_k","post":"Hugh, straight from the shoulder: if someone claims that he/she knows how the Roman crucifixion exactly looked like, he/she is either mistaken, or blatantly lying. The most detailed descriptions of Roman crucufixion are in the Gospels, especially Gospel of John. We have besides the bones of Jehohanan, and that’s almost all. What we know is almost nothing it is the Shroud that teaches us how the Roman crucifixion looked like. That the TSM was crucified is undisputable. The only thing is to reconstruct in what manner exactly..","date":"2013-12-03","mins":"10:08 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","title":"The Science of Logical Forensics"},{"id":"comment-55678","author":"o_k","post":"Dan: There is a lot to question here; for instance how can we really know that his legs were not broken. My take is that we can only, at best, state that there is no obvious evidence that the legs were broken. It is very hard to break the legs of the TSM in the way so it would be invisible on the image. The displacement is higly likely, especially after use of heavy hammer, and complex operation of taking down the corpse from the cross. The legs are more or less bent, do you think it would be possible had they been broken?.","date":"2013-12-03","mins":"10:21 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","title":"The Science of Logical Forensics"},{"id":"comment-55836","author":"o_k","post":"However, without independent qualification, we cannot be sure that we are not reconstructing a medieval version of crucifixion, and not a Roman one at all. Now, go back to those confident statements claiming that the shroud conforms exactly to a first century Roman crucifixion. One can crucify a man in thousand ways, you know: ( http://upload.wikimedia.org/wikipedia/commons/3/3b/Japanese Crucifixion.jpg – WARNING: DRASTIC) and so on. We hardly know anything about Roman crucifixion and even whether there was a single model of Roman crucifixion (probably not). Nails through feet? – The only victim found has them through the sides of the feet, as does one of the grafitti. The other has the two feet side by side not on top of each other. It is possible that four nails, not three, were used to crucify Jesus/TSM and I am in favor of the four nail scenario, for some reasons. What the shroud does conform to is a 19th century reconstruction of a typical Roman crucifixion based on… the shroud itself. What a surprise. And that’s the most funny thing what have you expected, do you know what the Western crucifixes are modelled on? ; ).","date":"2013-12-03","mins":"3:10 pm","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","title":"The Science of Logical Forensics"},{"id":"comment-55690","author":"o_k","post":"And that’s almost all There is still something, we have at least two graffiti from the Roman era, showing crucifixion: On the left, the grafitti from Puozzola near Naples, on the right, the infamous Alexamenos graffito from Palatine Hill, Rome, anti Christian caricature from between 60 220 AD..","date":"2013-12-03","mins":"10:33 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","title":"The Science of Logical Forensics"},{"id":"comment-74289","author":"o_k","post":"I have no indication that what was transferred to Constantinople in 944 was not the official relic known as the Image of Edessa, which was associated with the Abgar legend. In fact, I have read that the emperor of Constantinople sent to Edessa men he trusted to make sure that what he was about to get was the real thing… Yes, he sent trusted men, who knew what the Image of Edessa was (and they knew it was not an ordinary icon). And he was assured, that the Mandylion transferred to Edessa was apparently the same cloth as the on that was discovered inside the city gate during th Persian siege in 544, and so on? But my question is: can we be sure that this is one and the same cloth that miraculously cured King Abgar, according to the legend? Why such a question in link with mine? Because yours is really good. And there is perhaps much more in the legend than most people thought….","date":"2014-01-23","mins":"5:29 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74132","author":"o_k","post":"Yannick: Taking this into account, I got a good question for you: If this idea first put forward by Wilson would be true, then can you explain to me how in the world we don’t find one single artistic depiction (some we have now where probably made by artists of the 12th century who were eye witnesses of the relic in Constantinople) that shows any signs of the supposed burial nature of the cloth and why in the world we don’t find one single manuscript of the Abgar legend that located the miraculous imprint after the crowning of thorns (while this is the most evident injuries we see in the face region of the Shroud) and also, why in the world we don’t find one single manuscript that DIRECTLY (without having to use wild assumptions) associate the Mandylion with a burial cloth? May I answer this with another question: do you think that the Mandylion transferred to Constantinople in 944 and the original Mandylion that cured King Abgar are one and the same object? ; ).","date":"2014-01-22","mins":"4:37 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74654","author":"o_k","post":"Maybe this way: 1. What are the traits of the Mandylion described in pre 944 sources? 2. What cloth satisfies those characteristics? I don’t want to give you a ready answer, I wish you to come to the conclusion by yourself..","date":"2014-01-26","mins":"7:32 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74295","author":"o_k","post":"By the way, I still wait to receive a clear answer from you concerning my good question! There will be no clear answers, only allusions. Sorry Yannick, if you do not understand this by yourself, my explanations would be in vain. Either you get the point, or not. I think the simple fact that the letters associated with the legend are obviously false is a very good piece of evidence to think that the Mandylion that was transferred from Edessa to Constantinople was most probably false too and could have even been forged some time (maybe centuries) after the letters We established so far, that the Mandylion transferred in 944 was almost for sure the Shroud (what else it could be). The letters, as I pointed, are irrelevant here. Seriously, I don’t think that there ever have been a miraculous healing (from Jesus or anyone else) of the historical king Abgar V… Or maybe there have been, you cannot deny it a priori. Let’s assume it is true, there are no serious reasons that we shouldn’t. I don’t have the same opinion about the possibility that there could really been a lot of real historical things that we can extract from this legend… Oh, yes. Try to think this way: If the Mandylion transferred in 944 to Constantiniople was the Shroud itself, does it really mean that it was necessarily the same cloth that healed King Abgar (assuming that the healing really took place)?.","date":"2014-01-23","mins":"6:10 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74742","author":"o_k","post":"2. A painter’s canvas. Note that some ancient sources seem to refers to the Mandylion as being on a wood panel instead of a linen cloth, Which, If may i ask? 1. If we take the Acts of Thaddeus and the writings of John Damascene, we know that the Image of Edessa had nothing to do with a burial cloth. If we take the Doctrine of Addai, we even know that this image was painted by an artist. Good, but there are more traits. Remember, it was called acheiropoieta, not made with human hands. Or maybe I ask in this way, what are the differences between the common vision of Mandylion and the Shroud… And then again, what object satisfy all those descriptions?.","date":"2014-01-26","mins":"7:42 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74753","author":"o_k","post":"For the “not made by human hands” tag, why do you take this for granted as if it was a proving thing? If the orthodox Church wanted to make believe the relic was truly sacred, making believe the image on it was “not made by human hands” was the best thing to do. I am not interested in this, at this moment. Let’s assume it was indeed miraculous. I answer: the most obvious is the fact that the Mandylion was not considered as a burial cloth and the image on it was reported to show an image of the living face of Christ with no signs of injuries or bloodstains. Wonderful! What object satisfy what descriptions? Do you mean the ones we found in most ancient texts talking about the Abgar legend? If that’s what you mean, I would answer: Surely not the Shroud of Turin, since the cloth described in most ancient manuscripts related to the Mandylion talks about a small towel showing the face of the living face of Christ with no signs of injuries or bloodstains Great! We are almost home. Once again I ask: what object satisfy all those descriptions? There is one, I can assure you..","date":"2014-01-26","mins":"8:39 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74880","author":"o_k","post":"Don’t you think there are enough converging evidence from both written and artistic sources to conclude this was most probably a small cloth showing only the face of the living Christ, without any signs of injuries or bloodstains? Right. And this cloth is currently known as…? How long should I repeat that there exist such a cloth on this world? It’s called….","date":"2014-01-27","mins":"5:28 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74756","author":"o_k","post":"Very, very close….","date":"2014-01-26","mins":"8:55 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74971","author":"o_k","post":"Yannick, do we discuss the matters seriously, or you just want to cry out to the world, that you are the wisest and you know everything what is right and what is wrong? Because, so far, it seems you haven’t understood anything, even despite I gave you all the clues straight on a plate. But you, instead of at least thinking through, disregarded them, knowing better before, of course. How then can I explain anything to you, as you don’t want to listen and consider anything outside your views?.","date":"2014-01-28","mins":"11:13 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74850","author":"o_k","post":"Can’t playing games, and you want to teach everyone what Mandylion was and what wasn’t? Poor your insight in that matter is, Yannick. Because Mandylion is one great riddle, and one must find an answer to that… By the way, the legend of Veronica was the occidental version of the Abgar legend. No way this cloth known as the Veronica vail could be authentic and dated from the time of Christ. Such a relic was probably created during the crusades when the Western crusaders came back from the Middle East with the Mandylion in mind… Wisdom of yours, of course. But the matter is more complicated, than your simple minded FACTS. For one should remember there were more miraculous images in the East, at least two come to mind, the Image of Edessa, and the Image of Camulia. Https://shroudstory.com/2013/10/25/the image of camuliana/ More direct clues hardly possible, I think..","date":"2014-01-27","mins":"1:48 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73694","author":"o_k","post":"It seems it is now my turn to answer some of the opinions expressed in this thread: Charles: When there are so many problems with the tortuous Mandylion route to Lirey and there has as yet, so far as I know, been no serious research on the much more direct, documented routes of relics from the ‘Lord’s Tomb’ straight to northern France, this is an unjustified comment. We simply know that northern France had large early relic collections, that it was the custom to tag relics as a mark of authenticity and that we have collections of relics tagged as coming from Jerusalem including some said to be from the Lord’s Tomb that ended up very close to Lirey. So there is important work to be done here to expand on this but sadly I am not the one to do it. ‘It eludes me why any Passion relics should be taken direct from Jerusalem to ancient Gaul.’ Well, it is well documented from tags on the relics themselves that they were see my earlier postings about relics from ‘the Lord’s Tomb ‘ that are known in collection close to Lirey. Northern France was avid for relics and there were large collections, including those of Charlemagne, early on. They were added to by the Crusades. As the Shroud is first documented in northern France, overwhelmingly the most likely source of its origin lies somewhere within these collections but, as I have said above, I have not the skills or time to do the research that is needed for this. A week ago or so, I bought a new academic book by Jerzy Pysiak, from the University of Warsaw, titled Król i Korona Cierniowa: Kult relikwii we Francji Kapetyngów (“The King and the Crown of Thorns: Cult of the relics in Capetian France”) http://www.wuw.pl/ksiegarnia/product info.php?products id=5002. Although I have to read it yet, but after a brief look it seems like a mine of the sources about relics, both from Carolignian and Crusade eras. However, there seems to be no word about the Shroud at all. There is no mention of Lirey, nor Geoffrey de Charny or any related people in the book Index. It is hardly possible that there had been no serious research on transfer of relics directly to France, after over 100 years of studies on history of the Shroud, begining with Chevalier, who traced its history back to Lirey. The only results were findings of some other alleged burial cloths, and some fragments of others. This way seems fruitless, and gives rather no promise for the future. It is only demagogy of yours Charles, to distract attention from the Wilson’s Mandylion theory (which gave some positive results), using logically flawed appeal to the future arguments. Although it is still not that likely, the most interesting alternative for me would be to chart the well documented collecting of relics from Jerusalem by Pulcheria, the sister of the emperor Theodosius II, in the early fifth century. This was briefly suggested in R. Hynek’s 1937 book. The 14th century Byzantine historian Nikefor Kallisto claimed that sindonon kai othonion were already stored in the Blachaernae church in Pulcheria times, the problem is how much this late source is reliable. And still we can be certain there were more than a single burial cloth in Byzantine collection. Nevertheless this track seems to be abandoned by the scholars, for some reasons. No it doesn’t override the gaps. It provides no explanation of where the Shroud was in those crucial first five hundred ( repeat five hundred) years before the sixth century and again does not fill in the gap after 1204. Provides an explanation the Shroud was hidden inside the walls of Edessa, for 300 500 years. Many other relics (Tunic of Argenteuil, Titulus Crucis) shared similar fate for large part of their histoy. Then again the chance that the Image of Edessa and the Shroud are the same is extremely tenuous – and this is being generous ! Nonsense. Once one begins to look at the alternatives, the Edessa theory fades quickly out of the picture as a likely possibility. Again. I can only repeat that to stick to the Edessa theory without even mentioning more plausible alternatives for the arrival of the Shroud in northern France is simply bad history. A bad history is what you and the ‘Academia’ do. I think myself that the blind prejudice lies in sticking to one possible, but extraordinarily unlikely, solution so dogmatically that one is not even able to consider others. You seem to dogamtically reject the possibility of Wilson being right, clutching at straws just to discourage the people to it..","date":"2014-01-19","mins":"11:14 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74883","author":"o_k","post":"The answer you have in the last sentence. All the other miraculous cloths that exist (such as the Veronica vail or the Mannopello vail) have nothing to do with the real Mandylion. Really? Check the number of common traits, and then you see….","date":"2014-01-27","mins":"5:43 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74977","author":"o_k","post":"I prefer to follow good sense Or rather nonsense. Good imagination is absolutely necessary here, while I regrettably see a lack of it on the part of yours. Look, it’s evident that all those “miraculous images” can’t all be authentic. And why believing that even one of those can be? Just wanted to remind you there are currently 1 2 “miraculous images” of Jesus in the world. And if they are now, than they were certainly hundreds years ago. The question is where? And to answer it, one should treat the matter and those sources seriously, instead of gibberish talk that “Wilson’s hypothesis is dead wrong and that all those images supposedly “not made by human hands” were false relics.” Just once again I ask, what cloth could be the original Mandylion? What corresponds to the descriptions?.","date":"2014-01-28","mins":"11:59 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73698","author":"o_k","post":"Now time to adress Yannick: This post by O.K. (along with the opinions of Scavone and Tycner Wolicka) proves what I always say: in historical research, you can make all kinds of extrapolations… Of course… 4 Since the terms “Mandylion” and “Image of Edessa” were well known in Constantinople at that time, there is no good reason why Constantine VII would not have used one of them in his list if he would really have wanted to include the Mandylion in his list of relics of the Passion. Reminder: the term Mandylion itself first appears around 990 in a biography of a monk Paul from Mt. Latros (although I saw claims of earlier apperance) and is quite rarely used. The Mandylion is described in various sources as mantile, himation, tetradiplon,cheiromaktron, manutergium among others. Effectively, if we compare the list of Damascene and the list of Constantine VII, we find out that they are VERY SIMILAR in their content and that they DOESN’T mention specifically the Mandylion as being a relic of the Passion. All the lists about the relics of the Passion are very similar, because the set of items was well known, and it not necessarly mean that all those relics were in possesion of Emperors at given time. Some lists include even the Holy Sepulchr itself! Of course, with lots of speculations and extrapolations, people can come to a different conclusion (Scavone and Tycner Wolicka’s point of views are there to prove this), but if we avoid to do those kind of wild spéculations and extrapolations (like I think I have just done so) It is impossible to avoid wild speculations here and you hadn’t done so. Your reasoning has several hidden assumptions, of which you are maybe not even aware. For example you assume that John Damascene knew the true nature of the (contemporary version) of the Mandylion in Edessa, which is not certain, he probably knew only legendary version of it. You also assume that Constantine VII shared Damascene views, which is another assumption. And so on. A few words to Dave: The Shroud Arcaulf saw in Jerusalem was said to have been given to Charlemagne in 797 AD, and may have been the “Shroud of Compiegne” in the south near Toulouse, and destroyed during the French Revolution. We don’t know whether it was the same Shroud. Perhaps, or perhaps not. There is a document, mentioned by Waliszewski and van Haelst, suggesting that in the 9th century the Shroud was still in Jerusalem. There is another latin document from 1190 suggesting that some shroud, or copy of it, along wit some fragments of the Crown of Thorns were given to Charlemagne (confused with Charles the Bald). The matter is extremely complex there. It seems also that the Shroud of Compiegne and Sindon Munda from Kornelimünster, which exists up to this day, were two halves of the same cloth, 4 metres long, 1 wide. And BTW: Compiegne is in the northern France. Perhaps you confused it with the Shroud of Cadouin, almost certainly a fake from the 1st Crusade times. There’s little doubt that there are significant errors in Wilson’s complete theory There are no significant errors in Wilson’s theory, although some minor details are debatable. Except that Wilson omitted (or rather deliberately skipped) one thing, that may be the key here….","date":"2014-01-19","mins":"11:43 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73839","author":"o_k","post":"Charles: Because I am open minded to all possibilities and I get frustrated to find that so little research has been done about so many aspects of the Shroud! Except the Mandylion theory of course. Ladies and Gentlemen: The more nonsense Charles puts in this thread the more convinced I am that Mandylion theory is correct. Because, instead of facing the arguments presented in article directly, he is going with some gibberish talk about ‘direct routes from Jerusalem to Lirey’ knowing well that there are none. Because the Shroud was nothing else, but Mandylion brought to Constantinople in 944. That’s deadly threat to Charles believes in medieval provenance of the Shroud, and that’s why he tries to turn historical research into a way with unavoidable dead end. Open minded… rather dishonest, and desperate. Yannick, I will address some of your thoughts later on..","date":"2014-01-20","mins":"2:56 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73849","author":"o_k","post":"Now Yannick, I will adress what I think are the most important issues you raised in your posts: Almost everytime you find a reference in an ancient source about the Mandylion (or the Image of Edessa), you also find a pretty clear reference to the Abgar legend! Not true, there are no references to Abgar nor even Edessa in the Robert de Calri’s version for example. And the lists of relics while mentioning an item that could be either Mandylion or the Shroud, rarely give precise description what is it, or references to Abgar legend. Thus confusion sometimes. See Scavone’s paper http://shroudstory.wordpress.com/about/acheiropoietos jesus images in constantinople the documentary evidence/ For example: “In 1200 the inventory of Antonius of Novgorod similarly names two linen cloths: linteum and “linteum representing the face of Christ” Riant, Exuviae 223:. . . Monstrantur in aedibus aureis Caesaris: Crux veneranda, Corona [spinea], Spongia, Clavi, iterum Sanguis, Chlamys purpurea, Lancea,. . . Linteum faciem Christi repraesentans. . .; quae omnia in sola ecclesia parva B. Dei Genitricis reperiuntur. Is it the Shroud or the Mandylion? After all, from ancient sources, we know that other relics of Christ’s Passion (like the lance, the sponge, the wood of the cross, the crown of thorns, etc.) were transferred that way directly from Jerusalem to Constantinople for their protection, without ever spending one day in Edessa… Question: Why those transfers are known and not the transfer of the Shroud? Not all of those transfers are known the transfer of the lance or the Crown of Thorns are unknown, for example. Sorry, but this is another pure extrapolation made by people who desperately want to back up the hypothesis of Wilson. First of all, in the Narratio, we can find 2 versions of the same legend and one of them still locate the action before the Passion of Christ (which can be seen as the “traditional” version of the legend). This is important because if the second version was due to a better understanding of the hypothetical bloody nature of the Mandylion, it is highly probable that the author of the Narratio would have only kept the new version (while putting the focus on the presence of blood in the sweat, which is not the reality), while leaving aside the “traditional” version of the legend. No, he couldn’t. Remember, this is Byzantium. Despotic Eastern society. Some things cannot be related there directly, but only in a hidden, suggestive way. You must read between the verses to understand the proper meaning of the message. Imagine such situation: the long awaited legendary Mandylion arrives in Constantnople, and then suddenly comes some high ranked priest and shows them the relics, and tells to the people: “Sorry guys, the whole traditional version of the Mandylion legend that your grandmas told you while you were children is simply a bulls&*%^. It was not created before the Passion, look there are bloodmarks visible. Moreover, contrary to the false old version, it is not the image of the face, but the burial shroud. The whole hitherto tradition was nothing but a bunch of lies.” Of course such scenario was impossible. And so it was impossible to discard the traditional version. Instead, a new version was suggested. But only suggested, with a subtle indication (but only indication!) that it is the correct one! Read that part of Naaration, and you understand. It clearly states that this version was “previously unknown”, and that it is “not unbelievable or lacking witnesses” Those are only suggestions. There is not even directly mentioned that there are bloodmarks on the Mandylion (which would discredit the “traditional” version) but there are clear allusions to them, and everyone knows the point! It is a mastery of composition of the text. And no word is used there without a reason. Thus there cannot be the slighest doubts to the presence of bloodmarks on the Image of Edessa. Secondly, and this is more important, the location of the action in Gethsemane is probably due to the presence of the word “sudarium” in another previous manuscript of the legend, which is used to describe the cloth that was used to Jesus to wipe his face, leading to the miraculous imprint. This previous manuscript if called “The letter of the three patriarchs to Emperor Theophilus of Constantinople”, which is dated to the first half of the 9th century. Even though this text used the word “sudarium” to describe the cloth with the miraculous imprint, it still located the action BEFORE the Passion of Christ (the letter specified that the miraculous imprint happened “while the Lord and Saviour was on earth”), which is similar to the “traditional” version of the Abgar legend, which locates the miraculous imprint some days before the beginning of Jesus’ Passion! In fact, it most probably used that term “sudarium” simply because the author of the text said that it was Christ’s sweat (instead of the water he used to washed his face, which is found in the first versions of the legend) that was used by him to produce the miraculous imprint OF HIS FACE ONLY (the text is specific about the fact that Jesus only wiped his face with the cloth). Note that, in this version, the sweat of Christ had NOTHING TO DO with the bloody sweat described by St Luke in the story of the Passion… No chance Yannick. The allusions are clear, and I see no other possibility than the real presence of the bloodstains on the Image of Edessa. Otherwise, the whole story of Gethsemane wouldn’t have been even invented for what damn purpose? And my advice: forget all those fairy tales, about creating the Mandylion before the beginning of Jesus’ Passion. Forget the “traditional” story, forget the Gethsemane version, forget the Damascene or Acts of Thaddeus for a moment. It is all eyewashing. It is all irrelevant here, at this moment. The only important thing is what Byzantines saw on the so called Image of Edessa, when it was brought to Constantinople on 16 August 944, and went into procession through the whole city..","date":"2014-01-20","mins":"3:45 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73923","author":"o_k","post":"And concerning the 3 other relics (the wood of the cross, the sponge and the lance), there really is a reference about their direct transfer from Jerusalem to Constantinople. I found it in a very interesting paper entitled “Sacred relics and Imperial Ceremonies at the Great Palace of Constantinople” that was written by Helger A. Klein in 2006. In this paper, we learn that this transfer happened in 629 and was reported in the manuscript “Chronicon Paschale”. Yannick, amy I ask you what relics are you talking about? We know from Arculfus relation that the lance was still in Jerusalem in 670 AD..","date":"2014-01-21","mins":"9:40 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73936","author":"o_k","post":"Charles, this is the same lance as in Constantinople. Arculfus reports: Arculf also saw that spear of the soldier with which he smote through the side of the Lord as He hung on the Cross. The spear is fixed in a wooden cross in the portico of the Basilica of Constantine, its shaft being broken into two parts: and this also the whole city of Jerusalem resorts to, kisses, and venerates. Http://faculty.colostate pueblo.edu/beatrice.spade/seminar97/arculf/arculfus.htm The shaft of the Constantinople lance (later transferred to Vatican) had also broken shaft a part of which was sold to Louis IX, As to the lances, there were 6 or 7: 1. The Holy Lance from Jerusalme, later transferred to Constantinople, and the shaft to Paris, finally transferred in 1492 to Rome. 2. The Holy Lance from Vienna the alleged St. Mauritius lance (the other legend). It was only in medieval times the two lances (longinus and St. Mauritius) became combined into one. 3. The Holy Lance from Kraków. A copy of Vienna Lance 4. The English Wikipedia claims that another copy was sent to Hungary around the year 1000. 5. The Holy Lance of Antioch. Most probably a fake, introduced to boost morale of the Crusaders. Some claims that it was transferred to Byzantium 6.Holy Lance of Echmiadzin. Definetly not authentic. Polsih Wikipedia claims it is the same as the Holy Lance of antioch, but this is unsourced and highly doubtful. 7.The Holy Lance of İzmir (Smyrna). The Polsih Wikipedia claims (again without sources) it to be a copy of Echmiadzin Lance. Perhaps the Holy Lance of Antioch? Charles , can you stop dishonestly spreading nonsense, please?.","date":"2014-01-21","mins":"10:28 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73705","author":"o_k","post":"And now it seems, that neither Charles, nor Yannick, despite speaking many truisms and arguments that are good but irrelevant here, refuted the main argument presented in the article above. They rather tried to avoid it, directing discussion on other tracks. So to the point: the set of the documents from Constantine VII epoch is an extremely interesting one, as it gives us through various allusions the characteristics of the Mandylion transferred to Constantinople in 944. Reading between the lines (the ability which ‘Academia’ certainly does not possess) one can guess what this item was. And here we have: * reference to image created by sweat and blood in Getsemanne in Narratio, clearly showing there was a blood on the Mandylion, and that the image was extremely faint, like sweat imprint. * the same in the sermon of Gregory Referendarius, along with the allusions to the side wound, leaving little doubt that it was actually there (why otherwise would he have even mentioned this?) * previously unmentioned Chronographia by Symeon Magister, who wrote that contrary to Constantine, his two brothers in low, sons of usurper Romanos I Lekapenos, didn’t see the image (thus they were unworthy to wield power in God’s eyes). This is commonly reported trait of the Shroud, if you are too close, you cannot see anything. * Some vague expression in 958 Constantine VII letters to his troops, suggesting that perhaps there was an image of Christ on one holy cloth in possesion of the Emperor, something previously unmentioned compare with Robert de Clari’s realation. I know only one object that fits all of those characteristics: the Shroud of Turin. Now two simple straightforward questions to Charles, Yannick, and any other opponent of Wilson’s ideas. 1. Could the Mandylion transferred to he Constantinople in 944 be anything else other than the Shroud of Turin? Yes or No. 2. If Yes, then what it was?.","date":"2014-01-19","mins":"12:19 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73961","author":"o_k","post":"Of course, this is impossible to prove such a thing, but I think this is an interesting hypothesis. Yes, interesting hypothesis, that I considered (see my previous post https://shroudstory.com/2014/01/14/arculfus shroud a guest posting by o k/ the only difference is that I related Savio’s view, who, apparently unaware of the 958 letter, considered the transfer of the Shroud around 1050). I am glad, that I helped you in coming to the similar conclusions. The only problem is that the arguments for the Shroud of Turin being the Mandylion transferred from Edessa in 944, are far too powerful. And neither you nor Charles gave any serious answer why in the documents concerning that transfer there are clear allusions to the blood, sweat, and side wound and the possibility that the image may be unnoticed in certain circumstances. Those arguments were of course first suggested by Wilson, Dubarle and others, not by me. So we have at least 4 common traits with the Shroud: 1. Allusions to the blood on the image. 2. Allusions to sweat like, colorless image 3. That image may be unnoticed by some observers in certain circumstances 4. The allusions to the side wound. How many more coincidences are needed to prove that the Shroud and the 944 Mandylion are one and the same object?.","date":"2014-01-21","mins":"1:34 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73938","author":"o_k","post":"Thanks, Yannick..","date":"2014-01-21","mins":"10:31 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74015","author":"o_k","post":"First of all OK, I must say that the hypothesis I have describe in my recent posts is something I have in mind for some years now! This doesn’t come from your own comments… Fine, I have no problem with that. Just wanted to express that you don’t have to explain me those ideas… And concerning your fixed idea that the Mandylion was the Shroud, I don’t understand why you gave so much credit to some posterior development of the legend, […], while the wild religious context of that era in the Middle East, […], make it pretty evident […] that most if not all of those changes are most probably due to an evolution of the theological views of the Orthodox Church during those centuries,[…]In that regard, the Mandylion was most certainly one of the best “tool” the Church invented and developed to achieve his purpose. Yannick, it really doesn’t concern me right now. The fact is the the Mandylion was used as a tool in theological disputes, but this: 1) doesn’t make it a fake 2) is really irrelevant at this moment. What is important are the 4 common traits of 944 Mandylion and the Shroud. Or do you prefer to list them A,B,C,D? A. Allusions to the blood on the image. B. Allusions to sweat like, colorless image C. That image may be unnoticed by some observers in certain circumstances D. The allusions to the side wound. Neither you, nor Charles, even attempted seriously to explain all those coincidences, assuming the Shroud is not the Mandylion transferred to Constantinople in 944. You run away from those features. I am not interested in ‘direct routes’ from Jerusalem to Lirey, nor theological debates with heretical movements in Byzantine Empire, I am only interested in an answer to A,B,C,D. Question: Maybe I mist it, but I would like you to explain to me how in the world you can think the shroud that Arculf saw could have been the same thing as the Mandylion, while we know that, in 670 A.D., the Mandylion was still kept in Edessa and not in Jerusalem? I don’t understand how you can think the Shroud of Arculf could have been the same thing as the Mandylion… There are many possible scenarios. Some assume that the Shroud was transferred to Jerusalem and later to Constantinople in the 7th century, then, during Iconoclast period in the 8th it was transferred once again to Edessa, where it became (a new old version of) the Mandylion. In theory, it is possible, though improbable. The fact is that the history of the relics may be much more complicated, than everyone thought. When my new post about Titulus Crucis appears on the scene, you will understand. Well the history of the relics may be so complicated as the history of The Fallen Madonna with the Big Boobies painted by Van Klomp. If you watched “Allo, Allo”, you know what I am talking about….","date":"2014-01-21","mins":"5:51 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74024","author":"o_k","post":"No, it has not been edited in Polish yet. Only an interview in some magazine. I agree that most of the criticism comes from either ignorance, or bias. Nihil novi sub sole..","date":"2014-01-21","mins":"6:50 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."}]
