[{"id":"comment-210292","author":"o_k","post":"Hugh: Daveb makes an interesting comment. “We end up with yet another unsatisfactory situation, apparently having put all our trust in those with a claim to know the science, but apparently who knew a lot less than they thought they did.” Without wishing to be dismissive, this is the attitude of many authenticists, whose uncritical acceptance of anything which supports their belief (and, with Mc Crone in mind, an uncritical rejection of anything which doesn’t) has led them to come a cropper when discrepancies and uncertainties are pointed out. I agree with you and Daveb’s comment (with a deep irritation). However, I must also add that attitude of the skeptics (I can name you one honorable exception) is the same, or even much worse. Malice, manipulations, misleading statements, character assasinations, sophistic acrobatics, eristic tricks are the favorite methods of several so called “skeptics”. The latest editorial in TCA is the best example of this way of “research”..","date":"2015-09-13","mins":"12:40 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210304","author":"o_k","post":"It’s not about whether anyone has been commissioned to give any evidence in any case. It is about whether the evidence stacks up; whether all premises presented in the clearest possible way, understandable for all, justify the clearly expressed conclusions. Or in other words: do their claims make any sense, based on all what we know? If some “experts” screwed their job, this can be detected. Pollen identification needs expertise in the field, but identification of badly performed science needs expertise of a completely different sort..","date":"2015-09-13","mins":"4:02 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210311","author":"o_k","post":"I have read Boi’s article. I trust that her assessment is fair. I think there are some lessons from the whole pollen story that need to be remembered by the Shroud scholarship. I hope they will be. I have a large dismay, that some people pretending themselves to be experts and scientists let down my trust. It doesn’t matter whether they are pro or anti authenticity..","date":"2015-09-13","mins":"5:20 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210298","author":"o_k","post":"To your info Charles; your provocation does not move me at all. You have discredited yourself enough in the Shroud world, to be worthy of any serious discussion..","date":"2015-09-13","mins":"2:25 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210270","author":"o_k","post":"In Heller’s book he relates how they used a microspectrophotometer searching for a “soret band” of light spectrum of a tiny speck on the Shroud which would indicate blood. To me that’s down to the quantum level. […] Use of scientific analytical devices that depend on analyzing the spectrum of light of an object, in my view, is analysis down to the quantum level. Yes. But myself, I wouldn’t overuse the term “quantum” (use more precise term “spectroscopic” instead). It may be misleading and besides it sounds bizarre in scientific publications..","date":"2015-09-13","mins":"6:57 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210287","author":"o_k","post":"John: I am not writing for a scientific academic audience. I am trying to reach out to a more general audience. Yes. But in your statements regarding science, try to be as much accurate, as it is possible with regards to a general audience. Less poetry, more precise language. There are too many quack doctors in the field of syndonology. Be clear in your language to avoid the misunderstanding, or even misleading the public..","date":"2015-09-13","mins":"11:02 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210266","author":"o_k","post":"They have been analyzed down to the quantum level John. Can you specify what do you mean by “down to the quantum level”? Regards.","date":"2015-09-13","mins":"5:51 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"}]
