[{"id":"comment-196807","author":"o_k","post":"The assignment of authorship to the gospels is belated (third century) and based on some very conjectural reasons. Gospels are written too late to have been written by some direct witness. Historical and geographical fails and inaccuracies suggest that the authors were not native of Palestine. Bull$%&* http://www.tektonics.org/ntdocdef/gospdefhub.php.","date":"2015-04-19","mins":"3:59 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196809","author":"o_k","post":"Because, actually, the Byzantines had other alleged burial cloths as well, actually there were three of them in Constantinople. Https://shroudstory.com/2014/05/11/the three byzantine burial cloths of jesus/ When they released in 944 that the Mandylion they brought from Edessa is another burial cloth (besides those they had by this time), and not the small kerchief the legend had claimed, they tried to cover up this fact..","date":"2015-04-19","mins":"4:14 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196819","author":"o_k","post":"The primary reason why the mainstream scholarship claims that the gospels were written post 70, are the vague prophecies of Jesus regarding destruction of Jerusalem and the Temple (Mt 24:1 37, Mk 13:1 27, Lk 21:5 28). Based on that, and the ideological premise that Jesus couldn’t predict the fall of Jerusalem (because Jesus cannot be God himself) the scholars claimed that the Gospels were written post 70. But this is purely nonsensical argument. The prophecy of destruction of the Temple is clearly stated for example in the Old Testament Book of Daniel (Dn 9:26 NIV After the sixty two ‘sevens,’ the Anointed One will be put to death and will have nothing. The people of the ruler who will come will destroy the city and the sanctuary. The end will come like a flood: War will continue until the end, and desolations have been decreed.), to which Jesus’ eschatological speech strongly refers. The claims that the Gospels were written post 70 have actually no basis. But for the obvious reason (if the Gospels were written before 70, in the Second Temple period, during lifetime of the direct witnesses, they would be hard to undermine), the academic pseudo scholars promote this absurd view as a holy scientific truth..","date":"2015-04-19","mins":"6:32 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196821","author":"o_k","post":"As for geographical “errors” in Mark, they are not Mark’s errors, but invented by the sceptics (utilizing and manipulating brief relations in Mark 5:1 and 7:31) to discredit him. They see some problem, their present their only correct view (based usually on very uncertain premises we don’t have a full knowledge of the 1st century Palestine geography), they make conclusions Mark is unreliable but they took no effort nor any goodwill to find satisfactory resolution of the problem. Which is certainly possible http://lewandowski.apologetyka.info/ateizm/czy marek popeni bedy geograficzne i kulturowe w swej ewangelii,283.htm.","date":"2015-04-19","mins":"6:41 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196887","author":"o_k","post":"Yes, There were aproximately 64 in the Middle Ages. Fine. Then list them all..","date":"2015-04-20","mins":"3:29 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196811","author":"o_k","post":"And what’s the problem? There were likely several other cloths as well, besides the Shroud of Turin, used during Jesus burial..","date":"2015-04-19","mins":"4:18 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196888","author":"o_k","post":"David Mo: Only a few christians exegetes maintain today that the Gospels are internally, geographicaly and historicaly coherent. The same for the authorship. The same for the “first hand” testimonies. And there is a practical consensus in dating the Gospels between 70 and 120 A.C. (approximately). Only fundametalists and mythists disagree on this point. But Oskar call all the other exegetes and historians “pseudo scholars”. Bravissimo! Yes, they are pseudo scholars. So bud. Give us examples of those geographical and historical errors. And also give us the reasons why the Gospels are dated between 70 and 120 A.C. The mere “authoritative” opinion of academic scholars does not count hard evidence for dating please. We will see how much easy this “practical” consensus is to rebutt..","date":"2015-04-20","mins":"3:36 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196936","author":"o_k","post":"Dating of the Gospels is pretty straigthforward. You start with the Acts of Apostles, which end during Paul’s two years imprisonment in Rome, circa 62 AD and at this point Paul is alive and well, no info about his martyrdom in 64 67 AD. Using standard way of dating text (which, strangely is not applied to the New Testament by the most “scholars” contrary to other classical texts) this firmly dates Acts to 62 AD (had they not been part of the Bible, no scholar would ever question this dating). Now to the Gospels. As we know that the Acts were written by the same author as the Gospel of Luke, as a second volume, we know that Gospel of Luke must have been written before Acts, perhaps about 60 AD. As the Gospel of Luke seems dependent on Gospel of Mark, it must have been written earlier, perhaps in the 50s or even 40s. As to the Matthew, as it is also dependent on Mark, but not directly dependent on Luke, it must have been written parallelly to the latter, circa 60 AD. The aramaic prototype of Matthew, mentioned by several Church Fathers may be earlier, perhaps dating to the 40s. As for John, he must have written after the death of Peter (64 67 AD) but there are no direct indications about destruction of the Jerusalem, so it is likely to be written in 67 70 AD. But later date, up to 100 AD is still possible, though there are no convincing arguments for it..","date":"2015-04-20","mins":"12:05 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196900","author":"o_k","post":"Charles, I presented my arguments and/or links to the apologetic site http://www.tektonics.org/ntdocdef/gospdefhub.php where you can find more of them. It is now up to you and Mo to prove the case of Gospels being dated after 70 AD. So far you have presented no arguments to back it up. Academic “consenus” is no argument at all before Copernicus there was a “consensus” about geocentric system. It is up to you, and your academics, to show convincing arguments that the Gospels were written post 70 AD, based on hard data and not the “authority” of some overhyped “scholars”. So: what concrete data show that the Gospels were written post 70?.","date":"2015-04-20","mins":"5:43 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196974","author":"o_k","post":"Hello Dave. Mostly agree, but: Thus Luke’s mise en scene traverse is Nazareth – Jerusalem – Rome! The church is now “global”, has “arrived” and this makes for a satisfying conclusion. Luke is not interested in recording the death of either of his leading characters Paul or Peter, it is not part of his “proclamation” and its omission is a weak argument for assigning either Acts or Luke a prior date. That’s hypothesis (and rather proposed ad hoc to maintain the late dates for the Gospels), not the facts. The facts are that neiher Paul’s nor Peter’s death are recorded in Acts and the simplest explanation is that it had not occured yet when Luke was finishing Acts. Otherwise such omission, contrary to what the readers knew, would be extremely strange. …I think all these are strong arguments for a relatively late compilation of the gospels. I don’t think so. The mission to gentiles started very early, with the baptism of Cornelius (if not earlier). The actions and sayings of Jesus would have given rise to many oral traditions, and typical of such societies would soon have acquired a set form to be learned by rote by those trained to proclaim them. They would have soon been committed to writing….It is not necessary to assert an earlier compilation into their present final form. Nor to deny it. There is nothing that would preclude the creation of the present Gospels before 70 AD. The only reason why they are dated after 70 AD is the anti Christian sentiment for which a claim that the Gospels are late written, falsified documents is a necessity. To defend this view, they utilize every weak (or even imaginary) argument, disregarding much stronger arguments for pre 70 authorship of the Gospels by traditional Four Evangelists. Breaking every rule of classical source analysis, just to obtain their goal (not to say about dirty tricks, if you support pre 70 dating you are mindless religious zealot)..","date":"2015-04-20","mins":"4:54 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-197019","author":"o_k","post":"Sorry, I haven’t time to discuss an anonymous pamphlet. I advise you to go to more serious reads. John P. Meier (SJ), for example. I don’t agree with him in some things, but he is not a sceptic nor a “pseudo scholar”. That’s what I expected, Mo. You don’t put forward any arguments against mine, you just mention the name, and claim that Gospels are late because “he told that”. That’s all you can. Chicken. As for the Shrouds: A list of some complete shrouds (except evident copies) is provided by Lombatti. That’s 16 not 64. Some of them are smaller coifs and handkerchiefs, some of them are likely small fragments, some of them are extant, some of them are lost, some of them are likely to be authentic (Turin, Oviedo, Cahors), some of them perhaps may be fragments of authentic cloths (fragments from Paris, and perhaps from Rome, if coming from Constantinople), some of them are clearly non authentic (Cadouin, a spoil of crusades), some of them are merely copies of the Shroud of Turin (Besançon and Lisbon) and so on. All of them have very interesting stories, yet I don’t see industrial production of fake shrouds..","date":"2015-04-21","mins":"3:16 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196985","author":"o_k","post":"When we come to the gospels, all of this seems very much in the past. The Gospels are stories about Jesus, not the problems (greater or smaller) of the early church. Further evidence is suggested in the destruction of the temple, omitted in earlier Mark, but which seems to have already happened “as prophesied” in the other three gospels, although perhaps it might not have been so difficult to foresee. There is nowhere a mention that the prophecy has already fulfilled contrary to for example, prophecy of Peter’s death in John 21:18. With the expectation of an early Parousia, little point in committing the account to writing would be seen, as everything was soon to come to an end. Parousia. This modern pseudo theory, and really absurd one. According to it, Jehovah’s Witnesses for example should not write anything. Can you (or anyone) give real (and not imaginative) reasons why the Gospels couldn’t have been written before 70 AD? Besides, I recommend reading this, for example: http://www.tektonics.org/ntdocdef/mattdef.php http://www.tektonics.org/ntdocdef/markdef.php http://www.tektonics.org/ntdocdef/johndef.php.","date":"2015-04-20","mins":"6:36 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-197091","author":"o_k","post":"Your evaluation of the consensus of NT scholarship as worthless, is your own personal subjective judgement having no good standing, and as you say leaves you open to a charge of fanatacism rather than demonstrating objectivity Yes Dave because it shows how this “consensus” looks like. They do not have any conclusive evidence for dating Gospels post 70, yet they claim it as a fact. You claim the Gospels were written before 70 AD you are religious fanatic. You claim the Gosples were written after 70 AD you are “objective”. Similar issue with the Shroud. You dispute 1988 C14 tests, and maintain it is authentic you are mindless fanatic. You claim that 1988 C14 tests ultimately exposed the Shroud as a fake you are “scientific”. This is a mafia way of handling things… You are concerned that a later compilation of the gospels compromises the argument for their factual reliability I didn’t claim that. My point is entirely different. It is about how easy they would have been to undermine, had they been written either before or after 70 AD. If they were written before 70 AD, when the Temple stood still, there were Jewish authorities, many witnesses alive then claims that Gospel image of Jesus has been fabricated by the disciples would be virtually pointless case. But if the Gospels were written after 70 AD, after destruction of the Temple, wiping out the system, destruction of archives, and when there were few witnesses alive then the critics have much easier job in claiming that the Gospels were late, fabricated documents, with no reference to historical Jesus. That’s what the critics need, and that’s why they insist on post 70 AD dating. For me, it is largely irrelevant, whether the Gospels were written before or after 70 AD they still may be true. But for them, it is crucial..","date":"2015-04-21","mins":"4:04 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-197030","author":"o_k","post":"Dave: OK: The only argument you seem able to muster for a pre 70 AD compilation of the gospels is that the death of Peter and Paul are omitted in Luke’s book of the Acts. I have already given reasons why this is an inadequate argument. You have given potential reasons why Paul’s death is omitted, a HYPOTHESIS (very weak) invented to defend a priori assumption that Gospels were written after 70 AD. But this is turning everything upside down. Meanwhile Acts end this way (28:30 31, NIV): For two whole years Paul stayed there in his own rented house and welcomed all who came to see him. He proclaimed the kingdom of God and taught about the Lord Jesus Christ—with all boldness and without hindrance! See? Those words would have been extremely bizarre, had they been written after Paul’s death, a fact well known to the readers of Acts. That’s why the so called New Testament scholars produce impressively sophisticated “justifications” why author of Acts decided to put an end here (a sufficiently capable idiot may produce extremely complicated and advanced justifications for pure absurds to sound “wise”). I don’t claim that dating Acts to 62 AD is absolute yet given this passage, it is a very solid evidence. It is a normal practice to date ancient text by looking for known facts which are mentioned there, and which are not mentioned there, giving chronological boundaries. And there are more arguments to support pre 70 dating of the Gospels (although not as strong). For example, only John, writing after Peter’s death mentions that he was the the disciple that cut High Priest servant’s ear which suggest that the Synoptics omitted this to protect (still alive) Peter. Cannot see how you can call the Parousia a pseudo theory. If everything was going to come to an early end, there would seem to be little point in leaving any kind of early record for any posterity. Clearly when the Parousia did not happen as expected, this perception changed. Yes, this is pseudo theory. Nonsense invented to justify claimed non existence of Gospels before 70. First of all the Gospels were not written merely for posterity, but contrary, as a written record for contemporaries. Secondly: The apocalyptic believes of any group are no reason at all for this group to abstain from writing down (and propagating in a written form) their views. This is just pure nonsense invented by some wise guys, completely detached from the every day experience (see for example Jehovah’s Witnesses and their production of literature). Matthew’s “prophecy” of the destruction of the temple seems to already have occurred. The “abomination of desolation” is a phrase adopted from Daniel which refers to Antiochus Epiphanes erecting a statue of Zeus Olympus there, and is equated with a similar subsequent desecration of the temple by the Romans, which seems to have already occurred. There is nothing in the New Testament that this has already occured. The Jesus’ eschatological speach is strongly derived (almost copycat) from Daniel, who predicts destruction of the Temple: Dn 9:26 NIV After the sixty two ‘sevens,’ the Anointed One will be put to death and will have nothing. The people of the ruler who will come will destroy the city and the sanctuary. The end will come like a flood: War will continue until the end, and desolations have been decreed. Of course the Anointed One (and the Son of Man), according to Jesus is Himself. He will be put to death, and after that, the Temple will be razed down, as Daniel prophesized. And that’s all. As this eventually happened, modern so called scholars claim that this was prophecy ex eventu. Disregarding Daniel completely (because it is inconvenient for them). But this purely ideological stance. I suggest that the literate character of your modern western experience blinds you to the strength of oral traditions in pre literate societies, which traditions and pericopes formed the basis of the original gospel sources. But this was not pre literate society, contrary this was relatively highly literate society, and the message could have been put to write almost immediately. No obstacles there. The consensus of all main stream New Testament scholars is that the gospels of Matthew, Luke and John were all written at some time after 70 AD. The consensus… the worthless consensus, based not on the hard data, but on the authority of the scholarship “priests” and intimidation (if you support dating before 70 AD then you are not a scientisct but religious fanatic). I recommend you one thing: read some scholarly works on the New Testament, then read some apologetic works (without a priori prejudice for neither group), compare their arguments and decide which are more rational and make more common sense..","date":"2015-04-21","mins":"6:22 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-51818","author":"o_k","post":"Louis, it was discussed here: https://shroudstory.com/2013/09/23/the eucharistic miracle of buenos aires/#comments and perhaps in a few other places..","date":"2013-11-17","mins":"6:58 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51825","author":"o_k","post":"Not one single world of this is true. Really Hugh? I have at least seen the picture of the cover of WHO report. A book about Miracle of Lanciano is on the way to me, I’ll check when I get it..","date":"2013-11-17","mins":"8:08 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51821","author":"o_k","post":"Louis: see also discussion in this thread: https://shroudstory.com/2013/11/06/of similarities the tunic of argenteuil and the shroud of turin/ I am now wondering if the scientists at the WHO overlooked the factor that Kelly mentioned. What do you have on mind? Remember that the blood on Miracle of Lanciano, Tunic of Argenteuil, Sudarium of Oviedo and TS, although probably belonging to the same person, is different kind on each of these relics. On the Tunic of Argenteuil the fresh living blood was shed. On TS the bloodstains are most likely exudates of moistened (or re moistened) blood clots. On Ovieto it is post mortem blood mixed 1:6 with pleural fluid (or whatever it si called). On Lanciano it is blood from heart in the agonal state, as far as I remember..","date":"2013-11-17","mins":"7:39 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51909","author":"o_k","post":"Hugh: Not one single world of this is true.” Refute, please. We are talking about this: http://en.wikipedia.org/wiki/File:Eucharistic Miracle of Lanciano   public documentation   Ruggero Bertelli.JPG This story is so often uncritically repeated (without any reference) that I began to doubt it myself. I’ll check it back in Nicola Nasuli when I get it. Anyway, if the story is true it would be nice to find this report, if is false, then to find how it originated. It really is not so much important whether there was such report or not. The results of Linoli’s examinations are key here, and I don’t have any specific reasons to doubt them, although sceptics will certainly find some hole in the whole..","date":"2013-11-18","mins":"2:22 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51828","author":"o_k","post":"Yes I know, the Eucharistic Miracle of Orvieto. As to JPII, remember, I live in Poland. The shelves of book stores here are full of JPII related books..","date":"2013-11-17","mins":"8:22 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51918","author":"o_k","post":"Correction, this: http://commons.wikimedia.org/wiki/File:Eucharistic Miracle of Lanciano   public documentation   commissione medica OMS ONU.JPG.","date":"2013-11-18","mins":"2:59 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51925","author":"o_k","post":"Truly I don’t know what the WHO stamps should have looked like in the 70s. Anyway, as I stated, for me this has little relevance on the subject..","date":"2013-11-18","mins":"4:05 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51799","author":"o_k","post":"If you are interested in mine, mass production of faked relics is another myth widespread from the times of Reformation and Enlightment. I am currently preparing an article about relics of burial cloths of Christ venerated through centuries, and they are not so many..","date":"2013-11-17","mins":"5:42 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-30961","author":"o_k","post":"There is a very interesting book interview with Schwortz in Polish, performed by Catholic journalist Grzegroz Górny, title “Oblicze Prawdy, Żyd który zbadał Całun Turyński” (Face of the Truth, a Jew, who examined the Shroud of Turin): http://www.rosikonpress.com/towar karta 151/Oblicze Prawdy.html Unfortuantely it costs too much, and I am out of money for Shroud books for this month..","date":"2013-04-16","mins":"9:43 am","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology"},{"id":"comment-197093","author":"o_k","post":"I am rather more informed on New Testament scholarship than you seem prepared to give me credit. Dave, I am sure you are more informed on NT scholarship but, in my opinion, you still have not released how corrupt and intimidated by the faulty ideas this society is… No disrespect. I once also thought dating the Gospels before 70 AD? Impossible! But the more I read, compared sceptical arguments with those of apologists without a bias I suddenly realised the latter are far stronger and more rational. But on the contrary, much of your argument seems to stem more from religious zeal than objective evidence. Can you point that?.","date":"2015-04-21","mins":"4:14 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-95887","author":"o_k","post":"Thanks Barrie, good words. Truly, even a good quarrel may sometimes put the things straight, and correct some errors… There is a serious one in your interview. Circa 28:00 29:00 you mentioned that mixing linen and cotton was prohibited by the Jewish law, no it was permitted. Actually mixing linen and wool (or in general animal derived yarn with that of the plant origin) was prohibited (but according to Ada Grossi, funeral clothes were actually not obligued to be ritually clean). And one more thing: 24:17 “one of the folks in Turin, who’s a supposed textile expert…” That statement towards Mme Flury Lemberg was not nice… (even despite I disagree with her opinion). The fact is that she actually is a textile expert (and in my opinion that’s root of the problem here)!.","date":"2014-04-02","mins":"1:36 pm","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-47801","author":"o_k","post":"But the list is not visible..","date":"2013-10-17","mins":"4:18 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-47788","author":"o_k","post":"Hugh: “Firstly, I have never read the primary source from which the story of the fire comes in the first place. I do not know if our information is contemporary, or if the first known information comes from a copy of a copy of a copy many years later. Does anybody else?” Hugh see: http://www.shroud.com/pdfs/ssi02part6.pdf Besides, there are Pingonius (who so far I remember described the rescue action), first historian of the TS, and probably numerous other documents from the epoch. Hugh: “For two years the shroud disappears, and then requires the testimony of three bishops and ten noblemen to establish that the one which has mysteriously reappeared is the same one as disappeared two years previously. I wonder why. Wasn’t it obvious? Or were there dark suspicions that the original may in fact have been destroyed?” Yes, there were dark suspisions, or rather unsourced rumors and insinuations spread by the Calvinists remmeber it was in the midst of religious wars in Europe between Protestants and Catholics. In response, Catholics claimed that 1532 was set up by Protestants. BTW: There were also some claims that 1997 fire was also started by arson. Supposedly the police got warning that the fire “may” start. In 1972 there was a previous attempt to set fire in St. John Baptist cathedral. The cause of 1997 fire was never determined..","date":"2013-10-17","mins":"3:01 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-59493","author":"o_k","post":"Essentially Zugibe. Barbet addresses the Shroud image of the feet. Zugibe argues from principles and generalities. My money remains on Barbet! Obviously you have a right to do so, but: The Shroud image of the feet may be misleading. We don’t know whether both feet were put on each other and nailed with a single nail. They may be nailed separetaly through the heels (see:) and later joined together to put the corpse on the Shroud. Accidentally, the both feet imposed on each other, giving the wrong impression of a single nail used. Remeber, Barbet died in 1961. Only in 1968, the Jehohanan’s ossuary was found. Which proves that Barbet opinion: He considers that the Malijay theory locating the crucifixion in the direction of the heel cannot be sustained. Is wrong. The Jehohanan example illustrates not the difficulty, but possibility of nailing through the heel. So far no one has found any evidence that single nail through metatarsal area was used, perhaps, because Jehohanan is the sole victim of ancient crucifixion found! See also those ancient graffiti The first one is Puozzola grafitti near Naples, the second one is infamous Alexamenos grafitti from Palatinate Hill, dated between 60 220 AD. They strongly suggest the feet were nailed separately..","date":"2013-12-14","mins":"4:05 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59534","author":"o_k","post":"The crucifarius was required to carry his “cross” to the place of execution. This could only have been the patibulum, maybe about the size of a timber rail road sleeper. This is feasible for your average rail road man. The complete cross with upright would be far too heavy to be feasible for him to carry. It implies that the upright (stipes) was already in position securely in the ground. If it wasn’t already in the ground, but joined to the patibulum at the site, and the crucifarius nailed hands and feet while lying down, this is far too much work for the execution party to lift the body and cross complete into the hole, and is inefficient. This is another myth, challenged in recent times. New studies suggest the whole cross was actually carried, not just transverse beam, see http://www.acheiropoietos.info/proceedings/Glori Web.pdf The Andrè Marion’s comparison of the blood marks on the Tunic of Argenteui and the Shroud, suggest not only the two objects belonged to the same person, but also that this person carried the whole cross. As to the weight of the cross, we know with a high probability its original dimensions. The cross was slotted into a hole a stone ring (11.5 cm in diameter) serving for that purpose was found in the Church of the Holy Sepulchre in 1986, see Witnesses of Mystery pg. 310 313. It is estimated the cross was no higher than say, 250 cm. The Good Theft Patibulum, currently in Rome’s Santa Croce in Gerusalemme (see Thiede&Ancona The Quest for The True Cross and Pierluigi Baima Bollone Sindone, 101 domande e risposte) is 178 (but originally it was probably longer, say 200 cm) x13 x 13cm. This gives us estimated cross volume of 59767 cm^3. Giving estimated wood density of 0.5 g/cm^3 this would give us about 30 kg. Contrary to widespread myth, it was entirely possible for a man to carry the whole cross. Thus Barbet reconstruction is challenged once more..","date":"2013-12-14","mins":"5:35 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59495","author":"o_k","post":".","date":"2013-12-14","mins":"4:07 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59619","author":"o_k","post":"Based on Shroud Scope: 53 58 mm from the knuckles to the middle of the wound (marked by dark coma like spot in the center). I compared also with my hands (I remind one of my previous posts https://shroudstory.com/2013/11/07/a guest posting by o k on the allegedly too long fingers/). 99 % it is a wrist. Matthias remember also that the image of the body may be slightly distorted (shortened) by the projection on the cloth..","date":"2013-12-14","mins":"8:40 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59620","author":"o_k","post":"Remider to all: the body image resolution is estimated as 4.9 +/ 0.5 mm.","date":"2013-12-14","mins":"8:43 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59822","author":"o_k","post":"Matthias and all: See those two pictures:The error is that you try to measure the distance from the knuckles to the edge of the bloodstain, while in fact, the nail was placed in its middle, probably close to that dark spot..","date":"2013-12-15","mins":"7:39 am","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59288","author":"o_k","post":"Dave: There is no evidence that single nail through the metatarsal was used, the two nails through the heels are more likely IMHO..","date":"2013-12-14","mins":"7:40 am","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59459","author":"o_k","post":"Http://tiny.pl/qwl37.","date":"2013-12-14","mins":"2:55 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-47408","author":"o_k","post":"Louis : As far as I know Hugh will be the next BSTS newsletter editor, therefore his interest in acquiring material. I presume he will find the illustrations in the book better for analysis than those scanned and posted by O.K. He will find the same. I want to remind that Marion was very careful in his analysis of the supposed letters. Their existence is one thing, their interpretation is another..","date":"2013-10-13","mins":"4:55 pm","url":"https://shroudstory.com/2013/10/13/gary-habermas-on-the-shroud-at-apologetics-conference-last-friday/","cat":"news_&_views","title":"Gary Habermas on the Shroud at Apologetics Conference Last Friday"},{"id":"comment-47412","author":"o_k","post":"Yes, but you mentioned just the illustrations which I presume are the same in all editions..","date":"2013-10-13","mins":"5:17 pm","url":"https://shroudstory.com/2013/10/13/gary-habermas-on-the-shroud-at-apologetics-conference-last-friday/","cat":"news_&_views","title":"Gary Habermas on the Shroud at Apologetics Conference Last Friday"},{"id":"comment-47384","author":"o_k","post":"Hugh, you forgot that the pictures were numerically cleared form most of the noise and background. And as Andre Marion wrote in his book, the job he and Courage did on the Shroud was ROUTINELY performed by them on old parchments and papyri. And now simple question. Hugh do you see SB letters on the scans I posted? Yes or No..","date":"2013-10-13","mins":"1:52 pm","url":"https://shroudstory.com/2013/10/13/gary-habermas-on-the-shroud-at-apologetics-conference-last-friday/","cat":"news_&_views","title":"Gary Habermas on the Shroud at Apologetics Conference Last Friday"},{"id":"comment-47378","author":"o_k","post":"Louis : The Aramaic, Latin and Greek letters some scholars see on the relic are even more controversial and I am working on the rationale behind the claim and should have some news soon. Louis, they are not controversial, they (or at least some of them) ARE REALLY THERE. Only biased opinions of some well known figures in the Shroud world make them controversial. See some scans from two books: 1.MARION, André – COURAGE, Anne Laure – Nouvelles decouvertes sur le Suaire de Turin 2. FRALE, Barbara – La sindone di Gesů Nazareno: Those are the results of André Marion work in 1994. But also see the results of Thierry Castex in 2009: http://thierrycastex.blogspot.fr/ You see. Some of them (NAZARENNUS,m IH(SIGMA)O are hard to guess), but others (PE Zw and particularly SB) are obvious for every child! Letters C and E in the word ‘INNECE’ are also beyond discussion. The whole talking about pareidolia is NONSENSE! So why the existence of the letters is disputed by many, for example Dan and Barrie Schowrtz? I think the reason is simple (Dan please forgive me that criticism!). Because the existence of letters is FACT that the so favored by them Roger’s Maillard Reaction CANNOT EXPLAIN! That’s why the existence of letters, flowers, coins etc. MUST be disputed. Because their eventual existence would be inconvenient fact for that theory..","date":"2013-10-13","mins":"12:54 pm","url":"https://shroudstory.com/2013/10/13/gary-habermas-on-the-shroud-at-apologetics-conference-last-friday/","cat":"news_&_views","title":"Gary Habermas on the Shroud at Apologetics Conference Last Friday"},{"id":"comment-148311","author":"o_k","post":"We have discussed teeth issue here: https://shroudstory.com/2014/07/11/teeth reconsidered/ I stay on the position that teeth are almost certainly visible on the Shroud face negative. However I reject suggestions of any X ray projections, such as the teeth are projected “from the inside to the outside”. The mouth is simply open, that’s the reason. And I see no reasonable reasons to deny this.The mouth is open so logically, teeth are visible. No magic here except for the magic that created image..","date":"2014-09-03","mins":"12:38 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"id":"comment-93201","author":"o_k","post":"Charles: Perhaps also you,as a mathematician, would like to find the average date if Fanti had not arbitrarily adjusted the first date. I am sure it is simple maths for you but it might just end up with an average many years before Christ’s crucifixion and then what? Then We have following results: 752 +/ 400 years (I suppose it is at 2 sigma level so 1 sigma is 200 years, I assume) 200 +/ 500 years (250 at 1 sigma) 400 +/ 400 years (200 at 1 sigma) The average mean is 184 years, and the standard deviation 576 years. But using weighted mean, we have 182 years, and the standard deviation of 123 years, that is 246 years at 2 sigma using of course 1/SD^2 (SD standard deviation) as weights. So still within acceptable boundaries. The rest of the story doesn’t interest me at this moment it is up to Fanti to defend the validity of his methods. Hugh: Just as claims have been made that the C 14 area was not representative of the cloth as a whole, so Fanti’s samples, from fibres vacuumed away from the space between the shroud and its backing, and therefore the weakest and most damaged of the shroud, were also unrepresentative. No evidence this hypothesis is correct, or the effect significant so we have no reason to assume so. As such, any dating made of them using their chemical or physical degradation would almost certainly arrive at a date considerably older – perhaps a thousand or more years older – than when the cloth they derived from was actually made. Remember, Fanti used three distinct methods of dating and results of all of them were on behalf of the 1st millenium BC/1st AD. That greatly reduces probabilty that the Shroud is actually a thousand years younger (that comes from the Middle to High Medieval, circa 1000 1300 AD) than Fanti’s results suggest..","date":"2014-03-25","mins":"5:27 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93196","author":"o_k","post":"Yannick: I’m sure that if someone would have asked Fanti what was the date of Christ’s death, he would have said 33 A.D., exactly like his final dating result Daveb: To average out the results to obtain a magic date of 33 AD might be seen as an abuse of the method verging on pseudo science Folks it is 33 BC ( 33 +/ 250 years) not 33 AD, the one of two presumed dates of the crucifixion (either 7th April 30 AD or 3rd April 33 AD). Guys any dating of the Shroud within the boundaries of, say 1 100 AD will be satisfactionary for pro authenticity camp. There will be never pointing to the exact date not by these methods. Please think twice (and do some calculations if needed) then comment..","date":"2014-03-25","mins":"5:08 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-148329","author":"o_k","post":"No, I don’t think so. I support both. My suspicion is that sardonic grin makes the mouth open. Besides, gravity….","date":"2014-09-03","mins":"2:11 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"id":"comment-94295","author":"o_k","post":"I don’t think the Knights Templar have ever taken possession of the Shroud of Turin. To me, this is another wild fantasy that is not based on real solid historical facts, but much more on wild speculations and assumptions. Important note on this issue: the Knights Templar did not took part in the sack of Constantinople in 1204, which is when the Shroud was most probably transferred to the West… I prefer by far the path of Othon de la Roche, because there is some historical evidences (even if those evidences cannot be taken as real proofs for the moment) to support it. One scenario does not exclude the other. While we can be certain to the high degree that Othon took possesion of the Shroud, it is possible that he, or his descendants entrusted the cloth to the Templars..","date":"2014-03-28","mins":"2:57 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93169","author":"o_k","post":"Charles: We have following results: 300 +/ 400 years (I suppose it is at 2 sigma level so 1 sigma is 200 years, I assume) 200 +/ 500 years (250 at 1 sigma) 400 +/ 400 years (200 at 1 sigma) The average mean is 33.33 years, and the standard deviation 378 years. But using weighted mean, we have 10.6 years, and the standard deviation of 123 years, that is 246 years at 2 sigma using of course 1/SD^2 (SD standard deviation) as weights. The simple math, but perhaps too much for the sceptical minds….","date":"2014-03-25","mins":"3:39 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-94503","author":"o_k","post":"Dave: I suggest a reading of the Scavone paper so that it may be weighed against the Templar hypothesis. Comments? Of course I have read this paper. Multiple times, word by word, when I was writing my article about the relics of the Crist’s burial cloths http://ok.apologetyka.info/ateizm/ile byo pocien pogrzebowych jezusa cz1,749.htm And I found several weak points in it. Scavone writes: Chifflet, convinced that the original shroud was consumed in the St Étienne fire, wrote that in 1377 it was miraculously rediscovered in a niche in the restored cathedral.[…] Now we can demonstrate that there really was a copy of the true Shroud painted by an artist. It was most likely commissioned by Jeanne, now the lady of Lirey, and sent in 1377 as a replacement for the one she had taken out of Besançon between 1349 and 1354. Between approx. 1357, when TS was first displayed in Lirey and 1377 there is a 20 years gap! Although the Shroud of Besancon could have been “discovered” much earlier, as the cathedral was rebuilt by 1377. Scavone next writes: The next episode seems to be a patent and deliberate conspiratorial contrivance. However, instead of destroying the Besançon hypothesis, it rather strengthens it. Chifflet wrote that in 1377 the cloth in its chest was rediscovered by means of a strange light coming from a hidden part of the cathedral. (Remember, it was almost certainly that which was made by the artist in Lirey as claimed by d’Arcis.) Judging from the lapse of twenty eight years (1349 1377) between the fire and “rediscovery”, there could not have been many in Besançon who knew precisely what the original had looked like. In 1377 Archbishop Guillaume III de Vergy (1371 1391) was the fifth in line since the fire. That is to say, four archbishops, who might have been able to compare the replacement cloth with the original, had died. In order to determine if it was the same true burial shroud of Christ previously lost, Chifflet relates that the cloth newly found in 1377 was placed upon a corpse, which miraculously revived. It was thus a Vergy who “verified” by a “miracle” that the new Besançon replacement shroud was indeed the original Besançon shroud. A family cover up to exonerate Jeanne’s departure with the true Shroud is a strong possibility. I dislike it. It is too much conspirational. Similar arguments were used by Leonardo proponents, that the Shroud of Lirey and the current Shroud of Turin were two distinct objects. Anyway, there is still 20 years gap between first displays in Lirey and 1377! This makes the Scavone’s reasoning very unlikely. And another point. Here is the branch of genealogy tree coming down from Otto de la Roche to Jeanne de Vergy: Otto de la Roche >Otto II >Isabel/Elisabeth married Jean de Vergy >Guillaume de Vergy > Jeanne de Vergy. Thus it seems that the Shroud had to been inherited by female heirs TWICE. Not impossible, but EXTREMELY UNLIKELY as both Isabel de Ray and Jeanne de Vergy had brothers. We have no guarantee that by the year 1300 the Shroud was still in the hands of Roche/Ray and/or Vergy or any other related families. For the Templars hypothesis, the most comprehenisve work is Barbara Frale’s The Templars and the Shroud of Turin. See also this http://www.cirac.org/Mandylion.pdf.","date":"2014-03-29","mins":"7:45 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-94970","author":"o_k","post":"You say about this http://www.shroud.com/pdfs/n73part5.pdf Well have you read your books? Because I have. I think her claims, although exaggerated to some degree, are as much valid as Scavone’s about Nicholas de Otranto relation. Both are controversial and can be interpreted in various ways. The difference is that Scavone is usually praised (at least by Americans and other English speakers) while Frale is denounced by the very same audience. Frale’s books are quite specific, and to high degree speculative, although they provide much interesting information about background to tthe history of the Shroud. And notice that Wilson and Frale compete with each other who will publish new discoveries first..","date":"2014-03-30","mins":"3:57 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-57169","author":"o_k","post":"Why in the world he did not ALSO dated his samples with the well accepted C14 method in order to compare the results and see if his new method could have some chance to yield accurate results in the case of ancient textiles? Which samples? From the Shroud? Or from other callibration textiles, used to develop a new method? The latter were in some cases radiocabondated. There is a pretty much material for some new radiocarbondating in the hands outside Turin (Jull sample for example) but no one feels ready to go with carbon dating it, perhaps because the method is destructive, and an intact sample is always a bargaining chip..","date":"2013-12-07","mins":"7:14 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57175","author":"o_k","post":"John Klotz : Dating Jull’s samples at Arizona won’t solve anything because the issue is the anomalous nature of the samples which skewed the results. Obviously Jull’s samples would have the same discredited characteristics. Any new testing would have to be of representative material and probably from more than one site. No, John. That’s why Jull showed this sample. HERE’S THE CATCH. This sample seems to be a part of the original Shroud, but remember IT HAS NOT BEEN DATED! The 1260 1390 AD DOES NOT APPLY HERE!.","date":"2013-12-07","mins":"7:51 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57234","author":"o_k","post":"Charles Freeman : What do you mean by ‘good ‘ result? As I understand it Fanti got three very different results. Only one at most of these can be ‘good’ but which one ? (Unless, of course, the Shroud has been worked on continuously from the middle of the first millennium BC onwards and these varied results reflect this.) Charles see: https://shroudstory.com/2013/04/16/giulio fanti responds to gian marco rinaldis book review/ One interesting quote: In reference to the dating of the Shroud is to observe a surprising result: all three methods, of course, independent of each other, Raman (200 BC ± 500), FT IR (300 BC ± 400) and Multi Parametric Mechanical (400 AD ± 400) provide results that are compatible with one another in reference to the level of confidence of 95%. What is curious it is that just the first century AD, which includes the date of the death of Jesus of Nazareth, is the only century common to the three dating..","date":"2013-12-08","mins":"8:11 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57181","author":"o_k","post":"Jull has the half of A. Donahue has A1, but refuses to show it (https://shroudstory.com/2013/11/10/the mysterious arizona piece/) Rogers had threads from the middle of the sample, between R and A1. The patch could have gone, and abruptly ended everywhere. That’s why there is a trend and great statistical inconsistency among the results. 1 cm up or down, left or right, may mean the difference between 1st and 13th 16th century..","date":"2013-12-07","mins":"8:25 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57270","author":"o_k","post":"“We can assume that any fibers of the Shroud collected from the vacuum extractor had deteriorated more than the fibers still enclosed in the threads. Fibers have, in the course of time, detached from the back of the Shroud and become trapped inside the cavity between the cloths, but those that have would be either weaker or more damaged than those which remained in the threads.” “In addition to the fibers that had already become detached in the past, Riggi’s vacuum cleaner could have detached others while it was working, and those fibres, too, would be weaker or more damaged than those which remained. Fanti’s material is thus shown to be unrepresentative in being particularly deteriorated, so it is no wonder that the age he calculated is more apparent than real.” “One is led to suppose that Fanti for his test has selected the most deteriorated fibres from the Riggi debris!” I see no reason why should we assume so (except of course Gian Marco’s desire to undermine Fanti results). The fibers may be detached from various reasons, perhaps force (coming from vacuum cleaner or tensions while the cloth was rolled up and down) that pulled them out of the thread was stronger in particular places not necessarily that those particular fibers are weaker..","date":"2013-12-08","mins":"1:21 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57120","author":"o_k","post":"Let’s reverse the problem: who in the Shroud research currently accepts the 1988 carbon dating as authoritative? Now let’s see where is the difference with the Fanti’s research. We have two dubious datings: one extremely dubious 1988 C 14 dating to the Medieval, and the one performed by Fanti, using new, not battle proven yet methods, dating the Shroud to the times of Christ. In short, about the datings: we are in the middle of nowhere so far..","date":"2013-12-07","mins":"1:06 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57276","author":"o_k","post":"Is it significant effect? We don’t know. As to your desire, it is very clear you are trying to suggest that the fibers tested by Fanti are much younger than he claims. Mine is of course to counter those suggestions..","date":"2013-12-08","mins":"1:32 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-213561","author":"o_k","post":"The first what I think Dan, is that the Shroud image must be carefully analysed, by those who really have experience with it. And no hasty and too far reaching conclusions should be made without carefully thinking eveything. Now, the second is that bony or veiny hands happen: or just look on mine. Third, here you have a 3 D plot of hands area, with a very rough subtraction of blood (as you can see some contours remained): It is hard to interpret 3 D plots of such tiny details, due to several issues I mentioned in my last paper. Some gaps between metacarpals seem nevertheless evident. The point is: how deep they are. The maximum range for imaging is in my opinion (based on analysis of distances of my facial features), as well as Vignon’s no more than 1 2 cm (Jackson & Jumper 3.7 cm is clealry untenable). Based on 3 D plot we see that the metacarpal gaps have a greyscale intensity of ~ 90 100 (they are white), while metacarpals, and fingers are about 150 160 (green yellow). This would indicate level difference of maybe ~5 mm. Quite possible, especially for dehydrated hands. No X ray is needed here..","date":"2015-10-25","mins":"9:44 am","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-57273","author":"o_k","post":"If I can voice my guess, it isperhaps because the depolymerization of cellulose due to the heat is much faster process, than change of the fibers mechanical parameters..","date":"2013-12-08","mins":"1:27 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-213563","author":"o_k","post":"I see that Whangers, after 15 years, updated their website: http://people.duke.edu/~adw2/shroud/index.html Anyway, as to the teeth images, they are real. They are just where they suppose to be. Here you have my old paper about teeth: https://shroudofturin.files.wordpress.com/2014/07/teeth.pdf Below you have comparison of mouth area for original Enrie’s photo, and after removal of the bands and weave structure: As you can see: the teeth images survived the operation. They are really there But this does not mean that Shroud has X ray properties. No, the reason is simpler and much more terrible; the rictus grin due to the tenure muscular spasms as result of of extreme strain and suffering during crucifixion. Though the teeth are clamped, the lips are open due to the spasm, resulting in visible teeth..","date":"2015-10-25","mins":"10:21 am","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-213577","author":"o_k","post":"Hugh, if those are not teeth, then what are they? Actually if you read my paper on 3 D, you should realise that the whole Shroud image is in fact one great pareidolia or illusion. The image is halftone, made of “dots” of different sizes, made of bundles of fibers roughly the same colored. These dots give the impression of body image and its various features: hands, fingers, hair, face, nose, eyelids and teeth. But physically, they are nothing but dots. Our mind gives them interpretation..","date":"2015-10-25","mins":"3:50 pm","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-213567","author":"o_k","post":"I don’t know what your lower picture is about, Hugh. It shows nothing to me..","date":"2015-10-25","mins":"12:05 pm","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-213571","author":"o_k","post":"Here you have more less the outline of visible teeth:Only a couple of them are clearly visible. But this is enough to reconstruct the outline of a few others..","date":"2015-10-25","mins":"1:10 pm","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-213359","author":"o_k","post":"Robert W. Siefker: As clearly stated at the top of the chart with the word “judged”, this is TSC’s analysis. We have included only 17 image characteristics because we think that these seventeen, in and of themselves, can be used to evaluate image formation hypotheses that have gained at least some traction through the years. The chart itself does not stand alone. Appendix 1 gives our reasoning for each mark. Again it is judgment and if the image characteristics are indeed true, as we judge them to be, understandable to anyone. We also state that the The fall through hypothesis cannot be tested or proven. In fact it is a very “unscientific” explanation as we acknowledge in its description and in the Conclusion. It just fits the data. Read it. Think about it in the context of the whole body of Shroud evidence. Think about it in the context of the whole body of Shroud evidence? So for example: B4.0 (ranked as 1): “(Vertical Mapping /Wrapping Distortions) Image distortions of the hands, calves and torso are consistent with those that would be obtained if a body lying on its back were wrapped in the Shroud. The mapping of image features from the body to the cloth of the frontal image is more or less vertical corresponding to the direction of gravity. Comment: Significant two dimensional planar anatomical distortions exist in the Shroud image and research strongly supports the conclusion that these distortions, which are mainly present on the frontal image are best accounted for by a vertical (or near vertical) mapping of body features upward to a cloth draping naturally over a body.” B10. (ranked as 2) “(Hair is Soft) The hair is soft, not matted, as would be expected if it had been soaked with aromatic substances and blood. Comment: It would be expected that the hair would be soaked with perspiration, blood and be matted close to the head. It could be argued that this observation is subjective in nature. TSC has therefore judged this item to be Class 2 evidence even though this observation could support the presence of an electrostatic charge as a factor in image formation” These two claims have been refuted recently be me: https://shroudofturin.files.wordpress.com/2015/10/3dproperties6 3.pdf There is no vertical projection in general.. And the hair is matted to the sides of the head. Definitely..","date":"2015-10-22","mins":"12:24 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213346","author":"o_k","post":"Dan: One thing you cannot do (by authors’ choice) is copy and paste. This is just plain silly. Ubuntu Linux, and secure formats pdfs are broken..","date":"2015-10-22","mins":"8:50 am","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213849","author":"o_k","post":"Mario: In a few words: that theory exists purely on repeating false statements made in the 18th century but rekindled recently (1981) by a copy of a supposed letter to pope Innocent III dated 1205. The authenticity of that letter is questionable Rumors to spurious sources do not make a strong case. Not in this case. Here you have three testimonies, each spurious on its own, but they back up each other: T1) The 18th century MS826 mentioning Otto as an owner of some Shroud (no matter which) T2) The coffer from Ray Castle allegedly used to transport some Shroud (again no matter whether original or a copy, or whatever). T3) The letter of Theodore Angelus to Innocent III (allegedly 1205), mentioning: “the most sacred of all, the linen in which our Lord Jesus Christ was wrapped after his death and before the resurrection […] in Athens.” Some (for example Nicolotti) maintain its 18th century forgery. The letter comes from Palermo, Sicily, almost 1000 miles away from Besancon. Anyway, the mention of the linen in Athens (ruled by Otto at that time) is complementary to T1 and T2. Now you need to use those “unreliable” sources wisely. 1.) The MS826. You claim that the author made up fanciful stories about other historical facts. Ok. But he claimed that Otto, Duke of Athens once was in possesion of the Shroud. There are two possibilities: A1) He invented the whole story B1) He heard the story from some seemingly unreliable source (rumors), and tried to back it with some documents in a clumsy way. Then the questions arise: If A1, then where the stories about T2 and T3 originated? Question 1: Where and when the tradition of Ray Castle coffer originated? and Question 2: What are the links between obscure MS826, obscure coffer in Ray’s castle and the equally obscure letter of Theodore Angelus from Sicily? Mario, if you dismiss the Otto theory you HAVE TO adress those two questions..","date":"2015-10-29","mins":"1:25 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213758","author":"o_k","post":"Did the people that proposes the theory of Othon de la Roche ever realized that it was first proposed by this 1714 manuscript? Did they realize that it contains many false statements regarding Othon de la Roche and the Shroud? Did they realize that the author of that manuscript is well known to have made up historical stories? As far as I know, they did not. Yes, Mario. For example from the article “Doubts along the doubs” by late Dorothy Crispino http://www.shroud.com/pdfs/ssi14part5.pdf But these do not disprove that Othon de la Roche had the Shroud at one time. Clearly, the author of pro authenticity part of MS826 found some rumor about that, and tried to back it up with some spurious sources. There is a mystery of that wooden coffer from Ray Castle, that Piana describes: http://www.acheiropoietos.info/proceedings/Piana MYHS Web.pdf Where and when, the tradition about that coffer originated? And besides there is still a 1205 letter of Theodore Angelus: https://shroudstory.wordpress.com/about/acheiropoietos jesus images in constantinople the documentary evidence/ (Document XV). Those are (although each spurious on its own) three seemingly independent witnesses about Otto possessing the Shroud. Three testimonies are more than one and need serious consideration. And not primitive denialism in a style of one so called historian….","date":"2015-10-28","mins":"11:31 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213897","author":"o_k","post":"All right Mario, but let’s face the consequences of your claims. Assume you are right: Otto never possessed the Shroud. Then: We cannot count T1, T2 and T3 as independent.T2 is likely a product of T1, and since T1 is fanciful and most likely precede T2, T2 can only be taken as a byproduct. Fine. You claim that someone invented the story of Otto in obscure MS826 (T1). Then it means that at some point later: someone: in cooperation or without cooperations with Otto’s descendants living in Ray Castle installed T2, the alleged coffer used to transport some Shroud, in their castle just to support the claim the Otto had some Shroud. Sounds credible? Maybe… Question: Do you believe that the coffer was deliberately installed (or labelled as used to transport the Shroud) by some conspirators to back the claim that Otto once had the Shroud? T3 happens a long time after T1 Not true. The document was rediscovered in 1981, but is much older. Even Nicolotti, who claims it a forgery, thinks it was made between 16th and 19th century. As for T3, it should be analyzed more carefully, but it does not say that Othon had the Shroud, so it might be unrelated to the Ray castle. My current take of it: it is a forgery and should be analyzed with that hypothesis in mind. It does not say the Otto had the Shroud, true. But this is not a problem, as I have a hypothesis that in 1205 Otto wasn’t the owner of the Shroud yet. So another question: Do you believe in two corresponding forgeries in two obscure documents from about 18th century 1000 miles away?.","date":"2015-10-30","mins":"3:28 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213936","author":"o_k","post":"Mario: And again: How do you explain the transfer from Othon to Lirey? First, this is another issue, irrelevant here. Between Othon and Geoffrey de Charny, the Shroud could pass through many hands during those 150 years gap.We don’t know many fascinating stories that could have happened then. I think that you are thinking that the coffer was at that castle since a long time ago (15 17th century). There is essentially no proof of that, and everything looks like it is a recent modern addition of that coffer shown to the visitors to the castle. From Piana (pg. 2): “Behind these objects there is a wooden coffer with a label, put on it in the twentieth century, on which there is written: 13th century coffer in which was preserved in Ray Castle the Shroud of Christ brought by Otho de Ray from Constantinople. 1206. […] Examining the coffer we can see that the cut is characteristic of the second half of fourteenth century. Actually we know that the only original part of it is the bottom [24].” So most of the coffer is actually a reconstruction, but this is irrelevant. The only thing that matters is that this coffer was considered the one used to transport some Shroud by Otho. The label apparently must have been placed there in agreement with the castle owners, descendants of the Ray family. I don’t see if they had any interest in faking that tradition. T is conceivable that it is one of the owner of the Ray castle who probably started to believe in the story of T1 and guessed that this could be the coffer used. Haven’t you considered the opposite way? That the author of T1 actually obtained the info about Otto from his descendants living in Ray Castle, and then manipulated some sources to provide “documentation”? It is also conceivable scenario. The castle actually is about 40 km away from Besancon, that’s relatively far for pre automobile society, a day or two walk from the city. It is possible that the story of Otto was unknown at Besancon at that time, when the city boasted possession of alleged Shroud. On the other hand, the Shroud going through the Sainte Chapelle have none of these difficulties with extremely reliable documents: inventories of the Sainte Chapelle having a strong pedigree. And strongly reliable historical events (the transfer of the relics from Constantinople). It is a world apart from such scenario as Othon de la Roche. Yeah. So where are documents ascertaining us that the Shroud (not alleged Mandylion) was actually in Sainte Chapelle? Besides one thing can be sure: had the French King been aware ownership of the Shroud, he would never let it go out of his hands. This is nonsense. As for T3, it shows up recently (1981). That is what I meant about T3 being much later than T1. So, it appears suspect considering that T1 is a made up story. What is the age of this copy (letter to Innocent III)? We do not know. It could be modern. A close study of it should be done. No, Mario. The document itself is much older. It was once a part of so called Chartularium Culisanense codex from Palermo, a codex of document of Saint Sophia Order, associated with Sicilian de Angelis family. The Chartularium itself was lost during WWII, but there was a 18th century transcript of some documents (including the letter to Innocent III), testified in 1859 by Benedetto d’Acquisto, arcibishop of Montreal, and former abbot at Monte Casino, considered distinguished humanist. The document is spurious, and as a copy, it is likely interpolated. But that’s not so important, as the info it contains about sacred linen in Athens in 1205. This is consistent with Otto theory. Once again, Mario: Do you believe in two corresponding forgeries in two obscure documents from about 18th century 1000 miles away from each other?.","date":"2015-10-30","mins":"3:57 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-214029","author":"o_k","post":"Mario: “Essential question, which you are avoiding to answer: Do you believe in two corresponding forgeries in two obscure documents from about 18th century 1000 miles away from each other?” I answered already. Yes, I believe so, because these events are known to us as having happened in sequence. T1 occurred, then T2, then T3. Distance is irrelevant because T1 started to be well known by the time T2 and T3 occurred. Is that an answer or not? Answer, yes. But wrong IMHO. Are you sure T1 occured first, then T2, then T3? Can you give dates (or period at least) when T2 and T3 were fabricated? And by whom, for what purpose? As for the Golden Bull, it says only that there was allegedly some undescribed “sanctam toellam” which is “tabulae insertam”. It says nothing what this cloth (if there was actually any inside, which is not certain) was, less it was a Shroud. And still you have to think out how the Shroud allegedly disappeared unnoticed from the reliquary inside well guarded Sainte Chapelle. This sounds ridiculous..","date":"2015-10-31","mins":"6:38 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213949","author":"o_k","post":"There are not two forgeries. Which two forgeries are you referring to? The MS 826 is not a forgery. It is written by a completely incompetent historian. The letter to innocent III: it needs to be analyzed more deeply and dated. But the existence of T1 which makes up the story about Othon is enough to put major doubts in that story. The claim that Othon possessed the Shroud (no matter which) is one alleged forgery. The tradition about that coffer, if false is a second forgery. The letter to Innocent III, claiming the presence of the Shroud in Athens 1205 AD, is the third alleged forgery. In short, there are two possible options: A) Either Othon did not have the Shroud, and then all T1, T2, and T3 are fakes. This is the case if the Shroud was still in Constantinople up to 1241, as Sainte Chapelle theory assumes. B) Or he had the Shroud in possession. Then all T1, T2, and T3 essentially say the truth about that, even if they have several issues with other things. What if A)? This means that all (very obscure to general public, and at least T3 is distanced from the two others) T1, T2 and T3 must have been simultaneously faked in order to create false impression (about 200 years after alleged fabrication in case of T1 and T3 at least) that Othon once had the Shroud. Sounds credible? Not to me. Sounds rather like a big conspiracy theory. One coincidence likely an accident. Two coincidences perhaps still an accident. But three? something must be afoot. Of course. This is an explicit point I discuss on the web page about the theory of the Sainte Chapelle: showing that the Mandylion did read the Sainte Chapelle. See http://sindonology.org/sainte chapelle.shtml#ans:mandylion reach. I do not assume that this the Shroud of Turin. See the five clearly separate questions with answers on the web page http://sindonology.org/sainte chapelle.shtml. Search for “Did the reliquary of the Mandylion reach the Sainte Chapelle?”. I have studied this recently. All you have for confirmation that the Shroud (not just the reliquary!) reached Sainte Chapelle is Inventory A, claiming: 11/24. Item ung escrin de fust peint où il y a ung grant sainctuaire sans escript. (A painted box where there is a large holy relic without identification.) All other reliquaries mention just a box, and not what was inside because the box was likley empty I suppose the word “grant” does not describe physical size. And “sans escript” suggest that they didn’t even look inside. Had the Shroud been there, it certainly wouldn’t have passed unnoticed. I suppose the box did indeed contained the Shroud, but by 1241 was already empty. Compare this with the letter of Theodore Angelus: https://shroudstory.wordpress.com/about/acheiropoietos jesus images in constantinople the documentary evidence/ Theodore Angelus wishes long life for Innocent [III], Lord and Pope at old Rome, in the name of Michael, Lord of Epirus and in his own name. In April of last year a crusading army, having falsely set out to liberate the Holy Land, instead laid waste the city of Constantine. During the sack, troops of Venice and France looted even the holy sanctuaries. The Venetians partitioned the treasures of gold, silver, and ivory while the French did the same with the relics of the saints and the most sacred of all, the linen in which our Lord Jesus Christ was wrapped after his death and before the resurrection. We know that the sacred objects are preserved by their predators in Venice, in France, and in other places, the sacred linen in Athens. . . (there are some asks for intervention later) Rome, Kalends of August, 1205. (my boldings) The Shroud was elsewhere at that time. Just an empty casket remained. And who stole the cloth. There is one suspect already… (and he is not Othon). In Constantinople there might have been other cloths used in Jesus’ tomb (or claimed to be), but only one had an image: what Robert the Clari saw, which is conceivably the Mandylion. Yes. But the fact that there were at least three alleged burial cloths in Constantinople is essential to answer objections of those who claim that Mandylion couldn’t have been a burial cloth, as those are listed separately in various inventories of Constantinople’s relics. More later..","date":"2015-10-30","mins":"6:09 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213979","author":"o_k","post":"Mario: T1, T2 and T3 are not known to have been done at the same time. So, your claim that they were done simultaneously is a major assumption on your part. No – I don’t assume they were done simultaneously (if letter of Theodore Angelus is genuinely from 1205, at least in most part, I can’t). The only think I assume is that they (at least either T1 or T2 and T3) were done independently. Which is likely given 1000 miles distance between Palermo and Besancon. Essential question, which you are avoiding to answer: Do you believe in two corresponding forgeries in two obscure documents from about 18th century 1000 miles away from each other? As for the Mandylion, you forgot the most important element: the Golden Bull of Baudoin II. It states that a cloth was in the reliquary. That document was written in 1247, six years after the reliquary of the Mandylion was received in Paris, and given directly by Baudoin II to Louis IX and the clerics. They would not have verified what that document says compared to what they had? Very unlikely. The golden bull says only about sanctam toellam, tabulae insertam and provides no details. Very unlikely had they known the Shroud of Turin was there inside. And so with the word “toile”. Besides you have written yourself (http://www.sindonology.org/sainte chapelle.shtml#ans:clerics notice ): “It is indeed surprising that if there was a large cloth in the reliquary of the Mandylion, and that it bears a complete body image of a man, that the clerics would not have noticed it. However, the inventories of the Sainte Chapelle gives numerous clues that the clerics barely analyzed the relics beyond their direct observations inside their reliquaries and without manipulating the relics. For example, the authorities in charge of the inventory A did not try to identify more precisely the nature of the relic for item eleven because they wrote “sans identification” (with no identification). This detail shows that the clerics in charge of safeguarding the relics, at the Sainte Chapelle, not only did not know the real nature of that relic but that they were not in charge to find out. This lack of curiosity is surprising for us today, but the clerics did not have the task to deeply analyze the relics, and certainly not in a position to determine their authenticity. Their duty was to safeguard the relics, so that none would be damaged, desecrated or stolen. When inventories were done, they describe what they could see without modifying the reliquaries and the relics. […] This lack of analysis of the relics from the clerics explains the surprising observation that if the Shroud had been folded in that reliquary in the Grande Châsse of the Sainte Chapelle, and inside a trellis attached at the bottom of the reliquary, it is possible that the clerics never analyzed more carefully the relic by detaching the trellis from the bottom of the reliquary, removing the Shroud from the trellis, and unfolding it to see the complete body image.” You are now contradicting yourself. Half seriously, you start manipulating like a professional historian ;) It is equally possible that the reliquary was already empty (since 1204) when sent to Louis IX and no one checked what’s inside, merely accepting the word that it was used previously to hold some great cloth. This is better explanation for all the facts and documents known (including T1, T2, and T3). And it inconceivable that had any King of France been aware his ownership of the Shroud of Turin, he would give it to a mere vassal like Geoffrey de Charny. You can not to bother what de Charnys stated they clearly had some secret to hide..","date":"2015-10-31","mins":"5:34 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213950","author":"o_k","post":"BTW: This academic book awaits for about two years on my bookshelf for me to have it read. The title is “The King and the Crown of Thorns: cult of relics in Capetian France”. Maybe I will find some time already...","date":"2015-10-30","mins":"6:11 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-214204","author":"o_k","post":"1) Interestingly, Alessandro Piana, in the paper you quoted previously, added this comment about the label on the coffer: “As far as the label put on the coffer, according to which the Shroud was in Ray sur Saône castle in 1206, it refers to an hypothesis guessed years ago from local historians, Dunod de Charnage and Perreciot. They stated that Othon, after appropriating of the Shroud, would have gifted it to the Besançon cathedral just in that year [40].” I know, Mario. Besides it is this paper https://www.academia.edu/3663742/Piana Valencia 2012 , not the previous (from ENEA 2010) I quoted. Piana adds: “Besides Perreciot adds that Othon would have sent the Shroud to his father who, in 1206, gifted it. Clash with this belief is the fact that, as described below, Pons de La Roche died in 1203. It is therefore impossible that he received the Shroud in 1206. Moreover, it is unlikely that de La Roche family deprived itself of a relic stolen in Constantinople, gifting it to the local Church. In this way they would have proven the ownership of a relic, that was a punishable fact. All these things make this hypothesis unreliable and thus suggest that the Shroud could have reached Ray sur Saône castle after 1206.” So, if you use this paper as a reference, it would mean that the identification of the coffer would be based on the MS 826, which is fanciful. The coffer would have no basis according to that statement. Non sequitur, Mario. There is nowhere said that the identification of that particular coffer, as used to carry the Shroud, is based on MS 826 (or any other document). The precise date (1206) on the 20th century label is based on this theory, but this is irrelevant (as all other unreliable details). The point is that there is a claim that some coffer was used to carry the Shroud by Otto. This claim can be true or false basing on mere coffer and lack of documents we don’t know but combining this information with other documents (t1 and T3) we can make a good case for the claim that Otto had once some shroud stolen from Constantinople (and for nothing else)..","date":"2015-11-04","mins":"1:10 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213857","author":"o_k","post":"Ps. I’m not a Doctor. But you may still be, don’t you, Hugh?.","date":"2015-10-29","mins":"2:43 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-214158","author":"o_k","post":"The Shroud was never the Mandylion Strong disagreement. It is apparent that the Shroud image was known in Constantinople during Justinian’s reign, and in all likelihood was already there. Not necessary. Edessa at that time was still a part of Byzantine Empire. At this time the Mandylion was still in Edessa, but it was Ian Wilson’s contention that its purported full length image did not become known until after it arrived in Constantinople in 945. I disagree with Wilson at this point. I suppose that some privileged people knew the true nature of then Image of Edessa. But for some reason they tried to conceal the truth. And Byzantines after 944 tried to conceal the truth either. This is evident if you look at their expressions re Mandylion and the burial cloths (see the accounts of Constantine Porphyrogenitus and Nicholas Mesarites for example)..","date":"2015-11-03","mins":"3:57 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-214165","author":"o_k","post":"O.K. Will need to give a satisfactory explanation of the Tarragon manuscript description of the image that was locked away as a result of the earthquakes. It certainly was not the Mandylion which was frequently displayed in public. Fancy tale.It shows how Markwardt conveniently chooses details which fit him, ignoring other explanations. Http://www.shroud.com/pdfs/stlmarkwardtpaper.pdf There is in the same glorious city, the face of our Lord Jesus Christ on a linen cloth, made by Jesus himself in the following way, as the Greeks say. The above mentioned King Abgar was in the city burning with a great desire to see the beautiful face of our Lord. Jesus knew of the king’s desire and so took a linen cloth and wrapped his face in it—the form and figure of his face was imprinted on to the cloth. The Saviour thus sent his face to King Abgar on the linen cloth, so that he might see what he looked like. This wonderful linen cloth with the face of the Lord Jesus, marked by direct contact, is kept with greater veneration than the other relics in the palace, and held in such esteem that it is always kept in a golden case and very carefully locked up. And when all the other palace relics are shown to the faithful at certain times, this linen cloth on which the face of our redeemer is depicted is not shown to anyone and is not opened up for anyone except the emperor of Constantinople. The case that stored the holy object used to be kept open once, but the whole city was struck by continuous earthquakes, and everyone was threatened with death. A heavenly vision revealed that the city would not be freed of such ill until such time as the linen cloth with the Lord’s face on it should be locked up and hidden away, far from human eyes. And so it was done. The sacred linen cloth was locked away in a golden case and carefully sealed up, and then the earthquake stopped and the heaven sent ills ceased. From that time on nobody has dared to open the case or to see what might be inside it, as everyone believes and fears that if anyone tries to open it the whole city will be struck by another earthquake. The reference of King Abgar clearly provides link to the Mandylion. And as to earthquakes convenient excuse for keeping the Mandylion closed, and keep its true nature a secret…. There were probably many earthquakes in Constantinople, not only those that fit Markwardt….","date":"2015-11-03","mins":"6:37 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-214164","author":"o_k","post":"Thanks Louis. As I said: Markwardt borrows heavily from Pfeiffer but disregards the latter’s views on that matter (because they are inconvenient for him)..","date":"2015-11-03","mins":"6:21 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-189319","author":"o_k","post":"$4,300,000.00 ! As far as i recall the whole STURP investigation costed less than 2 million bucks, comparable sum, even considering inflation..","date":"2015-02-05","mins":"6:40 am","url":"https://shroudstory.com/2015/02/05/four-million-dollar-home-for-shroud-expo-in-san-antonio/","cat":"uncategorized","title":"Four Million Dollar Home for Shroud Expo in San Antonio"},{"id":"comment-49585","author":"o_k","post":"Colinsberry : Thanks OK. Three nights in Krakow last year was a amazing experience, but didn’t do much for my Polish, so it’ll take a little time to find what was done. He used iron but didn’t say whether traditional or modern electric I bet the latter. From pictures 13 and XXIII one can easily see he failed Thibault Heimburger explains in detail why. Colinsberry : For the moment, all I would say is that a 3 D enhancement can only be as good as the starting template and one can only speculate as to how good a template needs to be to produce a Shroud image. Anothe difficult problem for an ingenious forger to solve without using computer modelling of course. Colinsberry : And who’s to say that centuries of ageing have not improved the final image in a purely aesthetic sense, with softer tonal contrasts etc? And who’s to say exactly oposite, that centuries of ageing have not deteriorated the final image in a purely aesthetic sense, with softer tonal contrasts etc? Tonal contrasts are scalable, and I hardly believe they changed through centuries. The image has faded perhaps, or rather linen has darkened, but tonal contrast in case of bas relief are rather 0 1, either it was in the contact with the cloth, or no. So all the techniques in general using bas reliefs would have problems with smooth grayscale. Colinsberry : The first priority was to show that a 3 D enhancible negative Shroud image can/could be produced in principle, ie. That there are no insurmountable scientific obstacles. I believe that has been already been achieved, if not by the ones you show (though promising) certainly by Garlaschelli, and I’ve produced some passable results myself using simple shallow metal bas reliefs (horse brasses, trinkets etc). I realize that none of this will make the slightest impression on true believers, but it’s a fact that hot solids do tend to leave a slight impression on linen, one that is a negative image, 3 D enhancible etc etc. OK, so it’s not going to be hung in any art galleries, but there you go. As the jokey signs say: “The impossible I do immediately. Miracles take a little longer.” In principle yes, and no serious scholar has ever denied this. But in practice no. The set of possible parameters for acceptable reproduction of the Shroud image is null set..","date":"2013-11-02","mins":"10:54 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49625","author":"o_k","post":"At present though, all we have to go on is an inconclusive pile of evidence, some for and some against. Truly, it is always the case, not only about the Shroud, but anything. No one has monopoly on absolute knowledge, and every known fact can be disputed. But for what purpose? If one desires so, he can always claim that evidence for the most obvious facts (e.g. Earth is round and orbiting the Sun) is inconclusive. In science, there is never a final word. But there is something like a common sense. The evidence for the Shroud being authentic is quite a solid monolith. But if one wants while studying papers he can always find weak points in any of them. That’s what the cunniest sceptics (including you) do: because Rogers, Benford Jackson or anyone else didn’t write X in his/her paper, thus their conclusions are “inconclusive”. But can you point their mistakes? If so, why not write your own article showing that an expert A is wrong in theses points, here are evidence. Does the US goverment have to prove that 9/11 was not result of its conspiracy? Most of us here find the evidence on both sides very finely balanced. I don’t find it. I am rather under impression that pro authenticity evidence overwhelms anti authenticity arguments (or more often the so called “arguments”). And arguing that the whips on the Shroud are 2 mm too large or too small, or that the eyes of the Man of the Shroud are 2 mm too high or too low, don’t change anything. Under any normal criteria one can say that the Shroud is authentic but not under philoosphical criteria, for which the absolute Truth doesn’t exist. But the Shroud concerns the One who said that He is the way, and the truth, and the life, so that’s why the evidence must be very finely “balanced”, for obvious reasons..","date":"2013-11-02","mins":"4:14 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49608","author":"o_k","post":"Hugh Farey : “ The confusions, mis identifications and uncertainties above are what real science is about. As I said at the start, it is not Colin or myself who “ignore results,” it is those who don’t bother to read or make the effort to understand them who really ignore them, clinging desperately to generalised conclusions in the rather vague hope that that the inconsistencies will disappear if you don’t look at hem. Yes, Hugh I know that you, Collin, Charles Freeman, Andrea Nicolotti, Gian Marco Rinaldi and a few other cunning sceptics, really study in depth all the results, all the papers about the Shroud. For the purpose of looking a whole in the whole, of course. It can always be found in every domain of scientific inquiry. So you can cast doubt on every result that is pro authenticity: *No blood under bloodstain bad *No cotton in the main Shroud bad *3 D properties bad *No fluorescence bad. * The fact that 90% crucifixes show right foot on top of the left (exactly opposite to the Shroud, because positive images are mirror ones) bad. * Consistency between Shroud and Sudarium bad. *Statistical Inconsistency of the C 14 results bad And so on. Every result that is pro authenticity is bad becauese Rogers, Jackson, Borwn, Villareal, Piczek, Fullbright, whoever didn’t wrote X or Y in their works. So they were imprecise, so we can doubt their results, because, and call them inconclusive, because IF, IF, IF, IF, IF, IF, IF, IF, IF, IF, assuming that, that, that, that, that, that, that, that, that, that, that, that, that, that, that, that, that, that, that, that and that it can be otherwise, thus the Shroud IS A FAKE. This is the most efficient method of sceptics to deny authenticity of the Shroud. Unfortunately, why are they not so scrutine in case of those who claim the Shroud is not authentic? Because by default the arguments of anti authenticity are good, while arguments of antiauthenticity is bad. Of course such approach is flawed and counterproductive. But no one is an expert in every field, so sometimes it is impossible to counter the sophisticated (but in fact quite absurd) arguments of the sceptics, and we must sometimes simply trust the guys who we believe were real experts in their field, like Rogers, Jackson, Villareal and others. A small digresion here 95 % of sceptics are idiots who laugh at the Shroud because they think it is stupid catholic pseudo relic, 4% of sceptics are crooks who know that their methods of replicating the Shroud don’t make sense, nevertheles they lie outrigh that they do, and only 1 % are smart, cunning sceptics. Similarly 95 % of pro authenticity are simple believers, who know nothing about the Shroud but simply believe in its authenticity, 4 % know something, but repeats uncritically what they read in the books or see in the movies, and only 1% really understands the arguments for authenticity of the Shroud..","date":"2013-11-02","mins":"2:42 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49631","author":"o_k","post":"Finally, there are the opinions of numerous art historians, who say the shroud is coherent within the artistic conventions of medieval Europe. Well, I think I’ve must have seen very nearly every crucifix, shroud and dead Jesus painted or sculpted between 0 AD and 1700 AD, every naked, or crossed handed, or flogged, nailed, thorn crowned or speared body, within the Byzantine or Romanesque traditions of overtall thin people with long thin fingers, in psalters, altar frontals, statues, brass rubbings and images of every kind, and am not persuaded that these art historians are correct. I don’t think the shroud derives from an artistic culture. Mind you, I’m not convinced that an artistic culture derives from the shroud either, so maybe that cuts both ways. There are guys like Schafersman and Nickel who like to look for characteristics of Gothic style in the Shroud. And they can find it, I don’t argue. The problem is that they can find characteristics of Romanese, Reneissance, Baroque, Classicism and Art Deco styles, as well as many discrepancies with any of those styles in Shroud. But of course for them the Shroud is medieval forgery so it must be Gothic. The relationship between the Shroud and Christian art for me are quite obvious, and undisputable (and no matter what the art historians who are completely unfamiliar with the Shroud think, if they had overlooked such basic correspondence how one can call them true experts?), even, if not always direct. The problem is what influenced what, whether the Shroud influenced art, or the art influenced the Shroud? The answer is connected to the fact what is easier to reproduce: the Shroud or the works of art? Every child knows that the Jesus was a thin tall man, had a beard and long hair, and looked quite like a hippie. But no one has ever put forward a basic question: how do we know that?.","date":"2013-11-02","mins":"4:30 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49636","author":"o_k","post":"So Andrea, you showed your true face of fanatical Shroud hater. I didn’t expect that so early. It was not necessary to rely only on Gian Marco Rinaldi’s study to discover that Kuznetsov was a fraudster (even though we can be grateful to Gian Marco for that). Ian Wilson also discovered his second face, and makes no mention about Gian Marco. The fact is that the greatest enemy of pro authenticity is another pro authenticity, who thinks his arguments are better. Although the fact that there are some who accept at face value the purest idiocy (like bio plastic coating) if it is only pro or anti authencity, doesn’t stop to surprise me. So Andrea, who and how faked the Shroud? If you are entirely convinced of that..","date":"2013-11-02","mins":"5:14 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49646","author":"o_k","post":"Nice, but not concerning our discussion. Contrary to UFO, the Shroud is a real object, (according to Wikipedia) bearing the image of a man who appears to have suffered physical trauma in a manner consistent with crucifixion. Many believe this man pictured on this cloth is a Jesus Christ, and perhaps they have some reasons to believe so. If you Nicola, were one of them, how would you argue that the Shroud is authentic, (even if you don’t believe it)? What points can be presented in support of this view? I don’t think none. But first I can tell you one weak point of pro authenticity arguments. According to Robert de Clari, he saw in Constantinople a burial shroud with a picture of Christ on it. There is no textual evidence that this cloth was actually the Shroud of Turin (like “shroudies’ usually assume), and not the pseudo Shroud of Besancon for example. I could say more anti authenticities, but now its your turn..","date":"2013-11-02","mins":"6:30 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49644","author":"o_k","post":"Oh, Andrea, don’t try to excuse yourself. I am not so naive. Your attitude to the Shroud is well known to me, simply from the fact that you cannot overcome your inability to say a single, even the weakest argument that could be used to support the Shroud’s authenticity. I can say many arguments that cast doubt on the authenticity of the Shroud and several other relics, even if I am quite persuaded for the case of their authenticity. Shall I mention one anti authencity argument first, so you will be not so shy to say something pro authenticity? Or you are quite convinced that there are no pro authenticity arguments, because in your mind they cannot be..","date":"2013-11-02","mins":"5:44 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49553","author":"o_k","post":"Https://shroudofturin.files.wordpress.com/2012/10/scorch paper en.pdf.","date":"2013-11-02","mins":"6:41 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49632","author":"o_k","post":"Dear Andrea: I am not a “sceptic”, I am a researcher and I work according to scientifical method. I am not interested in pro or against autheticity, I am interested on truth, on serious researches, on scientifical methodology. Stop. This is my work, it is not a hobby to get a bit of relaxation about the work. All the sceptics, rationalists, militant atheists etc. Claim that. They are only interested on truth, they are using “scientific” methodology, and so on. But if one looks deeper, it always appear that they methodology is entirely flawed, and no matter if they study in depth all the material available usually only for the purpose to find where is the weak spot there, where to attack? And it is not a problem that most of the absurdities are pro authenticty, If for 10 000 pro arguments there are maybe 100 wrong or absurd, it is a different thing than that for 100 anti, 99 are wrong or absurd. Can you say any argument pro authenticity of the Shroud? Because I can invent a lot of arguments against its authenticity, even if I am convinced that the Shroud is for “almost” sure genuine..","date":"2013-11-02","mins":"4:42 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49650","author":"o_k","post":"Oh Andrea. But unfortunately they were written by historians on scientifical reviews, so better if you do not trust them. They didn’t like your books? But I can help you otherwise. If you want to read a review of my book, the British Society for the Turin Shroud Newsletter published one. My book is about medieval history and I am an historian. That review was written by a shroudie graduated in natural sciences. Surely you will like it. Http://www.shroud.com/pdfs/n74part8.pdf http://www.shroud.com/pdfs/n75part8.pdf Truly it is good that Emanuella Marinelli graduated from natural sciensces, because most of them at least think rationaly, contrary to (maybe I am prejudiced, forgive me, I also graduated from exact science, not human) many historians. For me, it was very surprising that so many academic professors of history are so big idiots, serving particular ideology, and building their careers on nothing else but conformism nad coteries. Well if Marinelli’s reviews are acurate, your scholarship, my dear Andrea is nothing else but simple denialism going to absurdity. But remeber, there is no single evidence that Hitler was responsible for Holocaust, even that with a single or two exceptions, no other scholar ever doubts that. I could believe that Marinelli’s reviews are too harsh. But after discussion with you, my dear Andrea, I am convinced that you are nobody but a fanatical Shroud hater who will never say a positive word about Shroud’s possible authenticity..","date":"2013-11-02","mins":"7:15 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49565","author":"o_k","post":"Collin, one sceptic tried to reproduce Shroud image with the use of bas relief. My refutatation of his article is here: http://ok.apologetyka.info/racjonalista/caun turynski faszerstwo niedokonane cz 3,560.htm You can see there end results in Image J, compared to the real Shroud face..","date":"2013-11-02","mins":"8:33 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49958","author":"o_k","post":"Josie: Well as a Catholic, with all the respect to your beliefs and convictions, must say not everyone would agree with your opinions. As to Andrea, his position is clear. He will never say a positive word about possibility of Shroud being authentic. As to claims that even catholic priests opposed to the authenticity of the Shroud: this is meaningless. Many later saints had problems with catholic hierarchy. And although I don’t know what are Andrea’s beliefs or ideology, from may experience I can say that many militant atheists tried to teach catholics what Catholic Teachings should be..","date":"2013-11-04","mins":"8:02 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49566","author":"o_k","post":"You can see there end results in Image J, compared to the real Shroud face. Illustrations 11 and XXII. Arabic numerals: his illustrations, Roman numerals: mine..","date":"2013-11-02","mins":"8:35 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-51336","author":"o_k","post":"25,000? A year is 365 days. One a day, it would took 68.5 years..","date":"2013-11-14","mins":"5:37 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","title":"Paper Chase: The Findings of Robert Bucklin"},{"id":"comment-51356","author":"o_k","post":"On a very busy day, they sometimes do up to about 30 autopsies. “They”, not a single person, I presume. 2500 (one zero less) would be more likely and still enough to gain a respectable experience, I think. One cannot examine one body for merely 30 minutes, 7 days a week, 365 days a year..","date":"2013-11-14","mins":"7:04 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","title":"Paper Chase: The Findings of Robert Bucklin"},{"id":"comment-34604","author":"o_k","post":"The sixth is the Tunic of Argenteuil..","date":"2013-05-24","mins":"8:11 am","url":"https://shroudstory.com/2013/05/24/a-powerpoint-from-russ-breault/","cat":"news_&_views","title":"A PowerPoint from Russ Breault"},{"id":"comment-34582","author":"o_k","post":"Some think that the third witness of Resurrection is actually the Holy Face of Manoppello, as Sudarium of Oviedo says more about the death of Christ, than His resurrection. See excellent website about Manoppello Veil, with lot of info about it: http://manoppello.eu/eng/index.php?go=start It is very misfotrune that Manoppello is largely ignored in English shroud literature, no matter whether it is authentic or not. It is with no doubt worthy of attention. See also this excellent video, very impressive: http://www.youtube.com/watch?v=M Fw Dv7 O7 Mxk.","date":"2013-05-24","mins":"6:28 am","url":"https://shroudstory.com/2013/05/24/a-powerpoint-from-russ-breault/","cat":"news_&_views","title":"A PowerPoint from Russ Breault"},{"id":"comment-213944","author":"o_k","post":"O.K., I think we will have to disagree on many of these points. But here is a few answers: Mario. We can argue about little relevant details, provide arguments for this or that thesis, but you haven’t answered my question: Do you believe in two corresponding forgeries in two obscure documents from about 18th century 1000 miles away from each other? Because this is essential. As to your paper, you have done fantastic job, and I am very grateful, even if I disagree with your thesis. Nevertheless, material you gathered will be very useful. I have read it briefly before, I knew some fragments from other sources. I am now, and continue studying this in depth. But I would suggest a different view. You wrote: You need to read all the inventories to realize one essential element: the clerics received the Mandylion (convince your self by reading the inventories, which I translated on my web page), then they describe it without knowing anything about the Mandylion. That points to a clear fact: the Mandylion is totally unknown from the Latins in the 13th century Haven’t you considered the fact that when the reliquary reached Paris about 1241, it was already empty? Emptied in 1204. That’s why the clerics actually knew nothing about what was stored inside before. Because I am sure they would have noticed, if not the image, then the bloodied cloth at least inside. And besides, I would recommend familiarising with a small observation I made some time ago: https://shroudofturin.files.wordpress.com/2014/05/burial linens of constantinople.pdf.","date":"2015-10-30","mins":"4:55 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-191227","author":"o_k","post":"In general: no. But I don’t think that the Shroud is not suitable for C 14 dating.I think exactly contrary the Shroud is fully suitable for C 14 dating but the choice of the sample location in 1988 was very unfortunate. My gut feeling is had another location been sampled as well, we would have at least one 1st century reading beside 13th 14th century we obtained..","date":"2015-02-16","mins":"6:44 pm","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"id":"comment-97130","author":"o_k","post":"Hugh: Roman graffitis showing crucifixion: Puozzola graffiti on the left, Alexamenos graffiti on the right. Those are definetly either † shaped Roman cross (crux immissa) or a T shaped cross (crux commissa) and the angle is definetly less than 80° to the horizontal, perhaps 25 35°, as indicated by the Shroud. One more thing, te bloodmarks on the left arm are very close to the edge of it (see http://img23.imageshack.us/img23/5695/drr7.jpg) they were most likely coming down from the upper side of the hand, the surface of which is more horizontal, then vertical, until spilling down the arms at 55 65° from the vertical..","date":"2014-04-06","mins":"1:48 pm","url":"https://shroudstory.com/2014/04/06/more-on-the-y-from-stephen-jones/","cat":"news_&_views","title":"More on the Y from Stephen Jones"}]
