[{"id":"comment-169354","author":"o_k","post":"The problem is that we have not got five or six hundred years to paint a linen cloth according to the medieval methods and wait until the images are faded. So perhaps the Shroudies will win after all. Charles, I have a challenge for you. Give me one example of one medieval linen cloth, that had once some image painted onto it, and then after all paint had flaked off, it preserved the residual of original image with 3 D qualities comparable with those on the Shroud: That’s absolutely a starting point. Unless you provide one, we have absolutely nothing to talk about. Until you do so, your claims in History Today article are absolutely worthless pseudo historical fantasies (if not simply a garbage). You know, they say that ‘paper will accept anything’, and despite you can write whatever you want, it is absolutely meaningless if you cannot provide examples backing your view. If you cannot show that encoding 3 D information in the painting, and what’s more preserving it after the paint has totally eroded is even possible at all is even possible, then your ‘theories’ do not deserve any scientific attention..","date":"2014-11-06","mins":"4:40 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-164894","author":"o_k","post":"But the sad thing is that the links both to the shroud.com and shroudstory.com have been removed from Wikipedia by someone obviously ‘knowing better’. Http://en.wikipedia.org/wiki/Shroud of Turin#External links.","date":"2014-10-23","mins":"11:54 am","url":"https://shroudstory.com/2014/10/23/430-wikipedia-articles-mention-the-shroud-of-turin/","cat":"article","title":"430 Wikipedia Articles Mention the Shroud of Turin"},{"id":"comment-169372","author":"o_k","post":"It’s not about that, Hugh. Charles claims that the Shroud was once a painted easter prop, from which all the paint has flaked off. Then I ask: could you provide any other example of medieval painting that retained its 3 D properties after losing all pigment? Could you? Is that even possible. If you cannot show this, then this theory is worthy no more than theory that Egyptian pyramids were built by aliens. Pseudo theories with no basis have no place in modern science. And that’s all. And about “those who want to distract us from the truth” – I leave for myself their names. In fact you can easily guess who they are. And in the such a controversial topic as the Shroud it is hard to imagine had there be no such people..","date":"2014-11-06","mins":"6:08 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168835","author":"o_k","post":"David. No matter you can imitate (roughly) the negative image of the Shroud face (imitating also roughly its 3 D properties), as it obviously doesn’t look like a face of a real man and has no such photographic quality. Those primitive tricks doesn’t work here. Besides the traces of the pencil moves are obvious here contrary to the Shroud, which has no directional characteristics in the FFT spectrum. No traces of human hand actvity. I will return to this topic later..","date":"2014-11-05","mins":"5:23 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168829","author":"o_k","post":"Indeed I have little doubt that the figure was produced, for the face, with a rubbing method on a basrelief as first proposed time ago by Joe Nickell. For the body, at least partially a similar method was used but with the aid of a real human body, not a basrelief, as recently performed by Luigi Garlaschelli. Gian Marco: Do you REALLY believe the Shroud was made with the use of Garlaschelli’s method, after it has been completely devastated by Thibault Heimburger and Giulio Fanti ( http://www.acheiropoietos.info/proceedings/Heimburger Web.pdf )? You DO???.","date":"2014-11-05","mins":"5:13 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168839","author":"o_k","post":"Here is 3 D plot of your clownish pencil drawing compared with the plot of the Shroud face. The settings are the same.Complete failure, David Mo!.","date":"2014-11-05","mins":"5:37 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168885","author":"o_k","post":"Secondly, I don’t think either of OK’s images are at all satisfactory as representations of a human face. While they are unrealistic in different ways, I think they are both ‘complete failures’ from that point of view. Hugh, during my studies on the Shroud I have never seen a reproduction of Shroud face that looked realistically. All of them were obviously artificial, and suitable at most to scary kids. Contrary, the Shroud face looks realistic watching it you have (I think correct) impression you look at the real human face. Of course, in the 3 D view it can be distorted in many ways, as 3 D representation of the Shroud man is not the 100 % accurate representation of the 3 D form that was once within the Shroud. To avoid misunderstanding, there are two things important here. First, the fact that the 3rd dimension (Z axis ) is referenced not to some arbitrary plane parallel tothe XY axis, but to the surface of the Shroud, which (although being flat surface as well) wrapped somehow the body. For the second: scale factor place important role here. As it is a little bit arbitrary, the Z axis will be usually rescaled compared to objective XY scale which adds additional visual distortions. It needs a little bit practice to accurately perceive the 3 D representations of the body of Shroud Man and then to compare it with artificial copies. However, gaining a little bit of experience, you know that the Shroud is quite unique in this characteristic, as it reflects the shape of the body wrapped in the Shroud very faithully..","date":"2014-11-05","mins":"7:36 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168900","author":"o_k","post":"Collin: Trouble is, O.K. One doesn’t know what the shape was – that being dependent on one’s modelling assumptions re the geometry of linen relative to subject or other preconceptions. Of course it involves a little bit guessing so the answer cannot be totally unequivocal but with a little bit of common sense and reasonable constraints you can get the response fairly close to the reality. Result: http://strawshredder.files.wordpress.com/2012/03/x11 cropped final x2.png?w=410&h=462 I think you have used too much smoothing Collin thus much distorting the image, which then starts resembling gaussian bell. This is NOT what we want to obtain. Though I say it myself, it’s arguably one of the more life like 3 D enhanced images that one can find on the internet (second only to the host’s – but I suspect he had help from his grandchildren, giving him an unfair advantage). Https://shroudstory.com/2011/12/22/do your own vp8 like 3d images of the shroud of turin/ Sorry, I don’t want to be modest here but although I think Dan’s is good, mine is much better:.","date":"2014-11-05","mins":"8:10 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168887","author":"o_k","post":"David Mo: Perhaps a real body was used for the image, but some deformations imply an ulterior retouch because they are not natural. For example: there are not nipples, the index finger is longer than annular finger, the legs are extended but this is incompatible with the mark of the sole, the fingers and the arms are abnormally long, etc. It is an old false melody of the sceptics, that the Shroud image has some “unnatural” deformations: thus the Shroud must be false. But this melody shows only lack of imagination and bad will of the sceptics. All those claims about unnatural deformations can be easily refuted with Shroud Scope, tape measure and ordinary average human male at disposal. For example: too long fingers – I have rebutted this myth here: https://shroudofturin.files.wordpress.com/2013/11/on the allegedly long fingers of ts man.pdf.","date":"2014-11-05","mins":"7:50 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168960","author":"o_k","post":"At most the artists on the old copies didn’t make them match and nothing all. On today’s Shroud we don’t see elbows, as there are burnholes in those places. Charles, your desperate attempts to rescue your bogus hypothesis do not interest me – I have no time to deal with every pseudo rationalist nonsense they invent..","date":"2014-11-05","mins":"12:12 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168906","author":"o_k","post":"Only if you think the events described in the NT that proto Easter weekend were the equivalent of going a full 12 rounds in the ring against Muhammad Ali… Truly, it was something like that..","date":"2014-11-05","mins":"8:31 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169348","author":"o_k","post":"The search for, and finding of, the truth should be a ‘win’ for everyone. Except for those who want to distract us from the truth, remember about that..","date":"2014-11-06","mins":"4:20 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-163218","author":"o_k","post":"David, remember. I don’t accuse Charles of spreading lies. No. It’s too strong, and Charles does not lie, that means he does not say blatant lies. The problem is, call it, his “creative approach” to the truth. And then it is hard to prove someone’s bad will even if it is evident to someone other….","date":"2014-10-17","mins":"4:58 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-169250","author":"o_k","post":"Nabber: And what of Molecular Biologist/Archaeologist Thomas Loy noting that he has seen red blood marks on artifacts that are thousands of years old? Do you have some references?.","date":"2014-11-06","mins":"10:18 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-163210","author":"o_k","post":"David: But unless you have the gift of telepathy you cannot accuse him of a deliberate attempt to deceive. Perhaps I have such gift… or perhaps I have simply experience… We have discussed here many times many different issues with Charles and others, and I simply know what to expect from him, or several other frequent commentators. And I try not to be naive… Not everyone has good intentions….","date":"2014-10-17","mins":"4:23 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163214","author":"o_k","post":"The alleged “loin cloth” is simply the fact that the areas around hips are less pronounced, due to the cloth being raised a little bit (remember 3 D properties!) where it’s going above the crossed hands on the crotch, no mystery here. But if the “loin cloth” fairy tale can be sold to a few uninformed people… why not? The whole thing seems an incredibly cynical attempt to find out a few idiots who will buy it….","date":"2014-10-17","mins":"4:44 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164394","author":"o_k","post":"I knew form the begining that discussing this obviously anti shroud propaganda article makes no sense, and Charles’ approach there was not honest at all. But does he even care about that? I don’t believe that. Anyway, he just have earned £200 writing this nonsense..","date":"2014-10-21","mins":"2:39 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163206","author":"o_k","post":"David, have you read the entire article? I have. Strongly not recommended. In fact old Mc Crone rubbish once again..","date":"2014-10-17","mins":"4:13 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163403","author":"o_k","post":"Thirty pieces of silver for the Shroud….","date":"2014-10-18","mins":"5:46 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165113","author":"o_k","post":"….. And after some minutes, when realizes that the word “fraudo” does not exist in Latin… According to Google Translator it exists..","date":"2014-10-24","mins":"5:44 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165124","author":"o_k","post":"Hugh, you wrote: “Max never provides sources for any of his allegations”. My sources are my own unpublished RESEARCH papers! I do assure you the iconographic documents DO EXIST, I saw them with my own eyes and they illustrat one of my papers yet the issue then was not wether the “Shroud itself” had or hadn’t a loincloth! So why not publish them?.","date":"2014-10-24","mins":"6:33 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164416","author":"o_k","post":"Louis, I know what you mean, but this all is going into farce. You know obviously that the Shroud is not a painting, for several reasons; no significant amount of paint, negative character, 3 D properties, extreme superficiality, no fiber cementation, no directionality, isotropic Fourier characteristics, etc, etc. We have discussed those issues many times. We know that STURP found no evidence for the Shroud being a painting, we have also excelllent Isabel Piczek presentation on the topic: http://www.shroud.com/piczek.htm and so on. So you know obviously that Charles’ thesis is a nonsense and so do Daveb, Mario, anoxie, Mike, Max, Thomas, Thibault, Yannick, everyone with some knowledge on the Shroud. And nevertheless we have pretend that we treat those absurd claims of Charles seriously. Isn’t it a little bit kidding? Of course it is well known to us that they have virtually no basis, and I don’t suspect that even Charles himself really believes they have. It seems he plays with us, challenging us on his terms to convince him he is wrong. What’s worse, although obviously bogus, this article was published in, as Charles claims, a “serious historical journal”, thus providing wrong perception of the Shroud to the readers. And what sounds even more cynical, Charles not only has knowingly (and probably intentional) published misleading, agenda driven article, but also has received money for that. Is that really fair? How not get irritated by all of these issues? Shouldn’t someone rather say openly that Charles is delliberately deceiving people? That he indeed uses dishonest means, and his intentions are not really true, contrary to what we should have assumed?.","date":"2014-10-21","mins":"4:19 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-115630","author":"o_k","post":"However, enophtalmos (eye retraction) can occur immediately in the case of fracture of the jugal (or zygomatic) bone. This is basic medicine. On the TS we have an extraordinary consistent set of proofs: the oedema of the right cheekbone, the right eye retraction (IR image) and the fracture of the nose. And Thibault, aside from any medical evidence, what about the prophecy? John 19: 36 (NIV): These things happened so that the scripture would be fulfilled: “Not one of his bones will be broken,.","date":"2014-05-09","mins":"5:03 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","title":"Breaking News:  New Injury Details Seen on the Shroud of Turin"},{"id":"comment-163400","author":"o_k","post":"3) “There is a difference of seven centimetres between the lengths of the two bodies.” Is it “lengths of the two bodies” or the lengths of the two images such that no consideration is given about the cloth placement, the feet not completely visible and so on? Where are the measurements? I guess this is too complicated to give? Yes, it is complicated. So simply stating some differences in lengths of images prove nothing. Nobody has provided the measurements to support such claim that “the lengths of the two bodies” differ by seven centimeters. And none are given by Charles, so it is unproven. Mario, with your Shroud Scope, simple tape measure and average human male refuting such LIES (let’s face it, those are delliberately spreaded lies) is extremely easy. So the more obvious is the barefaced and cynical attitude of those who repeat them..","date":"2014-10-18","mins":"5:37 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-192892","author":"o_k","post":"John. Have you tried to get in contact with Goodacre, just as I advised?.","date":"2015-03-09","mins":"4:44 am","url":"https://shroudstory.com/2015/03/09/crocumentaries/","cat":"article","title":"Crocumentaries"},{"id":"comment-198227","author":"o_k","post":"It happened to me a few times before..","date":"2015-05-03","mins":"5:07 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-166685","author":"o_k","post":"On XIII and XVI or XV century no Shroud existed in Besançon. Can you be sure of that?.","date":"2014-10-29","mins":"5:40 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166319","author":"o_k","post":"In a few words? i think it is impossible…. But if your question is “Do you believe that the Sermon of Gregory Referendarius could be used to prove the identity between shroud and Mandylion, in any part?”, the answer is obviously not, as all scholars (except some sindonologist) do know, and as the reading of ALL treatise demonstrates without doubt. To the point, Andrea. Can you deny that Sermon is authentic?.","date":"2014-10-28","mins":"6:29 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166329","author":"o_k","post":"I guess that this starting conversation between you and I will finish in nothing…. : ) You have already finished with nothing, why do you run away Andrea? I just before asked you a simple question; can you deny authenticity of the Sermon?.","date":"2014-10-28","mins":"6:44 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166325","author":"o_k","post":"Louis: I read the sermon somewhere some years ago and will try to find it and get back to you. Http://www.shroud.com/pdfs/guscin3.pdf.","date":"2014-10-28","mins":"6:39 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166336","author":"o_k","post":"Your question is simple, yes. I do not deny anything. Why I have to “deny” authenticity of the Sermon? Fine, that was just the first step. Next: Do you deny that the translation of the fragment of #9 “But Jesus, undergoing the passion of his own free will, believing that human nature fears death – indeed death comes upon the very nature that was made to live – taking this linen cloth he wiped the sweat that was falling down his face like drops of blood in his agony. And miraculously, just as he made everything from nothing in his divine strength, he imprinted the reflection11 of his form on the linen.” is reliable, in patricular references about “the sweat” and “drops of blood”?.","date":"2014-10-28","mins":"7:04 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166340","author":"o_k","post":"So do you answer, or not?.","date":"2014-10-28","mins":"7:16 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166343","author":"o_k","post":"Please, go on. I am not here to answer a series of questions like in a tribunal. Say what you want to say without questions or “steps”. Don’t hurry, Andrea, instead just answer my simple questions. We are going into deductive reasoning..","date":"2014-10-28","mins":"7:25 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167307","author":"o_k","post":"Better explained: the shroud with the image in Besançon did not exit on XIII, XIV, and XV century. A white linen for the rite of the “Quem quaeritis” was present there in the middle age, as in many other churches. Andrea, can you be sure of that? The lack of documentation (presumably lost during fire in 1349 and in other accidents) does not prove non existence of the Besancon Shroud in 13th 15th century. Absence of evidence is not evidence of absence. Http://www.acheiropoietos.info/proceedings/Piana MYHS Web.pdf As you presumably know, Andrea, in the Ray sur Saône, castle of de la Roche family, there is a casket, in which, according to the local tradition, the Shroud of Besancon was brought there in the 13th century by Otto de la Roche. This may signify material evidence for the claim. What about that, Andrea?.","date":"2014-10-31","mins":"2:01 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166349","author":"o_k","post":"I am going to sleep, continuation tomorrow..","date":"2014-10-28","mins":"7:53 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167330","author":"o_k","post":"Do you claim that Jeanne was not descendant of Otho?.","date":"2014-10-31","mins":"2:36 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167340","author":"o_k","post":"Andrea, I don’t have your book, all I have are short excerpts you released + Emanuella Marinelli’s review. I just asked a simple question, were they (Jeanne and Otho) related or not. Truly, it is irrelevant to me as I don’t believe the Shroud (of Turin) simply passed throught the way of inheritance from Otho to Jeanne, but I am just checking whether or not you are trying to play some misleading ‘games’ with me. You voiced several categorical statements, but your argumentation has been totally unconvincing so far..","date":"2014-10-31","mins":"2:55 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167327","author":"o_k","post":"We know that the Besançon shroud was made on 1523 or some years before. We have medieval documents and they were not distroyed on the fire (forgers like fires, they use them to justify their forgeries). Is there in those documents specified exactly that the Shroud of Besançon was made in 1523 or shortly before? Or do they are just the earliest mention in the surviving documents, without giving information when and where exactly the Shroud of Besançon was made? That’s key detail here. The story of Othon de la Roche was a lie invented on XVIII century. This is well known. By whom? Obviously, they fabricated also false “material evidence”, this is normal. Do you have any evidence to back this claim? Absence of evidence is not evidence of absence: it is true, but only sometimes. But is ALWAYS true that you must demonstrate that something existed, if you think that it exixted, and not asking me to demonstrate that somethng did not exist So far, on this stage, we do not want to establish whether something (the so called ‘Shroud of Besancon’ in the 13th century) existed or not for certain. So far we are interested only whether it might have existed..","date":"2014-10-31","mins":"2:34 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167358","author":"o_k","post":"BTW, I have Zaccone’s book (La Sindone – Storia di un’immagine, in polish edition of course), and although Zaccone does not favor Besançon hypothesis, he does not exclude it completely. Nor Vignon arguments in his 1902 book (see http://www.holyshroudguild.org/weuenshel collection provided by google.html pg 61 76) exclude the possibility that the Shroud of Besançon (whatever it was) existed in the 13th century. And i think the relation between the two (the Shroud of Turin and of Besançon are a little bit more complex than most researchers assume..","date":"2014-10-31","mins":"3:33 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167705","author":"o_k","post":"1) The genealogical tree of Wilson is wrong. Henry de Vergy was not wife of Élisabeth de Ray. So who was wife od Henry de Vergy? Or other way: whose wife was Élisabeth de Ray? Can you give us precise answer to those issues? Piana (http://www.acheiropoietos.info/proceedings/Piana MYHS Web.pdf ) has similar genealogy to that of Wilson. Assuming they are both wrong, and you are right, Andrea, where has the mistake originated? where are the sources that associate Othon de la Roche with a Shroud? Those 18th century sources, which you labelled as “lies” without giving evidence of their falsehood. Plus tradition about the coffer in Ray sur Saône castle. Plus 1205 letter of Theodore Angelus to the Pope Innocent III. I leave aside Nicholas Otranto as it is too ambiguous, although it may (or may not) be connected..","date":"2014-11-01","mins":"2:21 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167712","author":"o_k","post":">>>>So who was wife of Henry de Vergy? Élisabeth de Chalon Was his sole wife, or had he additional marriages, (with Élisabeth de Ray perhaps)?.","date":"2014-11-01","mins":"2:48 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167711","author":"o_k","post":"Could you start to use a historical critical mehod? We are just begining. Source (one), not “sources”. And you call “source” an anonymous treatise of the 18th century, written to defend the authenticity of the Besançon Shroud (that was false, all know), telling something about what happened on 1204, based on falsificated sources? Thanks for reminding this. No matter, it is a source not the best quality, but a source. And there is still a chance that the claim that Otho once possesed the Shroud might have been true, no matter the silence of earlier historians. >>>>Plus 1205 letter of Theodore Angelus to the Pope Innocent III. Another forgery. Not so fast. Two issues here. 1.) Can you tell me who faked this, or at least when was it faked (century)? Do you consider Benedetto D’Acquisto 19th century transcript as authentic? 2.) Can you prove without doubt that this particular fragment is a forgery. Frale considers it authentic, Zaccone also although with later interpolations. Yes, I have read your paper http://www.giornaledistoria.net/public/file/Content20121006 Gd S Nicolotti Chartularium Culisanense.pdf and found no evidence beyond doubt that this particular letter (the rest of Chartularium Culisanense does not interest me) is a forgery..","date":"2014-11-01","mins":"2:46 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167726","author":"o_k","post":"All fake Chartulariums are falsificated to give importance to a family or institution that has no importance and wants to have it. So the forger of the cartulary created a fake diploma of Constantine XI, with a false genealogy of his family; and then, to make believe that his family had in the past important relics, made a false dowry which contained the stones of the home of Our Lady of Loreto, a false report of translation of the relics of the martyrs of Otranto to naples and our false letter to the pope where is said that they possessed the Shroud. When the letter was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time). The forger was not very able, and did not know the Greek; it is easy to see that the document is not authentic. When I showed the letter to the most important experts on this field, Luca Pieralli and Otto Kresten, in five minutes they confirmed my opinion. Nice tale, Andrea, have you invented this right now, or before? Anyway, next round. What about 18th century “sources” (fake according to you), that is one source, that is presumably one part of MS 826 manuscript which originated the story about Otto de la Roche, and the Shroud of Besancon? Did the forger from De Angelis Family also put his fingers in it?.","date":"2014-11-01","mins":"4:07 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167719","author":"o_k","post":"Your traitment of later, disinformated and forged sources is not compatible with the historical critical method. The better. One method does not apply everywhere. You consider Frale a reliable historian? No. Neither you, Wilson, Scavone, Zaccone, Freeman or vast majority of historians. Most of them are unreliable at some point. I even don’t consider myself reliable sometimes. You do not found never evidences of forgeries if they are against the Shroud… Nor evidence for the existence of the Shroud prior to the 14th century is the evidence in the eyes of sceptic ; ) //serious things start here probably from xvi to xix Fine, that’s what I wanted. So, Andrea you claim that someone from de Angelis family between 16th and 19th century faked a 1205 letter of Theodore Angelus to the Pope Innocent III, with all the information crucial to us about linteum quo post mortem et ante Resurrectionem noster Dominus J. C. Involutus Est [..] in Athenis and delliberately placed it in some forgotten Chartularium Culisanense. There is one key question I would like you to answer Andrea; FOR WHAT THE PURPOSE?.","date":"2014-11-01","mins":"3:22 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167728","author":"o_k","post":"Game over indeed, Andrea..","date":"2014-11-01","mins":"4:18 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-170121","author":"o_k","post":"The mystery is in greyscale. The Shroud has full greyscale image compressed in almost a single tone, so it is unresolvable for a naked eye it needs photographic process (i.e. Creating another negative that is positive image) to extract the the true image of the Shroud figure..","date":"2014-11-09","mins":"11:13 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170167","author":"o_k","post":"Charles, I do think that you don’t understand that the shroud images are negative or what that means, for you wrote: Dan, have you received my recent e mail? I hope that what I sent may help….","date":"2014-11-09","mins":"3:36 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-200409","author":"o_k","post":"So what do you think? Any chance that Jesus survived the cross? Absolutely NO! The Man of the Shroud and Sudario was dead. See the paper “The death of the Shroud Man: an improved review” by Faccini, Carreira, Fanti, de Palacios and Villalain from 2008 Ohio conference: http://www.ohioshroudconference.com/papers/p07.pdf (the link may not load, so I can send the paper to you). Also from “Comparative Study of the Sudarium of Oviedo and the Shroud of Turin” http://www.shroud.com/heraseng.pdf C – As a summary of the results obtained up to now from the forensic, geometrical and mathematical studies carried out by the EDICES, the following can be confidently stated: […] 6. The man was dead. The mechanism that formed the stains is incompatible with any kind of breathing movement..","date":"2015-05-28","mins":"5:02 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-195416","author":"o_k","post":"We still have little idea where the Shroud might have been kept, it had to be kept somewhere, and it might not have been retained in Joseph’s tomb. Perhaps Pilate’s wife had it all along. Perhaps, if it has been retained in Joseph of Arimathea’s tomb, the Pilate’s wife indeed had it all along. We missed something. We missed two crucial elements of the Resurrection narrative. The burial cloths found by Peter & John and Jewish allegations that Disciples had stolen the body, which are mentioned in Matthew. Which was the only serious allegations Jewish authorities might have brought against them. Remember the situation. Early Sunday morning, earthquake, Roman guards are running away from the tomb. Women came, next Peter & John, who found burial cloths in the grave. Decision: take them (cloths) or leave them in the tomb? This is absolutely crucial! If they took the cloths, they could be easily accused of grave robbing. If they left the cloths in the tomb… well, then within half an hour there would have been plenty of Roman soldiers on the side. The cloths would then have come into possesion of Pilate… and his wife… The story of the Shroud of Turin… is more sensational than Indiana Jones, or anything Dan Brown could invent..","date":"2015-04-05","mins":"6:56 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"id":"comment-200456","author":"o_k","post":"“The old saying is that if you repeat a lie often enough people will believe it.” That old saying is much more skeptic/atheist friendly than religious friendly in my humble opinion Not everything being repeated often is a lie, as is not everything what people believe. Atheists must repeat their lies often enough to be believed, while believers repeat the truth of Jesus’ Death and Resurrection because it is worthy of being repeated..","date":"2015-05-28","mins":"4:55 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-192084","author":"o_k","post":"Here are relevant pages of De Fleury:.","date":"2015-03-01","mins":"6:01 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192080","author":"o_k","post":"However the Wiki article says that it was only a small fragment originally discovered by Arnulf and embedded in a golden cross and kept by the Latin Patriarch of Jerusalem. Several other fragments were dispersed around Christendom, most of them from Constantinople and pretty well all of them made from olive wood. This Wiki statement about olive wood is weird. Wiki states (http://en.wikipedia.org/wiki/True Cross#Dispersal of relics of the True Cross ) Four cross particles – of ten particles with surviving documentary provenances by Byzantine emperors – from European churches, i.e. Santa Croce in Rome, Notre Dame, Paris, Pisa Cathedral and Florence Cathedral, were microscopically examined. “The pieces came all together from olive.”[26] giving reference to “William Ziehr, Das Kreuz, Stuttgart 1997, p. 63) de:Diskussion:Kreuzerhöhung, in German.” Yet it does not reference the source directly, istead pointing to the discussion page on German Wiki (http://de.wikipedia.org/wiki/Diskussion:Kreuzerh%C3%B6hung ) where it is written: Vier Kreuzpartikel aus europäischen Kirchen, nämlich S.Croce, Notre Dame, der Kathedrale von Pisa und Dom zu Florenz, sind mikroskopisch untersucht worden. “Sie stammten allesamt von Olivenbäumen (Ziehr, Wilhelm, Das Kreuz, S.63, Stuttgart 1997).”, inhaltlich entnommen aus: Hesemann, Michael, Die Jesus Tafel, Die Entdeckung der Kreuz Inschrift, Herder Verlag 1999 This reference to the olive wood seems unreliable. On the contrary, Hesemann states (in “Milczący Świadkowie Golgoty” the polish edition of Die stummen zeugen von Golgatha, Wydawnictwo Salwator, Kraków 2006, pg. 87 88) that the very same four pieces of the True Cross (Rome, Paris,Pisa, Florence) came from pine instead of olive (pointing to De Fleury, 1870 pg. 62). The examination of Vienna piece form Hoffburg gave the same results, while the wood from Santo Toribio according to the examination from 1959 came from cypress (although Hesemann makes a digression about margin of error in identification). Here is the list of major portions of the True Cross preserved today (via Hesemann pg. 83 84). The volumes are in cubic milimeters..","date":"2015-03-01","mins":"5:26 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192122","author":"o_k","post":"Dave, regarding Titulus it is worth to read Hesemann’s article about the topic http://www.michaelhesemann.info/12 8.html as well as my own humble posting: https://shroudstory.com/2014/01/22/titulus crucis a fascinating guest posting by o k/.","date":"2015-03-01","mins":"4:42 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192121","author":"o_k","post":"Charles: The start of relic cults is three hundred years on covering a time when almost no attention was paid to relics so there was no reason to preserve them. I say straithorward: you are deliberately LYING!. It is THIRD time that I must correct this deceit cynically spread by you! The cult of relics is much earlier than Constatnine. In fact, it predated the origin of Christianity. Just a few of the examples from the Wikipedia: http://en.wikipedia.org/wiki/Relic#History One of the earliest sources that purports to show the efficacy of relics is found in 2 Kings 13:20–21: 20 Elisha died and was buried. Now Moabite raiders used to enter the country every spring. 21 Once while some Israelites were burying a man, suddenly they saw a band of raiders; so they threw the man’s body into Elisha’s tomb. When the body touched Elisha’s bones, the man came to life and stood up on his feet. (NIV) Also cited is the veneration of Polycarp’s relics recorded in the Martyrdom of Polycarp (written 150–160 AD).[13] With regard to relics that are objects, an often cited passage is Acts 19:11–12, which says that Paul’s handkerchiefs were imbued by God with healing power. Charles (further): It needs a particular mind set to preserve relics which is why they are not part of many Christian traditions. Yes especially those Protestant traditions that originated 1500 years afterwards, and possesed no relics, and no previous traditions at all (thus they adopted sola scriptura principle). I can’t recall any pre Reformation Church that doctrinally rejected veneration and prservation of relics by principle, even despite critical voices about cult or provenace of some relics raised from time to time. Hugh: Can you fill out a bit of chronology for us, Charles. I understand there was a huge expansion in relic collecting from about 300 AD, presumably mostly in the East? I don’t think there was a great expansion in relic collecting about 300 AD, except for the Saint Helen and her pilgrimage to the Holy Land, where she rediscovered True Cross, and gathered many other relics. Simply since the Constantine, and the end of persecution, most of the relics (like Crown of Thorns for example) didn’t have to be hidden, and could be publically venerated. Before that time they were mostly kept in the judeo christian society, and passed from generation to generation, in rather secretive way. Do any other allegedly 1st century relics appear later than 1350? Yes or rather they reappear after several centuries. For example: http://news.nationalgeographic.com/news/2012/06/120618 john the baptist bones jesus christ bible bulgaria science higham/ Purported skeletal remains of John the Baptist have been dated to the first century A.D. And so could conceivably have belonged to the “forerunner of Christ,” who baptized Jesus, scientists say. Discovered in 2010 among the ruins of a Bulgarian church, the remains include six human bones: a knucklebone from the right hand, a tooth, part of a cranium, a rib, and an ulna, or forearm bone. DNA and radiocarbon testing of collagen from the knucklebone show that the remains likely belonged to a Middle Eastern man who lived in the first century A.D., which fits with the story of John the Baptist. Note every sentence ending in a query – I really have no idea, but would be grateful for your opinion. Truly Hugh, Charles’ biased, deceitful and misleading “opinions” are not worth a penny. He has discredited himself completely in this matter..","date":"2015-03-01","mins":"4:35 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192125","author":"o_k","post":"Biblical scholarship is 90 % trash, based on ideological paradigms instead of meritorical arguments, Louis. The most absurd claims can be traded as ‘scientifically established facts’, using complex sophistry developing nonsensical hypercritical assumptions, coming out from carefully hidden hidden anti Christian stance..","date":"2015-03-01","mins":"5:24 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192037","author":"o_k","post":"Joe, may I ask one question? Did they mention any radiocarbon of any alleged piece of the True Cross? Charles Freeman mentioned in some comments that they planned to do so, and CNN trailer indicates that as well http://edition.cnn.com/videos/tv/2015/02/19/cnn original series finding jesus 03 01 15.cnn creative marketing Mike, thanks for the link.Very interesting..","date":"2015-02-28","mins":"1:25 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192129","author":"o_k","post":"The biggest contribution of Thiede is, in my opinion, not his controversial hypotheses (with which you can agree or not), but something else that he broke sceptical paradigms and showed that the other, more pro Christian views on biblical scholarship are in fact neither impossible nor inferior by any means compared to the so called ‘critical’ approach..","date":"2015-03-01","mins":"6:38 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192128","author":"o_k","post":"Hugh: The trouble is, it’s difficult to substantiate an opinion of secrecy – the idea that there was a relic culture but it was too secret to leave any trace is possible, but the evidence for it seems to be exactly the same as for the idea that there was no relic culture at all. If you have any orientation in ancient history (especially the number and condition f preserved written sources and historiography) you will know that is one should expect. There were little written records of relic cult before 300 AD, yet there were a few, showing us that the relics were in fact venerated, although not openly like after Constantine. Besides people who took care about them rarely left written records. Writing history besides was rather Greek and Roman (and on the other side of the world Chinese) hobby. 90 % of historical Jewish writings comes from two sources: the Bible and Josephus (who wrote in Hellenic manner). There are no preserverved historical writings from Persians for example , up to the Arab conquests. There are no Persian, or Parthian Herodotus nor Livy, nor Sima Qian. The same is for Indinas, there are only a couple of historical writings in India before. 1200 AD. So the lack of records is fully understndable. When did all the Crowns of Thorns and Tunics, Lances, Nails, Swaddling Clothes and stuff appear in Western Europe? Wasn’t it earlier? The main periods of major transfer of relics from the East to the West are 1.) The Persian conquest of the Holy land in 614 when several relics were trnasferred to Spain 2.) The Charlemagne times circa 800 AD, 3.) The outcome of the 4th Crusade, when several relics were looted, or sold to the West. Of course diplomatic relations brought several pieces of relics (a few thorns for example) to the West at different times. If you are interested in history of relics, Micheal Hesemann’s Die stummen zeugen von Golgatha are must read. Besides Grzegorz Górny Witnesses to Mystery as illustrations (Górny in fact derived half of the text from Hesemann if you read the two carefully)..","date":"2015-03-01","mins":"6:27 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192161","author":"o_k","post":"Dave: M posting made no reference to some random cattle feeding trough found in some Palestinian barn by an over enthusiastic credulous relic pillager. Why do you follow mindless ridicule of the relics of the manger by Charles? Read this: Origen, Contra Celsum, Book I, Chapter 51 (http://www.newadvent.org/fathers/04161.htm ) : With respect to the birth of Jesus in Bethlehem, if any one desires, after the prophecy of Micah and after the history recorded in the Gospels by the disciples of Jesus, to have additional evidence from other sources, let him know that, in conformity with the narrative in the Gospel regarding His birth, there is shown at Bethlehem the cave where He was born, and the manger in the cave where He was wrapped in swaddling clothes. And this sight is greatly talked of in surrounding places, even among the enemies of the faith, it being said that in this cave was born that Jesus who is worshipped and reverenced by the Christians. Here you have the photo of the remmants of this manger, described by Origen around 250 AD, and transferred to Rome, to the Basilica di Santa Maria Maggiore in the VI Ith century by patriarch Sophronius, after Muslim invasion. The tradiion of it seems fully trustworthy. It is only inconceivable for primitive pseudo sceptics like Charles..","date":"2015-03-02","mins":"5:26 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192045","author":"o_k","post":"Thanks. We will see the results in TV. That’s what makes me most curious. The potential outcome may be groundbreaking or not..","date":"2015-02-28","mins":"4:16 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192172","author":"o_k","post":"But at least they mentioned the Sudarium. That disproves C 14 dating of the Shroud. BTW: is there any detailed description of the C 14 dating of the Sudarium in Gibson’s book?.","date":"2015-03-02","mins":"6:53 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-194784","author":"o_k","post":"And Barrie, if may I ask, despite many criticism of the association of the red blood with bilirubin, do you still keep to this theory? I know you mention this story about Adler and bilirubin in almost every interview….","date":"2015-03-29","mins":"11:43 am","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-212791","author":"o_k","post":"Hugh & Jim: There was no vertical projection, nor two configurations of the Shroud. I explained it in my presentation: https://shroudofturin.files.wordpress.com/2015/10/3dproperties6 3.pdf Apparently you haven’t familiarized with it yet..","date":"2015-10-17","mins":"4:52 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212839","author":"o_k","post":"Hugh: Perhaps the majority of the authenticists agree that whether by nuclear, electromagnetic or other radiation, or by vapour emission, the transmission of image from body to cloth was almost exactly vertically up or down, and not perpendicular to the body, or to the cloth, or any halfway stage between. Nonsense. Although assumed in many papers (including the most influential ones) the transmission certainly wasn’t vertical. In his paper, OK attempts to demonstrate that the Shroud shows a minor version of the Agamemnon face effect, by manipulating the width of the face to fit his hypothesis Hugh, nothing is manipulated here. The Shroud face actually is the Agamemnon face. You need a little bit of spatial imagination (which was lacking for over 30 years in Shroud scholarship, and I say this with a full responsibility) to get aware of this extremely important point. If you want, you can try yourself:.","date":"2015-10-17","mins":"11:41 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212851","author":"o_k","post":"OK may disagree with the “majority of the authenticists” (I do myself, but for different reasons), but I think that collimated transmission, and that vertically up and down, is indeed what the “majority of the authenticists” believe. Maybe. But I strongly disagree. In this case, however, they should measure the image of the Mask of Agamemnon, both in the original paper and above, when they will find that the mask has been considerably narrowed from what it was in the paper! Here you have a screenshot of the previous comment: How can I convince you that the Shroud face is indeed the mask of Agamemnon effect? I order to reconcile these problems we must remember that the Shroud is, of course, flat, but the mask of Agamamnon, although its ears have been squashed outwards, is not at all flat, but maintains its original “face profile” rather well. And fine! Of course neither the mask is completely flattenen, nor the Shroud was tighly pressed to the face (rather loosely draped, see blue line on Slide 6). The sides of the nose, for example, would be dark, but this is not what is observed on the Shroud. Quite contrary, if you look at the Shroud carefully. OK actually says of his 4 diagrams of possible transmission that “all 4 ways give similar results.” Slide 7: “Generally, as first approximation, all 4 ways give similar results, but there may be subtle differences between them.” So, how can he be so dogmatic that “the transmission certainly wasn’t vertical”? So, apart from the ears, the flat Shroud neatly reproduces the curved face of Agamemnon. This is not evidence for any kind of drape, but rather for the vertical radiation hypothesis OK rejects. Exactly opposite: it disproves vertical projection. Use your imagination and guess where hair should be roughly in the ears area, on the sides of the head. Compare it with the mask of Agamemnon and Lavoie’s diagrams (slide 23). See the position of bloodstains. The vertical projection cannot be maintained any longer..","date":"2015-10-17","mins":"2:00 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212858","author":"o_k","post":"Hugh: here you have the exact dimensions of Agamemnon mask: http://odysseus.culture.gr/h/4/eh430.jsp?obj id=4503 width: 0,017 m, height: 0,025 m The dimensions of Shroud face (with hair) are roughly similar:So maybe instead of hinting that I manipulated something, you would rather admit me right? Or do you prefer to run away and hide?.","date":"2015-10-17","mins":"3:37 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212885","author":"o_k","post":"Hugh, do I really need to show you evidence that all those images were originally the same size:In simple mathematical terms, an equilateral triangle 25cm across and 7cm high has diagonal sides of 28.6cm. About 14 % increase. Hardly a major distortion. About a centimeter in this or that way for a face width, had there been vertical projection. Hardly noticeable at first glance. Hugh, read carefully those two papers: Ercoline, W.R., R.C. Downs, Jr. And J.P. Jackson, “Examination of the Turin Shroud for Image Distorions,” IEEE 1982 Proceedings of the International Conference on Cybernetics and Society, October 1982, pp. 576 579 and Mario Latendresse’s „Evidence that the Shroud was not Completely Flat during the Image Formation” from the 2005 3rd International Dallas Conference The results there are similar to the increase you calculated. They are consistent with human body shape. The shape of the linen draped around the head is similar to the one presented as blue line on Slides 6 & 9 of Part 3 of my presentation, and also similar to the Fig. 7 & 8 in Ercoline et al., and Fig. 4 & 5 in Mario’s paper. With the notable difference that the linen is in contact with sides of the head (see Slide 24 in my Part 3). The cloth was neither in direct contact with the face everywhere, nor was completely flat surface. It was about halfway between them. That’s why it is analogous with the mask of Agamemnon..","date":"2015-10-18","mins":"5:48 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212865","author":"o_k","post":"Hugh: I measured, and requested my readers to measure, the dimensions of the various copies of the Shroud you reproduce in your paper, often side by side, as on Pages 17,18 and 23. The image gets progressively wider and wider in proportion to its height, as specified. You are very welcome to check this for yourself; after all, its your paper. The progressive distortion, which incidentally fits your hypothesis of a loosely draped cloth, may be an inadvertent artefact of the pdf, but it cannot be denied that it is there. The aspect of different pictures may change slightly from slide to slide, as they were put there in a way to include as many of them on individual slides, as necessary. But this is irrelevant, as just the original images, before insertion into presentation, count. Here you have original images from Slide 23. There are only two actually:Firstly, can we ignore the ludicrous dimensions you quote? The Mask of Agamemnon is life size, not a few millimetres in each direction, and it is roughly as wide as it is high. The reproduction in Valladolid is 25cm x 28cm, and one in New York is 26cm x 25cm. I have noticed this. The quoted 17 cm must be then probably cheek to cheek width. But this is similar to the Shroud. Anyway, what’s important, is the Lavoie’s diagram on the left of Slide 23. See the position of bloodstains apparently in the hair. Then look on the comparison with Agamemnon mask on the right. Check where the hair should be, if the Shroud shows similar flattening of a 3 D object. Then you can easily understand that the projection cannot be exactly vertical. However, the most important dimension is not the height or width, but the third. If the mask was laid flat on a table, how high would the nose be above the table surface? The Met Museum copy gives this as 7cm. Cyrano de Bergerac? The actual nose protrusion rather doesn’t exceed about 3 cm. It is most likely because the Mask is not fully flat. A cloth pulled tightly over the mask, in a straight line from ear to nose to ear would be three or four centimetres wider than the mask, and if it was loosely draped it would be even wider. If the Shroud does indeed exactly match the width of the Mask (or of a theoretical body), then it cannot have been draped over it. It must have been more or less horizontal, and the image therefore projected vertically. Nonsense. Just look at Lavoie’s figures: they show the linen actually draped over the body. And as to frontal face distortions check Mario’s paper: https://www.academia.edu/9063899/The Turin Shroud Was Not Flattened Before the Images Formed and no Major Image Distortions Necessarily Occur from a Real Body http://www.sindonology.org/papers/latendresse2005a Slides.pdf or as, a last resort: tape measure, life volunteer & Shroud Scope. You will realise that everything is fine..","date":"2015-10-17","mins":"7:09 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-213033","author":"o_k","post":"Hugh: Mario Latendresse found that a cloth draped over a head face was 28% wider than the head, but Ercoline found that the image on the Shroud was only 6% wider than a head. Because the two papers compare measurements of different face areas. For Ercoline they are: I “width of the face at hair/face intersections a long horizontal level through the center of eyebrows” and J “width of the face at bone structure at edges of eye sockets”, where distortions should be relatively modest. On the contrary: Mario measures the width of the face at line going through the tip of the nose, where distortions should have been maximal. I don’t see inconsistency between the two. Therefore the Shroud could not have been formed by a ‘shortest path’ mechanism, and something more like a vertical mechanism would fit the measurements better. Both Latendresse and Ercoline make this explicit. Mario in Section 2.1 of his paper: “On the other hand, we conjecture that the projection direction and value (its “force”) is probably due to only one rule: the distance attenuation of the projection. That is, every point of the body might be projected by following the shortest path to reach the sheet. That would be a simpler rule unifying the direction and force of the projection. This projection would be perpendicular to the skin or sheet in some cases – for example when the sheet and body surface are flat and parallel. On some other configurations, it would not be perpendicular neither to the skin nor to the body surface. It is beyond the scope of this paper to analyze this conjecture.” and in Conclusions: “We have also conjectured that the mechanism of projection is probably neither normal to the skin, nor to the sheet, and not really perpendicular to gravity, but is probably following the shortest path to the sheet.” Ercoline et al. Do not consider the shortest path projection. As far as I know you are alone in maintaining that the vertical transmission hypothesis is impossible on measurement grounds alone Yes. But that is how it looks like to make new discoveries. Even maintaining a great respect, we must go beyond what Ercoline, Downs, Jackson and Mario accomplished. Even though it apparently looks like, the projection of body on the Shroud isn’t actually vertical. Hugh, if instead of inventing 1000 reasons to undermine my conclusions, you will repeat my reasoning yourself, and check all the premises mentioned (bloodmarks position determined by Lavoie, face distortions measured by Mario & Ercoline, the Agamemnon mask effect, the trick of bandings modulation of the sides of the face, and manage to imagine how the shortest path projection looks like), you will realise that..","date":"2015-10-19","mins":"4:45 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212937","author":"o_k","post":"Hugh: Check Mario measurements from Slides 16 17 (Shroud) of his presentation and the Slide 21. Http://www.sindonology.org/papers/latendresse2005a Slides.pdf You will see that the results are fully consistent, and so is the Shroud draped over the face. Http://www.sindonology.org/papers/latendresse2005a Slides.pdf However, as it is wholly insufficient to be produced by a loosely draped cloth covering a real head, the authors come to the conclusion that: “The character of the distortions and some anomalies of the image seem to be best explained by a vertical mapping process.” I agree with Ercoline. You don’t. It’s a matter of opinion. It is not a matter of opinion, definitely! Ercoline, Downs & Jackson correctly observed that for the frontal face area (and most of the rest of the body), the vertical projection is the most consistent with observed distortion profile, in comparison with two alternative hypotheses (projection perpendicular to the body or the cloth). But they missed something. They missed the possibility of other ways of projection, for example the projection through the shortest path between the body and cloth (see Part 3 of my presentation, Slide 7, figure 4). This is also the way of projection indicated by Mario: See how it works: In the front face area it is close to vertical mapping. But this is not the case for sides! where it is more perpendicular to the body (similar to contact process). Had Ercoline, Downs & Jackson (or Lavoies, or anybody else) analysed the Shroud image a little bit more carefully they would have found the analogies to the Mask of Agamemnon effect. The vertical projection myth really confused Shroud scholarship for more than 30 years..","date":"2015-10-18","mins":"6:09 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212857","author":"o_k","post":"“Shroud like image formation during seismic activity”; Giovanna de Liso; ENEA Frascati Conference May 2010. Http://www.acheiropoietos.info/proceedings/De Liso Web.pdf Unfortunately the PDF is in secure format, and so it’s impossible to do any copy and paste of any extracts without retyping. Ubuntu Linux, and secure format is broken. What do you want to be quoted?.","date":"2015-10-17","mins":"3:22 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212864","author":"o_k","post":"Https://builtvisible.com/the ubuntu installation guide/ or anything similar (type “Ubuntu installation” or similar into Google) Half an hour, and you don’t want to return to Windows..","date":"2015-10-17","mins":"6:21 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-213175","author":"o_k","post":"Thibault: “On the first two pages, it is claimed that removing weave and banding by FFT makes the Shroud face look wider and more realistic” And then: ” actually, it looks wider because the image itself has inadvertently been stretched sideways so it really is wider”. This second sentence seems to be very strange. Can you explain in detail (yes I know: this has to do with your interpretation of the banding effect). This is Hugh’s misconception. The aspect ratio of several images in presentation has been modified, of course, to fit the slides. But original images have not been modified. Check my posts from October 17, 2015 at 11:41 am, October 17, 2015 at 7:09 pm and October 18, 2015 at 5:48 am..","date":"2015-10-20","mins":"2:38 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212667","author":"o_k","post":"Most of the material form the Wiki page is unreferenced, including the date of birth. But it is possible that actual date of her birth is unknown, as during that time (WWII and her escape from communist Hungary) it was very likely for documents to get lost. So date of birth written in her documents may be quite arbitrary. I do not consider some parts of Piczek resurrection theory credible, for several reasons (you have some of them here: https://shroudofturin.files.wordpress.com/2015/10/3dproperties6 3.pdf ) regardless whether she has a formal degree in physics or not. I agree that more transparency in Shroud reasearch is needed, to avoid some spoof or dubious claims by various experts or “experts”. Nevertheless, we should discuss arguments, not people..","date":"2015-10-16","mins":"11:08 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212447","author":"o_k","post":"I am not saying that there may not be some of the True Cross still in existence but I have read that if a person were to accumulate all of the pieces that claim to be from the True Cross that you would have enough wood to build a small house. It’s a long ago refuted nonsense: By the end of the Middle Ages so many churches claimed to possess a piece of the True Cross, that John Calvin is famously said to have remarked that there was enough wood in them to fill a ship: “There is no abbey so poor as not to have a specimen. In some places there are large fragments, as at the Holy Chapel in Paris, at Poitiers, and at Rome, where a good sized crucifix is said to have been made of it. In brief, if all the pieces that could be found were collected together, they would make a big ship load. Yet the Gospel testifies that a single man was able to carry it.” — Calvin, Traité Des Reliques. Conflicting with this is the finding of Charles Rohault de Fleury, who, in his Mémoire sur les instruments de la Passion 1870 made a study of the relics in reference to the criticisms of Calvin and Erasmus. He drew up a catalogue of all known relics of the True Cross showing that, in spite of what various authors have claimed, the fragments of the Cross brought together again would not reach one third that of a cross which has been supposed to have been three or four metres in height, with transverse branch of two metres wide, proportions not at all abnormal. He calculated: supposing the Cross to have been of pine wood (based on his microscopic analysis of the fragments) and giving it a weight of about seventy five kilogrammes, we find the original volume of the cross to be 0.178 cubic metres (6.286 cubic feet). The total known volume of known relics of the True Cross, according to his catalogue, amounts to approximately 0.004 cubic metres (0.141 cubic feet) (more specifically 3,942,000 cubic millimetres), leaving a volume of 0.174 m3 (6.145 cu ft) lost, destroyed, or otherwise unaccounted for. Https://en.wikipedia.org/wiki/True Cross#Dispersal of relics of the True Cross.","date":"2015-10-13","mins":"4:57 pm","url":"https://shroudstory.com/2015/10/13/more-carbon-dating-and-other-studies-of-christian-relics/","cat":"article","title":"More Carbon Dating and Other Studies of Christian Relics"},{"id":"comment-167864","author":"o_k","post":"But it hardly signifies anything, as we know that in Constantinople there were three alleged burial cloths of jesus, including almost certainly our Shroud of Turin..","date":"2014-11-02","mins":"5:16 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166261","author":"o_k","post":"Never too late to do so, Charles. Although there are many people in Russia spreading their so called ‘point of view’ (see what’s going on about Ukraine), they will be happy to hire another one. You have good qualifications for this job, Charles..","date":"2014-10-28","mins":"2:59 pm","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-40558","author":"o_k","post":"In 1870 Rohault de Fleury estimated the total volume of the True Cross to be 36 000 cm^3, while the TOTAL volume of all alleged fragments of the True Cross was LESS THAN 4 000 cm^3. Besides several fragment were lost, for example one large part once stored in Jerusalem was lost when crusader forces were defeated by Saaldin during the Battle of Hattin..","date":"2013-08-06","mins":"6:45 am","url":"https://shroudstory.com/2013/08/06/nbc-a-shroud-in-turin-is-said-to-hold-the-image-of-jesus-a-piece-of-jesus-cross-was-found/","cat":"press_coverage","title":"NBC:  A shroud in Turin is said to hold the image of Jesus & A piece of Jesus’ cross was found"},{"id":"comment-40595","author":"o_k","post":"Here you have the volume major fragments of True Cross, from Michael Hesemann’s “Silent Witnesses of Golgotha”: In mm^ 3, ‘*’ means updated value since de Fleury, Brussels part of 514 590 mm^3 is probably false. Dave: Saint Helen left only 1/3 of the True Cross, another 1/3 was sent to Rome, and remaining 1/3 to her son Constantine the Great..","date":"2013-08-06","mins":"3:37 pm","url":"https://shroudstory.com/2013/08/06/nbc-a-shroud-in-turin-is-said-to-hold-the-image-of-jesus-a-piece-of-jesus-cross-was-found/","cat":"press_coverage","title":"NBC:  A shroud in Turin is said to hold the image of Jesus & A piece of Jesus’ cross was found"},{"id":"comment-40629","author":"o_k","post":"Thanks Dave!.","date":"2013-08-07","mins":"6:08 am","url":"https://shroudstory.com/2013/08/06/nbc-a-shroud-in-turin-is-said-to-hold-the-image-of-jesus-a-piece-of-jesus-cross-was-found/","cat":"press_coverage","title":"NBC:  A shroud in Turin is said to hold the image of Jesus & A piece of Jesus’ cross was found"},{"id":"comment-40596","author":"o_k","post":"O.K. : Dave: Saint Helen left only 1/3 of the True Cross, another 1/3 was sent to Rome, and remaining 1/3 to her son Constantine the Great. Correction: 1/3 of True cross in Jerusalem, 1/3 to Rome, and 1/3 to Constantine. Those thirds were later partitioned into smaller and smaller fragments, which were sent to the churches all around the world, so finding a lost fragment of the True Cross is in fact nothing significant..","date":"2013-08-06","mins":"3:41 pm","url":"https://shroudstory.com/2013/08/06/nbc-a-shroud-in-turin-is-said-to-hold-the-image-of-jesus-a-piece-of-jesus-cross-was-found/","cat":"press_coverage","title":"NBC:  A shroud in Turin is said to hold the image of Jesus & A piece of Jesus’ cross was found"},{"id":"comment-40618","author":"o_k","post":"Daveb of wellington nz : I’m not sure about the thirds being distributed as stated by O.K. There is a very comprehensive article on Wikipedia, but Helena’s dispersal of the Cross seems ambiguous and is not clearly stated: http://en.wikipedia.org/wiki/True Cross Hesemann claims so, but truly, one must check within primary sources. Anyway it is probable, and some fragments are indeed in Rome. One half of the Titulus was left in Jerusalem, one traveled to Rome. So the cross probably shared similar fate. Daveb of wellington nz : The Wiki article indicates that part of the Vera Crux was broken up to be dispersed throughout Christendom as relics. It would seem that the portion Helena left in Jerusalem was substantial, and it was this portion that was often carried by the Crusaders into battle and later captured by Saladin. Is it possible that the relic now discovered in Turkey is the remains of Saladin’s trophy? According to Hesemann what was left from it up to crusades was not so substantial. The patriarch of Jerusalem partitioned it in 638, after muslim conquest, into 19 pieces, from which: 3 were sent to Constantinople, 2 to Cyprus, 3 to Antioch, 2 to Georgia, 1 to Crete, Edessa, Alexandria, Ascalon, and Damascus, respectively, and 4 remained in Jerusalem, of which the largest part was later carried into battle by crusaders. About recent discovery, it was not the Saldin’s prize. In the news report was said that the excavated church in Turkey is 1350 years old. BTW: Because I have Polsih edition of Thiede’s book, if you want to refere to it, please give me a number of the chapter, and closest footnote to the text you want to quote, right? I’m going sleep for now..","date":"2013-08-06","mins":"7:35 pm","url":"https://shroudstory.com/2013/08/06/nbc-a-shroud-in-turin-is-said-to-hold-the-image-of-jesus-a-piece-of-jesus-cross-was-found/","cat":"press_coverage","title":"NBC:  A shroud in Turin is said to hold the image of Jesus & A piece of Jesus’ cross was found"},{"id":"comment-40563","author":"o_k","post":"Thanks, Dave. I have “The Quest for The True Cross” on my bookshelf. Thiede’s books are really worth to read, as they put the early history of Christianity in a complete different light than what is presented in mainstream books, or documentaries on Discovery, BBC, NG etc. Although Thiede had still mantained some prejudice for some relics, Crown of Thorns for example. They still wait for honest examination, without a priori judgement..","date":"2013-08-06","mins":"7:59 am","url":"https://shroudstory.com/2013/08/06/nbc-a-shroud-in-turin-is-said-to-hold-the-image-of-jesus-a-piece-of-jesus-cross-was-found/","cat":"press_coverage","title":"NBC:  A shroud in Turin is said to hold the image of Jesus & A piece of Jesus’ cross was found"},{"id":"comment-190682","author":"o_k","post":"Yes, exactly, Colin, the hypocrisy of the sceptics is feaching full scale. This article by Garlaschelli, Lombatti & Nicolotti is neither scientific, nor popular science. It resembles rather ideological manifesto, with its own “truths” and dogmas. On another forum we have a very interesting discussion about trivialisation of New Atheism movements, that their theses are getting more and more shallow and primitive with time. The same can be said about similar the “Shroud scepticism” movement it gets trivialised as well. This article as well as recent writings of our friend Charles are few, but examples of that trend..","date":"2015-02-11","mins":"6:42 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191020","author":"o_k","post":"Article by Lombatti? Don’t make me laugh! Actually little but propaganda brochure. All his claims are based on of overgeneralization of limited findings, and misrepresentation of several arguments (that’s typical for sceptical rhetoric). In fact, neither of Lombatti’s arguments is decisive, when we take into account a very specific case of the Shroud of Turin..","date":"2015-02-14","mins":"5:51 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-190679","author":"o_k","post":"Don’t you all have impression, that our sceptical friends lack any new argument, and just simply repeat those long refuted old myths and half truths about the Shroud?.","date":"2015-02-11","mins":"6:22 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191069","author":"o_k","post":"And this disproves the argument that Z twist was unknown in Palestine at that time..","date":"2015-02-14","mins":"5:48 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191068","author":"o_k","post":"From Diana Fullbright’s paper (pg. 2 section 4. THE BURIAL TEXTILES) http://www.acheiropoietos.info/proceedings/Fulbright Akeldama Web.pdf A sample of textile from the tomb was tested by AMS radiocarbon dating at the University of Arizona. It was reported to reveal “without question that the shroud was from the beginning of the first century C.E.” Some fragments were determined to be of wool, either of sheep or goat hair. Others from the head area, the largest of which “was about 16 cm. In size,” were of plant origin, probably flax. Since various fragments of both groups, plant and wool, varied according to S or Z twist, it appears that the wrappings were composed of not two, but at a minimum four pieces of cloth. Thus it was not a “shroud” at all. Probably, the man was buried in various pieces of his clothing, as there is historical evidence in rabbinic sources as well as clear archaeological evidence for burial in multiple garments of clothing.","date":"2015-02-14","mins":"5:45 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191070","author":"o_k","post":"And also (about the shroud found in the Cave of the Warrior). This 6,000 year old shroud is a large, rectangular linen cloth, 7 meters (22’ 11”) long and 2 meters (6’ 6”) wide. Even though about a third of it is missing, it could still be reconstructed on the basis of surviving parts. The pattern of the stains and the missing areas creates a mirror image, indicating that the textile had been folded twice in antiquity, forming a four layered wrapping, in which the body of the deceased was placed. The four layers were then sewn together, “as is evident from rows of small holes in each layer” [12]. One might think from size of the cloth that it had been assembled from several pieces. However, it was designed and manufactured as a single sheet. The edges were decorated by bands of a more elaborate weave, incorporating brown and black threads. These were further enhanced by a fringe of long tassels, tied by hand after the cloth had been woven. This disproves another lie, that making a cloth 4×1 meter size was impossible in those times..","date":"2015-02-14","mins":"5:51 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191113","author":"o_k","post":"David Mo: Sure. The weavers of the Turin Shroud found the time machine of H.G. Wells and went back six millenniums to bring the cloth of a warrior chief. But the cloth of the Cave of Warrior was woven in plain weave and S yarns. What a pity! Yeah, you always find a problem, even where it is only apparent. You won’t be content until someone finds 1st century 4×1 meter size linen herringbone 3:1 Z spun cloth from the 1st century Palestine. Until then you will always be complaining that “archeological record disproves authenticity of the Shroud of Turin”. But your demands are obviously vritualy impossible to satisfy in practice, not because such cloths didn’t exist, but because there were very rare. Everyone agrees that the Shroud is unique, one of its kind. In either ancient and medieval times there is no second like that. But it shows nothing. All elements (Z spun, 3:1, linen, size etc.) were possible to perform in antiquity, and the cloth could have been used in 1st century Palestine. “The only parallel with the Turin Shroud textile is a piece of cloth kept in the Victoria & Albert Museum, in London, and it is medieval”. A.Lombatti: “The Turin Shroud and Easter stories”, The Bible and Interpretation, April 2012, http://www.bibleinterp.com/articles/lom368013.shtml Yes. We have discussed this many times. THE TEXTILE SAID TO BE SIMILAR IN WEAVE TO THE SHROUD A REPORT BY JOHN TYRER, BSTS Newsletter No. 27 http://www.shroud.com/pdfs/n27part5.pdf In summary I am of the opinion that the sample of fabric No. 7027 1860 housed in the Victoria and Albert Museum, London, is not a candidate for a parallel to the fabric of the Turin Shroud. Thus, using the same “argumentation” as Lombatti we can conclude that the Shroud of Turin cannot be medieval. It also cannot be ancient. Thus it seems that the Shroud does not exist at all..","date":"2015-02-15","mins":"8:58 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191262","author":"o_k","post":"David Mo: In his brief report, Tyrer find a single differential feature of the fabric: the density per cm2, In other aspects, the fabric is similar to the fabric of Turin. This can not be said of “similar” tissues found in Palestine. In particular in Masada or the wool of Akeldama. This is not the only difference, besides the fabric is much smaller than 4×1 meter. So the cloth is different, and Tyrer concludes it cannot be parallel to the Shroud. What Lombatti and you do , is not valid argumentation but simply a primitve sociotechnique. You are applying double standards. The cloths from Palmyria, Masada, Akeldama etc. Have some similarities with the Shroud, as well as diferences. And so medival cloths like those from V&A. The point for pro authenticty is to show that the presence of the Shroud in 1st century Palestine was possible from technical and historical point of view. So they point to the similar features in other cloths of that period (even if other features were different), proving that the Shroud was technically possible to be produced in that period. On the contrary, the sceptics use double standards. No other cloth, whether ancient or medieval is identical to the Shroud. But when talking about ancient cloths, sceptics underline differences, while talking about medieval they stress similarities with the Shroud. This is clearly a manipulation. But History is not built with vague possibilities but with facts that form patterns of regularities. Pattern on a single specimen! LOL!!! Only rationalists and Shroud sceptics could have invented that!.","date":"2015-02-17","mins":"6:09 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-209970","author":"o_k","post":"That’s one thing I can agree with you, David Mo..","date":"2015-09-09","mins":"10:57 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-209999","author":"o_k","post":"Hugh, I can just say that the whole data regarding 1988 C 14 dating of the Shroud is contrary to accepted wisdom. Nothing stacks up here in no way (neither for correctness of the measurements, nor one simple explanation for incorrectness, nor even conspiracy theories)! One data contradicts another, and all the way round!.","date":"2015-09-09","mins":"4:57 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-150493","author":"o_k","post":"I suppose they came from vacuum cleaner, that Riggi used in 1978..","date":"2014-09-12","mins":"12:36 pm","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"id":"comment-211505","author":"o_k","post":"You can’t really have dpi per cm, as dpi stands for dots per inch, and refers mainly to printers, rather than the resolution of a photo. To the photographs as well check scanner settings. My model has max of 1200 DPI this means that the size of one pixel is about 0.02 mm..","date":"2015-09-29","mins":"2:26 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"id":"comment-197085","author":"o_k","post":"Quran, 4:157, translation M.H. Shakir: And their saying: Surely we have killed the Messiah, Isa son of Marium, the apostle of Allah; and they did not kill him nor did they crucify him, but it appeared to them so (like Isa) and most surely those who differ therein are only in a doubt about it; they have no knowledge respecting it, but only follow a conjecture, and they killed him not for sure. The testimony of the Shroud shows otherwise….","date":"2015-04-21","mins":"2:54 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-211512","author":"o_k","post":"But there are examples (In Septuagint and Josephus) where the word adelfos means some relatives who were not direct borthers, for example Gen: 14:14: ἀκούσας δὲ ῞Αβραμ ὅτι ᾐχμαλώτευται Λὼτ ὁ ἀδελφιδοῦς αὐτοῦ, ἠρίθμησε τοὺς ἰδίους οἰκογενεῖς αὐτοῦ, τριακοσίους δέκα καὶ ὀκτώ, καὶ κατεδίωξεν ὀπίσω αὐτῶν ἕως Δάν And Abram having heard that Lot his nephew had been taken captive, numbered his own home born [servants] tree hundred and eighteen, and pursued after them to Dan. So enough with this protestant nonsense..","date":"2015-09-29","mins":"6:14 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"id":"comment-211513","author":"o_k","post":"Http://www.ellopos.net/elpenor/physis/septuagint genesis/14.asp?pg=2.","date":"2015-09-29","mins":"6:15 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"id":"comment-211581","author":"o_k","post":"One thing is interesting: the first known assertion of the doctrine is 2nd century Protoevangelium of James. I am quite certain that first Christians from 1st 2nd century who professed that doctrine knew Bible (and greek language) much better than Reformers 1500 years later. Yet for those latter, everything was simple: there is no mention in the Gospels that Mary was perpetual virgin, there is mention of “brothers” and “sisters” of Jesus, hence shabby papists are deceiving gullible sheep. We read Bible (first Christians didn’t?) so know better 1500 years later..","date":"2015-09-30","mins":"3:59 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"id":"comment-211592","author":"o_k","post":"Goodness knows how they expected survival of the species to come about They didn’t. Second Coming should have been soon..","date":"2015-09-30","mins":"5:30 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"id":"comment-211413","author":"o_k","post":"Then Charles will come and say that it would have been burned during Protestant reformation..","date":"2015-09-28","mins":"7:54 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"id":"comment-172059","author":"o_k","post":"The commentator is just a little confused. The secret Turin Commission under Cardinal Ballestrero carried out its work during 1969 76. Dave, you have confused as well. The Turin Commision was under Cardinal Michele Pellegrino. Cardinal Ballestrero became Arcibishop of Turin only in 1977. Http://en.wikipedia.org/wiki/Anastasio Ballestrero.","date":"2014-11-19","mins":"9:26 am","url":"https://shroudstory.com/2014/11/19/and-from-hong-kong/","cat":"books","title":"And from Hong Kong"},{"id":"comment-146040","author":"o_k","post":"History of Sudarium: http://www.shroud.com/pdfs/guscin.pdf There is excellent documentary on the Sudarium, unfortuantely Spanish, with Polish lector: http://gloria.tv/?media=137213&language=o9 Ct E7uat Tg.","date":"2014-08-25","mins":"10:20 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146063","author":"o_k","post":"Charles, don’t cry so much outloud your crocodile tears. Anyone who had a relic in western Europe had to develop a story of how it got there and there are lots of legends of boats setting out from the Holy Land and drifting to the coast of Italy or Spain (e.g the arrival of the bones of James on their way to Santiago is very similar). I think it is wrong to assume that the Oviedo one is more likely to be historically accurate than any of the others. Yes, no more likely to be historically accurate, and no less. The arrival of the bones of James to Santiago is very similar, because it seems they arrived there roughly in the same time and the same circumstances transferred there from Jerusalem, when it was captured by Persians in 614. This is discussed by Micheal Hesemann in his latest book about Shroud and Sudarium Legends do not get created around nothing, Charles there is always a grain of truth. I can’t tell you everything about ‘who, where, when and how’, but I can tell you there is more then unimaginative sceptic think. Meanwhile read this: http://www.michaelhesemann.info/6 1 7.html I recommend also Janice Benett’s presentation: http://www.shroud.com/pdfs/bennettpanppteng.pdf and her book: http://books.google.ca/books?id=f U1 J4 So7 OL8 C&printsec=frontcover&hl=pl#v=onepage&q&f=false.","date":"2014-08-25","mins":"12:11 pm","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146041","author":"o_k","post":"It would ruin their career… so it is convenient to discard it, under any convenient excuse. Shame on them!.","date":"2014-08-25","mins":"10:21 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146047","author":"o_k","post":"My point exactly. References? Primary Sources? Nope… Well, in this documentary there are just interviews with the guys who perfromed primary research… I would be glad to see primary reports, just like I have STURP papers at hand. Unfortunately, this is not yet available in case of the Sudarium. The pollen resaerch in case of Sudarium have been completed (after Frei’s deatcth) by Carmen Gómez Ferreras, from the Madrid University. See ‘Select Bibliography’ form Janice Bennett paper: http://www.shroud.com/pdfs/bennettpantxteng.pdf.","date":"2014-08-25","mins":"10:50 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146053","author":"o_k","post":"Also don’t forget that Middle East pollens have been claimed not only on the Shroud and Sudarium, but also on the Tunic of Argenteuil (some 20 years after Frei’s death). So it is definitely not only issue of Frei, and cynical search for some dirties in his life, so common method used by sceptics, with a (dis)honorable mention of Gian Marco Rinaldi, who as I see, has specialised in it..","date":"2014-08-25","mins":"11:05 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146078","author":"o_k","post":"So what do you think about the legend that Belsdon Scott has in his book on the Shroud (pp.32 33) that Patriarch Heraclius of Jerusalem gave the Shroud to the king of Cyprus in 1087 and it was kept on the island until the Turks overrran Cyprus. Then Margarite de Charny escaped with it and the reason that the Savoys were keen to have it was that the duke of Savoy’s wife Anne of Lusignan came from a family that had claimed stewardship of the holy places of Palestine as well as the crusader kingship of Jerusalem. All quite plausible, don’t you think? Plausible, yes. It is plausible that Shroud spent some time on Cyprus on one point of its complicated history but not necessarily at the precise time and circumstances that legend says. We will discuss it another time. Http://en.wikipedia.org/wiki/Acheiropoietos Monastery http://www.whatson northcyprus.com/interest/kyrenia/akhiropiitos.htm.","date":"2014-08-25","mins":"1:36 pm","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-214924","author":"o_k","post":"Dan , the photos certainly went global but it does not seem to have meant much to Turin. One had to wait thirty three years after 1898 for a new exposition and that was a family one, the wedding of Umberto II, which was in line with well established family tradition. Then the Church took over for the 1933 commemorative exhibition. Neither drew enormous crowds and then you had to wait another FORTY years for the next exposition. This does not suggest widespread interest. Lies. Https://www.shroud.com/history.htm#1900 “May 3 24, 1931: Eighth public exhibition on the occasion of the marriage of Prince Umberto of Piedmont, later to become Umberto II of Savoy, to Princes Maria Jos of Belgium. Cardinal Fossati officiates. Two million visitors flock to Turin for this occasion.”.","date":"2015-11-21","mins":"7:00 am","url":"https://shroudstory.com/2015/11/19/just-in-time-for-christmas-the-relic-master/","cat":"books","title":"Just in time for Christmas:  The Relic Master"},{"id":"comment-135906","author":"o_k","post":"Off topic, Dan, have you received my e mail with illustrations of the “long” Mandylion, I sent a couple days ago?.","date":"2014-07-07","mins":"6:23 am","url":"https://shroudstory.com/2014/07/07/is-francis-right/","cat":"books","title":"Is Francis Right?"},{"id":"comment-190960","author":"o_k","post":"Banus. Check Josephus, Vita 2: http://www.ccel.org/j/josephus/works/autobiog.htm And when I was about sixteen years old, I had a mind to make trim of the several sects that were among us. These sects are three: – The first is that of the Pharisees, the second that Sadducees, and the third that of the Essens, as we have frequently told you; for I thought that by this means I might choose the best, if I were once acquainted with them all; so I contented myself with hard fare, and underwent great difficulties, and went through them all. Nor did I content myself with these trials only; but when I was informed that one, whose name was Banus, lived in the desert, and used no other clothing than grew upon trees, and had no other food than what grew of its own accord, and bathed himself in cold water frequently, both by night and by day, in order to preserve his chastity, I imitated him in those things, and continued with him three years. So when I had accomplished my desires, I returned back to the city, being now nineteen years old, and began to conduct myself according to the rules of the sect of the Pharisees, which is of kin to the sect of the Stoics, as the Greeks call them. His characteristic is very similar to John the Baptist..","date":"2015-02-13","mins":"4:07 pm","url":"https://shroudstory.com/2015/02/13/more-information-on-the-book-finding-jesus/","cat":"books","title":"More Information on the Book ‘Finding Jesus’"},{"id":"comment-49312","author":"o_k","post":"Dan, you forgot that I promoted this book since I came to this forum. I have a Polish edition of it. I can say that although it is popular book, not free of some errors, and definetly pro authenticity, it is without doubt worth the price. Barrie Schwortz is also promoting it http://ww.idziemy.pl/wiara/calun przywrocil mi wiare/ http://www.shroud.com/books.htm.","date":"2013-10-31","mins":"8:39 am","url":"https://shroudstory.com/2013/10/31/new-book-about-christs-relics-from-ignatius-press/","cat":"books","title":"New Book About Christ’s Relics from Ignatius Press"},{"id":"comment-191210","author":"o_k","post":"For Louis and O.K. — From Josephus I get that Banus was an ascetic who lived in the desert. Period. Louis said “there were a number of doomsday preachers like John in the Judean desert belonging to baptismal sects.” NO, that is not what comes out of Josephus. Please, give good examples instead of what seems to be great exaggerations. Nabber, I don’t know what the problem is. There were number of ascetic preachers living in the desert John the Baptist and Banus were two of them but there were probably more. It implicates nothing..","date":"2015-02-16","mins":"1:27 pm","url":"https://shroudstory.com/2015/02/13/more-information-on-the-book-finding-jesus/","cat":"books","title":"More Information on the Book ‘Finding Jesus’"},{"id":"comment-49399","author":"o_k","post":"You mean Górny & Rosikoń? No, they haven’t overlooked that..","date":"2013-11-01","mins":"3:28 am","url":"https://shroudstory.com/2013/10/31/new-book-about-christs-relics-from-ignatius-press/","cat":"books","title":"New Book About Christ’s Relics from Ignatius Press"},{"id":"comment-167732","author":"o_k","post":"On the contrary, we know for a fact that the Mandylion was in Edessa since at least the middle of the 6th Century and came to Constantinople with great attention in 944. Yannick, the basic question: What was the Mandylion?.","date":"2014-11-01","mins":"4:36 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","title":"New Publication on Manoppello Veil"},{"id":"comment-183816","author":"o_k","post":"Hello Maggie. “The Face of God” is a must read in the topic of Manoppello. Although written in reportage convention, and more heart moving tale, than mere concise factual report (and slightly exaggerating at times) it nevertheless needs to be read, as it contains a lot of information. But they cannot be taken uncritically..","date":"2015-01-16","mins":"6:04 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","title":"New Publication on Manoppello Veil"},{"id":"comment-50210","author":"o_k","post":"Joe, checking Frei’s list, he claimed Tamarix nilotica Bunge not Tamarix hampeana , if they are different species..","date":"2013-11-06","mins":"2:55 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-167755","author":"o_k","post":"Clearly, author Falcinelli was of the opinion that Manoppello was the Veronica lost from Rome and apparently uplifted by the mysterious stranger who gave it to Giacomo Leonelli in 1506. Falcinelli? Not his opinion on the Manoppello was completely different http://www.shroud.com/pdfs/roberto.pdf O.K.: “What was the Mandylion?” You’ve probably seen Wilson’s 2012 Valencia slide show, innumerable representations of the Mandylion, many classified according to types of their presentation: Yes, of course. But the matter is not that simple. While I agree that the mandylion brought to the Constantinople in 944 was the Shroud (of Turin), but the history of the Mandylion seems to be more complex than standard Wilson theory. I ask: what was the original King Abgar’s Mandylion? What it is reported to be: most certainly an image of the face of the living Christ with big wide open eyes and no bruises or bloodstains on it. So what Image fits this description?.","date":"2014-11-01","mins":"6:09 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","title":"New Publication on Manoppello Veil"},{"id":"comment-50222","author":"o_k","post":"And of course the blood on the Tunic was identified as AB (in 1985 by some Dr Saint Prix although I could find no more details)..","date":"2013-11-06","mins":"4:34 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50209","author":"o_k","post":"Hi guys. Remember, the chapter in Witnesses about Holy Tunic of Argenteuil is in fact only short summary of a book that is my primary source of information about it: André Marion, Gérard Lucotte Le linceul de Turin et la tunique d’Argenteuil A polish edition of it is partailly available at Google Books: http://books.google.pl/books?id=0s9 L Qkw CE Ws C&printsec=frontcover&hl=pl#v=onepage&q&f=false Hugh: It is interesting, is it not, that after vacuuming approximately 10000 cm2 (yes I’m guessing – how big is it?) of the tunic of Argenteuil, 115 pollen grains were found. Marion & Lucotte write that more pollens were found, but approximately 2/3 of them are damaged. 115 were identified under SEM. Collin: As for contamination – calcium carbonate would not not be a problem. All clean up procedures use acid, which would convert the carbon to gaseous CO2. If DDT were a suspected contaminant, then a solvent for lipids is all that is required (DDT being highly hydrophobic and lipid soluble). One could also determine lipid soluble chlorine to get an estimate of maximum contamination. Marion and Lucotte provide details about carbon dating. The first “official” dating at Saclay ordered by Jean Pierre Maurice used two samples gave results 530 650 AD. But another blind dating was ordered using (smaller) part of the same sample with the same pre treatment and cleansing procedure, and gave result 670 880 AD. Marion and Lucotte cliam that test cleansing failed to clear the sample from all calcium carbonate , about 1/3 of initial amount of calcium remained in the threads. The Tunic is heavily contaminated, because in the years 1793 1795, during the French Revolution, it was buried by abbot Ozet in the parish garden to hide it from revolutionaries. So the sense of carbon dating can be seriously questioned..","date":"2013-11-06","mins":"2:50 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50237","author":"o_k","post":"Dave, of course I understand what you mean. And fully agree. Just pointed that even if AB had first appeared in 1000 AD, as sceptics claim, this would change nothing, due to the Virgin Birth (so genetical profile of Jesus is special case). As to Z/S, both Shroud, Sudarium of Oviedo and Tunic of Argenteuil have Z. It is sometimes claimed that this suggest more Syrian origin, than Egyptian for example, but actually proves nothing. And textile trade in the 1st century was very widespread, so the cloth could be produced elsewhere and sold to Palestine. The legend claims that the Tunic of Argenteuil is woven by Mary herself, and it is plausible..","date":"2013-11-06","mins":"6:36 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50231","author":"o_k","post":"Unless Max Frei’s tapes were quite extraordinarily rich in pollen. Some were, some not so much. Some contained hundreds of pollens, some only single specimen. But if the flowers were deliberately laid on the surface of the Shroud, as some claim… Then, what about this: “the bloodstains on the tunic were aligned exactly with the imprinted wounds visible on the shroud.” Really? What wounds, exactly. Not the nails, spear or crown of thorns, presumably. Are we talking about a precise correlation of the dumb bell shaped flagellation wounds? Or the rather general and vague contusions on the shoulders? “Aligned exactly”? Truly we don’t know. We have only Marion’s descriptions and not so clear photos from his and Lucotte’s Le linceul de Turin et la tunique d’Argenteuil. We can trust them or not. Actually, the bloodstains on the Tunic and wounds on the Shroud were first compared in 1934 (Hynek wrote about that in already in 1937later in 1997 1998 André Marion improved the results by using computer simulations of Tunic’s distortions), but forgotten for over 70 years! We can at least say they are consistent. The biggest problem is that there are so many wounds on the back of TS Man, that I wonder how humch unequivocal the results are. BTW: Until 19th century no one was aware that the Tunic is bloodied, as the Tunic is red color and the blood is also red color..","date":"2013-11-06","mins":"5:52 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50340","author":"o_k","post":"Interesting that the premise that real blood exists on the Tunic isn’t protested with a similar vigor as that on the Shroud. The blood on the Tunic was already discovered in 1892. There are blood cells discovered, no doubt there is a real blood on the Tunic despite that false claims that there is no blood on the Tunic are sometimes spread. Interestingly, until 19th century no one was aware that the Tunic is bloodied, as the Tunic is red color and the blood is also red color. BTW.: Joe didn’t write the most interesting discovery about the blood on the Tunic. See Witnesses pg. 191, and right illustration on pg 193..","date":"2013-11-07","mins":"4:52 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50339","author":"o_k","post":"If additional, more sophisticated DNA testing could reveal useful information is an if. Contamination could be a issue it might be possible to selectively minimize it. DNA degradation could be a roadblock for certain nuclear genes, because of its relatively higher abundance, analysis of mitochondrial DNA might prove more useful this was introduced into the US legal system in 1985. To truly determine the relationship or the Shroud to the Tunic or other objects, DNA testing would be the most definitive, this would take it beyond matching blood types. Kelly, Lucotte writes in Le linceul de Turin et la tunique d’Argenteuil that he was able to obtain a genetic code from the Tunic, with 15 genetic markers..","date":"2013-11-07","mins":"4:47 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50212","author":"o_k","post":"Joe, according to this it grows in Israel: http://flora.huji.ac.il/browse.asp?lang=en&action=specie&specie=TAMHAM.","date":"2013-11-06","mins":"3:18 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50345","author":"o_k","post":"Even though AB is the most infrequent blood type in the population and percentage variations exist among certain ethnic groups, having the same blood type is only suggestive evidence, at best. These results are consistent with the idea that the blood on the two objects could have come from the same individual, but that’s as far as it goes (or that the collagen binder could come from the same animal, if you want to go really far). Typing tests are most conclusive at ruling out the relationship between two objects (i.e., when both show different blood types), than ruling them in. To Kelly and others. You don’t see the point. Only 5 % (1 in 20)of human population has blood type as AB. Nevertheless, it was found on FOUR alleged relics of Christ!!! 1. Shroud of Turin 2. Sudarium of Oviedo 3. Tunic of Argenteuil 4. Eucharistic Miracle of Lanciano. Assume all four are nothing but medieval forgeries. What are the chances that such coincidence would have come purely by chance? I discussed this in my article: http://ok.apologetyka.info/racjonalista/w potrzasku bredni prawdy i poprawdy na temat poplamionych krwia relikwii pasyjnych,432.htm First I considered: what are the odds that all the relics would have the same blood type (no matter which) by a pure chance? The distribution of blood types is as follow: 0 type 44 % A type 35% B type 16 % AB type 5 % So the odds that by pure chance, all the relics would have the same blood type (no matter which) are like 4:73 But next step is that we determined on one of these relics blood type as AB (chronologically it was first on Lanciano, but it doesn’t matter). So next question arises: what are the odds that on the 3 other relics the blood type is AB? The answer is obviously: 1:8000 All the relics have the same blood type and the rarest in the whole human population!.","date":"2013-11-07","mins":"5:04 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50347","author":"o_k","post":"Kelly Kearse : Thanks are they are specific details as to which markers and if multiple forms (>2 for each gene) were present? I will send you the scans from Le linceul de Turin et la tunique d’Argenteuil, but unfortuantely not until tomorrow..","date":"2013-11-07","mins":"5:07 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50346","author":"o_k","post":"No, something much more intereesting… ; ) Ask Joe, let he quote that!.","date":"2013-11-07","mins":"5:05 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50351","author":"o_k","post":"Kelly I know, I discuss this widely in my article.The problem is of course interpretation. Look at this from the other side, could the forgers (who of course knew nothing about blood types) be so lucky? Those are not some cloths found somewhere on the dump. Those are items, which are claimed to contain a blood of a certain person, that is Jesus.And this assertion may be right, or may be wrong..","date":"2013-11-07","mins":"5:19 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50366","author":"o_k","post":"Joe thanks. BTW: Did they correct in the english edition the confusion with the maps of the historical track of the Sudarium of Oviedo and the Veil of Manoppello on pages 145 and 219 respectively? Because in polish edition one problem is that they are the same, and another that Alexandria is placed in Macedonia instead of Egypt..","date":"2013-11-07","mins":"7:25 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50367","author":"o_k","post":"The blood cells were claimed to be discovered not only on the Tunic, but also on the Shroud. See this cover: http://www.calun.org/strony/mikroskop/index.html.","date":"2013-11-07","mins":"7:27 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50411","author":"o_k","post":"Kelly Kearse : O.K. : Kelly Kearse : Thanks are they are specific details as to which markers and if multiple forms (>2 for each gene) were present? I will send you the scans from Le linceul de Turin et la tunique d’Argenteuil, but unfortuantely not until tomorrow. Great I appreciate this very much Kelly I have those scans for you: http://imageshack.us/photo/my images/51/5ifw.jpg/.","date":"2013-11-08","mins":"6:59 am","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50372","author":"o_k","post":"Actually I saw that picture only twice, first time on this cover, and second time in Il caso Sindone non é chiuso by Bruno Barberis and Massimo Bocaletti. The Baima Bollone’s Sindone, 101 domande e risposte has no illustrations, and also does not mention discovery of blood cells, as well as his brochure written with Zacca. But Emanuella’s Marinelli La Sindone – Un’immagine Impossibile claims they were indeed discovered. Due to that, I still have some reservations. It is a mystery to me, why Frache & Filogamo in 1973 didn’t notice those cells..","date":"2013-11-07","mins":"8:08 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50375","author":"o_k","post":"No, I have Sindone, 101 domande e risposte, “The Shroud: 101 questions & answers” which has no illustrations, at least in polish edition..","date":"2013-11-07","mins":"8:33 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50417","author":"o_k","post":"Hugh Farey : Then, what about this: “the bloodstains on the tunic were aligned exactly with the imprinted wounds visible on the shroud.” Really? What wounds, exactly. Not the nails, spear or crown of thorns, presumably. Are we talking about a precise correlation of the dumb bell shaped flagellation wounds? Or the rather general and vague contusions on the shoulders? “Aligned exactly”? And for Hugh and others I have more scans from Le linceul de Turin et la tunique d’Argenteuil. Some comment is needed. The bloodstains on the Tunic are best visible in IR. The live model and computer simulation was used to obtain distortions of the Tunic due to position of a man carrying cross (according to Marion it is more likely that SM carried the whole cross, see also http://www.acheiropoietos.info/proceedings/Glori Web.pdf). The relation between marks on the Tunic and the Shroud is as follow: 1 B 2 F 3 G 4 C 5 H 6 I 7 J 8 No match for some unknown reason (loincloth’s belt?) 9 K 10 L.","date":"2013-11-08","mins":"7:43 am","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-45748","author":"o_k","post":"Dan, sorry to take this discussion for a while, but I have off topic question. I sent some questions that I asked you to post on this blog. Did you receive my e mail?.","date":"2013-09-28","mins":"2:44 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-50219","author":"o_k","post":"Dave had there even been no AB in the first century, this would mean nothing, because Jesus was born from the Virgin..","date":"2013-11-06","mins":"4:29 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-45752","author":"o_k","post":"Sent..","date":"2013-09-28","mins":"4:00 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45837","author":"o_k","post":"Hugh Farey : OK’s reference agrees with Pakeha and disagrees with Marinelli. This one (http://www.shroudofjesus.com/page6.html) says pretty well the opposite. There is almost as little consensus among pro authenticitists as there is among the antis regarding the exact mechanism of production. Guys and girls, the problem with Marinelli’s paper is that it is actually a reprint of her 1990 book “The Enigma of the Shroud”, written together with Orazio Petrosillo, so some of the Marinelli’s arguments are outdated. The book was a harsh criticism of 1988 C14 test, basing on what was known at that time..","date":"2013-09-29","mins":"1:49 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45834","author":"o_k","post":"Pakeha: “If there’s anything thing we can say about the image on the cloth, it wasn’t the product of being wrapped around a head, let alone a corpse. I think we’re all familiar with the Mercator Projection?” Read this:http://www.sindonology.org/papers/latendresse2005a.pdf.","date":"2013-09-29","mins":"1:27 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45847","author":"o_k","post":"Jmarino: Maybe not a reprint in technical sense, however many arguments are literally copied from that book with little update. I have read “The Enigma of the Shroud”, and see that some paragraphs look like copy/paste without taking much isight into them..","date":"2013-09-29","mins":"4:46 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45863","author":"o_k","post":"Pakeha: No, the imprint on the Shroud is not Mercator projection. Actually, Mario Latendresse has shown that contrary to previous beliefs (which claimed that the Shroud must have been completely flat), it is possible for the body to leave projection without creating major distortions. They would appear ONLY if the image had been a contact image, of which the Shroud is not the case. However there are some minor distortions, which is totally consistent with Shroud enveloping the real human body, contrary to what Joe Nickell and Stevven Schafersmann claim. I have dealed with one sceptic who claimed the same. See my article: http://ok.apologetyka.info/racjonalista/caun turynski faszerstwo niedokonane cz 1,558.htm It is in polish, but Google can translate it..","date":"2013-09-29","mins":"5:54 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45850","author":"o_k","post":"Which, of course, does not mean that Marinelli’s paper is invalid. But simply must be taken with some caution..","date":"2013-09-29","mins":"5:03 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45960","author":"o_k","post":"Pakeha: Generally I saw that google translated some previous articles well, but unfortunately not in this case. In fact those articles were written for Poles, and I don’t bother translating them into English too much work. The main point: the Shroud didn’t lay flat, neither it was in strict contact with the body. The situation was something between the two, and Mario Latendresse showed in his paper, that it doesn’t create any major distortions which were argued before, both by sceptics and Shroud proponents..","date":"2013-09-30","mins":"6:22 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45864","author":"o_k","post":"Jmarino240 : pakeha wrote: “Flury Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?” Please see the end portion of my reply to David in #37. Remember there is some conflict of interest (and responsibility!) here. Flury Lemberg has been hired by the Archidiocese of Turin. And they don’t want to admit that the samples they cut from the Shroud and gave to the laboratories were actually flawed..","date":"2013-09-29","mins":"5:59 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45868","author":"o_k","post":"Pakeha : Why ever not? Keep in mind that Flury Lemburg, while rebutting the patching idea, believes the 14th century datingto be flawed. Yes, but then this is the laboratories’ guilt. Had samples been bad, reweaved or something, then the Archidiocese (which organized the sampling) is guilty..","date":"2013-09-29","mins":"6:17 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45962","author":"o_k","post":"Pakeha : But we know the samples weren’t bad. Flury Lemburg is most steadfast in explaining why that is so. Remember, Flury Lemburg headed the team of the 2002 restoration. Is there anyone alive who is more familiar the that linen fabric? In any case, because of the observable ‘banding’ of the weave of the cloth, we know there’s no sign of patching or reweaving in the area. From this: http://www.shroud.com/pdfs/whanger.pdf “There is significant variability in the radiodensity of both warp and weft threads in this area. Some of the threads angulate, and the continuity of a few seems to be broken. This area is denser and the 3:1 herringbone weave pattern is much less obvious than in the nearby body of the Shroud fabric.Our conclusion is that the radiographs are strongly suggestive of significant alterations in the threads and weave of the Shroud fabric in the area from which the C14 specimen was taken, thus casting major doubts on the validity of the radiocarbon dating.” I know that Flury Lemberg is currently the most being in touch with the Shroud person in the world and I don’t disregard her opinion. But she is not the single textile expert in the world, and I feel she is trying to defend both Archidiocese, and her colleagues Vial and Testore. However, basing on what Joe wrote in his paper http://www.shroud.com/pdfs/chronology.pdf “Entry:#7 Date:1988 Data Category:Evidence of anomalous nature of C 14corner Evidence: Edward Hall,head of the Oxford lab,noted odd fibers in the C 14 sample. Hall enlisted the opinion of Peter South of Derbyshire lab,who concluded,―the roguefibers were fine dark yellow strand cotton …and may have been used for repairs in the past” Flury Lemberg’s assertions sound simply ridiculous. But for sceptics they are, of course, the Holy Truth. Likewise the carbon dating labs are sacred cows..","date":"2013-09-30","mins":"6:40 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45980","author":"o_k","post":"“The responsibility is shared by both the laboratories and Archidiocese. However the bad will of the latter is obvious to me” Sorry it had to be the bad will of the laboratories. But the Archidiocese also screwed the sampling maximally as it was only possible. They all share the blame. The Archidiocese decided to play wit the devil, and thus there were results… One interesting thing, the dates 1260 1390 were announced on press release on 13th October 1988, however, “Nature” received paper ON 5 DECEMBER. With unacceptable Chi^2 value of 6.4, which meant that the RESULTS ARE INCONCLUSIVE and should be rejected. The true date of the Shroud was thus UNKNOWN (the 1260 1390 was just onlyaverage of the Shroud and possible alien contaminants). However on 13th October it was PUBLICALLY announced that the Shroud was a FORGERY, and all who thought otherwise were idiots, while MAINTAINING SILENCE on unacceptable Chi^2 value. This is nothing but MANIPULATION. Only after such sensational announcement the results were sent to “Nature”, which in turn, COULDN’T simply reject the paper. In my opinion, the place for Tite, Sox, Hall, Hedges, was definetly in prison. Even despite the mesurements themselves were properly done..","date":"2013-10-01","mins":"8:02 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45978","author":"o_k","post":"Pakeha : jmarino240 : pakeha wrote: “Flury Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?” Please see the end portion of my reply to David in #37. Hang on. Are you saying Flury Lemburg was incompetant to find cotton fibres in the area? And seriously, do you understand the amount of extraneous fibre need to have skewed the dating. Are you claiming Fleury Lemburg wouldn’t notice there was over 50% cotton in that area? Or is she part of the conspiracy? He understands. About 75 % of material must be new to skew the dating from the 1st to 14th century. Contrary to what one documentary says, the pach consist mainly of linen with only some additions of cotton. Is she part of the conspiracy? I wouldn’t say in that way. Just I as I mentioned she only wants to defend Archidiocese, which organized sampling, and her colleagues Vial and Testore who participated in it. The real scandal was that actualy everyone probably knew that something wrong was with the sample, nevertheless they decided to keep going with the datings. The results were as they were. The responsibility is shared by both the laboratories and Archidiocese. However the bad will of the latter is obvious to me. I don’t believe the datings were faked, the samples switched or something, but most probably the raw data were manipulated to obtain the most desired (and self consistent) dates. Pakeha: You still have to learn much about the Shroud. Try to read my article describing 1988 carbon dating: http://ok.apologetyka.info/racjonalista/dzieje caunu turynskiego wedug leszka zuka z racjonalisty cz 2,629.htm ,of course if google translates it well enough to be understandable..","date":"2013-10-01","mins":"5:34 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-191719","author":"o_k","post":"Hello Dan, may I ask you something about that book? Did they mention any radiocarbon of any alleged piece of the True Cross? Charles Freeman mentioned in some comments that they planned to do so, and CNN trailer indicates that as well http://edition.cnn.com/videos/tv/2015/02/19/cnn original series finding jesus 03 01 15.cnn creative marketing.","date":"2015-02-24","mins":"6:02 am","url":"https://shroudstory.com/2015/02/24/so-far-after-a-quick-first-reading-i-like-it/","cat":"books","title":"So far, after a quick first reading, I like it"},{"id":"comment-157472","author":"o_k","post":"Had it been only, Andrea, had it….","date":"2014-09-28","mins":"11:16 am","url":"https://shroudstory.com/2014/09/26/the-metamorphosis-and-manipulation-of-a-legend/","cat":"books","title":"The Metamorphosis and Manipulation of a Legend?"},{"id":"comment-167897","author":"o_k","post":"If someone desires to read it, large part of Andrea’s book is availale on Google Books: http://books.google.pl/books?id=W2 HPBAAAQBAJ&pg=PA125&lpg=PA125&dq=Andrea+Nicolotti,+Lucca&source=bl&ots=JT6 E7eu H Cg&sig=o Bbgga E1fu J83 K4 I Zc JJ Bzu QFNA&hl=pl&sa=X&ei=Lz RWVN34 Jsv Zap P Dgr AJ&ved=0 CFEQ6 A Ew Bg#v=onepage&q&f=false.","date":"2014-11-02","mins":"9:43 am","url":"https://shroudstory.com/2014/09/26/the-metamorphosis-and-manipulation-of-a-legend/","cat":"books","title":"The Metamorphosis and Manipulation of a Legend?"},{"id":"comment-53397","author":"o_k","post":"His extensive bibliography includes three published items by Mme Flury Lemburg. 1) “The Linen Cloth of the Turin Shroud: Some Observations of its Technical Aspects” in ‘Sindon’, new series, no. 16, December 2001, pp.55 76; 2) ‘Sindone’ 2002, “L’Intervento Conservativo, Preservation, Konsieverung,” Turin, Editrice ODPE, 2003; 3) ‘The Invisible Mending of the Shroud in Theory and Reality’, in ‘Shroud Newsletter’, 65, British Society for the Turin Shroud, June 2007, pp.10 27. The third one is irrelevant to the question of Masada stitching. Whether there is anything in any of these references concerning the stitching of the selvedge piece to the main cloth, I am unable to say. I also, as I don’t have any of those sources. However, based on this http://www.pbs.org/wnet/secrets/previous seasons/case shroudchrist/interview.html and quotation from this: http://www.shroud.com/pdfs/chronology.pdf “This further implies the two sections of sewing threads (C 14 region versus main Shroud) were applied at different times and by different artisans with the main Shroud stitching possibly from the same time period as a cloth from Masada in Israel, dated to BC 40 to AD 73 [M. Flury Lemberg, Mechthild, Sindon N.S. Quad. 16 (Dec 2001., pg. 60)].” we can say that the argument from stitchings is MFL observation, and not Wilson’s extrapolation, as Charles is trying to suggest. However, I would be careful about that, since we have no guarantee that such stitching is unparalleled in history..","date":"2013-11-28","mins":"5:15 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"id":"comment-145596","author":"o_k","post":"Off topic, Mario, may I ask what will be with this photo of Manoppello, that I sent you a month ago or so to be installed in Shroud Scope?.","date":"2014-08-23","mins":"5:21 am","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","title":"Looking for a paper by Mark Andersen"},{"id":"comment-214492","author":"o_k","post":"But I what I do know is that there is a significative difference between young students (less than 22 years old) unaware of pareidolia, like in this study, and professional optical engineers and historians well aware of this psychological phenomenon. Are you sure? Because I think the whole term ‘pareidolia’ is overused in Shroud research, while the problem is different: Here you got those inscriptions from Castex, as well as Marion & Courage and Frale books: http://thierrycastex.blogspot.fr/Here you have (physically) some greyscale structures that can be “creatively” interpreted as letters, or even whole inscriptions. But “creative interpretation” does not prove (nor disprove) they are real. To have a good sense whether they are real structures, or merely random noise, you need more. I think the inscriptions & coin issues are good material for Monte Carlo simulations. These are routinely performed in similar issues in other (non Shroud related) studies. The main question is why no one has performed them yet with regards to the alleged Shroud inscriptions & coins? Perhaps I know a few people who could perform such a simulation. But simply, I don’t want them to get involved in Shroud research, knowing what the hell enviroment it is..","date":"2015-11-11","mins":"7:05 am","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin"},{"id":"comment-214502","author":"o_k","post":"I have some difficulty in envisaging how a Monte Carlo simulation might be applied in deciding whether a perceived object is real or not. Can you elucidate what you envisage? More less, we upload the Shroud results (coins, inscriptions) as potential outcome, we set a random model for greyscale distribution, and check whether obtaining a pattern of inscriptions/coins through the random process is likely or not. We set some significance level, we run several simulations, and we count a number of random “coins/inscriptions” obtained. And then we decide whether it is likely that alleged coins or inscriptions are real, or just random noise. Details to be worked out..","date":"2015-11-11","mins":"3:14 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin"},{"id":"comment-94497","author":"o_k","post":"As for Frei, his work can only be considered anecdotal at best and is not supported by any peer reviewed science. There is a lot more I could say about this, but this post is already longer than I like, so we’ll just leave it there for now. Barrie. With highest respect to your efforts, but after reading Oblicze Prawdy/Essence of Truth – A Jewish Man Investigates the Shroud of Turin I am under impression that some of the former STURP members, including you, Ray Rogers, and a few others, feel like if they had been the only ones who had been given the privilege to study the Shroud, and thus the right to denounce the results of other researchers, who were not members of the STURP. For example Frei. His results had been controversial, one must admit, but I don’t think wothless. They have been at least partially confirmed by Baruch and Danin (with whom later Litt disagreed, but that’s another story). Although I have the STURP efforts in highest esteem, I am highly disgusted with sometimes arrogant attittude of some of its former member. Frei was not the member of the STURP so he must be condemned indiscriminately. For the principle. You are not in the STURP so you have no right to speak authoritatively about the Shroud. Period..","date":"2014-03-29","mins":"7:09 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-214503","author":"o_k","post":"Daveb: O.K. I have carried out several Monte Carlo simulations during my working career and also since then during personal research projects, Would you manage to deal with the Shroud issue? Because it may be real input to the coin/inscriptions issue..","date":"2015-11-11","mins":"3:16 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin"},{"id":"comment-214506","author":"o_k","post":"If you have a lot of free time after retirement (and want to contribute an important paper re the Shroud)… Perhaps it is a motivation to invest into a new laptop..","date":"2015-11-11","mins":"3:58 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin"},{"id":"comment-94554","author":"o_k","post":"“You” was not directed towards Barrie, but towards any Shroud researcher outside the STURP (Frei, Marion, Flury Lemberg are just examples). STURP sometimes presents “we know better” attitude, which I very dislike..","date":"2014-03-29","mins":"11:17 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94538","author":"o_k","post":"Time out. Where have things gone when Barrie Schwortz is to be impeached on charges of indiscriminate condemnation and having no right to speak? Who said he has no right to speak? He has a right to speak and defend his views, just as I have the right to criticize some of them. Barrie Schwortz is one of the most balanced & objective members of the Shroud crowd. No doubt. But even he, in my opinion is wrong sometimes. Not very often, but there are some things where I deeply disagree with him. But the matter is more general, and does not concern only Barrie. I have observed several instances when some STURP members feel they are the only ones who performed scientific examinations of the Shroud and all the claims coming outside the STURP circle must be dismissed. Such attitude that if not one of ours, then he/she definetly must wrong. Frei is just one example of that..","date":"2014-03-29","mins":"10:13 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94584","author":"o_k","post":"It’s not about difference in techniques or results. It’s about ignorance. For Rogers, the Baima Bollone’s results simply do not exist. Ignorance, or dellibarate omission? Anyway this gives bad impression about how one group of researchers perceives the others. That’s the problem. Lack of mutual respect, and inter factional wars and animosites in the Shroud community. If you are not one of ours, your results does not deserve mention or should be portrayed in negative light..","date":"2014-03-29","mins":"1:05 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94562","author":"o_k","post":"Kelly, if I may just put an example. See Ray Rogers’ FAQ: http://www.shroud.com/pdfs/rogers5faqs.pdf The question two: 2) How do you know that there is real blood on the Shroud? Rogers wrote: Several claims have been made that the blood has b een found to be type AB, and claims have been made about DNA testing. We sent blood flecks to the laboratory devoted to the study of ancient blood at the State University of New York. None of these claims could be confirmed. […] It is almost certain that the blood spots are blood, but no definitive statements can be made about its nature or provenience, i.e., whether it is male and from the Near East. And further about aloe and myrrh: Biblical accounts suggested several types of compounds that might have appeared on the cloth (e.g., aloes, myrrh, sebaceous secretions, etc.). We planned and executed chemical analytical methods that could detect them in 1978. Those methods were extremely sensitive, but they did not detect squalene or myrrh. These results could have been confirmed by additional tests on the Shroud, but the “restoration” has totally changed the Shroud’s surface. May I ask: was Rogers even aware about Baima Bollone’s existence? And what about insinuations in the style of: A suspicious person might wonder whether the “restoration” was rushed through to prevent ethical work on confirming both chemical and pollen observations. (still from Rogers’ FAQ). No low blows, really? Such arguments are repeated in one place of the Barrie’s nterview with Górny and I find them distasteful..","date":"2014-03-29","mins":"11:42 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94552","author":"o_k","post":"Misunderstanding. ” You are not in the STURP so you have no right to speak authoritatively about the Shroud. Period.” This is the attitude I criticize. I sense that some STURP members feel, or felt that they have the monopoly on the scientific knowledge about the Shroud. They don’t, but the myth that the STURP was the first/the only team that scientifically examined the Shroud (forget the research in 1969, 1973, 1988 and 2002) is still widespread. And besides much of the research was and is being performed without the physical contact with the Shroud, or any samples derived from it..","date":"2014-03-29","mins":"11:10 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94632","author":"o_k","post":"Dave, sad to say, but I am under impression that this is the aftermath of some vindictive attitude of STURP towards Frei. He, using ordinary sticky tape, obtained 300 or so pollens from the Shroud surface, if I recall correctly, while STURP, using their sophisticated pressure regulated tapes obtained only a single specimen. So the envy of the STURP is nothing surprising… See for example Barrie’s presentation from Valencia conference: http://www.shroud.com/pdfs/schwortzv.pdf The description of Frei’s is just one cry that he made the Shroud dirty, and complains about strains to the cloth. But who cares about pollen and results? Sorry, but I don’t want to beat around the bush. Dave, don’t care about Barrie’s opinion towards Frei..","date":"2014-03-29","mins":"4:08 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94644","author":"o_k","post":"I don’t think Barrie was unkind or vindictive in his rejection of Frei’s work as valid, but until these points are clarified or explained, I cannot but agree with him. At first, I hardly believe that Barrie is authorative in that area. It is not up to him to decide whether Frei’s results are valid or not. A full analysis of all his findings, and how they relate to the findings of Danin, Baruch, Litt et al. Has been prepared for the next BSTS Newsletter. Fine. Just from the sceptical point of view, or from more balanced? Hugh, have you seen this: https://www.academia.edu/1536346/The question of pollen grains on the Shroud of Turin and the Sudarium of Oviedo ?.","date":"2014-03-29","mins":"4:39 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94701","author":"o_k","post":"Well Barrie, that means you does not consider Mme Flury Lemberg a scientist… Truly, I don’t know any other names who took part in 2002 restoration, but I hardly believe they were random people picked from the entrance of the pub. And accusations that the Shroud image on the Shroud has faded since the restoration, because they attached a light backing cloth to it (thus smaller contrast with the background)… well this is ridiculous!.","date":"2014-03-29","mins":"6:59 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94683","author":"o_k","post":"Hello Barrie: It has NOTHING to do with whether or not he was a member of STURP. Sadly, it was Frei’s own actions, both during and after the 1978 examination, that led to doubts about his methods and conclusions. The problem is, as I see that in when describing Frei’s efforts in your work, there is too much concentration on how “unproffesional” (in yours, and your STURP coleagues) the behaviour of Frei was. So the most important are complains that his tapes left glue residues on the Shroud, that he caused considerable strain on the cloth etc. Only the negative (in your view) aspects of his work. Well, there are two sides of the medal perhaps he knew what was he doing, and what methods he considered appropriate for his work. One should also remember that he was present during 1973 examination, so contrary to STURP team, he had an experience with the Shroud. There are other aspects with which I disagree. The opinion voiced by you in the interview with Górny regarding 2002 restoration was the point I disliked most. No matter how controversial the restoration was, the accusatory pronouncement, full of (sometimes absurd) charges, verging on the insinuations towards Turin was really disgusting. But I suppose it only reflects the attitude of some American (and not only) researchers, who, when not granted access to the Shroud, were spreading innuendoes towards Turin that for some purpose it wanted to “destroy” the Shroud. And at last well the matter of pareidolia, particularly about the claims of the inscriptions claimed on the Shroud. While certainly being controversial, I think that this problem is too easily dismissed by several Shroud researchers, including you, Barrie. In my opinion, the pareidolia is often used as an easy and convenient excuse to put the matter aside, without giving it the proper and balanced assesment. It is easy to accept and defend information that supports our personal beliefs whether it is credible or not, and ALL of us are susceptible to such errors in judgement. I agree. We are all susceptible. Both you and I and everyone else on this forum or anywhere..","date":"2014-03-29","mins":"6:30 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94698","author":"o_k","post":"Thanks OK. Yes I am familiar with Marinelli’s article. However it does not deal with the points raised above, which, in the absence of explanation, continue to cast doubt on Frei’s reliability. Neither Barrie nor I need to be palynologists to raise these difficulties – maybe someone does need to be one to settle them. But Hugh, can we at least dismiss the accusations of fraud towards Frei?.","date":"2014-03-29","mins":"6:52 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94707","author":"o_k","post":"The problem is general reliability of palynology, not just the Frei’s identification. Frei identified some pollens of the spiecies gundelia tournefortii Danin and Baruch claimed that 91 out of 313 pllens were gundelia tournefortii Litt claimed that with the high probability it is not gundelia tournefortii but carduus. Marzia Boi claimed that alleged gundelia tournefortii is actually helichrysum So one can shout: WTF, how much value has the whole pollen examination? Every palynologist says different things about the very same pollen! So if you are a criminal, and have been convicted by pollen evidence invoke the casus of the Shroud. Maybe they will have to release you from jail..","date":"2014-03-29","mins":"7:12 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94862","author":"o_k","post":"They would need to find their own experts to counter Frei’s evidence. Did they? Dave, I posted in #57: “The problem is general reliability of palynology, not just the Frei’s identification. Frei identified some pollens of the spiecies gundelia tournefortii Danin and Baruch claimed that 91 out of 313 pollens were gundelia tournefortii Litt claimed that with the high probability it is not gundelia tournefortii but carduus. Marzia Boi claimed that alleged gundelia tournefortii is actually helichrysum So one can shout: WTF, how much value has the whole pollen examination? Every palynologist says different things about the very same pollen! So if you are a criminal, and have been convicted by pollen evidence invoke the casus of the Shroud. Maybe they will have to release you from jail.” BTW: I posted response about Scavone vs Templars here, if you haven’t noticed https://shroudstory.com/2014/03/24/giulio fanti in the spotlight and a crash course on the shroud of turin/#comment 94503.","date":"2014-03-30","mins":"6:29 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-126432","author":"o_k","post":"Unfortunately, it seems that we in Poland cannot watch this it claims that it is unavailable in our country..","date":"2014-06-03","mins":"5:03 am","url":"https://shroudstory.com/2014/06/03/and-speaking-of-secondo-pia/","cat":"video","title":"And speaking of Secondo Pia"},{"id":"comment-193405","author":"o_k","post":"There is something far worse than CNN show: the “review” of it by Lombatti and comments below by Goodacre, Zias and Freeman..","date":"2015-03-15","mins":"5:49 am","url":"https://shroudstory.com/2015/03/15/did-anyone-like-it/","cat":"television","title":"Did Anyone Like It?"},{"id":"comment-192176","author":"o_k","post":"As the the Gibson movie and virtually all medieval art, Christ is shown carrying a complete cross. In reality, crucifixion victims carried “only” the cross bar. That’s not true, John. In fact, analysis of both the Shroud and the Tunic of Argenteuil show that Jesus most likley carried the whole cross. The sole patibulum theory has been in fact discredited as untenable See: http://www.acheiropoietos.info/proceedings/Glori Web.pdf More later..","date":"2015-03-02","mins":"7:34 am","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website"},{"id":"comment-214541","author":"o_k","post":"Hugh, Charles: I have Frale’s books regarding the Shroud. Frale claims that sometimes unexplained transfer of inscriptions from papyri to the adjacent surface happens, citing one instance from Qumran as an example. But providing no details what may be the reason in case of the Shroud..","date":"2015-11-12","mins":"3:40 pm","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"id":"comment-192241","author":"o_k","post":"Me dogmatic? No, I take all possibilities (and impossibilities) into account.I am just uncompromising regards to the wrong things. And the hypothesis that Man of the Shroud carried just the patibulum is almost certainly wrong when I have some time I will show why..","date":"2015-03-02","mins":"6:29 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website"},{"id":"comment-192227","author":"o_k","post":"Dave, I will show you that Barbet was wrong on this matter Jesus carried the whole cross, not just the patibulum (this is long standing myth of sindonology). But later on, following days or rather weeks..","date":"2015-03-02","mins":"3:50 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website"},{"id":"comment-193472","author":"o_k","post":"Dave. I am not specialist, but so far I know, Septuagint, New Testament and Josephus often uses the term “adelphos” for cousins and other close relatives who were not full brothers (Mt 14:3, Mk 6:17, Lk 3:1, Gen 13:8, 14:14, Gen 14:16). I base on the polemic of my friend from Apologetyka.info websites. Http://lewandowski.apologetyka.info/kosciol katolicki/maryja/dziewictwo marii cz3,99.htm There is no evidence whatsoever that Mary ever lost her virginity. Nowhere. Despite hundreds years of attempts to challenge Mary’s perpetual virginity, no one has proven otherwise. The only problem is shameful “white flag” policy of some modern “catholic” scholars..","date":"2015-03-16","mins":"4:43 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-98992","author":"o_k","post":"Meanwhile, I have been racking my brains to try to produce anything sensible from Dr Phillips’s description of the radiation which although in 360° degrees, does not interfere with itself as it affects the cloth. Let it interfere, Hugh. Remember our discussion about holography yesterday. Http://en.wikipedia.org/wiki/Holography.","date":"2014-04-13","mins":"1:34 pm","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-193493","author":"o_k","post":"There is no evidence that Mary was always a virgin. It’s very clear what the NT says all over the place. He was not a cousin because the greek word for cousin or relatives is “syggenē.” Paul wrote: Gal 1:19 But other of the apostles saw I none, save James the Lord’s brother. So Paul did not use the word brother in the generic sense at all. This has also been discussed by my friends at Apologetyka.info: http://lewandowski.apologetyka.info/kosciol katolicki/maryja/czy sowo kuzyn z kol 410 przeczy idei jedynactwa jezusa,382.htm There is no evidence that Mary ever lost her virginity (nor otherwise). No matter what lingustic/semantic/interpretative approach you go, you have no conclusive proof of her defloration. You will not manage to rape the Virgin. So as there is no conclusive evidence in either way, you have the right to believe whatever you want. But respect the same right for the Catholics. The oldest Church tradition maintained she was perpetual virgin, so Catholics have justifable right to believe so..","date":"2015-03-16","mins":"7:42 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-99005","author":"o_k","post":"So think about different interference… I am thinking how to make a model with coherent beams from all the body points, + some absorption & scattering in the medium between body and the Shroud creating some hologram with body cloth distance information saved on the linen… http://en.wikipedia.org/wiki/Radiative transfer.","date":"2014-04-13","mins":"2:13 pm","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-70127","author":"o_k","post":"Naturally, he would derive this liturgy entirely from the existence of the Shroud, while I am inclined to derive the existence of the Shroud from the liturgy. In other words, to paraphrase Voltaire, even if the shroud did not exist, it would be necessary to make one. Anyone any comments? Yes. A little question to you and all those who believe the TS is a piece of liturgical art. What is easier to do: to derive the liturgy from the existence of the Shroud, or the existence of the Shroud (which no one has been able to faithfully reproduce yet) from the liturgy?.","date":"2013-12-30","mins":"9:51 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-192163","author":"o_k","post":"Mostly agree. Typical show, nothing special. But I don’t think it was ‘sceptical’ like most of the shows of the kind it was ‘neutral’ (this neutrality was forced of course, because sceptics really don’t have any serious arguments in this argue) for political correctness. Full episode available for watching here: http://edition.cnn.com/videos/tv/2015/02/26/finding jesus season 1 episode 1.cnn The ‘In search of the Holy Treasure’ was much better I think. But wasn’t aired by CNN unfortunately..","date":"2015-03-02","mins":"5:31 am","url":"https://shroudstory.com/2015/03/01/open-discussion-about-episode-one-examining-the-shroud-of-turin/","cat":"television","title":"Open Discussion About Finding Jesus, Episode One: Examining the Shroud of Turin"},{"id":"comment-210980","author":"o_k","post":"Did he answer you after you mentioned all the research?.","date":"2015-09-23","mins":"4:34 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211007","author":"o_k","post":"The mysterium iniquitatis is a big problem. I don’t think it is a “problem” (or better say “trouble”). In my opinion, it is better that it remains a mystery. Because it connects with the problem of the Fall of Angels, and the Origin of Satan. There is an excellent popular article (“The Fall of Angels: 7 hypotheses”) on this topic by demonologist Roman Zając: http://www.stacja7.pl/article/1927/Upadek+anio%C5%82%C3%B3w.+7+hipotez It is in polish, unfortunately, but it is definitely worth reading (google translator should help). The fact is that none of the 7 hypotheses presented gives a full answer. And that’s how it should be (contrary to Quran for example, which gives too simple answer). There are no simple answers. It is the matter between omniscient, omnipotent and omnibenevolent God who knows perfectly Good and Evil, and its free will gifted Creation, in the person of Satan..","date":"2015-09-23","mins":"1:34 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-210992","author":"o_k","post":"Fourthly, be very specific. Scholars like to check detail. If you had explained exactly how you knew that the Shroud had covered a body, or how you knew that the red marks were blood, Dr Ermann might have been more responsive – as I might myself, in similar circumstances. Hugh, I suppose you would be much more responsive than Ehrmann because I suppose his knowledge on the Shroud is likely null. Like most other “authorities” in biblical (or similar) scholarship. That’s how this field looks like..","date":"2015-09-23","mins":"10:17 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211003","author":"o_k","post":"That does not answer the question of why should there be evil in the first place. Yes. But the problem is wrongly stated. This is not the question for God, but for us, as conscious and free will entities..","date":"2015-09-23","mins":"12:18 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211570","author":"o_k","post":"Yes, they are still. And Mandylion theory is still the best explanation for the Shroud whereabouts before 1200s although needs some modifications no matter what uncritical fans of storyteller Markwardt think. But we will discuss this other time, as this is long story. You can still rely on Wilson at least in the main outlines..","date":"2015-09-30","mins":"1:13 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211579","author":"o_k","post":"“Curiously, however, neither Ian Wilson, nor any advocate of his ideas, nor any skeptic or critic of his Mandylion theory ( e.g., Andrea Nicolotti, Charles Freeman), nor, for that matter, any crazy blogger has,to the best of my knowledge, pointed out even a single historical error or flaw in reasoning regarding my detailed and lengthy St. Louis paper. “ Perhaps because it is too lenghty, and no one has time for that. What can I say now is that for example Markwardt borrows heavily on Pfeiffer ideas, but somehow he is restrained to analyse Pfeiffer’s main idea… More another time..","date":"2015-09-30","mins":"3:39 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211001","author":"o_k","post":"Of course. It would be very inconvenient for his position..","date":"2015-09-23","mins":"12:08 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211584","author":"o_k","post":"For the Mandylion and it just being a face isn’t there an explanation for that? Wasn’t the Turin Shroud folded so just the face was visible? There does seem to be obvious folds on the turin shroud, and it can be folded in such a way to look like the Mandylion. Yes, that’s Wilson idea. Fairly resistant to criticism (which usually try to conceal this idea, which makes any assertions that Mandylion was merely a face cloth irrelevant). But the matter is far more complex, since you have several candidates for Mandylion (and the usually assumed idea, that Mandylion was just a single object, is just an assumption..). And you have to justify why the Shroud was folded in this way. And the matter of folds is also much more complex (here you have the article http://www.shroud.com/pdfs/ssi11part4.pdf ) as they alone do not prove anything yet..","date":"2015-09-30","mins":"4:20 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211593","author":"o_k","post":"For anyone who might be inclined to pursue Markwardt’s challenge to “point out even a single historical error or flaw in reasoning” his paper can be found at: http://www.shroud.com/pdfs/stlmarkwardtpaper.pdf One thing, Daveb. Markwardt certainly had read my posting “Wilson & Shroudies vs. Academia” on this blog https://shroudstory.com/2014/01/18/wilson shroudies vs academia another guest posting by o k/ where I gave several arguments for the Mandylion brought to Constantinople in 944 AD being the same cloth as the Shroud of Turin (see his footnote 58). Markwardt ignored all of those (like many others), instead quoting from it only Charles Freeman’s tendentious comment. So much for Markwardt’s honest and unbiased approach..","date":"2015-09-30","mins":"5:54 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211635","author":"o_k","post":"I note that as at the present time, none of the comments above point out “a single historical error nor any flaw in reasoning” in Markwardt’s St Louis paper, but merely consider it a little too speculative. And this is a flaw in Markwardt’s paper (not only this). It is too speculative. While some speculations about Shroud history before 1350s are necessary, due to the lack of sources (so we must fill gaps with hypotheses), basing everything on merely speculations is a fairy tale, or novel writing. How many hard facts are there in Markwardt’s paper? How many hard facts relevant to the Shroud (or any of its previous incarnations)? And how much of the story comes merely from Markwardt’s imagination? I don’t claim that Markwardt’s scenario is impossible. Simply there is no hard enough evidence for this. And I think he selects facts which suit him, while ignoring others pointing elsewhere, most likely to the classic Mandylion theory (as I have shown here https://shroudstory.com/2014/01/18/wilson shroudies vs academia another guest posting by o k/ ). I am under impression that Markwardt rejected classical Mandylion theory merely for the purpose of pleasing academic community, who looks on the Shroud (and its links with Mandylion) with disguise. But for the purpose in vain, I think. No matter what, the concrete will never look favorably to the Shroud..","date":"2015-10-01","mins":"5:49 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-210998","author":"o_k","post":"We are the answer. The Universe inhabited by the imperfect entities, with tendency towards evil, cannot be perfect. The evil must be channelled somewhere in this world, whether in bad deeds or natural disasters and diseases. This world is just temporary a kind of a test, an exam of whether people can be perfectly good or not. The outcome is either perfectly good world (heaven) or perfectly corrupted (hell). That’s the Christianity..","date":"2015-09-23","mins":"11:10 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-210993","author":"o_k","post":"It is only an apparent problem, for which there are many suggested answers different by different religions. And only atheists seem to be omniscient on the matter of what is the “good” and “evil” in absolute manner..","date":"2015-09-23","mins":"10:20 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-180132","author":"o_k","post":"The information I have is reliable and came from very serious sources. There is paint in at least one place. The fact that there is a bit of paint in one place (you can see it on the illustration above, left and little bit up the eye) is quite irrelevant here, as it is obvious that this is not a painting in any classical sense. Look at the photo I posted (a scan from Aszyk Treppa monography). Remember that the average diameter of Manoppello threads is 120 micrometers, that is 0.12 mm. And here you have some sharp details (for example the contours of iris and pupil) marked on the boundary of 1 2 threads!!! I hardly can imagine that making such thing even by the most skilled artist is possible..","date":"2014-12-30","mins":"7:13 pm","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","title":"Set Your DVR"},{"id":"comment-180075","author":"o_k","post":"The Manoppello veil is a mixed bag, it also contains paint, so someone may have touched it up to make the colour more vivid in some places. We can sure about something so far: the cloth is not byssus. Louis: where is paint here? As to whether the cloth is, or is not a byssus (that means sea silk) we cannot be certain yet..","date":"2014-12-30","mins":"12:40 pm","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","title":"Set Your DVR"},{"id":"comment-179809","author":"o_k","post":"Hi Joe! Nice documentary. Anyway, about the links between Manoppello and the Shroud, see my two papers: https://shroudofturin.files.wordpress.com/2014/06/manopello shroud comparison3d.pdf https://shroudofturin.files.wordpress.com/2014/06/addendum manopello shroud comparison3d.pdf I have much more in preparation, and I hope I will assemble the whole material at some time because there is a lot to discuss about. What do you think?.","date":"2014-12-29","mins":"9:55 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","title":"Set Your DVR"},{"id":"comment-60403","author":"o_k","post":"The 7 Q5 at 0:41.","date":"2013-12-16","mins":"2:08 pm","url":"https://shroudstory.com/2013/12/16/the-mysteries-of-the-holy-sepulcher-documentary/","cat":"video","title":"The Mysteries of the Holy Sepulcher Documentary"},{"id":"comment-149238","author":"o_k","post":"Charles Freeman is cynically lying (like always). The relic cult has been developed long before 4th century. In fact, it has been since the very begining of Christianity. The Martyrdom of Polycarp (2nd century): http://en.wikisource.org/wiki/Ante Nicene Christian Library/Volume I/The Martyrdom of Polycarp Chap. Xviii.—The body of Polycarp is burned. The centurion then, seeing the strife excited by the Jews, placed the body[49] in the midst of the fire, and consumed it. Accordingly, we afterwards took up his bones, as being more precious than the most exquisite jewels, and more purified than gold, and deposited them in a fitting place, whither, being gathered together, as opportunity is allowed us, with joy and rejoicing, the Lord shall grant us to celebrate the anniversary of his martyrdom, both in memory of those who have already finished their course, and for the exercising and preparation of those yet to walk in their steps. Acts 19:11 12 (NIV) God did extraordinary miracles through Paul, so that even handkerchiefs and aprons that had touched him were taken to the sick, and their illnesses were cured and the evil spirits left them I mentioned this to Charles before. Nevertheless, he still repeats his lies..","date":"2014-09-07","mins":"8:35 am","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","title":"The Top Ten Relics of Christ?"},{"id":"comment-183089","author":"o_k","post":"Maillard reaction supported by Schwortz. See also Barrie’s “behind the scenes” report: http://www.shroud.com/pdfs/behind.pdf In the end, they artificilally equalized the worthiness of all 3 theories (Frale’s “death certificate” theory was featured only in the first part of the show)..","date":"2015-01-13","mins":"4:36 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"}]
