[{"id":"comment-191120","author":"o_k","post":"Hugh: http://www.shroud.com/pdfs/bennettpantxteng.pdf and http://www.shroud.com/pdfs/bennettpanppteng.pdf.","date":"2015-02-15","mins":"10:32 am","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-191128","author":"o_k","post":"As far as I know (from Bennett, Hesemann and others) the work on the pollen was concluded by prof. Carmen Gomez Ferraras from University of Madrid. Marion and Lucotte give reference: Carmen Gomez Ferrara, El sudario de Oviedo y la palinologia , Congresso internacional sobre el sudario de Oviedo, 1994, pg. 83 90..","date":"2015-02-15","mins":"1:43 pm","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-191138","author":"o_k","post":"Good advice Charles, if you have nothing meaningful to say, keep silent. And read the books and articles about the topic. Http://books.google.ca/books?id=f U1 J4 So7 OL8 C&printsec=frontcover&hl=pl#v=onepage&q&f=false You have some of the relics listed in Chapter 2 ‘The Permanence of the relics in Oviedo’..","date":"2015-02-15","mins":"4:23 pm","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-195584","author":"o_k","post":"Has someone a contact to Senor Ortega? Perhaps he may agree for his paper being published on Barrie’s site..","date":"2015-04-07","mins":"6:12 am","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"},{"id":"comment-175079","author":"o_k","post":"Truly, I would like to know myself, as all the informations on carbon datings of the Sudarium are scarce and reported by non specialists, like Bennett and historians Guscin and Hesemann..","date":"2014-12-07","mins":"6:13 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","title":"Paper Chase:  New observations on the Sudarium of Oviedo"},{"id":"comment-175104","author":"o_k","post":"Just I would like to remind on the Barrie’s site, on the Valencia conference page (http://www.shroud.com/valencia.htm ), there is listed a paper called Dating the Cloths by the C14 Method – The Oviedo Sudarium by Felipe Montero Ortego. Unfortunately, it seems to published nowhere on the Internet. I planned to contact Ortego about this paper, and ask him whether he could allow Barrie to publish it yet lacking time, and not hurrying with it, I haven’t done it yet. But of course someone may try to do it before me..","date":"2014-12-07","mins":"11:30 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","title":"Paper Chase:  New observations on the Sudarium of Oviedo"},{"id":"comment-174883","author":"o_k","post":"From Mark Guscin’s report from The Second International Conference on the Sudarium of Oviedo Oviedo, Spain, 13 15 April 2007, in BSTS Newsletter No. 65 http://www.shroud.com/pdfs/n65part6.pdf Just weeks before the congress took place, new samples from the Sudarium were subject to carbon dating. Five samples were dated from five different cloths –three of them came up with the expected date, while the cloth from an Egyptian mummy returned a date of any time in the 19th or 20th centuries. The laboratory immediately concluded that the cloth (and the mummy) were fakes. The sample from the Sudarium was dated to around 700 AD. Scientist César Barta spoke about the carbon dating process, emphasising the fact that if carbon dating is always absolutely accurate, then we could just as well finish the congress there and then. However, there were several points to bear in mind – in specialist carbon dating magazines, about half the samples dated come up with the expected date, around 30% with an “acceptable” date, and the other 20% is not what one would expect from archaeology. The laboratory used (via the National Museum in Madrid) said they were surprised by the result and asked if the cloth was contaminated with any oil based product, as oil is not cleaned by the laboratory processes used before carbon dating and if oil is present on a sample, the date produced by carbon dating is in fact the date of contamination. I would like to know more details about the dating of Sudarium. Nevertheless given the correspondences between the Sudarium and the Shroud, and that it seems that they covered the face of the same man, there is a contradiction</B< between 1260 1390 AD dating for the Shroud, and circa 8th century for the Sudarium. Probably neither of these datings is correct..","date":"2014-12-06","mins":"4:26 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","title":"Paper Chase:  New observations on the Sudarium of Oviedo"},{"id":"comment-175074","author":"o_k","post":"See https://shroudstory.com/?s=Sudarium+dating Sudarium is claimed to be heavy polluted by soot, wax, oil, smoke from the candles, even explosives (it was bombed by anarchists in 1934) and lipstick. It has a hole in the center made by the wax falling out of the candle. So in theory at least it is likely that the results are skewed. But of course I would like to know more details. And as it seems that Shroud and Sudarium covered the same face, the results 660 890 AD for Sudarium, and 1260 1390 AD for the Shroud are incompatible, and thus unreliable..","date":"2014-12-07","mins":"5:28 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","title":"Paper Chase:  New observations on the Sudarium of Oviedo"},{"id":"comment-103155","author":"o_k","post":"Thanks Antero,this is similar to what Hesemann describes, but I need more details. Where was the sample taken, what was the actual results, what was the laboratory report etc. The main problem is that to skew the C14 result from circa 30 Ad to circa 750 AD, one needs about 36 40 % of modern carbon. And that is quite much, I think. Only hydrocarbon substances, like oil (of course organic, not mineral) or wax may give enough carbon, and the problem is how large percent of contaminated sample they may be..","date":"2014-04-24","mins":"7:04 am","url":"https://shroudstory.com/2014/04/24/the-carbon-dating-of-the-sudarium-of-oviedo-plus-the-caves-of-the-sudarium/","cat":"carbon_14_dating","title":"The Carbon Dating of the Sudarium of Oviedo Plus the Caves of the Sudarium"},{"id":"comment-103321","author":"o_k","post":"We don’t know. All info about the 2007 dating available to me is posted above. Anyway this result is similar to what was obtained in the 80s. They have been briefly described in Janice Benett’s book: http://books.google.ca/books?id=f U1 J4 So7 OL8 C&printsec=frontcover&hl=pl#v=onepage&q&f=false.","date":"2014-04-24","mins":"4:33 pm","url":"https://shroudstory.com/2014/04/24/the-carbon-dating-of-the-sudarium-of-oviedo-plus-the-caves-of-the-sudarium/","cat":"carbon_14_dating","title":"The Carbon Dating of the Sudarium of Oviedo Plus the Caves of the Sudarium"},{"id":"comment-190852","author":"o_k","post":"Hugh: I missed the collection of measurements by professor Jose Antonio Sanchez quoted by Michael Hesemann earlier, but it epitomises my point of view. As quoted the comment is bordering on absurd. The ‘typical’ measurements of a Spanish man? Are all Spanish men ‘typical’, or are any Spanish men who are not typical also not Spanish? What are the measurements of a ‘typical’ Jewish man, or a ‘typical’ inuit for that matter. Typical, that means that anthropometric parameters measured on Sudarion of Oviedo are much closer to semitic than Spaniard average. It is not absolute evidence by any means simply another clue, which cannot be simply disregarded. How, after all, can you tell? If the ‘points of congruence’ argument is used to establish that the two cloths are related, you have to start with the premise that there is no relationship, and show that that premise is wrong. If you start by assuming the two cloths are related, then of course you are likely to find the points of congruence more telling than the points of non congruence. The fact that the bloodstains on Sudarium are not just random has been convincingly shown by forensic analysis by Spanish specialists. They described in detail their origin and way in which they were made. They were able to associate those stains with appropraite face features like nose, mouth and forehead. Thus those are not just random stains of spilled blood like in the Rorschasch test, but have their own forensic explanation. Starting with this, the method of counting congruence points with the Shroud absolutely makes sense. First you must check whether there are any characteristics that exclude common origin with the Shroud (there are none). Then you set up your null hypothesis: the both cloths have nothing in common and similar bloodstains on both are result of purely accidental coincidence Then you start looking for PO Cs. The more (non trivial) you find, the more unlikely is your null hypothesis (that the cloths are unrelated). If you can find enough PO Cs you can reject your null hypothesis and accept that the both cloths are related, that means they covered the same face. However, as I said, it is not easy to discuss this without a clearer indication of what, exactly, the 120 or so points of congruence actually are. Is there a diagram of them? Who counted them up? The 120 PO Cs (70 for the fron, 50 for the back) references goes to Whanger and his polarized images overlay technique. Unfortunately I have found no independent confirmation of that. Had I possesed enought resolution Sudarium images, I would try to verify this myself (but unfortunately I don’t have them). Anyway if just a dozen (10 % of Whanger claims) gets confirmed, than this would be enough to confirm direct relation between Sudarium and the Shroud. And although I don’t believe that all PO Cs claimed by Whanger are in fact valid, neither I believe that more than 90 % of them are just the result of his imagination..","date":"2015-02-12","mins":"3:10 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190854","author":"o_k","post":"Kelly: Reported with conviction & certainty but scientifically nowhere close to a slam dunk. The ball is still being passed around at mid or full court, take your pick. Agreeable blood type, agreeable blood patterns, to scientifically conclude this involves the same person, is at best, circumstantial. Comparison of a DNA consensus profile for each, if obtainable, would be the best chance towards supporting such a conclusion. Comparison of DNA cannot prove that the cloths belonged to the same person!!! There is still a chance that they belonged to twin brothers! This was of course a joke. But seriously, what evidence do you need to “scientifically” conclude that hose two cloths belonged to the same person? What we have here are two cloths with bloodstains on their surface. * Both belonged to crucified men, with beard and mustache. * Both crucified had something resembling Crown of Thorns on their heads. * Both crucified had the same blood type, AB, belonging to the 5 % of of the population, according to the indications of blood type tests. *Both men had their heads banked to the right after their death (there is 50 % chance for such coincidence). * Both men had identical, or at least very similar face features, as indicated by blood patterns on Sudarium. That’s only a few from the list of mutual coincidences. No, Kelly. We don’t need DNA to prove that those two cloths belonged to the same person..","date":"2015-02-12","mins":"3:31 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190862","author":"o_k","post":"Kelly. If you are researcher, you must be very careful and doublecheck yoyr results to be cerain about your conclusions and avoid making erroneous and pretentious claims. But on the hand, if you are too cautions, have too much unnecessary doubts and useles considerations “what if” or simply too shy to proclaim something, you will discover nothing. So Kelly (and Hugh), what is the alternative scenario? If two cloths are unrelated to each other?.","date":"2015-02-12","mins":"4:13 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190791","author":"o_k","post":"Dan: Can anyone really say the stains show typical Jewish features? I’m open to being convinced. Michael Hesemann in his popular book “Das Bluttuch Christi” describes anthropometric reasearch of professor Jose Antonio Sanchez. According to him, the face parameters of “Sudario Man” are as follows: Face height: 139 mm Total nose length: 80 mm The length of the bridge of the nose: 60 mm The nose width :25 30 mm The height of the tip of the nose: 21 mm According to him the typical values of Spain are: Face height: 126.55 130 mm The length of the bridge of the nose: 51.18 54 mm The nose width :32 35 mm The height of the tip of the nose: 15 18 mm So according to him, it is unlikely that “Sudario Man” was of Spanish origin more likely Middle Eastern, semitic origin..","date":"2015-02-12","mins":"5:31 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190867","author":"o_k","post":"Kelly. You haven’t answered my question: what is the alternative scenario to the two cloths covering the face of the same man?.","date":"2015-02-12","mins":"5:07 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190793","author":"o_k","post":"And also: Matching coins and matching bloodstains is something different altogether. Moreover, I am convinced by other evidence that those coin images that supposedly match coins, do not exist on the shroud. That makes those points of congruence seem meaningless. So why are the bloodstains POC any different? Because, contrary to the ghostly coin images, which may be real or just illusion of random noise patterns, the bloodstain certainly exist on both cloths. So they can be compared on each other to see if they match (and according to guys who made such comparison, they match)..","date":"2015-02-12","mins":"5:36 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190872","author":"o_k","post":"Kelly: The alternative scenario is the cloths covered two different people or one (or both) was created to appear as though they covered a body/face. So the alternatives scenarios are: 1.) one or both cloths was created to imitate the other in ancient/medieval times when obviously there was neither knowledge nor abilities to create such close imitation, withstanding modern scrutiny. 2.) The two clothes covered two distinct bodies with following features: * Both belonged to crucified men, with beard and mustache. * Both crucified had something resembling Crown of Thorns on their heads. * Both crucified had the same blood type, AB, belonging to the 5 % of of the population, according to the indications of blood type tests. *Both men had their heads banked to the right after their death (there is 50 % chance for such coincidence). * Both men had identical, or at least very similar face features, as indicated by blood patterns on Sudarium. Two distinct men, two distinct corpses, by pure accident having so many common traits! An unbelievable coincidence! Reminder: both clothes are burial cloths. Both were preserved for some reason. And both have been claimed to belong to the very same person: Jesus of Nazareth. So there are even more coincidences (and I even haven’t started counting points of congruences between bloodstains and images on both cloths). Do you really think that Sudarium of Oviedo was just an ordinary bloodied napkin, found somewhere in the dump, and it eventually turned up having so many correspondences with the Shroud of Turin just by pure accident? The most definitive call would be comparative DNA analysis, if doable, the rest is circumstantial and don’t confuse circumstantial with meaningless or trivial that is not what I am implying. Kelly. DNA analysis is, in principle, circumstantial evidence as well. It bases on premise that chances for false positive match of DNA code is so small (1 in 14 bilion or so), that it can be ignored in most cases, and treated as direct evidence. But I would like to ask what is in fact stronger evidence, a DNA match solely on its own or such incredible chain of coincidences described above?.","date":"2015-02-12","mins":"6:03 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191472","author":"o_k","post":"Kelly. To the point. Did those two cloths belonged to the same person or not? Can we determine this already given all our knowledge (without involving DNA analysis, given all problems with decayed DNA and possibility of contamination)? Yes or No. What are the odds for the opposite conclusion (that these two belonged to different persons)? Can you give any rationale for that? As far as I know DNA identification is made through finding a dozen or so identical independent DNA markers. Essentially looking for points of congruence (so in fact this is merely circumstantial technique, basing on the concept of improbability of exact match). So the principle is virtually the same as face matching; we are looking for corresponding details. Can we then say that there is an advantage of DNA match over other methods of identification? Or maybe in different words: that only DNA match is valid, and other techniques cannot give ‘definite’ answer?.","date":"2015-02-21","mins":"6:19 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191441","author":"o_k","post":"When asked in a hypothetical situation, which is more telling, the fact that two people both have a beard & a mustache and/or even share the same blood type versus a comparative DNA analysis between the two, to me, there is no contest. In the previous context, considering that all four Beatles at one time had beards & mustaches, the strongest piece of scientific evidence on the “amazing list of circumstances” was the same blood type. Even with shared blood type, albeit one that is the least represented in the population (~5% currently), this can only take you so far, you are still unable to reach a solid, scientific conclusion that the same individual is involved. Kelly, I think this is misrepresentation of the problem. All four Beatles had beards & mustaches at one time point, and so had both Shroud Man and Sudario Man, whether identical or not. But the problem is much more complex. 1. Both cloths (Shroud and Sudarium) beloged to crucified men. Fine, but there where many crucified individuals in history, and the fact that we have two cloths (and only those two cloths!) belonging to the victim(s) of crucifixion does not prove that there was one and the same person involved … yet. But… 2. Both cloths covered the face of the individual(s) that was apparently crucified with Crown of Thorns. There is only one recorded instance of the crucifixion combined with Crown of Thorns torture: Jesus of Nazareth. But of course this still does not prove antything… yet! Maybe there were several other crucifixions with the use of crown of thorns that went unrecorded? Maybe… but they couldn’t have been frequent. So how many? 1/100 crucifixions applied crown of thorns, or similar torture instrument? 1 in 1000? Yet we have, (by pure accident, sceptics would claim) two cloths that covered the face of crucified and crowned with thorns. 3. Test on both cloths indicate blood type AB. Only 5 % of world population has such group (18 % Sephardi Jews). Fine, this reduces the chance for coincidence 20 times (or only 5 if we assume that the cloths belonged to crucified Jew(s)). But of course this still does not prove anything… Maybe the tests were false positives due to contamination (amazing accident) or maybe we just found in the dump two cloths belonging to individuals with AB group. There are still such possibilities. 4. Both cloths belonged to individuals that had their heads bowed to ther right after death. Fine, this still does not prove anything, but there is 50 % chance for such coincidence… 5. Both crucified individuals had their right cheek swollen to much greater extent than left. Another interesting coincidence. Or maybe it is something we should have expected, because Jews considerd the right side as pure, and left as unclean? So that would be explanation, but of course the price is that we should assume that both Shroud and Sudario Men were beaten by Jews. 6. The facial features on both cloths (nose and face lenght, width etc.) are fully comparable. So both individuals had very similar features. Of course this does not prove anything there are many different people with similar facial features but that’s another similarity… And so on, if we make more studies of those both cloths we perhaps find more coincidences. But according to you, Kelly, this still isn’t evidence…. So according to you, Kelly, perhaps we may have heree two cloths belonging to two different individuals, but who were both severly beaten in their right cheeks, both were crucified and tortured with Crown of Thorns (we haven’t checked the correspondence of wounds yet), both had the same blood type, both had fully comparable face features, both had their heads banked to the right after death and so on… Do you really believe that this wheel within a wheel may be just accidental? Or do you need DNA tests to make ANY conclusions? One another thing about DNA, what if we extract them and the results turn different? Do you reject the identity of both Shroud and Sudario Men then, because the DNA comparison is the only real (and not circumstantial ) evidence for you (just like C 14 for the sceptics, at least till they turn in their favor)?.","date":"2015-02-20","mins":"3:08 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190814","author":"o_k","post":"Hugh: As for the ‘points of congruence’ game, it is invariably forgotten that ‘points of non congruence’ must also be taken into account. Take any two random scribbles and overlay them and there will be dozens of ‘points of congruence’. It is only by demonstrating that there are no ‘points of non congruence’ (or at least be explaining why they can be ignored) that any identification can be made. But the point is that bloodstains on the Sudarium surely are not random. Thus the POC approach is fully valid. Because if you can find enough number of PO Cs you have a very good chance (approching certainty) that there is some direct correspondence between the two objects. And any ‘points of non congruence” are then just nothing but the ‘random noise’ blurring the picture a little bit but not invalidating the amin conclusions..","date":"2015-02-12","mins":"7:56 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190812","author":"o_k","post":"As usual with Sudarium articles, it is remarkably difficult to check any of the alleged forensic findings. Whatever one may think of the conclusions of Heller, Adler, Schwalbe, Rogers or others of the S Tu RP team regarding the Shroud, as least we know what they did to arrive at those conclusions. With the Sudarium, from the composition of the stains (pleural fluid? really?) to their origin (marks of fingers? really?) to the pollen (quercus calliprinos? really) to the radiocarbon datings, very little of the primary investigation is available. I agree that primary sources in case of Sudarium are hardly available, yet we have a lot of reliable secondary sources providing essential information. Check Comparative Study Of The Sudarium Of Oviedo And The Shroud Of Turin from III Congresso Internazionale Di Studi Sulla Sindone, Turin, 5th To 7th June 1998: http://www.shroud.com/heraseng.pdf Also there is a book by Janice Bennett, Sacred Blood, Sacred Image, although little confused at times: http://books.google.ca/books?id=f U1 J4 So7 OL8 C&printsec=frontcover&hl=pl#v=onepage&q&f=false I also have similar book by Hesemann. There are also some papers about Sudarium as well. Finally there a few documentaries about Sudarium: There is also excellent Spanish documentary on the topic, including interviews with primary reasearchers: I have a polish version of this documentary, and it s really a treasure! http://gloria.tv/?media=137213.","date":"2015-02-12","mins":"7:44 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"}]
