[{"id":"comment-213770","author":"o_k","post":"Evidence, or the so called ‘evidence’? I see that the term ‘evidence’ has went through large inflation recently, and any observation can be called ‘evidence’ for some claim, even if already discounted with several other, more significant observations. Just a thought..","date":"2015-10-28","mins":"3:13 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213763","author":"o_k","post":"C) I do not know where Maria Grazia Siliato (http://www.cirac.org/shroud/Discussion/MGS CESS 36 42.htm) obtained her dimensions of 7cm x 1cm from. Does anyone? From Nature..","date":"2015-10-28","mins":"2:10 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-48428","author":"o_k","post":"Hugh: To the best of my knowledge no threads from areas away from the C14 corner have been analysed. So your knowledge is poor. Several threads outside C14 corner were extracted for specific resaerches, see for example Appendix D in Wilson’s 1978 Shroud. Also several threads were taken for Pier Luigi Baima Bollone for blood examinations. What is often forgotten, not only the STURP has examined the Shroud. Charles: Has anyone found ENOUGH cotton on the Shroud anywhere to make the cotton in itself a skewer of radiocarbon dates of the linen? You have already showed your ignorance. The patch consists mainly of flax. The presence of cotton is nothing but an indicator that the C14/Raes area has been manipulated. About Gossypium herbaceum pointing to Middle East origin, this is erronous and outdated interpretation. You are playing with straw man now, like a typical sceptic. Yes the cotton was found outside C14 area but also, wool, silk and nylon (invented in 20th century) was found on the tapes, but only in the form of dust that had fallen onto the surface of the cloth. As to the cotton, see http://www.shroud.com/pdfs/thibaultr7part1.pdf Quote: The third important point is that this “old cotton”, even if it is found in the outer part of the thread, is clearly not a contamination. It is part of the thread. All cotton fibers are similar andfrom the same species and are very different from modern cotton (only 2 modern cotton fibers was found in this part). In 1973 Raes took two samples, one from the famous Raes corner, and another from the side strip. The sample from side strip did not contain cotton..","date":"2013-10-22","mins":"1:30 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48429","author":"o_k","post":"See also: http://www.ohioshroudconference.com/papers/p09.pdf “Also in the ventral missing corner section, which we hypothesize to consist of restorative surface dyes and what was likely an undocumented “invisible” medieval repair, is the section from which the 1973 Raes sample was extracted for analysis. In this sample, Raes found that the side seam had been attached to the adjacent main Shroud by a 2 ply linen sewing thread (18).By removing the sewing thread, Raes was able to separate his sample into two distinct pieces, which he identified as “Piece 1” and “Piece 2.” Each piece exhibits different characteristics, such as cotton content, lignin content at the growth nodes, and thread size, suggesting two different origins of the yarns.”.","date":"2013-10-22","mins":"1:36 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48431","author":"o_k","post":"Hugh Farey : Hugh: “Well that’s wonderful. Please don’t keep us in suspense. Where can I read these analyses?” Pier Luigi Baima Bollone – Sindone, 101 domande e risposte for example, but they say nothing about cotton content, perhaps because they used the threads for different purposes, and were not interested about cotton..","date":"2013-10-22","mins":"2:10 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48433","author":"o_k","post":"Http://www.shroud.com/pdfs/thibaultr7part3.pdf First, it must be recalled that Gilbert Raes found no cotton in Piece (or Part) 2 of his sample contrary to Piece 1. Piece 2 was the smallest part of his sample and was in the so called “side strip” of the Shroud. Different studies have shown that the side strip pertains to (or at least is continuous with) the original Shroud..","date":"2013-10-22","mins":"2:18 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"}]
