[{"id":"comment-7058","author":"bill","post":"Not only a genius in what you described but a genius in covering his or her trail. The lack of evidence in creating / transporting such a forgery as you have described should be addressed by Shroud skeptics if skeptics are going to attack and exploit much smaller holes in evidence provided by Shroud supporters. Again, I appreciate your work. I too would like to see if the image can be replicated by natural means..","date":"2016-04-03","mins":"10:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?"},{"id":"comment-7056","author":"bill","post":"I recognize that it is basically a rhetorical question, but in as much as skeptics attempt to exploit any possible hole in Shroud theories and Shroud supporters, as you yourself have done, it seems only fair to address my question as well. In as much, you can choose to blow it off, that is your right..","date":"2016-04-03","mins":"9:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?"},{"id":"comment-7055","author":"bill","post":"I am discussing one issue – where are the trials, errors, writings, communications, statues, hypotheses similar to what you are doing here – from the Medieval artist that created the Shroud of Turin?.","date":"2016-04-03","mins":"9:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?"},{"id":"comment-7053","author":"bill","post":"Mr. Berry: I appreciate your perspective on the Shroud, and am glad that there are those who are willing to look at the Shroud through all lenses. In another perspective, all of your evidence serves as circumstantial evidence to disprove the Medieval artist theory. If a Medieval artist was responsible, where are the numerous trials, errors, communications like those that you and many others have done? Instead there is absolutely nothing, no statues, no writings, no documented trials, hypotheses, nothing. Was the Medieval artist so brilliant as to: 1. Devise a way to cover up every last one of his tracks (trials, etc.) save one ‘admission’ 2. Complete a perfect anatomy artwork that is unique to its time 3. Create an artwork that uniquely shows up as 3d in VP 8, which he knew nothing about 4. Remember to put Palestinian pollens in it 5. Fool and confound modern scientists for 35 years 6. Fool multiple forensic pathologists into believing it is a real body 7. Create an artwork that shows up better in negative photography than natural light 8. Put it on an authentic linen from the Middle East 9. Do this all by himself, from France. 10. Put the blood / paint on before making the image 11. And again, do all of the above without leaving a single shred of evidence If someone 700 years from now looks back at this time, they will find an incredible amount of evidence of skeptics attempting to replicate the Shroud of Turin. Where is the evidence from the person attempting to make the original?.","date":"2016-04-03","mins":"7:58 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?"}]
