[{"id":"comment-198135","author":"dave_hines","post":"Hi Hugh, thanks for responding. Up late? Wrapped up in the Shroud? Slightly off subject, Thomas Gainsborough was a good portrait artist wasn’t he? I did not have a thin enough brush so I had trouble with the hair. Colors are not as subtle. Anyways, If it was not for the fact the image resides on the outermost fiber of the fabric, or residing in the micro thin layer of starch fractions (As Ray Rogers believes) and The image did not show up in a VP 8 analyzer the way it does I would say the image was a imprint of myrrh resin and blood that once covered a body. High grade myrrh is transparent which would not show up if backlit. The color is right. Dr. Baima Ballone did say he found myrrh and aloes in the blood by anti body antigen testing. For someone hard pressed to think The Shroud was a contact image, that is the direction my research would be going. To start by covering a human cadaver in myrrh and aloes and wrapping in a shroud for 3 days and then remove it and see what you have. If one really knew scripture and wanted the most realistic looking Jesus imprint possible, that would be the way to go. I did it with a sculpture of Jesus once, the results were astounding. Myrrh resin hardens and will take on the exact shape of the 3 D figure. It looked like a linen statue of Jesus afterwards. You could even stand it up. But such a process would not match the chemistry and physics of the Shroud image. What is really needed is for Pope Francis to allow scientists just to scrape off just a bit of the image and analyze it. Perhaps down by the feet. Just a tiny bit. No big deal..","date":"2015-05-02","mins":"6:39 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198163","author":"dave_hines","post":"Correction, I meant to say metaphorically speaking..","date":"2015-05-02","mins":"4:12 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198164","author":"dave_hines","post":"Good Afternoon, hope all is well in the UK. Hypothetically speaking let’s say the Shroud was done using paint. The artist would need a good understanding of how to paint a mirror image, lefts and rights reversed. As a result of a contact image, lefts and rights are reversed, which is one of the reasons I believe a role model would be necessary to do the work. It is hard to image how the rights and lefts of an image are reversed without seeing it in a mirror to be certain it is correct and to replicate the effect. At some point the artist would have needed to make an imprint of a genuine human form and see how it transferred to cloth so his own depiction would be accurate. Side wound on linen is done correctly. Shown on right side as would happen with a contact image. When Image is displayed in a mirror the side wound moves the left and from the perspective of the person, would be on their right. Which would be correct. If the artist did not understand that as a result of a contact image rights and lefts are reversed the side wound would have been illustrated on the left side, not right side. Viewing it from our perspective, not the person wrapped in Shroud. This would be a work meant to be displayed/viewed in a mirror to show the true image. I can’t image an artist doing such a thing. Why not just make a imprint and be done. It would save time and look better. No chance of a mistake. Again hypothetically The Shroud was painted but the 1. Artist did not use plain weave white linen as used in Jewish Burial?! 2. Did not illustrate wounds in the palms of the hand?! 3. Did not illustrate eyes?! (for the most part left the canvas unpainted in that area) 4. Did not illustrate ears?! 5. Did not illustrate thumbs?! 6. Did illustrate a nude, bare butt Jesus with scourge wounds?! (the only work that does so) 7. Illustrated extremely excessive scourge wounds?! Based on what historical record? An early centuries or mid century artist depicting Jesus like this would probably end up in a burial Shroud himself or at the very least not have many friends in the city/town he lived in..","date":"2015-05-02","mins":"4:54 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198162","author":"dave_hines","post":"Hello of Daveb of Wellington: The only reason posted on this subject is because this is how I got involved with The Shroud in the 1st place in 2009. I was planning to do a photo realism resurrection painting & was looking for a role model to use as Jesus. Of course The Shroud came up. I would be the 1st to agree my imitation of the Thomas Gainsborough “Lady in Blue” does not match his great talent. It is flat out incredibly difficult to paint a photo realism looking portrait. My original on canvas does look better than this high contrast copy, but lacks the “super pro look” Thomas G gets. Quite a few steps down the scale from his work. Hypothetically speaking, you have 4 suspects brought in for questioning by forensic detectives to find out who is guilty of the crime/act of producing Shroud Image We have 1. Mr Paint 2. Mr. Imprint 3. Mr. Ammonia 4. Mr Light Most people would agree Shroud image is 1. Cunning 2. Baffling 3. Powerful Which of the 4 suspects is the most cunning, baffling and powerful? If I was Mr. Light I would go for a plea bargain and/or claim temporary insanity as defense. “I did not know what I was doing when I produced the image, it all happened so fast”.","date":"2015-05-02","mins":"4:00 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198117","author":"dave_hines","post":"I am artist, painter. I used to do replicas of famous paintings. I included a Caravaggio, A Thomas Gainsborough and a Van Gogh that I did. I once attempted the Shroud. It did not work out at all, I simply could not do it. I painted the Mona Lisa and other famous paintings but The Shroud ended up looking like a disaster. I threw it away it looked so bad. Photo realism is incredibly difficult to do. The Shroud of Turin would fall into the category of photo realism with some holographic observations made by people that have been up close and personal to it. One such person made comment, “the body appeared to come up right out of the cloth” looking at from a specific angle and disappear completely from other angles. Those were comments made by someone who spent an entire day examining the Shroud I have never seen a painting or known anyone that could produce this effect with paint or with photography. It is true, with perhaps some rare exception, lines are drawn when doing a painting, (I always do) and then smoothed out later so they cannot be seen. That also involves making fairly aggressive contact with the canvas with a brush or wet towel to hide the lines. This is a 14′ piece of cloth of a very unusual weave, that I cannot in my wildest imagination ever picture any person using to make a Jesus replica/photo realism work. Look at the dorsal image, It looks like a X Ray photo graph/ morgue photo. Would anyone out there like to hang this on their wall? The dorsal image? “Look at my painting” Possible, but highly unlikely. If one truly believes this is a painting. I would suggest going to the company in Belgium that has Shroud fabric for sale. 3 or 1 herringbone twill fabric, pure linen and purchase the finest point brushes made on Earth and a half a gallon of myrrh resin for pigment to get the straw yellow color. There is also a company that sells a 14 replica of The Shroud. Use that as a role model and begin the work by making micro tiny dots on the fabric, leaving some of the canvas colored and some uncolored. You cannot draw lines on a work like this. Dotted. It’s a mirror image, so you need some kind of role model to use to accurately capture rights and lefts reversed. The English language does not have words to describe how incredibly difficult it would be to replicate the “look and feel” of the Shroud image using paint. Photo realism is by far the hardest thing to capture on canvas. There are only a handful artists in the world that can really pull it off. Often they will use camera obscura to do the work and that does not guarantee it will look right. A lot of talent involved. If a mistake is made, one would have to purchase another piece of 14′ fabric and start over again. Long story short. If one went to the trouble of using a 14″ piece of cloth, why not just make a imprint with a real body? So much easier and it will be realistic looking. It would be a better theory to imply both were done. Imprint and some bizarre pigment The Shroud image reminds me of when we were kids, we would stick our faces into a copy machine and make copies. The Shroud has that “look” to it, a very genuine look. There is a reason for that. I am not posting this to start a debate. I just don’t have time. I suggest to the person that believes this is a painting, to actually attempt to do a “Shroud replica” just to get an idea of what this would involve. And I am saying that in a respectful sense. Try it..","date":"2015-05-02","mins":"12:26 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198181","author":"dave_hines","post":"Hello Daveb, I want to say upfront I do not believe The Shroud is a imprint of myrrh. I did some experiments with wrapping a myrrh covered3 D statue in linen. That is all. I wanted to see what would happen. Then I exposed the “linen myrrh statue” to bright flashes of light to see how the myrrh resin would react to the light. To see if bright light would change its color. Please excuse the poor quality of these photos taken 3 years ago. I filmed the entire experiment and took several still shots but I do not have access to them here. This is all I have on this computer. Myrrh resin is much like tree sap. When exposed to the open air it will begin to harden and get sticky, myrrh was applied to statue then wrapped in a pure linen cloth. Myrrh sticks to what it makes contact with and then hardens and makes a replica of the 3 D figure it is making contact with. Very detailed. I recently purchased some very pure myrrh resin from Egypt and am going to run some different experiments applying it to a herringbone twill pure linen cloth. I will photograph those results with a quality camera so you can see a decent quality photo. These are pretty poor. The linen will take on a 3 D form and then it flattens out over time. Myrrh is sepia, caramel color very close to what is seen on the Shroud. That does not mean that it is myrrh on The Shroud. I will not even get in that discussion. Just a few photos to see. Sorry about the poor quality of these photos..","date":"2015-05-02","mins":"11:38 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198183","author":"dave_hines","post":"Good Evening Daveb, I thought I would share with you some recent mathematical matches I found. .On a Gematria Calculator when you type in Jesus of Nazareth it comes up 1128 When you type in Shroud of Turin it comes up 1128 (English Gematria) Ok, so Jesus of Nazareth =1128 Shroud of Turin =1128 Then there is Behold the Image of Edessa = 1128 It’s not a painting = 1128 It’s The Mandylion = 1128 Shroud of Turin = 1128 A Picture of Jesus = 1128 3 D Hologram of Jesus = 1128 Jesus of Nazareth = 1128 Shroud is Genuine = 1128 3 D Hologram of the King = 1128 A Picture of the King = 1128 Israeli King Jesus = 1128 Risen Lord Jesus = 1128 On a side note. If the middle initial of Barrie Schwortz was a C instead of a M He would also be 1128. There are a few more, one was Sudarium in Spain = 1128 One could say these are all coincidental matches, then there is the type of person who would say they are not coincidences. Each person has to 1.Search their own heart and trust what their inner gut is telling them and/ or 2. Conduct a mathematical/English alphabet investigation into the matter 3. Spend time in prayer and ask a Higher Power for insight A combo of all three would be the best approach. ..","date":"2015-05-03","mins":"12:10 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198187","author":"dave_hines","post":"Hi Daveb, 1.Galileo Galilei ” Mathematics is the language that God wrote the universe in.” 2. PLATO “Numbers are the highest degree of knowledge, it is knowledge itself.” 3. Saint Augustine “Numbers are the thoughts of God” Here is the dark side in English Gematria Mark of Beast= 666 Witchcraft =666 Satans Seal =666 Demonic Evil = 666 Demon Inside = 666 Satans Hell = 666 The Eden Snake = 666 Corrupt =666 Slaughter =666 New York =666 http://www.gematrix.org/ Try out a few things and see what happens..","date":"2015-05-03","mins":"12:32 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198226","author":"dave_hines","post":"HI Hugh, I have never read a post of yours and then thought “Hugh is a moron” In fact I think quite the opposite. We certainly cannot and should not stereo type a person who believes the Shroud is authentic as being a           or one who does not is a. But unfortunately it does happen all time I know many people not convinced of the authenticity of the Shroud, intelligent people of good moral character. Good role models for their children. Your posts serve a positive purpose. If a civil debate can take place, great, I am all for that. Everyone benefits from that. To refer to a person as “anti authenticity” has a negative sound to it. Since you brought that up I am going to stop using that word. The Shroud is not a salvation issue. It is a witnessing tool only. If my belief/conviction the Shroud was authentic began and ended there, it would mean nothing. Meaningless. If one was to come to believe The Shroud was authentic and is physical evidence of the resurrection of Jesus it could lead to a person to consider the possibility that “if this is true then I should be able to make contact with this person who has risen from the dead” As crazy and as improbable as that may sound, Belief the Shroud is authentic could potentially lead to a person with some type of serious issue going on with their life, be that a health issue or financial in which all previous efforts to solve the problem have failed to consider a different course of action to solve the problem. An example would be a last resort desperate move to ask a “Higher Power Intelligence” to solve the “impossible challenge” Because “nothing else has worked” And Lo and Behold shortly after “asking the “Higher Power” for help, the “impossible challenge” is solved. This leaves one thinking, “I did ask for this thing to be done and now it is”, “Is the event of my asking the Higher Power for help and the problem being solved related or not related?’ Coincidence or not coincidence? Over the last 7 years I have seen enough physical evidence of the Spirit of God working in my life to be convinced beyond any reasonable doubt the Shroud is authentic. Many of which could not be presented as evidence in a court of law type setting. That is unfortunate. Belief that the Shroud is authentic can positively transform the life of another person I know that it has for me. It is what is done with that belief that makes the difference. Not just the belief. There is Faith without action, and Faith with action. The latter is the better. No one wants come to the end of their life with a “What If?” “What might have been” The Shroud is kind of saying “Give the Spirit of God a chance to work in your life” “All things really are possible with faith” The message behind The Shroud. In English Gemetria Jesus of Nazareth = 1128 Shroud of Turin = 1128 Behold the Image of Edessa = 1128 It’s not a painting =1128 Shroud is genuine = 1128 A picture of Jesus =1128 3 D Hologram of Jesus = 1128 Risen Lord Jesus 1128 Are these coincidences or not? A numerical message left behind by the Spirit of God or not?.","date":"2015-05-03","mins":"5:06 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198121","author":"dave_hines","post":"These are my paintings. A Caravaggio, A Thomas Gainsborough and Van Gogh. Note how different The Shroud looks compared to paintings. Http://goodshepard007.imgur.com.","date":"2015-05-02","mins":"1:06 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-198120","author":"dave_hines","post":"Http://goodshepard007.imgur.com.","date":"2015-05-02","mins":"1:00 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-144835","author":"dave_hines","post":"Hello Mr. David Goulet: I will put all 3 of those images into the negative image of the The Shroud. All 3, Mona Lisa, “Honest Abe” and John Lennon. It is fairly easy to do this on Sony Vegas Video Editing Software. It is important to note that the aspect ratio of both the Fresco and the Shroud were not altered in any way. I will do the same with the other photos neither taking anything away or adding anything to them. Fair and honest. Give me a link to which images you would like, I will place them inside exactly how the fresco was done. Exact same procedure. I will upload them and use the same time sequence to fade in the images. I am a artist and have done over 100 portraits, if I was asked to do a reproduction of The Shroud I would not change the dimensions, but do it the exact same size as original image. I would like to know the dimensions of the fresco in Rome. It should be a dead on match to The Shroud of Turin face. It is not likely an artist would change the dimensions, possible but not likely. Sometimes I will do a portrait X 2 if it needs to be bigger. But any deviation from the original, even a few millimeters will change the face and it will not come out right. The biggest challenge a artist would have with The Shroud, would be where to place the eyes exactly since the resurrection image has no eyes illustrated. That in itself is extremely out of place if this was the work of a man. A resurrection image with no eyes?!.","date":"2014-08-19","mins":"5:54 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-198124","author":"dave_hines","post":"My gut feeling tells me Joseph of Arimathea obtained the Shroud Fabric from a merchant outside the Damascus Gate selling his goods for the passover. (Likely from Syria) This was done right after he got permission from Pilate to get the body, and on his way back to Golgatha he got the closest approximation to what he could find that would substitute for a burial cloth. A unique one of kind cloth for a very unique one of a kind person..","date":"2015-05-02","mins":"1:35 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-144971","author":"dave_hines","post":"Hi OK. Really fascinating information. Illuminating. Great work on those papers. Extremely helpful information..","date":"2014-08-20","mins":"10:51 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-146132","author":"dave_hines","post":"I got it. I’ll reverse it. Thanks..","date":"2014-08-25","mins":"6:52 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-146356","author":"dave_hines","post":"Hi OK, I am looking at the Manopello image straight on, to do a correct line up the big upper blood spot on the nose should be on the left side? The one closest to the eye, From my viewpoint? Is that correct? The reason I am asking because it is on the right on the paper you wrote. Which by the way was extremely well done. I just want to be sure I have my rights and lefts placed correctly without any doubt. Let me know. Thanks.","date":"2014-08-26","mins":"6:48 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-147669","author":"dave_hines","post":"Hi OK, I am in Central America presently in a rather intense situation that has delayed my response. I have spent a great deal of time looking at The Manopello Image. I am going to need a bit more time before I put this footage together in a video, because it needs narration and some explanation. Bear in mind and I am sure you must know that a imprint image will have rights and lefts reversed. The Manopello Image if it is the result of imprint as said, the rights and lefts will be reversed. Meaning if this image is laid over and compared with The Shroud it must be laid over the negative image, not the positive. In the same way I cannot lay the negative image of The Shroud over the positive and expect them to line up. Rights and lefts are mixed up. I understand how this needs to be done because I have done it with The Sudarium, I also horizontally flipped the negative image of the Shroud and laid it over the positive, so the rights and lefts are in the same place and I can see the color reversal when I bleed the images together, which is actually a amazing sight. When doing this Manopello image, I am going show it from all angles, flipped horizontally both ways and placed over both negative and positive image, so people can see the difference and understand what is being done and why. That is going to take time, because it involves multiple images being used and narration. In order to see the “true image” of the Manopello image, it must be flipped horizontally. Same with The Shroud of Turin, image on cloth has rights and lefts reversed, I am sure you know that. Allow me some more time. I am having some problems here in Central America of a serious nature that I must resolve. But in the end the rights will be right and lefts will be left. It will be done correctly. May the Grace and Peace of Our Lord Jesus Be With You. Amen.","date":"2014-09-01","mins":"2:35 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-168070","author":"dave_hines","post":"Hi OK, I finally have it lined up correctly. It is the same as you have it on the paper you wrote. If you horizontally reverse both images that is how the image would have appeared on the cloth with lefts and rights reversed. The image presented in your paper is the true image with rights and lefts corrected. Bottom Line: They match up. I made some final fine point adjustments just now. I am slow but persistent. I will put them together in a video so you can see how they blend together in slow motion..","date":"2014-11-03","mins":"12:43 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-147820","author":"dave_hines","post":"Hi Daveb: When I say Imprint, I am referring to blood stains. But yes Shroud image is a mirror image with lefts and rights reversed, imprint will have the same effect, rights and lefts reversed. If Manopello image is same process as Shroud cloth image then rights and lefts will be reversed and it would be matched up with the negative. I looked at it both ways. It is very easy to horizontally flip a image on video editing software, not a complicated process. So if the Manopello image we see on the cloth is the same as the Shroud image on cloth that means the rights and lefts are reversed and need to be corrected.when compared with a positive image on Shroud, or leave it as is, and match to negative so rights and lefts are in correct. Place. I will show it both ways and also I will horizontally flip negative image of Shroud and place over positive, so only the color reversal process can be seen happening very slowly. Which by the way is a amazing sight in itself. To see the negative with positive matching up. I have a family member here in Central America I am helping out in a “uncomfortable situation” which I nearly have resolved. Appreciate your concerns and prayers. That helps..","date":"2014-09-01","mins":"1:48 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-148423","author":"dave_hines","post":"I am travel mode presently but wanted to make comment about the fresco in this video and The Manopello image. I spent well over one hundred hours looking at The Manopello image and placed it in The Shroud Face in every possible way, horizontally flipping the image and laying it over both the negative and positive image. In the process of doing so I discovered something unique about The Shroud image that I had never noticed before. Out of curiosity I horizontally flipped the negative face so it would match the positive and then slowly merged the 2 together so I could see the color reversal taking place in super slow motion. What are perceived as “high eyebrows” on the negative image, actually are not. That is just where the cloth made closer contact giving the illusion of “high eyebrows” which of course was copied in the fresco in this video and countless other frescoes. However, The Manopello image does NOT imitate the “high eyebrows” they drop lower and match the positive image of The Shroud, better than the negative. I seriously doubt the Manopello image is a result of using The Shroud as a role model, as in doing art. It looks more like the result of contact with a face and then touch ups added with paint. Although the eyebrows seem to be in the wrong place when laying it over the negative they are actually placed correctly if one desired the true image of the Man in The Shroud. The fresco matches up the with the negative image of Shroud incredibly well. One area that is very noteworthy is the forked beard that has 2 dark lines going off at a angle to the left and a blank area in between. This is copied exactly, Not only that, when that is lined up, everything else lines up, nearly perfect. The entire face. Every gap, length, distance and width. It is the easiest image overlay I have ever done because it fit’s so perfectly. You can put other faces in there, but I seriously doubt you will ever find a forked beard that fits in this image the way this Fresco does, and have every other aspect of the face line up near perfect when that is done. I had a harder time matching The Shroud face with the Shroud face than the Fresco. I am convinced the Shroud was the original role model and this fresco is a 3rd or 4th generation copy of it. But it does not matter what I believe only what I can prove. Unfortunately that cannot be done with a single fresco..","date":"2014-09-04","mins":"1:45 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-148424","author":"dave_hines","post":"I’ll do it, I just need time..","date":"2014-09-04","mins":"1:46 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-148538","author":"dave_hines","post":"Hi OK, I am behind the times. Unfortunately I cannot devote my time to this because the sick problems going on in Central America that I had to drain my bank account to fix. My research money, I am not happy about it. But yes I referred to the image on The Shroud as the negative and the image with color correction and rights and lefts corrected as the positive. I was looking at the Manopello image in the same way I looked at the Sudarium as possibly being a image more of a result of contact than a artist doing a reproduction using another image as a role model. I do not think the Manopello image is a reproduction using Shroud as a role model, I think it is a contact image with a actual face. I wanted to know exactly where the Manopello image made contact with a face if it was indeed the result of contact. But how exactly? Both ways have many match points, whether the image is flipped horizontally or not, it is a little bit confusing. So using the paper you wrote and looking at it for well over 100 hours I made a final determination of the correct placement of the rights and lefts. As highly improbable as it may seem, that the Manopello image made contact with the face of Jesus it cannot be eliminated yet as a possibility. The fact the eyebrows are in a place that matches the color corrected image and are where they should be got my attention. That image was not seen until 1898. It could not have been used as a role model, yet it looks like it was the role model, something that was not yet in existence. The frescoes follow the dimensions of the Shroud image without color correction and imitating the “not yet corrected rights and lefts” imitating what appear to be eyebrows set up high, when actually they are not..","date":"2014-09-04","mins":"12:30 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-168111","author":"dave_hines","post":"Hello Mr. Dan Porter: I once saw that you asked if The Pantocrator image could be overlaid with The Shroud so I tested it. If you want to see it I will put the 2 together and slowly blend them in together in a video, not changing aspect ratio of either image, fair and honest. The Pantocrater does not fall into place like the Thomas H. Fresco reproduction does,which is a superior match to the Pantocrator in many ways. The Pantocrator looks to me like a reproduction of a later dated reproduction. Basic face is there, but missing details this Thomas H. Sketch has. (apparently a copy from a 1st to 3rd century fresco in Rome) I bought his book so I can hear what he has to say and look more at his art. It was a bit difficult to find, it is out of print. But the Pantocrator does have the ” unusually long bony fingers” with the thumbs barely visible, “I wonder if that has anything to do with the shroud?” Ha, Ha..","date":"2014-11-03","mins":"2:44 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144840","author":"dave_hines","post":"Hello Mr. Russ Breault: I really enjoyed The Shroud Encounter videos on you tube, the series of 7. I game them all thumbs up. Outstanding presentation. There were 2 sources I found that presented this fresco, both claimed it was 1st Century, not 2nd Century. I believe it comes from the 1st or 3rd century, so I chose the number in between so it would not look like I am tilting the scale in favor of authenticity. To be fair on both sides, convinced and not convinced. The aspect ratio of both images in this video are NOT altered, it was easy to put them together because I did not have to do much of anything, just place one over the other. I can do the same with any image anyone would like to see. Using the same time sequence for fade in, exact same procedure. It is not difficult. I am in the process of doing a Mona Lisa, | Abe Lincoln and John Lennon. I can even do a Johnny Depp for Hugh. Here are some links and quotes from them. “It is believed to be of the first century as Pope Urban II is shown in the painting looking intently at the face of the Christ. Pope Urban II reigned from 222 230 AD” This is one of the links http://jesusandhischristines.org/pic2.htm This is the second one I found which had this caption under the Fresco “Callistus Fresco of Jesus from the First Century found in the Roman Catacombs” http://arpchurch.com/2012/04/29/do the catacomb paintings of jesus help us imagi The most important thing to know is that the aspect ratio of neither image has been changed in the video “to make them fit” No trickery or B.S going on, very straightforward. I would like to have some more info on this fresco, especially the dimensions of the fresco. I am having trouble locating it. The date of the fresco still needs to be confirmed. What is noteworthy it that it seems the artist is copying what would be called in forensic science as “accidental characteristics” I need to look at more closely to be sure..","date":"2014-08-19","mins":"6:32 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144887","author":"dave_hines","post":"Good Evening Mr. Hugh Farey: I was a portrait painter, using photos of real people as the role model and I did several reproductions of famous paintings, Da Vinci (Mona Lisa & The Virgin on the Rocks, Caravaggio, Thomas Gainsborough, Van Gogh and others. I do have personal experience doing reproduction paintings that involve detailed face painting and landscape. I learned the hard way, you cannot make a mistake or be off even a few millimeters if you want a face to look right. To do a accurate face reproduction is difficult, detailed work that requires very specific and unique measurements to be replicated. No 2 faces are the same, in the same way no 2 snow flakes are the same when viewed under a microscope. I did go on google and got the best straight on shot of Johnny Depp I could find that looked like it could work. I will attempt with others of him. The problem is when I drop his face image into The Shroud it is not the same. I enlarged the image correctly and matched up the nose as perfectly as possible, then placed image over The Shroud and then the eyes are way below the place they need to be, and numerous other points will not line up. Some match some don’t. It is awkward looking. The same challenge occurred with every image I have tried so far, John Lennon (3 different photos) Mona L Isa and Abe Lincoln. What is noteworthy in the case of the fresco is that it just falls into place. I enlarged the image maintaining aspect ratio matched up the nose and that was it. It worked. No struggle, not fighting with the image to fit. The forehead lines up, the eyebrows line up, the eyes are in the right place, the gap between the eyes is correct, the space between eyes and nose is correct, Space between nose and mouth is correct. Beard lines up. The whole thing lines up. It took me less than 15 minutes to put the images together. No other image is lining up like this fresco does. It not only looks right, “it feels right” Nonetheless, I am going to play the role of a hard core serious skeptic on this and not just wave a white flag because I spent a few hours with 6 different images, if you have a image you think will fit, let me know and I will drop it in and see if it works..","date":"2014-08-19","mins":"11:56 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144890","author":"dave_hines","post":"Hi Louis, this fresco was apparently discovered in 2010 in the Callistus Catacombs. They go on for about 12 miles with 4 to 5 different levels. A underground city. Here are some links and quotes about the fresco. Http://jesusandhischristines.org/pic2.htm “It is believed to be of the first century as Pope Urban II is shown in the painting looking intently at the face of the Christ. Pope Urban II reigned from 222 230 AD” This is the second one I found which had this caption under the Fresco “Callistus Fresco of Jesus from the First Century found in the Roman Catacombs” http://arpchurch.com/2012/04/29/do the catacomb paintings of jesus help us imagi Bottom Line: We need more info regarding this fresco..","date":"2014-08-20","mins":"12:07 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145541","author":"dave_hines","post":"Is it really the image of a dead person? It looks more like a person at the moment of resurrection to me, in between life and death, between light and shadow, in between science and superstition. Next stop ahead. … The Twilight Zone, (That was actually meant as a bit of humor) If you had to line up the suspects responsible for image you have 1. Mr. Paint 2. Mr. Imprint 3. Mr. Ammonia 4. Mr. Light Which of the 4 suspects is most likely responsible for the image? To get the distance information on the Shroud he’s got to be fast and smart. Which of the 4 suspects is the smartest and the fastest? Which of the 4 suspects can be eliminated beyond any reasonable doubt? Which of the 4 suspects is capable of coloring a micro thin layer of carbs on a piece of linen in a very specific hue that represents a measure of distance without leaving behind any trace of paint or pigment? Which of the 4 suspects in the most cunning, baffling and powerful? Who is the last person standing after the process of elimination is done? CLUE: A Paul of Tarsus letter refers to a Shining Wrap, A Illuminated Garment that he wants brought to Rome, Italy..","date":"2014-08-22","mins":"10:17 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144984","author":"dave_hines","post":"Hi Hugh, those images look good, convincing looking, but the problem is the aspect ratio of the images have been changed to make them fit. In the second that is done, that is no longer Johnny Depp, that is no longer John Lennon anymore. The reason I know is because I have the same photo of John Lennon and a similar one of Johnny Depp and put them up on video editing software and did comparisons. Those images do not match up with The Shroud of Turin face. The Fresco image is not altered. The aspect ratio is not altered to make it fit. I can put up those same photos of John Lennon and Johnny Depp and NOT change the aspect ratio and you will see a completely different image, One that does not match with the Shroud, awkward looking. There is not one part of the Fresco in this video that has been made smaller or larger while another part is not so “that it fits” Enlarging a photo is one thing, but to change the aspect ration is a completely different thing, ASPECT RATIO CANNOT BE CHANGED. I challenge anyone in the world, to come up with a better match than this fresco fits into The Shroud of Turin. Show me the photo and I will put it up and look at it. A photo that has NOT been altered and tailor made to fit. On a closing note I am not saying that I think you are dishonest or being deceptive, I don’t think so, I think the opposite, you come across as a extremely intelligent, honest person. If this is going to debunked as coincidence, let’s do it in a fair and honest way. Fresco image has not been altered, any comparisons must also not be altered, with the only exception being enlarging or making the image smaller but maintaining aspect ratio..","date":"2014-08-20","mins":"11:45 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145161","author":"dave_hines","post":"Hi Hugh, The Lennon photo you used was not to bad. It does match up to some degree with the Turin Shroud image. I gave it a thorough and honest appraisal. I had to tilt the image just a bit, spent a few hours working with it. It is not a completely awkward fit, but you would not connect the 2 and say one was used as a role model for the other. It does not just fall into place, like the Fresco did. It is kind of there and kind of not there type fit. It does have several points of congruency. There is no denying that. . Without changing aspect ratio I could blend the Lennon shot with the Shroud, so I know what you did was honest and upfront. It does work to some degree. Now The Manoppello Image that I just got through comparing, was a stunning match. It dropped into place in less than 30 seconds. I have never thought these 2 images had anything to do with each other. They look vastly different to me, but when you lay this image over The Shroud, it is truly amazing. Nearly a dead on match. The Manoppello Image looks like there is no way it is going to blend in, but it does. It works in a way hard to put into words, astounding is the 1st word that comes to mind. I do not even know what the Manoppello image is but I am certainly interested now. Anyways, I am interested in using the Johnny Depp that you used in the blend shot. I cannot find the image you used. Can you put it up on a link by itself, so I can try it out?.","date":"2014-08-21","mins":"3:51 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145382","author":"dave_hines","post":"Hi Hugh: I did put up the J. Depp photo. I was able to line up the chin, lips, nose and eyes and forehead in the right place. I can fade it in and make it passable. But you would never look at the 2 images and conclude they were related and one was used as a role model to make the other. The fresco looks like it was done using The Shroud as the role model. It is a superior match vs Depp image, there is no denying that. Some of the accidental characteristics of the Shroud image are copied on Fresco. No ears illustrated, odd beard shape with 2 angles going off to the left are copied. Owl shape eyes placed precisely where the artist would see white blotches. Forehead match. Eyebrows match, no variation. Hair parted in same spot, image is a straight on shot, exactly as seen on The Shroud.. The Image does not move as opacity is being changed and the images are combined. It is not unlike a very odd shaped puzzle piece that fits into the empty spot. The other photos I tried can fit in to some degree, but they are vague, and have errors. Like a similar puzzle piece that does not fit into the empty spot, close but no cigar. Fresco image is not a “vague match” it is precise match. A big difference. The fresco is a triple 777 winner. It fits inside just right. Like the combination to a lock, even if you are off a few numbers, the lock will not open. The fresco opens the lock, the Depp image does not. The numbers are off. To be fair and thorough, a large number of images should be compared, like 99,000 or 1 million using facial recognition software and congruence pts. Of course that It does not prove the authenticity of the Shroud. This is a single display that supports authenticity. A small stone placed on the scale. How much weight does it carry? Time will tell on that one, there is still some missing information on this Fresco. Can’t assign a numerical weight without the info. But it could start getting heavier or lighter, But either way, my paycheck stays the same. So I am not going to lose any sleep over it. Thanks for giving me the line to the image, it was helpful.","date":"2014-08-22","mins":"3:25 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145180","author":"dave_hines","post":"Hi OK, I gotta say, I got a huge surprise when I put the Manoppello image over the Shroud. I have never believed that these 2 images had anything to do with each other. Until tonight. When I changed the opacity of one image and began to allow the other image to blend, you can literally see the eyes opening on the Man in The Shroud. The image does not move around during the blend, it stays in place. Everywhere. There was some extremely minimal shift, perhaps due to the fact the length of face was a few points off. What is truly bizarre is that these 2 images do not look like they could possibly be related. But yet they seem to be. They compliment each other, like 2 halves of the same person. When they come together something remarkable happens,like they were meant to be joined. I find it extremely unlikely this image fits in the way it does by random happenstance and dumb luck. Possible, but not likely. If this is coincidence, it is one hell of a bizarre coincidence. I need to test more images to be certain this same thing is not happening with other images. It is the only way for me to be convinced. I am a bit of a skeptic myself when it comes to these things. Thanks for sending me those links, it really was amazing when I dropped the image over The Shroud. It was just there immediately. Fell into place, like the fresco did. I was not expecting that to happen at all..","date":"2014-08-21","mins":"5:24 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145395","author":"dave_hines","post":"There is no doubt. They match up in a way that goes beyond coincidence. I need to do more research about the history of this image. I will make the video. I will use the same time sequence and fade in, so both images can be seen alone and then slowly mixed together. 1 minute video. Exactly as seen in this video. Same procedure. I had to make my house check in ready for guests today otherwise I would have responded faster. I am exhausted..","date":"2014-08-22","mins":"4:06 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144855","author":"dave_hines","post":"Hello Mr. David Goulet: For the last few hours I have been working diligently to get these other faces to fit into The Shroud, but they simply do no work. I will keep trying to get the best possible match of another face that I can. 1. Mona Lisa Not enough close, it is a completely different face. If one needs to see what it looks like I will put it together the best it can be and upload it. It is stunning, stunningly bad looking. 2. John Lennon: Some points of congruence. But again it is a different type of face altogether. I can get the beard and nose to line up, then another part of the face goes out of whack. Eyes in wrong place, ect. 3. Abraham Lincoln: I can get the nose and lips to line up, and the beard but then the forehead goes way out place. Eyes are to small. I will put it together in the best way it can be done, but it is not even a close match to what the fresco is. 4. Johnny Depp: A completely different face, eyes are completely in the wrong place. There is no way to get it to match. At first glance it looks like it will work, then when placed over Shroud it is completely different. I am going to collect more photos and get the best straight on shot that looks like the Shroud face and I can do everything to debunk this “new evidence” as not being significant. It seems the more I try to debunk it, the more convincing it gets..","date":"2014-08-19","mins":"8:46 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145944","author":"dave_hines","post":"Almost Done..","date":"2014-08-24","mins":"11:33 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-146107","author":"dave_hines","post":"Hi OK, here it is.","date":"2014-08-25","mins":"4:45 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145536","author":"dave_hines","post":"Hola Carlos: Good detective work finding the artist who did this. ¡Magnífico trabajo! So, He was in the catacombs. Very interesting. Now we need to find the fresco role model that he painted. A remnant of it, must still be there, it does not matter how faded it is. See if you can find any more info on exactly what part of the catacombs he was in. We need a photo of that spot he was at and the fresco he was looking at and the other art surrounding it. How old are those? I am awaiting news from a contact I have in Rome. He knows the catacombs. See if you can find any info on where he was exactly. The catacombs go on for 12 miles. It said that Pope Urban II was also shown in the painting looking intently at the face of the Christ. Pope Urban II reigned from 222 230 AD Where in the catacombs is there a fresco of Pope Urban ll? That is the starting point. I am sending you the link to 27 different paintings that I did. I did some reproductions of Da Vinci, Caravaggio, Botticelli (I put the face of Venus in a Starry Night Painting, in the cypress tree) Van Gogh, Thomas Gainsborough, I stole a bit of El Greco in a few paintings. Https://www.facebook.com/robert.page.5688/photos In the meantime I am going to have a look at some of the art of Charles Heaphy..","date":"2014-08-22","mins":"9:46 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-168025","author":"dave_hines","post":"Hola Carlos Compré el libro, Gracias por la info, quiero leer lo que Thomas Heaphy tiene que decir sobre el tema, el libro está agotado y era difícil de encontrar a un buen precio, pero lo conseguí, Que el espíritu de dios descansa sobre usted, el espíritu de sabiduría y de inteligencia, espíritu de consejo y fortaleza, espíritu de conocimiento y de temor de Jehová. ¡Amén!.","date":"2014-11-02","mins":"11:00 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145504","author":"dave_hines","post":"Hello Mr. Collin Berry: I can assure you there are no parades taking place on my behalf here in Central America or any other country. The Fresco matches up with The Shroud image whether I want it to or not. Any portrait painter (including myself) would not have any trouble determining where to place the lines based on this negative image. There is more than enough image to know where to draw the lines of the face, chin, nose, length of head and beard. The sides of the face are vague,because of the white lines (chin band?) that would present a challenge. But All the important gaps are clearly visible. The placement, size and shape and of the eyes would be the most difficult aspect of this work, since none are illustrated. In which I would have struggled the hardest to place. The artist that did this fresco did not have the Shroud in front of him, but the person who painted the fresco on the wall in which this was made may have the actual Shroud as the role model. There is no way to be sure of that, but it CANNOT be eliminated as a possibility that this could be a second or third generation copy. To really map out the points correctly on the Shroud and make a reproduction would take 2 or more people, one up close to the image another standing back and confirming points. Once that math was established a standard would be set for future and additional replica’s. Which I am convinced is exactly what happened. But it does not matter what I believe, it only matters what I can prove. I am not a point where I am able to do that yet. This Fresco is just a appetizer, the main entree is being prepared, so every body can get a full meal and be satisfied. In the early centuries of course a reproduction would be made with the rights and lefts not corrected. With “E” on left side. Unless one thought to do a replica with the image in a mirror, “Hey, let’s correct the lefts and rights of the image” Possible, but not likely. Comparison image should also be matched with the rights and lefts not corrected. This reproduction of Jesus matches the unique characteristics and even a few of the accidental characteristics of The Shroud of Turin. Some but not all. I am looking at it up close on video editing software. The images are placed on separate tracks and I can change the opacity so one begins to bleed into the other. I observing what I am seeing and writing it down. Going from one to the other. The same thing I have done with over a 100 paintings to replicate them. I cannot force either image to do what I want, or display what I want to see, only what is and then replicate it. I am very good at replicating art. I see a person replicating The Shroud. Starting from the top. 1. Same width of hair on top of head before forehead visible. 2. Parts hair in middle in replicating Man in The Shroud, 3. Forehead same length, width and shape 4. Eyebrows begin at exact same location and follow same unique shape 5. Owl Like Eyes added precisely where they need to be with proper space between 6. Nose begins and ends at the same spot and follows same shape 7.Does not illustrate ears, although it looks like they should be, matching Shroud 8. Illustrates blood stains in the hair where blood is on Shroud (Accidental characteristics) 9. Width, size and shape of lips match, follows same unique path. 10. Mustache and beard line up and leaves blank spots where Shroud image is blank. 10. Copies shape of dark angled lines of forked beard (Accidental characteristic) 11. Replicates lines on side of face by shading both sides. (Accidental characteristic) 12. Length, width and unique shape of entire head is the same. Where the image deviates is the hair on the lower ends. That is all. There is no one piece of evidence that authenticates The Shroud. This is only a single display that tips the scale toward authenticity. No one can argue that this tips the scale the other way, or has no weight at all. It is not possible to assign a numerical value of weight to this evidence until more information is available and more comparisons done, up to 1 million using Congruence points and facial recognition software. That is how a accurate number could be established. A combination of both. That has not been done yet..","date":"2014-08-22","mins":"4:41 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145519","author":"dave_hines","post":"Https://www.facebook.com/robert.page.5688/photos Hello Mr.Collin Berry In the case someone would question my ability to give a accurate assessment or evaluate another work of art, I posted 27 paintings I did, reproductions and originals. I do have knowledge of how an artist would approach doing a replica based on Shroud. Dimensions of face are being replicated in Shroud not so much achieving a negative look..","date":"2014-08-22","mins":"6:41 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-168063","author":"dave_hines","post":"Hi OK, it matches. What is noteworthy is that this image is not copying the “falsely perceived” high set eyebrows on the linen cloth image, That is the part that did not match. On the 1898 shroud negative and of course the later better photos you will be able to see what were “falsely perceived” as high set eyebrows are actually not eyebrows. They look to be eyebrows on the cloth image but they are not. Manopello image was “not fooled” by the falsely perceived high set eyebrows image on cloth and did not copy them, it matches the true face. They are set lower in the 1898 negative. Many of the old frescoes copy the “falsely perceived high set eyebrows” More evidence that supports authenticity. The Thomas Heaphy reproduction of the fresco copies the high set eyebrows, Also Thomas H sketch copies the angle of the forked beard, leaves blank what is blank on Shroud, and when that is matched up everything lines up, eyebrows, nose, eyes, lips, everything. That cannot be a coincidence, possible but highly unlikely. IT is a match, no one shall convince me otherwise. Let’s see another face put into the Shroud that has a missing beard section that matches up with The Shroud image and then have everything else line up when matching that. NOT HAPPENING. The Heaphy sketch is a superior match to that of the “Pantocrator” which supposedly has 200 matching points. If that is true the Thomas H sketch has more than 200 matching points. It is by far the best match to the Shroud there is. The Manopello image acts more like a contact image Not a reproduction of another work, but actually made contact with a face, possibly the face of Jesus. It does match the Shroud. Another match point not being discussed are the “unusually long bony fingers” on the Pantocrator with the thumbs barely visible. A Coincidence? I think not. Coincidence? I think not..","date":"2014-11-03","mins":"12:13 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145732","author":"dave_hines","post":"Good Evening Mr. Colin Berry: I did make this observation when looking at the images and wrote in my previous response. “The sides of the face are vague,because of the white lines (chin band?) that would present a challenge” Any artist looking at The Shroud to replicate it would know that a face does not have 2 straight white lines coming down from it. In making comparison we should use the negative image that appears white on the sides, not black. The artist did not see black, he saw white. I notice the artist makes his best estimate in forming the lower part of the face, not replicating the white lines which would look extremely out of place on a portrait. Worse, painting what would like a letter E on the forehead in a blood red color. If someone came to me and asked me to do a portrait painting, say a Mother who’s Son was brutally murdered and who’s face was disfigured and covered with blood as a result of death. And unfortunately the only photo she has of her son to give me as a role model is one taken of the body at the morgue or crime scene, would I replicate a morgue photo for her?! Something frightening looking or bizarre. And perhaps with tears in her eyes hands me the morgue photo, “Please do the best you can to paint my boy” “I don’t want to remember his this way” From the photo I can determine the dimensions of the face and do the portrait. Question: Would I replicate all the blood stains and all the aspects of light and dark on the image? NO “Make him look beautiful, the way he was when he was among us” This is what we are seeing in this Fresco Painting. “A cleaned up version of Jesus” This is only 1 display with a lot of unanswered questions, by itself, is not 100% convincing..","date":"2014-08-23","mins":"8:33 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145751","author":"dave_hines","post":"Hello Mr. David Goulet: It is unfortunate that there apparently was not an artist in this time doing photo realism. Paint exactly what you see, regardless of how grotesque it might be and replicate it. Like for example replicating what looks like the letter E on the left side. The negative look as well. The final words of Jesus according to the Gospel account was, “It is finished/accomplished, Father, in your hands I commit my spirit” A hard mission accomplished type statement that would likely leave a person’s face with a look of relief/serenity “It’s over, I did it” “I am going back home now to be with my family in the Kingdom of Heaven” Scripture and forensic evidence match here as well..","date":"2014-08-23","mins":"11:24 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145940","author":"dave_hines","post":"Good Evening Mr. Colin Berry Off topic: I know you are real determined to prove Shroud image is contact only. I did some experiments with 3 D figures of Jesus covered in myrrh and aloes and left them for 3 days. In pure linen fabric. I still have the photos and the linen from 3 years ago. It did look convincing. Made a great mold and could stand up the linen, a linen statue of Jesus at the end, the sepia, caramel color, no traces of paint or pigment, yet the linen does look painted. Over time the cloth softens a bit and flattens. (3 years ago I did this) Of course no distance information, numerous other problems that did not match Shroud image. It was just a experiment I did, then exposed the myrrh resin to the brightest light I could get. A poloraid flash gun. I really think if the Templar Knights were going to do a Shroud deal, they would have the read Gospel and done it this way, according to Gospel account And there came also Nicodemus, which at the first came to Jesus by night, and brought a mixture of myrrh and aloes, about an hundred pound weight. Then they took the body of Jesus, and wound it in linen clothes with the spices I believe Shroud image is combo of both. Mr. Light and Mr. Imprint both involved. Bear in mind myrrh resin will react to light by changing color. Up close with a poloraid flash gun it will turn darker. ” Can be used as a substitute for cellulose acetate. (not as good though) Ray Rodgers found starch fractions and pectin that he believed made up the micro thin where the image resides. Perhaps you could try a few experiments with myrrh resin. Bear in mind it is expensive. I would not want your hard earned money to be spent with dissappointing results. But before eliminating myrrh as being on The Shroud I made these comparison notes. COMBINED CHEMICAL PROPERTIES OF STARCH FRACTIONS & PECTIN IN COMPARISON TO MYRRH AND ALOES AS MENTIONED IN THE GOSPEL These substances (Starch fractions & Pectin) were found to make up the micro thin layer where the image of The Shroud of Turin Resides. Let’s begin by defining what starch & pectin is made up & see if the chemical properties match up with “the 100lb weight of myrrh and aloes” as mentioned in the Gospel of John. Amylose (you might disagree with that) was found on the Shroud of Turin and is a spiral polymer made up of D glucose units. It is the main component which makes up starch. Starch and cellulose are polymers derived from the dehydration of D glucose. Starch is a polysaccharide (meaning “many sugars”) made up of glucose units linked together to form long chains. The main component of Pectin is D Galacturonic acid, which is a sugar acid, an oxidized form of D Galactose. Pectin is a polysaccharide of 1 – 4 linked polygalacturonic acid with intra chain Rhamnose insertion, neutral sugar side chains and methyl esterification from many of the rhamnose residues, side chains of various neutral sugars branch off. The neutral sugars are mainly D Galactose, L Arabinose and D Xylose, PECTIN is also a uronic acid, Naturally occurring uronic acids are D glucuronic acid, D galacturonic acid. Let’s make a simplified list of what Starch and Pectin are made up of. 1.Uronic Acids 2.D Gluceronic Acid & D Galacturonic acid. 3.Polygalacturonic acid (An oxidized form of D Galactose) 4.Glucose 5. L Arabinose 6.D Xylose 7.Rhamnose NOW LET’S TAKE A LOOK AT THE CHEMICAL PROPERTIES OF MYRRH AND ALOES IN COMPARISON TO STARCH AND PECTIN Myrrh resin contains D Galactose and L Arabinose, Xylose and 4>0 methyl D Gluceronic acid From the resin yields Uronic Acid 19% D Galactose 60% L Arabinose 10% and L Rhamnose 5% Many of the health benefits associated with Aloe vera have been attributed to the polysaccharides contained in the gel of the leaves. A variety of polysaccharides are present in the cell wall matrix. An overall carbohydrate analysis showed that the cell walls of the aloe leaf hold mainly polysaccharides, cellulose and pectic polysaccharides whereas the skin of the leaf contains in addition significant quantities of xylose containing polysaccharides Aloes contain cellulose and hemicellulose and store carbohydrates. Saccharides in aloes are, Mannose, Glucose, L Rhamnose, Aldopentose THE PRIMARY POLYSACCHARIDE IN ALOES IS A PECTIC SUBSTANCE. MYRRH & ALOES STARCH & PECTIN 1. Uronic Acids 1. Uronic Acids 2. D Gluceronic Acid 2. D Gluceronic Acid 3. D Galacturonic acid. 3. D Galacturonic acid. 4. D Galactose 4.Oxidized D Galactose 5. Glucose 5. Glucose 6. L Arabinose 6. L Arabinose 7.. D Xylose 7.. D Xylose 8.. L Rhamnose 8. L Rhamnose Dr. Baima Bollone a professor of forensic medicine in Turin claimed to have found myrrh and aloes in the BLOOD by antibody antigen testing, this evidence would support his findings. Note Myrrh resin also contains many volatile oils and other chemical properties such as (limonene, eugenol, pinene, terpenes, sesquiterpenes, esters, cinnamaldehyde, cuminaldehyde, cumic alcohol, heerabolene, dipentene, m cresol and cadinene), resins (myrrhin, alpha , beta and gamma compiphoric acids, commiphorinic acid, alpha and beta heerabomyrrhols, heeraboresene, commiferin, campesterol, beta sitosterol, alpha amyrone All of which would have evaporated over the course of almost 2000 years with only the remnant of the sugars/carbs of the myrrh remaining. There is, on the outermost fibers of the cloth a clear washing residue: a thin coating of starch fractions and the various saccharides found in soapwort: glucose, fucose, galactose, arabinose, xylose, rhamnose, and glucuronic acid. Sugars in myrrh and aloes are the same sugars in soapwort 1.Glucose 2. Galactose 3. Arabinose 4. Xylose 5. Fucose 6. Gluceronic Acid 7. Rhamnose And there came also Nicodemus, which at the first came to Jesus by night, and brought a mixture of myrrh and aloes, about an hundred pound weight. Then they took the body of Jesus, and wound it in linen clothes with the spices. Bottom Line: Try some myrrh resin with your contact experiments. It also has other great side benefits, a great skin cream, it makes you look younger, not saying you look old. Leaves no trace of paint or pigment..","date":"2014-08-24","mins":"11:15 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145990","author":"dave_hines","post":"Good Evening Mr. Colin Berry I really didn’t expect to see my book on The Shroud Blog Site. But that’s ok. The Shroud of Turin is actually involved in the writing of that book. That is a long story. But the title and illustration kind of says it all. I got convinced. It was written with a chemically dependent person in mind. It is based on the steps of the AA program. The reason for the seemingly long length of the book is because people represent the world in different ways, visual, audio and kinesthetic, so things are explained in all 3 ways, which takes up more space. I did a series of 40 paintings for the book that took up more space. Only some of them made it inside. Anyways I’ve seen some your past posts so I know you have elevated knowledge in chemistry and physics, far superior than my own primitive, basic understanding at best. I thought there might be something in what I wrote that could be useful info for you. Perhaps.not. I’m here in Central America on a rather serious mission, seeking the will of God and the power to carry it through. In the end it is all going to work out. I wish the same for everyone. Of course that includes you. We are a bit north pole/south pole when it comes to the authenticity of The Shroud of Turin, But that’s ok. There is a time and purpose for everything under heaven Anyways I gotta go. I am convinced you are going to find the answers to all the questions you seek. PEACE.","date":"2014-08-25","mins":"5:36 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145200","author":"dave_hines","post":"Buenas noches, Carlos, Estoy en Costa Rica ahora mismo, tengo invitados que llegan de San José hoy a alquilar mi casa de vacaciones cerca del mar. Hablo y escribo en Español todos los días. Gracias por los comentarios super positivos y informativos He estado trabajando toda la noche y me agoto. Tengo que pasar algún tiempo en silencio, rezo y consejo con el Señor. Esto es un gran lugar para hacer esto, por eso me moví acá. Después de que mis invitados se registren más tarde hoy, seré capaz de darle una respuesta apropiada Hice algunos nuevos descubrimientos que quiero compartir con usted. Mientras tanto que el Espíritu Santo sea contigo el Espíritu de sabiduría y inteligencia, el Espíritu de Consejo y poder, el Espíritu de conocimiento y del temor del Señor. Amen.","date":"2014-08-21","mins":"6:33 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-168065","author":"dave_hines","post":"Hola Carlos, en realidad el negativo sobre tela los partidos un poco mejor, esto parece coincidir con la razón es mejor porque son del mismo color blanco y negro Aunque coincide muy bien con la imagen positiva también. Yo recientemente re había posicionado con más exactitud que este video. Es realmente un partido increíble impresionante, no hay ningún otro fresco que coincide con el mejor, nadie podrá convencerme de lo contrario. Cualquier persona que cree que estas imágenes no coinciden en la necesidad de revisar su vista. Dios Le Bendiga.","date":"2014-11-03","mins":"12:25 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145746","author":"dave_hines","post":"Hola Carlos, Mi dirección de correo electrónico es casaazul777@gmail.com No dude en ponerse en contacto conmigo en cualquier momento.","date":"2014-08-23","mins":"10:54 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"}]
