[{"id":"comment-193179","author":"dave_hines","post":"Hi Sampath, here is a link to a paper you will no doubt find very interesting to read. This will answer all your questions and then some. I can make some comparison analogies that make it easier to understand but in the meantime read this. Https://www.shroud.com/vanhels5.pdf It gets a bit complicated and one could get easily get confused going through all the numbers but the bottom line Is; The Samples Failed The X Squared Test. Here is a highlight quote: “A computcr programmed statistical analysis using the X² with a test value of 8.56 showed beyond any doubt that the maximum value for the three laboratories with 95% confidence is 5.99 (2). In the case of such high X² test values it is recommended that conclusions be postponed in order to obtain better samples and to conduct new tests” If that information was given to any ruling authority in a authenticity court room type setting the carbon dating results would be ruled inadmissible evidence and that would be the last time it was mentioned again. The results of the X Squared Test is not unlike a sword that cuts off the head of the radio carbon dating serpent. He was the star witness for the anti authenticity side. That was the cornerstone on which their case was built. Without the cornerstone everything collapses that was built on top of it. Https://www.shroud.com/vanhels5.pdf Another highlight quote” “Again I verified the consistency of these FOUR results by the Chi^2 test. A NEGATIVE Chi^2 value of 8.40 > 7.81, the critical Chi^2 value for 95 % confidence and (4 1) degrees of freedom, indicates that the sample for Arizona is not homogenous. Nevertheless, these values are given as INDEPENDENT values in Table 1 of Nature. As one will see in the notes by the Nature report, Dr. Leese will explain in a very complicated way, how but NOT why he did bias the results, in order to TURN the NEGATIVE Chi^2 value of 8.55, first into a “borderline” case 6.4 and secondly, as by magic, into “95 % confidence” ! https://www.shroud.com/vanhelst.htm There is no way to escape the simple fact the 1988 sample failed the Chi Square Value Test, In such a case there is only 1 obvious logical course of action to take, 1. Start over with a new sample group. And before publishing the results, make sure the new sample group passes the X Squared test..","date":"2015-03-12","mins":"2:55 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193182","author":"dave_hines","post":"Hi Sampath, An X Squared Test will reveal if there is an inconsistency and or tampering of a sample group. Mixing old fabric with new fabric would be a way to get inconsistent results. None of the 3 labs were in agreement on a date despite testing the same fabric from the exact same location. In a clinical trial if 3 people suffering from chronic pain were given a new pain drug and the results were Person 1. The new drug alleviated the pain Person 2. The new drug did not alleviate the pain. Person 3. The New drug made the pain worse. Those results would fail an X squared test, because the results are inconsistent. The results from the 3 labs who tested Shroud Samples were also inconsistent. Minor inconsistency is to be expected to some degree within a sample group. X squared test sets parameters and limits to how much inconsistency can occur before it “crosses the safety line” and a new sample group would be required and repeat the tests. It is a mathematical way to be sure you can trust the results of things being tested within groups of 3 , 7, 9 or more. I am not a expert on the subject. But I hope this helps you understand it better..","date":"2015-03-12","mins":"3:33 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194706","author":"dave_hines","post":"Hi Hugh: You may find this hard to believe but there is the type of person that will base their belief on whether Jesus existed or not, or actually rose from the dead, based on the Shroud of Turin. There is the type of person who must see something before they will believe. I get over 500 views a day on this subject from 208 different countries. I have received letters from many of those people who were losing faith and had that faith strengthened or restored because of The Shroud of Turin. It ends up making them interested in scripture again, a return and stronger faith in the word of God and a more personal relationship with Jesus. That is one of the after effects The Shroud has. I am one of those. I was also raised in the Catholic Church like you. I did not even know The Shroud existed all during that time. It was never mentioned in any mass I ever went to. Shroud is a witnessing tool, not a salvation issue. But it could be what brings a person to salvation. It did encourage a deeper involvement with the life of Christ for me (to say the least) and many others who I receive letters from almost every day. People from every country in the world are interested in The Shroud of Turin. If there are 2 words I would use to describe The Shroud of Turin it would be 1. Subtle 2. Powerful It has the signature character quality of the Spirit of God written all over it. Seriously, if we tested a blood sample from the corner of the Shroud, but not any of the other 400 blood stains. Would you be convinced that blood stain represented and was the same blood as the other 399 stains? At the very least they should have taken samples from 2 other areas, that way they would have at least 3 witnesses, instead of 1 witness cut in 3 pieces. The 1988 Radio Carbon Dating is only 1 witness. Not 3. Not complete..","date":"2015-03-28","mins":"11:14 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194882","author":"dave_hines","post":"Hi Dan, I did promise you I would work on a overlay of the Pantocrator. Sorry about the delay on that. I aspire to do better work in the future. My channel is in the process of being upgraded and some corrections being made. When they are complete I would be glad to share it with everyone. Examining and reviewing comments from both sides of the debate on the Shroud on this site is very educating. We all benefit from this Shroud Blog Site that you have put together, Increasing our knowledge, wisdom and insight. It is really fascinating. All the different characters that post on a regular basis. The most powerful thing is the truth, both skeptic and non skeptic searching for it relentlessly. And The Holy Spirit is Truth. IN a way we are all searching for the Spirit of God whether we know it or not. Man In The Shroud brings people of very different backgrounds together. Some not always in agreement. A search for the truth that someday soon everyone will know. Keep up the good work Dan!.","date":"2015-03-30","mins":"3:21 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195196","author":"dave_hines","post":"Hi Dan. This is a video in which you may need a strong a cup of coffee and a tin foil hat while watching. Note the numbers that coincidentally came up for this video. 033. That is also the year The Shroud of Turin made contact with the body of Jesus. But don’t take my word for it, see what Jesus of Nazareth has to say about the authenticity of The Shroud in the video. He is the person we want to hear from on the witness stand. A better witness than Mr. Radio Carbon Dating who can not seem to keep his story straight, 3 different times he gave 3 different dates. We want the exact date, not a rough estimate based on stone knife and bearskin technology methods. In this video we will get that exact date using a more advanced technology. ELF Communication. Daveb of Wellington nz made mention of a Higher Truth. We are going to hear from that “Higher Truth” An answer to his prayer. The Lord works in mysterious ways. Keep up the good work on The Shroud Blog Site! Happy Easter To Everyone Posting On This Blog Site! Yes, that includes ALL the skeptics!.","date":"2015-04-02","mins":"10:41 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194714","author":"dave_hines","post":"The Radio Carbon Dating is not unlike having only 1 eye witness to a crime and then when that “witness” is questioned by 3 different detectives the story of what happened and the time line of events changes slightly each time it is told. (That is why the samples failed the X squared test) It is a huge red flag to a forensic crime investigator. Especially when the eye witness testimony does not match the rest of the forensic evidence time line of events! Yes there were 3 different labs but only 1 Sample! 1 witness, not 3 witnesses, The Radio Carbon Dating was 1 witness questioned by 3 different authorities and the story changed each time it was told. Word of God On The Subject: “One witness cannot establish any wrongdoing or sin against a person, whatever that person has done. A fact must be established by the testimony of two or three witnesses.” Mr. Radio Carbon Dating is one witness that can’t get his story straight. “Not Convinced”.","date":"2015-03-28","mins":"1:25 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194720","author":"dave_hines","post":"The Man In The Shroud is famous all over the world. Huge. They love his music or they hate it. Some in the middle. I have some footage I want you to see. I got a huge breakthrough in my ELF research/communication experiments with a “Higher Power Intelligence/God” It involves the subject matter of the recent video I made. It is basically a “ask and you shall receive” type approach method which involves measuring the response of the person contacted by monitoring changes in the AC Voltage and also measuring the HZ frequency of that AC voltage source on a ELF Sensor. A numerical response. (Hz Frequency is the number of times an electrical signal oscillates in one second) A numerical response in a specific code and sequence of numbers that clearly would demonstrate the sender of the info has superior ability and intelligence and is directly responding to the person “asking for the info” (Beyond a reasonable doubt) I have this new evidence on film that supports authenticity. I will not use the word “proves” I have been doing this type of research on and off for 5 years. I knew someday it would get connected into Shroud Research. In the same way someone who is blind cannot see someone or be able to read by sight, they can read by touch. Receive info using a different method. This type of communication is reliant upon the Sender controlling the number of times an electrical signal oscillates in one second into specific number sequences that “spell a word” Because we cannot see something does not mean it is not there. But we can measure it on a scientific instrument and prove that the “unseen thing” does indeed exist and is a genuine demonstrated reality. Presence of the Spirit of God can take form of electricity and that electric presence will have a AC voltage and Hz Frequency that can be detected and measured on a scientific instrument, only if The Spirit of God allows that to happen. The Spirit of God allowed this to happen 2 nights ago. Rare gift meant to be shared with others. That is why I am sharing this to you. Some of your posts have gotten the attention of the higher authorities in the Kingdom of Heaven. A different kind of payment for some of the work you have done. A sensation of genuine Joy granted to another. All part of the fun of Shroud research. Ask and you shall receive does work, sometimes the answer that comes back is “No” but that is still an answer. In the case of this footage, We got a “Yes” The Resurrection is Real. Shroud is evidence of it..","date":"2015-03-28","mins":"3:07 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195219","author":"dave_hines","post":"Lonely Planet Best in Travel 2011 named Wellington as fourth in its Top 10 Cities to Visit in 2011, referring to it as the “coolest little capital in the world” Wow, must be nice out there on your own big private island. Actually the views on the channel are increasing all the time, it is more like 900 views a day now, 25,000 in the last 28 days. I am in the process of updating videos and deleting others. “there are higher priorities to consider and even a higher truth” Exactly right. I aspire to be in closer contact with that “Higher Truth” That is the purpose of my ELF Research. To establish a clear communication and receive info from that source with zero distortion so I can know exactly what those priorities are and what that Higher Truth is. I know what that is in regards to the Shroud, but to prove that beyond a reasonable doubt is challenging to say the least. I got the Devil on the other side casting one seed of doubt after another. Never underestimate the power of the dark side of the force. Cunning, baffling and powerful..","date":"2015-04-02","mins":"11:06 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192716","author":"dave_hines","post":"FINDING WORDS OF JESUS IN REGARDS TO THE 1988 RADIO CARBON DATING 36 Luke 5:36 39 “No one tears a piece out of a new garment to patch an old one. Otherwise, they will have torn the new garment, and the patch from the new will not match the old” Fact: 1988 Samples Failed the Chi Value Square Test (X Squared Test) The Chi Value Square Test will reveal if there is an inconsistency and or tampering of the sample group. Max Limit Set by British Museum was set 5.99 Samples tested out at 8.56 Way Over The Limit! To further confuse the debate there are those that will argue the 8.56 figure in not right, and that the samples failed the X squared test by a smaller margin, but they still FAILED. That’s it, it’ over. That means you have to start over again with a new sample group and re do the carbon date test over again. It really is that simple. That is why the British Museum chose the X squared test, because it is the acid test to know if the results could be trusted as being 95% accurate or not. Results should never have been published in the 1st place. . Based on that alone the carbon dating results would be ruled admissible evidence by any ruling authority in a court of law as evidence. If a forensic detective collected 3 blood samples off The Shroud and one came back as being type O, another type AB and another Type B………..STOP THERE Need more be explained? The matter of the authenticity of The Shroud belongs in a higher court type setting, where a judge or ruling authority decides what can be presented and what cannot presented as evidence. The carbon dating results would never be allowed as admissible evidence. In the same way some of things the pro authenticity side is presenting would not be admissible as evidence. . The sword would cut both ways. Question: Does the forensic evidence agree with the X squared test? Was there an inconsistency in the sample group? According to Ray Rodgers there was. FACT: Shroud of Turin is a pure linen garment and does NOT contain cotton FACT: 1988 Samples contained cotton intertwined with pure linen fabric FACT Shroud of Turin is a pure linen fabric and does NOT contain any dyes FACT: 1988 Samples contained dyes in the fabric FACT: Shroud of Turin fabric does NOT contain any vanillin FACT 1988 Samples contained vanillin indicating a midcentury age. 3 MAJOR DIFFERENCES. FINDING WORDS OF JESUS “No one tears a piece out of a new garment to patch an old one. Otherwise, they will have torn the new garment, and the patch from the new will not match the old” Forensic Evidence and Scripture are in agreement..","date":"2015-03-07","mins":"3:44 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192731","author":"dave_hines","post":"Hello OK. It is nearly complete. What caught my eye and delayed me from uploading it, was when I noticed how the Manoppello image had lower set eyebrows that matched the 1898 version of The Shroud, with color correction. Most (if not all) the early frescoes replicate the owl like eyes and the “falsely perceived” high set eyebrows. The Manoppello image does not do that. If one was to argue this was made by men in the mid centuries what was used as a role model? Because they surely did not use the negative Shroud Image on linen otherwise they would have copied the owl like eyes and the high set eyebrows, like everyone did. How did they get such a perfect match without having the 1898 version to use as a role model? If the Pantocrator really has 180 points of congruency, then the Manoppello image has more. It is a better match. However looking at the 2, they look completely unrelated. The Manoppello image looks like a painting, it does not look authentic, yet could very well be authentic, I believe it is possible the cloth did make contact with Jesus and color was added by someone after. How that was done? I don’t know. But it looks that way. Contact image with color added later. Part Original, Part Not Original. Because of this, the video requires narration along with the images and I need more knowledge of it’s history before I can present it. I must have a more complete understanding of the image and it’s history before I present it. I know I have a few hundred hours alone into it, just looking at the images overlaid together. I need more time. I need the aid of a “Higher Power Intelligence” before I can complete it. Hopefully soon..","date":"2015-03-07","mins":"6:18 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192728","author":"dave_hines","post":"Hi Russ, I performed an X Squared Test on my own post and found an inconsistency. Unfortunately my post was published with an error just like the results of the 1988 Radio Carbon Dating. I wrote. “Based on that alone the carbon dating results would be ruled admissible evidence by any ruling authority in a court of law” Hello there………… Correction: “Based on that alone the carbon dating results would be ruled INADMISSIBLE EVIDENCE by any ruling authority in a court of law” I apologize for making the error. The X squared test caught my error. I have now corrected it. Now the British Museum needs to do the same thing. I am leading by example. They made a mistake. We all make mistakes. We can forgive and forget. Be Understanding. It is important that we recognize our mistakes and make corrections as soon as possible. The 1988 samples did not pass the X Squared Test. (Chi Value Square Test) That is not a minor issue, it is a major problem. If it happens in a clinical trial, the drug company doing the testing MUST start over again with a new sample group, no exceptions. To get FDA approval on a drug, drug being tested must pass the X squared test. If not, they will not get FDA approval. In the same way the results of the 1988 Radio Carbon Dating should never have been approved or published as being 95% accurate. Knowing these facts how could anyone in their right mind still stand up and defend the carbon dating as being accurate? Apparently they must not be aware of how important a Chi Value Square Test is. The public needs to be more educated in this regard. I blame myself for not having a video that explains this in simple terms so that everyone can clearly understand. God willing I will have one made very soon. Good luck with the ongoing “The Shroud Encounter US Tour”.","date":"2015-03-07","mins":"5:21 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193331","author":"dave_hines","post":"Good Video..","date":"2015-03-13","mins":"11:39 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193166","author":"dave_hines","post":"Thanks OK. This is going into my files for review..","date":"2015-03-11","mins":"10:23 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193261","author":"dave_hines","post":"Thanks for responding. Imagine if a team of researchers spent over 5 years planning to take blood samples from 7 different areas of the Shroud and then when the big moment finally arrived to obtain the 7 samples they took only 1 instead?! Then that same sample was sent to 3 labs and the results came back with inconsistencies? 3 different blood types? Would anyone question the results? Would anyone question their competence? That is a bit of a exaggerated comparison analogy to the 1988 Radio Carbon Dating, hopefully you can think of a better one, that is why you are so badly needed on this Shroud Blog Site. We all love your comments! 1.”We decided not to take samples from 7 different areas as planned, one is good enough” 2.”We are 95% confident the 1 sample represents the other 400 blood stains on Shroud” 3.”We know we spent over 5 years planning to take 7 different blood samples but we decided one would be good enough, besides all those blood stains look the same” Would someone wanting to determine the age of a classic auto examine only the corner tail light and no other part of the vehicle?! None of the laboratories reported contamination… 1.”Oxford thank P.H.South (Precision Processes Textiles) Ltd, Derby, for examining and identifying the cotton found on the Shroud sample” 2. Prof. Hall noticed two or three strange fibers looking like human hair, they were magnified 200 times and identified as COTTON. Possibly of Egyptian origin and quite OLD 3. Dr.Garza Valdes, a microbiologist and archaeologist, examined in 1993, with the help of Prof.Riggi, a (non official) Shroud sample and said : “As soon as I looked at a segment in the microscope I knew that it was heavily contaminated.” Main Body of Shroud fabric is pure linen and does not contain cotton. Weight of 3 Shroud Samples After They Were Cut 1. 52.8 mg 2. 52 mg 3. 53.7 mg Weight of Samples Recorded By Labs When Received 1. Arizona 52.8 mg 2. Zurich 52,8 mg 3. Oxford 50.0 mg 1.Chi Value Square Test will reveal if there is an inconsistency and or tampering of the sample group. 2 Ray Rodgers stated there were cotton fibers intermixed with the pure linen, 3.His research is in agreement with the Chi Value Square Test results and statements made by others..","date":"2015-03-13","mins":"1:39 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193564","author":"dave_hines","post":"Hello Mr. Kelly Kearse: There is very little drift in doing the overlay of the Manoppello Image over the positive Shroud Image. That is even a bit of understatement. Almost a dead on match. I flipped the Manoppello image horizontally and overlaid it both ways. There is one way where it matches better in my opinion for whatever that is worth. I took 15 second frames of each image and then slowly bleed them in together so the effect of the 2 images coming together can be seen slowly When the Manoppello cloth is seen from back side rights and lefts are reversed. I’ve seen it displayed both ways. A subtle difference, not major When overlaying The Manoppello on the Shroud image that is on linen, that is where there is drift, because the image on linen gives a false impression that there are high set eyebrows. All the frescoes copy this style. The Manoppello image does not. There is what appears as drift in overlaying the 2 shroud images together because of the color reversal. I put those together as well, horizontally flipping the images so they match. Very interesting to see slow color reversal on Shroud images. I did a Prince Charles overlay and that was completely off. Major drift. It is not even worth talking about it was so bad..","date":"2015-03-16","mins":"11:54 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193567","author":"dave_hines","post":"Hi OK, since this is a carbon dating discussion I will make a quick comment in that regard and then talk about what you are more interested in. Would a team of researchers take 1 pollen sample of the corner of the Shroud and then post in headlines to the world the origin of the fabric based on that? “That’s it, were done with that part of the research, case closed” Or take one blood sample off the corner of The Shroud and based on that alone make a determination as to whether the blood on the Shroud was genuine or not? “No, we don’t need to test any of the other 400 blood stains, one is good enough” When you have time could you please take a second look at the 2 images. 1. Position of eyes on Shroud. One is lower, one is higher 2. Swelling of right cheek 3. Curve of nose (moves right to left when horizontally flipped) Those aspects must match, there is less drift when the “M” image is flipped the other way. I flipped the Manoppello Image horizontally and put the 2 together both ways and have examined them as closely as I can. Only one way is correct. Rights & lefts are reversed when M image is seen from back side. One is nearly a mirror image except for the hair at the top and one is the true image. This is normally a very simple thing to do, to make sure right side is matching right side and left to left. With these images it not so simple. To the average person they would not see any difference at all, between the 2 regardless of which image is overlaid. They are close. I believe the way they should be lined up is with the Manoppello image flipped horizontally. I used the photo I got from Barrie to do the overlay. Take a second or possibly a 100th look, do you think it is possible that the correct overlay is with the “M” image flipped the other way? I am certain your knowledge is superior to mine. But every time I examine it, I see it matching better the other way. I prefer to be in agreement with you, not the other way, What is the prime focal match point? Eyes, nose, swelling of right cheek? Those are things I am looking at to determine the correct overlay. Either way, they match up extremely well..","date":"2015-03-17","mins":"12:40 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194205","author":"dave_hines","post":"Hello Mr. Kearse: Do the front & back images of the veil superimpose/overlay precisely or is there some drift? Here is a way to see for yourself up close and personal. I did a overlay. I suggest putting it up on a big screen so you can see it in the best quality. No one can accuse me of manipulating evidence in this, because I did a fair, honest, straightforward overlay. Aspect ratio of the image used were not altered in any way. I used what I believe are the top 3 images in the world that match to the face of Man in Shroud. I have heard it said how any face can be put in here and it match just as well. It is flat out not true. That is why I did a slow motion overlay so any drift can be seen and I went in and did close up shots. Some of things being replicated are forked beards, crooked noses, high eyebrows and owl eyes. Bizarre match points that go beyond coincidence. What is really amazing that I did not notice before was my overlay with the Pantocrator, look at the circles around the eyes the artist adds. Real interesting. Note how they match the negative image. Whenever the Pantocrator is overlayed the same mistake is always made. 1. Using the positive image The artist used the negative image as a role model to do the fresco, not the positive. There is a BIG difference between the 2. Especially where the eyebrows are placed and how the eyes are placed. The color reversal changes the look of the face. I saw the Pantocrator image overlayed with the Shroud negative image for the 1st time. I was amazed how well it fell into place. I never really thought much of it until recently. Look at the circles around the eyes that are illustrated. Look how they match to the negative image. The artist saw the version with the “falsely perceived” high eye brows and the big white spots for eyes. He replicates them in the fresco. Look at it closely. There is absolutely no doubt in my mind the Shroud was the role model for this. That takes out the carbon dating. The Manoppello image as well is a incredible match. There is discussion about the #3 bloodstain after viewing the overlays. You will likely not want to discuss that. I think it is better left not discussed, this was a post in regards to carbon dating, not blood stain messages or lack there of on the Shroud. I do not normally get into looking for messages in the Shroud type research..","date":"2015-03-23","mins":"10:39 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193173","author":"dave_hines","post":"If a drug company seeking FDA approval were required to have 7 subjects undergo a clinical trial and then the drug company just decided on their own to only test 3 people. They would never get FDA Approval. Apparently strict guidelines and testing rules don’t apply The Shroud. New drugs on the market are more important?!. Alrighty then. It is much easier to get favorable results from a Chi Value Square test with a smaller sample group. Much easier. I believe that was the thinking behind using 3 samples instead of 7. In the case of the 1988 Radio Carbon Dating, they could not even pass a Chi Value Square test with a very small sample group?! 3 in this case. It is a huge red flag. British Museum chose the Chi Value Square test as the deciding factor for whether or not the results could be published and be 95% accurate. The Samples did not pass the Chi Square Value Test. My question is why were they allowed to publish the results in the 1st place?! This would be not unlike a piece of equipment failing a critical safety test but then just go ahead and sell it on the market anyway. “No big deal, no one will find out” If this was a drug company and they failed such a simple test and then still went to the FDA and asked “Can we still get approval for our drug even though we failed the X squared test? The FDA would think the drug company was completely insane. NO, would be the answer, go back and start over. 7 samples, like agreed and the sample group must pass the Chi Value Square Test. If not, don’t publish the results. It means there is something wrong. Ray Rodgers work only confirmed what the Chi Value Square test results revealed all the way back to the 1988. Inconsistency and or tampering occurred within the sample group. Jesus said, “let your yes be yes and let your no, be no. Any thing other than this shows something is wrong and comes from the evil one” Sample failed critical test. NO, results not acceptable. Start over. There is no in between..","date":"2015-03-11","mins":"11:11 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193930","author":"dave_hines","post":"Hi OK, Your placement is correct. Overlay film is nearly done. Stunning match. When the Manoppello image is displayed and photos are taken, sometimes they are displaying the back side of cloth with rights and lefts reversed. Just like The Shroud, some photos are the mirror image and others the true image. I did not know Manoppello Image was a double sided image when I started this, Mirror image on one side and the true image on the other. That caused delays and confusion. I did the overlay both ways. Slow motion fades and zooms. Fined tune match. Margin of error 1 or 2 millimeters right or left, up or down at the most. If it is off at all. Near Perfect. I compared it with the Pantocrator and another. 3 overlays in total..","date":"2015-03-21","mins":"1:28 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194206","author":"dave_hines","post":"Hi OK,https://www.youtube.com/watch?v=tl YL Sxlt DFQ This is by no means my last video on the subject of the Manoppello Image. I could have gone even deeper into some of the detail match points, used slower zooms and fades in different areas. It is a “take or leave it type video” Some people will like it, others will not. God Bless em all..","date":"2015-03-23","mins":"10:45 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194328","author":"dave_hines","post":"Hi OK, it would have been so much better had you been there with me putting it together on the video editing screen. To do the final adjustments. Where the forehead starts on the Shroud is a little vague. That posed a problem for me. I made my best estimate. I would have benefited by having a forensic pathologist to consult with, or a forensic scientist specializing in facial imprints to assist in the editing process. It is very close, but not likely a perfect overly. We’ll do better next time. I’ll take a look again and review all the work you have done and study where you have lines drawn. I’ll look at it again. A lot of Shroud research involves repetition, going over the same thing, again and again. Repetition is the mother of skill. It is all part of the fun and excitement of Shroud research..","date":"2015-03-25","mins":"12:28 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"}]
