[{"id":"comment-126690","author":"dave_hines","post":"Here we go again. Someone talking imprint. In a comparison analogy this would be the equivalent of a new detective hired to shed new light on a unsolved murder case going back and re questioning a suspect that was eliminated as being possible of committing the crime. Despite being told with unmistakeable clarity that this suspect has already been questioned by 100’s of other detectives and each time he is eliminated, the new detective gets the idea in his head that somehow “this guy did it’ Perhaps a even better comparison analogy, is that of a person in a mental institution that keeps banging their head against a wall all day, but if Joseph Accetta wants to bang his head against a wall, let him do it. The closest imitation done of The Shroud Image (a very small fragment of it, not a complete image)actually involves using high frequency, short wave bursts of microscopic lasers. We can logically conclude that The Shroud image was formed in this manner. Now Russ B’s theory of Jesus being the light source that formed Shroud image has solid ground in what are not widely known but established scientific facts. 1973, Miller, Webb and Dickson described DNA as a holographic projector (see “Embroyonic Holography”). In other words, genes encode and express themselves via light and radio waves, or acoustical holography (see “Quantum Bioholography”, Miller, Miller and Webb, JNLRMI , 2002). Delocalized interference patterns create calibration fields (blueprints) for our bodies’ space time organization. The system works as a biocomputer — a wave biocomputer. DNA can also function as a gel like liquid crystal, emitting a weak laser like light that can be converted into an electro acoustic signal. “Our body is a walking crystal. We can receive, we can transmit and we can store electro magnetic energy.” – Dr Norman Shealy, American Holistic Research Physician and Neurosurgeon. The only lasers that can could create a image that would be less than the thickness of a human hair such as seen on the Shroud are Liquid Crystal Lasers, the chiral liquid crystal provides sufficient feedback to generate lasing within a device of thicknesses less than a human hair. Coincidence: Human DNA is made up of a gel like liquid crystal that can emit microscopic laser light. That is a fact, that is not speculation. I am convinced that if the gel like liquid crystal DNA in the human body was exposed to a fine point, minimum 4 decimal point accuracy electro magnetic field it will fire off a microscopic laser light capable of producing the Shroud image. Not sound or radio, but magnetic that would cause the DNA to oscillate and react by emitting light. Bottom Line: Russ B’s Image Formation theory is correct, “Jesus was lit up like a Christmas Tree” That is the only remaining possibility. The only suspect that cannot be eliminated. And no matter improbable that may seem, it must be the Truth. May that set us ALL FREE!.","date":"2014-06-04","mins":"3:12 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-127037","author":"dave_hines","post":"I see The Shroud of Turin investigation being first and foremost a wrongful death case, a unsolved murder. I think it is important not to lose sight of the fact (or evidence that strongly suggests) that a brutal and sadistic murder took place. We want to give a name to the person who was wrapped in that Shroud. Out of respect for him and to do a thorough investigation. I believe the Spirit of God has given us all the evidence we need to be able to make these determinations, we just need to put it all together. When I hear 14th century printing, I think Walter Mc Crone, When I hear that someone from STURP is going to present evidence of the Shroud being a print from 14th century, I am shocked, in the same way if I read Barrie S. Was going to give a presentation of a similar nature. I thought at the very least we were at a point in the investigation where we could all agree that the Shroud was in existence in the 7th century. Alright, so I am wrong on that. One of the focal points of the investigation should be in determining what the calculated odds that all the match points between the Sudarium and The Shroud are coincidental and do not come from the same person. What is that number? We should know it. I blame myself for not having it available to post here. It shows my own investigation has not been conducted thoroughly (Shame on me) I suspect that it is one in several million, but I am not qualified to quote the odds of probability and chance on that. But it looks something like this. Match Points 1. Type AB Blood 2. Blood degraded to the point on both cloths where rh factor cannot be determined. (That is actually a match point) 3. Both contain post mortem blood & fresh blood 4. Both cloths contain pulmonary edema fluid 5. Both contain pollens that only bloom at time of passover 7. Absence of clotted blood on both 8. Elevated levels of bilirubini on both 9. Fabric on both is same thickness, same threads per surface unit. 10. 120 points of head on Sudarium, match head area of Shroud 11. Nose of the man on both cloths is 8cm 12. Identical form of chin on both heads (A revised list that everyone can agree on would have to made, this is a sample/example list only) We need to approach it from a purely mathematical standpoint. Neither adding or taking anything away & calculate the odds of probability and chance that all the match points are a coincidence and do not come from the same person and for the time being leave the name of “Jesus” out of the equation entirely. EXAMPLE; The calculated odds that all the match points between the person whose head made contact with the Sudarium and the person whose head made contact with the Shroud are coincidental and are NOT from the same person are 1 in 1 million or 1 in. What is the number? When we know that number we should be able to draw a logical conclusion, one that we can all be certain of beyond any reasonable doubt. I think everyone here already knows deep down inside the conclusion that would be determined after seeing that math. The problem is being able to agree on what are established facts in the case file. Even going back to my opening statement. If we cannot even agree that a wrongful death took place there is no point in even continuing. That has be determined and agreed upon 1st and foremost before anything else. I thought that was done. Likely I am wrong again. How convinced is the scientific community of the conclusions drawn by the Spanish Center For Sindonology? FACT: The Sudarium of Oviedo was in existence in the 7th century. . FACT: Spanish Government believed the cloth to be authentic, and was the property of Jesus of Nazareth. Are those 2 things we could all agree on? Bottom Line: I think the Shroud investigation should at least be narrowed down to a 7th century event that took place, not a 14th century event..","date":"2014-06-05","mins":"10:10 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-127076","author":"dave_hines","post":"Hi Hugh, I thought I would add the list of the 7 properties that make up the micro thin layer of sugars/starch fractions that Ray Rodgers wrote in his peer reviewed journal. 1. Glucose 2. Fucose 3. Galactose 4. Arabinose 5. Xylose 6. Rhamnose 7. Gluceronic Acid Coincidentally these are all properties of myrrh resin. Myrrh is over 50% glucose and is made up of mostly sugars including all of the ones that are listed here & gluceronic acid. Myrrh also contains acetic acid, that was also found on Shroud fibers. For whatever it is worth it is of my opinion that this is the remnant of the myrrh resin used by Nicodemus that we are seeing. The color is practically a dead on match to myrrh resin. I wrapped a 3 D Sculpture of Jesus in a pure linen fabric coated with myrrh resin for 3 days just to see what would happen to the cloth. (it formed a extremely accurate 3 D mold) It was actually a bit shocked when I removed the linen from the sculpture. Myrrh resin hardens, it ended up like a linen statue. (the linen softens and flattens over time, I did this almost 3 years ago) Anyways not to get to far off track but it is of my belief that Nicodemus purchased the excessive myrrh resin to treat the scourge wounds of Jesus, thinking he would be scourged and released. Not thinking or purchasing it to be used for burial. But it ended up being used that way. Prisoners are not normally scourged and crucified, Nicodemus did not foresee the later happening. (my theory/speculation) Myrrh resin also has chemical properties similar to that of cellulose acetate which was used to coat early film plates. It is of my opinion only, that this is the reason why the cloth and the blood stains have been preserved as well as it has, considering the age of the Shroud. (preserved in myrrh) Also I believe the elevated levels of bilirubin in the blood are a contributing factor for why the blood retains the red color. The scripture account and forensic evidence match up in this case. And there came also Nicodemus who 1st came to Jesus by night and brought a mixture of myrrh and aloes about a 100 lb weight, then they took the body of Jesus and wound it in the linen cloth with the spices. Side note:Myrrh resin does not taste very good although it can be ingested(It’s bitter tasting).","date":"2014-06-05","mins":"1:55 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-127092","author":"dave_hines","post":"Good Afternoon Hugh: Did you see my myrrh resin theory I posted? I forgot to add myrrh was also used in war to cover battle wounds, used as an antiseptic (the Man In The Shroud had over 120 wounds to treat) It was also used in purification rites, It supports my theory. There are different grades of myrrh. One was called Kataf, from Arabia used in ancient time, a fine grade, that is almost a clear color. It was also called “Stacte Myrrh) This is what I believe Nicodemus used on Jesus. (And he was buried with the rich at death) I am actually in the process of leaving the US right now. I have to be at the airport pretty soon. We’ll have to pick off where we left some other time. In the meantime may the spirit of good fortune, good health and good cheer be with you. PEACE.","date":"2014-06-05","mins":"2:39 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-126920","author":"dave_hines","post":"Hi colinsberry, I am nobody from nowhere. I have no credentials. So not a single person is going to take what I say with any degree of seriousness on this discussion. I was under the mistaken impression that people on this blog believed The Shroud of Turin to be authentic. My huge mistake on that. Like an idiot I thought I was going to make some friends on this site and be able to talk about The Shroud of Turin without being attacked. That was my 2nd huge mistake. When I hear someone is going to get up and make a presentation and present evidence The Shroud is the result of printing from the 14th century, I am out of here. I am not making a 3rd mistake by continuing to talk about it I am sorry I took up the space I did on this subject and for the time you had to take just to ready my stupid comment. It will not happen again. I know where the exit door is..","date":"2014-06-04","mins":"11:11 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-126827","author":"dave_hines","post":"Hi Hugh, thanks for replying to my post, this is a article I was reading I thought I would share with you, it is related to the subject matter of a human cell emitting a laser beam. “Scientists have for the first time created laser light using living biological material: a single human cell and some jellyfish protein. “Lasers started from physics and are viewed as engineering devices,” says Seok Hyun Yun, an optical physicist at Harvard Medical School and Massachusetts General Hospital in Boston, who created the ‘living laser’ with his colleague Malte Gather. “This is the first time that we have used biological materials to build a laser and generate light from something that is living.” The finding is reported today in Nature Photonics 1. Building a laser requires two things: a lasing material that amplifies light from an external source (a ‘gain medium’) and an arrangement of mirrors (an ‘optical cavity’), which concentrates and aligns the light waves into a tight beam. Until now, the gain medium has only been made from non biological substances such as doped crystals, semiconductors or gases, but in this case the researchers used enhanced green fluorescent protein (GFP) — the substance that makes jellyfish bioluminescent, which is used extensively in cell biology to label cells. The team engineered human embryonic kidney cells to produce GFP, then placed a single cell between two mirrors to make an optical cavity just 20 micrometres across. When they fed the cell pulses of blue light, it emitted a directional laser beam visible with the naked eye — and the cell wasn’t harmed. The width of the laser beam is “tiny” and “fairly weak” in its brightness compared to traditional lasers, says Yun, but “an order of magnitude” brighter than natural jellyfish fluorescence, with a “beautiful green” colour. I believe this type of research is the direction we need to be headed in to learn more about the Shroud image, not to go back into the dark ages and the stone knife and bearskin thinking of The Shroud image being a result of paint, pigment or imprint, add camera obscura to that as well. I am not by any means any kind of expert in microscopic laser technology, but I am fast learner. My area of research before getting involved with the Shroud of Turin was in ELF waves and ELF technology. I still do field research in this area and I am in fact getting ready to fly overseas to get started again. When I have something more solid on video tape I will show it to you. Like you, I am a person who believes physical evidence is a critical part of a convincing presentation. I agree, we need more physical evidence that would demonstrate how a human cell is capable of emitting a microscopic laser that we could observe, measure and compare with Shroud image & to get it on film and show it. I am working on producing that. When I get it I will be in touch again. PEACE.","date":"2014-06-04","mins":"3:25 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"}]
