[{"id":"comment-207936","author":"dave_hines","post":"I was doing some research on the Image of Edessa last night and I typed in a phrase on a Gematria calculator. “The Magical Image Of Edessa” It equals 1128 Right after I posted it on my own channel I saw this new Shroud Blog post in my email and it made reference to the Image of Edessa as being used as a magical charm. I thought, “that’s a odd coincidence, I just got through writing that” Shroud of Turin = 1128 Jesus of Nazareth =1128 Behold The Image of Edessa=1128 The Magical Image of Edessa=1128 Here is a few more I found, they just keep coming. Jesus inside a grave= 1128 Called My Beloved Son =1128 Holographic icon image=1128 Cloth Image Of Jesus=1128 The Son of Man Bleeding=1128 Named Redeemer from God=1128 Called Lord of Hosts=1128 (These words/phrases are all directly and obviously related to Jesus and the Shroud of Turin/Image of Edessa) I challenged anyone in the world to take the name of any famous person, place or thing and find at least 12 things relating to that person, place or thing that all equal the same number. Not one person has been able to do it. With Jesus and the Shroud of Turin, we have over 50 phrases and words that are directly related to The Shroud of Turin and Jesus. Not vague matches. Direct association. Direct in a way that when you the type in the word or phrase on google you come to the Shroud of Turin or Jesus or both. Surely there is another famous person, place or thing that has a rich source of many different phrases and words to choose from that relate to that person, place or thing where one could easily get 12 things relating to it that all equal the same number on a Gematria calculator. So far, not one person has been able to do it. The only exceptions being Satan and things relating to him at 666. And Jesus at 888. Until that has been done. My evidence cannot be written off as coincidence. The acid test to know if 2 words or phrases are truly related, when typed in on a google search they will go directly to that person, place or thing. Not vague matches, direct matches..","date":"2015-08-11","mins":"1:15 am","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-208008","author":"dave_hines","post":"Sorry Dan, did not mean for that. Daveb of Wellington already said everything that was on my mind on the subject. Carry on Shroud Researchers!.","date":"2015-08-11","mins":"10:51 pm","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-144684","author":"dave_hines","post":"Hi Hugh, good to hear from you. In the case of this fresco, it would be a good idea to get 7 of the top experts in this field of math science to map out the points of congruency and see if they come up with the same numbers. Preferably researchers who could care less whether the Shroud is genuine or not. People that just love doing accurate math. That being accomplished it would then be necessary to calculate the odds of probability and chance that the Shroud was not used as a role model for the image. That is my idea anyway. Yes, 7 different experts not just 1 person, but 7. Just like they were supposed to do with the Shroud samples, take 7 samples from 7 different areas. Instead they took only 1 sample and cut it into 3 pieces. Let’s not make that mistake with the tests done to establish a accurate number of congruency points on this Fresco to The Shroud Image. That way we can show to the world that we can learn from our mistakes. How was your trip? What country do you live in?.","date":"2014-08-19","mins":"3:02 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144690","author":"dave_hines","post":"Hi, I am not a expert in Math Science or qualified to accurately calculate the number of congruency points between 2 images. But I read that facial images are polytypic or complex in structure, and the forensic criteria for declaring two facial images to be the same is 45 to 60 points of congruence. The detail and the points of congruence would depend both on the skill of the artist as well as whether he was working directly from the Shroud image or from copies of varying degrees of accuracy. Control studies with both actual faces and various unrelated art works were typically found to have 10 to 35 points of congruence which is statistically and forensically insignificant. 150 points matching is significant, if the number is correct. How hard can it be to verify that? We do have both images intact still..","date":"2014-08-19","mins":"3:31 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144315","author":"dave_hines","post":"Good Evening Mr. Charles Freeman: There is a fresco believed to be from 1st or 2nd century found in the Callistus Catacombs that I wanted you to see. I do not know how to post a photo on this site so I posted 4 of the photos on facebook. Starting with The Shroud, the image as it appears on the linen, (not the positive image) then slowly blending the fresco into the Shroud and then the fresco by itself. I did not alter any of the images, only blended them together using Sony Vegas Editing Video Editing software. Https://www.facebook.com/robert.page.5688/photos Feel free to copy and paste the photo link above to see some visual “evidence” I own a vacation rental property so you’ll see photos of my house in Costa Rica and some pictures of me, Of course you don’t have to look at those. (Anyone on this blog site is free to look at these photos of Jesus as well) This is something that was written about the fresco that I copied and pasted. I don’t know how reliable the source is. The Callistus Fresco The Callistus Fresco is an Image of Jesus whose authenticity is qualified by its Source and history. The artist of the beautiful fresco of the Face of Jesus found in the Callistus Catacomb is anonymous, but it is logical to assume that someone who had seen Jesus painted it, maybe a close disciple of His, as only the early Christines gathered in the Catacombs. The Fresco not only resembles the likeness of Jesus on the two known Relics that have an imprint of His Image and His only known Real Photo, but it has 150 PC with the imprint on cloth of the Face of Jesus on the Holy Shroud of Turin. Besides being a magnificent art piece, the ‘Callistus Fresco’ is the first and most ancient portrait known of Jesus the Christ. It is believed to be of the first century as Pope Urban II is shown in the painting looking intently at the face of the Christ. Pope Urban II reigned from 222 230 AD Anyone on this blog site is free to look at these photos as well..","date":"2014-08-17","mins":"2:57 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144151","author":"dave_hines","post":"Hello again Mr. Charles Freeman Additional comment on old textiles and why I think The Shroud fabric remains in good condition despite it’s age. Because it has a micro thin layer of myrrh and aloes on it. Myrrh is like tree sap with similar chemical properties to that of cellulose acetate, that would help preserve the linen. These are some comparative notes I wrote on the subject. COMBINED CHEMICAL PROPERTIES OF STARCH FRACTIONS & PECTIN IN COMPARISON TO MYRRH AND ALOES AS MENTIONED IN THE GOSPEL These substances (Starch fractions & Pectin) were found to make up the micro thin layer where the image of The Shroud of Turin Resides. (By Ray Rodgers) Let’s begin by defining what starch & pectin is made up & see if the chemical properties match up with “the 100lb weight of myrrh and aloes” as mentioned in the Gospel of John. Amylose was found on the Shroud of Turin (by Ray Rodgers) and is a spiral polymer made up of D glucose units. It is the main component which makes up starch. Starch and cellulose are polymers derived from the dehydration of D glucose. Starch is a polysaccharide (meaning “many sugars”) made up of glucose units linked together to form long chains. The main component of Pectin is D Galacturonic acid, which is a sugar acid, an oxidized form of D Galactose. Pectin is a polysaccharide of 1 – 4 linked polygalacturonic acid with intra chain Rhamnose insertion, neutral sugar side chains and methyl esterification from many of the rhamnose residues, side chains of various neutral sugars branch off. The neutral sugars are mainly D Galactose, L Arabinose and D Xylose, PECTIN is also a uronic acid, Naturally occurring uronic acids are D glucuronic acid, D galacturonic acid. Let’s make a simplified list of what Starch and Pectin are made up of. 1.Uronic Acids 2.D Gluceronic Acid & D Galacturonic acid. 3.Polygalacturonic acid (An oxidized form of D Galactose) 4.Glucose 5. L Arabinose 6.D Xylose 7.Rhamnose NOW LET’S TAKE A LOOK AT THE CHEMICAL PROPERTIES OF MYRRH AND ALOES IN COMPARISON TO STARCH AND PECTIN Myrrh resin contains D Galactose and L Arabinose, Xylose and 4>0 methyl D Gluceronic acid From the resin yields Uronic Acid 19% D Galactose 60% L Arabinose 10% and L Rhamnose 5% Many of the health benefits associated with Aloe vera have been attributed to the polysaccharides contained in the gel of the leaves. A variety of polysaccharides are present in the cell wall matrix. An overall carbohydrate analysis showed that the cell walls of the aloe leaf hold mainly polysaccharides, cellulose and pectic polysaccharides whereas the skin of the leaf contains in addition significant quantities of xylose containing polysaccharides Aloes contain cellulose and hemicellulose and store carbohydrates. Saccharides in aloes are, Mannose, Glucose, L Rhamnose, Aldopentose THE PRIMARY POLYSACCHARIDE IN ALOES IS A PECTIC SUBSTANCE. MYRRH & ALOES STARCH & PECTIN 1. Uronic Acids 1. Uronic Acids 2. D Gluceronic Acid & D Galacturonic acid. 2. SAME 3. D Galactose 3. Oxidized D Galactose 4. Glucose 4. Glucose 5. L Arabinose 5. L Arabinose 6. D Xylose 6. D Xylose 7. L Rhamnose 7. L Rhamnose Dr. Baima Bollone a professor of forensic medicine in Turin claimed to have found myrrh and aloes in the BLOOD by antibody antigen testing. ( A good way to test for it) Of course Myrrh resin also contains many volatile oils and other chemical properties such as (limonene, eugenol, pinene, terpenes, sesquiterpenes, esters, cinnamaldehyde, cuminaldehyde, cumic alcohol, heerabolene, dipentene, m cresol and cadinene), resins (myrrhin, alpha , beta and gamma compiphoric acids, commiphorinic acid, alpha and beta heerabomyrrhols, heeraboresene, commiferin, campesterol, beta sitosterol, alpha amyrone All of which would have evaporated and no longer be present over the course of almost 2000 years with only the remnant of the sugars/carbs of the myrrh remaining. There is, on the outermost fibers of the cloth a clear washing residue: a thin coating of starch fractions and the various saccharides found in soapwort: glucose, fucose, galactose, arabinose, xylose, rhamnose, and glucuronic acid. Sugars in myrrh and aloes are the same sugars in soapwort 1.Glucose 2. Galactose 3. Arabinose 4. Xylose 5. Fucose 6. Gluceronic Acid 7. Rhamnose And there came also Nicodemus, which at the first came to Jesus by night, and brought a mixture of myrrh and aloes, about an hundred pound weight. Then they took the body of Jesus, and wound it in linen clothes with the spices. I believe one of the reasons this was done, was because the Lord wanted the fabric preserved so it would last. Myrrh would react to laser light by changing color, light yellow, medium yellow/ sepia. The color where image resides on Shroud fabric is a dead on match to myrrh resin, no one can deny that. D Galactose is a reducing sugar, the main ingredient in myrrh resin. In this way I agree with a maillard reaction but not with ammonia, with light. Laser light, in straight lines. I believe Mr. Light is responsible for The Shroud image, the other suspects are eliminated beyond any reasonable doubt, note I said reasonable. None of the other suspects possess the intelligence and the ability to encode distance information as seen on Shroud. Eliminate Mr. Paint, and Mr. Imprint and also Eliminate also Mr. Ammonia, not smart enough and he stinks. Mr. Light is the last remaining suspect who can’t be eliminated as being responsible for Shroud image. He’s the fastest and the smartest. Sorry to get off track. My apologies to everyone on this blog site for getting off the subject Charles asked about here at the end. To produce Shroud image you need to be fast and smart. Mr. Light is both. I do not normally post outside my own channel, I refuse to get into a negative argument with anyone. I am peace seeking person, not a negative arguments. Bear that in mind in responding to this. Thanks..","date":"2014-08-16","mins":"3:39 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144257","author":"dave_hines","post":"Hello Mr. Daveb of Wellington, I like the title. It fits in with the genre of other famous figures in history. Paul of Tarsus, Joseph of Arimathea, Jesus of Nazareth, Daveb of Wellington. Your right, the Paul of Tarsus passage is flimsy. We cannot even prove beyond a reasonable doubt that he is even the author. That hurts. We cannot even complete step 1. I am dropping the display from my closing argument because of that. To many clinks in the armor of the passage. Unless there is a historical record found saying “And Paul of Tarsus and Peter took the 14′ long Mandylion /Shroud and hid in the catacombs of Rome” It is my belief only, after it’s mission was completed in Rome, meaning Rome converted to Christianity, the Shroud was moved back to Edessa. (Hugh Farey would say I need to see physical evidence of that please) Just looking at the location only, (the catacombs)not saying that The Shroud was kept there. It would be a good location to hide it. 12 miles long, and 4 or 5 different levels, A big underground city. A bunch of graves and tunnels, imagine having to go in and find it, even knowing it was there. You would have to start exhuming several dozen into hundreds of bodies or looking for hidden places within walls, ect. There is what is believed to be a 1st Fresco of Jesus (perhaps as late as 3 AD) found in these catacombs, it is one of the closest matches to The Shroud I have seen. I know that does prove the authenticity of The Shroud. No one piece of evidence does. Only when all of the evidence both for and against authenticity is combined together and each small stone/piece of evidence is given a numerical value and placed on a scale can we see where it is tipping. We would need a group of experts to assign and agree upon the weight value of each piece of evidence. Both for and against. Then bring out the scale and start the process. See which way the scale tips at the end. L Ike I said previously, I enjoy reading your commentary. PEACE.","date":"2014-08-16","mins":"6:04 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144309","author":"dave_hines","post":"Hello Mr. Daveb of Wellington: Is there a way to post a photo on this site? There is a fresco I wanted to show you from the callistus catacombs. Let me know, thanks..","date":"2014-08-17","mins":"2:11 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144317","author":"dave_hines","post":"Good Evening Mr. Daveb of Wellington. Here are some photos of what is believed to be a 1st or 2nd century fresco of Jesus from the Callistus Catacombs. Https://www.facebook.com/robert.page.5688/photos I blended the face of the fresco with the Shroud image from the linen, because that is what they saw, not the positive image. Then there are photos of each separated. They are on the top page, front row. (There are also a number of photos of my vacation rental property in Costa Rica that you are free to look at if you want) This was written about the fresco. I do not know how reliable the source is. The Callistus Fresco The Callistus Fresco is an Image of Jesus whose authenticity is qualified by its Source and history. The artist of the beautiful fresco of the Face of Jesus found in the Callistus Catacomb is anonymous, but it is logical to assume that someone who had seen Jesus painted it, maybe a close disciple of His, as only the early Christines gathered in the Catacombs. The Fresco not only resembles the likeness of Jesus on the two known Relics that have an imprint of His Image and His only known Real Photo, but it has 150 PC with the imprint on cloth of the Face of Jesus on the Holy Shroud of Turin. Besides being a magnificent art piece, the ‘Callistus Fresco’ is the first and most ancient portrait known of Jesus the Christ. It is believed to be of the first century as Pope Urban II is shown in the painting looking intently at the face of the Christ. Pope Urban II reigned from 222 230 AD.","date":"2014-08-17","mins":"3:10 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144263","author":"dave_hines","post":"Good Afternoon Mr. Charles Freeman: When it comes to authenticity of The Shroud a person is either convinced or not convinced. There is no in between. Undecided is not convinced. Harboring some doubt is not convinced. The “not convinced side” compels people to go way outside their normal comfort zone and actually have to start learning something new. Shroud research makes it necessary to study art & literature, science, math, history, add infinitum to the list of different paths a person could be pursuing and where that person will eventually wind up as a result of launching a investigation in the authenticity of The Shroud. It is positively life transforming. If we did not have the “not convinced side” looking for the clink in the armor of The Shroud it would take all the fun out of Shroud research. There would be far less urgency to learn anything new. A person setting out to prove the image was man made could wind up discovering some new way of making images that could make that a person a millionaire. Or someone could find a way to change cinnabar into gold, because The Shroud forces you to have learn things about chemistry and physics, whether you want to or not. If this Shroud Blog Site was all one sided toward authenticity it would take away from the excitement, fun and joy of doing the research. To all those “not convinced” The Shroud is authentic and posting comments, thank you. I am a better man because it. There is the old saying, “Success is about the person that you become” Shroud research has made me a better person. Without the skeptics, my knowledge of The Shroud would be at least 80% less than what it is. Keep posting those challenging comments Mr. Freeman!.","date":"2014-08-16","mins":"7:04 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144155","author":"dave_hines","post":"Hello Mr. Daveb of Wellington. I normally do not post outside my own channel anymore but I felt compelled to so hear goes some wild speculation. I think of Joseph of Arimathea purchased the closest approximation to what he could find that would substitute for a burial shroud and purchased a fine linen table cloth/court hanging type linen from a merchant outside the Damascus Gate before going to see Pilate to get permission to get the body. Sometime around 3:30 PM that afternoon. I think the head cloth is also purchased at the same time the Shroud linen is obtained, then Joseph of A returns to Golgatha where the head cloth was placed over Jesus and then he goes the route back through the Damascus Gate to see Pilate. The distance between Golgatha and the Damascus Gate is a short distance. I think the time gap between leaving Golgatha, going to see Pilate and returning is about 1 hour. I think Jesus is taken down from the cross around 4:30 to 5:00 PM, sun sets between 6:30 and 7:00 PM, not much time left. Likely some kind of exchange of money between Pilate and Joseph of A. Scripture account says Joseph went boldly to Pilate, begged/craved the body of Jesus, as in “He really wanted it bad and was going to get the body of Jesus no matter what it cost” During the Passover there will be a lot of different merchants from surrounding countries coming in to sell their textiles/goods, the Damascus Gate is the main entrance to the city and the place where a merchant would have the highest probability of selling their goods. Big festival events always draws a lot of merchants selling goods, fully well knowing a lot of rich people are around with money to spend. Enter Jospeh of A. Joseph of A came upon a merchant selling linens with the right dimensions that could be used as a head cloth and burial shroud and he bought them. If there would have been a plain weave white linen available quickly, I believe he would have got that instead. The herringbone twill must have been the best option at the moment. Fabric on Shroud and head cloth are same thickness, same threads per surface unit. Evidence the same weaver was at work on both cloths. Perhaps one being a table napkin, the other a table cloth, to be used for the Passover Meal. Instead they find a greater purpose. A different kind of lamb/meat was placed on the linen fabric that the weaver could not have foreseen in his/her wildest dreams. Obviously I believe The Shroud is authentic. I am going to stop here. I enjoy reading your commentary..","date":"2014-08-16","mins":"4:34 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144136","author":"dave_hines","post":"Hello Mr. Charles Freeman: I am not a expert, but I can tell you where I believe The Shroud was kept in the early centuries but I cannot prove it. I want to note for the record immediately what I am posting is pure speculation. I would expect my theory to be ridiculed on this blog and not looked at seriously. I am not going to debate anyone on this blog about this subject. It is a speculative theory only. If I am proved wrong I have no problem standing up and saying “sorry I was wrong about that” Anyways here goes, I believe the Shroud was moved to the CALLIXTUS catacombs underneath Rome. I believe Peter himself brought it there and met with Paul of Tarsus and together they decided upon a place to store it. This is a place no one would expect it to be hidden and would be extremely difficult for enemies of the Christians to find because the catacombs go on for about 12 miles. There is a bunch of tombs down there, it would blend in perfectly with the motif. I believe there is reference to Shroud being moved to Rome in scripture and Paul of Tarsus gives Peter a code name, Carpus, because Peter was a fisherman. Carpus is Peter. In the letter he says he left a “The Shining Wrap” a “The Illuminated Shroud” with this guy and now he wants it brought to Rome Italy. He mentions Troas but I think he is referring to Constantinople or some other city so if his letter is intercepted by his enemies they will be looking for some guy in Troas named Carpus when in fact such a person does even exist. I believe the person who had this “Shining Wrap” is really Peter and he is not in Troas either, who knows what city he is really talking about. I believe at times Paul of Tarsus is anticipating some of his letters could be intercepted and is writing in codes, so that in the case his enemies intercept his letter, he is not giving valuable information out, like for example where the Mandylion/Shroud of Turin is located. He was the leader of the early christian movement, a highly intelligent person with good gift of foresightedness. Again, a lot of speculation here. Either The Shroud or another very good reproduction of it had to be in those catacombs at some point the early centuries to be able to do the frescoes. I believe The Shroud served as the role model to reproduce/ paint them. I believe this is also the reason there are microscopic traces of cinnabar and hematite on the cloth. I do not think it is out of line or crazy to believe that they must have had a good supply of cinnabar and or hematite in the tombs to be able to do all the frescoes and some traces of that organic material got onto the Shroud during the time it was in the catacombs. The red flecks Mc Crone (1980, 2000) claimed were hematite had an organic matrix (Heller 1983, Rogers 2004). It is interesting to note. That cinnabar was also used in ancient burials of high profile people, Lords and Queens and is associated with immortality and resurrection. The Maya culture believed that the color red was a symbol of death and second birth. The dead bodies had scraps of cinnabar, or red sulfide, laid on them to substitute pigment. As the color red was associated with death, corpses were sprinkled with the shavings of the red mineral cinnabar and were then wrapped in cotton for burial. They believed the person would then more easily reach the afterlife. (Sorry, that is a whole different subject) There is cinnabar on The Shroud and it possibly could have come from the catacombs or from people placing their paintings on The Shroud and even a combination of both things. I think part of the reason Rome converted to Christianity was because The Mandylion/Shroud was there. Part of the reason. Not all of it of course. Perhaps shown to groups of people at very carefully chosen times and then brought back to it’s hiding place in the tombs. I am clearly aware that this cannot be proved beyond a reasonable doubt. Not even close. Speculative theory only and some flimsy circumstantial evidence that supports, I am not the smartest guy, but not dumb enough to spend to much time on this or include it in my closing argument for authenticity. At least not yet, not without a bit more physical evidence and some scripture that supports it. There exists this possibility I am correct. My suspect is the Catacombs in Rome. We cannot eliminate my suspect. Often times the suspect who cannot be eliminated is the person responsible for the act. Perhaps we should bring my suspect in for questioning, and start probing into his past and see what we find. See if we can get a straight answer from him. Go into his cell phone records and bank accounts. Follow the money trail and see where it leads..","date":"2014-08-16","mins":"1:55 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144157","author":"dave_hines","post":"Good Evening Mr. Charles Freeman, I guess I am not the only person wrapped up in the Shroud in the middle of the night. Thanks for responding so quickly. I am going to look into this matter deeper in the manner you are suggesting. I am going to take a break now and let some other people “sound off their instruments” Hopefully some good sounding notes. I need some time to be silent/think/pray on the matter. Buenas Noches..","date":"2014-08-16","mins":"4:52 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144621","author":"dave_hines","post":"Hello Mr. Freeman: You inspired to make a video. I wanted you to see it. This happened because of our conversation on this blog site. Thanks..","date":"2014-08-18","mins":"6:35 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-120234","author":"dave_hines","post":"Good Evening Hugh Your right in that long hair is a cultural relative I am not in disagreement with that. I am in disagreement in how the word (κόμη) Paul wrote as being translated as long hair. I am correcting a error that was made in translation. That is all. :http://www.perseus.tufts.edu/hopper/definitionlookup?page=3&type=begin&target=greek&q=hair κόμη hair of the head This is one of the definitions that I studied and then I looked into other literature where the same word was used. Never was it used to describe long hair, κόμη is a dual noun which can have more than 1 meaning depending upon the sentence it is used in, it can even mean “unkempt hair” as it is used in later literature. This is a very obscure, seldom used word in connection with hair. This was another definition I copied and saved in which I cannot find the link to where it was found. (But I will find it) κόμη Fine hair, hair with comeliness With decorum, Ornament or splendor — beauty. Again, like I said the 1st clue Paul of Tarsus is not talking about long hair is in the 1st part of the passage Does not nature itself teach us that it is a shame for a man to have “long hair” κόμη What example in nature teaches us that? NONE. 1. A male lion with a long mane of hair, is that a shame? NO 2. A male horse with a long mane of hair, is that a shame? NO 3. A long flowing river, is that a shame? NO 4. Long branches on a tree, is that a shame? NO However if you decorate a lions hair with ornaments or a male horse it starts looking stupid. That is why Paul of Tarsus makes the connection with nature and artificial decoration as not belonging together. If Paul wanted to write long hair he would have used one of these words in ancient Greek that does mean long hair. Βαθυχαίτης Thick long hair ἐπικομάω To wear long hair καρηκομόωντες With hair on head, long haired κομάω To let the hair grow long κομήτης Wearing long hair μάλιον Long hair μάλιον Long hair, pig tail μακροκομέω Have long hair τανυέθειρα long haired τανύθριξ long haired, shaggy, ὑψιχαίτης long haired But he did not use those words, he used this, κόμη κόμη = Decorated/Ornamented Hair, This fits in the passage, long hair does not fit. The word is used twice in the passage. Does not nature itself teach you that if a man has (κόμη) ornamentally decorated hair it is a shame to him, but if a woman has (κόμη) ornamentally decorated hair it is a glory to her. See, how that fits. Paul of Tarsus is suggesting to the men not to come to the Church with hair that is ornamentally decorated. In his opinion it would not be appropriate/shameful. The only reason I am spending this much time on this subject is because it is brought up on my channel, over and over again. I am sick and tired of it. I get up to 1000 views a day on my Shroud videos. This is being used to plant seeds of doubt in the minds of people who are not yet decided in the authenticity of the Shroud. It is a small seed planted but it eventually grows into fear. Doubt + Uncertainty = Fear. That is what the other side is doing. This kind of misinformation spreads fear. If you are not convinced I have correctly translated this passage, launch your own personal investigation. That is what I tell people to do. The decision one makes in regards to the authenticity of The Shroud, could have eternal ramifications. That needs to be taken seriously. Sorry for such a long post. I want this cleared up once and for all. Peace and good luck to you, I am not posting to start a negative argument..","date":"2014-05-15","mins":"10:17 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-120563","author":"dave_hines","post":"Dear Mr. Hugh Farey: Thanks for replying to my comment. I am looking for the link that defined the word κόμη as “Hair with comeliness/decorum” It was an old Greek/English dictionary. I am going through my entire file on the subject. I am by no means any expert in Ancient Greek, nor qualified to translate the majority of the language in any depth, The only words I know in ancient Greek are things that pertain or have to do with The Shroud of Turin. There is another translation in the Gospel of John where another Greek word was translated as “clothes” that also could have been “cloth” It was a dual feminine noun. But I will not get into that in this post. I super appreciate the time you took to look up the word Paul of Tarsus wrote. When people work together in a positive way is when things get accomplished. Thanks for doing that. I will look for more links. Physical evidence..","date":"2014-05-16","mins":"5:36 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-120663","author":"dave_hines","post":"I really enjoy your reading comments. Some of your past posts are extremely informative. I copied and pasted many of them and used them in my closing argument to help prove the authenticity of The Shroud. Especially some of the posts made in regards to the blood evidence. Thanks for making those posts. Anyways back to hair again At this point we can conclude beyond any reasonable doubt, Paul of Tarsus is not referring to just long hair. This is one of those deals where you have to start going through the process of elimination and cross off what is not possible and see what is left. (Whatever remains must be the answer) Anyways, These are some links and other commentary I found on the subject. 1. Http://perseus.uchicago.edu/cgi bin/philologic/getobject.pl?c.9:1:558.Autenrieth Georg Autenrieth [1891], A Homeric Dictionary for Schools and Colleges κόμη: hair of the head, with reference to comeliness 2. Book from Project Gutenberg: Döderlein’s Hand book of Latin Synonymes (κόμη) is especially applicable to the hair of females; +cæsaries+, to that of males, like ἔθειρα. This word ἔθειρ is defined as ἡ, hair, poet. Noun, Hom. Only in Il. , and always in pl., either of a horse’s mane, 8.42; or of the horsehair crest on helmets, This is more commentary I found on the subject 3. Paul also tells us it is not right for men to wear their hair in tresses. The word for decorate is mistranslated in the NKJV, where it is rendered as “long.” The word “long’ in verses 14 and 15 is the Greek word koma (κομᾷ). This word does not refer to long hair, but to “tresses of hair.” (Strong’s merely notes that the KJV renders this word as “long hair.” They do not give that definition themselves.) NT:2863 koma/komao (kom ah’ o); from NT:2864; to wear tresses of hair: KJV – have long hair. When we look up the reference at NT:2864 we see that it again speaks of tresses, and of ornamentally dressing (or plaiting) the hair. NT:2864 kome (kom’ ay); apparently from the same as NT:2865; the hair of the head (locks, as ornamental, and thus differing from NT:2359; which properly denotes merely the scalp): In other words, Paul told the Corinthian men that Hebrew men do not plait their hair, or wear them in locks, or trellises. He cannot have told them not to have long hair, because as we show in many other places, Paul took at least two Nazirite vows, which call for the hair of the head to grow long. Paul would not have told the Corinthians to avoid having long hair, when he himself probably had long hair at that time. What makes more sense, then, is to think that Paul was simply telling the Corinthian men to dress like men, and the women to dress like women. Finally, if we read this passage carefully, verse 16 tells us that the assemblies have no custom that sisters can pray or prophesy with their hair uncovered, simply because it is long, or trellised. To the contrary, the prettier it is, the more it needs to be covered; and if a sister does not wish to cover her hair wholly then she should be shaven or shorn, for to display her beauty openly in the assembly only serves to distract the men from focusing on the Spirit. 14 Does not even nature itself teach you that if a man has decorated hair, it is a dishonor to him? 15 But if a woman has decorated hair, it is a glory to her; for her hair is given to her for a covering. 16 But if anyone seems to be contentious, we have no such custom, nor do the assemblies of Elohim. I think of Paul of Tarsus is getting a good laugh out of all of this, perhaps providing some needed comic relief in the Kingdom of Heaven..","date":"2014-05-17","mins":"12:28 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-121300","author":"dave_hines","post":"Good Evening Mr. Hugh Farey: I found a few of the links we talked about and posted them. I sent them in a reply to Daveb of Wellington who always makes thought provoking, intelligent commentary (with a touch of humor added) I was looking at some 1st Century Roman Centurion helmets with the horse hair dyed red on top. I wonder if Paul of Tarsus may have also been referring to dyed hair. I also wonder if the word “nourish” could possibly be referring to coloring the hair. “If he colors/decorates his hair it is a shame unto him” Just thinking out loud. I have had to address this at least a few dozen times from people leaving comments on my videos, saying, “Paul of Tarsus said it is a shame for a man to have long hair so the Shroud can’t be Jesus” If not for that, I would not even be talking about this. I would like to be able to put this down quickly and then move on to the more important aspects and forensic evidence that supports the authenticity of the Shroud and not get hung up on a trivial issue..","date":"2014-05-18","mins":"11:04 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-121734","author":"dave_hines","post":"A pallium/mantle was also referred to as a “mort cloth” It was not only a outer garment to wear, but also a burial shroud, or in some cases draped over the casket during the funeral. It had dual purpose, outer garment and burial shroud. A Mantle also called a “Mandya” was typically used by someone in high position, as in a high priest, Jesus is the New High Priest and is a “Lion from the tribe of Judah” that is why they called it “The Mandylion” (Mandya, Lion) A Mantle by definition is a long, wide band of cloth, it cannot be just a face cloth. Elijah wore a mantle, coincidentally this was the only thing left behind after he ascended into heaven, then they sent the army out to search for him for 3 days, but did not find him. Only his “Shroud/Mantle” left behind. I believe it is a preceding event to what happens with Jesus. But like Daveb made clear it would be fairly easy to cast reasonable doubt into this passage (Timothy 2: 4:13)as being written in regards The Shroud. Without more physical evidence it is speculation. I like to speculate sometimes and combine a few facts to help shed more light into the subject, so here goes. It is clear The word, φαιλόνην is given a very vague and incomplete translation of “cloak” in 2 Timothy 4:13. We have to determine what the word cannot mean and see what is left. Cloak is eliminated as being possible.The spelling is completely wrong. Also eliminate traveling case, book case or chest. The word φαιλόνην is a dual feminine noun that means CLOAK and LIGHT. Derived from the Greek Word PHOS which means TO SHINE or make manifest, especially by rays. PHOS is also defined as being A HEAVENLY LIGHT such as surrounds angels when they appear on Earth. So the word φαιλόνην is combining HEAVENLY LIGHT WITH A CLOAK/SHROUD……….Why? It is noteworthy the word Paul wrote (or someone) “φαιλόνην” never appears again in the Bible or in any ancient scripture. It is a one of a kind word used to describe a one of kind thing. What could that one of a kind thing be……….? What could it not be. I believe The Shroud was brought to Rome with Peters permission. There is historical record he was there in the same time after the letter was written to Timothy. Highly valued relics were often hidden in catacombs to keep them from being destroyed by enemies of Christ in that time. The Turin Shroud/Burial Shroud Of Jesus would have been #1 on that list of things. The catacombs of Rome is a place no one would expect The Shroud to be kept hidden. The frescoes in the catacombs used the shroud face as a role model. At some point it had to be there. I often think Paul is writing anticipating the possibility that his letters could be intercepted by one of his many enemies and uses code words and is very careful and cunning in the words he chooses. In the case his letter is intercepted he is not disclosing any important names or locations Especially in regards to where the Shroud is kept. I think when he uses the name Carpus and names the location of Troas, it is a ruse,yet written in a way that Timothy will know what Paul really wants done, who to see and where. Coincidentally , Paul’s home town of Tarsus is extremely close to Edessa, Appx, 10 or 20 miles away. Of all the people that would have wanted to display The Shroud and prove his case, it would have been Paul. The word in question is , φαιλόνην, what is it? Because it is not just some ordinary cloak. The best and most simple translation of the word he used would be “A Illuminated Mantle/Shroud” Another mystery. Someday we will all know the answer. Thanks for allowing to me post..","date":"2014-05-19","mins":"10:43 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-121562","author":"dave_hines","post":"Good afternoon Mr. Hugh Farey: Your comments are certainly not trivial. There are more than worthwhile, had it not been for your reminding me of how important physical evidence is I would not have gone yet even deeper into the study of the word Paul of Tarsus used. It inspired me. As a result we all have a more clear understanding. Thanks for doing that. Without physical evidence then all we have is here say testimony and speculation. That is not convincing. People need to see to believe, that is just the way it is. I have to let you know upfront the videos I made were done over a year ago and I was a bit unrestrained and impatient in my narration. I was full of passion and fire and stepped across the line more than a few times in my closing argument. Some of it is speculation without physical evidence. If I could re edit and change them I would. I made a glaring error in my opening statement regarding the blood evidence not knowing that the rh factor of the blood was to degraded to know if it was AB pos or AB neg. There are some moments where I feel I misrepresented The Shroud. I am sure Barrie Schwortz would agree with that. I am working on correcting the errors I made in my presentation. Some of the evidence I presented is not scientifically peer reviewed. As a result I lose some credibility. I am aware of it. The videos get a lot of views. Over 100.000 views in the last year, reaching people in 194 countries. There are some highlight moments. I stopped promoting my book because I did not want it mixed in with The Shroud of Turin. So my channel is devoted to The Shroud. There is one video that translates a word that Paul of Tarsus used that I am convinced is referring to The Mandylion. I believe he was in possession of the Shroud and that it was moved to Rome into the callistus catacombs before 70 AD. I am reluctant to give you the link but since you asked I have to give it to you. Bear in mind I made some howling errors during some of the presentations. Be merciful. I am one of those kind of people who fails their way to success..","date":"2014-05-19","mins":"5:05 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-119719","author":"dave_hines","post":"I can clear this up. The ancient Greek word (κόμη) that Paul of Tarsus wrote in Corinthians 11:13 means “decorated hair”. It was mistranslated as “long hair” This is a classic example of a vague and incomplete translation of a word used by Paul of Tarsus. (There is another where he makes reference To The Mandylion that I will not get into in this post) The word κόμη, DOES NOT MEAN LONG HAIR, “Decorated hair” would be the simplest translation. I have seen it used in other literature and it is never used to describe long hair. In fact it is NOT defined as long hair in any ancient Greek dictionary. It is such a obscure seldom used word that the translation varies from one dictionary to another. In one it is defined as “hair of the head” Another “hair with decorum” Another “tresses of hair” “Hair with comeliness/decorated” But never was the word Paul wrote, κόμη, translated as long hair in any ancient literature with the exception of the Bible. (If they knew the trouble it was going to cause I am sure they would have spent more time to accurately translate the word) Ancient Greek is a very sophisticated language, with many dual nouns and multiple adjectives and altered spelling of those nouns so as to know which adjective is being used. Millions of people to this day think Paul of Tarsus said it is a shame for man to have long hair WHEN THAT IS NOT WHAT HE SAID. HE SAID IT IS A SHAME FOR A MAN TO HAVE “TRESSES OF HAIR, ORNAMENTALLY DECORATED” As in how a woman dresses up her hair with flowers and/or jewels, for a public event or just for show. The word Paul used was translated as “long hair” but should have been translated as “tresses of hair, ornamentally decorated” or just “decorated hair” When you read the passage this way, it makes sense. Stop and look at the whole letter, this is more about the covering of women’s heads, not about men with long hair. The 1st clue that Paul of Tarsus is not saying it is a shame for a man to have long hair is in the 1st part of the passage. Does not nature itself teach you it is a shame for a man to have long hair? What example in nature teaches us that? NONE. There is no example in nature that teaches us it is a shame for a man to have long hair, NONE. Lets take a male lion for example with a long mane of hair, is that a shame to the lion? NO Or long branches on a tree, is that a shame to the tree? ABSOLUTELY NOT. But what does Paul mean? I will explain it further. Take a male lion and decorate it’s hair with flowers and jewels and dress up that male lion’s hair like a female, as in how a woman prepares her hair for a wedding or public event. Would that look like a shame to the male lion and dishonor him? A male lion with little decorated pink flowers in his hair, would that be a SHAME? YES it would. It would look ridiculous Lets read the whole passage the way Paul meant it so we can all understand. Does not nature itself teach you that it is a shame for a man to have tresses of hair, ornamentally decorated, but if a woman has tresses of hair ornamentally decorated it is a glory to her. SEE HOW THAT MAKES SENSE. For a woman to have tresses of hair ornamentally decorated looks good. For a man to come to the Church in Corinth with tresses of hair ornamentally decorated, in the opinion of Paul of Tarsus would be inappropriate/ shameful/ a dishonor That is all that he said. He went on to say at the end of the letter, But if any man seem to be contentious/argumentative we have no such custom, (or law against it) neither the churches of God. Saying this, If you want to come to the Church in Corinth with your hair ornamentally decorated we have no law against it. We suggest that you do not do it. That is all he said. Now what does this passage have to do with the Man in The Shroud/Jesus? ABSOLUTELY NOTHING. Paul of Tarsus took the Nazarite vow, meaning he himself had long hair. So why would Paul tell people not to have long hair, when he himself is speaking with LONG HAIR?! Because Paul of Tarsus did not say it was a shame for man to have long hair, but DECORATED HAIR. This is how it is spelled in ancient Greek, κόμη It is a very obscure, seldom used word that is difficult to translate because it has more than 1 meaning and can even mean “unkempt hair” It is understandable how this was mistranslated. BOTTOM LINE; The Man In The Shroud has long hair (look at the pony tail in the back) that means Jesus had long hair. The Man In The Shroud is Jesus. (His image captured on the linen anyway) Thanks for allowing me to post on this blog. I really enjoy reading the comments..","date":"2014-05-15","mins":"2:35 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-122747","author":"dave_hines","post":"Hi Max, I am in agreement with your translation, “A shining wrap” and I will add some scripture that goes with it. “No one lights a lamp and puts it in a place where it will be hidden, or under a bowl. Instead they put it on its stand, so that those who come in may see the light” I do not believe The Shroud was kept hidden away in some dark chamber & not displayed because the disciples were so afraid of having it stolen or destroyed. That would prove they had spirits of fear and not of joy. The Lord would want The Shroud displayed. I am convinced Paul of Tarsus on various occasions displayed The Shroud in Rome and many other places. It was not his entire presentation, but part of it. I think Peter offered it to him. I don’t think he even needed to ask for it. He was the one out there more bold and fearless than anyone. Baptized in The Holy Spirit, a very convincing public speaker. Without physical evidence that directly links Jesus to the resurrection he would not have been successful in his ministry. Even if he could recite scripture from memory, heal the sick and perform miracles in front of people that does not prove Jesus rose from the dead. That proves he has special powers of God or that he was some kind sorcerer, doing things by the power of the Devil, that is how people would perceive that. He needs hardcore physical evidence such as The Shroud, to think otherwise is not logical nor practical thinking. To come to the conclusion Paul had the Shroud based only on that passage is also not logical. It is weak, I agree on that. We can conclude that the Shroud was in the open air in southern Turkey at some point in it’s history. It’s in the pollen evidence. It is a weak link but also supports the passage. The frescoes in the catacombs, that supports it. But we need a lot more. A writing by Paul in more detail, describing it. It is more important to believe The Shroud is physical evidence of the resurrection, not whether Paul displayed it or not. Either we are convinced or not convinced, .there is no in between, to harbor any kind of doubt means a person remains unconvinced. I suggest that if we truly believe The Shroud is physical evidence of the resurrection of Jesus to go directly and ask The Spirit of God personally if Paul of Tarsus was referring The Shroud in that passage. That would be my challenge to anyone that feels they must have the answer to that question. Its says “ask and you shall receive” in the Bible. I suggest to anyone in doubt to do just that. Anyways, I have really enjoyed reading your commentary on the Paul of Tarsus passage. We need more evidence before it starts looking convincing. Spirit of God will provide that evidence in his own time. PEACE.","date":"2014-05-21","mins":"2:16 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-120268","author":"dave_hines","post":"Hi OK, The best comparison analogy I can think of that describes the word Paul of Tarsus used κόμη would be this. Imagine if Barrie Schwortz, who has long hair, (which in my opinion is not shameful in any way) wore his hair ornamentally decorated while doing a presentation on The Shroud of Turin. Instead of neatly tied back it was free flowing and dyed a blond color with jewels and ornaments/flowers hanging from it. Would people consider that inappropriate or shameful? Would it be out of place/ hurt his presentation? That is what κόμη is, ornamentally deocorated hair and Paul of Tarsus suggested for the men not to come to the Church in Corinth in such a way, then closed the subject by saying there was no law against doing it if one did it anyway. Note that the Man In The Shroud and Barrie Schwortz have about the same length of hair. It is not a shame in any way..","date":"2014-05-15","mins":"11:51 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-121950","author":"dave_hines","post":"The single mindedness of purpose/the cornerstone of the ministry of Paul of Tarsus is that he first and foremost must prove beyond all reasonable doubt that Jesus of Nazareth rose from the dead. The success of his ministry is dependent on it. A lot of pressure is on him. I believe is it useful to gain the deepest possible empathy with Paul of Tarsus and imagine ourselves having to give multiple presentations in front of several hundred people with the goal of proving Jesus of Nazareth rose from the dead. Imagine how difficult that would be. Imagine having to do it without a shred of physical evidence and trying to convince people based on here say testimony. In a way Paul of Tarsus is appointed defense attorney for Jesus, Imagine that being ourselves. Would we want to have The Shroud/The Mandylion to show to those people? As a defense attorney, would we want the cloth to show? It would be #1 on my list of things I would want for my presentation. I would to go to Peter and demand it. Otherwise I am going to be standing in front of thousands of people with nothing to show. Here say testimony. It would be a laughing disaster of a presentation. Not one person is going to be convinced. When I tell people I was baptized on the road to Damascus and I saw Jesus in a great white light I am going to be laughed off the podium. But when I bring out The Mandylion with over 400 blood stains on it and image of Jesus on it, the crowd goes silent. I can picture it. It’s convincing. I really like Max Patrick’s translation of the word Paul used “large shining wrap” I think it’s right. I think he was allowed to present it under Peters authority and permission. My theory is that it was kept in the catacombs of Rome throughout the early centuries and eventually moved back to Edessa after most of Rome was converted. Mission Accomplished. Without The Shroud being displayed, I don’t believe Paul could have proved his case beyond all reasonable doubt. He’s gotta have it, I cannot imagine Peter objecting to The Shroud being displayed or refusing Paul of Tarsus access to it..","date":"2014-05-20","mins":"7:46 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-121980","author":"dave_hines","post":"Max, your translation is correct φαιλόνην = large shining wrap, The spelling of this noun, φαιλόνην implies these adjectives 1. Wide/Long 2. Upper (As in upper position such as a high priest) 3. L Ight bringing and light giving (something that shines) I made a video presentation about this.","date":"2014-05-20","mins":"8:33 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-122314","author":"dave_hines","post":"Good Evening Daveb of Wellington. Like I said before, I really enjoy reading your commentary. Some of your past posts helped me to gain a deeper insight into The Shroud of Turin and increased my level of knowledge & understanding in many different ways. Thank you for those posts. I have read a lot of your commentary and in most cases I find myself in agreement with you. Thanks for the link you suggested I look at, I will read it. On this Paul of Tarsus passage we will have to agree to disagree. I am convinced Paul is referring to the Shroud, If explain in full detail why I am so convinced my mental health will be in question. So there is no point in discussing it. God willing I will open up the file on this again at a later date only if I have hardcore convincing evidence that supports it. It does not matter what I believe, it only matters what I can prove and I cannot prove beyond a reasonable doubt that the word Paul wrote is in reference to The Shroud. I am glad I did not include it in my closing argument. Now I know why. I can clearly see there are several different ways in which the display would be attacked and I have no doubt in my mind that no significant number of people would ever be convinced on the present evidence. I would not waste their valuable time and mine presenting it again. I am very glad I got to hear the argument on the other side of this. L Ike Hugh Farey would say, evidence, evidence, I’m working on it! Thanks for replying to my post. PEACE.","date":"2014-05-20","mins":"7:33 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-122786","author":"dave_hines","post":"Hi Louis, I think that is a valid point. A good argument for why Paul of Tarsus would not risk displaying The Shroud & more reason Peter would be reluctant to let Paul be in possession of it let alone display it, (knowing Paul had to deal with daily threats and people seeking out to have him killed) ,Rome would be a risky place to display it in that time. I believe Paul of Tarsus is the kind of person that would do it anyway, the kind of person who walked that fine line between genuine courage and foolishness but not step across over the latter. I believe it was done under Peters authority and supervision. It may have even been the cause of his own demise, being crucified upside down. He was in Rome with Paul of Tarsus according to historical record. (Unless I am mistaken on that) I believe Paul had possession of it on at least one of his missionary journeys. He would have to choose his moment wisely under the guidance and counsel of The Holy Spirit in choosing a place, time or location to display it. I believe there were many occasions, if not most of the time he did not have it on his person, or display it. I believe the success of his ministry was more reliant on his charismatic, bold and fearless manner in which he gave testimony, his knowledge of scripture and how Jesus fulfilled them. A genuine leader who led by example more than just words. A real powerful speaker. Convincing & with the power of Holy Spirit with him to protect him &The Shroud if need be. Of course all of this is just speculation. I am not a authority or expert on the ministry of Paul of Tarsus. I am writing what I feel The Spirit of God wants written. PEACE.","date":"2014-05-21","mins":"4:10 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-122959","author":"dave_hines","post":"Hi Louis, thanks for replying and I will definitely check out the links you posted. One thing about Shroud research is that it forces a person to go out of their normal comfort zone and actually have to start using that thing between our ears called the human brain. If one was to actually be in a courtroom style setting and this Paul of Tarsus passage was used as a display to authenticate The Shroud it would likely backfire, and actually even work in reverse. It could end up making the defense look desperate & lose credibility with a jury. I learned that from being on this Blog Site. I certainly did not foresee all the different angles from which the “evidence” would be attacked & how fairly easy reasonable doubt was cast into it. A good learning lesson. I am certainly not in disagreement with experience of the risen Lord being the force for character transformation of the apostles. From a spirit of fear, to fearless and bold. Amongst many other positive character traits of genuine humility. It is unfortunate in regards to the absence of historical record of The Shroud in written scripture and throughout the early centuries. Puzzling & thought provoking, another mystery to solve. One thing we could all agree on, “for the time being leave the Paul of Tarsus passage out of the defense display” It does not matter what we believe, it only matters what we can prove. Perhaps the good Lord will have a surprise discovery of some ancient scripture that will help further prove the authenticity of The Shroud beyond a reasonable doubt. Until then, we’ll have to leave the Paul of Tarsus passage in the evidence vault to be opened at a later date. PEACE TO YOU.","date":"2014-05-22","mins":"12:46 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-123422","author":"dave_hines","post":"Good Evening Louis: I really like This Shroud Blog Site. This is a bit of sidetrack type question but I was listening to Russ Breault;s theory has to how the image was formed on The Shroud and it sounded right. Hypothetically, if The Shroud image was formed by living cells in a body being electrified and each one emitted a micro thin laser beam, (short wave, high frequency) and the distance each one traveled was encoded into the linen, how many individual laser beams would be needed to form the entire Shroud image, front and dorsal? A ballpark estimate. 100,000? 1,000,000? Is there a way to get a semi accurate count by looking at a square inch of the image under magnification and then do the rest of the math based on that count? The reason I ask is because I would like to make a video dramatization demonstrating The Shroud image being formed in this manner. I have some pretty high tech video editing software equipment, (Sony Vegas) I want to make a video that demonstrates the image formation using Russ Breault’s theory. Louis, can you answer that question? I want to see how it looks on film using Barrie’s photos of The Shroud in the Garden Tomb. I have a version I did last year but I want to upgrade it..","date":"2014-05-23","mins":"12:31 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"}]
