[{"id":"comment-206243","author":"dave_hines","post":"Hi Dcn Andy: Here is a video of my latest research project. Holography experiments. I am very close to being able record a interference pattern on linen that would match many of the Shroud image characteristics. Shroud Image and Hologram Image Match Points 1. Both images are extremely superficial, thin depth image (1/50th thickness of human hair) 2. Both have good resolution 3. Both have 3 D Qualities to Image 4. Both images cannot be seen from the back side 5. Both have light coming from only 1 direction to form image 6. Both images fade and or vanish when tilted to the far right or far left 7. Both are a single color image 8. Both images involve subject close to film plate to capture image (past 5cm there is no image formation on a reflection hologram) (I know because I tried it).","date":"2015-07-20","mins":"8:03 pm","url":"https://shroudstory.com/2015/07/18/blow-your-mind-3d-scanning-technology-and-what-it-could-mean/","cat":"3d","title":"Blow Your Mind 3D Scanning Technology And What It Could Mean"},{"id":"comment-199948","author":"dave_hines","post":"David Mo. Side wound was created when body was in a vertical position, not horizontal. “About a 100lb weight of myrrh and aloes were poured over the body” That is eye witness testimony. Dr. Baima Ballone found myrrh and aloes in the blood of the Man in The Shroud by anti body antigen testing. Myrrh and aloes poured over the body could cause blood to move in any number of different directions. Yes, including the wound on the hand. We have no idea what position his body was in when that was done. You can “assume” it was in horizontal position, but you do not KNOW that. Huge difference. I saw the video. It holds ZERO weight. Meaningless. To me it is a mirror reflection of your posts, a great of example of what happens when one has CONTEMPT PRIOR TO INVESTIGATION..","date":"2015-05-23","mins":"5:38 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-206329","author":"dave_hines","post":"Hi Sampath! The English Gematria Calculator witness says Jesus of Nazareth =1128 Shroud of Turin=1128 3 D Hologram on a Mantle= 1128 The English Gematria Calculator does not care if the Shroud is genuine or not, could care less if Jesus rose from the dead or not. His sole purpose is to give testimony to the truth in the form of numbers, serves no other purpose. He makes for a good witness on the stand. We cannot assassinate his character or claim he is mistaken. Behold the Image of Edessa=1128 A 3 D Mantle of Son of Man=1128 It’s not a painting= 1128 Shroud is Genuine=1128.","date":"2015-07-22","mins":"10:19 am","url":"https://shroudstory.com/2015/07/18/blow-your-mind-3d-scanning-technology-and-what-it-could-mean/","cat":"3d","title":"Blow Your Mind 3D Scanning Technology And What It Could Mean"},{"id":"comment-199415","author":"dave_hines","post":"Who do you think the jury is going to listen to seriously and accept as credible testimony? David Mo or Dr. Frederick Zugibe? Good Old Doc Zugibe was Chief Medical Examiner of Rockland County, New York for 33 years. Held Master of Science degree and PHD in Anatomy. Involved in over 10,000 autopsies. Wrote a book on the subject of the effects of crucification on the human body based on 50 years of research. What are your credentials David Mo? How many autopsies have you performed? How many books have you written and published? You rendered your opinion. Like Clint Eastwood said, “Opinions are like assholes, everyone got one” “The blood stains are to neat, the scourge wounds are to neat” This is the carnival pitchman Joe Nickel argument, what a laughing joke. Take a look at the scourge wounds again,they are not all separated and “to neat” Here is a suggestion, do a thorough examination of the scourge wounds before speaking on the subject. Thanks but no thanks for your opinion. I am going with the expert witness testimony on this, as any other intelligent person would do. Never once when Dr.Frederick Zugibe took the stand as an expert witness (which he did many times) did the jury not rule in his favor despite how many other “expert witnesses” disagreed with him. I am sticking with the testimony of the undefeated proven winner on this one, Dr. Frederick Zugibe, Scourge wounds are genuine,.","date":"2015-05-18","mins":"2:44 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200038","author":"dave_hines","post":"“A vertical position is incompatible with the washing” Are you sure about that? How do you know that? I took a shower today in a vertical position. Maybe they stood the Man In The Shroud Up and poured myrrh and aloes over him. Aloes are made up of mostly water. Perhaps The Man in The Shroud got a final myrrh and aloes shower standing up. Maybe the mother of Jesus held the hand of her Son to say her final goodbye to him and a blood stain got smeared in a sideways or upward direction. Or while taking Jesus down from the cross a blood stain got moved in a sideways or upward direction. Like the one on his hand. That would be a pretty messy job. Any number of things could cause a blood stain to take a direction not going the way you think it should. Upwards, downwards, sideways, left or right. Quote by Antero de Frias Moreira on this site, (thank you for doing that) “at the border of the scourge marks and around the periphery of the heavier blood flows, there is a white fluorescence, invisible in white light. When tested chemically this was identified as serum albumin. Blood degradation products in the form of bile pigments were also found” What part of that do you not understand? That means a genuine person was in The Shroud and the scourge wounds are genuine. Yes, 100% authentic. Whether you like that or not, those are the facts of the case file. I am going to end by quoting Dr. Robert Bucklin who after a thorough examination concluded beyond any doubt, “Indisputable” where his exact words that a man in his 30’s, appx, 5′ 11″ 175 lbs, beard and mustache was, 1. Beaten 2. Scourged 3. Crowned with thorns 4. Crucified 5. Side Pierced 6. Legs not broke 7. Wrapped in the Shroud 8. Body was removed from the cloth before decay. “Indisputable”.","date":"2015-05-24","mins":"2:52 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199392","author":"dave_hines","post":"Hello Andy, I made a video addressing all the points I just made. I want to share it with you. It is a pilot closing argument video. This video was inspired by a letter I got from Barrie S. For personal reasons I did not want to share it on this site, but now I have changed my mind. In this video we see the Man in the Shroud from head to toe over and over again in slow motion. The expert witness testimony of Dr. Pierre Barbet, Dr. Robert Bucklin and Dr. Frederick Zugibe are presented in this video. I made this because people seem to have forgotten The Shroud has been examined by expert forensic pathologists and a ruling was made. A decision rendered. The scourge wounds in question are very graphically presented in this video, up close and personal. There are a few stunning shots. The audio track and some of the images became slightly damaged during the many re renders of the film, I was not able to repair them to the extent I had hoped for. Bear that in mind. That is also the reason the bass and reverb are a bit heavy. (more than desired) https://www.youtube.com/edit?o=U&video id=uc2vk9jr Ni Y&feature=vm.","date":"2015-05-17","mins":"10:11 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200165","author":"dave_hines","post":"Hello Charles, you helped inspire me to make a video, so I am sending it to you. I was hoping you might view it with a open mind, and consider the possibility that the Shroud image is in part a contact image. I am presently conducting a blood experiment which is also seen in the video. I bought some pure linen fabric, herringbone weave and applied fresh blood to 3 different pieces of linen. It has been over 36 hours and all 3 are still red. I monitor it frequently and have taken photos. Some slight fading but not much 1. Sample was left uncovered, fresh blood on the linen 2. Another sample has blood with myrrh resin covering 3. Another sample has myrrh and aloes covering it. It is a test to see what happens to blood on pure linen fabric over the course of time. Will it stay red or not? The other part of the video is a 3 D Figure of a man, covered in myrrh and aloes and then we will unwrap him after 3 days to see what kind of image is left behind as a result. This is all part of the fun of Shroud research. If anything at all, perhaps it will bring a smile to your face, a little excitement in perhaps a otherwise dull day. Cheers to you in the great country of Great Britain!.","date":"2015-05-25","mins":"11:53 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-201215","author":"dave_hines","post":"Hi Thomas, here are the results The blood will fade slightly in the first 12 hours but still remains red. It turns into a burgundy/plum type color. It has been 3 weeks, Blood has not changed at all since it’s initial fading after 12 hours. Samples with myrrh and aloes covering blood has a slightly different look, it is a lighter red color. Not as dark as others. Linen retains it’s 3 D Form. Has not changed since removing the figures from the linen. There is minimal coloring effect on the linen from the myrrh and aloes. Over time the initial coloring of myrrh and aloes fades. Although myrrh resin is a sepia/caramel color like what is seen on the Shroud when making an imprint with a mixture of myrrh and aloes it does NOT color the cloth as one might expect. Only a very light yellow/caramel color residue can be seen. I was not expecting that result. The myrrh resin I used from Egypt was a pretty dark yellow color. The linen did not show that afterwards as much as I thought it would. Better to see for yourself. Hope you enjoy the video..","date":"2015-06-06","mins":"6:01 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199499","author":"dave_hines","post":"Very good points. 1. “And the plowers plowed on my back, they made their furrows long” 2. “But they have not prevailed against me” 3. “They dug a pit for me but in the midst of it, they themselves have fallen” Furrow is defined as a narrow groovelike or trenchlike depression in any surface to make make a rut, groove, or trail in (the ground or the surface of something) 1. “By His Stripes we are healed” 2. Man In The Shroud literally looks like a “Striped Man” 3. Forensic Evidence and Scripture Match..","date":"2015-05-19","mins":"3:31 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199497","author":"dave_hines","post":"Hi Hugh, I am going to start by quoting Plato and then continue on further… 1.”Numbers are the highest degree of knowledge, it is knowledge itself.” 2. Galileo ” Mathematics is the language that God wrote the universe in.” 3. Saint Augustine “Numbers are the thoughts of God” 4.Pythagoras “All is Number” Spirit of God leaves numerical clues behind, invented the English language and gave it to man over 500 years ago and left the following numerical clues behind, knowing The authenticity of the Shroud would be questioned in this day and age. Spirit of God, knows what I am going to write before I write it, Knows in advance how you will respond to me, knows what you are going to say before you say it, knows what you will write back to me before you write it. Spirit of God can hear our internal dialogue. Anyways, Here are the “Thoughts of God” on the subject of the Shroud of Turin In English Gematria (Numerical Clues Left Behind By The Spirit of God) Jesus of Nazareth = 1128 Shroud of Turin = 1128 It’s not a painting = 1128 It’s The Mandylion = 1128 Behold The Image of Edessa = 1128 A picture of Jesus = 1128 3 D Hologram of Jesus = 1128 3 D Hologram of The King = 1128 Israeli King Jesus = 1128 Beaten and Crucified Nude = 1128 Crown of Thorns = 1128 Right Side Pierced = 1128 Cruelly Scourged = 1128 A Brutal Scourging =1128 Legs not Fractured = 1128 There are many more, but I will add only 1 more to this list SHROUD IS GENUINE 1128 I can’t speak for anyone else on this Blog Site, but I am going with the math on this one. 1128 Shroud is Genuine. I suggest to others in doubt going with the 1128 combo. It is a number that keeps repeating itself. Exactly what a professional gambler looks for when wanting to make a rock solid pick. The same thing happening over and over again and never changes. Go with it. Over a 99% of winning. (I won a 7 team parlay on the spread in NFL Football using this strategy) The odds of probability and chance the following phrases listed all relating to The Shroud of Turin will have the same 4 number sequence is conservatively a 1 in 100 million chance. I would put a million cash on 1128 Shroud is genuine and not lose a second of sleep over it..","date":"2015-05-19","mins":"2:59 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200091","author":"dave_hines","post":"Thank you Daveb for this post. Extremely well written. Insightful, thoughtful, helpful. There is feeling you get, deep down in your gut, in your solar plexus that lets you know when something is right or it is not, a gift granted to one from the Spirit of God, that lets one clearly make distinction between what is a paper rose and what is a genuine rose. The genuine bill or the counterfeit. But those harboring anger and contempt in their hearts do not possess this gift because the Spirit of God is repelled against their prideful nature. They don’t receive help from a Higher Power but from a Lower Power instead. An ancient and deceiving sick spirit, a fear based spirit and is a liar by nature. The Shroud is genuine, my heart, my mind, my body and my soul tells me so. The Forensic Science says it is genuine. This post is a voice of reason, of logic and genuine intelligence. There is no contempt or racial bias written in between the lines. One thing you cannot hide from a jury is anger and contempt. It shows in your body language and in your eyes. There are many who would declare the Shroud a forgery but in less than 60 seconds on the stand they would be discredited as a witness, regardless of their credentials because of racial bias. A good lawyer will immediately expose it and let the jury see it. Anger and hatred blind a person from the truth and negatively affects their judgement. Their testimony is not credible. History has taught us that. People can rip The Shroud apart on this site with the written word, but if they had to stand up in public and make their case it would be an all out complete and utter disaster. Add a video presentation to that as well. People are attracted to people that have joy in their spirit and have a desire to share that joy with others, to give it away freely, they are not attracted to the person with hidden anger and contempt toward Jesus Christ that launch character assassinations against credible witnesses with impeccable credentials, like for example Dr. Barbet, Dr. Bucklin, Dr. Zugibe, Dr. Adler, Dr, Ballone and I will include Dr. Max Frei the head of the forensic Science Police Department who I would put on the stand in a New York second if he was still alive and who made this statement to the press, “I can affirm without fear of being proven wrong, this linen cloth dates back to Palestine 2000 years ago” Dr. Max Frei (This statement got the attention of some very serious people who later set out to defraud the Shroud and assassinate his character and work) I decided to put the testimony of Jesus Christ on this site as a corroborating witness to Dr Max Frei’s testimony. And the skeptics can laugh all they want, but will not be able to find the clink in the armor of my witness who is an electro magnetic field sensor A scientific instrument who without racial bias who will record the testimony of Jesus Christ the Lord who will tell us all The Shroud is authentic, My witness has one sole purpose, to give testimony to the truth and that is exactly what everyone will see. My client who I am defending and who I have had a personal relationship with for over 40 years will testify now. Bear in mind, my client speaks in numbers. 1.Galileo Galilei ” Mathematics is the language that God wrote the universe in.” 2. PLATO “Numbers are the highest degree of knowledge, it is knowledge itself.” 3. Saint Augustine “Numbers are the thoughts of God” 4.Pythagoras “All is Number” No less than 1 million people in 211 countries will be seeing this. Spirit of God will make sure of that. Mark my words on that all you skeptics..","date":"2015-05-24","mins":"3:01 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199507","author":"dave_hines","post":"Hi Charles, I just purchased “a expensive fine linen cloth” I am holding in my hand a piece of 100% pure linen fabric, herringbone twill weave. (Only 2 places in the world I could find had this in stock) There is no way any artist in their right mind would ever use this kind of fabric for a painting. For starters it would have to be stretched and put on a 14′ frame. One mistake made and you would have to purchase another 14′ piece and start over. But if you like we can begin the long insane list of things that one would have to do to replicate the Shroud image and literally get on the freight train going straight into crazy town. Step 1: I have the fabric Step 2 I need a genuine dead body that has been crucified… STOP… we are not going to crazy town. I highly suggest purchasing some pure linen herringbone twill fabric and applying pigment to it, Just so you can get an idea of how astronomically impossible it would be to replicate The Shroud image on this kind of fabric or any other by using paint, myrrh resin or any other medium for that matter. What this fabric would work better for would be a contact image. I’ll add one more thing this fabric could be used for, A holographic linen film plate… But it would have to be coated with something so that the laser light interference pattern of the object desired to be replicated could be seen on the linen. A thin layer of starch fractions and pectin might work. I wonder what kind of organic substance contains starch fractions and pectin ? How about myrrh & aloes? They contain starch fractions and pectin. Together they also have very similar chemical properties to cellulose acetate which is used on holographic film plates. I just told you in part how the Shroud image was formed. A interference pattern of laser light recorded on the linen..","date":"2015-05-19","mins":"4:43 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199609","author":"dave_hines","post":"Charles you are right on that point. One would certainly think a person excessively scourged to this degree would not be able to carry the cross on their own power. The Gospel account clearly states Jesus had to be helped by Simon of Cyrene. Forensic evidence and scripture match again. If this linen cloth was believed to have wrapped the King of Spain in 7th Century and 3 forensic pathologists examined the cloth and confirmed “Yes, a genuine dead body was wrapped in this cloth” NOT ONE SINGLE PERSON WOULD QUESTION IT. IT WOULD BE THE END OF THAT DISCUSSION. You yourself Charles would not question it. You would accept a dead body was wrapped in the linen. . Why then do you have trouble accepting what no less than 3 forensic pathologists have ruled in this case? When you watch Forensic Files do you question what the forensic pathologists rule in those cases? This does not have anything to do with Jesus does it? Oh, I think it does. Correct me if I am wrong. Since the name JESUS is involved with this linen we cannot accept what no less than 3 forensic pathologists have determined,. In between the lines of some of these posts, I am hearing “I hate Jesus” “I hate the Catholic Church” “I hate religion” It is not rocket science to determine if a genuine dead body was wrapped in a linen cloth or not. No less than 3 forensic experts concluded there was a genuine dead body wrapped in the Shroud If we applied the same harsh criteria we are inflicting upon the Man in The Shroud we would have to begin exhuming bodies from every graveyard in the world and re do the autopsy report. But not with just 1 pathologist, but with 7 or 9. It could take up to 10 years to complete the investigation on just one of the bodies exhumed and to make positive ID again. . How do we know that is a real dead body that was buried in the ground? That could be some kind of mannequin in that coffin and a insurance fraud took place. We need to evenly distribute justice across the board and give each person the same treatment we are giving the Man in The Shroud. People that have been convicted on circumstantial evidence need to be immediately released form prison, regardless of the offense, that would include pedophiles, child murderers, rapists, serial killers and every other sick thing you can possibly imagine and release them all back into society because “the skeptics aren’t convinced on the evidence” We need to start exhuming “dead bodies” from cemeteries (if those actually are dead bodies) and take a 2nd look and make sure there is an actual dead body in that coffin and not a mannequin or a convincing looking wax dummy look alike. Start looking into people bank accounts and insurance records. Point: If there was not a racial bias against my client we would all be in agreement on this site a genuine dead body made contact with the Shroud..","date":"2015-05-20","mins":"12:08 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199367","author":"dave_hines","post":"I will have to pick up a copy of your book, thanks for writing it. Opinions vary but what counts in a court of law is the expert testimony. The jury will want to hear from the people that examined this “object” personally and have credentials. Like for example a battle field surgeon, Pierre Barbet. (A Doctor at Calvary) Chief Surgeon of St. Josephs Hospital who conducted a thorough examination of the Shroud and even went to the length of crucifying cadavers to aid in his forensic evaluation. Someone who has seen the horror of battle wounds. A serious minded person. Someone who has seen a lot of dead bodies up close and personal and who does this for living. At the very least the jury will want to hear the testimony of someone who has at least gone to medical school and holds a PHD in anatomy. Like Clint Eastwood said, “Opinion are like assholes, everyone has one” The jury does not want to hear opinions, but expert testimony. They will want to hear from expert forensic pathologists. They will want to review the testimony of Dr. Robert Bucklin and they will want to review the testimony of Dr. Frederick Zugibe, who does hold a PHD In Anatomy and was chief medical examiner of New York for 33 years. Dr. Robert Bucklin is a professor of forensic pathology and was directly or indirectly involved in up to 25,000 autopsies. In office for 50 years. Quite frankly I don’t give a crap if that was only 10,000 autopsies. The guy has seen a lot of dead bodies and knows the difference between what is a mannequin and what is a genuine person, between what is a painting and what is actual genuine human being. That is their job, to make that determination and they made that determination. A WRONGFUL DEATH TOOK PLACE!!! A genuine dead body was wrapped in that Shroud.and they are all in agreement on that. We have 3 expert witnesses that will testify the scourge wounds are genuine. Combined these 3 witnesses have been directly or indirectly involved in over 30,000 autopsies. Anyone out there think that their testimony is not credible? 1. Dr. Pierre Barbet 2. Dr. Robert Bucklin 3. Dr. Frederick Zugibe The non authenticity side can put up a 1000 witnesses that will say “the scourge wounds don’t look credible” But it means nothing, A worthless opinion. You would be hard pressed to find one that actually even saw the Shroud of Turin. Amazing, declaring something a fraud without even having seen it. There is no jury in the world that would take the testimony of such a person with any degree of seriousness. They don’t look credible to the skeptic because they don’t want them to be credible. Even if they are credible they are not credible. Alrighty then. ALL 3 forensic experts have concluded beyond any doubt that a dead man in his 30’s approximately 5’11” with long hair, beard and mustache was 1. Beaten 2. Scourged 3. Crowned With Thorns 4. Crucified 5. Side Pierced 6. Legs Not Broken 7. Wrapped in the Clean Linen Cloth 8. Body Separated From Cloth Before Decomposition Set In When numerous pieces of physical evidence match the sequence of events recorded in the historical record it makes it possible to accurately calculate odds of probability and chance.Only One Person we know of in recorded history has undergone this sequence of events. There is 1 chance in 82,944,000 that the man buried in the Shroud is not Jesus on this alone. Take a look at that again. The calculated odds all these match points are coincidental but the cloth did not make contact with Jesus is 1 in 82 MILLION, 944 THOUSAND. That is the bottom end lowest figure not taking into account a dead corpse by random happenstance and incredible luck left distance information on the Shroud and holographic info as a result of making contact with the linen! The numbers don’t lie. The Man In The Shroud is Jesus There is no reasonable doubt in that. To be in disagreement one would have to be in disagreement with the testimony of Dr. Pierre Barbet, Dr. Robert Bucklin and Dr. Frederick Zugibe And the skeptics are in disagreement with the ruling they made. I personally think they are flat out insane, suffering inside with some kind of sick ailment. To rule against the expert testimony is insane. Insanity = 666 in English Gematria. The number of the skeptic is 666. They are reduced to character assassination against expert witnesses so that their “pet paint or contact image theory” works. Bottom line, we either accept or don’t accept expert witness testimony I accept it. ..","date":"2015-05-17","mins":"4:34 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199714","author":"dave_hines","post":"Hello Charles, go ahead and post some of these photos you are referring to here on this site. I am a artist, I have seen and done a lot of paintings. That is how I got involved with the Shroud going through a google search of every painting and art work ever done of Jesus. If there is something you have I have not seen please post it, I will look at it. I have never seen any work of the old masters or any other artist for that matter that painted something that looked like a authentic human being. I can tell it is a painting within seconds of looking at, but that was not the case when I saw the Shroud the 1st time. It did not look like a painting at all. My 1st impression of the Shroud was “it looks authentic but it cannot be authentic” I was absolutely not convinced the Shroud was genuine when I saw it. I thought it was a 19th century photograph. Any forensic pathologist would be thinking the same before seeing The Shroud, “there is no way this is the genuine thing” fully expecting to take a quick look and then get back to taking care of genuine human patients. For starters the fabric does not look like 1 ST Century, blood stains are red, there is a image on the cloth, that would make any forensic pathologist immediately think it is not genuine. Corpses do not leave complete images behind on linens, only blood stains and perhaps some vague imprints of the body. But, Obviously something got their attention that turned them around or they would not have written books and had their whole lives turned upside down because of their involvement with the Shroud. My own life has been completely turned upside down because of it. It inspired me to write and publish a book and I am not a author. I get 500 to 1000 views a day in 211 different countries. On the Shroud videos i make. Over 300,000 views in short time. My whole llfe has been completely changed because of the Shroud of Turin. I am so deeply wrapped in the Shroud, I could not get out of it even I wanted to. My mail box is full, people asking questions. We will have to continue this at some later date. In the meantime post some of the photos you believe are evidence that support The Shroud is painted. I will look at it..","date":"2015-05-20","mins":"2:54 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199796","author":"dave_hines","post":"Hello Charles I have a splitting headache and hard pressed for time but we can certainly make time to acknowledge the good works of those who created some of the art work you have mentioned. I am not familiar with the works of art you have made reference too. Time permitting please post some highlight photos of depictions of art that would be evidence supporting The Shroud is a work of art and we will look at them. I am not close minded. I was not able to find them on a google search. On a closing note I want to add I do not have any followers, just other people who are interested in the Shroud that watch my videos..","date":"2015-05-21","mins":"5:05 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199708","author":"dave_hines","post":"Hello Hugh, you misunderstood what I said, I posted “If this linen cloth was believed to have wrapped the King of Spain in 7th Century and 3 forensic pathologists examined the cloth and confirmed “Yes, a genuine dead body was wrapped in this cloth” “But we have no idea who the person is” I said that no one would dispute that finding. There would only be a dispute if all 3 were not in agreement. Of course they would not assume a dead body made contact with the cloth before examining it. A professional pathologist would never assume anything until examining the evidence left on the linen. There have been cases tried without a body but a wrongful death was still proven beyond a reasonable doubt because of trace physical evidence left behind by the victim on clothing, linens, carpet fibers, ect. It is not common but there are many such cases. Note in my comment a name was never attached to the linen cloth. The only job of the forensic pathologists in the case scenario I laid out was to determine if a genuine dead body made contact with the cloth. That is all. Not to attempt to make positive ID on the body. If the Shroud of Turin did not have a name associated with it, and was called “The shroud of some unknown dead man” and the linen was given to 3 forensic pathologists to determine if a genuine dead body actually made contact with the linen and the name of Jesus was completely taken out of the picture no one would dispute their finding. If after a thorough examination all 3 agreed that indeed the cloth did make contact a genuine dead body “but we have no idea who the person is” NO ONE WOULD DISPUTE THE FINDINGS OR THE CONCLUSIONS DRAWN BY THE MEDICAL PROFESSIONALS. No one would say, “I am not convinced, let’s have 20 other pathologists look at that linen”: .But add the name Jesus to it, and all hell breaks loose. Now the medical professionals with impeccable credentials and successful careers just became incompetent fools and liars. Look at the comments here just about the scourge wounds. Look at what the skeptics did to Dr. Max Frei, head of the forensic police department, they accused of him of manufacturing evidence and being incompetent. Still going on to this day because he stood up for Jesus. I saw him give testimony, he was a very credible witness, did not come across incompetent or dishonest in any way. An excellent witness, a shame he passed away before his work could be finished. If these wounds belonged to someone else, and 3 different forensic pathologists all agreed they were genuine. No one would question it. We would be discussing who is the person was that was wrapped in it, not was there a dead person wrapped in the Shroud, but who..","date":"2015-05-20","mins":"2:08 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199795","author":"dave_hines","post":"Hi Hugh, I know when I say this it is pure speculation and does not hold much of any weight. But the length of the Garden Tomb grave is 5′ 11″ and it was chiseled out to make it to that size, it was not originally 5′ 11″. Man In The Shroud is appx 5′ 11″. I believe this is where Jesus was laid. I believe the attention of Joseph of A and Nicodemus was diverted from the body of Jesus to making the grave big enough for Jesus, causing further time delay and less attention to the body of Jesus. I believe a mixture of the myrrh and aloes were simply poured over the entire body to “purify the body” but the blood stains left as they were. I also believe the linen cloth itself was submerged in the solution of myrrh and aloes and is responsible for the thin layer of starch fractions and pectin that Ray Rodgers claims is there. Myrrh and aloes and starch fractions and pectin have the same sugars and chemical properties. Myrrh resin would also preserve the blood stains and they would remain red as a result. My theory only. I can test it. I will put fresh blood on the pure linen herringbone weave cloth I just bought and then apply myrrh resin and see what happens. I have the cloth, I just need some fresh blood to apply to it and then the myrrh. I have some pure myrrh resin from Egypt I just purchased. It is 100% pure. High Quality. I will post photos and or live video footage of the experiment..","date":"2015-05-21","mins":"4:33 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-206682","author":"dave_hines","post":"Hi Dan, you wrote “Or – drum roll – God said, let there be an image on the cloth. And there was” That is really funny. I really enjoyed reading that. It brought a welcome smile to my face. They say laughter is the best medicine. Thanks for the meds. I never did congratulate you on reaching the 3 million view mark on the Blog Site. Congratulations! It really is a bench mark moment. Now you are 3 million and some change. This can be a fun site to be on. A little excitement in a otherwise dull day. Some of the best info on the Shroud can be found here. Add Barry S site to that as well. Keep up the good work Dan!.","date":"2015-07-27","mins":"12:20 pm","url":"https://shroudstory.com/2015/07/25/manipulated-miracles/","cat":"image_theory","title":"Manipulated Miracles"},{"id":"comment-206683","author":"dave_hines","post":"Hi Dan, one more thing thanks for putting up some of my videos on your site, even though you do necessarily agree with the content. Much appreciated. I aspire to do better work..","date":"2015-07-27","mins":"12:24 pm","url":"https://shroudstory.com/2015/07/25/manipulated-miracles/","cat":"image_theory","title":"Manipulated Miracles"},{"id":"comment-206684","author":"dave_hines","post":"Sorry Dano, I made a typing error, I meant to say, thanks for posting some of my videos “even though you do NOT necessarily agree with the content”.","date":"2015-07-27","mins":"12:46 pm","url":"https://shroudstory.com/2015/07/25/manipulated-miracles/","cat":"image_theory","title":"Manipulated Miracles"},{"id":"comment-156112","author":"dave_hines","post":"Myrrh resin in thin layers is translucent. Starch and Pectin were identified as making up that “translucent image” By coincidence starch and pectin and myrrh and aloes all share the same chemical properties. Same sugars, same acids. Dr. Baima Ballone found myrrh and aloes in the blood of The Shroud my antibody antigen testing. Mc Crone said the iron oxide/blood was “suspended in gum arabic” Gospel of John says that myrrh and aloes was used in the burial. Myrrh is a caramel, sepia color. Is light reflective. That is all I am going to say today..","date":"2014-09-25","mins":"5:52 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157340","author":"dave_hines","post":"Hi David this is a comment made by P, Schumacher on the subject. “Iron pigment is simply not possible for image formation. Iron pigment, no matter how thin the mixture, will produce a specific spectral signature that is not present on the Shroud in the image areas, or anywhere else on the Shroud, in sufficient total area of presence to cause formation of the image. Iron pigment, when evenly surface illuminated, would produce the same reflectance response, thus producing a flat elevation on the VP 8 isometric display. This result is not observed on the Shroud. Iron pigment is more reflective than transparent. When an iron pigment is exposed to light, more photons will be reflected than will pass through the iron pigment to the other side. Some photons will be absorbed. Therefore, if an iron pigment image is lit from behind, it will “block” (absorb and reflect) more of the light than it will allow to pass to the other side. This would result in a much higher contrast photograph of the iron pigment image. However, when illuminated from behind, the Shroud image is not clearly visible. It is not discernable. The “dabbing process”, and the “iron pigment theory”, are posed together as a definitive conclusion on the “trickery” side of the “explanations pile”. Simple results of simple tests, such as back lighting the image, prove such theories are incorrect. More complex tests also prove they are incorrect. Microscope examinations of the threads shows no pigment, no binders, no “bleeding of chemicals” between fibers, and no fiber discoloration to match iron pigment. Spectral response tests prove there is no “signature” at the appropriate wavelengths for iron pigment reflection. And, density slicing tests do not show large areas of even illumination indicating pigments and binders in the Shroud image area. Yet, such “theories” are published as fact, in spite of the many test results proving it cannot be so..","date":"2014-09-27","mins":"10:42 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157341","author":"dave_hines","post":"This is another note able quote on the subject. If one considers the Shroud image to be “a work of art” of some type, then one must consider how and why an artist would embed three dimensional information in the gray shading of an image. In fact, no means of viewing this property of the image would be available for at least 650 years after it was done. One would have to ask, (assuming this is a “natural result” in some style or type of art), “Why isn’t this result obtained in the analysis of other works?” Or, if this is a unique work, “Why would the artist make only one such work requiring such special skills and talent, and not pass the technique along to others?” How could the artist control the quality of the work when the artist could not “see” gray scale as elevation? Did the artist predict the outcome before the outcome could be defined? Would an artist produce this work before the device to show the results was invented?.","date":"2014-09-27","mins":"10:48 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157794","author":"dave_hines","post":"Hi Hugh: Sorry to get off topic. Just a quick question. Do you know where the highest resolution images of the Shroud can be obtained? Do you have any? I have photos that I got from Barry S. Great quality, no complaints, but wondering it there is anything with higher resolution. I need them ASAP.. Let me know when you have time. Thanks..","date":"2014-09-29","mins":"7:10 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-206685","author":"dave_hines","post":"Hi Angel. I believe you are on the right path. No doubt further investigation is needed. Thanks for the links you posted, I’ll be looking at them. Just moved to Central America trying to get settled in..","date":"2015-07-27","mins":"12:54 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-208125","author":"dave_hines","post":"Hi Angel Everything is going fantastic here in Central America! I’m lounging in a poolside cabina underneath the palms in a tropical paradise doing Shroud Research, Along with my holography experiments I am also studying numerology. I will be continuing with holography experiments, but in the meantime this thought just came to me and I just typed it in on a English Gematria Calculator, less than 5 minutes ago. GENUINE ANCIENT RELIC =1128 There has been criticism of me presenting this as evidence that supports the “Shroud is Genuine” (1128) and that’s alright. Let them say what they want. I am in good company when I present mathematical evidence the Shroud is authentic 1.Galileo “Mathematics is the language that God wrote the universe in.” 2.Plato ” Numbers are the highest degree of knowledge, it is knowledge itself.” 3.Saint Augustine “Numbers are the thoughts of God.” My Math display at first seems coincidental but when you add 99 more coincidences to this evidence all saying the same thing and pointing to the same person it starts getting very powerful and compelling. At some point one must conclude, “these cannot all be coincidences” and I am not talking just about this English Gematria Display. This is just one display, I am talking about the whole case file. Look at how these names, phrases and words all fit in with each other and all equal the same number. GENUINE ANCIENT RELIC= 1128 SHROUD OF TURIN=1128 SHROUD IS GENUINE=1128 SHROUD OF THE LORD=1128 NAMED JESUS CHRIST=1128 JESUS OF NAZARETH=1128 SON OF GOD 3 D HOLOGRAM=1128 A SACRED WINDING SHEET=1128 JESUS INSIDE A GRAVE=1128 CLOTH IMAGE OF JESUS=1128 A PICTURE OF JESUS=1128 RISEN LORD JESUS=1128 The following 12 words/phrases listed could be referred to as DATA, In philosophy data is defined as “things known or assumed as facts, making the basis of reasoning or calculation” That said I will add one more phrase to the list. DATA IS NOT A COINCIDENCE=1128 I can add another dozen to this list equally compelling. The English Gematria Calculator is definitely not lingering in doubt in regards to the authenticity of the Shroud. The greatest thing about this witness is that he does not respond negatively to character assassination and could care less what one thinks of his testimony, has no emotions, no feelings and could care less whether The Shroud is authentic or not. Rock Solid Truthful Testimony. We’ll close this post with a quote from Pythagoras “ALL IS NUMBER”.","date":"2015-08-13","mins":"1:56 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206326","author":"dave_hines","post":"Hi Hugh: I do know how a hologram is made because I made these images with a hologram machine. I set up the laser and did it. I sat and watched and observed like any good scientist. Made images with object up close to film plate and farther away and made notes. You do not need to 2 lasers or a beam splitter to create a hologram. No mirrors, nothing like that. Only 1 laser is needed with the beam expanded. That is all. The one beam lights the subject and film plate at the same time. Both a transmission hologram and a reflection hologram can be made with a single laser, without use of a beam splitter or any mirrors. I know because I did it and saw it. The images in this video were created without use of mirrors or beam splitter, only a single laser with expanded beam. Hologram images in this video are 1/50th the thickness of a human hair. There are different types of emulsions used to coat a holographic film plate. One of them is tri acetate, (cellulose acetate) Other types of emulsions could result in a image thicker than 1/50th thickness of a human hair. Myrrh and aloes have the same chemical properties as cellulose acetate. Acetate fabric could be used to record an interference pattern. I just bought some. Only a place in the world I could find still makes it. I just moved to Central America or I would write more. May the Spirit of good cheer, good health and good fortune be with you in the great country of Great Britain!.","date":"2015-07-22","mins":"10:05 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206352","author":"dave_hines","post":"Good Evening Hugh, I read your reply. Interesting. Thanks for taking your personal time to write that reply. One’s Time is valuable gift. Thanks for the gift of your time. I am going to go off topic for a second then we’ll get back to the match points/similarities I made between a holographic image and the Shroud Image. I estimate your IQ on a low end to be 120, on a high end 140. Best Estimate 130. Let me know how close I came. My point. You are to smart to believe The Shroud is a painting. It is completely out of place with your character. It does not fit. If you owned a car lot, it would likely be full of Jaguars, Mercedes, BMW’s, Lamborghini’s and Ferrari’s. Your stating you believe The Shroud is a faded painting would be like you having a old beat up Ford Pinto in the midst of your luxury cars for sale. It doesn’t fit. Sometimes I think you are paid to plant seeds of doubt into the authenticity of The Shroud. Like a paid job. I also believe in innocent until proven guilty. Please correct if I am wrong. Are you paid to plant seeds of doubt into the authenticity of the Shroud? If I was in a high authority position with a lot to lose in a financial sense if the Shroud was authenticated I would be looking for someone like you to put stumbling blocks in front of people and steer them in the opposite direction. “to keep business as usual” You can take the 5th amendment on that question. I am not asking this in a disrespectful manner. As a defense lawyer for my client, The Man In The Shroud/Jesus, it is my job to do this and ask these types of questions. In order to defend my client I have to gain empathy with those who set out to scourge and crucify him again. If I don’t ask these types of questions I do my client a dis service. No offense to you was intended. It is my job. I am not paid to do it. Pro bono work. Lets go back to the beginning. 1. Holographic info on the film plate is 1/50th the thickness of a human hair. That info comes from the corporation that made the holography equipment. I did not just make that up. You wrote “The thickness of a thick human hair is about 160um, the thickness of the enamel on a hologram about 8um, the thickness of the image on the Shroud is about 0.002um” Holographic images fade over time and lose some of their holographic qualities. So has the Shroud. So the Shroud image at one time was 8um and now it is only .002um. That is what one would expect after almost 2000 years. 2. Resolution of a Holographic Image and The Shroud image are very close. Nothing out of place there. 3. Laser light diffracted will have constructive and deconstructive waves. Colored and uncolored areas on film plate/linen would be the result. What is actually only 3 D information could be falsely perceived as being distance information when it is actually not. 4. Holographic image on linen when viewed from the back would not be visible. Shroud image is not visible from back. Ray Rodgers believed the image was within the thin coating on the fabric, not on the fabric. I believe he was right. 5. The body of Jesus is the light source, eliminating the need to bounce a laser beam off the object. The object is the laser beam. Laser light was expanded & diffracted, interference pattern was recorded on linen. Subject was close to linen. 6. Eye witness testimony states the image does fade and vanish when viewed from the far left and far right. Photos and paintings and simple contact images do not do that. 7. Shroud image is a single color, Laser light is a single color, and a interference pattern of laser light would result in leaving some areas colored and others not. Match again. 8. Exactly how close body was to cloth at time of image formation is not known. I noted that when the object being replicated was past 5cm there was no image formation. I do not believe that was another coincidental match. In the early centuries the Shroud was called “the Image of Edessa, the image not made by human hands” Then then there is the famous quote from Constantinople, “The image is extremely faint, more like a moist secretion, without pigment or the painters art” Why were they so convinced this was not a painting? What made it stand out so much apart from all other images? An English Gematria Calculator is my corroborating witness that will answer that question. First 3 D Hologram Made = 1128 3 D Hologram on a Mantle=1128 Son of God 3 D Hologram=1128 Shroud of Turin = 1128 Jesus of Nazareth= 1128 Behold the Image of Edessa =1128 Its not a painting=1128 No one had ever seen a hologram on linen before. It has not even been done in this day and age…yet..","date":"2015-07-23","mins":"1:12 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206491","author":"dave_hines","post":"Muy buenas tardes Antero de Frias Moreira! ¿Puede hablar a español? Apenas llegué aquí en mi casa de vacaciones en costa rica, ¿qué país provienen? No dude en escribirme en Español Si quieres. Ya que escribo mejor en ingles y también tiene buen inglés permite probar ese idioma. Another coincidence that is noteworthy is that human DNA oscillates at a few billion cycles per second and emits a weak laser like light in the UV range, each time it contracts, it releases 1 photon of UV Light. That is appx a few billion photons per second. What if that process was amplified by someone who knew how to manipulate it? Like The Creator of DNA for example. I would like to see the Shroud myself on a flat piece of glass standing upright in a dark room with light coming from only 1 direction straight on and then tilt the image to the far left and then far right, up and down. According to the person who examined The Shroud in a similar manner, he stated the image vanished when going to the far left or far right and at one angle it appeared as if the body/image came out of the sheet. That is exactly what a hologram does. There is a specific angle when titled to the right or left where the object appears to come right up out of the glass. A extremely unique optical illusion. It is a very specific angle this occurs at and is very hard to hold the moment. The slightest shift or movement any way and it will vanish. I filmed such a moment in this video. Thanks for the link you provided, I will read it again. I have seen it. Lets make a list of “coincidences” 1. Shroud image is extremely superficial. Hologram image extremely superficial 2. Shroud image not visible back lit. Hologram image not visible from back side 3. Shroud image is one color Hologram image is one color 4. Shroud image consists of colored fibers and uncolored Hologram image is the same Laser light diffracted off an object will result in constructive and destructive wave patterns, on a piece of linen this would result in coloration of some fibers and others not. This could only be observed to be true only when viewing the interference pattern under a microscope or put under a VP analyzer. Shroud of Turin has such info encoded into the linen. 5. Shroud image becomes vague or vanishes when viewed from far left or far right Hologram image is the same. (According to eye witness testimony, not myself personally) 6. Shroud image at a specific angle appears to come out of the sheet. Hologram is the same 7. Shroud image has very good resolution. Hologram image has very good resolution. 8. Shroud image is faded and getting weaker. Hologram image fades over time. It is not illogical to conclude Shroud image is the result of a interference patter of light. Very focused light of a single wave length. Where the theory starts going south is when it is explained the body is the light source. This has never been observed in Science. Also during the process of making a hologram there can be no sound vibration. Object must be 100% static. Cloth must also be 100% static. Interference pattern is easily disrupted resulting in no image at all. Those are things I cannot explain other than to say the person/intelligent force in charge image making process has the ability to place a electromagnetic field around a cloth and body and hold it in place and or create a zero gravity environment during image process. And make sure there are no sound interruptions during the image process. A tall order, only a “Higher Power Intelligence/God would be capable of filling. Gracias por responder a mi post. Puede el espíritu de la buena fortuna, buena salud y buen ánimo con ustedes. Amén.","date":"2015-07-24","mins":"6:07 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206687","author":"dave_hines","post":"Buen Dia Antero de Frias Moreira! Hoping this day finds you with a spirit of good cheer and good will toward others! I cannot call myself a expert in anything, (although I might want to) I aspire to be an expert but I am not one. I am one of those kind of people who fail their way to success, the kind of person who would try to take the short cut in getting the cross up the hill and end up making it 3 times more difficult than it had to be. A bit impractical and impatient. The kind of person who underestimates how difficult the journey is to the other side but plunges ahead anyway, boldly/foolishly ( walking that fine line and stepping into both at times) then find myself in the middle of the jungle and having it dawn on me “this is much harder than I thought” but having gone so far that turning back is no longer a option. That is where I am today. In the middle of the Jungle wrapped up in the Shroud, attempting to unravel its mystery. All we can do is “enjoy the journey” and take time “to stop and smell the roses along the way” Thanks for the rose you put in my path. I can see that it is genuine, not a paper rose. I’ll keep it in a memory bouquet. Thanks also for the links you posted..","date":"2015-07-27","mins":"1:24 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206922","author":"dave_hines","post":"Buen Dia Antero de Frias Moreira These are things I am not a expert in, but are my primary research areas/ fields of interest 1. ELF wave Research since 2010. Over 1000 hours logged in on actual field research in dozens of locations. Some would consider this paranormal research. I believe it is possible to use ELF (extremely low frequency waves) as a means of communicating with a Higher Power Intelligence and or to detect presence of a life form that is non material, spirit. I am a life after death researcher. (My equipment set off the security alarms at the airport and I was questioned by airport security, I told them I was a Shroud of Turin and a paranormal researcher, can you believe they did not know what the Shroud of Turin was? I had to give a brief seminar explaining it. 2. I am a published author and portrait artist. I like to do replicas of famous paintings, Van Gogh, Caravaggio, Botticelli, Da Vinci, Thomas Gainsborough, El Greco, 3. Shroud of Turin Research 4. Holography 5. Making Films Spiritual Talents 1. Automatic Writing: Ability to write messages with guidance from a Higher Power. (Average skill level) 2. Clairsentience Ability to pick up energies and emotions from people, places and things, ( High Skill level. ) 3. Channeling Ability to receive message from Higher Power. (Above Average Skill) 4..Psychometry: Involves being able to pick up vibrations left on an object by someone connected to it. To receive information from photographs, places. Also known as object reading. (Average skill level) Everybody has talents like this whether they know it or not. The FBI takes these talents seriously, seriously enough to use physics in unsolved murder cases. Some of the results obtained from physics astonished forensic detectives and have solved many cases. What are your talents/field of research?.","date":"2015-07-29","mins":"11:48 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206493","author":"dave_hines","post":"Yes, why not? Hologram image and Shroud image qualities are extremely similar. I forgot to add another thing. Myrrh resin was used as a UV protectant in ancient times. This would help prevent ablation from occurring on the fabric during image process. It does say Nicodemus purchased an abnormally excessive amount of it. Easily enough to cover the body of Jesus and the entire 14′ cloth. A pre resurrection covering, the Spirit of God knowing in advance there would be some strong UV light involved in the resurrection process he did not want the cloth or his Son to get “burned” but to get a good sun tan. A caramel color not a red burn color. A maillard reaction, browning effect on the cloth..","date":"2015-07-24","mins":"6:33 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206472","author":"dave_hines","post":"Hello Hugh: I did not accuse of you anything. I asked a question. It is my job to do that. I could be wrong. I am open to that possibility. In the same way I was open to the possibility that the Shroud of Turn actually made contact with the body of Jesus and is physical evidence of his resurrection. Of which when I 1st saw the Shroud I thought the odds of probability and chance the Turin Shroud actually made contact with the body of Jesus was at best a 1% chance of being possible. But I will still open to the possibility. Extremely improbable and unlikely, but possible. My investigation started at that point in 2009. “not convinced” I wrote “I estimate your IQ on a low end to be 120, on a high end 140. Best Estimate 130” That is a compliment. Only about 2.3% of the population scores 130 or more on a IQ test. I put you in the range of “extremely gifted, talented, above average intelligence” Einstein scored 150 or 160, I cannot recall which is the correct figure, but it was high. You are in his range. Based on your extremely high level of intelligence it is out of place for you to believe The Shroud is a painting. It is in complete disagreement with the forensic evidence. I have many times been accused of trying to cash in on the Lord’s sacrifice because I wrote a book. When asked if money is the motive behind my work, I answer the question. Because this happened so frequently I stopped promoting my book. Never include it in my videos even though I reach 500 to 1000 people a day. That is like committing professional suicide. My publisher thinks I am insane not to capitalize on it. When I am asked about my book I give it away for free at my own cost. Spirit of God rewards me in ways that words cannot adequately describe. Gifts more valuable than gold. Your posts are Extremely informative. Thoughtful, intelligent. Well written. On a closing note I suggest only that you be more open minded to the possibility that the Shroud is genuine. If I was not 100% convinced the Shroud was authentic I would not bother posting or ever make any statement regarding the Shroud. Convinced or not, there is no in between. At some point a decision needs to be made, “to cut off from any other possibility” Spirit of Gods needs a person without doubt, bold and fearless to represent him. Like Paul of Tarsus. Without fear and without doubt. I have no doubt in my heart, mind, body or soul in regards to the authenticity of the Shroud. 100% convinced. It was in 2012 when that happened. After 3 years of study. 3 is a number of completeness. No offense was meant to you by my question. I am only doing the job the Spirit of God requires of me..","date":"2015-07-24","mins":"12:30 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206484","author":"dave_hines","post":"I missed that. Thanks for clarifying. Much appreciated..","date":"2015-07-24","mins":"5:04 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206563","author":"dave_hines","post":"Good evening Hugh, It is actually 2:30 AM your time but 6:30 PM my time. Good middle of the night is perhaps more appropriate? I was more than open minded was the Shroud was not authentic. At the beginning I was 99% convinced it was not a cloth that made contact with Jesus. My idea of the burial cloth of Jesus would be more like a very old fabric in poor condition with only blood stains on it and nothing else. No image. How I got convinced the other way? That is a long story. For the last 7 years I have been getting up every morning and saying the same prayer. A scientific experiment to find out this, “Is there a Higher Power/God or not?” Part of it goes something like this “Lord grant me that I am not so much seeking to be loved, consoled or understood, but to love, console and understand others. Lord your will be done, not mine, guide me in thought and action toward that, and grant me the power to carry it through today” The results of this on going experiment have been astounding. I would be writing for next month straight to make a list of all the events that have occurred over this time. Many were documented and put into a book I wrote. I am not author, I never wanted to be one. I sold real estate and I was a percussionist in a rock band. I was a personal trainer. Heavy into bodybuilding and going to night clubs and drinking every night. The Shroud of Turin was about the last thing on this Earth I saw myself ever getting involved with. Many times over these last 7 years I have seen up close and personal physical evidence of the Spirit of God in my life. It has been proven to me beyond any doubt such a “Higher Power/God” does indeed exist. I am convinced and I am not easily convinced. It is a requirement of the Spirit of God that I attempt to gain empathy with others. That involves having to ask questions to so that I can gain that understanding and empathy with that person. It is my duty/job/obligation to do so. I did not say I was good at it. I believe if one aspires to be a true scientist that person must be open minded to the possibility that Jesus rose from the dead and the Shroud is physical evidence of that event, if not, it would be not unlike a defendant walking into a courtroom and the possibility that he or she is innocent is not even considered a possibility. God forbid anyone be guilty of that. We have all seen unsolved murder cases where the forensic evidence told a highly improbable unbelievable story. One that comes to mind is a case where the forensic evidence and the pathologists report told a story of 2 parents that held down their daughter and stabbed her to death. The parents story was that their daughter demanded $5,000 and attacked them with a knife. It would be very difficult for a jury to accept the forensic evidence side of the story. Difficult for one to imagine holding down your own daughter and plunging a knife into her chest cavity 7 times. It turned out the FBI suspected one of the parents was a terrorist and the house was wired. They went back and listened to the tape. The entire event was caught on audio The unbelievable story turned out to be exactly what the forensic evidence says happened. The Parents held down their daughter and plunged a knife into her while she begged and screamed for them to spare her life. They did not like the boy she was dating. He was black. That was the reason. She never demanded any money, never had any weapon. The parents even stabbed themselves to make it look like they were in a fight Perhaps not a good comparison story that relates to the Shroud, but the point is the forensic evidence on the Shroud tells a tale of a extremely improbable event, one many people would have difficulty accepting or believing. What is the forensic evidence on the Shroud telling us? What does the pathologists report say happened? What is the VP 8 analyzer telling us?.","date":"2015-07-25","mins":"9:29 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206559","author":"dave_hines","post":"Hello Daveb of Wellington: I always enjoy reading your posts. I really think you should write a book. It would be a shame if all your knowledge of the Shroud and comments you have posted over the years could not be somehow documented and put into writing. Many people would benefit by it. I don’t think there is any trouble with your hearing, it is more my northern U.S. Accent that is to blame here. Bottom Line: I need to produce the image on linen. Show it. Until that is accomplished it all just speculation, talk and theories. It does not matter what I believe only what I can prove. I made this video because I wanted to document where I am at this time. I felt a strong need to do so. “If life is worth living it is worth recording” To say the Shroud image is the result of a interference pattern of laser like light is not a complete explanation. I believe in part, that is how the image was formed. But there is more to it than that. One step at a time. Get the image on linen then move ahead after that. See what a interference pattern looks like on linen. 1st things 1st..","date":"2015-07-25","mins":"7:57 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-208169","author":"dave_hines","post":"Hello Hugh: Bear in mind all the things I listed when typed into a google search all go Jesus or the Shroud of Turin. All of them. When typing in the word “perfect” in a google search does it go to crazy, sexy or bi polar? NO. Those are 4 unrelated things that coincidentally have the same number, The acid test to make this determination is to put the word/phrase in a google search and see where it goes. Do they all go the same thing/subject? When A body of evidence is collected at a crime scene it also goes through a process of scrutiny to determine what items collected are related to the crime and what is not related. To separate “the wheat from the tares” A good example is the one you listed Which of the following does not fit in with the rest of the group? 1.Mark of Beast 2. Demonic Evil 3.The Eden Snake 4.Satan’s Seal 5. Dan Porter When typing in the name Dan Porter on a google search does it go to Satan or things relating to the Devil? No. What about the others? mark of beast, demonic evil, satan’s seal, Are they related? Yes. There is nothing in the character of Dan that would suggest any connection to a supernatural evil force. His name is obviously out of place. Thus that piece of evidence collected is not part of the “main body of evidence” and is put aside and disregarded. Another example: Evidence collected at a crime scene Which of the following pieces of evidence collected a crime scene in which the victim was shot and stabbed to death does not fit in with the rest of the group. A. Gun b knife c. Bloody clothes d Shell casings e Deck of playing cards (no prints found or DNA collected from cards) The acid test to know if there is a connection are things with the same number that are also related to each other. Past 7 matches is where it gets a little attention. Past 12 (A number of completeness) is where it get’s more compelling. Many of the matches I found were done on the 1st try. “Genuine Ancient Relic” is one of many among that list. “Shroud is Genuine” is another, There are over 50 words/phrases that relate to the Shroud and Jesus with the same number. Each one of them when typed into a google search go directly to Jesus or the Shroud or both. You would be hard pressed to find 12 words/phrases with the same number that directly relate to the chosen person, place or thing. Jesus and The Shroud and words/phrases relating to Jesus and The Shroud at 1128 may have the most match points of any word in the English language. Over 50! I believe is noteworthy. Messages/clues left behind by the Spirit of God, Spirit of God will let one know and help each person seeking his will to be able to make clear distinction between what is genuine and what is falsely perceived. To know intuitively and or by sight, feel, or touch, or smell what is genuine or not. What is a paper rose and what is a genuine rose. Who is lying and who is not. What is a good purchase and what is not. A guide, and counselor. Spirit of God tells me these match points are not a coincidence. My Point Is: This is not just about finding things with the same number, but things with the same number that are related to each other. By itself this Gematria display does not hold much weight, it belongs with the rest of the body of evidence. Just another “coincidence” among many that link the Shroud to Jesus..","date":"2015-08-13","mins":"12:09 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-208232","author":"dave_hines","post":"Thanks Dan. That’s alright. Its just one display. It was not meant to take up so much space on your blog site. I hate to see space wasted on the same topic. There are many other aspects of the case file that are so much more important. Sorry if this got a bit out of hand. Feel free to delete my posts to free up space. I do it all the time. I would not be offended. Thanks for having me on the site and allowing me to post. You are doing a really good job. Very informative site. I am kind of a oddball character. I don’t fit in very well with the rest of the regular crowd that posts. An outsider. May The Good Lord Place his Holy Spirit upon you. A spirit of power and love eternal, a spirit of good fortune, good health and good cheer! Amen..","date":"2015-08-14","mins":"5:00 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206598","author":"dave_hines","post":"Good afternoon Hugh but for me it is morning I am not a expert in holography, but with the equipment I am using a reflection hologram requires the object being replicated extremely close to film plate. Light source comes from an angle from above and goes through film plate 1st. Object is behind film plate. A transmission hologram is different. Light hits object 1st then the film plate. Direction of light is not at a angle but straight on in a transmission hologram. The laser beam is split/expanded because the lens is removed illuminating both object and film plate. Could DNA emit a expanded beam of laser light that would result in diffraction when being emitted from human body resulting in a interference pattern? Possible. If we aspire to be great forensic detectives we need to have expansive thinking and consider all possibilities In a transmission hologram object can be further away film plate and still record a interference pattern. I am not sure why that is so. All that would be required to create a interference on the linen would be for the laser light coming from DNA to be diffracted. This is another case where the forensic evidence tells a highly improbable incredible story, very difficult to accept or believe. This has never been observed in Science. For one to not to accept it, is completely understandable. I am not anticipating many will. Also noteworthy in a hologram is that you cannot over expose the film that I am using. It takes about 5 minutes to create a hologram with my equipment. If I over expose the object to the light, it makes no difference. I could leave it on for 1 hour if I wanted. In fact it can even help make a better image. But unlike photography there is no danger of over exposure. Of course in a hologram a laser is bounced off the object, but in the case of the Man in the shroud, he becomes the laser eliminating the need to bounce a laser off him from another source To offer a theory that laser light coming from DNA is diffracted and a interference pattern is created as a result is certainly not stretching the imagination that far. DNA does emit laser like light in the UV Range. That is a scientific fact, not a theory. But that process would need to be amplified and controlled. It would require the original creator of the DNA to be involved in The Shroud image process to pull off such an incredible feat. One who has detailed knowledge of what DNA is capable of doing. I would describe such a person as a “Higher Power Intelligence/God”.","date":"2015-07-26","mins":"10:24 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-208188","author":"dave_hines","post":"Hello Hugh: An example of debunking Gematria and replicating “my painting of words” would involve choosing a famous person, place, or thing with a rich source of words associated/related to it. As rich a source of words that could possibly be. For Example Led Zeppelin is a famous group with many words associated to them. Led Zeppelin =744 Peter Grant=744 If I type in Peter Grant on google, Led Zeppelin will also come up, they are related. Those are 2. 12 are needed. Only 10 more needed to debunk my evidence as not genuine. How hard can that be? Should be easy to do. Yet it is not. I could not find any more. If I tried harder I think I could come up with a few more. If this was random good luck and coincidence I should be able to type in names of the group, songs they wrote and at least one of them should come to 744 by random happenstance. I am sure there is a better example than Led Zeppelin. I am sure you get the idea. It is not as easy as you would think. In a unsolved murder case there is often coincidental evidence that links a suspect to a crime. In the cases where there are only a few coincidences that link a suspect to the crime it often turns out the suspect is not guilty and was not involved. However, in cases where coincidences add up past 7 things, I have never seen a case where that suspect was actually not involved and the 7 coincidences linking the suspect to the crime were coincidence only. Numbers that repeat themselves over and over again always get the attention of a good forensic detective and or a professional handicapper. If I claimed to be a mind reader and asked a person to pull a random card out of the deck and repeat that card to themselves in silence and I told that person what card they were thinking of on the 1st try, does that mean I am a mind reader? No, that could happen by random coincidence, a lucky guess. A coincidence. Yes there are coincidences. But what if I did it 7 times in a row? People would think I am receiving information either by trickery or by a higher power intelligence. These phrases and words relating to Jesus and The Shroud all being the same number, 1128 repeat themselves so many times I cannot pass it off as just coincidence..","date":"2015-08-13","mins":"4:22 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-208172","author":"dave_hines","post":"Hugh demonstrated that he can find words with the same number not related to each other. Anyone can do that. He has failed to come up with the name of a person, place or thing and then find 12 other words/phrases directly relating to it with the same number. What ever list one comes up with, each word/phrase when typed in a google search must all go to the same person, place or thing. That has not been done..","date":"2015-08-13","mins":"12:25 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-208175","author":"dave_hines","post":"Hello Dan: In a comparison analogy, “I made a painting of words” I am not asking one to explain how that was done, but to make a replica of my painting. One that matches all of it’s unique characteristics. If my evidence is only a “painting” it should be easy to make another “painting” that looks just like it, even a shortened version. Just the Face. 12 matches instead of 50. Like The Shroud of Turin, one can explain it is simply a painting or contact image but then when asked to produce the replica in the way explained it does not match the replica?! To debunk something or provide compelling evidence that something is genuine or not, one must present evidence in a visual sense, a genuine demonstrated reality, I want to see a replica of my “painting” Not a explanation of how I painted it..","date":"2015-08-13","mins":"1:41 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206606","author":"dave_hines","post":"Good Evening Hugh, It is afternoon here in Playa Grande. A good place to take a vacation if you like a deserted type beach town, a lot of wide open space. Nature trails. A lot of privacy. Monkeys and lizards. Let me know if you are coming down and I’ll get you a nice poolside cabina. As low as $20 a night. Room with AC a little higher. Free WI FI, you can work from here too. Very laid back here, nothing to worry about. Bear in mind when myrrh resin dries it becomes light reflective and glossy. But of course there other types of myrrh resin that when it dries is opaque. Many different types of commiphora plants in the world, Myrrh is one of the key ingredients involved in the image process, making it possible to convert a opaque surface into a light reflective surface. You are one of the fastest responders on the Blog Site. A sign of good character. Responsiveness. A good time now to pause and reflect on things we are grateful for as the sun goes sets over Great Britain. Enjoy the evening!.","date":"2015-07-26","mins":"1:00 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206592","author":"dave_hines","post":"Hi Angel Laser light can travel in any direction. Laser light will travel in the direction the laser is pointed at. A single wavelength, a single color. Shroud is a single color. When one tries to imagine a artist doing a painting, at the very least one would think to at least color the hair brown, not straw yellow. Having myself done no less than 100 portraits I cannot in my wildest imagination ever conceive of myself or any artist doing a 14′ Jesus painting and use only 1 color?! Extremely out of place. You wrote “If Jesus were suspended between the top and bottom halves of the linen, the front of His body would have emitted light vertically upward, producing the frontal image on the Shroud and the back of His body would have emitted light vertically downward, producing the dorsal image” Yes, laser light could produce that effect. Not only vertically, or horizontally, but any direction, any angle. I will add a scientific fact to this that may shed some light (no pun intended) to how the Shroud image was formed. DNA produces a weak laser like light in the UV range. A few billion cycles per second. With each contraction a photon of light is produced. What if that process was amplified… Could it result in laser like light coming out of a body? Yes, it could, it is possible, however improbable as that might sound, it is possible. . In the same way a painting is not done in a single moment we cannot assume the Shroud image occurred in a single moment just because light is involved. Image could have been formed in sections, one part at a time. Not lasers firing off all at the same moment, but in systematic sequence. Starting from one point of the body until the entire body was replicated on both film plates, the Shroud linen in this case. I have a hologram machine set up in my room right now. I can make either A. A transmission hologram B. A reflection hologram There is another called a white light transmission hologram which I am not set up to make. In a reflection hologram the object is behind the film plate, in a transmission hologram the object is in front of the film plate. Shroud image would be more of a white light transmission type hologram Only a single laser was used to make the hologram in this video with the beam expanded. No mirrors, no beam splitter. A single laser can serve both to illuminate the object and the film plate at the same time. It is not as complex as a procedure as one might think. When one thinks of a making a hologram they think of needing a beam splitter and use of mirrors. It is not true. When a hologram is made it records a microscopic pattern of bright and dark lines due to the interference pattern of light. When light is passed through the hologram the light diffracts off the captured pattern, bending the light to look like the original object. When a laser beam is expanded and the light is seen on a solid black surface it appears as tiny dots of light, not unlike the tiny dots on a television screen. A hologram records the intensity of light and the direction it was traveling when it hit the film plate. Object must be extremely close to film plate to record a interference pattern. At least with the equipment I am using. I am not a expert in holography but I do know how to make one and have observed and watched the film plate in a dark room during the image process and have experimented with object being replicated close to film plate and farther away. After object being replicated is even a short distance from film plate there is longer image formation. Object must be close to film plate, which in the case of the Shroud would be body of Jesus When 2 waves come together, such as 2 waves from 2 beams of laser light or a single laser with the beam expanded the combine to make one wave pattern. If the peak of one wave combines with the peak of another you get a wave twice as big, this is called constructive interference. If the peak of one wave combines with the valley of another you get no wave at all. This is called destructive interference. If this same process occurred on The Shroud linen it would result in some fibers colored and others. This is exactly what we see on the Shroud of Turin. Some fibers colored others not. A interference pattern. Colored vs uncolored fibers. The colored and uncolored fibers on the Shroud show up in a VP 8 analyzer as accurate 3 D info, To offer a theory this happened by random happenstance or coincidence is not logical. It would be not unlike a person wining the lottery every time they play and one saying it is just random good luck and incredible coincidence. “No higher power intelligence was involved or advance into was given to that person” “Just incredibly lucky”.","date":"2015-07-26","mins":"8:16 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-106292","author":"dave_hines","post":"After reading Ron’s comment I pulled up the photos I bought from Barrie and looked at the gap. Ron is right, there is a large noticeable gap between the 2 images. Of course there is also the water stain that is being “falsely perceived” as being the beginning of the image, when it is not. Like has already been mentioned the image was formed by a light source (likely individual laser beams 1/100th the thickness of a human hair) working in a vertical fashion. It is consistent with the entire Shroud image. No side image anywhere. As for the chin band, it seems obvious that this was used. You can see it on both sides of the face. The lines it made on both sides of the front image. Top of the head problem is not a problem. 1. Image is strictly vertical to the horizontal plane 2. A chin band was used (not the Sudarium) It is a combination of both factors that the image appears the way it does. I know I just repeated what Ron just said. And for whatever it is worth, The Lord confirmed it with me personally that a chin band was used and the image is strictly vertical to the horizontal plane. I thought I would ask the person who image is on The Shroud. That is the answer I got. I am very aware of the fact that the mental health of a person who claims to have communication with the Spirit of God would be in question for making such a claim. Nonetheless, I am doing it anyway. For me this matter is closed and my questions answered. Thanks for letting me post on this blog. I really enjoy reading the comments on it. May the Power and Love Eternal of The Holy Spirit Be With You All. Amen.","date":"2014-04-30","mins":"12:35 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"}]
