[{"id":"comment-194408","author":"dave_hines","post":"I love reading your commentary. You did mention you wanted to talk more about the “message of the Shroud” this video falls kind of falls into that category. I highly doubt this is what you had in mind. Discussing a blood stain that took on the shape of # 3. I do believe the Shroud image was more intended for our own times. More people have seen it in the last 100 years than in the last 2000 years. There are 2 Possibilities. 1. Blood flowing from small puncture wound/wounds by random chance took on shape of #3 2. Blood flowing from small puncture wound/wounds did not randomly take on shape of #3. If a random event, we should see other examples of this occurring in other cases where the head of someone suffered small puncture wounds or any type of wound for that matter. Random events repeat themselves more often. Should be able to find other examples of this happening by random occurrence. If not, it starts looking like it is not a random event. Unfortunately this type of research would involve having to look at the photos of thousands of dead bodies or photos of people who suffered a head injury that caused blood to flow..","date":"2015-03-25","mins":"5:19 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194444","author":"dave_hines","post":"3 More Coincidences? 1. “For You will not abandon my soul to Sheol; nor will you allow Your Holy One to undergo decay” Coincidence: No evidence of decomposition on Shroud, dead body could not have been in Shroud more than 3 days. 2. “And the soldiers platted a crown of thorns and put it on his head” Coincidence: Pollens from Gundelia tournefortii, (Not the kind of plant that would have been used as a funeral bouquet) an extremely fearsome looking thorn plant are present around head and upper scalp area of Man In Shroud and extending to its vertex are at least 30 blood flows from spike/small puncture wounds. 3. New Living Translation Paul of Tarsus “Oh, foolish Galatians! Who has cast an evil spell on you? For the meaning of Jesus Christ’s death was made as clear to you as if you had seen a picture of his death on the cross” Coincidence: The pollen trial on the Shroud goes from Jerusalem to Edessa and into Central Turkey where Galatia was in that time. The entire Shroud of Turin case file is one coincidence after another that all point to the same person as being the person wrapped in it. I could list up to 100 more points like this quoting scripture and the forensic fact that is “coincidentally” in agreement with the historical record Each display given a numerical value of weight, say 1 lb. By itself, one piece of evidence does not carry much weight, like the #3 bloodstain, it is not proof of anything, it’s circumstantial, but when circumstantial evidence starts increasing in numbers, like replicating mitochondria DNA, A complete profile/ more clear picture can be seen. Process of elimination also takes place as numbers increase and the weight gets heavier. At what point as the scale continues to tip further and further as each 1lb weight is put on the scale does one wave the white flag and say “these cannot all be coincidences” The Man In The Shroud Must Be….","date":"2015-03-26","mins":"2:32 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194452","author":"dave_hines","post":"Hi Sampath Here is the complete list of “3” Coincidences listen to your inner voice and trust your gut feeling, what is it telling you? 1. Jesus prayed (3) three times in the Garden of Gethsemane before His arrest. 2. Jesus was on cross for 3 hours 3. There were 3 hours of darkness while Jesus was on the cross 4. NASA confirmed there was a blood moon in Jerusalem on Friday April 3, 33 AD 5. Jonah was in the belly of the whale for 3 days 6. After Elijah was taken into heaven skeptical roman soldiers searched for his body for 3 days but did not find him, only his Shroud/Mantle was left behind. (Preceding Event to the Resurrection) 7. Jesus’ ministry on earth was 3 years and he was 33 years old at death 8. Jesus is 1) Prophet, 2) Priest, and 3) King. 9. There were 3 witnesses to transfiguration of Jesus, 10. During His ministry Jesus raised 3 people from the dead. 12. There were 3 crosses 13. The inscription on the cross of Jesus was in 3 languages. (Showed completeness of His rejection by man) 14. Peter denied Jesus 3 times, 15. Later Peter told Jesus he loved him 3 times 16. Judas betrays Jesus for 30 pieces of silver 17. 3 Samples of Shroud fabric are sent to 3 different labs 18. Shroud of Turin is 3 over 1 herringbone twill fabric 19. 3 women and 3 men were present at burial. 20 Jesus appeared to his disciples 3 times after being resurrected 21. 3 witnesses to Resurrection, Shroud, Sudarium, Empty Tomb 22. It took Saint Joseph and Mary 3 days/3 nights to find Jesus in the Temple; Talking with the elders for 3 days 23. Jesus received 3 gifts at birth, gold, frankincense & myrrh (same at death) 24. Jesus was in the tomb 3 days 25..Jesus said he would rise after 3 days & temple will be re built in 3 days 26. God’s attributes are (3) omniscience, omnipresence, and omnipotence. 27. God’s essence is that of a Trinity (3) Three in One: Father, Son, and Spirit. 28. Three (3) denotes divine perfection and completeness 29 Jesus died at the 9th hour (3 p.m.). 30 The Number (3) is the number of resurrection 31 The NUMBER 3 is written in blood on the right side of the forehead of Man in Shroud 32. The NUMBER 3 bloodstain is 3cm long!!!.","date":"2015-03-26","mins":"4:37 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-195230","author":"dave_hines","post":"Hi Sampath, here are some more coincidences that occurred with the number 3 recently. I filmed it. I got on my knees and asked in the name of Jesus to place a moving electrical signal in front of my ELF sensor oscillating at 3.333 cycles per second and it happened! 4 number 3’s Today is 4 3 There are 2 possibilities 1. The events are related 2.The events are not related. One could argue my ELF sensor was falsely perceiving there was an electrical signal in the room or just displaying the number sequence I asked for so my feelings would not be hurt, or I somehow gained the ability to be able to control the number of times an electrical oscillates in one second with 4 decimal point accuracy. I cannot. But the Man In The Shroud/Jesus can. It is said it is not possible to scientifically prove the Shroud is genuine, WRONG. “All things are possible to he who believes” Enjoy the Holiday weekend. Spirit of God often leaves clues behind in the form of numbers. 033.","date":"2015-04-03","mins":"2:19 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194446","author":"dave_hines","post":"There are 2 Possibilities. 1. Blood flowing from small puncture wound/wounds by random chance took on shape of #3 2. Blood flowing from small puncture wound/wounds did not randomly take on shape of #3 Same deal with 3 D Info/distance info. There are 2 Possibilities 1. Fibers on outer shroud fabric are colored and others are not are a random event 2. Fibers on outer shroud fabric are colored and others are not are NOT a random event It was either planned or not planned. Created and designed that way so that at a later date in time when technology increased a VP 8 analyzer would interpret the data as elevation and 3 D figure of original subject could be reproduced. Or the fact some fibers are colored and others not are just a random accident, like the number 3 bloodstain….","date":"2015-03-26","mins":"3:16 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194502","author":"dave_hines","post":"Good Afternoon: Good points. Good Comments. When you have time could you go on Shroud Scope and map out 2 points on both negative and positive image? The goal being to determine the exact length of the skull of Man In The Shroud. Can you make points where you believe the forehead begins and where the chin ends? As close as you can get. You are more than qualified to make those determinations. What is that number exactly? Then when you have time could you take screen shots of both and post them here? I don’t care if there is a line drawn in the middle of the face in the screen shot. 1. Using the negative 2. Other using positive That way lines are established. I will do overlay based on the points you map out. When the overlay is done we will cut off the portions of the images being overlaid so we are only seeing the length of the head, from top of forehead to bottom of chin. Lines must be established that are not crossed so as not to tilt the scale in favor of a match when in fact it is not. Sword cuts both ways on that. Only then can the most accurate overlay be done. GOAL: Determine exact length of the skull of Man In the Shroud, next overlay will be based on the points you map out. Note for the record I never used the word “proves” or that the Manoppello image was a contact image, only that it is believed by some to be a contact image. The way in which the Manoppello lines up with Shroud is evidence that supports it could be contact image. That is all. It does not prove anything. That I agree with. Hoping to see some photos posted with lines established. I will use them on next overlay. I will lay the Manoppello image within those lines and any other. It was my goal to achieve perfection when doing these overlays. I do not think I was 100% successful in doing that. Repetition is the mother of skill. I will do it again..","date":"2015-03-26","mins":"2:22 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194522","author":"dave_hines","post":"Opinions vary Hugh, but mark my words on this. God willing I will prove beyond any reasonable doubt that some of these frescoes used the Shroud of Turin as a role model. Accidental characteristics are being replicated, that is not going to happen by random coincidence. One who believes accidental characteristics being replicated is not strong evidence that proves beyond a reasonable doubt the images are connected, rages against forensic science and logic. Consider these images I have here as appetizers. I am not even close to being through. Just warming up Main entree is coming. A full meal that will leave most everyone satisfied. Best is yet to come. Thomas Heaphy sketch lines up incredibly well. No one can deny that. All I need are just a few more witnesses to come forward and we will put them up on the stand. 3 witnesses. Note how on the Pantocrator image the artist replicated the circles around the eyes where they are whited out on the negative image. You say that is a coincidence, I say it is not. Another thing we need to do, is to stop limiting ourselves to what we believe is possible, To move outside our circle of comfort, to be more bold & assertive, expansive & faithful in our thinking and take action. To be fearless and without doubt. Those are the character qualities that people gravitate toward and children look up to and want to role model. Most certainly we can go on Shroud scope and make a determination of the length of the skull with a very slim margin of error. Yes, that is possible, it is not only possible, it is going to be done. I may stumble and fall along the journey but with some help from the Man In The Shroud I will get the cross up the hill. Amen (Thank you Lord in advance).","date":"2015-03-26","mins":"5:49 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194664","author":"dave_hines","post":"Hi OK, if you have time, could you go on Shroud Scope and using the measuring tool draw the line from the top of the forehead to bottom of chin where you have it. Average size of human skull is 8 to 9 inches. 227mm is 8.93 inches. I think you are right give or take a few millimeters. Please take a screen shot and post it when you have time, I will do the same and see what I come up with. I am interested in seeing where the 2 points end up. Images being overlaid with the Shroud will also be scaled to 8.93 inches. Matching top of forehead to bottom of chin as precisely as it is humanly possible to do so. I am going to re visit some images this weekend. Manoppello, Pantocrator and some others. I will post photo results. Sony Vegas Video Editing Software makes it possible to do extremely fine point adjustments. That is what I am using. I am going to make some improvements, slight adjustments based on new and hopefully more accurate math. Need to be certain what the distance between point A & point B is. Give or take 5 millimeters. I am sure it is possible to be that accurate..","date":"2015-03-27","mins":"11:20 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194667","author":"dave_hines","post":"Hi OK,This would be an example. This is 224mm in length Does it look right to you?.","date":"2015-03-28","mins":"12:25 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194405","author":"dave_hines","post":"Good Afternoon Hugh, I did the Prince Williams overlay with The Shroud, his eyes were about 2″ lower than where The Shroud eyes were. It not only did not fit, it was not even close. Some people doing these overlays are changing the aspect ratio of the image which is completely dishonest and deceptive. The overlays on this video are NOT doing that. (I know also that you did NOT do that with this Depp image) The question about the Depp image is where is the forehead? When the eyes are lined up, the forehead must also match up, end of nose and mouth should also be in the same place with very minimal to no drift when it is over laid slowly. Anyone with good video editing software, such as Sony Vegas could overlay these images and will find out that I did a straightforward honest comparison. I have not seen this Prince Williams overlay but I know His face does not line up with The Shroud at all. If it is shown matching, deception is involved. These overlays are done matching only the head length. As soon as that is done, nothing else should be done. If it does not fall into place immediately after length is matched. It is not a match. Because the length is matched does not mean the width will match. Width of image is NOT changed. When the length is matched the width should line up automatically. (It took less than 5 minutes to do the Pantocrator, that is how fast that lined up) Anyone can match eyes into the image but will everything else line up? NO. Only if one changes the aspect ratio which is a very simple thing to do with video editing software, doing this you could make almost image fit. But it also not honest and it is also very easy to debunk and expose as a fraud if one is doing this to deceive someone. God forbid anyone be guilty of doing such a thing. If the skull being matched is for example 9″ in length, then the overlay image being compared must also be 9″ in length. That is only point that is matched, nothing else. Anyways, how do you upload a photo on this site? There is no place to attach a file, how are you getting a photo uploaded on here? Let me know when you have time. That way I can do the overlay and show the in between phases of the images in still shots. We can start with Prince Williams and show everyone how it really lines up honestly. Then the J. Depp image. I will use the same software I used on these images do you can see it. I will match them and do the overlay. It is not complicated..","date":"2015-03-25","mins":"4:06 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194438","author":"dave_hines","post":"My channel was named after this painting I did..","date":"2015-03-26","mins":"1:35 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194406","author":"dave_hines","post":"That is either a coincidence or the Spirit of God’s way of interjecting humor on this blog site. After I uploaded th Is video (an hour later) I matched 3 of 5 numbers on a lottery ticket and won $50.00. It was the 1st time in my 51 years on this planet that I matched more than 1 number on a lottery and won money. The odds of doing so were 1 in 559.65. I did ask the Spirit of God for a number 3 sign if the #3 blood stain was not a coincidence but a ID mark. There are those that would say I received that sign and others that would say the events are not related. Anyways Good Friday falls on April 3rd This Year. NASA confirmed there was a blood moon visible from Jerusalem on Friday April, 3rd, 33 AD. Many believe that is the day of the cross. The April 3rd date is according to the Julian Calendar in use at that time. The “3” could be telling us 1. Time of death 3:00 PM 2. Date of death April 3 It is either a coincidence or it is not. There is no in between. 50/50 chance starting out When Jesus was on the cross he was being mocked by the Jewish High Priests they shouted to Jesus “You said you were going to destroy the Temple and rebuild it in 3 days. Well then, if you are the Son of God, save yourself and come down from the cross!” 3….","date":"2015-03-25","mins":"4:55 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194879","author":"dave_hines","post":"Hi Sampath. NASA confirmed there was a blood moon visible from Jerusalem on April, 3, 33 AD According the to Julian Calendar use in that time. Gregorian calendar date would be April 1st. I have been editing a film for several days. Sorry for the delayed response. I am uploading a video in regards to this number #3 bloodstain that is so absolutely bizarre that I do not think I will ever hear the end of it. I will be ridiculed and laughed at, but that is OK. I am not going to freak out over it and get upset. This will be no doubt one the most bizarre videos if not the most bizarre video ever uploaded in regards to the authenticity of The Shroud of Turin. I have been accused of trying to cash in on the Man In The Shroud, yet I gave my books away for free and do not make a single penny on any video I ever produced. My income source and my Shroud of Turin research are 2 completely different things. I have lost money, not gained. Well over 5 figures in expenses and nothing coming back and I could care less, I get reimbursed in ways that I cannot even begin to explain. I like doing Shroud research. It is fun and exciting. It also a extremely serious subject. This video is a combination of all those. Very serious and bit of fun at the same time. All things in accordance with the will of God. Get ready to be a bit surprised when you see the footage I am uploading..","date":"2015-03-30","mins":"2:25 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"}]
