[{"id":"comment-206881","author":"dave_hines","post":"Hello Dan: thanks for responding. I used to bet on professional football. Long shot bets. 6 and 8 team parlays. They way to win was by writing down every possible scenario that could take place and then go through process of elimination and use laws of probability and chance and intuition to determine what to eliminate as a possibility. What was left ,must be the winners. I won a 7 team parlay on the spread doing it. Above average skills doing it. 2 points away from the winning the 8 team, and 3 times won a 6 team parlay. On the spread, that is very hard to do. I finally figured out after years. “I cannot predict the future” and stopped doing it. Anyways you wrote, ” By light, I assume you mean a portion of the electromagnetic spectrum. By electricity I assume you mean corona discharge, lightening, and all other aspects of the flow of electricity including electromagnetism. I imagine we also need to include all forms of radiation” Exactly correct. I spent several hours last night attempting to record a interference pattern on linen, both a transmission type hologram and a reflection type, I was not successful. I need to consult with a physics expert. I rarely ever post outside my own channel anymore. With the exception of this place and a few others. I don’t want anyone feeling bad or getting into a negative type argument with someone. I want people feeling good not bad after a discussion with me. Anyways,I have some customers coming to rent out my vacation home so I have cut this short. “It’s cleaning time!” Have a great day!.","date":"2015-07-29","mins":"12:44 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206919","author":"dave_hines","post":"Hi Louis, I see this on my channel all the time. Posted on my videos constantly. Over and over again Relentless. My non response to it is my response. I just don’t have time for it..","date":"2015-07-29","mins":"10:58 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206716","author":"dave_hines","post":"Hello John: thanks for the file you sent me. Looks like I am actually going to finally have the time to fully read it and absorb it. I am in Central America taking care of some old business involving some “green” owed to me. (Shroud Research Money) Anyways, This is one definition of intuition I found “the way our higher power communicates with us with a “inner knowing” or “inner voice” The book you mentioned, “Blink” I read it. Very interesting. It is very noteworthy to make known the Shroud of Turin case file is the only case in history where the conclusions drawn by 3 different forensic pathologists who were in agreement that a genuine dead body made contact with the Shroud was not accepted. 1st time in the history of forensic science. I have never seen another case where this has occurred. I wonder if that has anything to do with the name Jesus being involved with it? I have also never seen a case file where if an ancient relic was authenticated it could disrupt the balance of power and change the flow of where billions of dollars would wind up. I wonder if that has anything to do with the authenticity debate? Sorry about the sarcasm. We all get the point. Anyways, If the conclusions drawn by 1. Dr. Pierre Barbet 2. Dr. Robert Bucklin 3. Dr. Frederick Zugibe Who all agreed a man in his 30’s, long hair, beard and mustache, appx, 5′ 11″ 175 lbs was 1. Beaten 2. Cap/crown of thorns placed around head 3. Scourged 4. Crucified 5. Legs Not Fractured 6. Side Pierced 7. Wrapped In The Shroud 8. Body Removed from linen before decay (No other person in History we know of other than Jesus underwent those sequence of events) The only note able disagreement in the pathologists report was cause of death, but still dead, yes a dead body made contact with the cloth. All in agreement on that very important point. Dead. Take the name of Jesus out of this and not one person on this Earth would be debating the credibility of the pathologists report, It would be accepted as it would in any unsolved murder case. 3 separate forensic pathologists all in agreement, in a court of law it would be indisputable. Rock Solid. If another forensic pathologist came to different conclusions after examining the linen that would be a different story. But that is not the case with the Shroud. Based on the pathologists report the calculated odds the man in the Shroud is not Jesus is one in a 82 Million, 944 Thousand. 82,944,000 That is not taking into account any of the match points between the Sudarium and the Shroud. That is also not taking into account over 40 names & phrases relating to Jesus and the Shroud of Turin that all equal the same number in English Gematria. If we calculate those factors in one would have to conclude it is not unreasonable to believe if one opened their window they might see a dodo bird flying by and/or be struck in the head with space debris, that would be a reasonable possibility If one thinks that is a probable scenario, a probable scenario that is not unreasonable to believe could take place then that person could also have reasonable doubt The Man in The Shroud is not Jesus. That is how heavy the odds are stacked against the shroud not being the linen that wrapped Jesus. Yes, many have doubt the Shroud is genuine, But is it reasonable doubt? Based purely on math it is not reasonable. Man in the Shroud is Jesus, in the words of Dr. Robert Bucklin “Indisputable”.","date":"2015-07-28","mins":"1:13 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206793","author":"dave_hines","post":"Hello Max, I put your definition of the word φαιλόνην as being “A Long Shining Wrap” on the Shroud of Turin Silver Screen. People from many different countries have seen it. This way some of your work gets acknowledged in a visual sense. I will make sure to give you credit on the translation. Over the years I have been attacked by many people. At times extremely hostile, my character assassinated often. Happens all time. It does not matter which side one is on, being pro or against authenticity it is going to happen regardless of your credentials or lack there of. I’ve had to stop and ask myself “Who am I becoming as a person as a result of the Shroud Research I am doing and the films I making?” I found myself at times becoming angry, hostile,even spiteful and rude to others. I do not want to become a angry, hostile, rude and spiteful person. I am talking about myself not anyone else. It is not my place to judge others I had to admit being wrong and have set out on a new format. As a result of Shroud research we should be becoming more loving, more caring, more good humored, more thoughtful, more forgiving, if not it shows something is wrong. “Success is about who we become as a person” In the program of AA, there is thing called a Step 10 “We continued to take personal inventory and when we were wrong promptly admitted it” That said, I am going to take a Step 10 on this comment section and apologize to anyone I was hostile, rude or spiteful toward. I was wrong in doing that and I am promptly admit it. Good, that over, I feel better, now lets get back to the Shroud of Turin authenticity debate with a spirit of good cheer and good will toward others, even if they do not agree with my belief the Shroud image in in part the result of a interference pattern of light. I am going to add Mr. Electricity to that image theory. Guilty parties to Shroud image 1. Mr. Light and Mr. Electricity. (I like the combo better than the single person involved) Max likes Mr. Ammonia, Mr. Colin Berry likes Mr. Imprint, Hugh Farey and Charles Freeman like Mr. Paint, but who ever is responsible and found guilty beyond a reasonable doubt the judge is not going to easy on sentencing..","date":"2015-07-28","mins":"1:57 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206918","author":"dave_hines","post":"Hi Max. Imprint & Ammonia (A Gas) Combo. I like how passionate you are about explaining your image theory. Very detailed descriptions. I found this written about the Shroud, I am sure at some point you have already seen it and has already been discussed on this Blog Site. Perhaps a good time for you to look at it again. Forensic evidence that supports your image theory. This is in regards to the Texas pediatrician/scientist Garza Valdes who was involved in the book “The DNA of God” I do not know if his work is viewed on this Blog Site as being credible or not, but here are some things he found that relate to what you are saying. 1.First, he found that the cloth itself was covered in an organic “”bioplastic coating, a type of clear encasing invisible to the naked eye but composed over time of millions of living microbial organisms.”” Such a coating, which he had first witnessed in his study of ancient Mayan artifacts 2.This finding, coupled with “”infinitesimal splinters of hard wood found near the wound areas,”” and the human male DNA found in the blood stains, led the to ask whether this cloth was indeed the burial shroud of Jesus 3. Also through tests upon bacteria found in the blood stains found on the Shroud’s fibers, Garza Valdes discovered that they contained acetic acid, or vinegar. This evidence indicates that the person buried in the shroud would have been exposed to vinegar, much like Jesus at his crucifixion, his death. Human sweat also contains acetic acid as does myrrh resin. The acetic acid could have gotten on the cloth by more than one method. Myrrh resin is cellulose from wood pulp. When mixed with acetic acid will become cellulose acetate. The main ingredients to make cellulose acetate are 1. Cellulose From Wood Pulp 2. Acetic Acid 3. A Catalyst would also be needed for hydrolysis to take place, such as sulfuric acid. A very small amount. (I am by no means some kind of chemistry expert Collin Berry would be the person to ask about this process) When cellulose acetate is exposed to heat or moisture,it begins to deteriorate to an unusable state, releasing acetic acid with a characteristic vinegary smell, causing the process to be known as “vinegar syndrome.” Do the Shroud fibers have this “vinegar syndrome” going on? Note worthy also is cellulose acetate was used to coat holographic film plates. Just a coincidence. Ray Rodgers believed the image resides in that layer and not really on the fabric. Perhaps it is a combo of both Max you seem to have great insight/intuition on these matters, what do you think?.","date":"2015-07-29","mins":"10:53 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206796","author":"dave_hines","post":"This is a complete list of all image possibilities. This is how a professional handicapper would approach the challenge and then with his best intuitive sense, put his money on the table and place the bet. How was Image Formed? 1. Mr Paint 2. Mr. Imprint 3. Mr. Ammonia 4. Mr Light 5. Mr. Electricity Then there are combos, for example 1 and 2 Paint and Imprint 1 and 3 Paint and Ammonia 1 and 4 Paint and Light 1 and 5 Paint and Electricity 2 and 3 Imprint and Ammonia 2 and 4 Imprint and Light 2 and 5 Imprint and Electricity 3 and 4 Ammonia and Light 3 and 5 Ammonia and Electricity 4 and 5 Light and Electricity It is not likely to go beyond a 2 combination theory such as Paint, imprint and ammonia or Paint, Imprint and Light. But if one wanted to be 100% thorough they would be included 1,2, 3 Paint, Imprint and Ammonia 1,3,4 Paint, Ammonia and Light 1,3, 5 Paint, Ammonia and Electricity 2,3,4 Imprint, Ammonia and Light 2,3,5 Imprint, Ammonia and Electricity 3,4,5 Ammonia, Light and Electricity My intuitive sense tells me the Shroud image is Combo of things, not a single method involved. I like 4 and 5. Mr. Light and Mr. Electricity Of course part of image is a contact image, so to have a more complete explanation it would be a 2, 4, 5. One of these numerical combinations is correct. The answer is here somewhere. But which sequence opens the lock and unravels the mystery? What does our best intuitive sense say the correct combo is? I have 21 possibilities listed here, which is correct? One of them is correct. Only 1 numerical sequence can open the lock and open the door..","date":"2015-07-28","mins":"2:37 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206804","author":"dave_hines","post":"Wow, Dan, unexpected response. Do you harbor some kind of ill will toward me? Your response comes across a bit hostile. Let me know if you don’t want me posting here. I am the kind of person who does not need to be told no twice. I do not stay where I am not welcome. You are the moderator of this Blog Site. Let me know if you don’t want me posting here. And bear in mind, “I handle rejection well”.","date":"2015-07-28","mins":"8:14 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"}]
