[{"id":"comment-169741","author":"dave_hines","post":"Is this going to be a one sentence book? “I think the Shroud was used in a Easter Play” Here is my new book,”I Think The Shroud Was Made In Southern Turkey” in the 14th century for the annual myrrh and aloes festival, This is where they soak one of the local fisherman with myrrh and aloes and wrap him in a cloth and unwrap it 3 days later. Then they build a big fire in the form of a circle and one of the local leaders of the village holds up the cloth with the image of the fisherman while the people dance around it. These types of rituals were common in the middle ages. It was believed to bring good luck to the village. That is my theory. I know it does not agree with any of the forensic evidence on the cloth, but I refuse to look at scientific facts, then I would have to admit I am wrong. I can’t do that. I must stay with my pet theory. I hate Jesus and religion to, especially the Catholic Church, that is the real reason I don’t think the Shroud is genuine. Even if it is genuine it is not. That is how I feel about it. At the end of the day it is all about me and what I want, and I don’t want the shroud to be genuine. So it is not..","date":"2014-11-08","mins":"1:44 am","url":"https://shroudstory.com/2014/11/07/charles-freemans-article-covered-in-forbes/","cat":"press_coverage","title":"Charles Freeman’s Article Covered in Forbes"},{"id":"comment-169950","author":"dave_hines","post":"I am going to take a Step 10 on my last post: “We Continued to take personal inventory and when we were wrong promptly admitted it” I admit being wrong with my previous sarcastic smart ass post. I apologize to you and Dan Porter for doing so. I have no excuse. I can become unrestrained and even hostile when it comes The Shroud of Turin subject. I become less useful to the Lord in whom I serve by doing so. I apologize to him as well. I aspire to put on a better defense for the Man In The Shroud/Jesus. There is racial bias against him, he is not being treated with fairness. There are ancient relics that have been authenticated on far less evidence than the Shroud. If we applied the same harsh criteria to other items as being authentic as is being done with the Shroud, nothing could be viewed as being authentic. We would be carbon dating swords and linens from other famous figures in history. We would have to close every museum in the world and re examine all those items to be sure they are authenticate, including the jaws from monkeys glued into human skulls to fool people into believing in Evolution. All sports memorabilia would be in question, we would have to stop all sales of those items and re examine them. Instead of 3 different handwriting experts to agree on a signature we will need at least a dozen. It could take up to 10 years to make a decision on whether or not Babe Ruth actually signed his name on that baseball, photograph or jersey. We could just start flipping coins to decide if we really get impatient. All antique auctions would be put to a halt; we can’t have some poor soul getting a fake antique. We would have to start exhuming bodies of out every grave in the world and make sure the name on the headstone is really that person. That could be a mannequin buried in the ground and not a real person and some kind of insurance fraud took place. Birth certificates would be in question; we would have to put a freeze on every person’s bank account until they can prove they are who they say they are. Yes, we need to be sure those birth certificates are not computer generated forgeries. How do we know for sure those are not faked? And if the trace pollen evidence left on The Shroud, or absence of vanillin or recent stress tests on the fabric is not acceptable or convincing evidence of The Shroud’s ancient history then we need to start releasing rapists, thieves and murderers from prison, because they were convicted on the basis of similar evidence. BOTTOM LINE; IF THE SAME CRITERIA CURRENTLY IN USE THAT HAS AUTHENTICATED OTHER ANCIENT RELICS WAS APPLIED TO THE SHROUD, The Shroud would be authenticated and accepted worldwide as the pure linen garment that wrapped the body of Jesus without any doubt or question in regards to its authenticity. Not a single person would question it. We would not be talking right now. The reason that we are is because there is RACIAL BIAS AGAINST MY CLIENT..","date":"2014-11-08","mins":"6:56 pm","url":"https://shroudstory.com/2014/11/07/charles-freemans-article-covered-in-forbes/","cat":"press_coverage","title":"Charles Freeman’s Article Covered in Forbes"},{"id":"comment-201253","author":"dave_hines","post":"Good Afternoon Mr. Collins: You wrote, “the crucial aspect being its ADHESIVE properties that stick and mould linen to body anatomy, ensuring a sharp and detailed “take”. A plain flour paste or glue has to be a prime candidate” Myrrh resin does exactly what you described. When it exposed to the open air it becomes sticky like glue and eventually hardens completely. It is not unlike tree sap. It does exactly what you described t it “moulds linen to body anatomy” If used in pure form it will color the linen a sepia, caramel color. There are many different grades of myrrh. When it dries it can become transparent, glossy and light reflective. But not all myrrh resin is like, this. Some grades are opaque when it dries. When the object and cloth has myrrh applied to it, and then wrapped in it, the linen will take on the shape of that object and make a 3 D replica. Very detailed. If for any reason you actually purchase some, make sure you are getting the high grade pure version, not the cheap watered down version with other oils in it. There are only 2 companies on line I could find that have pure linen made from flax, herringbone weave fabric. One is in the UK, the other in Belgium. Myrrh resin is the substance you seek to do what you want to do. It will also be in agreement with what is written scientifically peer reviewed journals as to what the thin layer of carbs is on the Shroud. Sugars. I made a video demonstrating it. It works. This is a bit of a down time for Shroud interest. Music videos are getting 600,000,000 million views and my myrrh and aloes Shroud image theory video has less than 1000?! If you are not getting a lot of interest in some of your new image theories it has to do with the time of year. June and July are vacation months. People don’t want to be thinking about bloody mutilated bodies being wrapped in burial shrouds and leaving images behind. Remember the James Bond Movie, “Never say Never Again” Good luck with your future research. Try not to be to hard on the Man in The Shroud. See you again in a few weeks..","date":"2015-06-07","mins":"3:00 pm","url":"https://shroudstory.com/2015/06/07/dear-colin-berry/","cat":"other_blogs","title":"Dear Colin Berry"},{"id":"comment-201284","author":"dave_hines","post":"Good Evening Mr. Collins: I think you might like this. Myrrh and Aloe Experiment. Wrapping a 3 D figure. Obviously you know I am pro authenticity. No need to go into that discussion. I feel strongly what you are looking for is myrrh resin. It does all the things you mentioned. “ADHESIVE properties that stick and mould linen to body anatomy, ensuring a sharp and detailed “take”. For whatever reason it works better with a combo of myrrh and aloes. Not just myrrh resin. You will definitely not agree with my image theory, you may want to skip past that part in the 2nd Video. 2nd Video shows what linen looks like after You mentioned once “organic paste” Myrrh and aloes together make “organic paste” .https://www.youtube.com/watch?v=B Tq M4 SVBSWE Part 1 https://www.youtube.com/watch?v=Tx Js Ok Yz TZU Part 2.","date":"2015-06-07","mins":"11:38 pm","url":"https://shroudstory.com/2015/06/07/dear-colin-berry/","cat":"other_blogs","title":"Dear Colin Berry"},{"id":"comment-216643","author":"dave_hines","post":"Hello Mr. John Klotz: thanks for responding to my post! For some time I have been trying to locate the film, “The Silent Witness” and I saw the title on this Blog Site and thanks to Dan I finally found it. It is really well made film. I have not looked at Gematria for months. There are other aspects of the case file that are much more interesting to me, but while watching the film, I got a intuitive nudge to type in Silent Witness on a Gematria,calculator, and I thought, “there is no way it is going to equal 1128” It did, and then the other, Enigma of the Shroud, again 1128, I thought it was a odd “coincidence” Since this post was in regards to the film Silent Witness the majority of my comments were on that subject line. The Gematria display is useful, it is not unlike a appetizer we offer, before we serve the main meal of evidence and other numerical match points. About my post. You wrote,. “It is an exhibition of circumstantial evidence that is not only compelling, but in my viewpoint conclusive as to the authenticity of the Shroud of Turin as burial cloth of Jesus Christ” I could not agree with you more. I have seen many cases with far less evidence in which a jury was able to make a decision and be certain beyond a reasonable doubt a particular person was responsible for a crime. I saw a recent murder case where they did not have the body, but found just a few drops of the person’s blood at the bottom of a Refrigerator and a witness that claimed they saw the defendant put the body in that refrigerator. It was enough to be able to bring the case into a court of law in front of a jury. :Person was found guilty beyond a reasonable doubt. There are many such wrongful death cases, where the party that committed the crime was brought to justice even though they did not have the body. Shroud of Turin case also is a case without the actual body, but is much more compelling evidence of a wrongful death than just 1 witness and few drops of blood. I’ve said this before, but take the name of Jesus out of this and The Shroud is authentic. Not one person would question its authenticity in terms that a actual dead body that was scourged and crucified made contact with the cloth. The Shroud of Turin case file is the only case in forensic history that the conclusions drawn by no less than 3 forensic pathologists in agreement were not accepted and for one reason and one reason only. The name of Jesus is involved. Put in most any other name and it is authentic. No one has to admit guilt if it is another name or have to face the reality that there really is going to be a judgment day and each person will be held accountable for their actions or lack there of. Great book, I just got started with it. Thanks again. 7 months later..","date":"2015-12-16","mins":"6:38 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","title":"David Rolfe’s Website"},{"id":"comment-216603","author":"dave_hines","post":"Good Evening Mr. Colin Berry: It’s 7:43 your time, here it is afternoon. Hoping all is well for you in great and rich country of Great Britain. I would like to have some of their gold here in Central America. We could use it. I had no idea Dan was taking a break from all this. Hats off to Dan Porter for coming up with some of the most obscure fascinating info on the Shroud and giving both sides of the Shroud debate a voice. I totally understand why he is taking a break. The purpose of the Gematria display is to draw attention to numerous “coincidences” that link the cloth to Jesus. That is all. It is either coincidence or not. Same as the Shroud, it either is authentic or it is not. The inspiration for my post actually came from Barrie Schwortz, he was talking to a Muslim woman with the full size replica and he was pointing out details of the image to her. He pointed out things I had never noticed before. Simon Brown was filming him at the big event in the UK. It was a video on youtube. The other inspiration of what I wrote comes from Investigation Discovery and Forensic files, those are the only TV shows I watch. I like to see genuine crime scene photos, and live videos of crime scenes,, suspects being interrogated, real life situations. Fascinating, I highly recommend both programs. Since I just learned Dan is taking from break this, I am going go close saying a BIG THANKS to Dan Porter for doing an incredible job. I have learned much about the Shroud because of his time and effort. The most valuable thing another person can give us is their time. Dan gave us the very valuable gift of his time. Thank you Dan! I am reminded of the movie called “Never Say Never Again” when Dan says he is not coming back. I wish him great success, Everybody on this Earth has a right to be happy. I think it is important that we acknowledge the good works of others. Dan Porter has done a lot of good. Jesus Christ made a incredible sacrifice, I believe it is critically important that his sacrifice is acknowledged, I see the Shroud as a witness to what happened to him, A Silent Witness, but when questioned the information starts pouring out of him, one detail after another. We all have different destiny’s to follow. I think we are all doing are best under less than desirable circumstances in this day and age. Let’s acknowledge the good works of Dan, I don’t want this post to be a distraction to that event. Perhaps at some other time we will discuss the Shroud again. I prefer to make a video and speak out as opposed to writing on a forum like this..","date":"2015-12-15","mins":"3:10 pm","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","title":"David Rolfe’s Website"},{"id":"comment-216641","author":"dave_hines","post":"I am convinced that the Spirit of God invented the English language and gave it to man and left behind numerical clues/codes in the language in regards to matters he deems to be important. The Shroud of Turin being one of those things. Mainly because the Shroud involves the sacrifice of his Son and is related to the subject of eternal inheritance. The video we made presenting this evidence has done very well, it gets high audience retention, good approval rating and is increasing in views all the time. Majority of people like the display. Spirit of God likes it, He wanted that video made, so I made it. That is the only authority I answer to and the only approval I need. I don’t need your approval or Dan Porters or any other person for that matter. I shared it on this blog site and did so with good intention. Our views do not increase as a result of posting here. People come to our videos by attraction not promotion. We do extremely well reaching up to 2000 people a day on the subject of the Shroud of Turin. 500 minimum a day. We are in every country in the world now and views expanding worldwide. You are in the minority group that does not like the Gematria Display. My recent post was not about Gematria, it was on another subject line altogether you freaking idiot,. Do me a huge favor, never speak to me again, I want nothing to do with you, I love you, but I don’t like you..","date":"2015-12-16","mins":"5:40 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","title":"David Rolfe’s Website"},{"id":"comment-217083","author":"dave_hines","post":"Good Evening Mr. John Klotz: Please accept my apologies for the delay in my response. I rent vacation homes on the Gold Coast of Costa Rica. This time of year is crazy. I have been working 12 hours a day non stop to prepare for guests. Sales exploded this year. That is why my response is so delayed. I am more than interested in thoroughly reading your book. Congratulations again on completing and getting it published. I am so glad I have it. I recently acquired a isolated private house in the mountains of Costa Rica, It has been thoroughly cleaned and prepared so I have a place to retreat and continue Shroud research and make films without distraction. A place I can read your book without one person bothering me. I purchased the life size Shroud replica from Barrie and recently brought it into this location. To actually see the whole 14′ cloth laid out is completely different than seeing it on internet. It is truly a amazing sight to actually see up close and personal, The Shroud of Turin in extreme detail. I brought The Shroud into each property that I represent. I have record breaking sales this year. Double and triple what I normally do. Are the events related or coincidence? I really don’t know. Last night I brought The Shroud to this remote location where people told me “no one will rent a house in this area” “you are wasting your time” “no one will rent that house” My phone rang this afternoon while at the location, I booked the house solid throughout the holiday season, at a price higher than anyone has ever rented it before. The Shroud of Turin was in the house. Either the events are related or they are not. Coincidence or not. The purpose of the Gematria display was to bring attention to the subject of “Coincidences” Not so much as to talk about numerology. I will be in contact with you again when all the smoke has cleared from the rental sales done this year. Quite a financial blaze. Wishing you and everybody else here on the Dan’s Blog site a Merry Christmas and a Happy New Year! Yes, that includes all the skeptics, “God Bless Every One of Them!”.","date":"2015-12-22","mins":"9:54 pm","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","title":"David Rolfe’s Website"},{"id":"comment-216544","author":"dave_hines","post":"Hello there Dcn Andy, the film David Rolfe made, Silent Witness was very well done. The clips with Dr. Robert Bucklin and Dr. Max Frei alone make this worth watching. For whatever it is worth, and on this blog site that would not be much, but after watching the film I went to the online Gematria calculator and just typed in Silent Witness. It equaled 1128. Then I typed in Enigma of the Shroud it was also 1128. Gematria is an Assyro Babylonian system of numerology later adopted by Jews that assigns numerical value to a word or phrase in the belief that words or phrases with identical numerical values bear some relation to each other or bear some relation to the number itself. I made a film about it that is doing very well on youtube. I leave it up to the viewer to decide whether they think it is a coincidence or not. Those are the only 2 possibilities. It is a coincidence or it is not. Silent Witness=1128 Enigma of the Shroud=1128 Shroud of Turin=1128 Jesus of Nazareth= 1128 The Shroud of the Lord=1128 Genuine Ancient Relic=1128 A Sacred Winding Sheet=1128 Shroud is Genuine=1128 A Picture of Jesus=1128 Cloth Image of Jesus=1128 I could add 40 more to this list, all things relating to the Shroud of Turin. Most people on this blog site would say “they are coincidental matches” Alrighty then. The odds of this happening by coincidence and incredible good luck is conservatively 1 in 900 million. The only reason DNA evidence is compelling, is because there are so many numerical match points it makes it possible to accurately quote odds of probability of chance that the match points are coincidental. Accurate to the millionth of a percent. A numerical match point is a numerical match point, be that in Gematria or any other thing. When you have numerous “coincidences” it makes it possible to calculate the odds of probability chance that the matches are coincidental. This is a way to be certain of something beyond a reasonable doubt. There was a time when they were not sure if The Boston Strangler committed all of the different murders in the city that looked as though they were done by the same person. As in all of such cases, DETAILS OF THE CRIME WERE NOT RELEASED TO THE PUBLIC. When the Boston Strangler was interrogated by the FBI, He was able to give them details of the crime scene that only someone who was there could possibly know. HE KNEW DETAILS OF THE CRIME NOT RELEASED TO THE PUBLIC. Later when DNA became more sophisticated it was confirmed again that way as well. A line of questioning might go something like this. What color was the dress did she had on? What position was the body in? What was she holding in her hand? What color was the carpeting in the living room? What kind of books or magazines were on the bed? What kind of cigarettes did she smoke? Some of these questions are “trick questions” As in a question such as “What was she holding in her hand?” Which assumes she was holding something when in fact she was not holding anything, if the witness can also confirm that, they know they have a credible witness. Boston Stranger was able to accurately answer these types of questions and knew details of the crime scene that only a person that was there could know. In that time they did not have DNA. It is another way one can be certain of something beyond a reasonable doubt. Again, numerical match points are used. Sometimes the Police are not convinced the person who is confessing is actually the person who committed the crime, so they will question the suspect using a number of different tactics to get to the truth. Since they claim to have done the crime they should know details of the crime scene. Again what convinces a person beyond a reasonable doubt is the amount of numerical match points. One could argue that when The Boston Strangler correctly answered questions about the details of the crime scene he just got incredibly lucky and guessed and just happened to be right, even though he did not commit the murder and was not at the crime scene. The Shroud of Turin is a witness. (A Silent Witness) Knows details of a crime scene that only someone who was at a genuine crime scene could possibly know. For starters, knows that a plain weave white linen was not used as would normally be used in Jewish burial. That was info not released to the public. It states only Joseph purchased fine linen, it does not say what kind of linen. Shroud tells us what kind of linen Joseph purchased, Herringbone weave. Only someone who was present at the crime scene would know such a odd detail. Odds of probability and chance heavily favor that possibility. If any man set out to make a Jesus image on a burial cloth he or she would use plain weave linen unless they actually wanted their work to be rejected and not look authentic. Add numerous other points to the Shroud that went against how all people falsely perceived how the crime against Jesus took place. In fact it is because of the Shroud we know more about crucification. Shroud is a credible witness. Often times forensic evidence tells a story about a murder that does not make sense, and it is the opposite of what forensic detectives expected to find. What happens in genuine reality and how one perceives a event transpired are often completely different and the opposite of what one would expect. The herringbone weave linen is one of those things that seems out of place in the crime scene and would not be what one expected to find. Spirit of God, like the Police DID NOT RELEASE DETAILS OF THE CRIME TO THE PUBLIC, MEANING THE GOSPEL ACCOUNT The Gospel account is in fact a very vague account of events, without much detail, as you would see in a write up in a newspaper about a murder. What is written in the papers or covered in the media about a murder, will not disclose the details or like I said may release false/vague info. What is written in the Gospel account does not include the details of the crime/death and burial of Jesus. SHROUD KNOWS THE DETAILS OF THE CRIME AND THE BURIAL. FORENSIC EVIDENCE MATCHES SCRIPTURE AND THEN GOES BEYOND AND DISCLOSES THE DETAILS OF THE CRIME, DETAILS ONLY SOMEONE WHO WAS AT THE CRIME SCENE COULD POSSIBLY KNOW. EXAMPLES, THE Shroud… 1.Knows what part of beard section was removed/plucked out. 2. Knows what kind of plant was used to make crown of thorns 3.Knows what kind of weapon was used to make scourge wounds 4.Knows the width of a Roman hasta, spear, that made side wound 5.Knows the names of plants growing in the area where the crime took place 6.Knows how long Jesus was in the tomb (between 48 and 72 hours) Knows his stomach became swelled due to gas formation 2 3 days after death 7. Knows that the nail wound went into wrist not into the palms 8. Knows how tall Jesus was 9. Knows Jesus had long hair and was put in a pony tail at burial 10. Knows that Jesus was buried nude 11. Knows how many scourge wounds were applied 12 Knows Jesus was scourged by 2 people, one taller than the other 13.Knows which parts of his face were beaten, right side more than left 14. Knows that one of his eyes (right side) was swollen shut 15.Knows one of his feet made complete impression on the linen, Knows Jesus was buried with his knees raised and body not lying flat 16.Knows that when a nail is driven into wrist thumb moves inward 17. Knows that blood stains will form serum contraction rings 18. Knows that side wound will flow vertically and then horizontally across lower back 19. Knows Jesus was scourged on nearly every square inch of his body 20. Knows one knee is more damaged than the other 21. Knows the name of a rare calcite found in tombs around Damascus Gate and knows the feet, knee and the tip of the nose of Jesus made contact with it. 22. Knows Jesus had type AB blood 23. Knows blood of Jesus had elevated levels of bilirubin 24. Knows that the nose of Jesus was abraded. 25. Knows how much Jesus weighed (appx 175 lbs) 26. Knows the exact angle/ position of the arms when Jesus died on the cross 27.Knows plain weave linen was not used in the burial 28.Knows the width and length of nearly every part of the anatomy of Jesus, There is no other image in the world depicted of Jesus, a life size image, with the vast amount of detail that The Shroud of Turin has. Not even remotely close. What is more probable? The Shroud of Turin was at the crime scene and recorded these details The Shroud of Turin is a man made image and a person made a list such as the one above and said to himself, “I want all these details of my image” “I want Jesus nude even though I don’t know if he was or not, I am just guessing” “I want some rare calcite from Jerusalem on the tip of that nose and I want it abraded” “I want the blood from the side wound to flow vertically across the lower back” “I am not going to illustrate thumbs, I have no idea why” “I am going to illustrate the stomach swelled slightly so if a forensic pathologist studies this it will look as though the body has been dead for 48 to 72 hours” “I want serum contraction rings around the blood stains even though I do not know what serum contraction rings are” “I want the hair in a pony tail and his right eye swelled shut” “I want it to look like Jesus was scourged by 2 people, one taller than the other” “I want pollens from a thistle plant around the head area and I want it on that head cloth in Spain as well” “I want Jesus to be abnormally tall for a person from 1st century” “I don’t want to be acknowledged for my painstaking detailed work, I don’t like money” “I want it to be a total color inversion image even though I don’t understand what that means and have never seen one before”.","date":"2015-12-15","mins":"3:05 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","title":"David Rolfe’s Website"},{"id":"comment-202185","author":"dave_hines","post":"I watched the entire Thomas De Wesselow presentation. Excellent. I saw artwork I have never seen before and I have seen a lot of paintings of Jesus. Anyone out there that thinks this is easy, hire someone to video tape your one hour presentation on The Shroud and see how it comes off. It is much harder than one would think. You cannot fumble your lines or make mistakes. Must be very focused. He does a very good job. Impressive. The #1 prime suspect for committing the “Image act” has always been Mr. Paint. He has been interviewed and re interviewed by detectives over & over again through out the centuries. Likely waiting for the phone to ring right now, “I have meet with detectives again about this Shroud Image” “They still think I did it’ He claims to be innocent,but there is always the type of person, that wants to bring him in again for questioning and force a confession out of him. “We know you did it” This video, In a comparison analogy, (a bit exaggerated perhaps) but it is not unlike having the prime suspect in a capital murder case (Mr. Paint in this case) captured on a video surveillance camera in another State at the time the act/murder took place, eliminating him as being possible of committing the act. Line up the suspects 1. Mr.Paint (Interviewed 1000’s of times) 2. Mr. Imprint/Contact Image (By genuine body or 3d or 2d material object) 3. Mr. Ammonia (A Gas) 4. Mr. Light One of the 4 is responsible. Or a combo such as Mr. Light and Mr. Ammonia. But, who is the mastermind behind the image act? Shroud Image is 1. Cunning 2. Baffling 3. Subtle 4. Powerful Which of the 4 suspects is the most cunning, baffling, subtle and powerful? Mr.        Deep down inside we all know who is responsible for the image act. Trust what your gut feeling/ inner voice/ is saying. It’ obvious. Only 1 of the 4 suspects meets all of the qualifications necessary to commit this “crime”.","date":"2015-06-14","mins":"10:31 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-202702","author":"dave_hines","post":"Hello Thomas, God willing I will have an image on linen to similar to the Shroud within 30 days to show you. The reason for the delay is money. Holography equipment is expensive, but I have the money now. Anyways, image qualities. 1.Blood Stains 1st. 2. Blood Stains On Pure L Inen Herringbone Weave Fabric 3. Ultra thin coating of starch fractions and pectin on fabric and over the blood stains. 4. Holographic Image residing only in the micro thin layer of starch fractions and pectin and not exceeding primary cell wall of fabric 5. Image not visible when lit from the back. 6. Image not visible from certain angles, but is visible depending on the angle of light it is viewed in. 7.A hologram on linen. I believe the Image of Edessa, “the image not made by human hands” had more dramatic holographic qualities than the present day Shroud. That is why it was called “the image not made by human hands, because no one in that time had ever seen a hologram on linen before, even in this day and age would be a odd sight, Over the centuries the once dramatic holographic qualities Shroud have faded over time, and only a remnant of those holographic observations can be seen in this day and age. Here is testimony that supports what I just stated is true. “ I therefore had the good fortune to see the Shroud in close up for a whole day. When this sheet was enrolled on a long table (with light coming only from one side of the room where there were windows high up), I realized that everything that I had learned up to that point was worth nothing: the image that I thought I knew was not that one. While photography has the advantage of fixing an image in time and of concentrating it so that whichever angle you look at it from, it will remain the same, with the Shroud that is not the case. Moving around that table (lighting under an angle from one side only!), from a certain angle I saw this image so faded as if to practically disappear, while from others it seemed as if the figure WAS ALMOST OUTSIDE THE SHEET: it was, I repeat, an incredible emotion. At that moment I knew that this image was unique” He continues on with these comments… “The image on the Shroud appears more distinct at a distance and fades when viewed at certain angles, particularly as one comes closer to the Shroud. The image is faint, without well defined boundaries so the eye has no point of reference and it appears simply as variation of the background density. In addition, you’re viewing only a small portion of the entire image up close. In a way, it is out of context and it is only as you back away that it is seen as part of the bigger picture that gives it meaning. This is the classical explanation of this observation. HOWEVER, it is also a HOLOGRAPHIC OBSERVATION. If you stand in front of a large hologram, where thanks to the angle of the lighting you are able to see the image, and you back up or come close or go to the side for that matter, the image becomes very vague or disappears completely” I am posting this video I made as evidence that supports my proposition that the Image of Edessa and The Shroud of Turin are the same image. A holographic Image. My corroborating witness is a English Gematria Calculator. Gematria /ɡəˈmeɪ.tri.ə/ is an Assyro Babylonian system of numerology later adopted by Jews that assigns numerical value to a word or phrase in the belief that words or phrases with identical numerical values bear some relation to each other or bear some relation to the number itself 1. 3 D Hologram of Jesus =1128 2. Behold The Image of Edessa =1128 3. First 3 D Hologram Made= 1128 4. 3 D Hologram of the King= 1128 5. 3 D Scourge Wounds= 1128 6. Son of God Hologram= 1128 7. Shroud of Turin = 1128 Jesus of Nazareth = 1128 It is only 7 minutes long, it is worth every second of your time to view it or I would not have posted it. In closing I think Thomas De Wesselow is 100% correct when he proposes that people saw the Shroud and believed Jesus was resurrected and did not actually see Jesus. Others did see him personally. Again a combination of both, not one or the other. As in image formation is a combo of factors, part contact, part non contact image. I.","date":"2015-06-18","mins":"6:56 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"}]
