[{"id":"comment-1152","author":"ellen_j","post":"John, I only reacted when you started hurling insults about. You ask who is Ellen J. I ask you who is John Lupia. In fact, who is Regina Caeli Press? No really? I don’t know. How do I know you are really linking to Pay Pal? It is easy to spoof. Read about it in the Red Tape Chronicles over at MSNBC. Given that there is no street address or even a city for Regina Caeli Press, no phone number, no owner of record and nothing but a mini web site anonymously registered, what am I to think? I haven’t accused Pay Pal of anything. I haven’t accused anyone of anything. Think about it. Who are you? Who is your publisher? Secret web site registration, no address, no phone number. Why, should I trust you? That is a question, not an accusation. What if I pay for the book and I don’t get it in the mail, who do I contact? Think about that. Oh, your site says “Product Dimensions: 5 1/2 x 8 1/2 x 5/8 inches (5.5″ x 8.5″ x 0.616″)” Isn’t that just exactly the size I gave. That is what two up on 8.5 by 11 means. Do the arithmetic. Few printers print that size except those who print using low volume xerography. Think Staples, Office Max, Kinko, etc. That isn’t an insult. Why this size? I’ll read your book but I will not buy it on your web site until you provide answers. Can I get your book at the library? Find me a library who will order by Pay Pal from a mystery publisher. The point is that when you get yourself into a bind with those who doubt your thesis, you start throwing insults about and claiming that your book will be the greatest and most important book ever written about the shroud. Yet you make it virtually impossible to be taken seriously. I guess I am supposed to know who you are but I don’t. I have never heard of you. Lighten up and answer some questions..","date":"2010-03-12","mins":"5:02 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1150","author":"ellen_j","post":"John Lupia, that is actually where I went, to the link you provided. How do I know who I am dealing with and that this isn’t an Internet scam? First let us look at the truth about this publisher web site. It is a membership (toy) site hosted by Google. Twenty people have ever visited the site. The site consists of two pages: 1) Regina Caeli Press Home page and 2) Book Titles Available. Book titles available consists of one book, yours, plus the promise of a future book by you. You can also, from the bottom of the page, click into Google to log in, read their terms and conditions, read their privacy policy or create your own toy web site. The domain “reginacaelipress.com” was registered by Domains by Proxy, Inc. Of Scottsdale, Arizona (Go Daddy by another name) on February 20 of this year on behalf of some unnamed person. Is it you? The domain was registered for only one year and was created with private registration (anonymous). That is highly unusual for a publisher or any business. If you doubt any of this go to the ICANN WHOIS database. So, John, who is behind Regina Caeli Press? Do they really exist? Do they have a street address? Do they have a phone number? Did they ever exist before February 20th? Can you think of one good reason to enter a credit card number on an anonymous web site to buy your book? I mean even if this is the greatest book ever written, why would anyone in their right mind do so? I will read you book. Please let me know where I can mail a purchase order with a certified check. Why 4 to 6 weeks for delivery?.","date":"2010-03-12","mins":"3:19 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1147","author":"ellen_j","post":"Hi Stephen. I have always thought that there is an inverse relationship between arrogant proclamations and the significance of what is being proclaimed. If this is so, then John Lupia’s thesis is pure baloney. When I read in his own words that his “book is destined to be the most important book ever written in the history of Shroud literature,” I couldn’t stop laughing. “Scrutiny by experts worldwide is expected just as both praise and caustic scathing reviews,” he writes. “But in the end the thesis will prevail.” So say similar words all those who know where the Ark of the Covenant is hidden and those who have been visited by the crews of UF Os. “Try reading the book before you condemn it,” he says. I have tried to read the book. I checked Amazon, Alibris, Books in Print and elsewhere. Alas, the book is unknown. I finally found the publisher. It is a two page web site that has exactly one book, his book, for sale on two up 8.5×11 paper (think Staples) via Pay Pal. Who is this publisher? Why is it a secret? The web site is registered anonymously through Go Daddy. It is a publisher doing business under the laws of what state? No street address! No phone number! Anonymous web site registration! I’m going to plop down my credit card and pay $32.49 to buy this most important book ever published? Yeah, right! Mr. Lupia writes, “This reminds me of the child at dinner table who refuses to eat his spinach saying he hates it, though he never ate it before.” Stephen, we are not talking about spinach. You and I know that..","date":"2010-03-12","mins":"12:33 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"}]
