[{"id":"comment-198975","author":"matt_kowalski","post":"Wasn’t there a prize of something like $20,000 for somebody to produce a duplicate of the shroud with certain authentic properties? offered a few years ago I recall. Randi should have claimed it by now, eh?.","date":"2015-05-12","mins":"11:30 pm","url":"https://shroudstory.com/2015/05/09/james-randi-visits-the-shroud-of-turin/","cat":"other_sites","title":"James Randi Visits the Shroud of Turin"},{"id":"comment-195542","author":"matt_kowalski","post":"The photo hypothesis deserves credit for stirring up interest in the unique image properties. But besides the problems Prof Porter mentions, there is also the fact that the shroud image is not made up of various shades as a monochrome photo. It is shaded like a pencil or charcoal drawing, made entirely of a uniform dark color dispersed on a light background. And yet it has detail similar to a photo, which would take an amazing artist to pull off. A second problem is the lack of light directionality in the shroud image. This is easy to see by comparing it to the well known “photo shroud” made by Prof. Allen. The photo image shows overexposure on the feet and shadows cast by other physical body parts..","date":"2015-04-06","mins":"10:07 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","title":"One that comes to mind is a favorite photographer around here"},{"id":"comment-195890","author":"matt_kowalski","post":"Yes you have misunderstood me, but only to the degree that I don’t have the technical language to describe precisely. The difference in the shroud’s shading and Allen’s photo is easier to understand by comparing the images, both macro and microscopic. I would refer readers to the analysis of experts rather than try to explain it here. I completely agree with your historical critique of the photo hypothesis. But there are important distinctions to be made about the images also..","date":"2015-04-09","mins":"8:19 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","title":"One that comes to mind is a favorite photographer around here"},{"id":"comment-195891","author":"matt_kowalski","post":"Some of what I wanted to day is best explained by Barrie Shwartz over at the shroud.com site. Http://www.shroud.com/pdfs/orvieto.pdf.","date":"2015-04-09","mins":"8:33 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","title":"One that comes to mind is a favorite photographer around here"}]
