[{"id":"comment-12634","author":"mario_latendresse","post":"On the Shroud Scope I have drawn overlaying bounding boxes for the so called poker holes on the Shroud, but, sorry, they are not indicative of the way these holes could have formed neither how many holes exist near these bounding boxes. Clearly there is a pattern of more than four holes at one location on the Shroud. That one location has a similar pattern as the one on the Pray Codex miniature. See http://www.dshroud.com/shroud Scope/shroud Scope.shtml?zl=6&image=4&lon=9006.5&lat=875.5&poker=t The Pray Codex cannot be understood without referring to the diplomatic context of Hungary vs Constantinople. The king of Hungary Bela III lived at the Constantinople court for almost a decade and was supposed to become the next Byzantine emperor. He was for a while second in ranking in the Byzantine empire. He most likely saw the shroud that was in Constantinople. Bela III became king of Hungary until 1296. Oddly enough, the similar patterns to the poker holes of the Shroud of Turin are now on this miniature drawn by a Hungarian monk in a clear context of Jesus tomb, somewhere between 1293 1295. There is therefore a likely connection between the Constantinople shroud, the Pray Codex and the Shroud of Turin..","date":"2012-06-17","mins":"10:58 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12638","author":"mario_latendresse","post":"Colins Berry wrote “Btw, there is what looks for all the world like a line of stitching on the dorsal side of your 2002 Durante image, just above waist level.” I am not sure I understand. I cannot reproduce this on Firefox or Safari on a Mac. At which zoom level does it happen and which browser are you using? What might be happening is a gap of one or two pixels between the tiles when the Shroud is displayed. The shroud is displayed as rectangular image tiles of 400×200 pixels. I have seen this on the i Pad, but not always. (So far I attribute this to a Safari rendering engine bug on the i Pad) It would clearly be seen as a repetitive pattern of vertical and horizontal straight pixel lines right through the entire Shroud image and can hardly be confused with stitches. If you could attach an image of what you see that would clarify what is wrong. As for the level of coincidences of the Pray Codex miniature details and the Shroud, it is important to take into account the entire context and details at the same time. So far, in the discussion that has been going on this post, none ever refer to the essential fact that Bela III, king of Hungary when the Pray Codex was produced, had been at the Constantinople court for a decade a few decades prior to 1293 1295 and was almost at the level of Byzantine emperor while over there. He surely must have seen the shroud that was in Constantinople. Given the fact that the shroud of Constantinople is the most likely place where the Shroud of Turin was, this fact cannot be put aside. In your reply, you did not consider this fact, neither the other clear fact that on the Shroud you have two different patterns of holes: two with a L shape, two others like a P shape (for a better term, they look like a rectangle). This is exactly the two patterns you see on the Pray Codex miniature. These are two details among others. In any attempt to measure the coincidence of such depictions one is left to quantify the probability that all these details find their way together on the same small miniature drawing. And again taking into the global context of the relation of Bela III and Constantinople. (Of course, you already know that the king is financially supporting the Benedictin monastery where the monks lived.) We could actually model such coincidences. And as an aside curiosity about the Shroud Scope, you can see a loose thread that was drop on the Shroud when the shot was taken (a lost thread during the restoration?): http://www.dshroud.com/shroud Scope/shroud Scope.shtml?zl=11&image=3&lon=3962&lat=6097&poker=t To all readers, where do you think this thread comes from?.","date":"2012-06-17","mins":"1:37 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-18113","author":"mario_latendresse","post":"It is essential to know that between the 8th and 10th century, byzantium went through a religious crisis called iconoclasm that has influenced the depiction of Christ on coins. See http://www.sindonology.org/byzantine Coins/coins.shtml.","date":"2012-10-23","mins":"11:48 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","title":"A good question about Justinian II coins"},{"id":"comment-12643","author":"mario_latendresse","post":"From the photos you posted, this is certainly not a Shroud Scope artifact neither do I think it comes from scanning the image. I think it is a slight defect in the weaving of the cloth (as if the tension on the weft was not kept for a few centimeters) and not stitches..","date":"2012-06-17","mins":"3:05 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12641","author":"mario_latendresse","post":"1. I am not sure I understand your question since I do see an L form in two places, one of them more prominent than the other, as well as two P like forms. In the case of the latter they look like a rectangle, perhaps we should call them O form? I did draw four L forms to point out the fact that the four patterns go together as if something that was burning on one panel (assuming the Shroud was folded) made it through the other panels of the Shroud. This is clearly a simplification of what we can readily see, since some locations have different number of holes. Do you agree? 2. You want to know the coordinates of the L and P forms on the Shroud Scope? This is essentially what I sent in the last post for the L form. The URL contains the coordinates. Note that these coordinates depend on the zoom level. Here is the URL to one L form, I am sure you can find the others (one other L and two P like forms) by panning an changing the zoom level. Http://www.dshroud.com/shroud Scope/shroud Scope.shtml?zl=8&image=3&lon=3482&lat=12552.5&poker=t Notice the lat and lon parameters (the coordinates), as well as the zl (zoom level) parameter in this URL. Does it work for you? 3. The assumption that Bela III saw the shroud in Constantinople is based on common sense and knowledge of what the Byzantine Empire was all about. The Byzantine Empire was a state centered on Christ. The Emperor was often depicted as servant of Christ. The relics of Christ were the most important treasure of the Byzantine Empire. Bela III was the heir of the Byzantine Empire, second only to the Empire. Bela III was sent to Constantinople to further is education. Between the statements that Bela III “never saw” the shroud and he “saw” the shroud, I conclude that the second one is most likely. 4. There was a shroud in Constantinople. This is based on several written documents. The question is: was the shroud in Constantinople the Shroud of Turin? But this is the whole discussion of this post. And your question appears to be formulated as if you are assuming that there is no evidence at all (written or otherwise) that no shroud of Christ was reported to exist in Constantinople. This would contradict many written documents. Do you agree that there is a reported (by various written documents) shroud of christ in Constantinople? 5. There are probably many such representations of the Shroud weave during medieval time. There is of course the Lirey Medallion (still at the Cluny Museum in Paris) and for example the following Notice that the church housing this fresco was constructed in 1164 as a foundation of Alexius Angelus Comnenus, a son of Constantine Angelos and Theodora Komnene, a daughter of Byzantine Emperor Alexios I Komnenos. Do you agree that this fresco does depict the weave of the cloth (of that shroud in the fresco)? Note: I wrote “shroud” not “Shroud”, the former is the shroud we see on the fresco, the latter is the Shroud of Turin..","date":"2012-06-17","mins":"2:44 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12683","author":"mario_latendresse","post":"You misunderstood my statements. I did not assume, in this particular reasoning, that the “Shroud” (as the Shroud of Turin) was in Constantinople. I stated that there was a shroud in Constantinople (notice the lower case shroud). This is a fact well supported by historical documents. So the “logical fallacy” appears as a confusion from your reading of my post. That there are copies of shrouds or other relics is irrelevant. We can today clearly identify a copy of the Turin Shroud vs the Turin Shroud itself..","date":"2012-06-18","mins":"3:39 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-11960","author":"mario_latendresse","post":"An important contextual aspect is typically left out of the discussion about the Codex Pray: the diplomatic relations between Hungary and the Byzantine empire in the decades preceding 1192 1195 (dating of the Pray manuscript). From Wikipedia on Manuel I Komnenos: “The Hungarian heir Béla, younger brother of the Hungarian king Stephen III, was sent to Constantinople to be educated in the court of Manuel, who intended the youth to marry his daughter, Maria, and to make him his heir, thus securing the union of Hungary with the Empire. In the court Béla assumed the name Alexius and received the title of Despot which had previously been applied only to the Emperor himself. However, two unforeseen dynastic events drastically altered the situation. In 1169, Manuel’s young wife gave birth to a son, thus depriving Béla of his status as heir of the Byzantine throne (although Manuel would not renounce the Croatian lands he had taken from Hungary). Then, in 1172, Stephen died childless, and Béla went home to take his throne. Before leaving Constantinople, he swore a solemn oath to Manuel that he would always “keep in mind the interests of the emperor and of the Romans”. Béla III kept his word: as long as Manuel lived, he made no attempt to retrieve his Croatian inheritance, which he only afterwards reincorporated into Hungary”. I found it very likely that Béla had seen the Shroud in Constantinople. This is most likely the location of the Shroud around 1172. Béla left Constantinople well before 1192 and remained king of Hungary until 1196. That makes a very strong connection between the Shroud and Hungary, therefore to the Pray Codex..","date":"2012-06-05","mins":"5:32 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-8007","author":"mario_latendresse","post":"For a Byzantine coin representing Christ with a swelling cheek, an impressive example is from the reign of Constantine VII. It was minted in 945. See http://www.sindonology.org/byzantine Coins/coins.shtml for descriptive text and photographs of that coin..","date":"2012-02-06","mins":"6:42 pm","url":"https://shroudstory.com/2012/02/06/another-justinian-this-one-circa-652/","cat":"art","title":"Another Justinian, this one circa 652"},{"id":"comment-18203","author":"mario_latendresse","post":"I would like to clarify that my post did not intend to describe this particular Byzantine coin, sent by Giulio Fanti, as not worthy of study. It is a very interesting find. The skewed nose on that coin is, I believe, a representation of one interpretation of what can be perceived, on the Shroud, as a broken nose. And as pointed out by another comment from another commentator, It might also relate to the actual emperor who ordered this particular coin to be minted. It might also point to the presence of the Manoppello veil in Constantinople as has been hinted by Max Patrick Hamon. The idea that the nose is curved on the Shroud is not exactly correct. It appears curved since one side of the face is more prominent than the other. Drawing a straight line from the top of the nose to its tip shows a very slight curve, but so small that we could not describe this as curved. Also, it is important to remember that each time the Shroud was laid down to be photographed, the face was slightly shifted left and right, creating slight deviations across the face. You can see these deviations on the Enrie’s photo vs the Durante’s photo..","date":"2012-10-24","mins":"12:37 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-109193","author":"mario_latendresse","post":"Anoxie wrote: “Mario Latendresse has created the second photograph of his anaglyph according to arbitrary parameters.” Sorry, but this statement is false. By “second photograph”, I assume that you are referring to the “depth map”. As explained on the Help Shroud Scope web page, the two photographs used to generate the anaglyph are exactly the same photograph coming from Enrie. No modifications were applied to the Enrie photograph to get a depth map. Of course, the anaglyph was created using a parameter, but that is a basic requirement to generate the anaglyph itself and a large range of values for this parameter produce essentially the same result. In other words, the parameter needed is not essential, nor unique. Anoxie also wrote: ““depth map” on the shroud is isotropic, no perspective, and it’s “the fuzzier the further” and not necessarily “the brighter the closer” as used in his second photograph.”. Sorry, but this statement is also false. A “depth map” has nothing to do with isotropy and the depth map does represent a relation between distance and brightness demonstrated by the anaglyph itself..","date":"2014-05-02","mins":"6:48 pm","url":"https://shroudstory.com/2014/05/02/did-leonardo-da-vinci-accidentally-invent-3d-pictures/","cat":"art","title":"Did Leonardo da Vinci Accidentally Invent 3D Pictures"},{"id":"comment-18081","author":"mario_latendresse","post":"The positive image of the Shroud does not show such a prominent curvature of the nose. It looks rather straight (http://www.dshroud.com/shroud Scope/shroud Scope.shtml?zl=5&image=3&lon=1451&lat=5434.734393275001). What does look obvious from the positive image is a swollen cheek. That can be see on some coins like the one at http://www.sindonology.org/byzantine Coins/Christ Monnai1.gif.","date":"2012-10-23","mins":"2:21 am","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-61776","author":"mario_latendresse","post":"I think that O.K. Has strong arguments in favor of the Veil of Veronica to be the Veil of Manoppello strictly based on the transparency depicted by several painters of the Veil of Veronica. The argument that many painters depicted the Veil of Veronica as not transparent is weak because 1) it is indeed a difficult technique to render, 2) the Veil of Veronica was probably shown from time to time with an opaque background (which obviously make the Veil appears as non transparent), 3) it was not the intention of the painter to show the material reality of the Veil of Veronica. Moreover, Campin was a master at reproducing elaborate (near photographic) details of reality not done by most painters of his time: he took care of reproducing the material reality of the Veil of Veronica which he perceived as transparent or knew to be transparent. Such a detail would not have been reproduced by Campin if he did not have strong evidence that it was transparent. And most importantly, if no painting of the period ever shown a transparent veil (or cloth) for a different subject, then the probability that the Veil of Veronica was indeed known to be transparent is quite reinforced: an artistic perception that was only applied to the Veil of Veronica..","date":"2013-12-18","mins":"4:17 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-18314","author":"mario_latendresse","post":"Then, the presence of the veil of Manoppello in Constantinople could explain the minting of these coins with Christ looking like on the Shroud. This presence makes the Shroud more likely in Edessa than Constantinople prior to 944. The departure of the veil of Manoppello (to protect it from the iconoclasts) from Constantinople to Rome would also reinforce the need of the Byzantine emperors to bring the image of Edessa to Constantinople..","date":"2012-10-25","mins":"9:16 pm","url":"https://shroudstory.com/2012/10/24/max-patrick-hamon-on-the-skewed-nose/","cat":"art","title":"Max Patrick Hamon on the Skewed Nose"},{"id":"comment-18210","author":"mario_latendresse","post":"Could this hint to the presence of the Manoppello veil in Constantinople in the 7th 13th centuries? Or perhaps earlier. I am just giving a plausible range. Also, notice that the Manoppello veil appears to be shifted left and right vertically across the face depending on which photograph you are using. That is, the veil is certainly not “solid” so that its trellis can be partially shifted at one vertical location. But since the veil is between glasses I cannot explain why this is happening. Perhaps the veil was removed from its glass for some of these photographs. In any case, we have to be careful about slight curves (e..g, along the nose) since that might be the sustaining medium (i.e., the byssus trellis) that has these curves. I would need to include many photographs here to show this sifting and I am not sure this is the right place. But that can be looked up on the Web by anybody interested on this subject..","date":"2012-10-24","mins":"2:06 pm","url":"https://shroudstory.com/2012/10/24/max-patrick-hamon-on-the-skewed-nose/","cat":"art","title":"Max Patrick Hamon on the Skewed Nose"},{"id":"comment-139842","author":"mario_latendresse","post":"See also https://ojs.lib.byu.edu/spc/index.php/BYU Studies/article/view File/6399/6048 E. Goddenough remarks that the marking is usually in connection with burial rites. Interestingly, the Gammadia L sign is also found often in a set of four, like on the Shroud. The sign is usually shown close to the knee (on a garment)..","date":"2014-07-22","mins":"5:01 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-22129","author":"mario_latendresse","post":"Hi Giorgio, are you posting this excerpt from Petrus Soons’ Website to say that it explains how the 3 D anaglyphs were produced? That excerpt does not explain that, so I am wondering why you posted it..","date":"2013-01-16","mins":"1:39 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope"},{"id":"comment-139893","author":"mario_latendresse","post":"Russ, the relation between the Shroud’s “poker holes” and the Gammadia has been noted before in a blog entry. See http://frenz64.wordpress.com/category/the shroud of turin/page/2/ It is not an extensive analysis but the resemblance and possible relation is noted. This relation is speculative, but it appears as a likely explanation for the presence of these “poker holes”. Also, note that the poker holes were done by forming not only a Gamma, but a “notched Gamma”, which is also one of the representation of the symbol found on ancient cloths and artistic renderings (I rely on Erwin Goodenough comments on that matter. I have not located these representations yet). Although, the “notched” is quite prominent on the Shroud. As can readily be seen on the Shroud, some other “Gammas” are without a notch because the poker holes were not done completely through the Shroud when it was folded. The symbolism of the Gamma was still used in the fifth and sixth centuries by Christians. It could have been done during that period. Although the relation is speculative, the symbolism of the Gamma and the Shroud matches very well: the Gamma is supposed to represent victory over death, immortality, and so on..","date":"2014-07-22","mins":"11:19 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-22135","author":"mario_latendresse","post":"Giorgio, thanks for the answer. It was not obvious at all that this was the reason you posted this text : ) Also, which part of this text you posted comes from Soons’ Website? The entire text? What is the URL of that text since I can only find parts of that text on Soons’ Website? I find this text quite difficult to follow, probably due to a lack of context and also the non standard notation used. I think the differences between various photographs is a moot point regarding the 3 D data embedded in the Shroud. This can be demonstrated by simply showing how each such photograph can be used to generate an anaglyph. The “quality” of the resulting anaglyphs will vary. Although, the Enrie photograph (besides the Durante and Pia photographs) appears to be the easiest one to use to generate an anaglyph..","date":"2013-01-16","mins":"2:48 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope"},{"id":"comment-22143","author":"mario_latendresse","post":"Hi Giorgio, thanks for the link, but that Web page (at http://shroud3d.com/making of the holograms/enrie photographs) does not contain the text you posted. The Web page at that link starts with the paragraph “When in September 2005 we had produced the first hologram of the face based on a black and white photograph (slide) of the face made by Barrie Schwortz during the STURP investigations of 1978 I made an appointment with Prof. Alan Whanger in January of 2006, knowing that he was in the possession of about 35 high grade second and third generation photographic prints that were donated to him by Father Francis L. Filas, who had a set of first generation negatives. Alan also had three prints from the original Enrie negatives, obtained for him from Turin by Father Peter Rinaldi. The Holy Shroud Guild gave him blanket permission to use them.”. And the rest of that Web page does not contain the text you posted. So, from which part of Soons’ Web site did you get the text you posted? Thanks..","date":"2013-01-16","mins":"4:11 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope"},{"id":"comment-22152","author":"mario_latendresse","post":"Hi Giorgio, thanks for the precision, but I think there is a misunderstanding here! In my previous post, I asked if the entire text that you posted came from Soons’ Website. You simply gave me a link, so I assumed that met “yes all the text I posted comes from Soons’ Website”. What you are pointing out is just a part of that text. So, did you write the rest of the text that you posted, that is, what comes after “Prof. Fanti and Privitera’s paper titled “Constructive of Quantitative image of Turin Shroud for Details Recognition” provides XYZ measurements from the 2002 Durante’s transparency. If we were to use an XYZ sampling from the measurements provided in Fanti/Privitera’s paper we can get an approximate quantitative measurement on how much details are lost with the use of Enrie’s Orthochromatic film which is not sensitive to the color red compared to pan chromatic film photographing the Shroud of Turin. “? Yes or no? If no, where does it come from? Thanks, — Mario Latendresse.","date":"2013-01-16","mins":"5:31 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope"},{"id":"comment-185439","author":"mario_latendresse","post":"Colin, what does “scanning” mean? The Haltadefizione “scan” is not using a laser beam, but a camera attached to a rail robot system, controlled by a computer. 1649 photos were taken of the Shroud, then reassembled on a computer, resulting in a 72 GB photo file. This photo file has never been shown publicly (at the resolution taken), not even on the app Shroud 2.0, although many people think so. What is on Shroud 2.0 is a lower resolution. See the description with photos of the set up at http://www.haltadefinizione.com/en/the shroud.html.","date":"2015-01-22","mins":"2:23 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"}]
