[{"id":"comment-41937","author":"mario_latendresse","post":"Charles Freeman wrote: “Then what about the sudarium and shroud reported to have been taken by the prince bishop of Halberstadt, Conrad of Krosigk, from Constantinople in 1204?” What about them? Can you cite the text you are referring to and the reference? My guess is that you are referring to “Gesta Episcoporum Halberstadensium” where pieces of the Shroud (and a sudarium) are said to have been brought back from the Holy Land in 1205 by Conrad of Krosigk. But this is a far cry from a shroud..","date":"2013-08-25","mins":"3:07 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-47656","author":"mario_latendresse","post":"“It is often said that the images are 3 D encoded. What does that mean? No, I understand that you can plot reasonable three dimensional (height field) shapes from the images, but why? It is often said that the 3 D data represents spatial information (distance between the body and the cloth – somehow). There is no way to know that without presuming something about how the image was formed. ” 1) Your answer to “What does that mean” is “No ….” Why do you start with “No”, no to what? I guess the “, but Why?” is the real answer. You can plot meaningful 3 D because the light intensity variations on the cloth allow it. 2) “It is often said that the 3 D data represents spatial information (distance between the body and the cloth – somehow). There is no way to know that without presuming something about how the image was formed.” No, this is mostly independent of how the image was formed. Though it is dependent on how the cloth was wrapping the supposed corpse. See how 3 D data can be easily decoded at http://sindonology.org/shroud Scope/shroud Scope Help.shtml#3 D.","date":"2013-10-16","mins":"11:20 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-20293","author":"mario_latendresse","post":"Extract a bucket of water from the ocean and you will have tens and probably hundreds of organisms providing DNA segments. How do you sort out these segments? This is metagenomics (something we are planning to work on in our research group, see work on metagenomics http://tinyurl.com/5t8nlm8). On the Shroud you will have DNA segments of individuals (homo sapiens), animals, fungus, bacteria, and so on, in the hundreds. You can imagine identifying which organisms some of the DNA segments come from, but individuals? Reconstruct the entire DNA of one individual? The DNA material would have to be in very good shape and recent. And you would have to identify DNA sequences coming from mitochondria and other organelles and there will be no certain way to attach these different sequences to specific individuals. In any case, there appears to be no way to infer that one individual was missing some genomics material. The supposition that there is probably only one “genetic code” or that “there could be two genetic codes” is, I am afraid, very far from what you will find..","date":"2012-12-12","mins":"1:09 pm","url":"https://shroudstory.com/2012/12/12/on-genetic-codes-and-the-shroud-of-turin/","cat":"blood_studies","title":"On Genetic Codes and the Shroud of Turin"}]
