[{"id":"comment-173657","author":"mario_latendresse","post":"Joe, glad to see that you openly give your opinion about a second radiocarbon dating. But I think the arguments that you gave, apparently coming from many other people at the St Louis conference, are not valid. You wrote: JM: “And if another test is done and it comes out 1st century, don’t you think the skeptics would constantly bring out facts that they think invalidated the results?” ML: Any invalid arguments can be used by anybody. No research would be done if we were expecting everybody to agree. But correctly performed tests clarify open questions. JM: “As several people at the conference pointed out, if another C 14 test was done and didn’t come out 1st century for whatever reason, the case for the Shroud’s authenticity would effectively be over.” ML: First, not “come out 1st century”, may mean anything beside 1st century, which include spurious results such as 4th century, 8th century, in the future (yes, that is possible), and so on. A non 1st century in discordance with the 1988 result would point out that something is going wrong and some unforeseen factors are involved. Or, the samples that would be analyzed could point to new results. These are possible outcomes. This is a major new result that does not point to non authenticity. On the contrary, it would invalidate the certainty of the 1988 radiocarbon dating. Second, being afraid of a result that would not point to authenticity is not at all what should be expected from researchers. JM: “Prof. Barberis has apparently been trying for 10 years to get an international commission formed to look at the problems of carbon dating the Shroud. I think that if a good commission was formed and an appropriate protocol was produced, it would be possible to do a legitimate C 14 test.” This is a good initiative by Prof. Barberis. A second radiocarbon dating is needed to move ahead. One aspect that is needed for this second dating is the involvement of various groups of people, some that are known to be against and other for the authenticity of the Shroud. It is unfortunately needed in the case of the Shroud. I really do not see any good arguments against a second radiocarbon dating..","date":"2014-11-29","mins":"5:34 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173701","author":"mario_latendresse","post":"David, “What other object from antiquity has possibly travelled the unique journey that this relic has?” By definition, no other object would have travelled THIS unique journey. So the answer is embedded in the question: it is none. “Where is the C 14 baseline for such an anomalous item?” Anomalous, or unique? Radiocarbon dating would be affected by uniqueness? “We still haven’t discerned the means of image formation.” We have not yet understood how the universe came to be, yet we have estimated its age and we are still refining it. Granted, this estimation can be repeated at will and by everybody, which is therefore more thrusted than the 1988 radiocarbon dating of the Shroud or any future radio carbon dating of the Shroud, which cannot be repeated at will and by everybody. “So how do we know C 14 dating, regardless of what date it produces, is the definitive method for dating such an anomalous object?” The C 14 dating would prove itself to be unreliable on the Shroud if it shows inconsistent dates. Otherwise it becomes more consistent. Consistency of radiocarbon dating on the Shroud is at the heart of many discussion in Shroud research. Let’s verify this level of consistency. “Of course if one assumes the cloth is medieval it’s trajectory through the last few hundred years can be accounted for better. C 14 seems an obvious method to use.” The medieval period is from the 5th to the 15th century. If a second radiocarbon dating gives the 5th century, it becomes inconsistent and unreliable. “But if one assumes it is 1st century, the question marks one encounters are exponentially multiplied.” Consistency is what is going to be verified. Fears of the result should not stop a second radiocarbon dating..","date":"2014-11-29","mins":"10:28 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-46567","author":"mario_latendresse","post":"Hugh Farey wrote: ” In other words the top image of the shroud should be longer than the bottom one, which it clearly isn’t. “. Please, show your measurements (that is, lengths and end points on the image) that “clearly” show that this is the case. This is easy to do with the Shroud Scope..","date":"2013-10-08","mins":"9:03 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-185185","author":"mario_latendresse","post":"100 years off is common for radio carbon dating. What is surprising, is that their averaging technique gave the perfect range in relation to the historical documents known in 1988. The overall result looks so great in a paper. The chi square value at 6.2 for the Shroud remains the key flag that the results appear contradictory. Compared to the the other radio dating dates, the Shroud is an outlier..","date":"2015-01-21","mins":"3:59 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-95531","author":"mario_latendresse","post":"These posts about the hacking theory … I wish I had more time to write. It brings back some good old memories of teaching young student (I was a bit older than my student) classes to program the VAX 11 (at a CEGEP in Montreal in the early 1980s) in assembly language. I guess I can say I was making a living programming the VAX 11 in assembly language. I hope a complete description of the set up of each lab can be summarized at some point. It would be an interesting historical record. I have not seen yet the raw radio carbon counting data. Did I miss them through all these posts?.","date":"2014-04-01","mins":"12:12 pm","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-95729","author":"mario_latendresse","post":"I am certainly not advocating the hacker theory(!), but what is odd, are the erroneous statements made by Prof. Ramsey and Dr. Jull about computer networking in the 1980s and the confusing statements they made about the calculation of ages based on the C14 and C13 counts for the Shroud. First, the erroneous statements about networking. Dr. Jull wrote “Indeed, in 1988 the internet (as we know it today) didn’t exist – there was a pre existing network run by the US government which was quite restricted.” A) This is irrelevant because as soon as you can connect to a computer you can potentially hack it remotely, no Internet, as we know it today, is needed. B) It is erroneous: there were many large scale networks between universities, data centers, and government employees before 1988. In 1978, I was programming a computer located 250km away from my school and communicating with many other users at many other schools throughout the province of Quebec. By some accident, I turned out to be able to read all file names on some disks at the ministry of education. This is unthinkable today in terms of security. In 1981, I was working in a government data center in the province of Ontario. Their Amdhal V8 was connected to over 1000 terminals across the province of Ontario. From 1983 to 1989, I was programming a computer at the school I was teaching via a modem from my home. Remotely hacking computers was possible prior to 1988 and it was done. Of course, many people can attest to large scale networking in the early 1980s. Prof. Ramsey wrote: “Yes – I agree with all that Tim says. This would seem to be a suggestion from someone who does not know what computers were like in the 1980s.” This is unfortunately the opposite because Prof. Ramsey is either saying that large scale computer networking was not common back then, or that hacking computers (remotely or not) was not possible, but in both cases it was possible and done. That definitely may not apply to any computer used by the radio carbon dating labs, and only the persons that knew precisely their set up could answer. Second, the confusing statements about the calculation of ages based on the C14 and C13 counts. Dr. Jull wrote: “This is impossible. In our case, the software for the calculations is offline. In any case, the calculation does NOT require software, it was done offline and plotted on a graph, as I recall”. This is confusing. He wrote “the software for the calculations is offline”, so that means they were using a software on some computer, then “the calculation does NOT require software, it was done offline and plotted on a graph”. Why to state that it does not require a software? Does it mean that it was done by hand? Were they or not using a software to do the calculation? I can’t tell from these two statements. Prof Ramsey wrote: “Age calculation was done offline and could just be done with a calculator, or by a simple program into which you typed the numbers from the AMS.” That simply says that the calculation was simple, but that still does not say if a computer was used or not in the case of the dating of the Shroud..","date":"2014-04-02","mins":"1:55 am","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-11719","author":"mario_latendresse","post":"Three things about this paper: (http://www.sciencedirect.com/science/article/pii/S0047248412000425) 1) Notice that one of the co author is Dr. Thomas Ramsey from the Oxford lab. 2) The authors do report issues about decontamination of bones to get accurate result with radio carbon dating. The overall study shows an open minded point of view on the possibility of contamination when confronted with contradictory results. This is something that would also be expected for the Shroud. 3) One of the main problem does not apply to the Shroud since, for this study, they are using carbon dating at the limit of its capability (artifacts close to 50000 years old)..","date":"2012-05-30","mins":"11:59 am","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","title":"New Dawkins Challenge Video"},{"id":"comment-10914","author":"mario_latendresse","post":"A previous (very?) similar paper was presented at the Frascati Conference (2010). For a free copy, see http://www2.lse.ac.uk/statistics/research/RAFC04 May2010.pdf. Hang on for some interesting combinatorial analysis in that paper. It lends credence to the theory of an odd sample..","date":"2012-04-28","mins":"2:05 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-11725","author":"mario_latendresse","post":"I meant 1) Notice that one of the co authors is Dr. Christopher Ramsey from the Oxford lab (As seen in the video)..","date":"2012-05-30","mins":"1:59 pm","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","title":"New Dawkins Challenge Video"},{"id":"comment-172752","author":"mario_latendresse","post":"This paper should not be taken too seriously. The sample area of the 1988 radiocarbon dating is NOT a rectangle. Therefore, the very simple calculation of 8.1 cm x 1.6 cm for the area of the sample cannot be correct, whatever the width and length used. This error completely changes all the other calculations and the main conclusion..","date":"2014-11-23","mins":"11:23 pm","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"id":"comment-210977","author":"mario_latendresse","post":"Dear Marco, It appears that you are assuming that I think that the analysis of the Raes spectrum by Rogers confirms that gum Arabic is present on the sample he studied. I do not think that. My first point is that there is not enough information provided with the spectrum to do its full analysis, in particular the temperature at which the spectrum was created and the energy of the ionization that was used for that spectrum. Also, it would require several spectra of that sample at different time during pyrolysis to help confirm the identity of the molecules involved. On the other hand, the spectrum is not very far from what Rogers concluded, in particular, furfural appears present in that spectrum and the intensity at m/z 126 is negligible. My second point is that you made an error by over interpreting that spectrum, in particular by asserting that by removing what you call the “contaminant” you would get the same spectrum as the image only sample. But without identifying precisely that contaminant, it is not possible to come to that conclusion. You would need to quantify every peak of the contaminant, which you have not done, and which is not even possible to do given this single spectrum. You also made a clear call on m/z 126, stating that it would become a value similar to the spectrum from the image only sample once the contaminant was removed. But, this is arithmetically impossible, if you do some simple calculation, whatever that contaminant is. (multiple by 4 (the ratio for m/z 131 between the two spectra) the near zero value of m/z 126, and you certainly cannot get close to 25 as in the image only spectrum.) In other words, something else appears at play with that spectrum and it could be what Rogers concluded or something more complex: gum Arabic mixed with sebum and some cellulose, or gum Arabic with some other material, or sebum with cellulose, etc. Also, let’s not forget that the gum Arabic identification in Rogers’ paper was not based only on the spectrum. So a full appreciation of its conclusion is not strictly based on that spectrum. How do you classify “pseudo science”? Would an invalid manipulation of a spectrum be classified as “pseudo science”?.","date":"2015-09-23","mins":"3:35 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210540","author":"mario_latendresse","post":"Marco Bella wrote: “… there is no significant difference between the two spectra, except the contaminant. Whatever it is, it should not be there.” But then a few days later you wrote “it is compatible with the presence on Raes sample of “oligomers from polyethylene””. So, your determination of the M n14 peaks are definitively oligomers from polyethylene? I would revise this statement, see for example http://www.sciencedirect.com/science/article/pii/S0142941812000256 The mass spectra would have m/z values way above 500 for oligomers coming from polyethylene. Besides, this polyethylene contaminant should be so small that the spectra of the pyrolysis of the sample itself would have the major abundances, not the other way around. When you wrote your editorial publication you only gave a very general class of molecules for the contaminant (long hydrocarbon chains), which I believe is the only possible conclusion given the lack of more mass spectra at/of different times/temperatures. A more precise determination would require an identification of the other peaks, in particular peak m/z 131, which you have not identified its provenance. But more importantly, your determination of the abundance of m/z 96 coming from the “contaminant” is unproven in your publication because until you know the other molecule(s) involved in that spectra (and the exact “contaminant” molecular structure), you cannot determine the relative abundance for the m/z 96 peak coming from the “contaminant”. It can be a combination of two or more fragments of two or more different molecules interfering in the mass spectra. Also, your statement that the relative abundance of m/z 126 would be non zero when removing that “contaminant” spectra is odd. The mass spectra shows a relative abundance of zero for m/z 126, and this is all that can be said. In summary, your statement that the two mass spectra are identical once the “contaminant” mass spectra is removed is at least very approximate but essentially unproven. And what you consider a “contaminant” can actually be coming directly from the sample, in particular from sebum, which is mostly made of lipids, and the fact that this section of the Shroud has been heavily hand manipulated to hold and display the Shroud..","date":"2015-09-16","mins":"3:26 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-216810","author":"mario_latendresse","post":"A short communication answering the Bella et al. Paper on the mass spectrometry analysis by Ray Rogers of fibers of the Raes sample has been accepted to be published in Thermochimica Acta. See http://www.sciencedirect.com/science/article/pii/S0040603115004724 The final version should be posted soon by the publisher. I will post a summary and a draft version of this communication at http://www.sindonology.org in a week, that is, on Christmas day..","date":"2015-12-18","mins":"1:38 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-215048","author":"mario_latendresse","post":"Charles, “The Shroud seems to be a typical linen that was once painted with the linen surface being discoloured by centuries of gesso and paint being placed over it in the way that the medieval manuals laid down.” Nonsense. Have you ever laid gesso on a piece of linen and try to remove it mechanically without damaging the fibers?.","date":"2015-11-23","mins":"11:23 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215052","author":"mario_latendresse","post":"Charles, did you ever put gesso on a piece of linen and tried to remove it after it dried?.","date":"2015-11-24","mins":"3:21 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"}]
