[{"id":"comment-29141","author":"mario_latendresse","post":"Une version française de l’exposition du Linceul de Turin: http://www.ktotv.com/videos chretiennes/emissions/nouveautes/direct ostension du saint suaire de turin/00075867.","date":"2013-04-02","mins":"11:27 am","url":"https://shroudstory.com/2013/04/02/ostensione-televisiva-della-sindone-2013/","cat":"event","title":"Ostensione Televisiva Della Sindone 2013"},{"id":"comment-33783","author":"mario_latendresse","post":"Yes, I read her entire blog entry on the Shroud. I am not saying the information is exact and precise. The ending is interesting by itself as she describes that she was disappointed by the whole exposition. That shows that many misunderstanding can occur when describing the Shroud to the general public. She could have misunderstood the descriptions in the exposition or the descriptions were indeed not precise enough. That I do not know. But, it sends a message to anyone organizing such an exposition. I think it also points out at the difficulty of precisely describing the Shroud for the general public and doing so in a honest manner. As an anecdotal note: When the subject of the Shroud comes up casually with friends and people I know or meet for the first time, the majority think that the Shroud has *only* a face image impressed on it. The majority. This is anecdotal and certainly not a well established statistical analysis. And, I do not remember one that knew that a dorsal image existed on it..","date":"2013-05-16","mins":"12:12 pm","url":"https://shroudstory.com/2013/05/15/review-of-the-holy-shroud-exhibition-in-seville/","cat":"event","title":"Review of the Holy Shroud Exhibition in Seville"},{"id":"comment-33776","author":"mario_latendresse","post":"I contacted the author, she put it back online. That changed the link. The link is now http://sambfarkas.blogspot.com/2013/05/set up pay off shroud of turin 16.html Russ Breault is right. And I would add that her description goes right to the point..","date":"2013-05-16","mins":"11:05 am","url":"https://shroudstory.com/2013/05/15/review-of-the-holy-shroud-exhibition-in-seville/","cat":"event","title":"Review of the Holy Shroud Exhibition in Seville"},{"id":"comment-37415","author":"mario_latendresse","post":"I took the leisurely step to attend the meeting at Gilroy. Mark Okuda did a nice clear presentation. It was a college level science workshop. He personally did not appear to have any take about the authenticity of the Shroud. Which is refreshing. In essence, the presentation was not really about the Shroud, but how a scientific investigation can be done about the Shroud. He focused around some of the science involved in authenticating the Shroud as a shroud. Since it was a science workshop, you had some scientific instruments, like microscopes around the room for people to use, blood testing kits, radio C14 calculations to be done, etc. For the microscopes, he showed how to distinguish between linen and cotton fibrils. The difference was quite clear. One striking aspect is that a linen fibril has lots of microscopic fractures across its width. It would be easy for anybody to confuse these fractures with colored fibrils. Overall, Mark Okuda is a really good teacher. As a side note, it was free (i.e., paid by the Santa Clara county library administration) and the presentation might be repeated again in the Santa Clara county (essentially, the Silicon Valley)..","date":"2013-06-19","mins":"8:20 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-177851","author":"mario_latendresse","post":"The curator, David Killick, made several erroneous statements when describing the Shroud of Turin. First, he mentions the Shroud because he shows a photograph of the shroud sample that the Arizona radiocarbon dating lab received in 1988. But then he goes on to try to describe the Shroud. Among other statements, he made a definitive statement as to how the image was formed on the Shroud: from oil coming from the body. He appears as if he made up this claim to fill up some explanation for the formation of the image to make the presentation more complete and coherent with the result of the radiocarbon dating. He went on to add more dubious explanation (e.g., pay an enormous price, which is not the case for the Shroud of Turin) trying to back up the result of the Arizona lab. This is not a good approach from a curator where every curated fact must be verified. So, perhaps an email to the university of Arizona is in order to correct this video. Carlos, the curator is not really saying that there are cotton and linen fibers in the photograph but that the fibers can be verified through a microscope to detect different types. No confirmation of different types is given. But I find the erroneous statements about the Shroud more alarming..","date":"2014-12-19","mins":"6:06 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","title":"New Paper by Pam Moon"},{"id":"comment-169880","author":"mario_latendresse","post":"This is it, as a paper? The first 4 page document is essentially an abstract. The slides have no clear explanation. Sorry, the presentation is confusing. These documents do not prove the claim made..","date":"2014-11-08","mins":"11:31 am","url":"https://shroudstory.com/2014/11/08/another-st-louis-paper-available-the-halo-study/","cat":"st_louis_2014","title":"Another St. Louis Paper Available: The Halo Study"}]
