[{"id":"comment-181383","author":"mario_latendresse","post":"What about doing the experiments of blood transfers from hair to cloth. What would we see? Does it look similar to the Shroud, back and front?.","date":"2015-01-04","mins":"11:05 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181483","author":"mario_latendresse","post":"Again, what Lind & Antonacci missed to consider: the possibility of images of bloody wounds (e.g., whip slashes) vs bloodstains themselves. For example, their discussion of bloodstains on the shoulders (back image). Are we seeing real bloodstains or images of the wounds? An very important observation that was not noticed and pointed out in that paper: on the recto image, taken in 2002, of the back image, there does not appear to be bloodstains on the shoulders, although that paper claim that there are. This is an essential crucial point of all their discussion. They are extremely (!) extraordinary claims made in that paper! Do people on this blog see these? Before making such extraordinary claims, basic fundamental observations must be supported in that paper. They are not. That completely destroy almost everything else claimed in that paper..","date":"2015-01-05","mins":"1:01 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181382","author":"mario_latendresse","post":"Yes, Lavoie published some results a long time ago similar to what this paper is reporting and in this paper, Lind & Antonacci do mention that they are reproducing some of Lavoie’s result (even stating that Lavoie was the first one to do so). On the other hand, the main experiments that are lacking, and which is central to what is claimed in the first part of this paper and Lavoie’s claim, is some experiment of blood transfer from the hair to the cloth. Lavoie never reported such results and Lind & Antonacci do not either. These experiments are essential because it is claimed by Lavoie that the blood we see around the hair on the Shroud do not come from the hair. It would have supported this claim if it were shown that such blood traces we see cannot come from the hair. As for this paper, it is essential to do the experiment of blood transfer from hair to cloth because, if I understand Lind & Antonacci, one of their main claim is that the blood from the hair is transferred from the scalp to the cloth as the cloth “moves through the body” (I am simplifying, the claim is more complex, see page 8 of Lind & Antonacci’s paper). And this is based on the claim that hair cannot create the blood pattern we see on the Shroud. Once again, no experiment is done to show that this is not possible. I think it is possible, and some people can try it by themselves. I think the explanation is much simpler: the hair is compressed against the bloody wounds on the scalp and the blood seeps through the hair and makes the pattern of bloodstains we see on the Shroud..","date":"2015-01-04","mins":"11:03 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181729","author":"mario_latendresse","post":"Dear Thibault, Thanks for your answer. You wrote « The bloodstains on the back of the head seem to be much more realistic. As I wrote, ” blood impregnates the hair locks whose roots are in/near the injury”. » So, you agree on the main point I made on my first comment of this post: in the paper by Lind & Antonacci (the main subject of this post), it is stated that the blood stains from the back of the head are not natural and therefore that the blood stains come from the scalp, not the hair. That may sound strange, but this is what the paper says. I quote their paper “Direct contact alone cannot embed all the Shroud’s various blood marks with their complete and intimate features.” So, how do these blood stains come from the scalp and not from the hair according to Lind & Antonacci? The body dematerialize and re materialize: the transfers of blood is not occurring by “simple” contact, but when the body dematerialize and goes through the cloth, then when the body materialize again (resurrection)! This is essentially Jackson’s hypothesis. This is very far fetched (with all respects to the authors). Did you notice that general theory to explain the blood stains in their paper? Again, the main problem is the following: This scenario (i.e., body disappear and reappear), as presented in that paper, is based on the assumption that the blood stains cannot have been produced by simple contact from the hair. This point is a fundamental premise that must be proven and discussed before going any further. But this point is not even discussed and nobody has ever proven that point (again not even Lavoie ever discussed at length that point and proved that the blood stains cannot come from the hair). This is major flaw of this paper. You made the statement that the rivulet looking bloodstains we see from the hair, from the front, on the side of the face cannot come from the hair. Any proof of that? How can you prove that? I think the burden of proof is on the person making that claim. Of course, blood does not typically behaves the same if it is transferred from the skin or the hair. The main difference is that the density of blood that can be transferred, if no pressure is applied, is going to be larger from the skin when compared to the hair. This is exactly what is happening when considering the photos taken from the recto (underside) of the Shroud, in 2000 (See “Shroud Images 2000”, published by Editrice, 2001). From these images we can see that all bloodstains from the hair on the sides of the face, in particular the rivulet ones, did not penetrate through the cloth, as far as it is possible to see from Fig. 5 of that book. That means that a smaller density of blood transfer occurred at these locations, which is coherent with a transfer from hair, not from skin. All blood stains coming from the skin in the face transfers as coming from the skin. This is an import point to notice when discussing the blood transfers of hair vs skin. And, there is nothing extraordinary about these rivulet like looking blood stains in the hair. I see them as, for example, simply locks of hair with blood on them that slightly touch the Shroud. I could produce some photos of such transfer, but they will be very simple and nothing special (I did some many years ago). What does prevent this possibility? It is quite straightforward..","date":"2015-01-06","mins":"11:15 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181898","author":"mario_latendresse","post":"Hi Thibault, Yes, a terrible terrorist attack just happened in Paris. Solidarity to the French people and nation!.","date":"2015-01-07","mins":"3:50 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181733","author":"mario_latendresse","post":"Correction to one sentence in the previous post: “This scenario (i.e., body disappear and reappear), as presented in that paper, is based on the assumption that the blood stains cannot have been produced by simple contact from the hair.” should actually read “This scenario (i.e., body disappear and reappear), as presented in that paper, is based on the statement that the blood stains cannot have been produced by simple contact from the hair.” The “blood stains not coming from the hair” is not an assumption, it is stated as true in their paper..","date":"2015-01-06","mins":"11:46 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181766","author":"mario_latendresse","post":"Also, there is a technical error in that paper about the first complete photograph of the underside. It is in 2000, not 2002. It was done also in 2002 but we have a complete Shroud photography of the underside made in 2000 (by Gian Carlo Durante). The paper state: “In 2002, the Shroud’s patches and backing cloth from 1534 were removed. This revealed the full outer (or opposite) side of the cloth for the first time in five centuries. This allowed all 14 feet of the inner and outer sides of the Shroud to be photographed for the first time ever.”.","date":"2015-01-07","mins":"3:06 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181895","author":"mario_latendresse","post":"Hi Colin, The 25% resolution applies to the Mark Evans photomicrograph collection (32 photomicrographs available from Barrie Schwortz), not to the Durante photograph. I do not have access to microphotographs (digital version) from Durante. These Evans photomicrographs are all accessible and described from this web page http://www.sindonology.org/photomicrographs.shtml Note: I have curated the data from Barrie to determine their location on the Shroud as best as I could. They are also all accessible directly from Shroud Scope http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=0&image=4&lon=446.0&lat=122.0&photomicro=t The photomicrographs layer is active when you use that link: each green square corresponds to a photomicrograph from the Evans collection. Yes, I think that higher resolution photographs, made during 2000 and 2002, would greatly help resolve several open issues. I do not have access to them except through the books published by the Turin authorities. These books are accessible to anybody, although you may have to order them directly from the publisher (please, also check at several amazon web sites in Europe, not available at amazon.com) The only access I have to the recto images is from these books published in 2001 and 2002 (three such books). I do not know of any researcher that have accessed to the digital higher resolution images of the recto images. This is a pity..","date":"2015-01-07","mins":"3:27 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181880","author":"mario_latendresse","post":"Hi Colin, (and Happy New Year!) The Shroud Scope presents all the 32 photomicrographs (at 25% of their original resolution), with permission from Barrie Schwortz, and are copyrighted as noted on the Shroud Scope. There are more documentation on the sindonology.org web site about these photomicrographs and other existing photomicrographs which I do not have access to..","date":"2015-01-07","mins":"1:50 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181852","author":"mario_latendresse","post":"Oskar, there is a basic misunderstanding. The word scalp means “the skin covering the head, excluding the face”. When I wrote “the front on the side of the face”, I really meant the side, not near the top of the face. It was a specific discussion of the few rivulet looking blood stains on the side of the face. They certainly cannot come from the scalp. Perhaps from the cheek as you wrote, not the scalp, but I do not think this is the case either, explained at length in the paper that the Shroud was not flattened I presented at Dallas in 2005. And even more so with the explanation of the difference of the amount (density) of blood transferred as I discussed in my previous comment..","date":"2015-01-07","mins":"11:39 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181877","author":"mario_latendresse","post":"Oskar, I agree with the main point you are saying in this comment, and the summary of what that Dallas paper was about. But my main question is: Can the frontal bloodstains come from the hair? Note: A demonstration that the blood stains can come from the skin is not a proof that they cannot come from the hair..","date":"2015-01-07","mins":"1:36 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181889","author":"mario_latendresse","post":"Oskar, you answered the main point I was stating: these virulet looking bloodstains can come from the hair. Thibault disagree because he says it is impossible. I would like to see some proof of that from Thibault. I understand your skin/hair explanation, but this is another subject that is somewhat unrelated to the Lind and Antonacci paper of this post. I think it is better to concentrate on that paper: is the main point made in that paper right?.","date":"2015-01-07","mins":"2:50 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181511","author":"mario_latendresse","post":"Dear Thibault, (Bonne Année 2015!) There are at least two types of bloodstains coming from the hair that should be considered separately. 1) The bloodstains that appear coming from pressure, such as the ones on the back of the head. 2) The bloodstains that appear not coming pressure, such as the ones from the front side. They do appear differently. Right? You wrote: “There are blood images in the hair (frontal side) which are NOT consistent with this fact. Mainly the winding blood mark seen in the hair area (front side). It is simply impossible even if “the hair is compressed against the bloody wounds on the scalp and the blood seeps through the hair” The compressed explanation I gave, is for the back, not the front. The bloodstains you mentioned, coming from the front on the side of the face, cannot be coming directly from the scalp, because these bloodstains are far away from the scalp. They could simply be coming from the hair from blood that drips from the head into the side hair. I could should you such transfer, from hair to cloth by using a viscous liquid. They look similar as we see on the Shroud. As for the back, they do not look much like rivulets of blood. They look like compressed hair with blood in them that is pressed onto a cloth. I can show some similar transfer as well. Remember what is claimed, and what you wrote: “It is simply impossible”, which means that you have to show that there is no way these bloodstains cannot come from the hair. But I see no clear explanation (from Lavoie, Lind or Antonacci) of such impossibility and no experiment done. I want to emphasize this point because it is important: At no point in any of the papers written by Lavoie (probably 3 such papers in various publications like SSI) that he claimed that these bloodstains cannot (i.e., impossible) come from the hair. Some people may have inferred that, but that claim is never made. So, Lavoie never attempt to prove that point, which would be very difficult to prove because, again, simple experiments show that it is possible. Have you tried to put some blood (or viscous liquid) on some hair and pressed them on a cloth and see the result?.","date":"2015-01-05","mins":"7:30 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181896","author":"mario_latendresse","post":"Yes, the main point is what is stated by the paper of Lind & Antonacci. Their main point is that the bloodstains we see in the hair cannot have come from the hair. Then they build their scenario around that statement …..","date":"2015-01-07","mins":"3:45 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"}]
