[{"id":"comment-215553","author":"mario_latendresse","post":"Joe, did the Mandylion reached the Sainte Chapelle of Paris or not?.","date":"2015-12-03","mins":"9:58 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215569","author":"mario_latendresse","post":"Joe, you wrote “It wasn’t a relic of the passion”. In the chronicle of the translation of some of the relics written by Gérard de Saint Quentin en l’Isle, the Mandylion reliquary is described as tabula quedam quam, cum deponeretur Dominus de cruce, ejus facies tetigit[p. 298, Miller, 1878] (a board that touched the face of the Lord, when he was laid down from the cross) He was describing the reliquary that contains the Mandylion, and clearly he thought this was used during the Passion of Christ. How clearer can it get?.","date":"2015-12-03","mins":"12:28 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215579","author":"mario_latendresse","post":"Joe, you wrote “For me (and most historians), yes”. And on which documents do you base this affirmation? How do you know the Mandylion reached the Sainte Chapelle of Paris?.","date":"2015-12-03","mins":"3:01 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215493","author":"mario_latendresse","post":"Joe, (please, what is your full name?), The “shroud of Christ” was not considered the most precious relic at Constantinople. You can see it from the history of the relics in that city. You have to study in details many documents, including the translation of the relics from Constantinople to Paris, how the relics were kept at the Sainte Chapelle of Paris, and all inventories of the relics at the Sainte Chapelle to understand the scenario that the Shroud may very well have gone through the Sainte Chapelle without being noticed. Without this study, it is not possible to answer all your questions. Please see http://www.sindonology.org/sainte chapelle.shtml Remember this very basic fact well proven by history: the Latin (the West) did not know anything about the Mandylion by the time they reach Constantinople in 1204. And that goes on at least for another century or two. The West even create its own story about the image of christ (known as the Mandylion in the East): the Veronica..","date":"2015-12-02","mins":"11:54 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215468","author":"mario_latendresse","post":"Yes, Daniel Raffard de Brienne († 2007) in his “Dictionnaire du Linceul de Turin”, pp. 12 15, clearly shows his preferences for the theory of Othon in possession of the Shroud in Athens. But he also stated his preference for the Shroud to have been brought back to France, after 1311, by one of his ancestors, the wife of Gautier V de Brienne, and his son Gautier VI would have given it to Geoffroy de Charny. But there is no tradition or document to support that route, except the letter of Theodore Angelos discovered in 1981 by Pasquale Rinaldi, but whose authenticity has been questioned (e.g., Karlheinz Dietz, Andrea Nicolotti). We could think that Daniel Raffard de Brienne favored the theory of Othon because it would made his family as part of the story of the Shroud. But again, I believe that Othon de la Roche is a dead end for many reasons. As for the Templars to have been involved with the Shroud: it is largely based on suppositions, and I am afraid, another major misleading route. By the way, I am surprised that researchers proposing the Templars as owner of the Shroud have never (as far as I know) cited the translation of the relics from Constantinople to Paris as a probable path for the acquisition of the Shroud by the Templars. It is indeed related, in the story of the translation of the relics to Paris, that the Templars in Syria kept several relics deposited by Baudoin II in exchange for financial help. These relics were transferred to Paris after Saint Louis financially help Baudoin II. But the Templars could have extracted the Shroud from one of the reliquary, the Mandylion reliquary, so that an empty Mandylion reliquary arrived in Paris! That would be a nice story. But I do not believe it at all. But one thing that needs to be pointed out: the translation of the relics from Constantinople to Paris do not appear to have been studied by the researchers proposing the Templars as owning the Shroud, because they could base it on these documents. You can spend a lifetime researching misleading routes (because they never lead to a solid solution), so better avoid them, and instead follow the ones that appear most likely given the documents we have that are surely authentic. We have statements from the clerics of Lirey (Philippe VI gave the Shroud to Geoffroy de Charny), the statements made by the son and granddaughter of Geoffroy de Charny (son: a gift, granddaughter: acquired from war). These statements should not be contradicted unless solid reasons are given. In which occasion would Geoffroy de Charny receives the Shroud as a gift and due to his war services to king Philippe VI (and most probably from a relic taken from the Sainte Chapelle, documents: inventories of the Sainte Chapelle)? That is a more fruitful route coherent with an authentic tradition and documents..","date":"2015-12-02","mins":"2:41 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215549","author":"mario_latendresse","post":"Louis, you wrote “Other “Shroudies” were stressing the link he is supposed to have made between Athens and Lirey by placing his ancestor in between.” It is not other “Shroudies” who stressed that link, it is Daniel Raffard de Brienne who did. You wrote “he is supposed”. This is not the case, he is the first one who explicitly proposed and described that link in details in his “Dictionnaire”. This is not a supposition. One of the important implications of Geoffroy II de Charny and Marguerite de Charny’s statement is that the Shroud does not come from Jeanne de Vergy. And that is coherent with other documents we have. I also do not see no any document or solid arguments to disprove the statement from the clerics of Lirey that Philippe VI gave the Shroud to Geoffroy de Charny. This is an important link. What comes before is obviously an open question. You wrote “Was it because Pope Innocent III sent a letter to the mercenaries telling them that they had been excommunicated?” Which “mercenaries”? Are you referring to the Templars as “mercenaries”? Supposing any such letter would contradict other known authentic documents. The Templars were involved in helping keep some relics that were in Constantinople. And this is not a supposition, this is a documented fact..","date":"2015-12-03","mins":"9:38 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215520","author":"mario_latendresse","post":"For Daniel Raffard de Brienne, I do not think it was harsh, I was pointing out that the scenario he promoted for the transfer of the Shroud from Greece to France involved explicitly one of his ancestors. That scenario has been promoted *only* by him. As for the statements, they are not “hearsay”! They are supported by written documents for which there is no controversy of their authenticity. The statement about Philippe VI giving the Shroud to Geoffroy de Charny is from a manuscript written by a cleric of the collegiate of Lirey around 1525. We have four copies of this document kept in the archives of Bn F and An F (Paris). The statement by Marguerite de Charny that it was “acquired” or “obtained” by his grandfather was recorded in a court document (I should amend here my previous statement that was using the word “war”, a slip of my tongue, no such thing is implied by Marguerite). The statement by the son of Geoffroy de Charny that the Shroud was a “gift” (sibi liberaliter oblatam), was written by the son in a Bull to pope Clement VII..","date":"2015-12-03","mins":"12:41 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215576","author":"mario_latendresse","post":"Piero, You wrote: “Then I am curious to find more robust proofs (than “The sequences De sanctis reliquiis as Sainte Chapelle inventories” by Karen Gould. [In:] Mediaeval Studies [Toronto: Pontifical Institute of mediaeval studies, Bd. 43 (1981), S. 315 341]) about that strange “board that touched the face of the Lord”…!” I do not quite understand what you wrote: you want a more robust proof of what? The paper by Karen Gould has indeed many details about the relics that were in the Sainte Chapelle of Paris in the Grande Châsse. But a proof of what? That this description of Gérard de Saint Quentin en l’Isle was the reliquary of the Mandylion? There is a simple proof: if you match all description of relics and reliquaries given by Saint Quentin en l’Isle, the only one that can correspond to the Mandylion reliquary is that one..","date":"2015-12-03","mins":"2:00 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215632","author":"mario_latendresse","post":"Well, Joe (who cannot even post with a real identity), we have reached the bottom of the baril. It is obvious to me that you have not even researched the subject. Your answer (among others) “Most historians who studied this issue agree that a Mandylion was part of the Golden Bull of Baudouin II, which described all the relics he sold to Saint Louis. Of course, the description is not 100% clear about that, but most historians (I’m not talking about Shroud researchers like you, Wilson or others) reached that conclusion.” means that you believe and repeat what others have written without even reading on why they reach such a conclusion. You do not know why they stated that the Mandylion reached the Sainte Chapelle. But, as a meta comment, you are doing a profound disservice to yourself and others to behave the way you are behaving: posting behind some other identities, spreading misleading information, avoiding to read on the subject matter, and more. I know who you are..","date":"2015-12-04","mins":"11:58 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215568","author":"mario_latendresse","post":"Charles, you wrote “Remember also that the Blachernae church was outside the walls of Constantinople.” Yes, at the time the Blachernae church was outside the walls of Theodosius II (but later the walls were modified to include it inside the city). We can conjecture that the reason the unfolded Mandylion was shown at the Blachernae church was to keep the Latin outside the city as much as possible. Robert Clari only describes the reliquary of the Mandylion (a cloth) hanging in the Pharos Chapel. How come we do not have a description of that cloth? Because he did not see it in the Pharos Chapel ….","date":"2015-12-03","mins":"12:22 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215694","author":"mario_latendresse","post":"Davidb, you wrote “and ‘une sainte face’ = ‘a holy face’. Later inventories refer to the latter as a ‘a holy towel in a frame’, seemingly the mandylion of Edessa.” Sorry, but this is the not case, and this is essential. When the Mandylion arrives at the Sainte Chapelle of Paris, it is not refer as a “sainte face”, and later inventories does not refer to the Mandylion as “a holy towel in a frame”. This is the other way around. The Mandylion is also referred by TWO distinctive descriptions in the early years of its arrival at the Sainte Chapelle: 1) In the Golden Bull (1247), it is a “holy towel in a frame or box”; 2) Saint Quentin (around 1245) describes it as “a board that touched the face of the Lord, when he was laid down from the cross”. So, one description refers to it using the word ‘cloth’ but with no image, the second does not use the word ‘cloth’ but with an image on the reliquary. Later inventories of the Sainte Chapelle confirm that there is a face of Christ painted on the bottom of the inside of the reliquary. But with NO cloth. Ever. There is no late inventories of the Sainte Chapelle that describes a cloth inside the reliquary of the Mandylion. The cloth is gone. I think we can see a simple explanation for the early description: the cloth could not be seen with an image because it was folded and the bottom of the reliquary stated what was supposed to be in it. So, by the time the Shroud is in Lirey or Chambéry, there is no cloth mentioned in the Mandylion reliquary from the inventories of the Sainte Chapelle. All the details are presented at http://www.sindonology.org/sainte chapelle.shtml.","date":"2015-12-05","mins":"8:46 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-9628","author":"mario_latendresse","post":"Dan, I can only applaud your answer. I think the tone of your answer was a thousand time more polite than the tone of the “Angry” commentator. Your answer is worth reading a couple of times by anyone who could have started to believe his arguments..","date":"2012-03-25","mins":"3:02 pm","url":"https://shroudstory.com/2012/03/25/a-response-by-dan-scavone-to-a-commenter-in-this-blog/","cat":"history","title":"A Response by Dan Scavone to a Commenter in this Blog"},{"id":"comment-9629","author":"mario_latendresse","post":"Dan, I can only applaud your answer. I think the tone of your answer was a thousand time more polite than the tone of the “Angry” commentator. Your answer is worth reading multiple times by anyone who could have started to believe his posts..","date":"2012-03-25","mins":"3:05 pm","url":"https://shroudstory.com/2012/03/25/a-response-by-dan-scavone-to-a-commenter-in-this-blog/","cat":"history","title":"A Response by Dan Scavone to a Commenter in this Blog"},{"id":"comment-78119","author":"mario_latendresse","post":"Consider a corpse in rigor mortis which the back feet and back upper torso first touches the ground. In that case, most of the weight of the corpse is not on the buttocks, neither the calves, and therefore they do not appear flattened. The crucifixion would likely generate such a posture..","date":"2014-02-10","mins":"4:32 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-10862","author":"mario_latendresse","post":"Good point Dan, you are adding another piece to support Ian Wilson’s theory of the image of Edessa being the Shroud. And, as you wrote, the Act of Thomas is dated well before the 5th century, most likely originating from the city of Edessa. That’s a clear support to Ian Wilson’s theory. What else is provided to support another theory regarding the early history of the Shroud?.","date":"2012-04-26","mins":"11:45 am","url":"https://shroudstory.com/2012/04/26/hymn-of-the-pearl-description-of-the-shroud-of-turin/","cat":"history","title":"Hymn of the Pearl: Description of the Shroud of Turin?"},{"id":"comment-13186","author":"mario_latendresse","post":"All these questions can easily be answered if one consider that there were many copies of the Mandylion and that what Wilson proposed is essentially that the Shroud of Turin was in Edessa prior to 944, that the Mandylion was essentially the Shroud, that is, directly based on it, that the Shroud was closely guarded in Edessa, that only very selected people could directly see it, that the mass of people would only see a copy of it (the Shroud), and that the Shroud was transferred from Edessa to Constantinople in 944. That’s the essential elements of what Wilson proposed. You have some other details you can debate on. Add to that what Max Patrick Hamon wrote on point 1. At many times, it is likely that many confused the Shroud and the copies of it shown as the “Mandylion”. Yet it is possible, for some official occasions, that the Shroud was shown folded such that only the face was visible. In any case, given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx 944? Edessa. And to complete about the possible confusion: ask some of your acquaintances if they think the Shroud of Turin shows a complete picture of a body or only a face. You will see that many (majority?) thinks that it is only a face. This is even true today after full complete photos of the Shroud have been in circulation for more than 80 years. The Internet has not even removed this confusion for many..","date":"2012-06-29","mins":"12:37 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13250","author":"mario_latendresse","post":"Yannick, #13. You wrote at comment #11 “In order to follow properly the scientific method, if we take all those facts into account, one good hypothesis would be to think that the Shroud of Christ (which is not clear if he really was the Shroud of Turin) went directly from Jerusalem to Constantinople, sometime between the beginning of the 8th century and 958.” Now in comment #13 we read “That’s a fact that a shroud of Christ was in Jerusalem but no source mentioned that it bears an image or even blood on it. It’s a fact that there was a shroud of Christ in Constantinople from 958 at least.” From these two “sources” you conclude that the shroud in Jerusalem went directly to Constantinople. The shroud in Constantinople had an image on it. So we have two shrouds that according to you do not match that much. Where are your evidences of this “one good hypothesis” of #11? You accuse others of speculation… Did you mean the following instead: “we have a shroud in Jerusalem in 30 33 AD , we have a shroud in Constantinople in 7xx 958, and we have no evidence that they are related.”? That would not be an hypothesis, that would be a non hypothesis. And then you jump into another issue “From the ancient documentary and artistic sources we have, it’s simply impossible to retrace a complete path for the Shroud between the year 30 (or 33) in Jerusalem and the year 1350 in Lirey, France. It’s impossible…” You are obviously tackling another issue that is far more demanding. The question was “Given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx 944?’”..","date":"2012-06-30","mins":"8:17 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13244","author":"mario_latendresse","post":"Now, we have a clear hypothesis proposed by Yannick vs Wilson: the Shroud of Christ (which Yannick does not make equal to the Shroud of Turin) would have been transferred from Jerusalem to Constantinople (with no transition to Edessa at any period of time) between the 8th century and 958. I think you never proposed that after numerous attacks on Wilson’s proposed hypothesis. I think you should pinpoint the evidences for this hypothesis and compared them to the hypothesis that the Shroud of Christ (and we should say the Shroud of Turin) was never in Edessa..","date":"2012-06-30","mins":"6:03 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13237","author":"mario_latendresse","post":"Unfortunately, Yannick is not addressing the precise question that I put forward, namely, “Given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx 944?’”. Just take an extreme example to try to make my point (hopefully) clear. (It is almost a pure mathematical exercise.) Say that the list of locations under consideration is “Montreal and Constantinople”. What would be the answer to the above question? I think it is clear that the most likely place between these two cities is Constantinople (Montreal did not exist, and we have no evidence from the autochthons’ culture of a shroud of Christ in America during that period). Take another example: “Damas, Constantinople”, …, Constantinople is the most likely place again. Take a longer list of cities “Constantinople, Edessa, Paris, Bern, Antioch, Rome”. What is the most likely place from this last list? Make the list longer if you like, and you can answer the question. If you have another city that beats Edessa, name it. Otherwise you are not answering the question and you are dealing with a different issue. (And Yannick, do not send me personal, insulting emails, I do not want any of them.).","date":"2012-06-30","mins":"5:02 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-19930","author":"mario_latendresse","post":"Hi Russ, I presented a paper at the third Dallas Conference (2005) that challenges this claim, that is, the paper shows that the bloodstains appearing in the hair was not on the face but really in the hair. The paper is accessible at http://www.sindonology.org/papers/latendresse2005a.pdf (see Section 3 for details about bloodstains vs Lavoie’s theory). There is also a summary of the paper at http://www.sindonology.org/archives/2009/index2009.shtml (see entry April 18, 2009). Essentially, the theory that the Shroud was flattened when the images were formed contradicts some simple geometrical observations whereas there are no contradictions with these observations when assuming that no flattening occurred. I have never read a refutation of what is presented in that paper. Best, Mario Latendresse.","date":"2012-12-06","mins":"2:48 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","title":"Secrets of the Shroud:  What say you all?"},{"id":"comment-184871","author":"mario_latendresse","post":"Before doing this at ancestry.com you ought to look at roglo.eu first, with plenty of data about the ancestors of Jeanne de Vergy, Othon de la Roche, etc., and all the European royalties. (Thanks Jean et Charlotte!).","date":"2015-01-20","mins":"11:25 am","url":"https://shroudstory.com/2015/01/20/the-shroud-on-ancestry-com/","cat":"history","title":"The Shroud on Ancestry.com"},{"id":"comment-77046","author":"mario_latendresse","post":"Hi Max, perhaps this photo would help:.","date":"2014-02-06","mins":"1:10 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-214394","author":"mario_latendresse","post":"Hello Daveb, “Perhaps the present descendant of the Ray family who sometimes writes on this site promoting the Othon tale might be able to explain it better”. I think it would be more appropriate to ask the countess Diane Régina de Salverte, who lives in the Ray castle now and even better the librarian at the castle responsible of the archive (the « chartrier ») at the castle. I am in contact with the librarian, Jean Richardot, and I repeat what I already wrote on this blog. He confirmed to me that the word « suaire » does not even appear anywhere in the archive and that he does know any family tradition about the Shroud being at the castle. Absolutely no document at the castle or any oral tradition in the family confirms the presence of the Shroud at the castle according to him who knows very well the countess. The countess herself has actually no idea where this suppose tradition comes from. The story of Othon de la Roche is made up. It all comes from the story made up by Pierre Joseph Dunod in his 1714 manuscript kept in the archive at the Bibliothèque Municipale de Besançon. Then that story was published (in part) by François Ignace Dunod de Charnage (first publication) in 1750. Then Chamard, in 1902, repeats it. But all the references to support the claim of Othon de la Roche are distorted statements and false references. There is no true evidence of that story in the manuscript. Anybody who claims that the Othon de la Roche story is a possible scenario for the Shroud must first get acquainted with that manuscript of 1714. You wrote: “But if it’s authentic, someone had to bring it back, who better? Suggestions, anyone?” “It” refers to the Shroud? I suggest that the route of the Shroud from the East to the West is much simpler and documents that support it are still with us. The Shroud made its way during the translation of the relics from Constantinople to the Sainte Chapelle of Paris. See http://www.sindonology.org/sainte chapelle.shtml. I want to emphasize that this text concentrates on the Mandylion: it arrives at the Sainte Chapelle but then disappears well before the French Revolution..","date":"2015-11-08","mins":"12:28 pm","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"},{"id":"comment-214419","author":"mario_latendresse","post":"O.K., You wrote “Regarding Otto, you have at least three testimonies, each spurious on its own, but they back up each other”. Are you sure you mean “spurious”? The word “spurious” is synonym with “bogus, fake, false, counterfeit, forged, fraudulent, sham, artificial, imitation, simulated, feigned, deceptive, misleading”. Each would be fake but you would still believe that they back up each other? This is obviously contradictory. How can false claims back up each other? Indeed, the manuscript Ms 826 contains fraudulent claims about Othon de la Roche. So, how can it back up anything? And again, the coffer is not an independent claim, it is based on the story in the Ms 826 manuscript. If you find one statement that back ups the coffer independently of the manuscript, please state what it is..","date":"2015-11-08","mins":"9:17 pm","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"},{"id":"comment-72567","author":"mario_latendresse","post":"Here is a (PDF) copy of Daniel Scavone’s paper “Acheiropoietos Jesus Images in Constantinople: the Documentary Evidence”: http://www.sindonology.org/scavone acheiropoietos.pdf.","date":"2014-01-08","mins":"4:05 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-10710","author":"mario_latendresse","post":"Charles Freeman, You write “Allowing a team from the States free access in the 1970s meant that even the original pigments were taken off the cloth and distributed all over and then many were examined in home laboratories. As a means of doing scientific work this was disastrous, it is not clear how many of those working on the pigments they took were qualified in either conservation or analysis. No wonder much of the work done on the Shroud never passed peer review.” Sorry, but writing such statements shows that you know very little about what the STURP (that you refer to as a “team from the States”) did. Pigments? What pigments? “home laboratories”? Are you talking about Mc Crone? Ray Rogers? John Jackson? Plenty of papers were published by the STURP members in peer review journals. Are you talking about the Shroud of Turin?.","date":"2012-04-22","mins":"1:43 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10696","author":"mario_latendresse","post":"Charles Freeman. But aren’t you the same Charles Freeman that wrote a review of Thomas de Wesselow’s book “The Sign”? If so, according to your answers to comments about your review, you do not think that the Shroud of Turin is from the first century. More precisely, you believe that the Shroud of Turin would not be genuine but a copy of the Shroud that was in Constantinople in 1204. That nobody has been able so far to copy the Shroud of Turin, I find your arguments to be very speculative and having no historical foundation. Otherwise, how do you support your claim that the Shroud of Turin is a copy made by human hands from the Shroud in Constantinople?.","date":"2012-04-22","mins":"1:43 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"}]
