[{"id":"comment-176559","author":"mario_latendresse","post":"Hugh, Colin, 1) Smoothing the image is cheating with the settings because it definitely help create a smooth variation of the color which is exactly what the supposed artist would need to do to get the 3 D effect we see on the Shroud. No modification should be done on the original image before attempting to generate a 3 D interpretation. Obviously, we can generate computer images that respond well to 3 D effect, but that’s irrelevant regarding the uniqueness of the Shroud. For example, on the production of the 3 D anaglyph on Shroud Scope (http://goo.gl/Bn3osf) there is no smoothing transformation applied. The most basic operations were done to generate it and they are fully described so that they can be applied again to any photograph. 2) What is relevant is finding a 4th 16th painting or drawing that respond to as much as what we can see on the Shroud, in particular for the details seen in the face, using the same technique (no smoothing, direct use of the image), is the real challenge. 3) Perhaps reading what Yves Delage wrote more than 100 years ago about the image of the Shroud (see last posting at http://www.sindonology.org) could shed some light to what can readily be perceived on the Shroud for which no other equivalent 4th 16th century paintings can be found..","date":"2014-12-14","mins":"11:20 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-177158","author":"mario_latendresse","post":"Hugh, thanks for the images. I think I understand what you mean. The Shroud image appears to have been substantially smoothed, but that is a peripheral point. Interestingly, if an artist would have done the first image, he/she would have made a major blunder. The second image appears as the real correct one and here is the reason. The cloth is loosely draping the body. So, the cloth falls on each side of the head getting closer to the cheeks and the hair (top and sides). They should therefore appear closer, and they do on the second image. The way the cloth is draping the body must be taken into account, which the first image does not do. So, I would say that, at first approximation without going through a lot of precise measurements, the Shroud image appears as the real correct one. You wrote: “I have a great respect for your own paper “The Turin Shroud Was Not Flattened” which I think illustrates that human body measurements are not badly distorted if a sheet is assumed to be draped, more or less as flat as it could be, but left to settle under gravity, but you do not address the brightness/distance correlation in that paper, by which all points of contact would be equally bright, and the sides of the cheeks (for example) would appear as high as the bridge of the nose. I think you were thinking of undertaking such a study, but have not heard how it progressed.” Thanks for the compliment about my paper. This is correct, I do not address specifically the brightness/distance correlation in a precise manner because it requires more advanced techniques than what I presented in that paper. I could calculate the horizontal flattening of what was underneath the cloth with the technique used in that paper but not the vertical cloth/body distance in a very precise way. Yes, I am planning of undertaking such a study of measuring this distance given some real cloth draping over a body and also simulate image formation using different diffusing assumptions. A body and cloth could be computer simulated, this is one clear approach. Cloth simulation is very tricky and only recently has the simulation techniques improved enough to the point of physical reality. The advantage, of cloth simulation, is the possibility of a large number of essays and variations of cloth draping and observe the result of the image produced. Using a real body and cloth should be done also to compare it to the results of the simulations. I have done some 3 D scanning. This work is in progress. Lots of code need to be written to make this happen..","date":"2014-12-17","mins":"12:06 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176867","author":"mario_latendresse","post":"Hugh, “To me, he did screw up, he did fail to appreciate a true brightness/distance correlation, and there is considerable distortion and misalignment, both in the face and along the length of the body.” Could you identify some of these places where brightness/distance correlation is not correct according to you? Considerable misalignment, distortion. Where? How did you conclude they are misalignment and distortion? I am not saying there is none, but I am curious to know which ones you located and how you came to that conclusion. Thanks..","date":"2014-12-16","mins":"1:35 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175384","author":"mario_latendresse","post":"“Should we be rethinking the VP8 and 3 D images?”. First, for the sake of simplicity and historical accuracy, I would drop any reference to the VP8 in regard to the 3 D information in the Shroud image. The idea that the 3 D information embedded in the image of the Shroud was discovered by using the VP8 is wrong. Completely wrong. The image 3 D information of the Shroud image was described accurately way before the VP8 was used, at the turn of the X Xe century. It was described in 1900 1902 in the French and Italian press, books, and booklets. My understanding is that some writers like to refer to the VP8 as if the 3 D information in the Shroud is something mysterious that only a complex machine is needed to show it. And it allows these writers to through in the NASA or JPL acronyms as if that would give it a touch of scientific confirmation. (And additionally, we know the VP8 has nothing to do with NASA or JPL). But most of that has been said already by others, including on this blog and by Barrie Schwortz. Second, to say that concentric circles of various degree of colors create a 3 D image is quite wrong, simply because these circles are not 3 D objects. What is meant by a “3 D image” is that the objects are 3 D objects and they are correctly registered as #D objects in some way on a 2 D surface such as it is possible to reinterpret the 2 D surface as an accurate representation of the 3 D objects. Anything else is a false 3 D image, and you can create all kinds of these false 3 D images. Third, the Shroud image is not a photographic negative. I think this has been stated before many times but it is worth repeating. It is first and foremost an image that behaves as if it would have recorded a true 3 D human body by using variations of intensity of colors as perceived by the human eye. This aspect was described more than 100 years ago. Fourth, the Shroud image is “not unique” in that regard. This is obviously a wrong statement because there are million of such images and you create any such image at will. What is unique: all known painted images from the medieval age do not have such a characteristic. The subtlety of the 3 D information embedded in the facial area is beyond the capability of all known painters of the 14th century. That we can state with confidence. The 3 D information embedded in the Shroud image is one good reason to believe that the 1988 radiocarbon dating of the Shroud is probably incorrect..","date":"2014-12-09","mins":"11:58 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175395","author":"mario_latendresse","post":"Sorry, I should have been more precise: the VP 8 (or VP8) was not invented or created by NASA or JPL. Yes, NASA use the VP8. So such term as “NASA VP8” is misleading. Again, such statement as “en 1976 lorsque deux scientifiques de la NASA, Jumper et Jackson utilisèrent un logiciel de la NASA, le VP8, qui permet de représenter en 3 dimensions”, this is completely wrong, and this has been repeated numerous times. The main point though is: the 3 D characteristic of the Shroud image was NOT discovered using the VP 8, it was discovered by other writers and researchers way before the 1970s. Descriptions of the 3 D characteristics of the Shroud image were given as early as the first decade of the X Xth century in Europe..","date":"2014-12-09","mins":"1:37 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175468","author":"mario_latendresse","post":"Colin, I think you do not interpret the word “has encoding of” correctly. The TS has 3 D encoded information based on some assumption: An anaglyph photograph has 3 D encoded information based on some assumption; an hologram has encoded 3 D information based some assumption; an auto cad file has 3 D encoded information based on some assumption; and so on. There is an encoder and a decoder, both used an assumed encoding of the 3 D information. Otherwise, no computer file would be able to encode 3 D information. You wrote: “A photographic image of the TS does NOT have any kind of relief encoded information”. This is false, because, assuming that the color intensity correspond to a relief, we can perceive a 3 D corpse that looks like a real corpse (granted with some distortion at some places). There is therefore 3 D encoded information in the TS. You wrote: “It’s simply a pattern of light versus dark that digital software such as Image J ‘interpret’ as relief, based on the darkest areas of a scorch or negative TS image being the highest, plotted on an imaginary z axis.” Yes, this is the assumed encoding. This is what 3 D encoded information means. You wrote: “I suppose one could use the term “encoding” loosely to indicate that some 2 D images derived from 3 D objects, like scorch imprints, do respond well to Image J etc, but it’s not a true encoding phenomenon.” It’s not a true encoding phenomenon? What does that mean? Encoding simply means that you assume some mapping, here from intensity to height. That’s all. Do you assume that when you look at a mountain that your brain has a not true encoding of the mountain? That is actually meaningless. Your brain interpret correctly what you see if indeed you perceive the object as it really is. So it is a true encoding, yet it is only electric wave certainly any true height in your brain. You wrote: “In any case, 3 D properties tell one absolutely nothing about the age of the TS. That I’m afraid is obscurantist mumbo jumbo. Somebody had to say it.” I am not sure you understood my point. I wrote: “The subtlety of the 3 D information embedded in the facial area is beyond the capability of all known painters of the 14th century. That we can state with confidence.” So, the idea that this image was produced in the 14th century is at odd with all known artists of that period, and this is based on the subtlety of the 3 D information encoded in the Shroud image. Note that this is how historians and archeologists work: if an object does not correspond to the style of an artistic period, they do not claim that it belongs to that period. A painting that looks like a Picasso would not be ascribed a 16th century origin. Likewise, the Shroud technique of production and its style does not correspond to the 14th century. It actually does not correspond to any known artistic rendition of any period..","date":"2014-12-10","mins":"12:28 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175407","author":"mario_latendresse","post":"Hello Stan. Yes, the Shroud image appears, at first, like a photographic negative. But I would like to stress that a more precise description is needed because it is not a photographic negative. Granted that as a first approximation we could describe it that way, but I think it leads to many misunderstanding when you take this description literally. As a good example, take Walter C. Mc Crone who was told by Father Peter M. Rinaldi, in a series of letters they exchange, that the Shroud image was a photographic negative. This series of letters are reproduced in Mc Crone’s book (Judgment day for the Shroud of Turin). If you look up on p. 213 of that book, we can read the following (funny?) statements made by Mc Crone: “… also, if it is a perfect negative then Christ must have had blonde hair, blonde eyebrows, blonde beard and blonde mustache since these all appear light in the positive image produced as a photographic negative of the Shroud image”. Well, …, so Mc Crone took the expression “perfect negative” as literally meaning a photographic negative where light colors are reproduced as dark colors, and dark colors as light colors. But he knew that it was not the case, that is, that the Shroud recorded the distance cloth body (the rest of page 213 shows that he knew that). So, Mc Crone himself argued, and took the time do so, that the Shroud image was not a true negative and pointed out the error to Father Rinaldi. You could say it starts to be pedantic but others have done it also pointing out that this term is incorrect. So, I think we need precision to avoid confusion. What do you think?.","date":"2014-12-09","mins":"4:03 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175600","author":"mario_latendresse","post":"Colin, yes indeed! Questions to Charles: have you spread some gesso to seal a linen cloth? Then try to remove it? Photographs of before and after would start an interesting discussion. Until then, you are only speculating..","date":"2014-12-10","mins":"4:02 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-23284","author":"mario_latendresse","post":"No need to use a probe etc. What is needed: a large scale 3 D scanner. You scan the body laying down then drape it with a cloth and redo the scanning. So you get two scanned surfaces. You then measure thousands of distance body cloth by measuring, using a computer, the distance between the two surfaces. That operation should be done for several draping.The caveat: 3 D scanning of full body is expensive..","date":"2013-02-03","mins":"12:41 am","url":"https://shroudstory.com/2013/02/02/teaser-of-the-day-3-why-many-state-that-the-shroud-is-a-3d-image/","cat":"teaser_of_the_day","title":"Teaser of the Day (#3): Why many state that the Shroud is a 3D image"},{"id":"comment-151483","author":"mario_latendresse","post":"Isn’t rather Alan Adler who did the diimide experiment? Rogers report the finding but does not say he redid the test. See item 12 at https://www.shroud.com/pdfs/rogers5faqs.pdf. Without redoing this test several times, we are left with one experiment which is weak evidence. Yet it is indeed an important observation..","date":"2014-09-16","mins":"12:16 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"id":"comment-175180","author":"mario_latendresse","post":"Piero (Iacazio?), you wrote “So, checking linen fibrils of the Shroud with the AFM instrument we will verify if the hypotheses of Fanti are correct or not… Do you agree with this statement?” I disagree with this statement for at least two reasons. First. There is no need for AFM because there is no need to go at that level of details. Optical microscopy is sufficient and more appropriate. You know that (some) photocopiers use corona discharge to transfer ink to paper? When you look at a paper, say with a light microscope, printed with such photocopiers, how can you know if it was a corona discharge or some other techniques that was used to transfer the ink to the paper? It is not the atomic level that would reveal it but at a higher level, probably even by just looking at the paper with a magnifying glass. Why would AFM produce better results? What else do you want to learn from AFM? Second. The real issue is identifying on numerous fibrils either 1) their modifications or 2) if a colored coating exists on the fibrils that can be removed without breaking the fibrils. These two cases has not been clearly demonstrated. It is largely a problem of access to numerous fibrils coming from the image area. Theses two cases mentioned above can be produced by many physical phenomenon. Observing the effects may never lead to what exactly produced these effects but a class of possible phenomenon can be discarded. For me, one of them is clearly not involved: a manual operation done by hand (“a painter”). I consider as a peripheral objective the exact identification of what produced the color. On the other hand, it is of primary importance to know with great certainty what is producing the (yellowish) coloring. And this goal is achievable..","date":"2014-12-08","mins":"2:24 am","url":"https://shroudstory.com/2014/12/05/an-interview-with-giulio-fanti-and-more/","cat":"image_theory","title":"An interview with Giulio Fanti and more"},{"id":"comment-175051","author":"mario_latendresse","post":"If indeed a corona discharge typically produces a double superficial image, then the Shroud image has unlikely been produced by a corona discharge. This is a clear conclusion because Giulio Fanti conceded in his own paper that the only place a potential superficial double image might exist is in the area of the face (and I do not even think that a double superficial image of the face exist). So that leaves the whole back and most of the front image with no double superficial image. I cannot understand why this is not conceded more clearly from Fanti..","date":"2014-12-07","mins":"2:35 am","url":"https://shroudstory.com/2014/12/05/an-interview-with-giulio-fanti-and-more/","cat":"image_theory","title":"An interview with Giulio Fanti and more"},{"id":"comment-92458","author":"mario_latendresse","post":"All these “creases” are still visible on Shroud 2.0, which was produced many years after the restoration. And when the Shroud 2.0 scanning was done, the Shroud was laid very flat. Actually, they are unlikely to be creases (before or after the image formation) but weaving imperfections. For example, the “crease” coming up from the wrist wound appears as a weaving imperfection on Shroud 2.0. They are weaving imperfection in the sense that we can see a discontinuity in the spaces separating the threads. The Shroud 2.0 also appears to show a light bloodstain along that crease whereas on the Durante 2002 it appears as the same color as the image which then appears more as a crease due to that coloration. The Durante 2002 photograph is a bit misleading because its coloration is not always accurate. I also verify these type of weave imperfections, on Shroud 2.0, on many other “creases” mentioned on this thread. I wish I had the Shroud 2.0 photograph to upload it on the Shroud Scope..","date":"2014-03-23","mins":"9:31 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-52576","author":"mario_latendresse","post":"Colin, you wrote “Folk may also notice that I did not attack Mario for expressing his opinion, despite disliking the partisan introduction. I addressed the facts regarding those markings, and proposed an alternative explanation for those who, like myself, had never even heard of those sedillis. And doubt whether they were precisely as described by Mario anyway.” 1) Indeed you may dislike the introduction of that Web page (http://www.sindonology.org/papers/blood Marks Butts.shtml) which is in favor of the authenticity of the Shroud. Certainly, simply stating your dislike is no harm, but it would simply mean that you do not consider the Shroud authentic. In which case you can simply state that you do not believe, even as a possibility, that the Shroud might be authentic. I certainly find no harm in that, but it would also be an extreme position. 2) You wrote “like myself, had never even heard of those sedillis”. I am surprised. This is a common statement made by many writers of the time of Jesus and over many centuries. In fact, it is most likely that there was a sedillis on Jesus’s cross because Seneca, who is a contemporary of Jesus, describes the crucifixion (in general) and insists on the presence of the sedillis. Sedillis had many different forms, but is likely sharp, and more specifically described by Seneca as a “sharp pointed cross”. This might simply be a three point prongs as we see the effect on the Shroud. Granted, there will be two of these on Jesus’s cross. If the Shroud is authentic, these three stains we see on both butts appear to be caused by such sedillis. It is the most likely reason corresponding to historical facts. If the Shroud is not authentic, made by a forger, he/she happens to have created the most resembling wounds for such a sedillis. A coincidence? 3) You wrote “and doubt whether they were precisely as described by Mario anyway”. What are the doubts? The sedillis is described variously as a sharp seat, a horn, etc., and as “sharp pointed cross” by Seneca (again a contemporary of Jesus). You consider that the literature on the subject does not support the possibility of a sedillis as a “sharp pointed cross”? Any references?.","date":"2013-11-23","mins":"8:05 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","title":"First Annual Bertrand Russell Award in Sindonology"},{"id":"comment-92696","author":"mario_latendresse","post":"Colin, do you have access to Shroud 2.0? Your comment above does not say that you have looked at the Shroud 2.0 images of the “creases”. If you do not have access to Shroud 2.0, I will try to upload sections of the Shroud 2.0 image on Shroud Scope containing some creases. You can then observe and conclude on your own. Uploading even parts of the Shroud 2.0 image is going to be some major work as I see it now but it will be tried and, I believe, the result will be in accordance with the copyright laws..","date":"2014-03-24","mins":"11:45 am","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-52596","author":"mario_latendresse","post":"Daveb wrote “Pierre Barbet, “Doctor at Calvary”, pp 42 43, thought the sedile unlikely in the case of Jesus. He refers to the same Seneca quotations and also draws on Justin, Irenaeus and Tertullian. The sole purpose of the sedile was to prolong the death agony, and it was extra work for the carpenters to provide it.” Seneca describes the sedile as an added humiliation not as a mean to prolong death, so the sedile’s purpose was not “solely” (your word) to prolong death. Did it indeed prolong death? As far as know, no contemporary of crucifixion practices described it for that purpose. This appears unlikely if the sedile creates even more pain and no respite can be obtained from it. You wrote “The gospel accounts all have Jesus dying within three hours of being crucufied, and Pilate expressed surprise that he had died so soon. This would argue against the use of the sedile” The opposite conclusion is reached if we assume that a sedile prolongs death. Pilate was surprised because he expected Jesus’s to live (suffer) longer. Not having a sedile would have shortened his life (according to your supposition) therefore it is more likely that Jesus’s cross had a sedile (again supposing that it prolongs life)..","date":"2013-11-23","mins":"10:53 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","title":"First Annual Bertrand Russell Award in Sindonology"},{"id":"comment-42406","author":"mario_latendresse","post":"Hi Max! The 2002 Durante Face Only on the Shroud Scope is NOT a “detailed view” of the face digitally taken from the overall Durante 2002 because the Face Only image has a higher resolution than the overall one. It is a “real” close up in the sense that it has a higher resolution. According to your message you would have a different 2002 Durante Face Only. What is the resolution of that image (pixel per mm) that you have?.","date":"2013-08-30","mins":"12:25 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?"},{"id":"comment-52598","author":"mario_latendresse","post":"Correction: Last paragraph, first sentence, “… if we assume that a sedile prolongs life” (not death!)..","date":"2013-11-23","mins":"10:58 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","title":"First Annual Bertrand Russell Award in Sindonology"},{"id":"comment-42379","author":"mario_latendresse","post":"The Shroud Scope has several photographs as they were distributed to many researchers. The Shroud Scope can show the 1931 Enrie photograph (negative version) without any digital pre processing and also the (positive) 2002 Durante Shroud Face Only without any digital pre processing when these photographs and the highest level are selected. At other zoom levels, only a rescaling is done according to the zoom level selected. Therefore, I do not understand why you wrote that the Shroud Scope does not present the 1931 Enrie photograph. Am I interpreting incorrectly the statement you made above (#1)?.","date":"2013-08-29","mins":"10:13 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?"},{"id":"comment-42409","author":"mario_latendresse","post":"I should have added that the details about the resolution of the images presented on the Shroud Scope are discussed on the following help page http://www.sindonology.org/shroud Scope/shroud Scope Help.shtml. In particular, as described on that help page, the resolution of the 2002 Durante Face Only image is 0.08 mm per pixel (said differently, 12.5 pixels per mm) whereas the 2002 (overall) Durante image resolution is 0.1905 mm per pixel (said differently, 5.25 pixels per mm). Therefore, the Face Only image is more than twice the resolution of the overall image. The Face Only image is a close up view of the overall image because the Face Only image is not blurry at the 0.08 mm per pixel resolution..","date":"2013-08-30","mins":"12:55 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?"},{"id":"comment-19721","author":"mario_latendresse","post":"Hi Andy, you wrote: “Dr. Soons accounted for the cloth wrapping the victim on the Shroud so you end of up seeing the brightness data that is there in vertical relief, 3 D just like the VP8.” Could you point out the document that states that fact, that is, “accounted for the cloth wrapping”? Thanks. I could not find a clear description of taking into account the cloth wrapping on his website. I made a 3 D anaglyph at (can be seen at http://www.sindonology.org) not doing any transformation on the Enrie photograph (in particular no depth map was created by hand). The result shows clear 3 D property but not as much as the ones created by Petrus Soons. So he must have done many transformations to obtain his 3 D anaglyph. But so far I could not find a clear description of what he did, in particular how he generated the depth map. Best, Mario Latendresse.","date":"2012-12-01","mins":"7:11 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?"},{"id":"comment-21520","author":"mario_latendresse","post":"I think the Shroud image is unique in terms of 3 D data it encodes. You can certainly create a 3 D anaglyph version of the black and white negative Shroud image (the Enrie version at least) in a way that is very easy (just two “composite” commands) and unique (no need to create a depth map by hand, only the Enrie negative photograph is used as input). The Shroud Scope has now a 3 D anaglyph version of the Enrie (vertical) photograph (see http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=7&image=7&lon=909&lat=3605) and the way it was created is described at http://www.sindonology.org/shroud Scope/shroud Scope Help.shtml#3 D..","date":"2013-01-03","mins":"3:27 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?"},{"id":"comment-50067","author":"mario_latendresse","post":"Hugh, yes, your description is a summary of the intended simulation. The main digital data is 1) a 3 D surface of a sheet covering a body (in the photo you see at sindonology.org, it is only the head), 2) the 3 D surface of the body. These two 3 D surfaces were created from real objects. The space between the body and the sheet can be studied, such as the distance etc. But more importantly, various computer simulation can be done, in particular projections from the body to the sheet based on different hypotheses (diffusion, radiation). The sheet can then be digitally flattened to show the resulting images. This is likely to produce, more or less, some of the small distortions we see on the Shroud, such as elongated fingers, the hair appearing straight down, and more. Hopefully, I will have the (free) time to do all of these..","date":"2013-11-05","mins":"1:16 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50118","author":"mario_latendresse","post":"Anoxie, what is your full name?.","date":"2013-11-05","mins":"11:20 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-42145","author":"mario_latendresse","post":"Evaluating the image contrast on the Shroud based on “looking” at it is too subjective. As noted by this reader, the human eye perceives contrast by a complex mechanism that not only is not linear (relative to brightness) but depends on the color spectrum. The only objective way to analyze details (e.g., contrast) in an image, as complex as the one on the Shroud, is to use a computer and obviously a digital image. And by the way, I keep being surprised by researchers referring to the VP8 (to analyze the 3 D data of the Shroud) because it is an old technology made obsolete by today’s computer and software..","date":"2013-08-27","mins":"2:18 pm","url":"https://shroudstory.com/2013/08/27/nicely-done-continued/","cat":"image_theory","title":"Nicely Done Continued"},{"id":"comment-168407","author":"mario_latendresse","post":"First, thanks Dan for promoting my paper. Yes, it is the same paper that was presented at the 2005 Dallas conference. Indeed, I recently “published” it on academia.edu and I applied a redirect to academia.edu, if an attempt is made to access the paper from sindonology.org. Most of my papers (not about the Shroud) are listed (and some available) at Research Gate, my personal web page at SRI International or Université de Montréal. But I decided to give academia.edu a try. It takes time to transfer these papers due to copyrights. Second, Antero de Frias Moreira (and Daveb) mentions two important “puzzles” (questions): 1) How close is the cloth on the top of the head considering the absence of an image on the Shroud; 2) Lavoie’s theory that some bloodstains around the face originated from the face, and the not the hair. For question 1, I am fairly certain that there was a sufficient gap between the cloth and the top of the head such that we can apply the principle “distance >2cm => no image”. This can be tested by the following measurements: a) lay down flat on your back on a floor (that’s a real experiment), the back of your head touching the floor; b) place a finger at the intersection of the floor and the back of your head; c) measure the distance from that point on your head to your hairline going over the top of your head (or where you think the hairline should be if your hairline is receded); d) measure to the distance from the perceivable hairline on the Shroud to the point where the image abruptly stops on the back of the head on the Shroud (that is, close to the location of most bloodstains starts on the back of the head); e) compare the two last measurements. I get about 20.5 cm for (c) and 26 cm for (e). This measurement (e) was done on the Shroud Scope (http://goo.gl/Ndx L5d). There is a difference of 6 cm which is clearly enough to create a gap of more than 2 cm from the cloth to the top of the head. I would even say that there are other indications that the cloth slightly sag away from the top of the head, one of them being the fading bloodstains on the back of the head as you go up towards the top of the head. Of course, we expect the results to be different for different people, but this is confirmed for most people, it is the most likely correct conclusion. And if it happens only for a few percentage of people, it is a possibility. For the measurements you can do some variations, like tilting the head forward slightly (as it is presumed on the Shroud), but that will not change much your results. For question 2, I am fairly certain that the theory of Lavoie is incorrect (regarding the bloodstains near the face, not other bloodstains he studied). That is, the bloodstains perceived as coming from the hair on each side of the face, when looking at the Shroud, comes from the hair. This is actually one of the main conclusions of my paper: most of the cloth was not repositioned between the moments the bloodstains formed and the images formed (there are probably some part of the Shroud that was repositioned between these two moments but only the side of the body). Otherwise, you would have vertical misalignment of the bloodstains and the images. The way the bloodstains appear does not preclude that they come from the hair (and Lavoie never used arguments based on “the way the bloodstains” appear.) More precise studies could be done regarding the right principle to use about the distance cloth body: is it vertical, normal to the skin, or the shortest distance cloth body? To do so would require a more thorough simulation using 3 D technology and computer simulation. In any case, a 3 D simulation could make it much clearer all the possible small distortions perceived on the Shroud..","date":"2014-11-03","mins":"7:34 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","title":"Paper Chase:  A Significant Paper by Mario Latendresse"},{"id":"comment-89612","author":"mario_latendresse","post":"This is ME 02 from Evans’ collection. It is over one of the eye. See http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=3&image=3&lon=1060&lat=2863&photomicro=t&popups=ME 02+276+52 Also, ME 20 is very similar (coming from the same area): http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=3&image=3&lon=1060.0&lat=2862.0&photomicro=t&popups=ME 20+306+27.","date":"2014-03-16","mins":"11:15 am","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-22021","author":"mario_latendresse","post":"Hi Thibault, you wrote: “You might find photos showing that the colored fibers are not colored under their surface in Fanti’s photos in the “superficiality paper””. Which paper are you referring to? This cannot be the paper “The double superficiality of the frontal image of the Turin Shroud” by Fanti and Maggiolo since no such photos exist in that paper. Best, Mario.","date":"2013-01-14","mins":"6:47 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","title":"Scorched Image by the Resurrection"},{"id":"comment-49833","author":"mario_latendresse","post":"I think that the presence of 3 D data in the Shroud image is simple and can be mathematically explained in a simple way. I also think that the anaglyph is a very simple transformation of that data into a 3 D encoding that can be visually perceived. That very simple process leaves no doubt that 3 D data exist in the Shroud image. And there is no subjectivity involved as far as this process is completely independent of the Shroud and has been used to generate millions of other anaglyphs. Sorry to repeat this reference, but for a short presentation of how such 3 D data is encoded and an anaglyph version of the entire Shroud image can be generated, please see: http://sindonology.org/shroud Scope/shroud Scope Help.shtml#3 D. In a few words, the composite software simply (based on a linear transformation) shift horizontally, based on the luminosity of the pixels, some of the pixels of the Enrie photograph and then combined them with the original photograph using two different colors, one for the original image and a different color for the shifted pixels. It is therefore a very simple process that can be described by a simple linear transformation of pixel locations. It can’t get much simpler. The Shroud Scope has the full Enrie photograph transformed as an anaglyph where you can zoom in and out (back and front of the man of the Shroud). For example, please see (you will need color filtered glasses): http://www.dshroud.com/shroud Scope/shroud Scope.shtml?zl=3&image=7&lon=323&lat=1417 (Again, absolutely no artistic or subjective transformation was applied to generate that image, but only the transformation described in the previous reference was applied.) Notice the various details of the realistic 3 D image, for example the belly, the front feet where we have a perception of the tip (toes?) of the feet, and of course the various 3 D details of the face. The back is also quite interesting in terms of 3 D realistic representation. What is not complete clear yet, is the effect of the cloth wrapping the body versus this 3 D data. But what appears almost certain to me is that the image was formed while it loosely wrapped a 3 D form, and clues to that are numerous, such as parts of hair appears at the same level as the cheeks which means that the cloth was very closed to the hair when the image was formed. But a complete clarification of the relation of the wrapping vs the cloth body distance can be done by doing a computer simulation. Not very complex to do, but quite tedious to do in details..","date":"2013-11-04","mins":"2:02 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49961","author":"mario_latendresse","post":"Colin, I think I understand your points. Yes, you are right, that page explaining how the Shroud Scope 3 D image was generated looks techie, but for a good cause: reproducibility. As far as I know, I have never seen a concrete complete explanation how these 3 D Shroud images populating the web had been generated. I thought this would fulfill that aspect in its most simplest form. Hopefully, it also give one clear recipe on how to generate a form of 3 D images using the Shroud image. As for the comparison between the various software generating these 3 D images, “regular” or not, I would rather focus on the reproducibility aspect. If someone using such a software cannot explain in an explicit matter how the 3 D image was generated, I would refrain from trusting these images. On that aspect, I think that the VP8 is good only as an historical reference and not as a reproducible experiment. And I am pretty sure that working hard on it, you will be able to reproduce a very good quality image of the most exquisite 3 D quality even comparable to the Shroud, using, say, scorching. I see no particular reason why that would not be possible. But the recipe looks pretty complicated and I am afraid that it will only be a partial answer to your detractors who will dutifully remind you, and everybody, that it does not have other physical characteristics found on the Shroud. But, honestly, I might be wrong, and you will find the right recipe able to achieve what nobody else has been able to achieve. As for the Birthday Honours List, the honour is too great and I trust that you will honor the advise from the Cabinet Office that “You shouldn’t tell the person that you’ve nominated them for an honour in case they’re not awarded it.”.","date":"2013-11-04","mins":"8:13 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49938","author":"mario_latendresse","post":"Giorgio, the twill pattern has no positive effect on the 3 D data. As I mentioned previously, if you digitally remove the twill (using a Fourier transform for example, and this has been done by many) you get a slightly *better* 3 D effect. So, with or without the twill pattern, the 3 D data is there in the Shroud image..","date":"2013-11-04","mins":"5:09 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49912","author":"mario_latendresse","post":"Giorgio, in the case of the Shroud, the substrate plays no major role in the 3 D data encoded in it. That 3 D data, for the Shroud, is simply the “luminosity” (i.e. The white content) of the “pixels” when using the negative photographs. As a matter of fact, I think that removing the herringbone weave pattern increases the 3 D quality (for the Shroud). That does not mean that you cannot create very good 3 D effects based on the substrate (like pointillism). Although, this is a very different way of encoding 3 D data that can be perceived by the human brain. See for example the (almost unbelievable) autostrereograms at the following Web page http://www.pakin.org/~scott/stereograms/ Note that a particular procedure should be followed to perceive the 3 D effect of these images. This is explained in details at http://en.wikipedia.org/wiki/Autostereogram After some practice, it is an easy procedure to follow, but it is not natural at first because the eyes must cross to get the 3 D effects. In particular, try the minimalist 3 D image: There is indeed 3 D data encoded in that image, but obviously it is not based on the luminosity; it is based on the differential horizontal distances between the cents. When using the right procedure (without using any special glasses), one of your eye will pick up (focus on) some of the cents that are horizontally closer to their neighbors, and the other eye focuses on (most) other cents. You then perceive the smaller set of cents as elevated. But obviously, this is completely different on the Shroud where luminosity is the major encoding of the 3 D data and the substrate plays no role..","date":"2013-11-04","mins":"12:50 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-155115","author":"mario_latendresse","post":"Mc Crone did not publish quantitative data on the amount of pigments he has found on the sticky tapes. He remains vague on the subject.This is a major shortcoming. Hugh, did you notice that? How come he never published a clear table where each sticky tape is listed with the amount of pigments found? Actually, from the vague data that he published, you can see that there is no clear relation between the sticky tapes that have pigments and the image. It could as well be a relation between the amount of pigments and the blood and water stains. The claim that there is a perfect correlation between iron oxide found on the sticky tapes and the blood/image areas is clearly faulty. Mc Crone writes (p. 92) that after studying the tapes, four tapes were misclassified. He reanalyzed carefully only these four tapes to search for some iron oxide, and do find some. But he never reanalyzed the non image area sticky tapes. This is a clear faulty methodology: if he had given the same amount of scrutiny to the non image area tapes he could have found some iron oxide (red ocher). In essence, his methodology is biased towards a preset conclusion. He even contradicted himself and made a circular reasoning in the same paragraph (last paragraph on p. 92): he could now write that all sticky tapes that were in the image area have a significant amount of red ocher but at the same time saying that these four tapes had small amounts of red ocher. Did he really know how much pigment he found? This looks doubtful. With no quantitative data published, Mc Crone speculates on the amount of pigments that could be on the Shroud and try to prove that with a small amount of pigment you could paint an image on a cloth. But the result of the paintings are not analyzed to show that they are like the Shroud..","date":"2014-09-24","mins":"12:40 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155465","author":"mario_latendresse","post":"Hugh you wrote: “That’s not how Science works. A hypothesis is not established by demonstrating its possibility; it is refuted by demonstrating its impossiblity.” First, at a minimum, an hypothesis has to be clearly stated with appropriate definitions. To quote Wikipedia: “A hypothesis is a proposed explanation for a phenomenon. For a hypothesis to be a scientific hypothesis, the scientific method requires that one can test it.” Notice the “can test it”. So a rather good description of the hypothesis has to be given. That’s how you avoid going into a circle discussing imprecise hypotheses or claims. Essentially, I was pointing out that you seem to extend the meaning of “painting” and it is so, because the method you described above, which involves “a thick paste of iron oxide, water, egg white and sulphuric acid”, is not what most people would consider a painting. The technique is, ideally, intended not to leave any pigments. In any case, the fact is that Mc Crone tried to prove that it was a painting, and he failed. It is very unlikely that it is a painting for all the reasons already mentioned..","date":"2014-09-24","mins":"11:46 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155208","author":"mario_latendresse","post":"Hugh, you wrote: “Mc Crone thought there were, and produced at least one experiment which appeared to demonstrate it. I do not know if it was challenged by any counter experiments showing the opposite.” Mc Crone did not produce such an experiment because it did not appear to demonstrate that it was a painting at all. That’s my point. I do not see how by citing Mc Crone’s work you support your assertion that a painting was not definitely ruled out. It appears that you are extending the meaning of painting or “definitely ruled out” or both. What does “definitely ruled out” mean to you? How do you define “a painting”? To state that the Shroud could be a painting you have to show that at least one form of painting makes it possible. Otherwise, you are stating that some unknown form of painting makes it possible that it is a painting, which is meaningless to me because it no longer gives any clear meaning to the word “painting”. Are you using a mechanical device not involving a painter? No brush or some brush? How do you define “your” painting medium? Let’s put it this way: I do not know any painting techniques that could have produced the Shroud. Hugh, do you know any?.","date":"2014-09-24","mins":"3:40 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-183612","author":"mario_latendresse","post":"Charles, you have the facts wrong: on the Suaire de Besançon, the side wound was painted on the “wrong” side and this is described at length in manuscript Ms 826 of the Besançon archives. Not only that, this manuscript points out that the artist who made the Besançon “shroud” did not understand how it was supposed to be made (e.g., imprint) and that the Turin Shroud has it right. Have you ever consulted that manuscript?.","date":"2015-01-15","mins":"8:33 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-160458","author":"mario_latendresse","post":"I contacted the editor in chief of the MAA journal, Ioannis Liritzis, to clarify if a review process took place for the Fazio et al. Paper. First, he confirmed that the received date of the paper was in error: it was 27/10/2013 and not 24/02/2014, which now makes it possible that a review took place; second, that there was a review by two referees. One of the author of that paper has made public, on this blog, the name of one of the anonymous referees. I am not sure if this referee consented to have his name made public. Still, the more I read the paper the more I conclude that its main claim is not only unproven but is meaningless. The main claim of the paper I am referring to is given in the abstract: “In this paper we prove that a natural stochastic process can offer a rational and scientific explanation that can account for all the known properties of these bloodstains and body images.” There is clearly no such proof in the paper. The term “stochastic process” typically means that a probabilistic model of the physical process has been designed, using random variables and probability distributions. None of that appear in the paper. The paper is so confusing and contradictory that it is difficult to even pinpoint what they are trying to say. For example, in the last paragraph of section 2.4 we can read “Such damage on the fibrils, which depends on the intensity of the energy sources and their macroscopic effect (yellowing of fibrils), is purely probabilistic.”. What does “purely probabilistic” mean? That the probability has an uniform distribution? If so, than the image would appear has noise, not as an image of a man. In the Introduction we can read “For us, on the Shroud, there are latent body images (ventral and dorsal), yielded by the action of a stochastic process that is triggered by a little quantity of energy, without threshold to appear, with effects that have a time of latency of the order of many years. These effects are absent just when the energy is zero.” How much is “a little quantity of energy”? We get no clue whatsoever from the rest of paper. We read “without threshold to appear” what does that mean? “Energy zero”, but at room temperature the air has energy. Was the Shroud sealed in a vacuum at some point? And where is the discussion in the paper that relates a stochastic process and the creation of bloodstains? What is the “random” aspect of bloodstains? Such a claim is incomprehensible..","date":"2014-10-08","mins":"2:25 pm","url":"https://shroudstory.com/2014/10/07/to-revisit-a-stochastic-process/","cat":"image_theory","title":"To Revisit a Stochastic Process"},{"id":"comment-161068","author":"mario_latendresse","post":"Again, we can see on this blog, from one of the authors of the paper, basic misunderstanding about stochastic processes. A stochastic process does not imply low energy, which is one of the major claims of the Fazio et al. Paper. This fact is obvious and the authors appear confused on the matter. There are thousands of papers using stochastic processes to model high energy physics. Text books are written on the matter. See a small sample: http://arxiv.org/abs/hep ex/0607012 http://www.sif.it/riviste/ncc/econtents/2011/034/04/article/16 http://www.sciencedirect.com/science/article/pii/S0370269311007234 http://www.lpthe.jussieu.fr/~soyez/data/talks/2006 06 Low X.pdf http://rd.springer.com/article/10.1007%2 FBF01397795 The Editor in Chief of MAAJ accepted that I write a critical review of the Fazio et al. Paper. My understanding is that the authors will have the opportunity to answer that review..","date":"2014-10-10","mins":"12:40 pm","url":"https://shroudstory.com/2014/10/07/to-revisit-a-stochastic-process/","cat":"image_theory","title":"To Revisit a Stochastic Process"},{"id":"comment-160189","author":"mario_latendresse","post":"Sorry, but most of the content of that paper by Fazio et al. Does not make sense. First, I am pretty sure that no peer review of that paper was done by any physicists because, among other things, the received and accepted dates are exactly the same: 24/02/2014. That is, the editor received and accepted the paper the same day! This is not serious. No review could have been done during such a short time. I have never seen this type of review in all the papers I have published and read in my life. Second, Fazio has been publishing the same rhetoric about this stochastic process in some other four (or probably even five or six) other published papers. I raise ethical issues on that point. Third, the presentation about this stochastic process does not make sense: there is no physical relationship between the energy level and a stochastic process. This is what the paper is concluding but no such relationship can be proven because it is false. High energy physical processes can create a stochastic process as well as low energy ones. And there is attempt of a proof, whatsoever, of such a relationship in the paper..","date":"2014-10-07","mins":"3:26 pm","url":"https://shroudstory.com/2014/10/07/to-revisit-a-stochastic-process/","cat":"image_theory","title":"To Revisit a Stochastic Process"},{"id":"comment-73414","author":"mario_latendresse","post":"As pointed out by several previous comments, I think it is clearly a water stain that Daved is referring to and not an image of the head. I would add that this becomes clear when: 1) Looking at the diamond shape water stain that has a strong dark contour as seen on the Durante photo: http://www.sindonology.org/shroud Scope/shroud Scope.shtml?zl=6&image=4&lon=5974&lat=1674 2) And the reverse side of the Shroud of Turin, as seen from the following link, shows that the water stain did indeed seep through the Shroud (but the image does not do that): http://shroud.wikispaces.com/PROPERTIES I would also add that the lack of side images do not need a complex explanation. It is the consequence of the distance of the cloth to the sides of the body. That is, from the assumption that the imprinted image has recorded the cloth/body distance, and the body is loosely covered by the cloth, the distance of the sides of the body are too far away to be recorded at all on the Shroud. This does not preclude the possible existence of a cap (Cahors?) to be on the head, but that would not be needed to explain the lack of image coming from the top of the head. I think a cap is needed to explain the presence of some of the side hair to be imprinted on the Shroud. It would have hold up the hair almost at the same level as the cheeks..","date":"2014-01-16","mins":"2:02 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73420","author":"mario_latendresse","post":"Matthias wrote “I disagree. I think the cap – or cap of thorns – is necessary to explain the lack of image. If there was no such cap, then the top of the head would have been in contact with the cloth,…” Why would the cloth be necessarily in contact with the top of the head? The cloth could simply have extended a few cms away because the distance of about 23cms between the back and front images would allow it. We would need to have a very accurate knowledge of the size of the head to conclude otherwise..","date":"2014-01-16","mins":"4:01 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-170501","author":"mario_latendresse","post":"Hi Thibault, You have the Halta Definizione digital photograhs or you have some (or entire!) screenshot extracts from the Halta Definizione Web 2.0 app?.","date":"2014-11-10","mins":"8:19 pm","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"},{"id":"comment-30923","author":"mario_latendresse","post":"André Marion’s paper “Discovery of inscriptions on the Shroud of Turin by digital image processing” (1998) can be obtained from deepdyve for a fee: http://www.deepdyve.com/lp/spie/discovery of inscriptions on the shroud of turin by digital image w U0f S990mw The first page is free for viewing and a monthly subscription will allow you to read the entire paper. Actually, if you take the free 14 day trial, you can read that paper and many others for free..","date":"2013-04-15","mins":"11:07 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30924","author":"mario_latendresse","post":"There is no need for any “ink” or “substances” to be left on the Shroud for these (letter) inscriptions to exist. Inscriptions can be formed by 1) Removing coloration of the surrounding environment similar to scrapping paint off a wall. For the Shroud, it can be discoloration of some regions. 2) Deforming a surface such as writing in the sand with your finger. For the Shroud, it can be deformation of the linen fibrils. And the inscriptions found by André Marion appears to have no substances left on the Shroud. The presence of detected inscriptions does not mean it proves an intentional writing on the Shroud. I think this is the main issue: searching thoroughly over the entire surface of the Shroud, with a systematic objective image analysis technique, many hard to discern inscriptions could be detected. These writings have to have a very low probability to exist to be considered intentional. As far as I know, this search has never be done. See also the paper by Lazzaro, Murra and Schwortz at http://www.sciencedirect.com/science/article/pii/S0031320312005377..","date":"2013-04-15","mins":"11:45 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-186197","author":"mario_latendresse","post":"The access to the high definition images of the Shroud, conducted by the diocese of Turin, is something I have been looking forward for many years. As Andrea Nicolotti has pointed out, this is not a technical problem. It has never been a technical problem. The main argument raised by the diocese of Turin is two fold: 1) Reproduction of the full size of the Shroud with a high level of fidelity should be under their control (for example, ordering a full size Shroud image from Haltadefinizione requires the authorization of Turin), 2) Research on the Shroud should be under the control of the Turin authorities. Point 2 appears to be extended to the high definition images as if you were conducting research directly on the Shroud. Point 1, of course, cannot be fully under their control as other high definition images are available to create full size Shroud replica. I understand the reluctance of the Turin authorities to see these images treated in a cavalier manner or attitude. On the other hand, there is currently no researcher that have published any study using these images. And there is no clear channel of discussion to have access to them. It is as if no researcher in the world is worth looking at them..","date":"2015-01-25","mins":"1:56 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-31085","author":"mario_latendresse","post":"It does not look like we are reading the same paper. 1) You wrote “His methodology, in a scientific journal specifically devoted to optical engineering, is extremely sketchy”. André Marion described in details the technique he used to reconstruct the images he shows in his paper. What is sketchy about it? 2) You wrote “It is not clear why he chose that particular part of the shroud to analyse, unless he had already decided that the dark U shapes he selected were likely to carry inscriptions.” In Section 3, he referenced the work of Marastoni and Coero Borga on inscriptions previously found on which he is focusing his work. 3) You wrote “He does not say whether he examined any other part of the shroud, or whether there were any parts of what he did examine that yielded no result.” He does write that he analyzed the surrounding of the inscriptions for other inscriptions and failed to find any other presented in his paper..","date":"2013-04-17","mins":"1:13 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-31078","author":"mario_latendresse","post":"The imagine analysis of determining the presence of faint images such as the coin on the eye, the lettering, flowers, and more, lacks a sound foundation. Essentially, this is what I wrote at #18: “The presence of detected inscriptions does not mean it proves an intentional writing on the Shroud. I think this is the main issue: searching thoroughly over the entire surface of the Shroud, with a systematic objective image analysis technique, many hard to discern inscriptions could be detected. These writings have to have a very low probability to exist to be considered intentional.” If one look at the references of André Marion’s paper, one can readily see that no such study has been referenced. As far as I know, it has never been done even on some other images. André Marion was very careful about this aspect of low probability of any inscription found, but it was not done in a systematic manner. He wrote that he searched around the inscription to try detecting similar inscriptions. But that is not enough since it depends on his visual acuity, which is not systematic and reproducible..","date":"2013-04-17","mins":"11:52 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-31081","author":"mario_latendresse","post":"I do not think you can eliminate pareidolia from any faint images you might found. Pareidolia is a high level phenomena that is related to intentionality and real objects. That is, we call it a pareidolia if the image perceived was not intentionally created by its author or by a real object that existed. Obviously, if you see an elephant in a cloud, that cannot be an elephant and it cannot be an elephant that left its mark in the cloud. But if you see some inscriptions on the Shroud, how do we determine that it was intentional or related to a real object? You cannot eliminate these faint images as pareidolia unless you have the author of these images telling you so. The face on Mars, what was its probability to occur over a sample of images? I do not think it was close to zero, say, below 10^ 6. For example, DNA matching, it has to be very close to zero, such as 10^ 20, to be considered non accidental. There is a clear model to evaluate these probabilities (it has a simple model that works very well). This is what the probability has to be to be considered a non accidental image: pretty close to zero. You need a model to come to such an evaluation. We have no such model and it does not look simple to create such a model. And in the case of the coin: pareidolia may still be present since there is an interpretation by a human reconstructing the image. The fact that Father Filas looked deeper at copies of images does not matter: he was doing an interpretation looking at the images..","date":"2013-04-17","mins":"12:27 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30807","author":"mario_latendresse","post":"The Shroud 2.0 app (available on i OS devices) from Haltadefinizione (the paid version with the highest definition images offered) does NOT provide the high definition of the 2008 scan. 1) The 2008 Haltadefinizione scan is 12 billion pixels over 1100×4300 mm (~ size of Shroud), which is about 2500 pixels per mm square, that is 50 pixels by 50 pixels covering 1 square millimeter. This is 0.02 mm (20 micrometer, that is, 20µm) per pixel. That is, one pixel on that scanned image covers 20 µm, vertically and horizontally. Note that one such pixel is not enough to recognize particles of 20 µm in size. (A linen fibril varies from 10 µm to 50 µm in diameter). You need at least several if not over 10 such pixels to be able to identify something of size 20 µm, but that varies depending on the object to identify. In the US, a more familiar unit is the inch: the scanned image is about 1200 dpi (dots per inch). 2) The Shroud 2.0 app image resolution does not offer that high resolution of 20 µm per pixel, it offers a lower one. The app highest resolution offers an image of about 13300 pixels wide over the width of the Shroud. This is about 12 pixels per mm. This is about 4 times less resolution that the scanned image of 2008. That is, Haltadefinizione could offer images of the Shroud with at least 4 times more resolution than the Shroud 2.0 app is offering at the highest resolution. 3) Having said that, the Shroud 2.0 app offers a very high definition image of the Shroud and an app of very good quality..","date":"2013-04-14","mins":"5:53 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-31097","author":"mario_latendresse","post":"This is a minor point. But supercomputers of yesterday are workstations of today. You can now buy a 256 GB static ram computer with 12 cores for about $5000. This is not a supercomputer and you can process that image with such a machine. You could also use an uncompressed version of the image. It is unclear to me which stitching technique they use to assemble the 1649 images. Was the hardware used (the robot) giving also the locations of the image so that stitching could be based on these locations (that would require very high mechanical precision), or was it done based on overlapping sections of the images and a software was used to automatically stitch. In the latter case, it appears difficult to do since many sections on the Shroud look very alike. I did stitch together the face from the high definition images of the Shroud 2.0 app, and it is very time consuming to do. I did not see any specification of the computer they used. That would be interesting to know..","date":"2013-04-17","mins":"4:25 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-23742","author":"mario_latendresse","post":"Hugh Farey wrote: “This 35% increase is charmingly dismissed with “some observable widening of the hip is expected” and “such an apparent widening has been observed.” It has not been “charmingly dismissed” as you wrote. In the paper it is written (p. 13, second column, last paragraph) “Some observable widening of the hip is expected — it has been measured at 5.1 centimeters on one side in our experiment — and such an apparent widening has been observed for the Shroud by the work of Ercoline et al. [1].” You have obviously chopped off the paragraph so that the reference to the work of Ercoline is no longer mentioned. So your claim that it has been “charmingly dismissed” looks more like you misquoted the paper. There is even another sentence (p. 13, second column, end of first paragraph) that reads: “This is con firmed by Ercoline et al. [1] for the Shroud (see also Jackson [4]): a statistical analysis shows that the body image of the Man of the Shroud, at hip level, is wider than normal by several centimeters.” So, a second reference is made to a paper that determined that there is observable widening at the hip level, but you squarely forgot to mention it. Moreover, you simply have not pointed out that simple fact: you report a measurement of 36 cm using the Shroud Scope at hip level (and you did not provide the image used, the zoom level nor the end points of this measurement, so there is no possible verification of where you did your measurement on the image) is quite close to the measurement of 36.6cm reported in the paper! Your reasoning based on the measurement of 34cm across the buttocks assumes that no distortion is occurring there. You wrote: “As for the legs, Latendresse’s photos show his cloth draping the legs quite closely, but he does not explore the distortion thus caused.” As pointed out in the paper, the sheet covers only 3/4 of the body. That meant that, approaching the knee, the sheet no longer covers the body as if a full sheet was covering it. In particular, the sheet starts tucking closely to the side of the body which is not the configuration assumes in the paper. I would say that the measurement of line D (Fig 7 II, p.11) is the lowest we can go without breaking that assumption. It is probably even a bit too low (creating a bit more distortion) at that point if a longer sheet had been used. Finally, you wrote: “I do not think Latendresse has proved his point.” I am not sure which point you are referring to as there are several points being discussed in the paper..","date":"2013-02-08","mins":"2:28 am","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","title":"Topic of the Day (#7): Vertical Mapping of a Human Form"}]
