[{"id":"comment-214738","author":"mario_latendresse","post":"Jackson’s hypothesis starts with an invalid inference (inference 3 in his paper at https://shroud.com/pdfs/ssi34part3.pdf). He assumes that the cloth MUST have been in two different configuration. This is completely false and easily demonstrated to be false. More on this at http://www.sindonology.org/reviews/review Jackson90.shtml. Common sense has left some Shroud researchers..","date":"2015-11-17","mins":"11:51 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-6935","author":"mario_latendresse","post":"I think that the process of scientific publication is misunderstood by some. I have read many declarations that show basic misunderstanding. The most naive ones are of the form “This paper was peer reviewed, so its result should be accepted” (that one comes from a well known shroud authority). The review process greatly varies depending on the journal and the field of research. At first, there is no indication of the quality of a paper by simply stating that it was “peer reviewed”. It could be trash, it could be of the highest quality. For some journals, it might appear that they have a weak review process. But that could be a misleading first impression. At one extreme of the spectrum are journals that appear to have a weak peer review process: the author(s) suggest reviewers (the journal is not obligated to accept them), and pay to have it published. This is actually a common process in many fields: hundred of thousands of papers were published in Biology using that process. But it is an uncommon process in Computer Science. At first, this process is not bad: the suggested reviewers might be screened to make sure that they are respected researchers in the field and no apparent conflicts exist between these reviewers and the authors of the paper. For some journals, you always need to pay to have your paper published since this is their modus operandi (P Lo S ONE is one well known example for scientific papers). The cost of publishing is high and if you want your paper freely accessible that is one way to go: you pay the publisher so that the readers do not have to pay. Other journals do not charge a publication fee (they will charge the readers), but you can optionally pay to have your paper freely accessible on their Web site. The other extreme might be good or bad: the publisher do not charge any publication fee (they will charge the readers) and states that a peer review process is taking place. But you have some such journals that accept almost any paper as they run mostly as a business without much scientific supervision while still claiming a fair peer review process. The Web has unfortunately brought many new such journals. I have seen many papers being published on the Shroud in such journals (claimed as peer reviewed): their content was so empty of any new results that you had the feeling that the authors simply patched together random pieces of text from the Web. How do you know your way through all of this? I think you need to do some basic analysis: reading the instructions for authors, sampling some of the papers published, and verify the credentials of the editorial board. Also, as pointed out by Gabriel, the Impact Factor of the journal can help. This system is new and has been criticized, but a good Impact Factor (I would say above 3) is not a bad indicator (certainly when you reach an Impact Factor of 20, you know this is a very serious journal). But most importantly, every paper speaks for itself. There is nothing that replace a deep analysis of the results published, the methodology used, the cross referencing of every fact stated in the paper, and more. If as a researcher you cannot differentiate between a good and a bad paper, you are in trouble..","date":"2012-01-13","mins":"2:05 pm","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","title":"And you thought you knew all about peer reviewed journals."},{"id":"comment-214777","author":"mario_latendresse","post":"Very specific and concrete aspects of what is assumed and stated in that paper (jacksonpropp.pdf) can be shown to be erroneous. For example, it is stated by the document cited (jacksonpropp.pdf): “Recently, one important prediction of the hypothesis, that a double superficial frontal image without an associated dorsal image should exist on the Shroud, was reported by Fanti and Maggiolo (Ref 3).” This is mostly false. That paper of Fanti and Maggiolo shows that the only place a superficial image could be detected is around the face. Even that claim about an image around the face is strongly challenged. Actually, in 2002, once the back cloth was removed, it was obvious that no image, for the frontal part, appears on the reverse side of the Shroud. So, to claim the opposite in that paper (jacksonpropp.pdf) is misleading. Also, the very axiom used to introduce that theory is wrong. Inference 3 assumes that the bloodstains seen in the hair *must* come from the face and cites Gilbert Lavoie’s paper. There is no proof of that at all in that paper. Note that there is a difference between “may” and “must”. Overall, that theory is based on a wrong axiom and the prediction it claimed (image of the frontal part on the reverse side) turned out to be false..","date":"2015-11-18","mins":"12:16 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214910","author":"mario_latendresse","post":"Robert, as an example of “mostly false” vs “false”, I will take as an example the very first sentence of the paper by Jackson (https://shroud.com/pdfs/ssi34part3.pdf). It is a quote attributed to Albert Einstein. That quote is: “Common sense is the deposit of prejudice laid down in the mind before the age of eighteen.” This attribution to Einstein is “mostly false”, but not “false” (or should I say “completely false”). Einstein did not write or said that sentence. Therefore, it cannot be a quote attributed to Einstein. Yet, he could have thought that it was true, because Einstein wrote a preface to a book written by Lincoln Barnett who stated that quote. Did Einstein saw the quote? We do not know. That subtle point was discussed by http://quoteinvestigator.com/2014/04/29/common sense/. Similarly, to state that the paper by Fanti and Maggiolo supports the prediction of a double superficially of the frontal image of the Shroud is mostly false, because there was no image found by them for the most part of the frontal image. And for the part found (face) it is dubious. As for “You of course do not need to accept Jackson’s hypothesis.”. I do not understand your point. You are posting on a public forum opened for discussion..","date":"2015-11-21","mins":"1:45 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214643","author":"mario_latendresse","post":"Professor Bernstein exaggerated the amount of work that Mc Crone put in this work and missed obvious mistakes in that work. At 47:36 “he examined more than 8,000 fibers”. It is actually Christine Skirius (a junior high school student, back then) who looked at more than 8,000 fibers to count the colored (yellow) and uncolored ones [1, p. 101][2, p. 83]. But that analysis has a trivial result: there is more yellowed fibers in the image area than in the non image area. Actually, systematically going through the 32 tapes by Mc Crone to classify the sticky tapes was done in two days [1, p. 92]. It is also a bit disconcerting to hear at 34:24 “here’s Rinaldi with the Shroud”. It is not the Shroud but a copy of it on a cloth. Either Bernstein was careless in identifying what was on the photograph or he indeed thought it was the real Turin Shroud. I hope it is the former. But major, and fundamental issues, exist in this work of Mc Crone, obviously not stated by Bernstein. For example, in Table IV [1, p. 93] several sticky tapes are not classified properly, which can be determined by simply looking at the location of the tapes provided on p. 79. Tapes 1 HB, 2 AF, and 2 BF, classified as in image area but are not, and tapes 3 AB, 3 BB, and 4 CB classified as not in image when actually they are. The study is also completely biased because on p. 92 Mc Crone states that he restudied some tapes that he previously misclassified but without restudying others. And actually his classification correlates more with the presence of blood where the sticky tapes were taken then with the body image (yellow area). Mc Crone ignores that completely. But it was so obvious to check. Also, Bernstein misunderstand what Mc Crone stated about the formation of the body image: a forger is using a diluted paint barely visible when you apply it, then the fibrils would have yellowed to create the image. According to Mc Crone, the body image does not come from the red ochre as Bernstein states in this video but the yellowing of the fibrils due to the supposed collagen used. [1] Walter C. Mc Crone, Judgment Day for the Shroud of Turin, 1999. [2] Walter C. Mc Crone, The Shroud of Turin: blood or artist’s pigment?, Acc. Chem. Res., 1990, 23 (3), pp 77–83, DOI: 10.1021/ar00171a004.","date":"2015-11-15","mins":"5:20 pm","url":"https://shroudstory.com/2015/11/14/joel-bernstein-on-good-science-bad-science-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Joel Bernstein on Good Science, Bad Science, and the Shroud of Turin"},{"id":"comment-21936","author":"mario_latendresse","post":"I second Gabriel. With all respect to Isabel Piczek (notice the “c” in her name): people say that she is a physicist, but is that really the case? What are the papers she ever published in physics? And what exactly is the meaning of “quantum” in the context of your book? It does not seem that it is the concept of quantum in physics. If not, why use this word?.","date":"2013-01-12","mins":"1:10 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part"},{"id":"comment-30492","author":"mario_latendresse","post":"Besides André Marion (deceased) there is also Thiery Castex who has been doing image analysis of the Shroud. His web site (http://thierrycastex.blogspot.com/) has some of these analysis. I think that the hypothesis offered by Thiery Castex that the Shroud was partially folded (over a few centimeters) in the back right below the buttocks is very plausible. That would explain the strange lengthening of the legs at that location. Yet again we are in the domain of the most simple analysis: length measurements. Haltadefinizione has images of the Shroud of higher definition than the one they provide in the Shroud 2.0 app. This can be concluded by measuring the pixel density offered by the app and the 70 gigabytes image of the Shroud they have. This is also confirmed by Haltadefinizione..","date":"2013-04-12","mins":"12:19 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-30503","author":"mario_latendresse","post":"Sorry, I mistyped the name of Thierry Castex, it is indeed two “r”s in Thierry..","date":"2013-04-12","mins":"1:25 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-30541","author":"mario_latendresse","post":"I should have stated more clearly that length measurements does not support the hypothesis of Thierry Castex. The analysis of the image first gives the impression that this hypothesis of the folding of the Shroud below the buttocks is very plausible but length measurements of the tibia/femur lengths (an approximation of them) shows that the lengths are normal. So such an hypothesis is not supported by simple length measurements..","date":"2013-04-12","mins":"7:00 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-93111","author":"mario_latendresse","post":"Mike, yes, the imperfection you pointed out near the wrist on #4 is a good example of weave imperfection I was referring to. It is not the only one. To be systematic and clear, I am hoping to have UR Ls that point directly to the locations on Shroud Scope with the Shroud 2.0 images with them (as an overlay, so you can popup the Shroud 2.0 photograph sections from the Durante 2002 photograph and compare). Hugh writes “It casts into question how reliable Shroudscope is for this kind of investgation”. To be more precise, it casts into question the reliability of some of the features of specific Shroud photographs used for some investigations (note: Shroud Scope does not apply ANY modification to publicly available photographs). Of course, Shroud Scope tries to provide as many Shroud photographs as possible to mitigate the issues of each specific Shroud photograph. If I had the images done by Haltadefinizione, and their authorization, you can be certain that it would be available on Shroud Scope. I will try again to convince them to provide their image but that also depends on the authorities at Turin (and I understand their objections). Also, note that Shroud 2.0 DOES NOT have the highest resolution images done by Haltadefinizione, see my web site (sindonology.org) on that subject..","date":"2014-03-25","mins":"12:01 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”"},{"id":"comment-214665","author":"mario_latendresse","post":"Rick, sorry, but I really think that it is not the place to promote political views. It is sad to see the type of articles you are referencing..","date":"2015-11-16","mins":"1:17 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-184329","author":"mario_latendresse","post":"Hi Hugh, I am not sure what you are trying to imply by “Dorothy puts to much credence in the ‘discovery’ in 1794” and in parallel “Bishop d’Arcis did not have to demonstrate the Lirey Shroud did not look realistic, he only had to establish a human painter rather than a divine one!”. It appears that you are putting on the same footing the Shroud of Besançon and the Shroud of Lirey, that is, we could conclude that the Shroud of Lirey were a painting if we use the same reasoning as Dorothy Crispino used for the Shroud of Besançon. Yet, Dorothy only covers part of the story. You really have to read the Bergier manuscript, and probably other documents. As far as I know, almost all historians have concluded that the Shroud of Besançon, as it was in the 18th century, was a painting. There are no doubts about it, whatever the Revolutionaries did (and I believe the stencil was really used in the 18th century). See also Palu Vignon and Dan Scavone. In summary, we have plenty of documentations supporting that the Shroud of Besançon in the 18th century was painting, whereas it is not the case for the Shroud of Lirey..","date":"2015-01-18","mins":"4:59 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-184355","author":"mario_latendresse","post":"Hugh, you wrote “15th century”, did you mean “16th century”? There is no clear documentation that states that there was a Shroud in Besançon in the 15th century. You wrote “The Lier copy at least suggests that he got the Turin Shroud wrong – perhaps he got the Besançon one wrong too.” You used “he” twice in that sentence, but I can’t see who you are referring to with it. Chifflet? That can’t be since Chifflet has nothing to do with the Lier copy. Jean Jacques Chifflet (17th century) had direct access to the Shroud of Besançon but not the Shroud of Turin. So, he could describe precisely the Shroud of Besançon but not the Shroud of Turin. Bergier the same, he could describe precisely the Shroud of Besançon as one might assume that he could access it but does not appear to have access to the Shroud of Turin. Moreover, the first dissertation (not the one written by Bergier) of manuscript Ms 826 (17th century) describes in details the Shroud of Besançon and it appears as a painting as the image was seen on both sides of the cloth. Quite different to the Shroud of Turin. Bergier, if he really is the real author of the second dissertation of Ms 826, from all appearances did not have access to the Shroud of Turin and could not reliably evaluate its physical aspect and probably did not know what was claimed about its full history. In any case, Bergier relies his arguments on earlier documentations and the story about the existence of a Shroud of Besançon prior to the 16th century which he shows could not be the case. On the other hand, his first “preuve” (proof) would also discredit the Shroud of Turin because he claims that the Jewish custom of the first century was to use only strips of linen to embalm the body. Whether or not this is true for all cases is hard to tell. One interesting comment made by Bergier is the following: one long sheet would have been bought, then they (Nicodemus and Joseph) would have tear it apart to make strips of linen to wrap the body. But one can see that this would have taken much time, and they were out of time to embalm Jesus, they probably give up after creating one strip, which we still see today on the Shroud of Turin. Note: the first and second dissertations of Ms 826 are not written by the same author(s) and probably more than 30 (perhaps up to 70) years separate their writing. In summary, the story of the Besançon Shroud and the Shroud at Lirey are completely different. And this is based on many concrete documents we have today. As for a Shroud being considered genuine based on authority, this was probably true for the past but this is no longer true for today or when you have access to all the information that we have today for the past relics..","date":"2015-01-18","mins":"7:34 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-184360","author":"mario_latendresse","post":"Hugh, my posting just crossed yours. Sorry, I found ironic that you wrote “I can hardly refrain from recommending that Mario investigate Nicolas Sylvestre Bergier rather more carefully that he has so far.” I believe I have read it much more carefully than you did. The fundamental point that I believe you missed is that Chifflet and Bergier had full access to the Shroud of Besançon but not the Shroud of Turin. The description they give all look like a painting. Moreover, and that probably trumps almost all the discussion on the subject, the instigation of the creation of the Shroud of Besançon started in 1523 where it is stated that a shroud would be created for the theatrical play. The chapitre of Besançon wrote that. Did you read the description of the creation of the Shroud of Besançon in 1523? This is documented as an act of the church of Besançon. So, obviously, today, everybody agrees that the Shroud of Besançon in the 16th 18th centuries was a painting. Do you realize that this stated by all modern historians say and this is fully documented? Also, there is no documentation that says that the Shroud of Lirey was ever used in a theatrical play. That must be stated very clearly, which Charles Freeman does not state clearly (just to confuse people I guess). That sets it apart in a major manner. You have to at least starts with the documents that exist. As for Bergier stating that it must be strips of linen that must have been used, did you read the whole story? Bergier assumes that a whole cloth was bought, then strips of line were created from it *at the time of embalming*. Did the whole embalming of Jesus took place? No, so there is an error in his reasoning..","date":"2015-01-18","mins":"7:55 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-184565","author":"mario_latendresse","post":"Hugh, Charles, I can see that the discussion is getting complex and chaotic and that you have not read the relevant references. I do not say that to end this discussion abruptly but to point out that this is getting out of the capacity of comments in a blog and these documents have to be entirely read to pick up all the nuances. 1) May I point out that Bergier does not put too much attention to the Shroud of Turin among many others. We can read in his dissertation: “Que tous ces saints suaires et d’autres encore soient authentiques ou non, peu m’importe. Je me borne ici à examiner celui de Besançon et je soutiens que l’empreinte qu’il porte est une marque évidente de sa fausseté, parce qu’elle est incroyable en elle même et impossible.” Bergier at this point does not even argue for authenticity or not of the Shroud of Turin. This is not of is concern. Moreover, again, he probably based most of his comments about the Shroud of Besançon on Chifflet’s description. So Chifflet should also be consulted for a description of the Shroud of Besançon. And the first dissertation of the MS 826 manuscript should also be read for such a description where its author clearly appears to have accessed to analyze and make many measurements on the Shroud of Besançon. 2) Charles, the side wound was painted on the wrong side on the Shroud of Besançon because the image was painted more prominently on one face of the cloth (yes, the image appeared on the recto and verso of the cloth as the paint went through the cloth (no gesso here!)), and on that face the side wound is on the wrong side. Besides, the very fact that the image appears recto and verso just points out to a painting. You have to read Chifflet (French), and Paul Vignon if you want to read an English text, but Vignon quotes Chifflet. 3) Charles, if the only reference is the badge of Lirey found in the seine to support the performance of a theatrical play at Lirey using the Shroud of Turin, this is not much. The documents does not point out to such a play but at a solemn display of the Shroud at Lirey. That trumps that reasoning of a play..","date":"2015-01-19","mins":"12:18 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-184128","author":"mario_latendresse","post":"Hugh, you wrote: “Perhaps one of more of the other Quem Quaeritis shrouds “. Note: you used “other” implying that the Shroud of Turin was used in a Quem Quaeritis. Has it been shown that the Shroud of Turin was used in a Quem Quaeritis? Any reference? We have references describing the Quem Quaeritis at Besançon used with a shroud, in the 16th century. Do we have the same for the Shroud of Turin in Lirey, Chambéry, Turin or any other places it was exposed to the public? Any reference?.","date":"2015-01-17","mins":"7:00 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-184126","author":"mario_latendresse","post":"Dan you wrote: “I think it is significant that the shroud is unique, which, of course, cannot be proven.” Why “of course” and “cannot be proven”? If we say “It is unique”, then it is either true or false. If you think it is true, you would have a (subconscious?) proof for it, otherwise, “It is unique” would be meaningless. In the realm of physical objects, we have to use a reasonable approach to “proof”. What is a proof in that case? I think it is reasonable that such a proof would entail to show that no one has been able to show the existence of a similar image or report that a similar one existed. And that has been proven, minus the description of the image of Edessa when it arrived in Constantinople in 944. Take another well known example: has it been proven that we have never observed a physical object going at a speed higher than the speed of light? It is reasonable to answer, yes. No such event has ever been reported. It is based on decades of experiment and research. It is hard to believe that a physicist would answer: “This has not been proven”. Stating that the Shroud image is unique, is correct and proven because no one has reported any other similar image (again minus other cases related to the image of Edessa). There is a major difference in stating: we just found this object, we believe it is unique as it looks odd, but we need to investigate further to look for more. Indeed, in such a case, the uniqueness has not been proven. The Shroud of Turin has been proven unique based on such a definition of proof..","date":"2015-01-17","mins":"6:50 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-184172","author":"mario_latendresse","post":"The main point: there is not a bit of evidence that the Shroud of Turin was used in a Quem Quaeretis ceremony, before or after 1350. To state that it is not supposed that it was used as such after 1350 is dodging the subject entirely because the Shroud of Lirey was never recorded to be shown before 1350 in Lirey. The most natural conclusion from the existence of the Quem Quaeretis ceremony, is that the Shroud of Lirey was not forged for it: many shrouds were created for such a ceremony, like the one in Besançon, but that was never recorded for the Shroud at Lirey. In other words: The preponderance of documented evidence is that the Shroud of Lirey was not forged for such a ceremony, that is, the Quem Quaeretis ceremony itself promotes the Shroud of Lirey as not forged. Do you put aside all documented evidence and then start imagining all other kinds of possibilities leaving aside the most evident conclusion?.","date":"2015-01-17","mins":"10:49 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-165684","author":"mario_latendresse","post":"Research Gate (researchgate.net) is another prominent social network for scientists (5 million researchers). It is used by more professional researchers than academia.edu (see http://goo.gl/s Go J Cq) because anybody can sign up at academia.edu which is not the case for Reasearch Gate. Many papers about the Shroud can be found at Research Gate and you can see more information about their authors than academia.edu. It is quite different compared to academia.edu as Research Gate can keep track of many parameters among them which papers are citing your papers, even the ones you are not allowed to upload due to copyright. If you are looking for papers at Research Gate, it is probably faster to use Google and add the word “researchgate” as a keyword in your search..","date":"2014-10-26","mins":"1:38 pm","url":"https://shroudstory.com/2014/10/26/publishing-shroud-of-turin-papers-on-academia-edu/","cat":"news_&_views","title":"Publishing Shroud of Turin Papers on Academia.edu"},{"id":"comment-184175","author":"mario_latendresse","post":"Yes, it is well recorded that the Shroud of Besançon was used in such a Quem Quaeretis ceremony, essentially a theatrical play. This is described at length in the manuscript Ms 826 of the Besançon archives, in its second dissertation. You can read a transcript (in French) online on Google books, see https://books.google.com/books?id=Jec QAQAAIAAJ&pg=PA225&lpg=PA225&dq=bergier+dissertation+suaire+besan%C3%A7on&source=bl&ots=kzx2 Dxeu UD&sig=a0 X7c7r IKF55a Kp WWGZ34jr91 Tk&hl=en&sa=X&ei=biu7 VPKEL Yq4gg S Ro YPY Bg&ved=0 C Cs Q6 A Ew AQ#v=onepage&q=bergier%20dissertation%20suaire%20besan%C3%A7on&f=false and also see Dorothy Crispino, “Doubts Along the Doubs”, https://www.shroud.com/pdfs/ssi14part5.pdf, where she refers to Bergier’s dissertation and the Quem Quaeretis ceremony at Besançon. Moreover, what Charles is doing, from all appearances, is to take the story of the Besançon Shroud and applies it to the Shroud of Lirey. You have to read the full history of how the Besançon Shroud came to be to understand that point. But he misunderstands what the Shroud of Besançon looks like by claiming that its creator understood well how to create a “real Shroud” whereas its clear description by Bergier shows many errors, one of which is painting the side wound on the wrong side..","date":"2015-01-17","mins":"11:03 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-212305","author":"mario_latendresse","post":"A good practical introduction to FFT can be found here: http://www.imagemagick.org/Usage/fourier/ It is based on the Image Magick software, which I think is better than Image J..","date":"2015-10-11","mins":"1:09 pm","url":"https://shroudstory.com/2015/10/11/removing-weave-pattern-from-images-of-the-shroud-of-turin/","cat":"other_sites","title":"Removing Weave Pattern from Images of the Shroud of Turin"},{"id":"comment-216964","author":"mario_latendresse","post":"Hugh, it is interesting how you apply the reasoning that no traces exist of suppose shrouds with images before the 14th century (not one, besides the Shroud) yet some probably existed; but on the other hand you reasoned recently that if the double image of the Shroud existed before 1355 we should have such traces from Constantinople or Edessa. One reasoning contradicts the other. Besides, the Shroud of Lirey was considered a fake by the authority of Troyes solely based on the presence of the image itself. The authorities argued that since the Gospels did not state that the shroud of Christ had an image, none with such an image could be considered authentic. That contradicts the argument that such shrouds were used in the Easter ceremony in or before the 14th century. We have no historical documents at all that supports that idea. The historical documents support the opposite: it was not considered appropriate to have such an image..","date":"2015-12-21","mins":"11:38 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-82354","author":"mario_latendresse","post":"You probably think of INRIA, Institut national de Recherche en Informatique et en Automatique, composed of several campuses across France..","date":"2014-02-25","mins":"11:40 am","url":"https://shroudstory.com/2014/02/25/some-perspective-on-alberto-carpinteri/","cat":"news_&_views","title":"Some Perspective on Alberto Carpinteri"},{"id":"comment-216974","author":"mario_latendresse","post":"Hugh, I think you are clearly distorting the historical documents on the matter. You wrote: ” However, a mere liturgical prop need not have excited any particular interest, regardless of its illustration.” The historical documents say something quite different. We have no historical witness or documents that state that an image (double, frontal or face only) was used in the Easter ceremony of the three Mary. On the contrary, we have a study made by Chifflet who mentions shrouds but none of which has an image on it. That is, a highly recognised historian of the 17th century denies the existence of an Easter ceremony (or any Church ceremony) of the 14th century or before with a shroud having an image. Moreover, the shroud of Lirey is never described to have been used in such a ceremony. There is only one shroud with an image (any image) attested in the 14th century or before being shown to a crowd: this is the Shroud at Lirey. The religious authorities at Troyes reasoned that such an image could not exist, claimed to be genuine or not. Therefore, why would any religious ceremony at a church in the 14th century or before used such an image? The Holy Shroud of Besançon was extremely popular for three centuries starting from the 16th century, and it was the only other shroud besides Lirey that had an image. And it clearly was a copy of the Shroud of Lirey. The claim that some other such shrouds (with an image) probably existed before the 14th century is against all known historical documents. Chifflet and all other historians could not state the existence of any. What Charles Freeman is doing is to avoid stating the reality of the historical documents to make some scenario historically sensible when in fact when you take into account the historical documents, these scenarios are proven to be highly implausible. If the Mandylion was indeed a face only image, why was it never shown in a ceremony to a crowd?.","date":"2015-12-21","mins":"1:25 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217027","author":"mario_latendresse","post":"Charles, you wrote: “The Quem Queritis ceremony early on Christmas morning required a burial cloth to be held up to show Christ had risen. Some were known to have been painted though we don’t know exactly how.” Which ones? Please provide a reference supporting that statement?.","date":"2015-12-21","mins":"8:37 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217039","author":"mario_latendresse","post":"Hugh, you wrote, “Chifflet was talking of actual relics; he does not even mention the liturgical props, with or without an image on them.” This is incorrect. Chifflet mentions the showing of a holy shroud during the ceremony of Three Maries. See at the end of page 41 of his book (translated from Latin to French) https://books.google.com/books/reader?id=ub Fw TFNHEZEC&printsec=frontcover&output=reader&pg=GBS.PA40 You wrote, “The development of the liturgical drama involving characters, a tomb in a side chapel, and a shroud seem to have begun in the 9th or 10th century (see, for example, The Latin Passion Play, Its Origins and Development, by Sandro Sticca)” The book you cite does not appear to have the word “shroud” or even “cloth” in it. Where are the hundred cases showing a shroud during the ceremony of the Three Maries? Before 1355? Original sources stating the cities where they were shown should be found. Compare your two claims: 1) “[the double image] would have been most unlikely not to have been well known” (fact: only a few high ranking officials in Constantinople saw the Mandylion). 2) “Although there are countless mentions of such shrouds, they are not described at all, and none remain.” You do not see a contradiction?.","date":"2015-12-22","mins":"3:10 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217028","author":"mario_latendresse","post":"And I mean more precisely: Charles do you have a reference to the statement “Some were known to have been painted” ?.","date":"2015-12-21","mins":"8:45 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217066","author":"mario_latendresse","post":"Hugh, the head of the trail to find such an image could be at Dijon. Supposedly, the Besançon ritual of the Three Maries was reestablished after an inquiry at Dijon. See (in French) https://books.google.com/books?id=rb AXAAAAYAAJ&pg=PA5&lpg=PA5&dq=besancon+saint+suaire+dijon&source=bl&ots=o R Vz N Lk QC3&sig=Hc9j8nys VNE0eu7 Tp4 J3 CFS Bc3c&hl=en&sa=X&ved=0ah UK Ewi S48j Mn PDJ Ah UB Hm MKHU Xm Czw Q6 AEI Hz AA#v=onepage&q=besancon%20saint%20suaire%20dijon&f=false For some description of the theatrical presentations done at Besançon, you could read (in French): https://books.google.com/books?id=y4z9 T Ha K Qtw C&pg=PA53#v=onepage&q&f=false These two references are given in my book on the Shroud of Besançon. The more people search this possibility, the better. But I doubt that you will find anything significant which will strengthen the arguments for the authenticity of the Shroud of Turin. But the image on the Shroud of Besançon is most likely from the Shroud at Lirey. Nothing else was ever found on that matter..","date":"2015-12-22","mins":"2:51 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217057","author":"mario_latendresse","post":"Hugh, yes the text by Chifflet points to a Three Maries’ ceremony at the church of Saint Étienne in Besançon. (That church no longer exists as it was destroyed to make place for the Vauban fortress.) He is writing in the 17th century. A shroud, or piece of cloth, was shown by one of the canons during that ceremony. This is according to Chifflet and this is before 1355. Yet, there is no image mentioned and Chifflet could not confirm any. And from the description, only one person was showing the piece of cloth. There is not a hint of an image on this cloth and the formal description of the ceremony that you describe above does not state an image. The Shroud of Besançon that would come later around 1520 is very different. We actually discussed that in January of this year. But you have not answered the question I asked: how do we know that there were hundreds of these ceremonies? Charles Freeman even claims to have references to painted cloth used in that ceremony. He has not provided any so far. This is my main question. What is clear to me: if there were hundreds of such ceremonies being held across Europe all of them appear not have shown any image. The very idea of the image on that cloth was so new to the clergy at Troyes that they rejected the authenticity of shroud of Lirey *solely* on that non existence. Of course, they knew absolutely nothing of the Mandylion. So, they would have fail to know anything about shrouds with an image being used in the Three Maries ceremony as it would weaken their argument. The lack of any documents and witnesses to such an image prior to 1355 strongly points to the uniqueness of the Lirey shroud, not the other way around as you tried to infer from totally unbalanced reasonings about the Mandylion vs the existence of images on the cloth used in the Three Maries ceremony. Again, please compare the two: we have no document or witness that states that images were on the cloth used in the Three Maries ceremony, yet you claim that some may have existed; on the other hand we have many documents that state that the Mandylion was not shown to the public and that it was kept hidden for centuries, yet you claim with certainty that the image that was on it would have been widely known. Don’t you see that your supposition that the Shroud at Lirey is not authentic makes you create reasonings that are contradictory?.","date":"2015-12-22","mins":"11:55 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217073","author":"mario_latendresse","post":"Correction to “But I doubt that you will find anything significant which will strengthen the arguments for the authenticity of the Shroud of Turin.” It should read: “But I doubt that you will find anything significant. That will only strengthen the arguments for the authenticity of the Shroud of Turin.”.","date":"2015-12-22","mins":"4:56 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217072","author":"mario_latendresse","post":"Charles, I do not see yet references that you promised for a Three Maries ceremony where a cloth is shown with an image. You also wrote “For a possible illustration of this which fits the liturgical account ,see the Lirey Pilgrim Badge.” Which one? You know that there are two known such badges, one without any tomb? So, I think you are not covering the latest historical finds. You wrote, “I would agree with Mario that searching these accounts for evidence of the authenticity of the Shroud is a dead end. Rather it provides evidence of the possible/ probable medieval liturgical origins of the Shroud.” Actually, this is not what I meant, but I can see now how the sentence I wrote could be interpreted that way. I meant the opposite, that is, that the search will likely not find any cloth with an image like the Shroud of Lirey (and also any image) used in a Three Maries ceremony (or any other ceremony actually). So, we can state: researchers convinced that the Shroud is inauthentic have tried to find a similar image on a cloth before it appears in Lirey, but none could be found. We certainly can now state something similar because many have searched already. You wrote: “I will also hope to give a reference from Hans Belting to the Image of Edessa being venerated by crowds who would sprinkle water on its eyes, one more reason why this was never the Shroud. No sign of the sprinkling!” You are probably referring to the an interpolation found in the Narratio first composed in 945. But it is not said that the water was sprinkled on the eyes. What sign do you expect?.","date":"2015-12-22","mins":"4:55 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217077","author":"mario_latendresse","post":"Charles, I understand. I’ll wait for your references. But in 2016, you will not be able to post them here..","date":"2015-12-22","mins":"6:48 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217114","author":"mario_latendresse","post":"Charles, you do not provide references to support the claim that a cloth with an image was used during the ceremony of the Three Marys prior to 1355. Or any church ceremonies. Often your references are also vague or does not point to the primary source. This is not the work of an historian. In general what you are doing is giving secondary references, and in several cases, misinterpreting them. For example, and this is on another subject that you introduced in your answer, the Image of Edessa, you cite Hans Belting. But the text you cite comes from the Narratio written shortly after 944. You appear unaware of it. And why do you cite this text about the ceremony of the Three Maries? Another example, you cite at (d) Abbé Bergier, who writes in French, and you write your own interpretation as “He goes on to note that in the Easter ceremonies, which he dates back to the 12th and 13th centuries, a linen cloth empreint de la figure de Jesus Christ enseveli (empreint, ‘printed’, enseveli, ‘buried’) is displayed to the congregation [ in other words he suggests that this was normal practice to have an image of the buried Christ]”. This is not case at all. Bergier writes that it was *possible* that such images was used prior to the appearances of shrouds such as Besançon, Turin and Lirey, but he has no references to backup this possibility that such shrouds/image existed in the 12th or 13th century. Bergier is writing in the 18th century, long after the events he is trying to describe. You are working with secondary sources *and* misinterpret them. I really do not need to point out all shortcomings of what you are citing but they are far from the claim you have made about examples of painted cloths for the Three Maries ceremony prior to 1355..","date":"2015-12-23","mins":"10:48 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217120","author":"mario_latendresse","post":"Hugh, Of course, Bergier knew that the Shroud at Turin was from Lirey. By the way, for over a century, the second dissertation (against the authenticity of the Shroud of Besançon) in the manuscript MS 826 of the municipal archives of Besançon was ascribed to him, but he was not the author of it (although I did think for a while that he was possibly the author). But Bergier had no more information than you and me about the whereabouts of the Shroud at Lirey before 1355. And the whole discussion is going into a circle if you are referring to the Shroud of Turin as a possible source of examples of cloths being used in a the ceremony of the Three Maries. The history of the Shroud of Lirey has been looked at so thoroughly! What is obvious is that Bergier is very vague and uses examples that we know very well today cannot correspond to what you are searching for. I think this is all very basic. You have to go back to primary sources to find what you are looking for. By the way, about the Narratio, and in particular the ceremony of the Image of Edessa, and whether or not the crowd could see the Image, see the work of Irma Karaulashvili, https://www.academia.edu/19780359/ Abgar Legend Text and Iconography. Kadmos Ilia State University 6 2014 164 240 On page 205: “On the fourth day of the middle week of the Lent the high priest went there, opened the chest in which the image was kept, wiped the icon with an unused sponge that was soaked with water, first gave the water that he squeezed out to the people then sprinkled the water over them. Ordinarily the chest with the image was kept behind the doors of the sacristy, which were opened on Wednesday and Friday. Everybody was able to see the chest from a distance but nobody was allowed to approach and touch It.” This is of course her translation of the Greek text of an excerpt of the Narratio. The image is in the Chest, but the crowd can only see the Chest on Wed and Fri (during Lent). The crowd does not see the Image at any moment. Also, see https://www.academia.edu/6711329/ The Abgar Legend Illustrated Interrelation of the Narrative Cycles and Iconography in Byzantine Georgian and Latin Traditions . in Interactions Artistic Interchange between the Western and Eastern Worlds in The Medieval Periods ed. C. Hourihane. Princeton 2007 pp. 220 243 And it shows how difficult it is to come with a clear description of what the Image of Edessa/Mandylion was. She even think, like Averil Cameron, that the Mandylion was probably not even a cloth! The claim by many that the image of Edessa was clearly only a face is a myth. It is not clear. These articles are a good first read for primary sources about the Image of Edessa/Mandylion..","date":"2015-12-23","mins":"12:14 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217115","author":"mario_latendresse","post":"Hugh, if you are using Bergier to try to track down shrouds with an image used in the ceremony of the Three Maries (prior to 1355), you are going to be disappointed. The French text you cite mentions Besançon and Turin. But of course Turin never used the Shroud for such a ceremony, and the Shroud at Besançon with an image is after 1520, which was likely a copy of the Shroud of Turin. And for the others, for which dates and where are the images? Bergier is a very well known text with nothing new to offer. The dictionary of Vigouroux: speculations..","date":"2015-12-23","mins":"11:11 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217160","author":"mario_latendresse","post":"The Thermochimica Acta short communication about the mass spectrometry analysis of Ray Rogers and the comments of Marco Bella, Luigi Garlaschelli and Roberto Samperi is available online for free until February 12, 2016. Http://www.sciencedirect.com/science/article/pii/S0040603115004724.","date":"2015-12-24","mins":"1:13 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-174181","author":"mario_latendresse","post":"Andrea, are your theory of forgery of these documents been published in an English journal? If not we cannot really thoroughly follow your claims. After all, what you are saying is not backed up by clear documents (e.g., as you keep claiming for proving that the Shroud was in Besançon), but is built on a subjective analysis of yours. I would very much like to read your account in a thorough manner, but can’t really do that from the short texts posted on this blog..","date":"2014-12-01","mins":"11:42 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-216607","author":"mario_latendresse","post":"Dan, Thank you for your work on this blog. At least a few good ideas and references came out of it for me. Lots of chaotic discussions, but this is part of the media. One needs to live with it. At some point, moving on is necessary. Enjoy the new crowd of your local community. Happy Holidays!.","date":"2015-12-15","mins":"4:02 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-174209","author":"mario_latendresse","post":"Andrea, thanks for the answer. I can fluently read French, so I am looking forward for the French translation announced for Feb Mar of next year at http://www.franche bourgogne.fr/pages/les publications.html. It will also be at a reasonable price. I hope they can ship outside Europe. But from that web page, it is not clear which Italian book is being translated. The French title is « Le Saint Suaire de Besançon et le chevalier Othon de la Roche » but that does not correspond to any of the Italian text listed on that page. In the summary on that web page, there is a mention of the manuscript 826 from « Bibliothèque d’étude et de conservation de Besançon ». I just found it on the web at http://memoirevive.besancon.fr/ark:/48565/a011324049269 Vm9g TM/1/1 I will read it, although it appears quite time consuming to do so given the cursive handwriting, but feasible. Your English book of the Mandylion: the problem is the price. I can’t see why it is priced so high. Stanford University has your Italian version, but not the English one. You wrote « I cannot make out, really, how it is so difficult to understand this.». As you wrote, some documents say that Othon de la Roche sent the Shroud to Besançon, so, we cannot strictly say that no document state that. But your interpretation is that these documents are either forgeries or have made up these stories. So, there is an interpretation of these documents. This is what I mean: there is no historical documents that says that these were forgeries. Right? You wrote, « It is obvious that the “Othon history” is false. ». If it is obvious, it could be summarized in English on a couple of pages. Is it the case? I am afraid this is not the case as it involves many old documents and in some cases some subtle interpretation and analysis. You can probe me wrong by summarizing the obvious arguments that you have in mind. But I think that this is not obvious, and a carefully written explanation is needed. I would love to summarize in English, if you like..","date":"2014-12-01","mins":"4:28 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174318","author":"mario_latendresse","post":"Andrea, thanks for the offer to ship your book to me if I have trouble getting from Europe. Actually, I will be in Turin next spring and could possibly pick it up right in Turin! Of course, the Ms 826 has been mentioned by many before. Riedmatten, for example, is also critical of the information contained in it. I have went through the first 50 pages of the first dissertation. I think I will reproduce the pages 39 41 and write a transcript of it on my website. They contain what I have seen so far to be the most relevant part for the Shroud. For questions 1 3 that you asked, I cannot answer them. The possibility that Othon de la Roche was in possession of the Shroud of Turin is a working hypothesis. I take that as it is: an hypothesis. We are still in a stage of gathering all documents and made these clear for everybody. I think this is still lacking..","date":"2014-12-02","mins":"12:10 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174571","author":"mario_latendresse","post":"Andrea, that close to the Shroud! I will be staying close by too. Let’s meet in April (19 24) in Turin to talk about the Shroud, old manuscripts, the history of the Shroud and Turin..","date":"2014-12-04","mins":"1:12 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174317","author":"mario_latendresse","post":"The Besançon shroud copies appear to have the following characteristics: 1) Both hands and wrists are completely visible with both wounds in the palms of the hands. 2) The feet are separated. 3) The wounds in the hands are clear circles. Naturally, the simple explanation is that the copy kept at the cathedral of Besançon had these characteristics..","date":"2014-12-02","mins":"12:00 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173398","author":"mario_latendresse","post":"About the French text, in a previous post above, extracted from Adrien Baillet’s (http://en.wikipedia.org/wiki/Adrien Baillet) “Les vies des saints, et l’histoire des festes de l’année”, T. IV. See a digital copy at Google Books: http://goo.gl/2n6 K Up. The quoted text, in French from a previous post, is missing an essential sentence. The relevant quoted text “C’est ce qui a fait dire à ceux qui ont donné l’histoire de l’un & de l’autre, que celui de Turin avoit servi à envelopper le corps tout ensanglanté à la descente de la croix, & que celui de Besançon avoit servi à l’ensevelir après qu’il eut été lavé et embaumé” essentially says that some people have the opinion that the Turin Shroud was used to wrap His body, entirely covered with blood, after it was taken down from the cross whereas the Besançon Shroud was used after He had been washed and embalmed. And, here is the missing sentence, Adrien Baillet adds his own analysis of this opinion by: “Ce qu’il y a d’incommode pour cette opinion, c’est que l’on a observé la même fixation (?) des membres dans l’une et l’autre peinture, jusqu’à lui croiser les mains et lui couvrir les reins de la même manière.” which essentially says that this opinion is mistaken because it was observed that both images are very similar: the legs and arms have the same position to the point of crossing the hands the same way. So, Adrien Baillet did not think that these two shrouds were different but that between the Turin and Besançon shrouds, one appeared to be a copy of the other. It corresponds to the current knowledge we have today about the (now gone) shroud of Besançon: it was a copy of the Turin Shroud. And we should add, that if such an opinion existed, it appears to be based on the fact that the shroud of Besançon did not show any prominent bloodstains whereas the Turin Shroud does..","date":"2014-11-27","mins":"11:49 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173651","author":"mario_latendresse","post":"Thanks Daveb for the pointer to Wilson’s book for this stained glass window. Indeed, a double image of the Shroud is depicted with four bishops. I think it is safe to presume that this depiction is from a public showing in Chambéry. I would base it solely on the double image. I do not know any copy of the Shroud of Besançon with a double image. If someone could get a wider photograph of the context of that stained glass window it would be nice..","date":"2014-11-29","mins":"4:53 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173564","author":"mario_latendresse","post":"The Chapelle de Pérolles (http://goo.gl/UT Oi Dx) built in 1520 in Fribourg, Switzerland, has a stained glass window representing the Shroud of Christ. According to a photograph of this small guide of the city, the representation of the Shroud has a front body image only (not a double image). Two bishops are holding the Shroud. I do not see how we could, without any doubt, connect this representation to the Shroud of Besançon and not to the Shroud kept at the time in Chambéry (Shroud of Turin) unless we assume that with a front body image only it should be the Shroud of Besançon. Yet, it has to be verified if this photograph is not truncating part of the representation of the stained glass window. Alain Hourseau in his book “Autour du Saint Suaire et de la collégiale de Lirey (Aube)”, p. 240, wrote that this stained glass of the Shroud at the Chapelle de Pérolles commemorates the ostentation of October 28, 1518, at the Castle of Chambéry, not the one in Besançon. But he also wrote that three bishops are holding the Shroud, although only two can be seen (again, assuming that the photograph above did not truncate the representation on the stained glass window). It is not clear how Hourseau came up with the date of October 28, 1518. My guess is that this date is based on the chronicle of Antonio de Beatis (http://goo.gl/p T Svnd), which relates the trip made by the Cardinal of d’Aragon in Germany and France, among other countries. The Cardinal arrives in Chambéry on October 28, 1518 (p. 208) and the Shroud his shown to them in the evening of that day. Beatis writes that they are being told that the Shroud is publicly shown only twice a year, on May 3 and on Good Friday, from an outside wall of the castle. It is therefore doubtful that this private showing of the Shroud, on October 28, at Chambéry, is related to that stained glass window representation. It could be based on the regular public showing at Chambéry. As for the copies of the Shroud of Besançon, many copies were made according to Jules Gauthier (http://goo.gl/8q Jb1i), some by Pierre d’Argent (p.9, first copy made in 1573, second in 1580, third in 1593). But d’Argent started to make unauthorized copies, and recognized in 1608 that they should not have been made. Some of these unauthorized copies were destroyed although many were not as they were sent to different countries. Only smaller copies, not real size, were allowed to be made without the authorization from the religious authorities of Besançon (the same policy applied today by the Turin authorities!). Jean de Loisy made his first copy in 1634. His younger brother Pierre took over after the death of Jean and got the exclusive right to reproduce the Shroud of Besançon in 1658. Pierre died around 1668, and his son Claude Joseph took over as copyist although he no longer had the exclusive right on producing copies, which greatly increased the reproduction of the Shroud of Besançon in various forms (e.g., medals). Therefore, from then on, copies could have been made by any artist of the time..","date":"2014-11-29","mins":"3:56 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173897","author":"mario_latendresse","post":"Thanks for the photo. I see that this photo may come from http://goo.gl/q90 Mg F, which also has other photos that give an idea of the size of the chapel..","date":"2014-11-30","mins":"5:08 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-29916","author":"mario_latendresse","post":"Here is a link to a recent article (April 7, 2013) in the Science Section of the New York Times describing the plague of bogus journals and conferences: http://www.nytimes.com/2013/04/08/health/for scientists an exploding world of pseudo academia.html?ref=science Sadly, It is now common for researchers to receive daily offer to publish their work in journals and at conferences that have barely any serious peer review. This was unknown in the 90s..","date":"2013-04-08","mins":"4:05 pm","url":"https://shroudstory.com/2013/04/07/when-it-comes-to-the-shroud-of-turin-has-peer-review-lost-its-luster/","cat":"news_&_views","title":"When it Comes to the Shroud of Turin, Has Peer Review Lost its Luster?"},{"id":"comment-29777","author":"mario_latendresse","post":"The last reference “Does peer review mean the same to the public as it does to scientists?” is a good *short* description of what is peer review. I quote one paragraph from it: “It’s been peer reviewed, so it must be right, right? Wrong! Not everything in the peer reviewed literature is correct. Indeed, some of it is downright bad science. Professional scientists usually know how to rate papers within their own fields of expertise (all too often very narrow ones nowadays). We realize that some journals are more stringent than others in what they will accept, and that peer review standards can unfortunately be too flexible. A lust for profit has arguably led to the appearance of too many journals, and so it can be all too easy to find somewhere that will publish poor quality work.” I think it summarizes the big picture. But there are so many parameters to take into consideration that to really get a sense of them you need to publish and review many papers..","date":"2013-04-07","mins":"2:43 pm","url":"https://shroudstory.com/2013/04/07/when-it-comes-to-the-shroud-of-turin-has-peer-review-lost-its-luster/","cat":"news_&_views","title":"When it Comes to the Shroud of Turin, Has Peer Review Lost its Luster?"},{"id":"comment-216240","author":"mario_latendresse","post":"Hugh, I have already answered that: no, the Mandylion could not be inspected by the “whole congregation” in Edessa, we have no historical documents to support that. On the contrary, such text as the Narratio (written in Constantinople under Constantine VII), states the opposite. In Constantinople, it became even more restrictive under the first emperors who received the Mandylion. Hugh, have you read the Narratio?.","date":"2015-12-11","mins":"4:09 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216509","author":"mario_latendresse","post":"Oups, my last sentence used incorrectly a double negative. It is rather “Hugh, does it convince you that the Narratio does state that the crowd, at Edessa, could not see the image of the Mandylion?.","date":"2015-12-14","mins":"5:44 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216505","author":"mario_latendresse","post":"Hugh, you wrote: “I really don’t get this. The Narratio explicitly states that twice a week “The image was beheld by all the congregation,” and you’re saying that it wasn’t?” Yes, the full analysis of the context let me conclude that the image was not directly visible by the crowd (i.e., congregation). The translation made by Guscin does not appear precise for that passage. Indeed, other translations are possible, and Nicolotti published another one, which essentially does not state that “The image was beheld by all the congregation”. See it in Nicolotti’s book, “From the Mandylion of Edessa to the Shroud of Turin”, p. 77. The pertinent text reads: “And since the ancient chest of the divine form was covered by shutters, so as not to be visible by all whenever they desired, on two days of the week, namely Wednesday and Friday, it could be seen by all the gathering crowd through very fine, studded irons — that among them were called “scepters” — when the windows were opened [ or: when the windows were pulled open by very fine, studded irons that among them were called “scepters”]; and everyone, with prayers, propitiated its incomprehensible power, although it was not permitted to anyone to approach, let alone to touch, the holy image with the lips or the eyes.” As you can see, in that translation the word “image” (or “form”) occurs at the beginning and end. Indeed, on this particular aspect, this translation corresponds to the Greek text. Guscin instead of using “it” used “image” in the segment “it could be seen”, but Guscin was over specific, because the text does not use the word “image” in that segment. The main point is: what does “it” refer to in the segment “it could be seen by all the gathering crowd[…]”? I think that the specific context of that text and the overall context of the description of the ritual at Edessa makes “it” refers to the chest, not the image. Nicolotti appears to also think that way, because on pages 78 79 (of his book) he argues mainly to prove that the bishop had seen the image on the cloth, but never argues that the crowd saw the image. I think that the Greek text has to be analysed carefully to understand this text and that also the general history of that text has to be understood to interpret it properly. Hugh, does it convince you that the Narratio does not state that the crowd, at Edessa, could not see the image of the Mandylion?.","date":"2015-12-14","mins":"4:41 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215766","author":"mario_latendresse","post":"“Had there been that iconic double image – both sides of the same man, aligned head to head – in someone or other’s possession for 1300 or years prior to Lirey, it would have leaked out into the public domain.” There are numerous examples of relics kept at Constantinople and even closer to us, at the Sainte Chapelle of Paris, for which we have no clear complete description. The reasons for this is simple when the history of these relics are analyzed: they were kept out of the public domain. How many people saw the inside of the reliquary of the Mandylion while it was in the Sainte Chapelle of Paris (the reliquary was there for over 550 years)? I will not answer the question, but I will let the people interested in this subject to READ about it. How many people could have seen the inside of the same reliquary while at Constantinople or Edessa? As another example: how many could have seen the piece of stone coming from the tomb of Christ and which was kept at the Sainte Chapelle of Paris? Do we have any drawing of it? None. It was in the Sainte Chapelle for 550 years..","date":"2015-12-07","mins":"1:31 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215773","author":"mario_latendresse","post":"Hugh, sorry, but you do not even make a difference between “nobody” and “a few”, which is necessary in this case. The inside of the reliquary of the Mandylion of the Sainte Chapelle: certainly a few saw it. But not a large number of people. The same thing for the Mandylion in Constantinople, the history of it tells us that it cannot be a large number that saw it. And if it were folded, which I think was the case, even fewer saw it unfolded. And as I wrote in the description about the Mandylion of the Sainte Chapelle, it is unlikely that the Mandylion was folded showing the face only. Certainly not kept that way in its reliquary. It is therefore not “it was” or “it wasn’t”. It is rather how many people? And who? And who could have seen it unfolded? Very few according to its history..","date":"2015-12-07","mins":"4:22 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216586","author":"mario_latendresse","post":"Hugh, I thought you had analyzed every occurrence of “chest” and “image” in the Greek text to make sure that they were distinguished, but you missed then the fact that a greek word for “image” was not present when applied to “beheld by all the congregation”. I think that from the general context the image cannot be seen by the crowd on these two days, otherwise the entire liturgical text does not make sense to me..","date":"2015-12-15","mins":"11:46 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215806","author":"mario_latendresse","post":"What exactly should have leaked? That it was a double image, or that it was not a face only image? For the latter, you know very well that many have cited historical documents that point to a not face only image. “Common knowledge” and “leaked” are very different things. You are now arguing that it should have became “common knowledge” but colin started with “leaked”. So we are slipping into a different discussion. Even if some knowledge leaked, it does not mean that it will become common knowledge. We agree on that? In any case, I pointed out a couple of examples about relics that were kept at the Sainte Chapelle of Paris, kept for five centuries, which we have many details missing (e.g., size, weight, color), and in most cases, no visual reproduction at all. I am really asking you, why? And these relics are much closer to us in time compared to the Mandylion in Constantinople..","date":"2015-12-07","mins":"12:18 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215959","author":"mario_latendresse","post":"Colin, I could have warned for that one too: you can’t trust Mc Crone..","date":"2015-12-09","mins":"2:54 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215807","author":"mario_latendresse","post":"Colin, the scenario that the Mandylion would have been shown folded with only the face visible, is most likely false. It cannot have been shown that way for many reasons. One of the reason can be found in the texts I quote in the presentation of the Sainte Chapelle, which I keep repeating in the current discussion. That’s one reason. At least one other historian have pointed out that the image of the face we can see on the cloth held in the Abgar Icon cannot be a direct pictorial representation, but that the face plays the role of a tag: it signals the presence of an image on the cloth that cannot be readily seen. This becomes clear once you consider that several of these faces appear to float over the cloth as if not being part of it (e.g., the wrinkles do not extend on the image) or the image extend beyond the boundary of the cloth. Also, it appears rather “uncivilized” for the sophisticated Byzantine to have shown it that way. There is no historical document that points to a showing of the Mandylion that way..","date":"2015-12-07","mins":"12:29 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215912","author":"mario_latendresse","post":"O.K., As I have written several times now on this blog, and in the conclusion at http://www.sindonology.org/sainte chapelle.shtml, it is unlikely that the Mandylion was folded in such a way to show the face only. And as far as it is known from documents available to us today, it was not shown in public with any visible image, not including the face. See in particular the paragraph: “It is doubtful that the Mandylion was folded in such a way that only the face of the image on it was visible, either inside or outside of its reliquary. It was folded in its reliquary with all the image hidden, and when shown in public it was most often in the same state because it was likely bound with a trellis to keep it folded. Some depictions of the face directly on the Mandylion were simply an informative method to remind the observer that an image existed on the cloth, not that it was directly visible. For example, this method would have been used in the depiction of Abgar V holding the Mandylion (see Figure 1).” And as discussed in several places in http://www.sindonology.org/sainte chapelle.shtml this conclusion is *based on the documents* describing the Mandylion reliquary and the cloth when it is sent and arrives at the Sainte Chapelle of Paris. This is not a supposition pulled from the imagination, but from descriptive historical texts and observations. You wrote: “But the facial image of Mandylion was publically displayed at least in 944 (and perhaps in 1032)! ” Which historical document states that the Mandylion’s face was shown publicly? References? The face is seen by Constantine VII and his brothers in law, but that does not mean it is shown in public. As a matter of fact, the description is such that this appears as a private viewing..","date":"2015-12-08","mins":"1:32 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215858","author":"mario_latendresse","post":"O.K., 60×40 cm is not too small for the representation as seen on the Abgar Icon. It is the right side: the distance from shoulder to shoulder of a person is typically in the range of 50 to 65 cm. The piece of cloth shown on the Abgar Icon appears to be as long as the width the shoulder of the man holding it. So, 60 cm appears the right length for this piece of cloth, and the width is smaller looking like something around 40 cm. If you were holding a piece of cloth of 110 cm, it would not look that way. As a matter of fact, I have a piece of cloth the size of the TS and folded as described at http://www.sindonology.org/sainte chapelle.shtml#ans:small or large (that is to fit in the reliquary of the Sainte Chapelle, 60x40cm) , and when I hold it, it looks like on this icon. The folding proposed by Wilson would not fit in the reliquary of the Mandylion as described (in size) by the inventories of the Sainte Chapelle..","date":"2015-12-07","mins":"11:55 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215901","author":"mario_latendresse","post":"Daveb, indeed we have to be careful not to take the Madylion representation in this Icon as necessarily very precise. Yet, it could be very close. Second, it is Constantine VII being represented on this icon, playing the role of Abgar (see Kurt Weitzmann, The Mandylion and Constantine Porphyrogennetos, Cahiers Archéologiques 11 (1960): 163–84), which is actually obvious once you have analysed the physionomie of Constantine VII on coins and statues. Constantine VII had a narrow face, and this is what is represented. The face on the cloth is not to scale and it is not even positioned parallel to the cloth edges. I think we can conclude, and from many other such representations, that the face plays the role of an identifier of what is inside the cloth..","date":"2015-12-08","mins":"12:01 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215961","author":"mario_latendresse","post":"Daveb, you wrote “Although it refers only to the face, it cannot be the Mandylion which had been frequently displayed since its arrival in Constantinople as recently as 945.” The Mandylion was frequently displayed in Constantinople since 945? Which references do you have to support this statement?.","date":"2015-12-09","mins":"3:07 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215960","author":"mario_latendresse","post":"O.K., you wrote “Meanwhile, I await your comment for that illustration: http://tinyurl.com/zpozqbb Chronography of John Skylitzes, cod. Vitr. 26 2, folio 131a” I am not sure what specific point you want to raise with this particular drawing of the Mandylion. Its size? It appears small. Is that problematic? But the face on the cloth is certainly different to the one on the Abgar Icon, which supports the observation that the artists of these paintings are not reproducing a face they saw on the cloth, but rather that they are making a point: there is an image in the cloth. They are many other such miniatures where the faces on the cloth are different from each other. Again, I repeat that it is unlikely that the Mandylion was shown with a face visible. No such public showing was recorded, as far the documents we have today tell us..","date":"2015-12-09","mins":"3:03 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216140","author":"mario_latendresse","post":"Colin, sorry, but the English translation reads “the ancient chest containing the divine image was enclosed behind doors”. It is the chest that is enclosed behind doors. The image is already in the chest. You would need to go back to the original Greek text to argue otherwise..","date":"2015-12-10","mins":"11:46 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216080","author":"mario_latendresse","post":"The Narratio de Imagine Edessena, which can be read from Mark Guscin’s book (https://books.google.com/books?id=Idt Hu Gi6szg C&pg=PA61&lpg=PA61&dq=many+different+opinions+have+been+handed+down+to+us+about+the+divine+form+of+Christ&source=bl&ots=p KUIBQ Dq GX&sig=WMHJOKW2llk7bqn8b W Bzeu D Fv Q&hl=en&sa=X&ved=0ah UK Ewj q Ivjr NDJ Ah UD GMKH Qcr DAYQ6 AEIHDAA#v=onepage&q=many%20different%20opinions%20have%20been%20handed%20down%20to%20us%20about%20the%20divine%20form%20of%20 Christ&f=false) relates stresses the opposite of public display of the image itself, reinforcing the observations that very few could see the image on the Mandylion and that the face would not be visible even when kept in its reliquary. For example, we can read (using Guscin’s translation from Greek) “A throne was set up and the sacred image of Christ and God, which was not made by human hands, was wrapped in white linen and placed on the throne.” “When the sacred procession was over, they took the image to the sanctuary, while the people followed behind singing Lord have mercy. The holy and undefiled image was placed in the innermost recesses […]” “[…] only the bishop was allowed to draw near the holy and undefiled image, to revere it and to kiss it, and then to take off the white linen cloth that was covering it and wrap it in another, purple one.” “The ancient chest containing the divine image was enclosed behind doors so that it would not be visible to everyone whenever they wanted, although these doors were opened two days every week, namely Wednesday and Friday, with fine pins of iron, that they called sceptres. The image was beheld by all the congregation, and everyone propitiated the image’s limitless power in his prayers, although nobody was allowed to draw near and touch the holy form with his lips or his eyes.” I do not see any display of the image. Only the chest could be seen and only in a limited way. The cloth itself was hidden during the procession..","date":"2015-12-09","mins":"10:49 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216188","author":"mario_latendresse","post":"Colin, you wrote “As has already been pointed out (“Joe”) the version you quote makes absolutely no sense, Mario. No one goes to watch doors being opened twice a week that simply reveal a closed chest.” Thousands of people visit the Cathedral of Turin every year to only view the case containing the Shroud (and the case is covered by a cloth) place behind a glass. The Shroud is hidden away. If something is considered very precious and holy, people are ready to see only the case, it makes sense to them. Likewise for the chest of the Mandylion. The Mandylion was not even shown during the procession in Edessa. This is taken from the text itself. You have to read the entire description to realize that only taking out the cloth out of the ancient chest was special, and it was done only once a year, during Lent. The cloth could not even be seen (it was wrapped inside two different cloths during the ritual), much less the image. The general public could not have been able to see the image twice a week afterward, during the whole year, that would be quite incoherent..","date":"2015-12-11","mins":"1:29 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216216","author":"mario_latendresse","post":"Daveb, you wrote “It seems clear enough that the Mandylion was not the cloth that was sealed in a golden case, such that all but the emperor were forbidden to view it, as reported in the Tarragon manuscript.” I do not see any text that was discussed here or that you cited that supports such a claim. Perhaps, you are thinking that the discussion on this blog about the “Narratio de Imagine Edessena” implies that the Mandylion was regularly taken out from its chest in Constantinople. This is not the case because that particular text under discussion refers to the processions of the Mandylion in Edessa, not Constantinople. Furthermore, in the text you cited, “Symeon Metaphrastes recites that, upon the arrival of the Mandylion in Constantinople, “everyone was looking at the marvelous image of the Son of God on the holy cloth … “, the “everyone” does not refer to the masses at Constantinople, but rather of the people at a private viewing of the Mandylion where the two sons of Romanos, Constantine VII, and some other officials are present. Some historians even consider that this text is metaphorical because it refers to the inability of the sons of Romanos to distinguish important features of the face. But in any case, only a few people are present at that viewing. The procession that occurs at Constantinople in 944 does not state that the Mandylion was shown to the population. It was carried around the city, and it does not imply that it was shown. Furthermore, the Tarragon manuscript that you cites, written by a pilgrim, does not necessarily recount the locking up of the a cloth up to the 12th century. In all appearances, the golden case mentioned by that pilgrim refers to the case containing the Mandylion, not another relic..","date":"2015-12-11","mins":"12:36 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-89087","author":"mario_latendresse","post":"With three o’s in a row, a y, and a i, sindonology (and its counter part sindonologist) is also difficult to spell correctly. In some cases falling into an entirely different field of study. We see sindonology in various forms on the web: 1) sindonogy https://shroudstory.com/2014/02/04/the two lirey badges unmistakable differences/ https://shroudstory.com/2013/08/22/google mccrone and my dog/ 2) sindonoly http://www.cirac.org/teledoc/Engine3/frame Sites.htm 3) syndonology, syndonologi http://www.sundaytimes.lk/980405/plus9.html and probably ten of thousands other pages. 4) sindology (which is a different field of study) http://www.encyclo.co.uk/define/Sindology http://www.economicswiki.com/tag/sindology wiki/ 5) sindonlogy http://shrouduniversity.com/osucon08/abstracts/kennethstevenson.htm http://tonylayne.blogspot.com/2013 03 01 archive.html#.Uy P KF6a Jh Q and probably a few thousands more places on the web. 6) … But sindonology is here to stay. I just wish it was in people’s computer dictionary (including mine)..","date":"2014-03-15","mins":"3:36 am","url":"https://shroudstory.com/2014/03/12/wouldnt-you-know-it/","cat":"news_&_views","title":"Wouldn’t You Know It"},{"id":"comment-215759","author":"mario_latendresse","post":"Colin, you wrote ” I gather that that the TS has never been weighed, but from taking samples (radiocarbon analysis etc) and scaling up, the estimated weight is in the region of 9 kilos.” Sorry, not 9 kilos! The radiocarbon dating sample had an average of approximately 21 mg per cm^2. The TS has a size of approximately 113cm x 430 cm. For that size, we get 0.021*113*430 = 1020.39 g. This is just slightly above one kilogram. I have a linen cloth of that size and it weighs very close to one kilogram. This is far from the 9 kilos you mentioned. But talking about physics of the Mandylion and whether or not it was a single sheet or a folded sheet, please look at the “Abgar Icon”, where Abgar, represented as Constantine VII, is holding the Mandylion. The right hand is under the Mandylion and the left hand is holding one corner. Can a single layer sheet of linen of that size be held that way without having the sheet slide down from your hands? It cannot. Can a single layer sheet looks that way? It cannot has the corner would crumple down. But, this is the way it looks if you take a sheet of the size of the TS, fold it to the size seen on this icon, and hold it that way..","date":"2015-12-07","mins":"12:09 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"}]
