[{"id":"comment-162227","author":"mario_latendresse","post":"Hugh, you wrote: “I have demonstrated evidence against authenticity, and in favour of a 12th or 13th century origin, which I personally find persuasive, but I fully accept that others do not.” A reference to a document collecting this evidence would be helpful. I do not remember to have read any clear “evidence against authenticity, and in favour of a 12th or 13th century origin”, besides the carbon dating, from you..","date":"2014-10-14","mins":"1:34 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-12104","author":"mario_latendresse","post":"The hypothesis that the banding effect is due (solely) to a different linen thread used (either due to differences of impurities left on the thread or of a different growth condition of the linen) must match the weave pattern in almost all cases of banding effect found on the Shroud. There is a major problem with this since there are banding effects that do not match the weave pattern. For example, in the face, we can readily see banding effect that are less wide than one column of the Z weave pattern. Whatever the thread pattern used to create the cloth of the Shroud, the difference in linen thread cannot explain that particular banding effect..","date":"2012-06-09","mins":"1:39 am","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12084","author":"mario_latendresse","post":"Marcel Alonson was not present at the 2005 Dallas Conference as I was there and never saw him at the conference. I actually was looking forward to meet him but unfortunately he was not present. But, he did send a paper for a presentation although he did not present it. I do not see how digital image processing can differentiate between a coloration due to a modification of the linen fiber vs coloration of impurities on the fibers. Moreover, there is no demonstration from Alonso’s paper that such digital image processing could show such a differentiation, so everything written about this possible differentiation from digital image processing is speculation. Besides, the darkened area around the face can be partly due to the distance between the cloth and the face itself. It just happens that if you loosely lay a cloth on a face (the head laying on the ground) with lots of hair, the cloth could come in contact with the hair and the cheek but in between there is a crevasse made of the gap between the cheek and the hair. See my paper from the Dallas conference on this subject. Other factors might play a role in this darkened area around the face, but if coherence is maintained, the distance between the cloth and the body partly explains the darkened area around the face..","date":"2012-06-08","mins":"7:26 am","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12115","author":"mario_latendresse","post":"Reply to Colins #39 You appear to be unaware that a large collection of high definition photographs and macrophotographs were taken in 2002 (during the restoration) and in 2008 by haltadefinizione. See http://www.haltadefinizione.com/ and search for Shroud. In any case, you can see the weave pattern versus the discoloration due to banding effects at dshroud.com using the Shroud Scope..","date":"2012-06-09","mins":"12:04 pm","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12108","author":"mario_latendresse","post":"Why do you address such demands (high definition photographs) to David Rolfe when actually the largest collections of high definition photographs and macrophotographs is under the control (and ownership) of the Turin authority ?.","date":"2012-06-09","mins":"5:48 am","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12122","author":"mario_latendresse","post":"And you misunderstand what I meant when I refer you to haltadefinizione.com. I do not mean that you will find high definition images readily downloadable free of charge from that website. I am saying that haltadefinizione have high definition images, probably better than what David Rolfe could ever be able to provide you (even for free). You need to order them from haltadefinizione. What I am getting at is that you appear to attack one particular person (David Rolfe) but in fact the best macrophotographs are not in the hands of David Rolfe. Far from it..","date":"2012-06-09","mins":"4:53 pm","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12121","author":"mario_latendresse","post":"Have you looked at the Shroud Scope? http://www.sindonology.org/shroud Scope/shroud Scope.shtml. You did not say so in your reply. I can readily see the relation between the weave pattern and the banding effects from the Shroud Scope when you magnify to the highest level..","date":"2012-06-09","mins":"4:49 pm","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"}]
