[{"id":"comment-21577","author":"mario_latendresse","post":"You misunderstood (comment #11) what was written in my paper. Unfortunately, you (Yannick) do not quote my paper. So we have to read your interpretation of it, not my original writing. Obviously, bloodstains on the Shroud are due to contact with blood! Stating otherwise would be idiotic. By definition, a bloodstain is due to contact with blood! Nowhere in my paper do I state that bloodstains are not due to contact. So, I do not understand why you are stating otherwise. On the contrary, my paper says that the bloodstains prove that the Shroud cannot have undergone a complete loosening or flattening during image formation after being in contact with the blood on the corpse, since that would create major incorrect vertical alignments of the bloodstains vs the images. That’s the main point. All the details are in the paper. There are many other points which you are quite wrong in the interpretation of Lavoie’s published work. For example, Lavoie never used the argument that the blood cannot come from the hair due to a lack of pressure. Indeed such an argument would be expected, but he did not use it. Can you provide a quote from Lavoie’s papers (Shroud Spectrum or the Frascati conference), on the subject of the bloodstains around the face, that states that you need a significant amount of pressure to transfer the blood from the hair to the cloth? In essence, Lavoie does not prove that the bloodstains cannot come from the hair, he proves that they can come from the face. This is quite different. But to do so, he does not analyze the problem of the vertical alignments of the bloodstains vs the images and at the end has to rely on a supernatural flattening of the Shroud to “explain” the phenomenon because indeed it no longer makes geometrical sense..","date":"2013-01-03","mins":"10:31 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-21584","author":"mario_latendresse","post":"To continue my answer to comment #11, you wrote “you really seemed to favored some supernatural process to explain the image”. I think this is a contradiction of terms. I do not see how you can “explain” a phenomenon by relying on a supernatural process. By definition, a supernatural process has no explanation attach to it, since if you had an explanation of that process it could not be called “supernatural”. In any case, I will try to explain what I think of Shroud research. Essentially, the artifacts (images, bloodstains, water stains, etc.) found on the Shroud can be studied in very precise terms. And you can formulate some possible explanations about their formation. You could say for example: “this image is created by the deformation of the linen fibrils”, or “this image is created by biochemical reaction X on compounds Y and Z found on top of the linen fibrils”, or “it is possible, by using a laser of frequency X at energy level Y to modify the linen fibrils as found on the Shroud”. But in all cases it may not be possible to state more precisely how these phenomenon did happen in the context of the Shroud covering a corpse in a tomb. All scientific theories have limits in their power to explain and predict. It is true for General Relativity (it does not work at the nuclear level), for the Big Bang theory (where does the energy of the Big Bang comes from?), evolution (how did the first bacteria originated, was DNA or RNA from out of space?), and so on. This is going to be the same for the Shroud and its images. Late in his life, when Rogers worked on formulating a theory to explain the images on the Shroud, he relied on the Maillard reaction. This was for a good reason since the coloration of the impurities he found on the fibrils were similar to the products of a Maillard reaction and such a reaction could occur at low temperature given enough time. On the other hand, he was aware of the limitation of that theory since it was difficult to explain how to form precise images based on heat convection. This is the limit of that theory. It explains some observations, but not some others. We could simply say “the color observed on the fibrils is very similar to the color we would find if a Maillard reaction occurred on the impurities that were detected”. And that’s quite interesting in itself. But some other researchers are not so convinced that there is not a better explanation. They try other experiments to show that other type of physical phenomenon could create a similar color on fibrils. This is research: You try different routes so that you might actually go as far as possible in covering the observations. In some cases, these experiments are done to simply show that the coloring is possible despite what some other researchers have written. I think this is the case of Di Lazzaro and his colleagues at ENEA: I think Rogers stated that a laser could not produce such a coloring without destroying the fibrils. They wanted to show otherwise. And I think they succeeded for that specific goal. (Of course, the media got into it and turned things around completely, creating a huge confusion.) In the case of Giulio Fanti, his corona discharge experiments were also to show that a similar coloring is possible. This is research. But to remain coherent, we also have to admit that the phenomenon and circumstances that created the Shroud images are quite unique and probably very difficult to reproduce, if reproducible. This is so since we essentially have only one (recorded) such shroud in the history of mankind. If the phenomenon we are proposing occurs frequently, then it is suspicious that this phenomenon is the right one since we should have more shrouds like the Shroud of Turin. On the other hand if we propose an experiment that we cannot (ethically or otherwise) reproduce, that cannot be useful. That’s the dichotomy of the Shroud. In essence, Shroud research is quite uncharacteristic compared to many other fields since you have to find some phenomenon that cannot happen on a regular basis but also that you could reproduce. I hope my answer was not too convoluted! And I hope to see real research around the Shroud, not continuous bickering and personal attacks..","date":"2013-01-04","mins":"3:05 am","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-21517","author":"mario_latendresse","post":"Was a pun on the word pity intended? Sorry if not, but I thought it was truly clever!.","date":"2013-01-03","mins":"3:09 am","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-21572","author":"mario_latendresse","post":"Sorry, but please do not claim to know what I think or believe. To ascribe to me some unscientific way to study the Shroud is very ironic given the fact that you recently went on a rent about my posting regarding Lavoie’s hypothesis which is based on a supernatural event. You are missing the big picture about the paper I presented at Dallas in 2005, since it prominently shows that there is no such need for a supernatural event to get proper images on the Shroud and have bloodstains being transferred. Can you pinpoint some unscientific way to study the Shroud in that paper?.","date":"2013-01-03","mins":"7:01 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-216610","author":"mario_latendresse","post":"It is a beautiful website. The documentary is very well done. The French version is also very well written. One downside though, is the historical part with the Templars. This is a very speculative scenario. There is almost no historical documents to support it..","date":"2015-12-15","mins":"4:14 pm","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","title":"David Rolfe’s Website"},{"id":"comment-93319","author":"mario_latendresse","post":"Charles Freeman wrote (#10) “Wilson tells us that the Image of Edessa was folded tetradiplon […] Although the word is not known elsewhere we have c.150 examples of Greek words with the prefix tetra. The most likely meaning is that the cloth was folded double four times, making sixteen sections.” Actually, the meaning of tetradiplon most likely represent the final state of the cloth not the process to reach that final state. If you see four doubled layers, you have eight layers. This is what Wilson was explaining. And it gives the correct dimension to only see the face of the Shroud. For example, the expression “To be paid back four fold” does not mean that four operations of repaying is done, it means that the amount paid back is four times the initial amount. You could do this by any number of payments from one to whatever number: 100 payments, …, three payments, two payments or just one. The process is not important, the final result is. The same thing applies for all words starting with “tetra” I can think of: it represents the final state, not the process to reach it. Otherwise the term is too ambiguous because there are many ways to reach a final state..","date":"2014-03-26","mins":"12:49 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93678","author":"mario_latendresse","post":"Charles Freeman (#31) writes “Has Mario looked at a Liddell and Scott Greek Dictionary to see the possible meanings of ‘tetra’ as a prefix? The most likely meaning is that there has been four double foldings […]”. You have not addressed the main point I made: tetradiplon most likely applies to the state of the cloth, not the process to fold it. For example in English, a “tri fold brochure” is a piece of paper that has two creases, that is, folded twice, to create three layers. It is NOT folded three times. The tri in “tri fold brochure” applies to the final state of the paper not the process of creating that brochure. Likewise, the Greek word tetrarch refers to the governor of one of four divisions of a country or province, not to a country that would have been divided four times (which may represent a very small division of a country depending on how you applied these four divisions). Charles, have you looked up the Liddell and Scott Greek lexicon and spotted a word with the prefix “tetra” that would describe a process done four times and not represent the final state of that object? I have not found any clear case. It is now on your side to provide such a Greek word. Until then, there is plenty of evidence that tetradiplon refers to the final state of the cloth not the process of folding it..","date":"2014-03-26","mins":"8:53 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93872","author":"mario_latendresse","post":"Charles Freeman writes (#37) “[…]I agree with you that tetradiplon refers to the final state [..]. So actually you and I agree, it is Wilson who brings in the question of process. [..]The problem is not only Wilson’s muddled illustrations of the process.” Ok, we agree that tetradiplon refers to the final state of the cloth, which means that according to that word there are EIGHT (8) layers which FITS the final description given by Wilson. (You previously kept writing that there must have been 16 layers.) That means the Mandylion’s size corresponds to the Shroud as a TETRADIPLON. That is the main point. Honestly, I think you are misreading Wilson’s description. Yes, he describes a process to REACH the final state, but this is to illustrate one of the possible process (and I think there are more appropriate ones, in particular regarding the protection of the image). The final state is the major point in his description. Certainly, it would have been instructive in Wilson’s book to show the side of the shroud to see the EIGHT layers. As I just mentioned there are many such possible folding in eight layers and there are some in particular that would be such that the entire image is not visible to protect it AND at the same time could easily converted to look like the Madylion without ever seeing most of the rest of the image. That appears to me the most likely way the Shroud was stored and shown to important imperial visitors and perceived as the Mandylion..","date":"2014-03-27","mins":"10:16 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93173","author":"mario_latendresse","post":"Charles Freeman wrote “No one ever came to his [Wilson] defence about the mysterious four folding of the Image of Edessa which would have to be folded into EIGHT to fit his theory.”. What exactly, in terms of measurements and folding (numbers and orientation), does not fit “his” theory?.","date":"2014-03-25","mins":"4:06 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-162350","author":"mario_latendresse","post":"Max: ““headdress”/skullcap kept in Carcassonne”. Isn’t rather the “Coiffe de Cahors” you are referring to?.","date":"2014-10-14","mins":"12:20 pm","url":"https://shroudstory.com/2014/10/14/dj-vu-squared/","cat":"critical_summary","title":"Déjà vu Squared"},{"id":"comment-162347","author":"mario_latendresse","post":"100% carbon as a crystal structure, clear and transparent (think diamond), not really black. Yes, it is far fetched but theoretically possible..","date":"2014-10-14","mins":"12:06 pm","url":"https://shroudstory.com/2014/10/14/dj-vu-squared/","cat":"critical_summary","title":"Déjà vu Squared"},{"id":"comment-162360","author":"mario_latendresse","post":"Industrial production of diamonds require high temperature and pressure, as nature produces it, but carbon can form various other crystal like structure like graphene (which is transparent). Apparently, you can make some with a household blender: http://www.techtimes.com/articles/5859/20140422/graphene mass production now possible says irish scientists what does this mean for the technology industry.htm So what would happen if you could produce quite a large number of these thin layers of graphene? Again, I point to a theoretical possibility..","date":"2014-10-14","mins":"1:15 pm","url":"https://shroudstory.com/2014/10/14/dj-vu-squared/","cat":"critical_summary","title":"Déjà vu Squared"},{"id":"comment-213703","author":"mario_latendresse","post":"The historical part regarding the Sainte Chapelle of Paris and the Mandylion is fundamentally wrong in that document (A Critical Summary of Observations, Data and Hypotheses). First we read: “The Relics of St. Louis of France. In 1238 the French King Louis IX, the future Saint Louis, paid a ransom to the Venetians for the passion relics that were taken from Constantinople and that were then in Venice. On 10 August 1239, the king, followed by a great procession of mounted knights and a parade of brilliantly decked out citizens, welcomed more that twenty relics in Villeneuve l’Archevêque. Among the relics was a cloth said to have a facial image of Jesus, the Mandylion.” But in 1239 only the crown of thorns arrives in Paris. The Mandylion, arrives either in 1241 or 1242 in Paris. As a matter of fact, the 22 relics arrive in France by three different translations. And, at no point in the documents of the Sainte Chapelle known to us, or the formal document ceding the relics to saint Louis, do we read that it was observed that there was a facial image on a cloth as part of these relics. It is more subtle than that. Second, and most importantly, that document (i.e., A Critical…) keep repeating what many others have written without analyzing the documents of the Sainte Chapelle by declaring that the cloth received as part of the relics was destroyed at the French Revolution. All documents of the late inventories of the Sainte Chapelle mention an image at the bottom of the reliquary, not on the cloth. The cloth that was in that reliquary most likely disappeared much before the French Revolution. I doubt that the authors of this document (i.e., A Critical …) consulted the documents easily available to all: the inventories of the Sainte Chapelle describing the relics of the Grande Châsse received from Constantinople..","date":"2015-10-27","mins":"11:29 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213731","author":"mario_latendresse","post":"Hello Piero, You asked: “But I would also be curious to know what is the idea by Alessandro Piana regarding your “thesis of the Sainte Chapelle”. I am certain that Mr. Piana does not like it. Interestingly, Mr. Piana sent me a private email asking me not to ever consult his Academia web page! Because I wrote a web page that stated that the theory of Othon de la Roche is very unlikely. Mr. Piana never asked any questions or have any discussion with me. This is not a very serious behavior. Mr. Piana proposes the theory of Othon de la Roche who would have owned the Shroud and bring it back from Greece, as stated by many others. Likewise, this document titled “A Crtitical…” proposes that the history of the Shroud goes through Othon de la Roche. But the theory of Othon de la Roche is very unlikely because that theory originates from a manuscript (written in French in 1714) that made many false statements and made up the theory that Othon de la Roche brought it back from Greece. These false statements were continuously repeated by many authors since that time, until now. It is now still repeated by such document as “A Critical …” without consulting the original source of that theory. Did the people that proposes the theory of Othon de la Roche ever realized that it was first proposed by this 1714 manuscript? Did they realize that it contains many false statements regarding Othon de la Roche and the Shroud? Did they realize that the author of that manuscript is well known to have made up historical stories? As far as I know, they did not..","date":"2015-10-27","mins":"11:48 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213835","author":"mario_latendresse","post":"O.K., you wrote “Clearly, the author of pro authenticity part of MS826 found some rumor about that, and tried to back it up with some spurious sources.”. Rumors to spurious sources do not make a strong case. You have to read some parts of the MS826 manuscript to realize that it is very unreliable. The author of that manuscript is now known. He made up fanciful stories about other historical facts. He is totally unreliable. Of course, he also wrote fanciful statements about the Shroud of Turin to discredit it. In a few words: it is obvious once you have read that dissertation that he made up the claims about Othon de la Roche. There is not one document that he cites that backs up what he is claiming. Is that not enough? And, again, this is not emphasized by the document written by Dorothy Crispino: all authors after that manuscript relied on these false statements. This is essential to realize that. The Ray Castle: it is a very weak evidence because it all appears to be a modern construction. I talked to people who talked to the last descendant living at the castle, countess Diane Régina de Salverte: she is tired of being asked anything about the Shroud. It is obvious to me that she does not even believe in that story. If there was an old tradition about the Shroud being at that castle there will be some stories in the family, some documents. But nothing! The coffer? It is first ill adapted by its size to carry the Shroud. And what is the tradition about it? The family has nothing to say. The replica of the Shroud at the castle? This is not even a replica of the Shroud of Turin, but of Besançon! The Ray castle proves nothing. And what the clerics at Lirey wrote: the Shroud came from Philip VI. What does the son and grand daughter said: it came from Geoffroy de Charny. Look at the inventories of the Sainte Chapelle and everything becomes clear: the Shroud was there and it was given to Geoffroy de Charny from the king of France. It is a much simpler and reliable scenario compared to the theory of Othon de la Roche because it is coherent with much everything else that is considered reliable. There is a huge difference in the quality and accuracy of the documents. The Templars? Unreliable. One of the problem is that many of these documents are written in French and many modern researchers that build these theories could not directly read them. But it is necessary to read very carefully the documents written by the clerics of the Lirey chapel, the inventories of the Sainte Chapelle of Paris, the manuscript MS 826, etc..","date":"2015-10-29","mins":"11:08 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213868","author":"mario_latendresse","post":"T2, the Ray Castle having a coffer that would have been used to transfer the Shroud (from whichever place), is largely unsupported. I am in contact with the librarian of the Ray Castle, (Jean Richardot), who has been working with the countess for a very long time. He has never heard or read anything that would backup the claim about this coffer. He currently does not know any document from the family archive that would support the current claim. The countess (Diane de Salverte) is largely uninterested in these matters and cannot provide any information about this coffer. Jean Richardot does not believe that the castle ever had the Shroud. I asked Mr. Richardot to try to find some references about the origin of the coffer at the castle. We cannot count T1, T2 and T3 as independent.T2 is likely a product of T1, and since T1 is fanciful and most likely precede T2, T2 can only be taken as a byproduct. T3 happens a long time after T1. So T1 appears as the culprit in producing T2 and T3. You also have to explain how the Shroud would have been transferred from the la Roche family to the Charny family. And there, it is even more difficult. As for T3, it should be analyzed more carefully, but it does not say that Othon had the Shroud, so it might be unrelated to the Ray castle. My current take of it: it is a forgery and should be analyzed with that hypothesis in mind..","date":"2015-10-29","mins":"5:44 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-214036","author":"mario_latendresse","post":"O.K., “Are you sure T1 occured first, then T2, then T3? Can you give dates (or period at least) when T2 and T3 were fabricated? And by whom, for what purpose?” What I meant: from what we know for sure, T1 first occurred, then T2 because there is no known statement regarding that fact before the 20th century (none that I am aware of), and the document for T3 was discovered in 1981. As I already wrote, we have to confirm T3, it might have been a copy done before T1, which then would prove that it cannot depend on T1. But until it is dated, we have to be careful declaring genuine, be cause we know that what is being written in T1 is fanciful. As for T2, the only confirmation we have is that the coffer was presented as such in the 20th century. Researchers who say that it is a tradition of the Ray family that this coffer was used to transport the Shroud cannot give any reference. Is it a statement from the current owner of the castle? Who in the Ray family says so? The current owner cannot confirm anything and the current librarian cannot confirm anything either. The archives of the castle could be searched, but currently the coffer is a very weak element. By whom? We do not know. For what purpose? We can only imagine, but as for T1, someone is trying to get some attention, and why not some nice publicity for the a family? For a castle? “As for the Golden Bull, it says only that there was allegedly some undescribed “sanctam toellam” which is “tabulae insertam”. It says nothing what this cloth (if there was actually any inside, which is not certain) was, less it was a Shroud.” “sanctam toellam tabulae insertam” means “a holy cloth inserted in a table”. So, I do not see on which basis you write “if there was actually any inside, which is not certain”. So, according to you the text is not clear that there is a cloth inserted in a table? Now, if you look at all inventories of the Grande Châsse, this “table” is the reliquary described as a box with the known dimension well described by inventory R. This identification can be done by a simple one to one correspondence of all relics and reliquaries described in the Grande Châsse with the relics listed in the Golden Bull. “And still you have to think out how the Shroud allegedly disappeared unnoticed from the reliquary inside well guarded Sainte Chapelle. This sounds ridiculous.” This is not ridiculous at all. I think you are not aware of some essential and well known historical facts about the Sainte Chapelle, the relics, and what the King of France could do with these relics. The King of France had absolute control of the relics of the Grande Châsse, he considered these his own possession. This is extremely well attested historically. He could give parts of relics to whoever he wanted without the permission of anybody else and without reporting it to the clerics of the Sainte Chapelle, if he wanted it to be so. This is well known. “Finally, the clerics could not analyzed the relics without the permission of the King because he kept all the ten keys to open up the doors of the Grande Châsse[p. 17, Troche, 1855]. This was the case until the fire of 1630, which is after the time the Mandylion had apparently disappeared from its reliquary.” The King could take any part of a relic and gave it to whoever he wanted, if the need was there and the clerics would not notice for a while. As a matter of fact, you can see the confusion occurring at inventory L where they can no longer clearly find the content of the Mandylion reliquary. Something really strange occur during this inventory. It is even possible that the clerics did not look inside the reliquary for a very long time (many decades), because there was no need to do so. The inside of the reliquary of the Mandylion has never been described by anybody besides the clerics and they did so very rarely are far as we know. There is no known exposition of the inside of the Mandylion reliquary when it was at the Sainte Chapelle. Not one. Also, please read the section http://sindonology.org/sainte chapelle.shtml#ans:clerics notice I think you need the read the entire exposition of the five questions in detail, because I am essentially repeating what is written there. I have addressed what you have raised in that document. The King and the clerics appear unaware of what that cloth is. The Latins have no idea that a cloth with an image of Christ existed in Constantinople. Robert the Clari is an exception. This is obvious once you have studied the appearance of the legend of the Veronica..","date":"2015-10-31","mins":"8:59 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213939","author":"mario_latendresse","post":"O.K., I think we will have to disagree on many of these points. But here is a few answers: You wrote: “Haven’t you considered the opposite way? That the author of T1 actually obtained the info about Otto from his descendants living in Ray Castle, and then manipulated some sources to provide “documentation”? It is also conceivable scenario.” No this scenario is not conceivable. The author of MS 826 was desperate to find any documentation that would have supported his claim. If he had gotten from the descendants of Otto any information in favor of his thesis (the Shroud of Besançon is authentic) he would surely have done so. Don’t you think? Instead he is making up and distorting information. You really need to read the entire MS 826 dissertation in favor of the Shroud of Besançon to get a sense of what this author is saying. Then, count the number of true supporting facts and the distortion he is presenting about many of these facts. That source is totally unreliable. Now you are thinking that he might have had some genuine information. You wrote: “The castle actually is about 40 km away from Besancon, that’s relatively far for pre automobile society, a day or two walk from the city. ” I drove from Besançon to the Castle of Ray sur Saône. It was 51 km using the departmental roads. But this is largely irrelevant. You wrote: “Yeah. So where are documents ascertaining us that the Shroud (not alleged Mandylion) was actually in Sainte Chapelle? Besides one thing can be sure: had the French King been aware ownership of the Shroud, he would never let it go out of his hands. This is nonsense.” Of course, there is no explicit mention that the Shroud was at the Sainte Chapelle. You need to read all the inventories to realize one essential element: the clerics received the Mandylion (convince your self by reading the inventories, which I translated on my web page), then they describe it without knowing anything about the Mandylion. That points to a clear fact: the Mandylion is totally unknown from the Latins in the 13th century. This is a subtle point that transpires from the inventories. Read the inventories, you will see. Cheers..","date":"2015-10-30","mins":"4:37 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213928","author":"mario_latendresse","post":"O.K., You wrote: “Fine. You claim that someone invented the story of Otto in obscure MS826 (T1).” Note that it is not “someone”, but the author of that manuscript. The “obscure” MS 826 is no longer that obscure. The author is known, the year of its redaction is known. And we can trace the story of Othon from all subsequent authors to that manuscript. This is important to realize that main point. Nothing points outside of it in terms of *all* the literature that was written about Othon and the Shroud. I think that you are thinking that the coffer was at that castle since a long time ago (15 17th century). There is essentially no proof of that, and everything looks like it is a recent modern addition of that coffer shown to the visitors to the castle. One clue is the plaque nailed to it (the plaque really looks modern): why would you do that to a very old coffer? The addition of a copy of the Shroud of Besançon in the castle is another clue that it is a modern addition to the castle. It most likely is a 18th – 19th century copy, which could have been put there in the 20th century. So the set up appears as an idea of previous owners who heard of the story propagated by T1. When was the coffer put in the castle? Currently nobody knows with precision, but again, the current owner has no idea and there is no one piece of family tradition that shows that it was there for a very long time. No document from the archive. Sorry, I keep repeating it: all current knowledge about the coffer points to a modern (probably 20th century, perhaps 19th century) addition. You ask: “Do you believe that the coffer was deliberately installed (or labelled as used to transport the Shroud) by some conspirators to back the claim that Otto once had the Shroud?” It is not a “conspirator”. The placement of the coffer did not occur at the same time that the MS 826 was written. Again we have no reliable source in the family archive stating when the coffer was labelled as such. It is conceivable that it is one of the owner of the Ray castle who probably started to believe in the story of T1 and guessed that this could be the coffer used. And again: How do you explain the transfer from Othon to Lirey? All transfers that I am aware of contradict reliable statements made by the son and grand daughter of Geoffroy de Charny. On the other hand, the Shroud going through the Sainte Chapelle have none of these difficulties with extremely reliable documents: inventories of the Sainte Chapelle having a strong pedigree. And strongly reliable historical events (the transfer of the relics from Constantinople). It is a world apart from such scenario as Othon de la Roche. As for T3, it shows up recently (1981). That is what I meant about T3 being much later than T1. So, it appears suspect considering that T1 is a made up story. What is the age of this copy (letter to Innocent III)? We do not know. It could be modern. A close study of it should be done..","date":"2015-10-30","mins":"11:31 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213947","author":"mario_latendresse","post":"O.K. “Do you believe in two corresponding forgeries in two obscure documents from about 18th century 1000 miles away from each other?” I have answered that already. There are not two forgeries. Which two forgeries are you referring to? The MS 826 is not a forgery. It is written by a completely incompetent historian. The letter to innocent III: it needs to be analyzed more deeply and dated. But the existence of T1 which makes up the story about Othon is enough to put major doubts in that story. Again: the coffer at Ray castle is far from a proof. The person that probably knows the most about it is the librarian at the castle. I have talked to him: there is no proof (no document and no tradition in the family) that this coffer was used to transport the Shroud. It appears as an invention from someone in the Ray family. Would like to verify that with him directly? You wrote: “Haven’t you considered the fact that when the reliquary reached Paris about 1241, it was already empty? Emptied in 1204. That’s why the clerics actually knew nothing about what was stored inside before. Because I am sure they would have noticed, if not the image, then the bloodied cloth at least inside.” Of course. This is an explicit point I discuss on the web page about the theory of the Sainte Chapelle: showing that the Mandylion did read the Sainte Chapelle. See http://sindonology.org/sainte chapelle.shtml#ans:mandylion reach. I do not assume that this the Shroud of Turin. See the five clearly separate questions with answers on the web page http://sindonology.org/sainte chapelle.shtml. Search for “Did the reliquary of the Mandylion reach the Sainte Chapelle?”. Then you can read all five questions with answers. This is the central discussion of this web page. The rest is there to support these answers, answers the objections that many have raised (that you may also have), or add elementary information about the Sainte Chapelle. In Constantinople there might have been other cloths used in Jesus’ tomb (or claimed to be), but only one had an image: what Robert the Clari saw, which is conceivably the Mandylion..","date":"2015-10-30","mins":"5:27 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213956","author":"mario_latendresse","post":"O.K., I think that you are not convinced that T1 has been written by someone who made up the story about Othon. This is why you still think that this story is possible. I believe that reading the entire manuscript might convince you (you know that I transcribed the manuscript and that an electronic copy is available. It is in French). It is actually essential to read it if you want to claim that the theory about Othon is likely true. T1, T2 and T3 are not known to have been done at the same time. So, your claim that they were done simultaneously is a major assumption on your part. What do you need to be convinced that the coffer has no documentary support and that it is very likely a modern invention? Would a statement from the countess or the librarian of the castle be enough for you? As for the Mandylion, you forgot the most important element: the Golden Bull of Baudoin II. It states that a cloth was in the reliquary. That document was written in 1247, six years after the reliquary of the Mandylion was received in Paris, and given directly by Baudoin II to Louis IX and the clerics. They would not have verified what that document says compared to what they had? Very unlikely. It is very unlikely that did not receive the cloth. Also, inventory L is referring to a previous inventory (which we no longer have) which has the word “toile” in it to describe the content of the reliquary. There was therefore a cloth in the reliquary seen by the clerics of the Sainte Chapelle..","date":"2015-10-30","mins":"7:21 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213837","author":"mario_latendresse","post":"Hi Robert, The Mandylion has two quite separate historical traditions: as an icon and as a relic. The icon took a life by itself, but the relic was essentially never shown to the public. The Mandylion (the relic) reached the Sainte Chapelle, but that it was not destroyed during the French Revolution is also almost certain. And again, the inventories of the Sainte Chapelle must be analyzed carefully to realize that. Thanks to add a pointer to the theory of the Sainte Chapelle on my website to your document. In your document, you also point out the theory that the Shroud came to France with Othon de la Roche, and consider it to be very reliable. But this is very unlikely. This is one of the theory that is repeated by many, but without looking in details at the original documents. It lacks any reliable foundation. It becomes quite clear when you can read all the French documents, in particular the manuscript 826 of the Bibliothèque de Besançon, related to that theory. This is the source of that theory. I wrote a book in French on the subject of the Shroud of Besançon (see amazon.com or my website) with a transcription of the manuscript. In a few words: that theory exists purely on repeating false statements made in the 18th century but rekindled recently (1981) by a copy of a supposed letter to pope Innocent III dated 1205. The authenticity of that letter is questionable. And all the theories that passes the Shroud from Othon de la Roche to the Lirey chapel contradict what have been said by the Charny family and the clerics at Lirey..","date":"2015-10-29","mins":"12:10 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213994","author":"mario_latendresse","post":"O.K., I think there must be a language barrier. You keep asking the question. “Essential question, which you are avoiding to answer: Do you believe in two corresponding forgeries in two obscure documents from about 18th century 1000 miles away from each other?” I answered already. Yes, I believe so, because these events are known to us as having happened in sequence. T1 occurred, then T2, then T3. Distance is irrelevant because T1 started to be well known by the time T2 and T3 occurred. Is that an answer or not? Note that you wrote previously “What if A)? This means that all (very obscure to general public, and at least T3 is distanced from the two others) T1, T2 and T3 must have been simultaneously faked”. So you were assuming simultaneous creation of these. You wrote: “The golden bull says only about sanctam toellam, tabulae insertam and provides no details. Very unlikely had they known the Shroud of Turin was there inside. And so with the word “toile”. ” The question was not about the Shroud of Turin, but whether there was a cloth (“toile”) received in the reliquary. The Golden Bull says “sanctam toellam”, this is a cloth..","date":"2015-10-31","mins":"10:24 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213727","author":"mario_latendresse","post":"Hi Robert, Have you read the inventories of the Sainte Chapelle that mention the reliquary of the Mandylion? Did you notice that the image of the face of Christ (i.e. The Veronica) is mentioned as being painted at the bottom of the reliquary with no mention of a cloth?.","date":"2015-10-27","mins":"10:42 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-214203","author":"mario_latendresse","post":"O.K., 1) Interestingly, Alessandro Piana, in the paper you quoted previously, added this comment about the label on the coffer: “As far as the label put on the coffer, according to which the Shroud was in Ray sur Saône castle in 1206, it refers to an hypothesis guessed years ago from local historians, Dunod de Charnage and Perreciot. They stated that Othon, after appropriating of the Shroud, would have gifted it to the Besançon cathedral just in that year [40].” So, if you use this paper as a reference, it would mean that the identification of the coffer would be based on the MS 826, which is fanciful. The coffer would have no basis according to that statement. 2) Jean Richardot (the librarian at the Ray Castle) confirmed to me in a recent email that he searched the entire “chartrier” (the archives of all “chartres”) of the Castle of Ray, and the word “suaire” does not appear anywhere in it. Conclusion: there is no evidence that the coffer was used to carry any shroud..","date":"2015-11-04","mins":"12:18 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-7733","author":"mario_latendresse","post":"Yannick is making three major errors: 1) The “sedile” (aka sedillis) has been described in various ways. Seneca the Younger (4 BC – 65 AD, philosopher, statesman, dramatist) describes the sedillis as “acuta sedere cruce” that can be translated as “a sharp chair on the cross”. Seneca also describes it as “acuta crux … subdas” (Epistles), that is a sharp cross placed underneath the victim. He also writes (translation) “Do you think it’s so great to weigh down on one’s own wound and hang down from the Patibulum, stretched out while spread abroad?”. Based on this, Yannicks’ statement that the sedile could not in any way cause wounds on the butts is flat wrong. What we see on the Shroud is likely the sign of a sedile that was not mentioned in the literature in its full details, yet is close to the description of Seneca as “a sharp chair” or “sharp cross …underneath”. Sharp indeed! 2) The paper by Miller and Pellicori does not give a definitive answer about the origin of the stains under consideration. On page 79 of their paper we read: “Two small circular stains at C 7 and D 7 are mirror images and visually resemble weak scorches. In fluorescence these stains are absorbing. Note also lighter boundary areas associate with water marks.” In the Section “Discussion — Laboratory experiments” on page 84 in the context of the fluorescence photographs we can read: “Laboratory data for whole blood displayed total absorption, which is in agreement with the Shroud data” This is also summarized in Table I on page 75: “Blood, UV Fluorescent Characteristics: Highly absorbing. No color. Fluorescing borders apparent around some areas.” From these facts, you certainly cannot conclude from the fluorescent photographs that these stains under consideration are not blood stains. Miller and Pellicori data just says that it is blood. But I actually disagree that fluorescence photographs is the last word on this. It is possible that the Turin authorities have a microphotograph of these stains and that we could see, from white reflective light (i.e., no fluorescent photography), that blood is clearly involved in these stains. 3) Yannick constructed a convoluted scenario for the origin of these stains as scorch marks, totally detached from any historical event. The scenario concocted by Yannick is so improbable that almost anything else could be imagined. The stains cannot happen while the Shroud was folded due to the backside color intensities that do not match. Miller and Pellicori, of course, did not have access to the backside of the Shroud and could not see that the hypothesis of mirror scorch marks was not plausible. And Ron (commenting in this blog) pointed out a clear fact: if someone had put water on these stains, it was done with great precision, contrary to what we would expect for someone hastily trying to extinguish whatever was burning the Shroud. That by itself is not a plausible assumption. To conclude: I think that all the data that we have at the moment point to a detail that I would place at the level of the nails through the wrists versus through the palms: these are bloodstains from wounds caused by a sharp sedillis. It is (very) likely that we have yet again a clear sign that shows forgery is not a plausible hypothesis for the Shroud..","date":"2012-01-31","mins":"2:34 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"}]
