[{"id":"comment-199195","author":"leon_ward","post":"Barrie Schwortz nailed it when he said “because the research is biased by huge ideological implications”. Many of the scientists, those who believe they are smarter than everyone else because they have an affinity for physics, chemistry, biology, are blinded by their own lack of objectivity when it comes to certain subjects such as God, spirituality and faith. They will continue to kick the can down the road with missives like “it’s a fake and we must do more testing” when confronted with challenges to recreate it themselves or to definitively explain how it got there. I can say I am objective on the subject of the Shroud, and when the results of the carbon dating were published in 1988, I was disappointed, but able to accept it likely dated back to the Middle Ages. However, years later’ I ran into some of Ray Rogers studies and his opinions based on further, independent analysis (Let’s not forget, Rogers was one who believed the Shroud was a Medieval creation as he was heavily involved with the carbon dating testing). After reading what Rogers had to say, as well as people like Barrie Schwortz, plus the discovery of pollen from plants that grow only in and around Jerusalem, plus the precision of the image, I have objectively determined it’s the burial cloth of Jesus. To me the image does not prove or disprove that there is a God, nor does it prove the resurrection of Jesus, but the evidence is overwhelming that it is Jesus’ burial cloth. And, no, the first the Shroud was mentioned is not the 14th or 15th century. The cloth was mentioned way back to at least the 5th century – “the Cloth of Edessa”. The face is the exact face on the Byzantine painting known as “Christos Pantocratur”. Ray Rogers determined this when he placed the face on the Shroud over 5th century painting and found the two figures are perfect matches except the eyes are closed on the face on the Shroud and it also shows evidence of bruising and injury..","date":"2015-05-15","mins":"10:15 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","title":"An American Jew in Favor of Authenticity"}]
