[{"id":"comment-7896","author":"co","post":"Una mejor imagen de un solidus de Justiniano II, este de la colección del “Deutsche Bundesbank”.","date":"2012-02-03","mins":"6:18 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-2325","author":"co","post":"Anatomical correctness: Accetta A. Nuclear Medicine and its relevance to the Shroud of Turin. Baima Bollone.P. The Shroud under the microscope: Forensic examination Ball DA. The crucifixion and death of man called Jesus. Barbet P. La Passion de Jésus Christ selon le chirurgien. Belcet F, Filippa Borrono Bona, Manfredi, Mattio. Riflessioni del chirurgo sull ferita toracica. Bucklin R. An autopsy on the Man of the Shroud. Brillante C. La fibrinolisi nella genesi delle impronte sindoniche. Davis CT. The crucifixion of Jesus: the passion of Christ from a medical point of view. Delfín Villaláin J. Estudio de la rigidez cadavérica que presenta la Sábana de Turín. Canale M. Rilievi e considerazione sul DNA presente sulla Sindone. Caminals A. Estudio de la crucifixion según la Sábana Santa. Cappi M. La Sindone dalla A alla Z. Cinquemani N, Cicchetti S. Le dopple immagini sulle mani dell´Uomo della Sindone. Coppini L. Le lesione da punta ed il colpo di lancia visibili sulla Sindone. Rilievi di anatomia topografica e radiologica. Dellesite G. Cause fisiche della morte della Sindone: medicina e certezze. Domínguez J J. La Síndone. Estudio médico. Edwards WD. On the physical cause of death of Jesus. Fiori R. La lesioni da inchiodamento ai piedi dell´Uomo della Sindone. García Blazquez M. La búsqueda científica de Dios. Garza Valdes L. Wood remnants in the blood of the occipital region of the Man on the Shroud of Turin. Gilly R. La Pasión de Jesús. Conclusiones de un médico. Giraud F. Le Saint Suaire, étude medicale et scientifique. Goldoni. Estudio hematológico sobre las muestras del Sudario tomadas en 1978. Guillaud Vallee O. Position en opposition du ponce chez l´homme du linceoul étude critique des travaux de Barbet. H. Ur Rerhman. Did Jesus Christ die of pulmonary embolism? a rebuttal. Hynek R W. Lo que revela el Sudario a un convertido. Huisman H. The Holy Shroud of Turin. Injury of the right eye. Judica Cordiglia G. L´Uomo della Sindone e il Gesu dei Vangeli? Larato G. L´ignominiosa flagellazione secondo la Síndone: rilievi di fisiopatologia clinica. Le Bec A. The death of the cross: a physiological study of the passion of Our Lord Jesus Christ. Legrand A. Du Gibet du Golgotha a ceux de Dachau. Lavoie G. Forensic studies of the blood marks on the Shroud of Turin. Lévêque J. Le Saint Suaire revisité. Lorente J A. Examen forense al cuerpo de Jesús. Mérat P. The nailing of the feet on the Cross. Milanesio A. Le lesioni da inchiodamento agli arti dell´Uomo della Sindone. Novelli G. La Síndone un caso ancora aperto. Palacios Carvajal J. La Sábana Santa.Estudio de un cirujano. Puorrat O. The localization of the chest wound on the right side. Revidatti D. Anatomía de la Crucifixión. Las manos. Rodante S. Medico necroscopic enquiry of wounds from the crowning with thorns on a medieval painting. Comparison with corresponding image on the Shroud. Rubén Darío Camargo R. Fisiopatología de la muerte de Jesucristo. Thibault Heimburger, Le Suaire et la Science. Signorini R. Alla ricerca della prova provata. Suárez Lledó Alemany J. Informe médico legal sobre el Sudario de Oviedo y la Síndone de Turín. Solas J. Blood stains on the Shroud.Distinctive characteristics. The problem of their transfer. Truman D. The crucifixión of Jesús. The passion of Chris from a medical point of view. Whanger A. Radiological aspects of the Shroud of Turin. Wilkinson J. The physical cause of the death of Christ. – Barragán Jain, Caselli, Cameron, Clerq J M, De Vicentiis, Delgado Roig, Gambescia J, Igartus, Jewell H J, La Cava, Lagraña R, Liébana J, López Gómez L, Marchand, Michel W, Morano H, Novelli, Notowski, Pugeaut R, Sáez Rodriguez, Sava Anthony , Stroud Willian, Terraes A, Tarantini D, Valdés, Wasenar R, Willis D. Representan tan sólo la “punta del iceberg”, pues son un sinfín los médicos profesionalmente muy bien acreditados,entre los que me cuento, los que hemos reconocido en la figura del Hombre de la Sábana, cruelmente martirizado, todas las características propias de un ser humano que la Sábana envolvió, Jesús de Nazaret. Http://lasabanaylosescepticos.blogspot.com/2010/11/los medicos y la sabana.html Dr.C.Otal Vazquez.","date":"2011-02-01","mins":"6:47 pm","url":"https://shroudstory.com/2011/02/01/more-on-antonio-lombattis-latest-paper/","cat":"history","title":"More on Antonio Lombatti’s Latest Paper"},{"id":"comment-7571","author":"co","post":"El asunto de la supuesta carta de Pierre D´Arcis ( no lleva firma, no lleva fecha y no lleva sello) que el canónigo Chevalier quiso datar en 1389, se soluciona con una simple RESTA o SUBSTRACCIÓN. Escribe D´Arcis ( Paris, Bibliothèque Nationale. Collection de Champagne, v 154, fol 137) una carta en LATIN con el siguiente encabezamiento que NO se figura en la traducción inglesa de Herbert Thurston, razón por la que utilizo la traducción francesa: “Verité sur le linge de Lirey qui, après avoir été longtemps exposé à une époque antérieure, vient de l´être derechef, au sujet duquel j´entends écrire á notre seigneur Pape dans les termes qui suivent et aussi brièvement que possible”. Y después: “ ….loin de se limiter au royaume de France, cela fut répandu pour ainsi dire dans le monde entier, tellement que, de tous les points de l’univers, les peuples affluaient en masse. Pour séduire ces multitudes et leur extorquer leur or par astuce, on forgeait là des miracles en faisant mentir certains individus payés à cet effet: ils feignaient d’avoir été guéris lors d’une ostension dudit suaire, que la croyance universelle attribuait au Seigneur.” Y después: “Ceux là, quand ils virent leur ruse percée à jour, firent disparaître et recelèrent ledit linge pour qu’il échappât aux investigations de l’ordinaire; depuis, ils ne l’ont plus sorti de sa cachette pendant trente quatre ans, ou à peu près, jusqu’à cette année.” La iglesia de Lirey se fundó en 1353. El culto en Lirey fue aprobado por el obispo Henri de Poitiers el 28 de mayo de 1356. – Si hacemos la resta 1389 – 34 = 1355 ¡Cómo podía en el año 1355 haber sido expuesta la Sábana durante mucho tiempo, no limitar su fama al reino de Francia sino al mundo entero (Europa estaba con muchas guerras) y además con afluencia de multitudes…… Las fechas NO COINCIDEN con lo que la carta pretende. Puede verse el documento en Latín a buena resolución y sus traducciones al francés y al inglés en mi blog: http://lasabanaylosescepticos.blogspot.com/2006/02/traduccin latn francs del memorandum.html http://lasabanaylosescepticos.blogspot.com/2006/02/traduccin latin ingls del memorandum.html.","date":"2012-01-26","mins":"4:42 pm","url":"https://shroudstory.com/2012/01/26/promoted-comment-on-correcting-joe-nickell/","cat":"history","title":"Promoted Comment on Correcting Joe Nickell"}]
