[{"id":"comment-7809","author":"co","post":"Es DIFÍCIL entender como alguien que se titula con formación científica no comprende algo tan SIMPLE. La propiedad 3 D de la sábana que demostró el VP 8, NO consiste en que proporcione una imagen con VOLÚMENES, alturas y bajuras, del Hombre de la Sábana, sino en que esos volúmenes sean COHERENTES con la imagen de un hombre REAL. Las imagen 3 D de las quemaduras de la Sábana, con sus volúmenes, NO son coherentes con las quemaduras reales, pues las quemaduras reales SON PLANAS, es una FALSA 3 D Cualquier foto o pintura NORMAL que usted someta a un programa 3 D tipo VP 8, proporcionará siempre imágenes con VOLÚMENES que serán NO COHERENTES, falsa 3 D, con el objeto o persona que represente la foto o pintura. El VP 8, se ha repetido hasta la saciedad, NO estaba programado para ver las fotos NORMALES porque siempre proporcionaría resultados ABERRANTES, no coherentes con la realidad. “The isometric display was never intended to produce a “real three dimensional” display. A snow covered peak would look like a high, flat surface, while a rock sitting on top of the snow would look like a deep hole in the high surface. Light reflecting from a stream at the bottom of a valley would appear to be a high elevation, perhaps even higher than the snow on the peak of the mountains. Dull rocks and dark vegetation would appear to be lower than the water of the stream. In other words, objects are not as tall or short, high or low, as their reflectance of light might indicate. There is no correlation between reflectance and altitude. The purpose of the isometric display was to make it easier to follow patterns of changes in shades of gray within an image. Particularly, the light pattern changes in reflection of light from soils and vegetation near a fault line were of interest. Following patterns of soil types and vegetation types was also of interest. But in no case was there ever any indication on the isometric display of how high or low, how tall or short something was.”.Schumacher, el ingeniero que programó el VP 8. ¿ENTIENDE?.","date":"2012-01-31","mins":"8:26 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"id":"comment-7790","author":"co","post":"A estas fechas, 2012, no tenemos certeza de qué es lo que se “quemó” en la prueba del C14. Como usted creo conoce, sciencebod, el Prof.Hull ( laboratorio de Arizona) nos sorprendió recientemente publicando en su revista, Radiocarbon, que estaba en posesión de uno de los fragmentos de la Sábana que TODOS creíamos, porque así lo contaba Nature, que había sido “quemado”………..","date":"2012-01-31","mins":"4:51 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"id":"comment-7541","author":"co","post":"Yannick, para completar su comentario, un muy buen trabajo sobre sangre de Carlo Brillante, Universidad de Bologna y también interesante la bibliografía que aporta en el mismo “Bloodstains characteristics to be considered in laboratory reconstruction of the Turin Shroud” http://xoomer.virgilio.it/bachm/BRILLAN2.PDF.","date":"2012-01-25","mins":"8:12 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-7560","author":"co","post":"El Prof. Carlo Brillante ya trató el tema en 1981, “La fibrinolisi nella genesi delle impronte sindoniche”, el que usted hable de la ciencia de Mickey Mouse al referirse a Brillante, profesor de la Universidad de Bologna le da méritos suficientes para hacerse acreedor al término “bocazas”, hablar con la boca muy abierta de aquello que se desconoce…… Los muertos no sangran de modo ACTIVO, la sangre de las grandes heridas que aparecen en la Sábana, clavos y herida del costado, son producto del derrame o volcado PASIVO de sangre líquida, que no ha iniciado la coagulación, y de COAGULOS ya formados, todo ello normal en el CADÁVER cuando la sangre queda retenida o acumulada (cavidades derechas del corazón, cavidad pleural con hemotorax post mortal, cavidad y retención tras la extracción de los clavos…). En las necropsias los forenses diferencian los TROMBOS (coágulos de sangre en el árbol arterio venoso producidos en VIDA) de los COAGULOS (coágulos de sangre producidos POST MORTEM ya en el árbol arterio venoso o FUERA de él). La estructura de ambos es distinta. Si se dan las circunstancias adecuadas (entre ellas un determinado ESPESOR de la capa o volumen de sangre) se producirá la coagulación y la fibrinólisis del coágulo, en el VIVO y en el MUERTO. En el VIVO este ESPESOR es muy inusual en una herida o lesión externa porque se ponen en marchas los mecanismos de retracción de la herida y se contiene la hemorragia taponando la herida; pero cuando se produce el acúmulo en una cavidad natural con salida al exterior NO se producen las costras protectoras y SI se produce el coágulo y su fibrinólisis si el coágulo se mantiene y no es eliminado ( coágulos en la endometriosis, en la sangre menstrual de la mujer, en la epixtasis nasal mantenida etc, etc). En el MUERTO la sangre POST MORTAL , que procede siempre de derrame pasivo y/o volcado de la acumulada en cavidades, NO forma costras en el sentido que usted pretende, el coágulo se va endureciendo desde la superficie por la red de fibrina, se exprime reduciendo su tamaño y eliminando suero al exterior formando un halo y finalmente se reblandece y licua mediante el mecanismo de fibrinólisis. Le guste o no le guste a usted. Paul Vignon, biólogo, experimentó mucho tiempo con los COÁGULOS y el LINO, ¿cree que esos coágulos se transformaban en costras?. Los coágulos de sangre de Vignon, cuando se iniciaba la fibrinólisis producían improntas en el lino muy pobres y si la fibrinólisis se completaba emborronaban el lino, para desesperación de Vignon. Ese ”momento exacto” en que la imagen es tan definida y nítida como se presenta en la Sábana no se ha podido conseguir en el laboratorio. Mario Latendresse llamó la ATENCION sobre 4 marcas en la imagen dorsal y en la baja espalda del Hombre de la Sábana en un bonito artículo: “ Why would a forger be so precise? The four circle blood marks on the back of the man of the Shroud”. Http://www.sindonology.org/papers/blood Marks Butts.shtml Con independencia de que sean o no sean causadas por el sedile, la IMAGEN de esas marcas es IMPACTANTE y recogí en mi blog junto a las imágenes de Barrie Schwortz 1978, las de Secondo Pía 1988, Enrie 1931 y Durante 2002 para COMPARARLAS. Http://lasabanaylosescepticos.blogspot.com/2010/11/son las marcas del sedile.html Esas imágenes que propone Latendresse: 1. NO pueden observarse en la práctica médica. 2. NO pueden obtenerse en el Laboratorio. 3. NO han podido por tanto ser OBSERVADAS por ningún artista falsario. 4. Son por tanto IRREPRODUCIBLES e INFALSIFICABLES. Probablemente usted, amigo de la buena ciencia, podrá dar alguna explicación para esas imágenes que sea MINIMAMENTE COHERENTE..","date":"2012-01-26","mins":"2:47 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-7564","author":"co","post":"Yannick, la coagulación y la fibrinólisis son temas de extraordinaria complejidad por la enorme cantidad de factores que intervienen, los propios de los tejidos, de la propia sangre, de los órganos con ello relacionados, de la forma y causas de muerte (en el caso de cadáveres) y de un montón de factores externos….. La fibrinólisis NO tiene NADA que ver con la putrefacción. Y como caso EXTREMO la coagulación de la sangre y su FIBRINOLISIS pueden acontecer en el cortísimo plazo de 2 horas..","date":"2012-01-26","mins":"3:14 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-6864","author":"co","post":"Totalmente de acuerdo, Yannick. El trabajo de Barbet es impecable, sólo una “mala lectura” y un “peor entendimiento” pueden justificar la crítica de Zugibe ( y yo prefiero no hacer una crítica al trabajo de Zugibe porque sería muy DURA). Es muy difícil encontrar un trabajo técnico tan ASEQUIBLE al lector sin conocimientos anatómicos como hace Pierre Barbet. El último trabajo interesante sobre el tema es “Anatomía de la Crucifixión” (sale en el Google) de Lagraña, Terraes y Revidatti. Catedra II de Anatomía de la Universidad de Buenos Aires. La entrada del clavo es MUY CERCANA a la propuesta por Barbet. – el clavo se desliza por el lado interno o medial del “hueso grande” (capitate) según Barbet – el clavo se desliza por el lado externo o lateral del “hueso grande” (capitate) según Lagraña y col. La opinión médica mayoritaria, en el caso concreto de la Sábana, es a favor de la hipótesis de Barbet, pues SÓLO él realizó sus experiencias con “manos vivas”, recién amputadas, que conservaban la propiedad de responder a los estímulos nerviosos. (Sobre la obra de Barbet gravita además la figura de una gran anatomista, el Prof. Hovelacque.) Para los lectores que encuentren dificultad en encontrar información sobre el espacio de Destot (es un espacio de interés RADIOLÓGICO sin importancia anatómica): http://www.anatomyatlases.org/Anatomic Variants/Skeletal System/Text/Wrist Hand.shtml.","date":"2012-01-12","mins":"4:23 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6882","author":"co","post":"Ron, yo soy médico, pero parece que hace usted poca estima de la opinión de los médicos europeos ya que no sabemos distinguir el carpo del metacarpo. Vea usted la portada del libro “The Wrist” para hacerse una mejor idea de la situación de los huesos del carpo: http://www.amazon.com/Wrist Diagnosis Operative Treatment/dp/1608313905 Zugibe plantea un trayecto absurdo en la SUPERFICIE (para salvar los estigmas), porque SU clavo TAMBIÉN penetra en PROFUNDIDAD por el CARPO y sale por el CARPO. El Dr. Domenico Tarantini, cirujano del Ospedale Generale di Trani, realizó la misma experiencia y confirmó plenamente la tesis del Dr. Barbet. Yves Delage, que era médico y biólogo, Profesor de Anatomía Comparada en la Sorbona, con quien la Sábana Santa entró en el mundo de la Ciencia, escribía en 1902: “Les mains percées au CARPE et non au métacarpe, conformément aux nécessités anatomiques et contrairement à la tradition.” Yves Delage ” Lettre à M. Charles Richet ” Revue scientifique, n° 22 du 31 mai 1902, pp. 683 687 (y trabajaba, como Barbet, con imágenes a tamaño NATURAL de la Sábana).","date":"2012-01-12","mins":"7:03 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6998","author":"co","post":"“I see the wound nowhere near the wrist or Destot´s spot” Ron, su comentario es ININTELIGIBLE. ¿Dónde cree usted que ve Zugibe la SALIDA del clavo en la imagen de la Sábana? ¡En el CARPO, en la MUÑECA (wrist).! (¿Quiere que hagamos una ANATOMÍA de la muñeca (wrist) a su gusto?) De los 2 espacios propuestos por Zugibe ninguno ATRAVIESA la palma de la mano. (para atravesar la palma de la mano tiene que pasar el clavo por los espacios intermetacarpianos, y Zugibe NO lo propone) Entendió usted mal el trabajo de Barbet y entendió mal el trabajo de Zugibe. ..","date":"2012-01-15","mins":"9:06 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6751","author":"co","post":"La crítica que hace Zugibe es muy DESAFORTUNADA. Pierre Barbet NO cometió ningún error en su trabajo y la grave dislocación de la estructura osea del carpo al penetrar un clavo de 1 cm de sección (como muestra en la radiografía) justifica más que sobradamente la lesión directa del lado sensitivo del nervio mediano y la lesión indirecta del lado motor, sometido a una enorme presión..","date":"2012-01-09","mins":"11:07 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-7064","author":"co","post":"“Indeed all the fingers look too long and seemingly do not follow the natural length pattern of a normal persons fingers.” Chris, creo que si le contesto se va a COMPLICAR mucho el debate…………. En mi modesta opinión la imagen de la mano izquierda (la que muestra la herida del clavo) es una de las “claves” del mecanismo de formación de la imagen..","date":"2012-01-16","mins":"4:26 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-7108","author":"co","post":"Yannick, las manos son normales, prácticamente normales…….pero hay que saber QUÉ ES lo que se está viendo. Barbet era extraordinariamente cuidadoso en sus afirmaciones. Fíjese en estas frases: “La dernière fois que j’ai disposé d’une main fraîche, j’ai pris un bistouri à lame de 8 millimètres. Je l’ai piqué dans le pli de flexion du poignet et en poussant, sans effort, j’ai traversé le carpe sans rencontrer de résistance pour ressortir au dos de la main, toujours au même endroit. Cet endroit, sur u main d’homme normale, est toujours à environ 8 centimètres de la tête de 3e métacarpien. C’est la même distance que j’ai mesurée sur le Linceul.” ¿Cómo podía Barbet medir desde la cabeza del III metacarpiano? La respuesta es muy SENCILLA…… pero demasiado FUERTE. [es muy fácil hacer medidas en la Sábana gracias a Mario Latendresse] http://people.bridgewater.edu/~rschneid/Focus Projects/Shroud/Shroud Measure/enrie Img.html Medítelo..","date":"2012-01-17","mins":"3:15 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"}]
