[{"id":"comment-4654","author":"co","post":"Yannick: Dice un viejo refrán que “el hábito no hace al monje”. Todos somos libre de pensar como queramos, pero si en un debate usted se presenta como cristiano católico CONFUNDE a los lectores. El evangelio no deja lugar a duda de que Jesús RESUCITADO dice tener carne y huesos, muestra sus heridas ( pide a Tomás que lo compruebe ), y además Jesús come y bebe para mostrar que NO es un espíritu. Yo, personalmente NO voy a llevar la contraria a lo que los evangelistas ponen en boca de Jesús. ¿ Cree usted que un cuerpo ESPIRITUAL? tiene carne y huesos, presenta heridas y come y bebe? ¿Qué cree usted que sucedió con el CUERPO de Jesús?.","date":"2011-11-07","mins":"4:17 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"},{"id":"comment-4657","author":"co","post":"Yannick: No me interesan los aspectos teológicos, soy librepensador que creo en Jesús de Nazaret, en su mensaje y en su Resurrección, y este último aspecto incide en el tema de la Sábana. La resurrección FÍSICA y la ESPIRITUAL son hechos ambos COMPATIBLES en los últimos días de Jesús de Nazaret. Usted parece admitir, como yo, que Jesús desapareció de sus envolturas (las manchas de sangre lo significan) y ello supone la DESMATERIALIZACIÓN de su cuerpo, su Resurrección Espiritual. Cuando tiene que mostrarse, aparecerse a sus discípulos, su cuerpo se MATERIALIZA, tiene carne y huesos, muestra heridas y come y bebe como indica el Evangelio, los discípulos lo ven físicamente, no espiritualmente y por lo menos al principio con el rostro terriblemente deformado por el suplicio sufrido y las heridas abiertas. Desmaterialización y materialización son hechos SOBRENATURALES que involucran a la MATERIA y que por lo tanto pueden afectar a la naturaleza FÍSICA del entorno, cosa que en mi parecer sucedió con la Sábana de Turín, testigo de la Resurrección. (Ruego disculpe no poder expresarme en su idioma).","date":"2011-11-07","mins":"8:09 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"},{"id":"comment-3740","author":"co","post":"Muy interesantes e inteligentes los comentarios de Ron y Yannick, pero personalmente, he estudiado y estudio la Sábana desde hace casi 20 años, coincido plenamente con Ron. Translated by Microsoft Bing: Very interesting and intelligent comments from Ron and Yannick, but personally, I have studied and study the Shroud for almost 20 years, I fully agree with Ron. Http://lasabanaylosescepticos.blogspot.com/2011/02/pero entonces amigo miojesucristo ha.html http://lasabanaylosescepticos.blogspot.com/2011/03/pero entonces amigo miojesucristo ha.html http://lasabanaylosescepticos.blogspot.com/2011/01/un hecho extraordinario.htm Carlos Otal.","date":"2011-08-30","mins":"7:16 pm","url":"https://shroudstory.com/2011/08/25/john-and-rebecca-jackson-to-speak-on-the-shroud-of-turin-at-saint-james-the-just-parish-in-ogden-utah/","cat":"news_&_views","title":"John and Rebecca Jackson to Speak on the Shroud of Turin at Saint James the Just Parish in Ogden, Utah"},{"id":"comment-7145","author":"co","post":"Yannick, fue usted muy hábil para no contestar a mi última pregunta sobre cómo pudo Barbet medir la distancia DESDE la cabeza del III metacarpiano……. La respuesta era muy sencilla, colocando el inicio de la regla o la punta del compás en la cabeza del III metacarpiano. Si entiende lo que ESO significa, aunque usted pueda no estar de acuerdo, entenderá fácilmente por qué, además de otras varias cosas, MUCHOS estamos más cerca de Jackson y más lejos de Rogers en cuanto la interpretación del mecanismo de formación de la imagen. [quede claro que TODOS tenemos un gran respeto por la ENORME aportación de Rogers al estudio de la Sábana] Intente ENTENDER el significado de mi pregunta y respuesta..","date":"2012-01-18","mins":"6:02 pm","url":"https://shroudstory.com/2012/01/18/paper-chase-jones-republishes-jacksons-an-unconventional-hypothesis-to-explain-all-image-characteristics-found-on-the-shroud-image/","cat":"news_&_views","title":"Paper Chase: Jones republishes Jackson’s, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\""},{"id":"comment-7667","author":"co","post":"Yo quisiera conocer la opinión de Mario Latendresse al respecto…….. NO son 3 puntos simétricos, son 4 marcas en las 4 “esquinas” aproximadamente de la fotografía, y no hay eje de simetría. La forma de las “manchas de agua sería” completamente absurda de explicar, alguna de las marcas tiene “submarcas” con su halo de “agua”?…………. No veo otras “quemaduras” parecidas por la Sábana..","date":"2012-01-29","mins":"7:02 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"id":"comment-7788","author":"co","post":"Cada PEQUEÑO tema relacionado con la Sábana da lugar a GRANDES problemas de interpretación. Hay marcas o manchas de sangre cuyos márgenes NO emiten fluorescencia, como la sangre que cruza la espalda (DORSAL) y la sangre del pie izquierdo (DORSAL). Así que la NO presencia de fluorescencia en las 4 marcas referidas por Mario Latendresse ( DORSAL) no tiene forzosamente que significar que no sean marcas de sangre. Su apariencia es de sangre y , en mi opinión, el que sean marcas de quemaduras sobre las que se ha echado agua o vino de manera “tan particular” me parece ABSURDA..","date":"2012-01-31","mins":"4:30 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"id":"comment-7806","author":"co","post":"Yannick, yo no invento nada, siempre me documento en la medida posible. No tenido acceso a los trabajos de Miller y Pellicori, pero si a un buen artículo de A.Rodriguez Saldaña de 2009 muy bien documentado sobre los trabajos de Miller y Pellicori: —Miller, V.D. – S.F. Pellicori – Ultraviolet Fluorescence Photography of the Shroud of Turin – Journal of Biological Photography, Vol. 49, No. 3, July 1981, pp. 71 85. —Pellicori, S. – M.S. Evans – The Shroud of Turin Through the Microscope – Archaeology 34, January/February 1981, pp. 34 43. —Pellicori, S.F. – Spectral Properties of the Shroud of Turin – Applied Optics Vol. 19, No. 12, June 15,1980, pp. 1913 1920. —Pellicori, S.F. – Chandos R.A. Portable Unit Permits UV/vis Study of “Shroud”. Industrial Research & Development, Feb, 1981, 186 189. No tengo ninguna razón especial NO CREER lo que escribe Rodriguez Saldaña en su artículo “El STURP: Un completo estudio científico”. Http://www.lasabanasanta.org/docs/sturp.pdf Y escribe textualmente en el apartado: 11. Fluorescencia fotográfica: “En algunas manchas de “sangre” (herida costal, herida de la muñeca, herida del pie derecho dorsal) se rodea de márgenes fluorescentes (Figs. 30b y 30c). De estas zonas no hay micrografías, espectro de reflectancia ni cuantificación de la fluorescencia, por ser posteriores estos estudios (a la vista de estos resultados hubiera sido importante realizar esas pruebas, pero el S.T.U.R.P. Ya no disponía de tiempo para ello). Miller y Pellicori interpretaron que esos márgenes fluorescentes podrían deberse a la presencia de suero, el cual retardaría las reacciones de formación de la imagen. LOS MÁRGENES DE OTRAS HERIDAS ANALIZADAS ( SANGRE QUE CRUZA LA ESPALDA O SANGRE DEL PIE IZQUIERDO DORSAL) NO EMITEN FLUORESCENCIA.” (Las mayúsculas son mías) Alejandro Rodriguez Saldaña es profesor asociado de la Universidad de Murcia (España) en el Departamento de Biología Celular e Histología..","date":"2012-01-31","mins":"6:37 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"id":"comment-7807","author":"co","post":"………. Y en el mismo sentido que A.Rodriguez Saldaña, escribe el siempre MAGNÍFICAMENTE documentado Dr. Heimburger Thibault en su página “Suaire & Science”: “ on détecte autour de CERTAINES taches de sang, la présence d’un halo fluorescent à limite nette. Ceci pourrait correspondre à un exsudat de sérum formé lors de la rétraction du caillot: le sérum sanguin est en effet légèrement fluorescent.” http://www.suaire science.com/sang.htm.","date":"2012-01-31","mins":"7:43 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"id":"comment-7679","author":"co","post":"Vemos las marcas de manera muy diferente…… Las 4 marcas que refiere Mario Latendresse, y a las que yo también me refiero, tienen una ESTRUCTURACION completamente distinta a las otras marcas que usted propone. En lo que SI estamos de acuerdo es que el tema es lo suficientemente interesante para ser investigado en profundidad..","date":"2012-01-29","mins":"11:37 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"id":"comment-4744","author":"co","post":"Las manchas de sangre se han producido por contacto…..pero hay manchas de sangre que aparecen FUERA de la imagen corporal, como el largo reguero que sale del codo izquierdo. El Dr.Gilbert Lavoie ha demostrado de una manera SENCILLA, al alcance de cualquiera que desee repetir la experiencia, que la Sábana estuvo en 2 posiciones distintas: La primera posición envolviendo el cuerpo, responsable de las manchas de SANGRE por contacto y siendo su posición HORIZONTAL. La segunda posición en la que se produce la IMAGEN CORPORAL, en que el cuerpo (y la Sábana por tanto) están en posición VERTICAL. Http://www.acheiropoietos.info/proceedings/Lavoie Web.pdf http://lasabanaylosescepticos.blogspot.com/2010/07/una simple y sencilla demostracion.html No existe NADA en la Ciencia que pueda justificarlo, y ello demuestra un evento SOBRENATURAL. Carlos Otal..","date":"2011-11-11","mins":"10:23 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","title":"Paper Chase: The Findings of Robert Bucklin"},{"id":"comment-4747","author":"co","post":"Escribí en anterior comentario: “La presencia del RIGOR MORTIS, patente en la imagen, indicando la persistencia de elevada cifras de ácido láctico NO es compatible con el inicio de la DESCOMPOSICIÓN de las proteinas y producción de las aminas CADAVERINA, PUTRESCINA y afines, necesarias en la reacción de Maillard que propuso Rogers. La descomposición se inicia una vez ha CESADO el rigor mortis. Rogers, al que tanto debemos en el estudio de la Sábana, se equivocó en este punto, el cuerpo de Jesús de Nazaret NO sufrió la corrupción, no pudo producir cadaverina, putrescina y afines, y por tanto no pudo haber ninguna reacción de Maillard que diera color a la Sábana.” https://shroudofturin.wordpress.com/2011/10/25/more on max patrick hamon and the coin on eye issue/#comments Carlos Otal.","date":"2011-11-12","mins":"1:31 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","title":"Paper Chase: The Findings of Robert Bucklin"},{"id":"comment-4748","author":"co","post":"Las manchas de sangre se han producido por contacto…..pero hay manchas de sangre que aparecen FUERA de la imagen corporal, como el largo reguero que sale del codo izquierdo. El Dr.Gilbert Lavoie ha demostrado de una manera SENCILLA, al alcance de cualquiera que desee repetir la experiencia, que la Sábana estuvo en 2 posiciones distintas: La primera posición envolviendo el cuerpo, responsable de las manchas de SANGRE por contacto y siendo su posición HORIZONTAL. La segunda posición en la que se produce la IMAGEN CORPORAL, en que el cuerpo (y la Sábana por tanto) están en posición VERTICAL. Http://www.acheiropoietos.info/proceedings/Lavoie Web.pdf http://lasabanaylosescepticos.blogspot.com/2010/07/una simple y sencilla demostracion.html No existe NADA en la Ciencia que pueda justificarlo, y ello demuestra un evento SOBRENATURAL. Carlos Otal..","date":"2011-11-12","mins":"1:35 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","title":"Paper Chase: The Findings of Robert Bucklin"}]
