[{"id":"comment-4154","author":"leslie_trotter","post":"Here is an interesting story I am going to share with everyone. I was on my way to Connecticut to visit friends, when I stopped off in an airport bookstore to search for a book to read on my flight. I was interested in reading a book called “Heaven Is For real” about a little boy who had a near death experience and went to Heaven and met Jesus. I could not find this book, either the airport bookstore was out or they never had it in stock. I ended up not getting anything to read and nap on the way to Connecticut instead. After my visit to Connecticut I was a bit upset because I had a big fight with one of my good friends. I got a flight out of Hartford, CT and had to change planes in Baltimore, MD. I had to wait at least an hour an a half to change planes in Baltimore, so as I sat there bored and a little down about the argument I had with my friend. I felt a sense of relief that I was in a strange city and knew no one. I was one who never liked being alone but at this point my mind was at ease, until this woman I’d guess about 60 years old made a beeline over to me. She told me that God spoke to her heart for her to come over and speak to me. She showed me a before photo of how much she used to weigh and I can tell she had lost a lot of weight because her photo looked as thought she must have weighed about 400lbs and standing before me I’d guess she weighed about 150lbs. She looked good and she introduced me to this product called Nuvia3… it was a weight lose supplement/drink. She told me that you drink one before each meal. She went on to tell me a little more info on it and gave me her business card because she sells it. She also pulled out a book, the book that I was looking for called “Heaven Is for Real” She wanted to know if I ever heard of it. I told her I searched for it to read as I traveled. However, I could not find it. She told me that I could have it and she also gave me a sample of the nuvia3 drink. I was grateful to her and I reached into my purse and pulled out my published book called “In Due Season: We Will Hear God’s Voice” I gave her a copy and she was thrilled and asked me to autograph it for her. She as well as I knew that God led her over to me. She called me the next day and told me she read the book and loved it and that it was a blessing to her, she also told several other people about my book. Not Many know about my book. However, when someone does read it they are moved. These Stories like mine and Colton Burpo’s are gifts from God to the world..","date":"2011-10-09","mins":"1:27 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
