[{"id":"comment-10580","author":"shroudenigma","post":"Paulette, thanks for this observation. My language is somewhat clumsy. It was a positing about the Shroud on Dawkins blog that I was referring to my “your Shroud blog” might be a little too pithy. Sorry for the confusion but hope that would not diminish the challenge itself. Prof Giulio Fanti had already “stepped up to the plate” with his publication and readily accepted the challenge when I put it to him. So far, Dawkins has not. If you go to the page now you will see that the Challenge is on hold pending the outcome of these open discussions from as many qualified interested parties as possible. Professor Fanti has kindly accepted this process and the forthcoming Valencia conference has agreed to provide a forum for the conclusion of the criteria consolidation process. Once this has happened I hope you and as many other visitors to this blog will apply whatever pressure they can on the Dawkins and his foundation to accept. Ron’s K.I.S.S. Approach could well makes a lot of sense..","date":"2012-04-19","mins":"5:43 am","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","title":"An Email from David Rolfe to the Shroud Science Group"},{"id":"comment-21575","author":"shroudenigma","post":"In answer to Yannick’s request I am happy to declare what I believe. The Shroud image is a mystery in much the same way the Big Bang is. Science is, as yet, unable to give us an answer to both. I do know the universe was not made in six days and I do know the Shroud is not a painting or, for that matter, the result of a series of random effusions. Sorry Yannick, but a theory that can account for a smudge cannot be extrapolated indefinitely to explain the Shroud image. It’s homogeneity over distance and on opposing plains puts that beyond reason. It is perfectly scientific to say “I have no idea”. That is what makes studying the Shroud so interesting..","date":"2013-01-03","mins":"8:45 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-21509","author":"shroudenigma","post":"Yannick, can I suggest that, for the sake of brevity, in future, you could encapsulate the above as ‘The Smudge Theory’. It seems to be a good pithy description. Yours, David ‘cool dude’ Rolfe..","date":"2013-01-02","mins":"8:38 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-11274","author":"shroudenigma","post":"Dan, in our conversation on SSG I said the following in relation to the possibility that the List, as drawn, might inadvertently have excluded Rogers’ hypothesis : “Should this point remain unclear despite the scientific reality and it remains a stumbling block to unanimity, I would be prepared to go back to the original signatories to seek any necessary re wording as required. There was definitely no intention to exclude any of the major contending image formation theories from consideration.” Dan, you rejected this offer. Why seek confrontation when conciliation and cooperation is on offer?.","date":"2012-05-11","mins":"5:27 am","url":"https://shroudstory.com/2012/05/11/sentence-one-in-the-richard-dawkins-challenge-is-wrong-period/","cat":"challenge","title":"Sentence One in the Richard Dawkins Challenge is Wrong. Period."}]
