[{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nStephen. I find here in lies another issue over the discussion on the Shroud; Some people just not using any logic! i.e; The poster who questions the authenticity of the Shroud due to misinterpretation of scripture. John never states the body was wrapped in Othonia (cloths plural), he only states he SAW the othonia (cloths plural) in the tomb. There is a huge difference between the two. When John mentions othonia, it could mean several things; The Shroud itself and bound by strip(s) (As hypothesized by Dr. Jackson) or there could have been more cloths involved lying there. It has been suggested another large cloth was (needed)or used, to actually carry Jesus from the cross to the tomb, and I think this is evident in that if the Shroud was used to carry the lord from the cross, it would be very evident on the Shroud itself, and it is definately not, meaning there could have been a number of other cloths in the tomb amongst the Sudarium and the Shroud...So basically this argument is mute to the discussion of the authenticity of the Shroud.F3\n\n","author":"Flagrum3","date":"July 12, 2012 at 4:29 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nAnd the artist of the Pray Manuscript very cleverly reconciles these gospel differences in Plate III.  As per John, he shows both the face cloth and the linen body cloth (Shroud).The face cloth or sudarium is the small bundled object, to the right of the angel's foot and the cross motifs. Freeman acknowledges this to be the sudarium. It is the right size to be the face cloth, and further support for it being this rather than the Shroud is provided by the symbolic connection depicted by the letter (alpha?) floating between the cross and Jesus's head behind the right arm of Mary.Then the Shroud is the object beneath the face cloth, with the 4 poker holes, streaks of blood, and cross motifs symbolising the image of Jesus on the Shroud.\n\n","author":"Matt","date":"July 12, 2012 at 4:45 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nFlagrum3>I find here in lies another issue over the discussion on the Shroud; Some people just not using any logic! Agreed! I am only a high school maths teacher but I thought that 1 + 1 = 2!>i.e; The poster who questions the authenticity of the Shroud due to misinterpretation of scripture.Some Christians (to whom the saying \"a little knowledge is a dangerous thing\" applies) think that they can resolve all Biblical issues using their English translation. As the old parishioner said to the young clergyman who wanted to introduce a newer translation: \"If the King James Version was good enough for St. Paul, young man, then it's good enough for me\"!But English Bible translations often mask nuances in the original language in the interests of English readability, popular appeal, tradition, etc. To find out what a particular original Greek or Hebrew word really means, one needs to consult Greek-English or Hebrew-English lexicons.But even checking in an English translation what the other gospels say about the same incident can reveal things aren't quite as simple as they appeared to be in only one gospel.And then there are those examples of one gospel mentioning one angel/demoniac/blind beggar and another gospel mentioning two angels/demoniacs/blind beggars. If a Christian throws out the shroud on the grounds that a gospel mentions two burial cloths, then to be consistent he/she should throw out the gospel(s) which mention only one angel/demoniac/blind beggar! Well-meaning, devout, but ignorant Christians can, without realising it, be \"fighting against God,\" just as well-meaning, devout, but ignorant Jews were in the first century (and still are today): Acts 5:34-39. \"But a Pharisee named Gamaliel, a teacher of the law, who was honored by all the people, stood up in the Sanhedrin and ... addressed them: `Men of Israel, consider carefully what you intend to do to these men. ... I advise you: ... Let them go! For if their purpose or activity is of human origin, it will fail. But if it is from God, you will not be able to stop these men; you will only find yourselves fighting against God.'\">John never states the body was wrapped in Othonia (cloths plural), he only states he SAW the othonia (cloths plural) in the tomb. There is a huge difference between the two. When John mentions othonia, it could mean several things; The Shroud itself and bound by strip(s) (As hypothesized by Dr. Jackson) or there could have been more cloths involved lying there.I don't disagree. But in first century Jewish burials the minimum burial cloths were:1) the corpse's hands, feet and jaw were tied with linen bandages (Gk. keiras as mentioned in Lazarus' burial in Jn 11:44) to keep them in place until rigor mortis set in. 2) Then the body was enfolded in a large linen sheet or sindon (Mt 27:59; Mk 15:46; Lk 23:53). Jewish corpses were not totally wrapped around with bandages or strips as Egyptian mummies were. But apparently sometimes a Jewish body was buried in his/her clothes, which may have been the case with Lazarus, since no sindon is mentioned and yet he would have been naked when he emerged from the tomb if he wasn't covered in a sheet or was in his clothes. We don't know what Lazarus died of, but if it was an infectious disease, it is more likely he would have been buried in his clothes to minimise the chance of catching the disease.[continued]\n\n","author":"Stephen E Jones","date":"July 12, 2012 at 5:47 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\n[continued]3) The facecloth (Gk. soudarion), was a small cloth which was placed over the face of a person who had just died while he/she was being carried to the tomb. It had previously been thought that the jaw band was the soudarion, because it was \"around\" \" (Gk. peri) Lazarus' head but \"upon\" (Gk. epi) Jesus' head (Jn 11:44; 20:7). But watch the video \"Shroud Report Interview with Mark Guscin on the Sudarium of Oviedo\"  to see what the soudarion really was and how it was used in the case of Jesus. As can be seen in the case of Jesus, the soudarion was evidently removed if the body was enfolded in a shroud, but in the case of those who were buried in their clothes, like Lazarus may have been, the soudarion may have been more elaborate (which is indicated by the different Gk prepositions) and left on, since otherwise there would have been nothing covering his face.All the above linen graveclothes were collectively referred to as othonia - \"linen\" (plural).>It has been suggested another large cloth was (needed)or used, to actually carry Jesus from the cross to the tomb, and I think this is evident in that if the Shroud was used to carry the lord from the cross, it would be very evident on the Shroud itself, and it is definately not, meaning there could have been a number of other cloths in the tomb amongst the Sudarium and the Shroud...There could have been, but because of Judaism's law about a bleeding body must be buried with its lifeblood:\"Lazarus died a natural death. In accordance with normal Jewish practice he would have been washed, interred fully dressed in his Sabbath best, tied up with a few binding strips to keep his jaw and limbs suitably together, and provided with some kind of face cloth for screening purposes. Jesus, in contrast, died a very bloody death, and stark naked, his clothes having been removed from him at the time of his crucifixion. [Matthew 27:35, Mark 15:24, Luke 23:34, John 19:23] In his case Jewish law prescribed something very different. As has been carefully explained by Jewish-born Victor Tunkel of the Faculty of Laws, Queen Mary College, University of London, the belief among the Pharisees of Jesus's time, shared by Jesus's own followers, was that everyone's body would be physically resurrected at the end of time. This meant that as far as humanly possible everything that formed part of that body, including particularly the life-blood, should be buried with it. As expressed in the Jewish Code of Laws, `One who fell [e.g. in battle] and died instantly, if ... blood flowed from the wound, and there is apprehension that the blood of the soul was absorbed in his clothes, he should not be cleansed.' ... In these circumstances, therefore, those preparing the dead person for burial had to wrap a `sheet which is called a sovev' straight over any clothes, however bloodstained. This sovev had to be an all-enveloping cloth, that is a `single sheet ... used to go right round' the entire body. Such a sovev readily corresponds to the `over the head' characteristics of Turin's Shroud.\" (Wilson, I., \"The Shroud,\" 2010, p.52)it is more likely that the Shroud did double-duty in being used in carrying Jesus otherwise naked body to the tomb and then used to finally enfold Him with His life-blood in the tomb.>So basically this argument is mute to the discussion of the authenticity of the Shroud.I would put it more strongly. It is both ILLOGICAL and WRONG to claim that there is any contradiction between \"Jesus was wrapped in linen cloths (plural) and had a separate cloth wrapped around his head\" and ONE of those \"linen cloths (plural)\" being a sindon - the Shroud.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 12, 2012 at 6:11 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nSorry slightly off topic but since there is a picture of the Pray Manuscript there is a tenuous link....I've been doing some research on Bela III, who was the King of Hungary from 1172 to 1196 (ie. during the creation of the Pray Manuscript)Interesting to read of his very strong connections with Constantinople (he was educated there, and married a Byzantium woman). He was in fact lined up to be Emperor, but this was changed when the Emperor finally had a son. Bela III fostered relations with Constantinople and \"invited religous orders and scholars from abroad to settle in the country\" (From \"The Church and Bela III of Hungary (1172 - 1196): the Role of Archbishop Likacs of Esztergom\")This provides further backing for the claim that the images in the Pray Manuscript were influenced by a viewing of the Shroud in Constantinople. In fact, could the images have been drawn by one of the foreign scholars, perhaps from Constantinople? The fact that the Pray Manuscript is the first written Hungarian document supports the notion of a foreign creator or protagonist.   I found Bela's history interesting, as I didn't know of the very strong Constantinople connection.\n\n","author":"Matt","date":"July 12, 2012 at 7:12 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nStephen. I don't believe I am too far off in my proposals. 1.)Several cloths may have been used and could have been kept with the body in keeping to Jewish burial traditions and not necessarily being attached or placed on the body. (The sudarium is a case in point)...So it is still a logical statement. The minimal number of cloths (jawband) etc; is not an issue, as time was of the essense. A single strip bound around the Shroud could suffice as illustrated clearly by Dr Jacksons hypothesis using the 4 inch side-strip, which is tangible evidence. Remember John separates the Sudarium from the othonia so othonia (cloths plural) could mean several cloths; Including the Shroud, a strip or strips to bind the body and other cloths used for other purposes. The scripture does not in any way go against this (my) proposal.2) I also find it highly unlikely, viewing the Blood evidence found on the Shroud (closely) that the Shroud itself could have been used (dual purpose)i.e; In carrying the lord from the cross. I believe there would be found massive amounts of blood smeared on much of Shroud if being so, which there is not. The blood traces are very exacting, hardly showing any sign of movement. Again it is not against scripture or Jewish burial custom that these 'other' clothes may have been placed on or about the body. It is quite clear that Nichodemus et al. needed to improvise and quickly, using a long strip instead of several small ones to bind the body is not out of the question, and actually quite logical. John most likely had witnessed the burial and seen the exact way the body was left in the tomb when left. This could explain why John 'believed' after 'seeing' the cloths and the Sudarium, because they were all where they were left with only the body missing.F3\n\n","author":"Flagrum3","date":"July 13, 2012 at 1:48 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nTo Matt's last comment on Bela III; This is a very important point, as it does create a strong connection between Hungary and Constantinople. It makes it quite possible that Bela III had seen the Shroud in Constantinople face to face, or even stronger that the monk who drew the PM had also or had accompanied him there...making for a very plausibly connection...this would  or could explain alot of the coincidences found on the PM to the Shroud.Now if I may go off topic also, I'd like to go back to the Sakli fresco painting and my thoughts on it. I am in question to the circles having any relation to the 3 circles of the esophagus or to the poker holes on the Shroud. Reason; there is no logic in it. If the artist was depicting the poker holes; WHy not depict them exactly as are seen? and why 3 holes? Even with the faintest of the poker holes, atleast 4 burns can be seen and why angled? ...this theory also would propose the artist had seen the Shroud 'unfurled' and not folded as the Mandylion/Edessa cloth was described and known to exist. The link to the Constantine 3 holed esophagus in Jerusalem seems too far reaching. If so, then why the need or meaning to the four holes? My thoughts are that the artist may have known that the Edessa cloth/Mandylion was actually a larger sindon (burial cloth) but had not neccesarily seen it as such, as it can be supposed most people would not have been able too, just a few of the higher clerics, nobles etc; but he was aware of it's distinctive folding. Hense the odd circle patterns of 3 on one side, four on the other along with the fold lines which can be viewed on either side of the painting, reminiscent of layers. I may be way off here on my proposition and Mr. Guscin did actually relate to me that the painted circles were common on many paintings, so unlikely they had much or the indepth meaning as I proposed....but for some reason I cannot agree and feel there is.F3\n\n","author":"Flagrum3","date":"July 14, 2012 at 5:46 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nFlagrum3Yes, I have now realised how very strong the connection between Hungary and Constantinople was. Before, I thought there might have been a weak connection, but it was very strong and this provides further backing for the notion that the Pray Manuscript artist had seen the Shroud in Constantinople.Re the Sakli....I'm open minded about the circles, I am yet to be convinced that they represent the poker holes on the frontal image of the Shroud, but they might!The number 7 is prominent in the Bible, and it might also be that the 7 circles are there as a numerological reference to God / the Bible. But it could also be a play on the poker holes of the Shroud.From what I've observed of Byzantine art, circles are often used, but when they surround Jesus's head they are usually 4 circles in the pattern of a cross. I haven't seen this 3 circles on one side, and 4 circles on the other side, pattern before.So I am just theorising but maybe in Byzantine times people interpreted the 7 poker holes on the frontal image in light of the numerological significance of the number \"7\"\n\n","author":"Matt","date":"July 14, 2012 at 1:34 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nMatt>And the artist of the Pray Manuscript very cleverly reconciles these gospel differences in Plate III.Disagree that the Pray Codex artist is trying to reconcile gospel differences. As discussed in my post above, the major apparent differences between the gospel accounts of Jesus' resurrection is the number of angels/young men. But the Pray Codex does not attempt to reconcile this.As stated in my post above, the Pray Codex artist is only depicting the scene in Mk 16:1-6 where the three women (Mary Magdalene; Mary the mother of the James, and Salome) came to finish the anointing of the body of Jesus but were told by an angel that Jesus was not there and had risen.>As per John, he shows both the face cloth and the linen body cloth (Shroud).Disagree that this Pray Codex is \"as per John.\" The events being depicted in the lower scene of plate III (Berkovitz, 1969) are those in Mk 15:1-6 where Mary Magdalene, as one of the three women, is told by an angel that Jesus had risen.Mary Magdalene's account of this is briefly mentioned in Jn 20:1-2:\"1 Now on the first day of the week Mary Magdalene came to the tomb early, while it was still dark, and saw that the stone had been taken away from the tomb. 2 So she ran and went to Simon Peter and the other disciple, the one whom Jesus loved, and said to them, `They have taken the Lord out of the tomb, and we do not know where they have laid him.'\"But as can be seen John does not mention the other women or the angel. That there were other women with Mary Magdalene is not contradicted by John as he records her saying, \"WE do not know where they have laid him.\" But there is no mention of the discarded graveclothes in John's version of her account.In that part of John's account which does mention the discarded graveclothes, Jn 20:3-8:\"3 So Peter went out with the other disciple, and they were going toward the tomb. 4 Both of them were running together, but the other disciple outran Peter and reached the tomb first. 5 And stooping to look in, he saw the linen cloths lying there, but he did not go in. 6 Then Simon Peter came, following him, and went into the tomb. He saw the linen cloths [Gk. othonia] lying there, 7 and the face cloth [Gk. soudarion], which had been on Jesus' head, not lying with the linen cloths but folded up in a place by itself. 8 Then the other disciple, who had reached the tomb first, also went in, and he saw and believed;\"the women and angel are not mentioned, only Peter and John (\"the other disciple\").[continued]\n\n","author":"Stephen E Jones","date":"July 19, 2012 at 10:40 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\n[continued]>The face cloth or sudarium is the small bundled object, to the right of the angel's foot and the cross motifs. Freeman acknowledges this to be the sudarium. It is the right size to be the face cloth, and further support for it being this rather than the Shroud is provided by the symbolic connection depicted by the letter (alpha?) floating between the cross and Jesus's head behind the right arm of Mary.Agree that it is \"Jesus's head behind the right arm of Mary\" and as you rightly indicate \"the letter (alpha?)\" is ambiguous.But disagree with Freeman (and you) that:\"The most important point of all is that a blown-up image shows that the sudarium is depicted as a separate piece of cloth and so the source seems, once again, to be the account in John's gospel where the sudarium is reported as lying separately.\" [pages 17 & 18]See previously that Freeman (and you) is simply WRONG that \"the source seems ... to be the account in John's gospel.\" And I have Berkovits, 1969, plate III, in front of me, and even under a magnifying glass there is NO \"small bundled object, to the right of the angel's foot and the cross motifs.\" In fact Freeman doesn't even say that, just vaguely that \"a blown-up image shows that the sudarium is depicted as a separate piece of cloth,\" without stating where it is.And as previously stated the \"sudarium\" (Gk. soudarion), and indeed the graveclothes, are not mentioned in Mk 15:1-6, the \"Visit to the Sepulchre\" by the three women.Even if he was trying to reconcile the scene in Mk 15:1-6, with the other gospel accounts of the discovery of the empty tomb, the 12th century Hungarian Pray Codex artist would be most unlikely to know what we know today, that the soudarion of Jn 20:7 is the Sudarium of Oviedo. That was in Spain, in a chest, in an obscure cathedral in an obscure town, Oviedo. And the Sudarium of Oviedo's connection with the Shroud was only rediscovered in the 1960s.If the artist was trying to depict the soudarion then it would be the strip of linen around the neck of the garment emerging from the empty sarcophagus. Until fairly recently, before the significance of the Sudarium of Oviedo became more widely realised in Shroud pro-authenticity circles, it was wrongly assumed that the \"the face cloth [soudarion], which had been on Jesus' head\" in Jn 20:7 was a strip of linen which in Jewish burials was tied around the top of the head and the chin to keep the mouth from falling open until rigor mortis had set in.>Then the Shroud is the object beneath the face cloth, with the 4 poker holes, streaks of blood, and cross motifs symbolising the image of Jesus on the Shroud.Disagree. There is no \"face cloth\" depicted in the LOWER scene on plate III, unless it is the strip around the neck of the garment emerging from the sarcophagus. In the LOWER scenw of plate III, the Shroud is depicted as the sarcophagus, decorated with the \"4 poker holes, streaks of blood, and cross motifs\" and Jesus' face in profile near Mary Magdalene's right arm.  The \"image of Jesus on the Shroud\" is depicted in the UPPER scene of plate III.Matt, as previously mentioned, we are going around in circles on this. I don't want to waste my time arguing the same point endlessly. Yet I feel I must counter what I consider to be wrong information posted on my blog. Therefore you have had your final comment under this post on this matter about the sudarium being depicted on the Pray Codex.If I feel I have to, to save me wasting my time on endless debates, I will reluctantly reestablish my policy that:\"Each individual will usually be allowed only one comment under each post. Since I no longer debate, any response by me will usually be only once to each individual under each post.\"Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 19, 2012 at 10:56 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nHi, Stephen,It occurs to me that, while there is no contradiction between the Shroud and the Gospel accounts, the fact that so many people perceive such a conflict, by taking a naive reading of the Gospels as a fully exhaustive account, offers further evidence that the Pray Codex is based on the Shroud.The Codex depicts a single long cloth under the body and wrapped (or about to be wrapped) over top of the head, like the Shroud. However, a naive reading of only the Gospels themselves, and taking the Gospel descriptions as an exhaustive description of the cloths, would tend to give a different impression. It seems very unlikely that the artist would have drawn the burial cloth the way he did based only on the Gospel accounts, without additional information to go on. Together with the naked body, crossed wrists, etc, we have good evidence that the additional information was the Shroud.\n\n","author":"The Deuce","date":"July 19, 2012 at 9:42 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nThe Deuce>It occurs to me that, while there is no contradiction between the Shroud and the Gospel accounts, the fact that so many people perceive such a conflict, by taking a naive reading of the Gospels as a fully exhaustive account, offers further evidence that the Pray Codex is based on the Shroud.This is a VERY good point. If the Pray Manuscript's \"The Entombment\" and \"Visit to the Sepulchre\" scenes, in Berkovits, 1969, plate III, were based on the gospels' descriptions of those events, then we would expect something like Caravaggio's \"The Entombment of Christ\" and Il Baciccio's \"The Three Marys at the Sepulchre.\" But these, while they are no doubt great works of old Christian art, have NO unique features in common with the Shroud as the Pray Manuscript has (e.g. the shroud is more than twice Jesus' length, L-shaped `poker holes', herringbone weave, Jesus is nude, His hands are crossed in front of him, a bloodstain on Jesus forehead exactly where there is a \"reversed 3\" bloodstain on the Shroud, etc). >The Codex depicts a single long cloth under the body and wrapped (or about to be wrapped) over top of the head, like the Shroud. However, a naive reading of only the Gospels themselves, and taking the Gospel descriptions as an exhaustive description of the cloths, would tend to give a different impression. Agreed. There is nowhere near enough detail in the gospels for the Pray Manuscript artist to INDEPENDENTLY come up with depictions of Jesus' entombment and of the visit of the women to the empty tomb, that by chance `just happens' to have the same unique features above which are also on the Shroud.>It seems very unlikely that the artist would have drawn the burial cloth the way he did based only on the Gospel accounts, without additional information to go on. Together with the naked body, crossed wrists, etc, we have good evidence that the additional information was the Shroud.Agreed. See above. Those who claim that the Pray Manuscript is not based on the Shroud would have to come up with a plausible explanation of how the Pray Codex (1192-95), the writing in which is in Old Hungarian, was unknown even in Hungary until Hungarian historian György Pray rediscovered it in 1770, `just happens' to have at least 12 unique features in common with the Shroud of Turin, when the latter, according to the 1988 radiocarbon dating, is no older than AD 1260.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 19, 2012 at 11:06 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nMatt>I've been doing some research on Bela III, who was the King of Hungary from 1172 to 1196 (ie. during the creation of the Pray Manuscript)Agreed. See my comment under, \"`Or the artist of the fake shroud knew of the Pray Manuscript and incorporated these signs into his forgery?'\":----------------------------------De Wesselow, in discussing the Pray Manuscript, points out that \"King Bela III [of Hungary] ... spent eight years as a young man in the imperial court at Constantinople\" and \"During his reign ... cultural links between Hungary and the Byzantine capital were strong\" (p.178).According to Wikipedia, that must have been between 1164-72:\"Béla III (Hungarian: III. Béla, Croatian: Bela III., Slovak: Belo III) (c. 1148 – 23 April 1196) was King of Hungary and Croatia (1172–1196). [Reign 4 March 1172 – 23 April 1196. Coronation 13 January 1173] He was educated in the court of the Byzantine Emperor Manuel I  [1118-80] who was planning to ensure his succession in the Byzantine Empire till the birth of his own son. ... In the beginning of 1166, Manuel I and Béla co-chaired the synod of the Byzantine Church in Constantinople\" (\"Béla III of Hungary,\" Wikipedia, 28 May 2012),So I assume that the Pray Manuscript's drawings were probably commissioned by Manuel I as a gift to Bela III, upon his accession to the Hungarian throne, in 1172-73.---------------------------------->Interesting to read of his very strong connections with Constantinople (he was educated there, and married a Byzantium woman). He was in fact lined up to be Emperor, but this was changed when the Emperor finally had a son.Yes. It's not hard to imagine that allowing a Hungarian artist to depict the Shroud symbolically was an appropriate consolation gift from Manuel I to Bela III.Berkovitz (1969) noted that the Pray Manuscript drawings on her plates III & IV \"show close stylistic relationship to ... some figures of the sculptor of Pecs known as the Master of the Nativity\" (p.20), who on p.18 she said sculpted \"the Sampson Scenes\" (1140-1150).\">Bela III fostered relations with Constantinople and \"invited religous orders and scholars from abroad to settle in the country\" (From \"The Church and Bela III of Hungary (1172 - 1196): the Role of Archbishop Likacs of Esztergom\")>This provides further backing for the claim that the images in the Pray Manuscript were influenced by a viewing of the Shroud in Constantinople. In fact, could the images have been drawn by one of the foreign scholars, perhaps from Constantinople? The fact that the Pray Manuscript is the first written Hungarian document supports the notion of a foreign creator or protagonist.Agreed.>I found Bela's history interesting, as I didn't know of the very strong Constantinople connection.See above for my previous comment on 31 May.There is more about Bela III in genealogist Noel Currer-Briggs' \"The Holy Grail and the Shroud of Christ\" (1984), \"The Shroud and the Grail\" (1988), and \"Shroud Mafia\" (1995). I will scan any relevant information and post in a further comment.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"July 24, 2012 at 9:58 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\n>There is more about Bela III in genealogist Noel Currer-Briggs' \"The Holy Grail and the Shroud of Christ\" (1984), \"The Shroud and the Grail\" (1988), and \"Shroud Mafia\" (1995). I will scan any relevant information and post in a further comment.I have checked all occurrences of \"Bela III, King of Hungary\" in Currer-Brigg's last two books above, but there is nothing in them that is not in his first book. Therefore the following references are only to Currer-Briggs, N., \"The Holy Grail and the Shroud of Christ\" (1984).King Bela III of Hungary's first wife was Agnes de Chatillon (p.72). Their daughter Mary Margaret married Byzantine Emperor Isaac Angelos in 1185 (p.60) and they had a son Kalojan (p.73).Bela III's second wife was Marguerite, daughter of Louis VII of France, and widow of Henry II of England's eldest son Henry Courtmantel (1155-) (p.54). The reign of Bela III (1172-1196) was a glorious period in the history of Hungary (p.73). His family relations assured him a high place in the hierarchy of European monarchs (p.73). He would have been aware of the nature and extent of the collection of relics at Constantinople (p.73). During his reign French influence in Hungary reached its highest point.\" (pp.73-74).The widowed Mary-Margaret married Boniface de Montferrat, a leader of the crusaders who sacked Constantinople in 1204 (p.72). He was given the Kingdom of Salonica, which included northern Greece (p.72). They left Constantinople in 1204 taking much of the imperial treasure with them, which may have included the Shroud (pp.72-73). They later had a son, Demetrios (p.73).The again widowed Mary-Margaret married Nicholas de Saint-Omer, a relative of Godfrey de Saint-Omer, one of the founders of the Knights Templar (p.72). They had two sons, Bela and William de Saint-Omer (p.73). Nicholas died in 1212 and in 1222, Mary-Margaret was driven into exile with her sons, taking refuge in Hungary at the Court of her brother King Andrew II (p.73). He appointed her eldest son Kalojan the Duke of Sirmium (p.73).King Bela III's daughter, ex-Empress Mary-Margaret, provides the link between Constantinople, Hungary, the Templars [and France-my addition]. If anyone had had an opportunity and the motive to take it, it was she. (p.80).Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 26, 2012 at 8:04 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\nFlagrum3>To Matt's last comment on Bela III; This is a very important point, as it does create a strong connection between Hungary and Constantinople. Agreed.>It makes it quite possible that Bela III had seen the Shroud in Constantinople face to face, He almost certainly did. See above that from \"1166 ... Béla co-chaired the synod of the Byzantine Church in Constantinople.\">or even stronger that the monk who drew the PM had also or had accompanied him there...There is no evidence that it was a \"monk who drew the PM\" or that the PM artists accompanied Bela III there. See above Berkovitz' point that the Pray Manuscript drawings \"show close stylistic relationship to ... figures of the sculptor of Pecs known as the Master of the Nativity.\" It may be that \"the sculptor of Pecs\" was a monk but I know of no evidence of this. It seems more likely that Bela III (or Manuel I at Bela III's request) commissioned the Pray Mqnuscript's artist to come from Hungary to Constantinople to ink-paint the PM's four drawings (Berkovitz, 1969, plates II, III (upper & lower) and IV).>making for a very plausibly connection...this would or could explain alot of the coincidences found on the PM to the Shroud.Agreed that since: 1. Bela III was Hungarian; 2. he was in Constantinople between ~1164 and 1172; 3. he was at one point the heir apparent to Manuel I the Byzantine Emperor; and 4. the Pray Manuscript is Hungarian; this adds to the already very high probability, bordering on certainty, that the at least 12 unique shared similarities between the Pray Manuscript and the Shroud are not mere coincidences, but are due to the artist who painted the Pray Manuscript having before him the Shroud as his model.[continued]\n\n","author":"Stephen E Jones","date":"July 27, 2012 at 8:37 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\n[continued]>... I'd like to go back to the Sakli fresco painting and my thoughts on it. I am in question to the circles having any relation to the 3 circles of the esophagus or to the poker holes on the Shroud.It's sarcophagus. An esophagus is the tube through which food passes from the mouth to the stomach!But I agree it is speculative that the pattern of 4 and 3 circles to the left and right of the Mandylion over the arch in the Sakli church, Goreme, Turkey represent the `poker holes' on the Mandylion/Shroud, yet nevertheless, in the absence of a more plausible explanation, I believe that they do. >Reason; there is no logic in it. If the artist was depicting the poker holes; WHy not depict them exactly as are seen? and why 3 holes? Even with the faintest of the poker holes, atleast 4 burns can be seen and why angled? There IS logic in it. If the Mandylion' protective surround at that time had that pattern of 4 and 3 circles on it, then the Sakli fresco artist would have faithfully represented it. And then the logic of the Mandylion's protective surround having a pattern of 4 and 3 circles on it would be to symbolically represent all the patterns of the `poker holes' on the Shroud. Which, looking at them on ShroudScope (Durante 2002 Vertical) the major holes are patterns of 4 and 3:   *    *   *    ** *    * *   *    *   *    *   *    *Within the limited space between the Mandylion's border (and between the Sakli church's arch and ceiling), a pattern of 4 and 3 circles would be a reasonable artistic compromise to depict the poker holes on the Shroud.I also made the point in a comment under \"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\" that the Sakli church is in the centre of Turkey and it may have been important to depict the `poker holes' as a reminder to Christians of the triumph of the Shroud in over the Islamic `trial by fire' in AD 680.>...this theory also would propose the artist had seen the Shroud 'unfurled' and not folded as the Mandylion/Edessa cloth was described and known to exist. No. He may have only been faithfully depicting a pattern of circles on the Mandylion's protective surround, which in turn were based on the actual poker hole burns on the Shroud.>The link to the Constantine 3 holed esophagus in Jerusalem seems too far reaching. If so, then why the need or meaning to the four holes? Agreed that that may be an unnecessary refinement.>My thoughts are that the artist may have known that the Edessa cloth/Mandylion was actually a larger sindon (burial cloth) but had not neccesarily seen it as such, as it can be supposed most people would not have been able too, just a few of the higher clerics, nobles etc; but he was aware of it's distinctive folding. He did not even need to know or see that the Mandylion was the Shroud folded up.[continued]\n\n","author":"Stephen E Jones","date":"July 27, 2012 at 11:57 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"},{"title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n","post":"\n\n[continued]>Hense the odd circle patterns of 3 on one side, four on the other along with the fold lines which can be viewed on either side of the painting, reminiscent of layers. This seems too far-fetched to me. It is simpler that the pattern of 4 and 3 circles were on the Mandylion's surround and that they were traditionally known to represent poker hole burns on the cloth inside, from an Islamic `trial by fire' of the Shroud in 680.>I may be way off here on my proposition and Mr. Guscin did actually relate to me that the painted circles were common on many paintings, so unlikely they had much or the indepth meaning as I proposed....but for some reason I cannot agree and feel there is.Guscin may well be right. But I agree with you that there is a connection between the pattern of 4 and 3 circles on the Sakli church Mandylion and the pattern on 4 and three poker holes on the Shroud. My theory is that the former faithfully represent a pattern circles on the Mandylion's protective surround, which in turn was a symbolic depiction of the pattern of 4 and 3 main poker holes on the Shroud, within the limited space available.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 27, 2012 at 12:00 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","site":"moore"}]
