[{"id":"comment-78662","author":"andrea_nicolotti","post":"Max Patrick Hamon : An Italian specialist, Andrea Nicolotti, has proposed that the locution “ Ecce suaire Jesu Christi” ou “Here is the shroud of our Lord Jesus Christ” [Nicoletti totally missed both the U in Gothic script with E embedded within and the “h” in Gothic script in JHV!] I do not see any “U in Gothic script with E embedded within”. The first letter COULD be an E because it is very similar with the E of SUAIRE. As for the H that you say I missed, obviously I have not missed it (I am not blind), but when you do a transcription you must undo the abbreviations; so “Ih V” must be transcribed “Iesu” (or Jesu, like French people like). P.S. An e mail sent to Mr. Hourseau by me is not a “Scholar peer reviewing”, and internet is not a review..","date":"2014-02-12","mins":"9:40 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79818","author":"andrea_nicolotti","post":"I’ll answer in a proper post. Here the argument is the funny argument of the earthquake, not the epigraphy.","date":"2014-02-16","mins":"12:37 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-78830","author":"andrea_nicolotti","post":">>>>Reminder for Nicoletti: My name is Nicolotti. >>>>There are “official” and “non official” ways to peer reviewing” (e.g. Via email as Hourseau asked your opinion as “an Italian specialist” not as a plumber). Hourseau asked my opinion and I said what I consider right. I said also that I see many errors in his book and in Wilson’s interpretation of the object. Again, this is not peer review. It is a private email. >>>>>You cannot see a U letter in Gothic script just because you’re not familaier with carved inscription in Gothic script. I am familiar with it and I do not see the U. >>>>>To correctly undo the abbreviation “Ih V” is to fully write “Ih ESV” not “Iesu”… A full transcription is not a translation. …in Italian. Iesu is not a translation, is a transcription. “Iesu” is not Italian. You are a bit confused. “Ih ESV” is not wrong, like Iesu or Jesu. >>>>E[CCE] SVAIRE:Ih[ES]V C[RISTI], “here is the Shroud of (our Lord) Jesus Christ” (and not “Ecce suaire Jesu Christ”) I never wrote “Ecce suaire Jesu Christ” >>>>>At 2nd reading level (in Latin and in conjunction with the French word SVAIRE): E[CCE] SVAIRE (ND) IH[ES]V C[RISTI] ND? Why? Is not necessary. And here you missed the H in Christi >>>>>>At 3rd reading level (in Latin as a cryptic polemical inscription?): UE[RGENSI] SVAIRE (ND) IH[ES]V C[RISTI], “The de Vergy Family’s Shroud of our Lord Jesus Christ”. UE[RGENSI]? You are a bit confused with the language..","date":"2014-02-12","mins":"8:17 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-126257","author":"andrea_nicolotti","post":"This book “The Untold Story of the Holy Shroud” is not a published book, and it is impossible to order it. If someone knows how to get a copy (in any form) of it, let me know, please.","date":"2014-06-02","mins":"6:31 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-48613","author":"andrea_nicolotti","post":"Hugh Farey : As for the words of Pope Stephen II, do we have a source? It does not exist. The sentence that sindonologists quote (attributed to Stephen III, not II) was not written by the pope but in reality is an interpolation of the X XI century..","date":"2013-10-24","mins":"11:43 am","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48618","author":"andrea_nicolotti","post":"David Goulet : What is your source for that assertion? You can see my book “Dal mandylion di Edessa alla Sindone di Torino”, pp. 121 127..","date":"2013-10-24","mins":"12:24 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48751","author":"andrea_nicolotti","post":"Matthias : I’m very interested in these words. Even if they date to 10th / 11th century, they strongly hint at referring to the shroud, which would add to quite an impressive array of historic literature that points to the shroud being of an age far older than the carbon dating suggests. I’d like to know more on this – Andrea when is your paper to be translated into English? Dear Matthias, I do not think that this interpolation hint at referring to the shroud, and much less “strongly”. This fantastic story has nothing to do with a shroud. As the mandylion has nothong to do with any burial shroud. When the book will be published, if you want I’ll tell you.","date":"2013-10-26","mins":"6:02 am","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48621","author":"andrea_nicolotti","post":"David Goulet : What is your source for that assertion? You can see my book “Dal mandylion di Edessa alla Sindone di Torino”, pp. 121 127. Would this be available online anywhere? I’m assuming then your assertion is based on original research. 1) No, is not online. But is going to be translated in English. 2) I always do original researches, but in this case is not necessary: to see that this sentence is not work of Stephanus, you can see, for example, the Christusbilder of E. Von Dobschuetz (printed in 1898: not exactly a “new” release…).","date":"2013-10-24","mins":"12:37 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-143705","author":"andrea_nicolotti","post":"I do not understand why you you lose so much time to comment things, usually meaningless, that Jones writes. It is a mystery to me. By the way, I think he did a good job with the scans of the newsletters, but unfortunately missing something fundamental: the page numbers of the original. So his work, for quoting with scientific purposes, it is useless, because it is necessary in any case to check on the printed copy..","date":"2014-08-13","mins":"11:39 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"}]
