[{"id":"comment-28862","author":"andrea_nicolotti","post":"Obviously from Italy I am seeing it on TV, but here the streaming is working well: http://www.rai.tv/dl/Rai TV/dirette/Publishing Block 64203784 70f7 4b53 9d21 b14693850195.html.","date":"2013-03-30","mins":"1:02 pm","url":"https://shroudstory.com/2013/03/30/breaking-news-links-to-see-the-shroud-now/","cat":"event","title":"Breaking News:  Links to See the Shroud Now"},{"id":"comment-126287","author":"andrea_nicolotti","post":"Charles, this is not “an important new avenue of research”. It was proposed first time on 1910 and repeated many times. But what Pulcheria brought to the Blachernae is not the presumed burial cloth of Jesus, but the bandage of His mother..","date":"2014-06-02","mins":"11:29 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126298","author":"andrea_nicolotti","post":"Charles, you hope, but I think your hope will be vain. Scavone published in 1989 his first relation about the (presumed) documentary evidence of the Shroud in Constantinople. Now we are in 2014, and he is going to repeat the same things, and we are still at the same point. I do not expect any kind of fresh idea in sindonological congresses from the historical point of wiew, particularly if outside Europe. I think it is the moment to stop at all with sindonological congresses, where people tell the same things to the same people, about an object closed in a case that they cannot see and study, and without any original research in the historical archaeological exegetical biblical field. But this is another vain hope..","date":"2014-06-02","mins":"12:15 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126560","author":"andrea_nicolotti","post":"Where Nikephoros Kallistos reported that Empress Pulcheria placed burial linens of Christ in Blachernae church?.","date":"2014-06-03","mins":"3:47 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126572","author":"andrea_nicolotti","post":"O.K, with your last answer you make clear, if still necessary, the difference between an historian and a sindonologist. If you are not able to read a language, do not speak about this language. If you are not able to find a document, do not quote that document. If you have not seen it, do not speak about it. If your papers are based on internet, books based on other books or unreliable sources (and, in case of Centini, very unreliable), do not write papers. You are not obliged to do it. You can love the Shroud and believe in God also without writing pseudo historical papers (like this one you have linked). Please, there’s no need to take offence, but this is why the sindonology, and in general this christian apologetic, is detrimental. Any discussion is totally useless, with you and 99% of other sindonologists that do what you do..","date":"2014-06-03","mins":"4:28 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126735","author":"andrea_nicolotti","post":"Mike, answer to your questions: 1) Centini is unreliable because I know him and his books, and he does not any analysis of the sources, but only copies from other books. He is not an expert, is an author of popular books based on secondary sources. A sort of populariser. So, he read this false statement about Kallistos in a book of sindonology, he did not check any primary source and just copied it. O.K read the book of Centini and copied it. And so on, from one to another book, without end. As I have just written, I found this error the first time in a book of sindonology in 1910 and now we, in 2014, are still here at the same point. 2) My 99% comes from my experience, because I have read several hundred books and articles about Shroud, and 99% are written with the same technique: repetition, recopying and guessing. 3) You ask me if I have any primary source. Obviously yes. But your question is misleading. OK wrote a statement based on a byzantine source, I asked the source and he admitted that never saw the source. You must ask him or Centini the source, not me. I am not the author of the statement. 4) My problem is not O.K. Or Centini or any other person, is all the method sinonologists use 5) “Gibberish” means “unintelligible or meaningless language”. But my language is very intelligible: if you are not able to read a language, do not speak about this language. If you are not able to find a document, do not quote that document. If you have not seen it, do not speak about it. Very clear. Not gibberish, nor ad hominem attack. A simple rule of historical method. Rule number one. If you want to learn German, and your teacher does not speak German, you can tell him that if the wants to be a teacher of German, he must know German. It is not gibberish, nor ad hominem attack. It is common sense..","date":"2014-06-04","mins":"6:58 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126853","author":"andrea_nicolotti","post":"“I do not say that Centini is unreliable as an author, but he can hardly be ranked as a specialist in ancient Byzantine history”. This is said with charity. You are very kind. Surely, if someone writes 13 books in a year, I do not have charity for him..","date":"2014-06-04","mins":"5:38 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126744","author":"andrea_nicolotti","post":"Mike, your answer is very appropriate. Centini is perfect, O.K. Is right, you too, I am a sinner I have a log in my eye, and today is cloudy. Ciao.","date":"2014-06-04","mins":"7:27 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126863","author":"andrea_nicolotti","post":"Nicephoros in Historia ecclesiastica XIV,2 nd XV,14 speaks about the translation at the Blachernae of the burial bands (ἐντάφια σπάργανα) of Holy Mary by Empress Pulcheria. The chapters I.32 33 you quoted (from Centini) do not speak absolutely about Blachernae in any form..","date":"2014-06-04","mins":"6:21 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127011","author":"andrea_nicolotti","post":"Obviously. If not, I would not have said it.","date":"2014-06-05","mins":"7:26 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127023","author":"andrea_nicolotti","post":"You can find the text in Migne, PG 145 147. All Migne is online. To your question about how the misconception with Jesus’ burial linens might have arised, the answer is that as sindonologists want to find the Shroud of Turin at the Blachernae, they are inclined to force the history to put it there. And as they normally do not check their sources, misconceptions can survive for many many many years..","date":"2014-06-05","mins":"8:41 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127113","author":"andrea_nicolotti","post":"145: https://archive.org/details/patrologicursus11migngoog 146: http://books.google.it/books?id=mp NBAAA Ac AAJ&redir esc=y 147: http://books.google.it/books?id=r Ie6 FD Ueeg8 C&redir esc=y Irrilevant, not irrilevant… it is the method that does not work. This was only an example. Also the page you linked (https://shroudofturin.files.wordpress.com/2014/05/burial linens of constantinople.pdf) is constructed with the same method, without serious quotations, without checking the texts, without any knowledge of the scientifical literature. Sindonologists and internet are the only source for you, it seems. The few texts quoted in Greek and Latin sometimes are wrong, sometimes the translation does not correspond to the original. It seems that you have no idea about this matter. And also, there is lack of critical approach to the texts. It seems that you are like me, if I try to write a paper on astrophysics…. Obviously, all people sometimes is wrong, and I am too… but this is not question of oversights… At the end, you can do what you want, but when I see that this is the normal standard for sindonologists, in the last century, I can say and repeat that 99% of sindonology is detrimental. P.S. What Kallistos said is not so important, because if we have not other earlier sources, his statements about what Pulcheria did nine centuries before are very questionable.","date":"2014-06-05","mins":"4:34 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127248","author":"andrea_nicolotti","post":"My aim is not to refute your paper. I have tried to explain that I consider your method unreliable, so from my point of wiew it is useless to start discussions about papers written in such a style. I think that now we have clear our positions, and we can draw our own conclusions. Thank you for the discussion..","date":"2014-06-06","mins":"5:59 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127275","author":"andrea_nicolotti","post":"1) I know that you try to perform critical analysis of whatever you have, but I think that you cannot do it properly, because you have not methodology, knowledge and means. And I am not saying that you DELIBERATELY falsifies the texts. It is not question of volition. The “critical analysys” of historical sources is not something you can “try” to do. It is the result of long academical studies and practice, everyday. If we (historians, philologians) exist, there is a reason, or not? Or if we have not reason to exist, and all people can do what we do with succes, this could be applied also to ALL professions: doctors, engineers, physicists, chemists … 2) Yes, I refer to your paper. The Greek text is wrong, the translation is not consistent with the text, the Latin text is quoted in an uncorrect way. 3) Surely I am irritating. Because I am a little brusque, and English is not my language, nor my preferred language. But if you want to believe me, I assure you that I am a very peaceful and understanding.. Not on blogs, perhaps. But prejudiced, NEVER. What I say is not fruit of prejudice, is fruit of years passed studying and reading sindonological literature. I am post judiced, not pre juidiced. The judgement of the work of others is part of my job. It is an obligation for me, not a caprice.","date":"2014-06-06","mins":"7:53 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127284","author":"andrea_nicolotti","post":"<<<<<The Greek text is from Scavone and the translation is his own paraphrase. <<<< This is not a justification, is another proof that your work is only a work of recopying. And when you copy wrong things, you are not capable of realizing that they are wrong.","date":"2014-06-06","mins":"8:29 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127287","author":"andrea_nicolotti","post":"Web sites and books of sindonology are not adequate “sources”. Your paper is not “scientific”, surely, but it is not correct, too. I think that the only proper thing you can do is cancel this paper from internet, because we have just on the web a lot of uncorrect informations, and we do not need one more (that will be read, linked, quoted, etc. Etc.). If you want to conserve it, don’t ask me to make it a little less uncorrect. It is contrary to my principles of seriousness, I am sorry.","date":"2014-06-06","mins":"8:40 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127318","author":"andrea_nicolotti","post":"I do not believe that it could be a good lesson for you “poor, naive, copying everything sindologist”. The only good thing that, in my opinion, you could do, is to cancel a lot of pages from your “Apologetyka” websites. But I am sure you are not going to do it. So, what you call “a good lesson”, it is only the occasion for you to correct some mistakes, without changing the general approach of your website, that I do not approve at all. So, I will not help you to improve something I do not consider improvable. At the contrary, I hope that someone, reading your site and seeing the mistakes, realize earlier and easier that it is not unreliable. Again, it is not because of you, it is because of what I consider my seriousness. When some days ago I said that 99% of sindonologists make history as you do, someone said that I am not objective. So, if it is true, you will find a lot of sindonologists with perfect knowledge of Latin, Greek and ancient sources that shall help you to correct all mistakes, without asking me, “prejudiced or irritating skeptic”, as you called me..","date":"2014-06-06","mins":"12:07 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127323","author":"andrea_nicolotti","post":"[that it is not unreliable = that it is not reliable].","date":"2014-06-06","mins":"12:25 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-162045","author":"andrea_nicolotti","post":"I think Fanti (even if he is not head of any departament, and cannot be it) is a sindonologist very useful and necessary. When I need to explain what is sindonology, I tell what Fanti believes and all understand immediately..","date":"2014-10-13","mins":"2:17 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-162095","author":"andrea_nicolotti","post":"Courage? Shroud haters? Be man? : ))))) Mah…..","date":"2014-10-13","mins":"5:10 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""}]
