[{"id":"comment-45788","author":"andrea_nicolotti","post":"No, is the blood that flowed from an image of the crucifix in Beirut.","date":"2013-09-29","mins":"6:00 am","url":"https://shroudstory.com/2013/09/29/blood-from-a-picture-of-christ-links-to-the-shroud/","cat":"history","title":"Blood from a picture of Christ: Links to the shroud?"},{"id":"comment-45806","author":"andrea_nicolotti","post":"Yes, all is “una traccia del passagio della Sindone” da ovunque a ovunque uno vuole..","date":"2013-09-29","mins":"9:33 am","url":"https://shroudstory.com/2013/09/29/blood-from-a-picture-of-christ-links-to-the-shroud/","cat":"history","title":"Blood from a picture of Christ: Links to the shroud?"},{"id":"comment-78839","author":"andrea_nicolotti","post":"Max Patrick Hamon : An Italian specialist, Andrea Nicolotti, has proposed that the locution “ Ecce suaire Jesu Christi” ou “Here is the shroud of our Lord Jesus Christ” [Nicoletti totally missed the U in Gothic script with E embedded within and the “h” in Gothic script in JHV!] As I said in another thread, I do not see any U. So, I remain with the “ecce suaire Iesu Christi” that I proposed in january 2013. But it is a suggestion. Your suggestion “vergy” and “Charny” could be interesting, if the V or U could be seen..","date":"2014-02-12","mins":"8:59 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-79901","author":"andrea_nicolotti","post":"Excellent Mr. Max Patrick Haman, I’ll asap answer to your posts. No, I have not published any article about “carved Gothic script”, but I will read all articles you wrote about it. I wait for the references. And also I wait for examples where the colon “:” is a contraction for NOSTER DOMINVS. All these references, Mr. Hemon, could be useful for my “homework”, as you call it Thank you. Your Italian “not specialist”..","date":"2014-02-16","mins":"9:17 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-94739","author":"andrea_nicolotti","post":"Mr, Hamon, I cannot find your article because the publication “Loches, Graffiti anciens, “QUATRIEME RENCONTRE 2006” is practically impossible to find. And it is not exactly the kind of publication I had imagined. No problem. It is not important. I still wait for: 1) an example of the “dual letter” (an E within a U). 2) the colon “:” as a contraction for NOSTER DOMINVS. Thanks.","date":"2014-03-29","mins":"8:43 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-171188","author":"andrea_nicolotti","post":"I remember also that the only serious study about the textile structure of the Shroud DONE BY AN EXPERT OF HISTORY OF TEXTILES is still G. Vial, Le Linceul de Turin. Étude technique, in «Bulletin du Centre International d’Études des Textiles Anciens» 67 (1989), pp. 11 24; Id., À propos du linceul de Turin, in «Bulletin du Centre International d’Études des Textiles Anciens» 69 (1991), pp. 34 35; Id., À propos du Linceul, in «Montre nous ton visage» 10 (1993), pp. 27 30. The first part was also translated in English in «Shroud Spectrum International» 38 39 (1991), pp. 7 20..","date":"2014-11-14","mins":"6:37 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171181","author":"andrea_nicolotti","post":"Hugh, the difference between herringbone and chevron, in the textile language AMONG HISTORIANS OF TEXTILES is not what you say. Herringbone is used to identify a kind of chevron, a “warp chevron” (as in the shroud). But as “herringbone” is not so well accepted in scientifical language, it is better to say, describing the shroud, “chevron twill” or “warp chevron twill”. What you call herringbone, defined by the alternate staggers of the weft threads, must be called “broken chevron twill” (that could be either a warp chevron or a weft chevron). I know that the matter is complicated, but the language among historians and among experts of MODERN weawing is not the same..","date":"2014-11-14","mins":"5:29 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"}]
