[{"id":"comment-157762","author":"andrea_nicolotti","post":"The signature of Giotto is much more visible than Jewish coins. Http://www.nannimagazine.it/ resources/ documents/Uploaded Files/File/sacrasindone%281%29.pdf.","date":"2014-09-29","mins":"3:52 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157771","author":"andrea_nicolotti","post":"Capricious? You do not see “Giotto”?.","date":"2014-09-29","mins":"4:36 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157790","author":"andrea_nicolotti","post":"You remember Piero Ugolotti, the father of the inscriptions on the Shroud? People do not know that he saw also the decrees of condemnation issued by Pontius Pilate nailed on the face of Christ. And the nails would have been stuck in the eyes, causing the leakage of aqueous humor..","date":"2014-09-29","mins":"6:58 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157980","author":"andrea_nicolotti","post":"«If we follow the thread of his pseudo demonstration, the very face of the TS man should be not on the shroud either and should be nothing else but a pareidolia»….. I do not comment this statement because is clearly nonsensical. And the negative pareidolia does not exist. In fact, the discussion on this topic is useless, and my intervention is also useless. I am convinced that I am not able to discuss with people who see flowers, coins, and other things on the shroud, and also with those who see the Shroud in the code Pray. It seems pointless to me to discuss what I consider the evidence. Simply, my brain works differently and so there is no chance that I can discuss on this topic. I have to shut up. P.S. Ugolotti showed to Marastoni his manipulated photographs, and Marastoni tried to read. Then Messina has manipulated other photographs and tried to read Hebrew words; showed them to father Orecchia, and also Orecchia tried to read them (but today he has changed idea about it….) Then Marion did the same. Then Frale did the same. Then Castex and Ventutini. Then arrived Giotto. Then Leonardo da Vinci (but sindonologists don’t like this kind of inscriptions, they see only Hebrew, Latin, flowers and coins from Jerusalem). If you want, I can read letters too. I also read the clouds, but I do not think that what I read is real. My mother saw many other things on the shroud, she is very imaginative. You do not need a palaeographer, because a palaeographer reads what is visible, and no one doubts that there are letters on his manuscripts. You do not need a palaeographer to read the “letters” on the Shroud, because they are so easy to “read” by anyone who knows the Latin alphabet. The palaeographer is expert in reading unintelligible handwriting, not in seeing what is not visible. I read manuscripts, but I see the letters exactly how all people see the same letters : the only difference is that I am able to understand those graphic signs, when normal people does not understand them. They see them, but they not understand them. I do not know Arabic, but I see the Arabic letters on a book. “To decipher” and “to see” is not the same thing..","date":"2014-09-30","mins":"8:56 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157999","author":"andrea_nicolotti","post":"“He cannot discuss and yet keeps commenting”. Yes, you are right. But I have just finished now. I was not able to remain in silence, only because sometimes the argument seems to me very fun and I cannot resist….","date":"2014-09-30","mins":"10:08 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"}]
