[{"id":"comment-12674","author":"andrea_nicolotti","post":"Thank you, David, for ponting out the Acts of our congress. My article is only a very abbreviated version of my book about the mandylion, descripted here: http://unito.academia.edu/Andrea Nicolotti/Books/951200/Dal Mandylion di Edessa alla Sindone di Torino. Metamorfosi di una leggenda.","date":"2012-06-18","mins":"12:15 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12308","author":"andrea_nicolotti","post":"I won’t enter this discussion because I don’t know the new documents, and I think that now is better to wait in silence. But there is an important thing, that Gabriel wrote here and made me feel flabbergasted. “Studi medievali” is one of the most important academic reviews in the world dealing with medieval history. It is known by all medievalists. It was established since 1904, and still has in its directive committee among the most important scholars. The Italian school of medieval history is among those with the most ancient tradition and value in the world. The “JCR ranking system” mentioned by Gabriel doesn’t have any importance in the field of the historical studies, especially for the publications not made in English language. Therefore, to make a classification of reviews according to that method, means having no idea what is the historical research. And the same can be said about the “Journal of Biblical Literature”. If “Studi medievali” has a “very low credibility”, I can say that “Nature” is a parish magazine. Please, let us avoid foolishnesses..","date":"2012-06-12","mins":"12:40 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12314","author":"andrea_nicolotti","post":"Gabriel, 43 journals of history are nothing. What is inside JCR is not important for me, and for the scholars of our field. So I am not sorry at all. You are not obliged to know the medieval history or the importance of our reviews, but please, if you do not know, do not judge..","date":"2012-06-12","mins":"1:22 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12323","author":"andrea_nicolotti","post":"Gabriel, I am not so interested on peer reviews and classifications among journals: it is a mostly American illusive mania (and we saw, with mr. Kouznetsov, how is unreliable) that, on humanistic field, generates only bad scholarship and detrimental competitions. But I could not omit to say how was wrong your statement about the value of “Studi medievali”, one of the most renowed reviews about medieval history on the world. Obviously, the validity of any article has to be judged reading it; I cannot understand why here so many people is speaking about what is not yet published..","date":"2012-06-12","mins":"2:02 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-15724","author":"andrea_nicolotti","post":"Kind Davor, I do not know if I am the devil or not (maybe a devil without self consciousness?). I have written a big book on diabolical possession, perhaps this was not without consequences. Perhaps you are right, but I am sure that the problem of languages is maybe not the only problem, but one of them. And it is easier make battles with internet pages, than refute scholar publications: when a book is too deep or difficult, is better to ignore it. By the way: ony now I see that the “dissection” of Stephen E Jones you pointed out. It is… embarrassing. I have opened a page at random. I read: “A 10th century codex, Codex Vossianus Latinus Q 69 found by Gino Zaninotto in the Vatican Library [wrong: the Vossianus is in Leiden and was not found by Zaninotto!] contains an 8th century account [wrong: the account can be of the 8th, 9th or 10th] saying that……. The source is Wikipedia. For me is enough to close it..","date":"2012-09-02","mins":"12:09 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15738","author":"andrea_nicolotti","post":"Daveb: I did not see in Freeman’s paper an attempt to address Jack Markwardt’s modification of Wilson’s hypothesis, that the Shroud was kept in Antioch until the the 6th century; nor Scavaone’s modification that it was kept in Besancon after being sent to Athens, rather than being held by the Knights Templar. Both of these hypotheses seem more credible than Wilson’s primary hypotheses. MORE CREDIBLE? 1) the Shroud was kept in Antioch: invented. 2) the shroud was in Athens: invented. 3) Was held by the Knights Templar: invented. It seems that anyone can invent something, and shroudies transform it in an “hypothesis”. If one is false, the other one maybe is true. Please, this is not history. Is Dan Brown. As far as I am aware his is one of the few attempts to vest the Shroud with some kind of historical provenance prior to the 14th century, and thus oblige a sceptical world to take it more seriously, than it had hitherto. You said well: “some kind of historical provenance prior to the 14th century”. Any kind of. The important is not if it is true, the important is to say *something*. Athens, Rome, Edessa, Antioch, Besançon, Constantinople, everywhere. I add Cabot Cove..","date":"2012-09-02","mins":"5:42 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15744","author":"andrea_nicolotti","post":"Yannick, can you tell me where are these 2 or 3 ancient sources?.","date":"2012-09-02","mins":"6:01 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15753","author":"andrea_nicolotti","post":"Ron, I know not 2 or 3, but even more “ancient” alleged sources, but all what I have examined is false, or invented, or mistranslated or non correctly understood. So I was asking Yannick where are these sources, because I have not found any kind of these sources. As I have read so many books and articles for one year about the shroud, from the morning to the night, before writing something, I think is difficult that such important sources are escaped from my research. Concerning the book I wrote: before we were speaking about the Mandylion, and not about Athens. I have dedicated a book only to the mandylion theory, and there I study the supposed history of the Shroud from Edessa to Constantinople. But no problem! The theories about the presence of the Shroud in Athens or elsewhere, from 1204 to 1350, are examined in another book I have published six month before the other one, so I am well informed also on this. So, I hope that you are not thinking about “chartularium culisanense” or other forgeries like that…… Because, excepting the forgeries, I repeat that I have not found any source..","date":"2012-09-02","mins":"7:38 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15841","author":"andrea_nicolotti","post":"Daveb, few words, because for me the discussion here is not useful and I desire to close it. You showed me not some scholar article, or recognized historical research, but three pdf from shroudie conferences. Please, ask yourself why these kind of pseudo historiography lives only among shroudies. 1) Markwardt paper says that Shroud was in Antioch. No proofs of it, only conjectures or legendary texts, sometimes not well read or interpreted. What no one historian can use to proof something. I know a lot of theories like that, that “prove” that the Shroud was everywhere, in Antioch, in Jerusalem, in Rome, in Costantinople, in Alexandria. Obviously all are in contradiction among them, because all are false. But as shroudies do not know all them, but retain only what they like, they choose one and believe in it. Again: invented. 2) The second paper is even worse. Markwardt cites an Athanasius’ text speaking about an “icon”. What a discovering! Maybe we have to be grateful to this shroudie historian that in 2008 discovered a new text that until now we ignored. The only problem is that every true historian with a minimum ok knowledge of the ancient christian literature knows that this text is not of Antanasius, that this text is pertaining to a painted image of Christ made by Nicodemus (do you believe also in that?), and obviously that this text says nothing about any shroud. Mr. Markwardt clearly has not idea about what is speaking of. Again: invented. 3) Scavone is incomparably better than this Markwardt. No comparable. But has a similar problem: no proofs. He uses Wison’s book as a “shroud bible” (quoted) and his theory about Othon de la Roche is based on these arguments or documents: 1) The letter of Theodorus Angelus to the Pope. A modern forgery. 2) Some words written by Nicola di Otranto about Christ’s bands (the Shroud is made of bands?) not well interpreted and used in a shroudie perspective. 3) The conjecture that Otho had a shroud from the Blachernae palace because garrisoned in this palace in 1204. Said without proofs (by another shroudie, but obviously taken as true without any control, because many shroudies believe any conjecture useful to “support” their theories, and despise all the rest) 4) a tomb of Othon in France described by the shroudie chemist Alessandro Piana; but the tomb is not a tomb of this Othon, and it is interesting that this tomb has an inscription in Latin of 8 words that was copied by Piana with 3 mistakes (good wok!), that Scavone repeated. I wonder if they know some Latin. 5) Scavone adds another invention: the Shroud was brought to Othon by Pons de Chaponay in1219. The proof? They were friends! I have explained all this in my book and now I cannot summarize here, but ony I say that in this manner surely I can demonstrate that the Shroud was in Cabot Cove, discovered by Jessica Fletcher. Please, open your eyes..","date":"2012-09-04","mins":"10:42 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15855","author":"andrea_nicolotti","post":"Post scriptum: opening at random the document of Markwardt, I see another funny pretended PROOF of the presence of the Shroud in Antioch: the Gospel of Hebrews. Markwardt wrotes: “Although the lost second century Gospel of the Hebrews related that Jesus gave his Shroud to “the servant of the priest”, scholars have suggested that, before falling victim to a copyist’s error, this text had actually stated that the Shroud was given to Peter”. Interesting. Who are these “scholars”? In the footnote we find… Ian Wilson!!! What a coincidence! Wilson is a source? Surely. Only we, academic historians without faith, we are headstrong in looking for authentic sources. And the book of Wilson is not a source. But obviously Wilson is not responsable of such a complex theory. The responsable is…. Another shroudie, J.T. Dodd, that in 1931 published a very “disinterested” article intitled “The Appearance of Jesus to The Priest’s Servant, as Recorded in the Gospel of the Hebrews, and The Holy Shroud”. A guarantee! Which is the idea of this Dodd? That where in the Gospel of Hebrews is written “dedit sindonem servo sacerdotis” (he gave the sindon to the slave of the priest) we must read: “dedit sindonem Petro” (he gave the sindon to Peter). Why? Because he wants. Any manuscript says that? No. Any translation? No. Any old translation? No. Any other scholar? No. And why he wants to make such a manipulation? Because, Dodds thinks, if this shroud was given to the Jewish priest, it was not on the christian hands of Peter, and also the account of the Gospel of John is wrong. Impossible for Dodd to understand that the Gospel of Hebrews is not an historical reliable source. He MUST save this little sentence because it remembers his loved shroud! And now, after 90 years, shroudie Mr. Markwardt can use the manipulation of his shroudie ancestor Mr. Dodd to write in his article that Peter had the Shroud and brought it in Antioch (conjecture+conjecture=reality). “Scholars” says that. In the meantime, the editions of the Gospel of Hebrews have not this manipulated text, and the rest of the academic world knows that in the Gospel of Hebrews is written “he gave the sindon to the slave of the priest”. Stop. The “scholars” thinking what Markwardt says, are only in his own fantasy or in the book of Wilson. But surely all scholars are obstinate incompetents and Wilson and Markwardt are right. The American congress of the shroudies will say the truth. : ) I have a new hypothesis: the Gospel of Hebrews has to be corrected like this: “dedit sindonem servo regis” (he gave the shroud to the servant of the KING). The king is Abgar of Edessa, his servant is Ananus. All make sense. So, the Shroud is the Mandylion. Now we have the proof. Please, invite me to the next shroudie congress. : ).","date":"2012-09-04","mins":"6:52 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15755","author":"andrea_nicolotti","post":"Yannick, I agree with you. What I do not know, is if Wilson is an “opportunist”. With me both Scavone and Wilson were kind, not as other shroudies. I think both are not good historians, but to be in disagreement does not mean to be enemies. I think also Guscin wrote some wrong things, but I had with him and he had with me a cooperative behaviour. I have appreciated, for example, that Wilson wrote a terrible review of the Barbara Frale’s books, that are maybe a biggest falsification of the last 30 years about the Shroud, having read my arguments against her. Maybe he did it because Frale was manipulating his theories presenting herself as the authentic “discoverer” of them? Or because he realized that Frale was untruthful with him? Or because of the love of the truth? I do not know, but he did it. About shroudies and history, the problem is simple: as until now we have not documents about the Shroud before 14th century (I hope that something will be discovered, but UNTIL now we have nothing), the only history that a “real” historian can write is the history of the “idea” of a shroud, the history of the relics in general, or the history of the alleged false sources about the Shroud. The last one started in the 16th century and is continuing now, with a growing vitality. Is what I am doing now, studying the sindonology as an example of pseudo historiography. As usual, with few exceptions, the pseudo historiography normally lives outside universities and is rejected or ignored by the scholar academical world. But is very pervasive because is propagandized in popular books and media, and believed by people not ready to understand what is wrong and what is true. Normally the pseudo historians are not professionals, and always are inaccurate, superficial, unreliable and conjectural in what they write. Normally they work with religious or political arguments, that can reach the emotivity of the not so historically educated people. As here: people WANTS that someone find documents about the Shroud in the centuries 1 14, so they – with or without consciousness – provide them what they want. I assure you that the study of the pseudo historiography is not easy, but very instructive. And also funny. Obviously, the “normal” historian will not sell so many books, but… for me this is not so important..","date":"2012-09-02","mins":"8:38 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15771","author":"andrea_nicolotti","post":"Some answers for carlos: <<<<<<¡Teníamos pseudo ciencia y ahora tenemos pseudo historiografía! ¡Ja,ja,ja…!<<<<< Carlos, la pseudo historiografía no es un invento creado para molestar a los sindonologos. Se enseña en la universidad, es parte de la metodología de la investigación histórica. Hay ejemplos de esto en los manuales, hay una larga tradición de lucha contra la pseudo historia. Si no sabes, es porque no es tu trabajo. Y no te importa la historia, estás interesado en la Sábana: la historia puede ser sólo una manera de confirmar lo que quieres oír. Puedes reír, pero en ese caso risus abundat in ore stultorum. <<<<<<<Son muy interesantes algunos de los comentarios de Marinelli sobre los últimos libros de Nicolotti:<<<<>>¿no encuentra extraño que los “eruditos” que atacan la identidad de la imagen de Edesa con la Sábana de Turín sean anti Shroudies?<<<< No encuentras extraño que los “eruditos” que atacan Dan Brown sean cristianos ? By the way : nadie « ataca ». La identidad de la imagen de Edesa con la Sábana no es una teoría que alguien acepta otro ataca. Es una teoría de sindonologos escrita por sindonologos. Nadie afuera la acepta. De ahí no sale. Y ahí permanecerá, en los blogs de sindonologos, y en los libros y escritos por sindonologos que no saben cómo vivir sin ella. Si te gusta el gueto, quédate ahí. A mi no me pasa nada..","date":"2012-09-03","mins":"6:09 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15772","author":"andrea_nicolotti","post":"I do not know why, but in the last post the central part of my answer was lost: <<<<<<<Son muy interesantes algunos de los comentarios de Marinelli sobre los últimos libros de Nicolotti:<<<<< Sí, muy interesante. Yo escribí 400 páginas buscando fuentes y documentos como nadie lo había hecho antes, en griego, latín, siríaco, árabe y armenio, y recibí la aprobación de TODOS los otros historiadores que hasta hoy se exprimieron. Demostré la falsedad de los libros de Frale y muchas otras cosas, como por ejemplo la falsedad del cartulario culisanense. Y los sindonologs qué hacen? Publican en su revista de sindonología un comentario escrito por una sindonologa licenciada en ciencias naturales, que ni siquiera puede entender lo que yo traduje, que (muy nerviosa porque he demostrado cuanto es equivocada cuando escribe, i cuanto le gusta copiar lo que otros escriben) manipula lo que escribí y no dice nada de lo que estudié, porque no le gusta. Calos, si te gusta el gueto, quédate ahí..","date":"2012-09-03","mins":"6:38 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15775","author":"andrea_nicolotti","post":"<<<<<it is undeniable that at some point in the history of the Image of Edessa, some writers were convinced, for whatever reason, that it was indeed a full body image on a large cloth that had been folded over (possibly in such a way that only the face was visible), and that it did contain bloodstains<<<<< The problem is not what Cameron likes, the problem is ONLY that what Guscin wrote is not true..","date":"2012-09-03","mins":"7:20 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-16042","author":"andrea_nicolotti","post":"Ron : Why has no true historian written a paper and made it accessible to all on Shroud.com? Thank you. R Ron, Guscin wrote a book and some articles, and the sentence you quoted is taken from a book, not from Shroud.com. Historians write books and articles, and Shroud.com is not a place to make historical discussions or publish articles. I do not see differences. But maybe if Shroud.com is interested, they can ask historians to reproduce their papers, and perhaps sometimes will be possible..","date":"2012-09-09","mins":"4:25 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15779","author":"andrea_nicolotti","post":"Carlos, el problema con la sindonologia pseudo historica es también problema de DATOS, antes que de INTERPRETACIÓN DEL DATO, debido a que los pseudo históricos generalmente no conocen los datos, los manipulan, traducen mal, conocen parcialmente. Déjame darte un ejemplo con ti mismo. Acabas de escribir: “¿Cómo se digiere que Robert de Clari NO VEA la imagen de Jesús y SI VEA la imagen de la Virgen?”. Esto demuestra que tu también tienes problemas con los datos. Porque nunca, en su libro, De Clari asegura haber visto algo el la iglesia de las Blachernas. Esto sería el FUNDAMENTO del la interpretación, pero te falta. Todo lo demás, lo expliqué en un artículo publicado en una revista de estudios bizantinos. Pero tu no la leíste. Así que estás hablando de lo que no sabes. Lo único que sabes es que lo que yo digo no te gusta porque no está de acuerdo con tu idea de Sábana. Eres un perfecto pseudo histórico..","date":"2012-09-03","mins":"8:33 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15720","author":"andrea_nicolotti","post":"I think the biggest problem for shroudies is a linguistic problem. Since most of the shroudies is not a professional scholar, and does not have language skills – which is in general a very serious problem among English speaking people – they have no knowledge of what happens outside the English speaking countries. Generally, therefore, ignore what is written in Europe in nations that have a very strong tradition in humanistic studies, that use German, Italian, Franch, and also Spanish languages. The criticism that Freeman and others now focus on the theory of Wilson, like many other critics in general, have been discussed many times there. In Italy by prof. Pier Angelo Gramaglia, for example, more than twenty years ago, even in scientifical reviews. And when (not so often) the same things are written in English, it seems that are new things! In reality, you are discussing things just discussed twenty years ago. Even I have written an entire book last year about Mandylion of Edessa and the Shroud, certainly the most thorough analysis of all the arguments from the historical and philological point of view. Surely outside Italy and outside academic circles, it will be totally ignored. If someone wants to discuss historical issues, he has to study foreign and ancient languages. It will be surely also a great gratification for him, I’m sure.","date":"2012-09-02","mins":"9:01 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15783","author":"andrea_nicolotti","post":"Reacción típica de pseudo histórico. Dice una cosa. Alguien dice que no es correcta. El cambia de tema. Antes has dicho que Clari vió la Sydoine. Te digo que no està escrito. Entonces usted dice que *tal vez* la vió, pero no es tan importante. Y de ahí se pasa a la siguiente objeción. Ahora descubrimos que tal vez De Clari no era un testigo presencial. Entonces, si hubieras estudiado De Clari, habrías descubierto que escribió su crónica no en Constantinopla, pero algunos años más tarde, cuando regresó a Francia. A continuación, habría constatado que comete varios errores en la descripción de Constantinopla. Y también que era analfabeto, y su testimonio lo escribía otra persona en su lugar. Y que era muy crédulo, y cuenta episodios que nadie creería. Entonces se verá que dice que el Mandylion estaba en una iglesia en el otro lado de la ciudad, así que si él dice la verdad eso es una otra prueba que Wilson aún más està equivocado. Entonces descubrirías que su cuenta de la historia del Mandylion es tan equivocada que queda claro que sus fuentes no eran buenas. Por último, se descubriría que su relato de lo que ocurre en Blacherne es contrario a toda la mas segura tradición bizantina y latina. Uno contra todos. Y màs: 1) Dice: “Su problema es: 1. Probar que NO la vió”. Es exactamente lo opuesto. 2) La transcripción de la versión francesa, que me has dado, no es buena. Curiosamente la veo en el Internet. Tal vez ha copiado desde allí? 3) para mi, despues un LARGO ESTUDIO de toda la obra de Clari e de TODOS los testimonios sobre la iglesia de Blachernae, Clari està equivocado. Pero el porqué no se explica en un blog. 4) « La viera o no la viera….”. No, Carlos. La viera o no la viera no es lo mismo. 5) Si en Blachernas habia una sàbana con la Imagen de Nuestro Señor en Constantinopla – yo no lo creo – no sabemos nada sobre sus orígenes y su realidad. Podría ser cualquier tela con la imagen de Cristo muerto, como muchas estaban en ese momento, con una función litúrgica que Clari, siendo francès, no entendìa. Y si estaba, no hay razón para pensar que era la misma que 150 años más tarde aparece en Lirey. Pueden ser objetos independientes, o incluso ser una copia de la otra, o ser dos entre muchas que existian. Así que este testimonio no cambia nada, sino para demostrar (si fuera verdadero, y yo no lo creo) que ya en el siglo 13 alguien dijo que existian sàbanas con imagen. Lo cual es interesante, pero no cambia la historia de la sàbana de Turin. Eso no me preocupa y tampoco me “desagrada”. No soy un fanatico de la Sábana. No soy un sindonologo ni un anti sindonologo. Simplemente, no me importa..","date":"2012-09-03","mins":"10:25 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15794","author":"andrea_nicolotti","post":"“a large rectangular piece of fabric/cloth (sindon in Greek)” LOL “four times longer than wide (tetradiplon in Greek)” LOL You are right, academics and art historians are all wrong. Save the world!.","date":"2012-09-03","mins":"2:00 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15806","author":"andrea_nicolotti","post":"There is a minimum level below what is not possible to fall. Y no me gusta que me tomen el pelo. Quis habet aures intendiendi, intendat..","date":"2012-09-03","mins":"4:25 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-16154","author":"andrea_nicolotti","post":"Ron, two answers: 1) I have written a short article about the mandylion in a book called “Sacre impronte e oggetti non fatti da mano d’uomo”, that you can freely find on google and also download. It contains other papers by other historians. For me is very difficult to write in English, and nobody translates it for me, so… is useless to send to an American web site a paper in italian just published on internet 2) I have written an entire book about the mandylion and the Shroud, but this is not free and I cannot put on internet (the editor has the property). And again, it is in Italian. I think it would be very difficult that some people here will translate it in English to publish it in English and “to helping all understand better” … : ))).","date":"2012-09-11","mins":"5:21 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-47825","author":"andrea_nicolotti","post":">>>> I do not know if our information is contemporary, or if the first known information comes from a copy of a copy of a copy many years later. Does anybody else?<<<<>>>>For two years the shroud disappears, and then requires the testimony of three bishops and ten noblemen to establish that the one which has mysteriously reappeared is the same one as disappeared two years previously. I wonder why. Wasn’t it obvious? Or were there dark suspicions that the original may in fact have been destroyed?<<< “Le Saint Suaire de Chambéry a Sainte Claire en Ville (Avril Mai 1534)”, which was published in 1891 by Abbé Léon Bouchage. > It is only the edition of the text you can find, in a better edition, in the Chevalier’s 1903 book (doc. P). If you write to me a personal email (andrea DOT nicolotti AT unito DOT it) I can send you this text, or both..","date":"2013-10-17","mins":"8:03 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-47827","author":"andrea_nicolotti","post":"Excuse me for the horrible form of my answer. I intended to answer to Hugh Farey, quoting some of his sentences, but… : ).","date":"2013-10-17","mins":"8:06 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-47828","author":"andrea_nicolotti","post":"Again: Hugh said: “I do not know if our information is contemporary, or if the first known information comes from a copy of a copy of a copy many years later. Does anybody else?” In order of time, the essential sources are: 1) Francesco Adorno (1578) 2) Filiberto Pingone (1581) 3) Giovanni Tonso (1596) 4) Giuseppe Cambiano di Ruffia (1606) 5) François Capré (1662) Only Pingone says to have been present during the fire. On 1532, he was eight years old. We have not other reliable testimonies. Obviously, Pingone’s history is highly exaggerated (miracles, enormous fire, rescuers of the shrine protected by a divine rain, etc.). Hugh said: “For two years the shroud disappears, and then requires the testimony of three bishops and ten noblemen to establish that the one which has mysteriously reappeared is the same one as disappeared two years previously. I wonder why. Wasn’t it obvious? Or were there dark suspicions that the original may in fact have been destroyed?” Some people said that the Shroud was destroyed by the fire: François Rabelais (1534), Antoine Froment (1534), Calvinus (1543), Michel Roset (1560 circa) Hugh said: “….Le Saint Suaire de Chambéry a Sainte Claire en Ville (Avril Mai 1534)”, which was published in 1891 by Abbé Léon Bouchage.” It is only the edition of the text you can find, in a better edition, in the Chevalier’s 1903 book (doc. P). If you write to me a personal email (andrea DOT nicolotti AT unito DOT it) I can send you this text, or both..","date":"2013-10-17","mins":"8:09 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-50184","author":"andrea_nicolotti","post":"John Klotz : It’s the detailed report of the STURP team and the peer reviewed articles that demonstrated that fact It is interesting/curious to me to see how is important, for the people in this blog, if an article is published under the control of the mechanism of the “peer review” (I ma speaking now indipendently from the Shroud or mc Crone etc. Etc.). Most of you are not European?.","date":"2013-11-06","mins":"9:22 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49932","author":"andrea_nicolotti","post":"Josey, surey there is a lot of people as you describe. Their behaviour is exactly the same of the sindonologists. Because they (both) do not study the shroud, they use the shroud to their own ideological pourposes. As for me, if the Shroud is authentic or not, my life or my ideas about God will not change in any manner. But I remember to you that in the XX century the most clever scholars opposed to the authenticity have been almost always catholic priests. This means that this opposition shroudies christians / critics atheists is not true.","date":"2013-11-04","mins":"3:29 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49627","author":"andrea_nicolotti","post":"Dear O.K: “[…] you, Collin, Charles Freeman, Andrea Nicolotti, Gian Marco Rinald really study in depth all the results, all the papers about the Shroud” Yes, I do it. Why 99% of shroudies don’t do the same? “…cunning sceptics” I am not a “sceptic”, I am a researcher and I work according to scientifical method. “why are they not so scrutine in case of those who claim the Shroud is not authentic?” I think you do not read what I write. But you ought to think about the statistics. Shroudies are hundreds. “Sceptics” are not many. There are hardly any serious researcher. So, obviously, the absurdities usually are pro authenticity. Because they are the majority. “Because by default the arguments of anti authenticity are good, while arguments of antiauthenticity is bad.” This is what you see in your mind… I am not interested in pro or against autheticity, I am interested on truth, on serious researches, on scientifical methodology. Stop. This is my work, it is not a hobby to get a bit of relaxation about the work..","date":"2013-11-02","mins":"4:21 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49628","author":"andrea_nicolotti","post":"[about = after.","date":"2013-11-02","mins":"4:22 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49634","author":"andrea_nicolotti","post":">>>>But if one looks deeper, it always appear that they methodology…. Normally – not always, but normally – sindonologists do not look deeper, but until now nobody in scientific field said me that my methodology is “entirely flawed”. I started my work 14 years ago. >>>>Can you say any argument pro authenticity of the Shroud? I did not find one until now. Until now, always I have discovered that arguments pro authenticity are non arguments. But I have not finished yet, so maybe you can wait, if you want. But as for the historical part, yes, I have finished with it. P.S. “To look deeper”, you said. Why to discover the froud of Dmitri Kuznetsov was necessary the study of the “sceptic” Gian Marco Rinaldi? Why nobody looked deeper before, instead of paying and sponsoring his falsehoods? I have little trust in such a people. They “look deeper” only when someone says what they do not like..","date":"2013-11-02","mins":"5:06 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49641","author":"andrea_nicolotti","post":">>>>true face of fanatical Shroud hater “Fanatical”, very funny. It is useless to speak with you, you can not go out of your manicheism: love Shroud / hate Shroud. I do not love nor hate the shroud, the shroud is an object that I study. Before the Shroud I studied the diabolical possession in antiquity, but I do not love nor hate the possessed. Wilson did not discover that Kuznetsov was a scientific frauder, he only discovered other thing related to money. Is not the same. <<<<>>>> who and how faked the Shroud? If you are entirely convinced of that. Your obsession with pro authenticity / against authenticity is preventing you from see that I never wrote that the Shroud is a fake. But, by the way, your question “who and how faked the Shroud” is a non scientifical question. I do not know exactly how Stradivari prepared his violins, but I do not think that Stradivari is God or that the violin is a miracle. And if I could make a Shroud identical to the original, this does not mean that the original Shroud was made exactly as I did. It is question of probabilty..","date":"2013-11-02","mins":"5:34 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49642","author":"andrea_nicolotti","post":"Colinsberry : Hello Andrea Your “I templari e la Sindone. Storia di un falso”: is it available yet in English? Is there an English language summary? No English. Until now nobody asked to translate it. At the moment they are translating only the book about the mandylion..","date":"2013-11-02","mins":"5:37 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49645","author":"andrea_nicolotti","post":">>>don’t try to excuse yourself. I do not excuse myself, I did nothing wrong >>>you cannot overcome your inability to say a single, even the weakest argument that could be used to support the Shroud’s authenticity>>>>> A: you do not believe in UFO B: Never I saw a UFO A: Because you hate them and you do not want to believe in them B: I do not hate them, simply I have not found until until now an argument to support their existence A: You showed your true face of fanatical UFO hater. Don’t try to excuse yourself. B: I do not excuse myself, I did nothing wrong. A: But I can say, if i want, many arguments that cast doubt on the existence of UFO or against the authenticity of the the relic of our Lady’s milk, that was conserved at Paris with the Mandylion of Edessa. And you can found even the weakest argument that could be used to support that UFO exist and that this milk is authentic? B: No. But can you show me this milk? A: No, it is impossible to see. But it did many miracles. B: Probably I do not believe in these miracles. A: You hate not only UFO and relics, but also miracles! B: No, I do not hate anything. So you believe also in miracles happened through the Shroud of Besançon or Cadouin? A: Excuse me, we were talking about milk..","date":"2013-11-02","mins":"6:18 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49648","author":"andrea_nicolotti","post":"Colinsberry : Would you consider me rude to ask you to summarise here in as few or many words as you see fit – what links you see between the Templars and the Shroud? I have my own half baked (literally!) views too, but they can and should wait till I’m au fait with what a published author has to say on the topic. Excuse me, but I cannot summarise here 180 pages full of arguments… But in few words, I have checked all texts that have been used to demonstrate a link between the Templars and the shroud, and I recognized them as falsified, poorly translated, poorly contextualized or invented. So, as it has been already written by the historian of Templars Malcolm Barber, I think that there is no link between the shroud (if existed at that time) and the Templars. But I can help you otherwise. If you want to read a review of my book, the British Society for the Turin Shroud Newsletter published one. My book is about medieval history and I am an historian. That review was written by a shroudie graduated in natural sciences. Surely you will like it. There are other reviews of my book, in «Rivista di storia e letteratura religiosa» 48 (2012), pp. 167 178, in «L’indice dei libri del mese» 10 (2011), p. 21, in «Giornale di storia» 6 (2011), in «Deutsches Archiv für Erforschung des Mittelalters» 67 (2011), p. 805, in «Revue d’histoire ecclésiastique» 106/3 4 (2011), pp. 858 859, in «Vetera Christianorum» 48 (2011), pp. 392 393, in «Rivista di storia del cristianesimo» 10/2 (2013), pp. 508 511. But unfortunately they were written by historians on scientifical reviews, so better if you do not trust them. P.S. If someone wants to give me a tenth of the money given to Kuznetsov, or to Frei, or some of the money given to Rolfe, I’ll pay the translation. For me, I do not need money. I am sure that a lot of sindonologists want to give their money also to people that want to study the Shroud without saying in the first page that surely it is authentic. Maybe also Rinaldi or Freeman could get some : )).","date":"2013-11-02","mins":"6:47 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49655","author":"andrea_nicolotti","post":"O.K, Hitler never existed. It was invented by a crown of graduated from natural sciences in 1947 because they, hafter having destroyed Nagasaky with their bombs, wanted to blame someone for having started the war. We, professors of history (I am sure you know many of them), are truly big idiots, serving particular ideology, and building our careers on nothing else but conformism and coteries; so we were payed by you “exact” scientists to write the histories about Hitler. I confess it. The shroud is authentic because you says it, and Koutznetzov is an historian. And the evangelists were graduated from natural sciences at the Jerusalem University. [Finished].","date":"2013-11-02","mins":"7:55 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49962","author":"andrea_nicolotti","post":"Josie, I have not spoken about priests as arguers against the examination of the Shroud, even if I have an idea about that; I have spoken about many priests that in the XX century did not believe in authenticity of the Shroud and wrote books against shroudies. And they were professors in seminaries and universities, not ignorant people. The last example is Mons. Victor Saxer, president of the Roman Pontifical Academy of Archaeology and of the Pontifical Commettee of Historical Sciences (even if in some aspects his work on the Shroud was not so well conducted as one could hope). What I want to say is that the equivalence “believer in Shroud = catholic” and “not believer = atheist” is wrong. Or it is true only in the mind of some obtuse catholic, as you can see in this blog (people that can guess also my ideology, my faith, if I am catholic or not…). Maybe they love the Shroud in such a fanatic way because they think to be able to demonstrate the miracles of God or his resurrection through the Shroud. It is an old temptation: to take a so called miracle and to use it as proof of God. By the way, the idea that the wine and bread become flesh and blood is not in idea “claimed in the past”: is a present truth of faith. But until now we are lucky because some pseudo scientific has not yet thinked to study with the microscope the wine before and after the mass, to see if it changed its composition in some way due to the priest’s verba institutionis..","date":"2013-11-04","mins":"8:28 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"}]
