[{"id":"comment-164983","author":"andrea_nicolotti","post":"Max Patrick Hamon, inviting other people, as usual, to do “home work before passing comment”, wrote: «I can read Modern French, Old French, a few Old French dialects, Classical Latin, Medieval Latin and Ecclesiastical Latin all right, what about you?» […] «This is what I would call “bad faith” (in Latin FRAUDO)» […] «Ecclesiastical Latin word fraudo means… » […] «Don’t you read the Medieval Ecclesiastical Latin fraudo…» ….. And after some minutes, when realizes that the word “fraudo” does not exist in Latin… « Note: FRAUDO (= MALFOY) as name derived from the verb FRAUDO and synonym of FRAUS, FRAUDIS » This demonstrates again to me, as just happened before, that Max Patrick Hamon does not know Latin, be it classical, medieval or ecclesiastical..","date":"2014-10-23","mins":"6:16 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165444","author":"andrea_nicolotti","post":"Hugh, this is a picture (not made by Centini) of the mural external fresco in the cemetery church of Viverone. I do not know if dates before or after the trasnfer of the Shroud in Turin (1578)..","date":"2014-10-25","mins":"8:42 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165449","author":"andrea_nicolotti","post":"If I well understand, Hugh, you believe that the fresco is older than 1534 because it has not the scorch marks. If it is so, the argument is inconclusive, because there are many paintings of the shroud AFTER the 1532 without the scorch marks, until XIX century..","date":"2014-10-25","mins":"9:00 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165453","author":"andrea_nicolotti","post":"No, the paraments did’nt change their shape in a significant way.","date":"2014-10-25","mins":"9:13 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165201","author":"andrea_nicolotti","post":"Mr. Max Patrick Hamon, please, do not make a fool of me. And I do not need to see dictionaries to solve such a simple question. You wrote: «This is what I would call “bad faith” (in Latin FRAUDO)». No, “fraudo” is a verb (“to cheat”), and “bad faith” is a substantive (with adjective). You wrote: «In Latin the substantive fraudis can mean “bad faith”, “deceit”, “fraud” etc, AND “misrepresentation”, “error”, “mistake”.». No, the substantive “fraudis” does not exist. “Fraudis” is a genitive of the substantive “fraus”. You wrote: «Don’t you read the Medieval Ecclesiastical Latin fraudo/fraudis with your preconceived». No, “fraudo/fraudis” does not exist in Latin. You wrote: «Mr Nicolotti, the Latin verb fraudo DOES exist in Latin and could even be used as a substantive». No, a verb is a verb and cannot be used as substantive. “Omni fraude cessante” = adjective + substantive + verb. Stop. No way. I taught Latin and Greek for many years, and I am able to see if someone knows or do not knows them. And this is not the first time you make grammatical errors. You are not obliged to know them: but please, before repeatedly saying “do your home work before passing comments”, look at yourself..","date":"2014-10-24","mins":"11:38 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165226","author":"andrea_nicolotti","post":"Egregio (not “egreggio”) Hamon, with your blabla you can make a fool of people who does not know the matter. With me you can not. The discussion for me is closed..","date":"2014-10-24","mins":"1:46 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-187798","author":"andrea_nicolotti","post":"Viverone: I was there today. The fresco is completely disappeared.","date":"2015-01-31","mins":"1:15 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-56068","author":"andrea_nicolotti","post":"I say *probably* tomorrow. But it is not sure… perhaps the day after tomorrow… But now it seems an almost sure news. The Pope will be here. I have no more informations at the moment, because now here it is 3.15 AM, and all people in Torino is sleeping …...","date":"2013-12-03","mins":"10:18 pm","url":"https://shroudstory.com/2013/12/03/about-to-break-breaking-news/","cat":"press_coverage","title":"About to Break Breaking News?"},{"id":"comment-56296","author":"andrea_nicolotti","post":"In this moment the Archbishop of Turin is saying that there will be an exposition of the shroud for 45 days, between April and August 2015. I was right.","date":"2013-12-04","mins":"7:45 am","url":"https://shroudstory.com/2013/12/03/about-to-break-breaking-news/","cat":"press_coverage","title":"About to Break Breaking News?"},{"id":"comment-56305","author":"andrea_nicolotti","post":"Dan, I AM ALWAYS RIGHT!!! Joking apart, for further informations (they are distributing papers for the press services) I’ll inform you.","date":"2013-12-04","mins":"8:15 am","url":"https://shroudstory.com/2013/12/03/about-to-break-breaking-news/","cat":"press_coverage","title":"About to Break Breaking News?"},{"id":"comment-166317","author":"andrea_nicolotti","post":"In a few words? i think it is impossible…. But if your question is “Do you believe that the Sermon of Gregory Referendarius could be used to prove the identity between shroud and Mandylion, in any part?”, the answer is obviously not, as all scholars (except some sindonologist) do know, and as the reading of ALL treatise demonstrates without doubt..","date":"2014-10-28","mins":"6:25 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166304","author":"andrea_nicolotti","post":"Scavone: «[…] it is firmly documented as coming from Constantinople to Besancon to Geoffroy de Charny». Firmly documented???? Simply RIDICULOUS.","date":"2014-10-28","mins":"5:47 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166613","author":"andrea_nicolotti","post":"But I do not agree with you, Max. On XIII and XVI or XV century no Shroud existed in Besançon. So the problem is not how the Scavone’s hypothesis is reliable or proved, but how can exixt such hypothesis..","date":"2014-10-29","mins":"1:38 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166614","author":"andrea_nicolotti","post":"XIII, XIV, and XV.","date":"2014-10-29","mins":"1:39 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167293","author":"andrea_nicolotti","post":"Better explained: the shroud with the image in Besançon did not exit on XIII, XIV, and XV century. A white linen for the rite of the “Quem quaeritis” was present there in the middle age, as in many other churches..","date":"2014-10-31","mins":"1:44 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166326","author":"andrea_nicolotti","post":"I guess that this starting conversation between you and I will finish in nothing…. : ).","date":"2014-10-28","mins":"6:39 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166333","author":"andrea_nicolotti","post":"It is not question of “running away”. Only I know how conversation with you always finish. Your question is simple, yes. I do not deny anything. Why I have to “deny” authenticity of the Sermon?.","date":"2014-10-28","mins":"6:59 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166330","author":"andrea_nicolotti","post":"I do not like this translation….. Anyway, if you wanto to read Guscin you must add also http://www.shroud.com/pdfs/guscin3a.pdf.","date":"2014-10-28","mins":"6:45 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166337","author":"andrea_nicolotti","post":"The sermon was delivered on the evening of August 16, 944, at the imperial palace, perhaps yes, perhaps not.","date":"2014-10-28","mins":"7:07 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166353","author":"andrea_nicolotti","post":"We cannot assume anything without proofs. That the mandylion is a shroud folded is an invention of Mr. Wilson in the XX century, not a conclusion taken form the texts. So, as historian, I cannot discuss about fantasies and conjectures. The mandylion is a a towel used to paint the face of Jesus, or to clean the face of Jesus sweating or blooding, this says all tradition (obviously, is a legend). Stop. Robert de Clary is not more clear, because in any part he says that the mandylion is something different..","date":"2014-10-28","mins":"8:03 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166339","author":"andrea_nicolotti","post":"So?.","date":"2014-10-28","mins":"7:14 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166342","author":"andrea_nicolotti","post":"Please, go on. I am not here to answer a series of questions like in a tribunal. Say what you want to say without questions or “steps”..","date":"2014-10-28","mins":"7:21 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167324","author":"andrea_nicolotti","post":"P.S. The family link between Jeanne de Vergy and Otho de la Roche is false. (my book “I templari e la sindone”, p. 120 ss.).","date":"2014-10-31","mins":"2:25 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167321","author":"andrea_nicolotti","post":"Yes, I am sure. We know that the Besançon shroud was made on 1523 or some years before. We have medieval documents and they were not distroyed on the fire (forgers like fires, they use them to justify their forgeries). Piana Scavone theories are funny: they use false legends created on XVIII century to explain presumed facts occurred on middle age. “Local tradition” means nothing: it was also a “local tradition” that in my town sleeped Napoleon, but it is false. The story of Othon de la Roche was a lie invented on XVIII century. This is well known. Obviously, they fabricated also false “material evidence”, this is normal. So, yes, I am sure. (P.S. Absence of evidence is not evidence of absence: it is true, but only sometimes. But is ALWAYS true that you must demonstrate that something existed, if you think that it exixted, and not asking me to demonstrate that somethng did not exist)..","date":"2014-10-31","mins":"2:19 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167334","author":"andrea_nicolotti","post":"O.K, the first study of this question was Paul Vignon 100 years ago. After, you can read the article of Zaccone printed in the acts of the the Congress of sindonology of Nice (1997, I guess). In the fututre I’ll publish something more accurate, but this is enough. So, go on. I cannot make here all the history. I use this blog only for short suggestions, it is not the place to write articles. For Jeanne and Otho, the same. I explain all in my book..","date":"2014-10-31","mins":"2:42 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167397","author":"andrea_nicolotti","post":"OK, I try to be more clear. I do several categorical statements, yes. I seem sometimes insufferable, perhaps. But understand me: I do not want to argumentate here, because a blog is not a a place to make serious history with documents and argumentations. It is a place to spend time, make simple discussion, know people, and share informations. I share informations. I have not time, possibility and desire to explain here the results of my researches. History is a serious work, difficult an complicated, and needs the correct place and the correct way to be explained. So often I make fast statements, only because I know that some people could be interested in knowing what I have to say. If someone wants to go deeper, he must read my books or articles, and study himself. So, for me, my statements are a little help for the readers that know me, and that know that I work seriously and professionaly,… and that I do not invent or manipulate sources. Vignon: his second book, not the first. Zaccone: the article on Besançon, not the book. Jeanne: no games, she is not descendant of Otho..","date":"2014-10-31","mins":"7:32 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167669","author":"andrea_nicolotti","post":"1) The genealogical tree of Wilson is wrong. Henry de Vergy was not wife of Élisabeth de Ray. 2) All the list of Scavone’s speculations and conjectures (=inventions) needs only an answer: where are the sources that associate Othon de la Roche with a Shroud?.","date":"2014-11-01","mins":"12:45 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167670","author":"andrea_nicolotti","post":"Husband.","date":"2014-11-01","mins":"12:46 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167709","author":"andrea_nicolotti","post":">>>>So who was wife of Henry de Vergy? Élisabeth de Chalon >>>>Piana has similar genealogy to that of Wilson Piana is a biologist <<<<<>>>Those 18th century sources, Source (one), not “sources”. And you call “source” an anonymous treatise of the 18th century, written to defend the authenticity of the Besançon Shroud (that was false, all know), telling something about what happened on 1204, based on falsificated sources? And the historians before, who NEVER associated Othon with the Shroud? Nobody remembered? Oskar, please, could you start to use a historical critical mehod? We adopted it two century ago. >>>>which you labelled as “lies” without giving evidence of their falsehood<<>>>>>Plus 1205 letter of Theodore Angelus to the Pope Innocent III. Another forgery. = 0.","date":"2014-11-01","mins":"2:34 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167717","author":"andrea_nicolotti","post":"<<<<<Was his sole wife, or had he additional marriages Too simple escamotage. But impossible, in this case <<<<<<<<it is a source not the best quality, but a source Your traitment of later, disinformated and forged sources is not compatible with the historical critical method. <<<<<<Can you tell me who faked this no. Maybe I'll discover, maybe not. Surely, a member of the siciilian false noble family De Angelis. <<<<<<<<when was it faked (century) probably from xvi to xix <<<<<Do you consider Benedetto D’Acquisto 19th century transcript as authentic? Benedetto D’Acquisto did not transcript anything. Only signed. <<<<<<Frale considers it authentic You consider Frale a reliable historian? <<<<<and found no evidence You do not found never evidences of forgeries if they are against the Shroud… : ) But now I told you many things and many informations (false source, wrong marriage, false chartularium). Go forward! This is the first step (according to the method): read all your 18th century \"source\" about Othon, and found proofs of reliability. Second step: compare it with the earlier sources about the history of the Shroud in Besançon. Third step: look for historical mentions of the shroud of Besançon in the sources in the city (we have them) from 1204 to 1523. Best wishes!!!.","date":"2014-11-01","mins":"3:09 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167725","author":"andrea_nicolotti","post":"<<<<<<So, Andrea you claim that someone from de Angelis family yes, the false, lying, pseudo byzantine De Angelis Family. It is better to remember it. <<<<<>>>>> and delliberately placed it in some forgotten Chartularium Culisanense. All the Chartularium Culisanense, obviously, is a forgery. >>>>>>There is one key question I would like you to answer Andrea; FOR WHAT THE PURPOSE? All fake Chartulariums are falsificated to give importance to a family or institution that has no importance and wants to have it. So the forger of the cartulary created a fake diploma of Constantine XI, with a false genealogy of his family; and then, to make believe that his family had in the past important relics, made a false dowry which contained the stones of the home of Our Lady of Loreto, a false report of translation of the relics of the martyrs of Otranto to naples and our false letter to the pope where is said that they possessed the Shroud. When the letter was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time). The forger was not very able, and did not know the Greek; it is easy to see that the document is not authentic. When I showed the letter to the most important experts on this field, Luca Pieralli and Otto Kresten, in five minutes they confirmed my opinion..","date":"2014-11-01","mins":"3:57 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166305","author":"andrea_nicolotti","post":"The sermon was not found by Gino Zaninotto in the Vatican Archives. This is a sindonological legend.","date":"2014-10-28","mins":"5:48 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167727","author":"andrea_nicolotti","post":"<<<<< have you invented this right now, or before? I study very hard <<<<<Anyway, next round No rounds, game over. You must study, now. I indicated you the steps. Or you wait the publication of my next study about the Shroud of Besançon. But you can also do it alone, without me and my studies. It is very easy, t see how that \"source\" is a fake..","date":"2014-11-01","mins":"4:16 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166314","author":"andrea_nicolotti","post":"The Sermon of Gregory and its position in the Vatican Library (not Vatican “archives”) was well known and published in the catalogue of manuscript since the beginnning of XX century. Von Dobschuetz wrote something about it in 1899 and 1905. So nothing was “discovered” after, by anyone. Simply Zaninotto, who lives in Rome, saw the codex (or he bought a copy of it), asked someone to transcript it and translated/was helped in translating some parts. After, Pier Angelo Gramaglia made a transcription more accurate of some parts. At the end, Dubarle asked Paramelle to make a transcription of all the manuscript, and published it. I explain all, and also the text contained in the manuscript, in my book “From the Mandylion of Edessa to the Turin Shroud”, pages 43 66..","date":"2014-10-28","mins":"6:15 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167862","author":"andrea_nicolotti","post":"From my book “From the mandylion of Edessa”, etc, pp. 71 72: “But we know that the Byzantines believed that Jesus was laid in the tomb wrapped in bands: therefore, on Easter Day, in memory of this, the imperial dignitaries would “wrap themselves with splendid loroi, in imitation of the burial bands of Christ.” (Constantinus VII Porphyrogenitus, De cerimoniis aulae Byzantinae, II,52) The λῶρος was a long and narrow scarf, adorned with precious stones, which was worn wrapped around the body by the emperor and certain dignitaries. This quotation is noteworthy: evidently, in Constantinople at the time of Constantine, it was believed that Jesus’ body had been wrapped with long and narrow bands (σπάργανα)”.","date":"2014-11-02","mins":"5:12 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-167881","author":"andrea_nicolotti","post":"I do not know (and no time to verify). Probably there is a difference about the use of the emperors and dignitaries (only Easter) and the emperors only (also in other occasions). It could be useful E. Condurachi, “Sur l’origine et l’évolution du loros impérial”, in «Arta si Archeologia», n. 11 12 (1935 1936), pp. 37 45..","date":"2014-11-02","mins":"7:06 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-167244","author":"andrea_nicolotti","post":"“La Sindone, indagini scientifiche”, p. 276. Nothing useful, only a reference to Maria Delfina Fusina, saying: “If we accept the thesis of m. D. Fusina, that dates the fresco in the first years of the XVI century”, etc. But is said also that the fresco is cited in a pastoral visit of 1775. So, the unique source is Maria Delfina Fustina, on “Studi piemontesi” 1972 p. 98. She dates the fresco on “first years of the XVI century”, but does not explain why with sure proofs. I think we have not a reliable date for it..","date":"2014-10-31","mins":"10:26 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-125476","author":"andrea_nicolotti","post":"Yes, you are right. But the English version is widely updated and increased..","date":"2014-05-29","mins":"8:03 am","url":"https://shroudstory.com/2014/05/29/available-for-pre-order/","cat":"books","title":"Available for Pre-Order"},{"id":"comment-155330","author":"andrea_nicolotti","post":"Published: https://www.academia.edu/8475824/From the Mandylion of Edessa to the Shroud of Turin. The Metamorphosis and Manipulation of a Legend.","date":"2014-09-24","mins":"7:19 pm","url":"https://shroudstory.com/2014/05/29/available-for-pre-order/","cat":"books","title":"Available for Pre-Order"},{"id":"comment-31075","author":"andrea_nicolotti","post":"David Mo : “In agreement with the biblical book of Exodus, the Shroud’s threads have a twist “Z” instead of the more common twisting “S” because addressed to high ranking religious person.” Can anyone explain this? I think is simply invented.","date":"2013-04-17","mins":"10:54 am","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31102","author":"andrea_nicolotti","post":"Daveb of wellington nz scripsit: «[…]None of these refer to a Z twist». So I can repeat: the statement of prof. Fanti is simply invented. «However other *possible* sources for the Z twist requirement might be found in the Talmud, etc.» The Talmud was written some centuries after the death of Jesus and the destruction of Jerusalem. What is *possible* in the Talmud is not useful for us. All historians of Jewish textiles know that in the I century CE all textiles were made with S twist. So, again, the sentence of prof. Fanti is wrong. The Z twist means that the textile was NOT made in the ancient Palestine..","date":"2013-04-17","mins":"4:57 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31111","author":"andrea_nicolotti","post":"Latendre : Notice that you wrote “all textiles”. This is very broad. I am speaking about linen textiles. Goat hair or camel hair fabrics, for example, are usually Z spun..","date":"2013-04-17","mins":"7:09 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31181","author":"andrea_nicolotti","post":"I am not at home and now I cannot provide references, but that the linen in Jewish tradition was worked in S and not in Z is a fact well known. I remember that I have read it that many times. And that when (very rarely) linen textiles Z spun are found, it is interpreted as proof of foreign provenance. You can look, for example, for the studies of Orit Shamir, that now in Israel is the most notable authority on Jewish ancient textiles. Please, do not quote articles written by sindonologists without competence (e.g. Diana Fulbright). They are full of mistakes, like ALL what was published about the textile structure of the Shroud, from Paul Vignon to Fulbright. The only reliable study on this subject was published by Gabriel Val that, by the way, was the only expert on ancient textile that ever saw and touched the Shroud and wrote something about it. I have spent 4 month to check all the statements made by sindonologists about the textile structure of the Shroud, and I found all wrong. So, now for me all this is rubbish..","date":"2013-04-18","mins":"12:54 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31307","author":"andrea_nicolotti","post":"<<< In any case, you are essentially writing that you cannot provide detailed answers in this blog. Exactly. A blog is not a place for it. And, by the way, is useless. <<<<<<<<<<< But you participated to a special issue of the magazine “L’Histoire” titled “Le Suaire de Turin, la vraie histoire d’un faux” published in February of 2012 in France which essentially had the purpose of proving that the Shroud of Turin is not authentic. Granted, that you gave an interview to a journalist that probably decided afterwards to publish it as part of this special issue. Yet, it gives the impression that you want to disprove the authenticity of the Shroud. This is the normal conclusion from such publication. <<<<<<<<< I was contacted by “L’Histoire”. They asked me to answer some written questions NOT prepared by a journalist, but by a professor of medieval history in a French university. I was contacted because I wrote a book about the false theory of the Shroud connected with Templars (Wilson, Frale, etc.). I have accepted and in my article NEVER I told something about the authenticity of the Shroud. It was not the aim of my article. Your “impression” is only your personal judgement. By the way, if some magazine publishes an issue against the authenticity it does not seem to me a problem: 95% of magazines publish only material pro authenticity. I like variety. <<<< What is a sindonologist for you? Someone convinced about the authenticity of the shroud, without possibility to change idea, that writes often about it even without competence, connected with some sindonological association, participates to sindonological congresses (organized and frequented only by supporters of the Shroud). Vial is not a sindonologist: he was a very famous teacher and researcher on history of textiles (like for example Daniël De Jonghe, John Peter Wild, Dominique Cardon, Elisabeth Völling, Lise Bender Jørgensen) and he was called to make an examination on the shroud. He made his work (with gentle words, saying what I say) and after he came back to his work. Flury Lemberg is a member of the sindonological diocesan committee for the conservation of the shroud, and is capable to say sentences like: “I believe that this is the original shroud of Christ, I believe without a shadow of a doubt. This fabric is so precious, so perfectly woven fabric, and thus corresponds perfectly with what is written in the Bible (!!!???) … On the other hand if it really was made on 13 and 14 centuries as well as the examination of the carbon 14 suggests, however I could not believe: it is necessary that the supporters of this thesis explain in which way the image was imprinted on the shroud. Because the image is so special that the answer *can only be a miracle*. Who else but Christ would have so much energy?” This is sindonology. Miracles, Jesus, energy of resurrection, believing without a shadow of a doubt, and so on..","date":"2013-04-19","mins":"12:11 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31237","author":"andrea_nicolotti","post":">>>Andrea, your statements are very general and all sweepings. You just wrote “I have spent 4 month to check all the statements made by sindonologists about the textile structure of the Shroud, and I found all wrong”. *All* the statements are *all* wrong?! >>>>> Obviously not ALL in general sense, but almost all in historical perspective. Since sindonologists have the aim to demonstrate the authenticity of the Shroud, they made a lot of examples of “similar” textiles in antiquity, but their comparisons are unacceptable. I remember you that we started this conversation with the Fanti’s sentence: “In agreement with the biblical book of Exodus, the Shroud’s threads have a twist “Z” instead of the more common twisting “S”. This is an example of this kind of wrong statements. >What about Flury Lemberg? Flury Lemberg is a sindonologist and is an expert on textile conservation and restoration. Is not a well known historian of textiles. <<Diane Fulbright gave many useful references on ancient textiles Diane Fulbright is not an expert on history of textiles and is a sindonologist also. Many of her references are not acceptable, and she compares to the Shroud many textiles with fundamental discrepancies, so she is not able to demonstrate anything. I cannot explain this here, but in the future I will publish a deep analysis of it. As I normally do when I say something. <So far, you have produced no proof of your sweeping statements You can think what you want. But this is not the place to do it and I have not time nor capacities to write pages and pages in English in a blog. I started with the wrong sentence of Fanti, that remains wrong. Now I tell you that most of the statements of Fulbright & C. Are like the Fanti’s one. If you want to believe me, ok, if you do not want, is the same. This is not the place to demonstrate anything, if the demonstration requires a long and complicate analysis. Surely remains that the only group that believes that the shroud has a typical ancient textile structure are the sindonologists. Ask you why. <<<<<<A Google search on “Gabriel Val shroud of Turin” yielded no results. VIAL, not VAL, it was a mistype. You do not know Vial? Strange. It was also involved on C14. I confirm: Gabriel Vial is the only well known authority in HISTORY OF ANCIENT TEXTILES that until now touched, saw and wrote a technical analysis on the Shroud. <<<< The work of Orit Shamir seems mainly confined to the textiles found in the Christmas Cave No, Orit Shamir (curator of organic materials at the Israel Antiquities Authority) is now the most recognized authority on Jewish textiles of the Roman age in Palestina (and not only the Christmas Cave). Her phd thesis is still the most important study on the “Textiles in the land of Israel from the Roman period till the early Islamic period in the light of the archaeological finds” <<<<<<I am aware of Andrea Nicolotti’s antipathy towards the authenticity of the Shroud of Turin. You are inventing, as sindonologists normally do. I have not antipathy towards the authenticity of the Shroud of Turin (why?). I have antipathy towards pseudosciences, sloppiness, superficiality. <<<<It seems that he works from the principle of negating anyone who has a view contrary to his own You are describing the sindonology…. << I consider that the paper “Wiping the Slate Clean” by Emanuela Marinelli provides more than an adequate response to his particular negative view I consider the paper of Marinelli a perfect example of what sindonologists normally do. Marinelli is graduated on natural sciences and has no competences on history, philology, byzantine philology and ancient languages. So, she is a person completely unfit to write a review of a book about the Mandylion. However she wrote a review of it (even if in my book I often criticize her…), and obviously in a sindonological review (by the way, giving a description of my results in a very partial way). On the other hand, I have received until now six TRUE reviews on six TRUE scientifical reviews or books: 1) Luigi Canetti (professor of history of christianity at the Ravenna University), in S. Cosentino – G. Vespignani (edd.), Studi in onore di Antonio Rocco Carile, Fondazione CISAM, Spoleto, 2013, pp. 1 21 2) Francesco Pieri (priest, professor at the theological faculty of Bologna), in «Rivista di storia e letteratura religiosa» 48 (2012), pp. 167 178 3) Vincenzo Poggi (priest, professor at the pontifical institute of oriental studies) in «Orientalia christiana periodica» 78/1 (2012), pp. 239 240 4) Vassa Kontouma (professor of byzantine studies at the École pratique des hautes études, Paris) in «Revue des études byzantines» 70 (2012), pp. 308 309. 5) Valerio Polidori (phd in oriental studies at the pontifical institute of oriental studies) in «Medioevo greco» 12 (2012), pp. 375 376. 6) Alessandro Rossi (historian of christianity, University of Milano) in «Vetera Christianorum» 48 (2011), pp. 391 392. They are all positive. This is enough for me. I do not look for the assent and approval of sindonologist. To get it, I ought to write not what I consider true, but what they want to read. And this is not my way to work. I’m sorry about that..","date":"2013-04-18","mins":"8:37 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31466","author":"andrea_nicolotti","post":"Mario Latendresse : I was actually a bit disappointed that you did not go over many details that you wrote in your book titled “Dal Mandylion di Edessa alla Sindone di Torino. Metamorfosi di una leggenda” published only in Italian. My Italian reading is slow. Can we expect an English (or French) translation of your book? Thank you for your answers. Mario, oui, une traduction sera publiée, ce qui me permettra aussi d’inclure certains changements. Si vous avez mon livre en italien, vous pouvez aussi consulter ma page en Academia où j’ai préparé un errata corrige (à la fin du document pdf): http://www.academia.edu/916021/Dal Mandylion di Edessa alla Sindone di Torino. Metamorfosi di una leggenda.","date":"2013-04-21","mins":"8:01 am","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-191796","author":"andrea_nicolotti","post":"Mario, I am very disappointed. With a post signed February 24, 2015 (http://www.sindonology.org) today you announce there and in this blog that you published a book written in French, that «presents a complete transcription of both dissertations [of the manuscript 826]. The transcription of the first dissertation, for the authenticity, is new because this dissertation was never published before». This is a lie. I have started to work on it three years ago. My book was ready at the beginning of 2014. I sent the proofs to a professor of medieval history in University of Besançon and he, in September 2014, asked me to publish it in a collection directed by him. My book was printed on December 2015 and put in legal deposit on January 2015 (as it is written on the book himself that I have in my hands). In all this time you never know ANYTHING about the manuscript 826. In a discussion WITH ME on this blog on 1 December 2014 you asked me information about my book that you found JUST ANNOUNCED ON THE WEB FROM 23 NOVEMBER, BECAUSE IT WAS JUST FINISHED. On that day (1 December 2014) you looked for the manuscript 826, you found it on the web (it is online only because I paid the library for scanning every page of it FOR ME two years ago, and after they put it online) and on that same day you wrote “I just found it on the web.. I will read it”. Https://shroudstory.com/2014/11/27/the makeshift body bag of turin/ So, until 1 December YOU NEVER SAW that manuscript, when my book was just printed and waiting to be distributed in Besançon. And you knew it, because it was just announced on the web. The order paper is online from November. In Besançon they are waiting for my travel there to make two presentations in University and Diocese organized by them for 4 and 5 march. So, in two months or less you made a transcription from the images online paid by me, and you prepared your book, that contains, I think, a simple transcription of the manuscript, without any deep commentary. I transcribed it with a deep commentary (194 pages totally), and I have identified who wrote it, and his sources. And now you present a book printed by Lulu, a print on demand editorial who can prepare a book in few weeks or less, writing on the cover that the manuscript “was never published before”????????? This is very disappointing, dishonest, deceitful, fraudulent. I ask you to change your presentation on http://www.sindonology.org/ and also change the cover and the part of the text inside the book where you said that you prepared the FIRST TRANSCRIPTION of the manuscript. You can do it, Lulu does not print books if they are not bought. This blog is made to share news, or to stole news?.","date":"2015-02-25","mins":"8:07 am","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191812","author":"andrea_nicolotti","post":"And I add also that on the same day, December 1, 2014 at 5:39 pm, in this same blog, answering to Mario Latendresse, I wrote: “As the manuscript is in French, and the Shroud is French, it seemed to me useless to do an Italian book. So, ****I have transcripted the manuscript****, and I have written an introduction and commentary”. Https://shroudstory.com/2014/11/27/the makeshift body bag of turin/ So, Mario was the first person informed that I did the transcription in abbok justi finished and available for order. And now, after three months, he presents a book writing that HIS transcription “is new because this dissertation was never published before” ?????????????? No words..","date":"2015-02-25","mins":"11:58 am","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191922","author":"andrea_nicolotti","post":"1) I never received messages from you on my Academia. Never. I answer to all people. I have a website and a page at my university with two different emails. You could contact me through this blog, or ask if I received a mail. If you did not contact me, is because you did not want to do it. But any mail does not change the situation: I had finished a book with a transcription you were starting to do. Stop. You knew it. 2) In your book you state that the manuscript is “unpublished” or “inédite” that means only a thing: never printed before. You knew that my book was on press, so simply you tried to precede me, stealing my idea, but you failed. So you are both dishonest and lier. 3) Do not try to change argument with discussions about money or if I am or not misleading in the presentation of my book. Please, stop, it is pitiful. We are speaking about a very precise matter. No more. The readers and specialists will judge the content of my book, not you here. 4) You try to change the meaning of a very simple concept: text edited or not edited. The strange meaning you suggest, it is your invention. You claim to have made “une transcription inédite”, saying that my transcription will arrive after your transcription, so presenting you as the first: in reality I made the work before you and you knew that manuscript only because of me, when you learned that my book was just on press and publicized. It is clear that you made all this to publish before me a manuscript that five minutes before you did not know. In the first pages of your book is not made any reference to the fact that I made you know the text and I had just a book on press with the transcription. It seems that you made the work before all people. It is not a crime, it is a huge unfairness. All people and colleagues understand exactly what I am saying. For me the question is closed, you did what you wanted to do. But, if you have in mind to come near the Turin cathedral on the next exhibition, you must hope that I do not recognize you, because it could be very awkward..","date":"2015-02-26","mins":"4:32 pm","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191837","author":"andrea_nicolotti","post":".","date":"2015-02-25","mins":"5:53 pm","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191833","author":"andrea_nicolotti","post":"On December you learned that the manuscript 826 is available online, BECAUSE OF ME. Five minutes before you had no idea about what is the manuscript 826. My book was just printed at that time, printed but not still on sale (like my book about the Shroud of Turin, printed but not in sale: it will be on sale on 10 March). I said to you, and it was written on the website, that the book has (not “will have”) a transcription of the manuscript 826. THE FIRST complete transcription ever done. A sensible person does not transcript a manuscript just transcribed and being publishing, because it is useless and absurd. And does not publish a second transcription before seeing the first just done before him by another. You knew that the work was just done, because I told you. It was written on the editor’s website. You say that your main aim was that this transcription should become available in an book form for everybody to read at a very affordable cost? Why, if a book like this was just done? The price of my book was written on the page you read: 14 euros. Is not affordable? So, without telling me nothing, you transcribed the text very quickly to publish it as soon is possible with a print on demand editorial, in order to claim that you made the FIRST transcription. That was false and you knew it. “Not published yet” and “inédite” have a clear meaning. You run to arrive before, but you didn’t. My book was printed on December. It was put in legal deposit on January 2015. It is just stored at the National Library of France. Some copies are just circulating. Your book was published YESTERDAY, so AFTER. So, your transcription is not “inédite”. You started two years AFTER. Your book arrived some months AFTER. And you knew it. You printed on the cover of your book a false statement. So, it is NOT true that no clear printed version of the manuscript was available to the public. It is a lie. If you had doubts, you should have asked me or my editor. But why doubts? I TOLD YOU. An now you claim to be the first when you are the second; and some readers will be deceived, buying your book or perhaps wondering why a stupid Nicolotti publishes a text already published, which is an idiocy. This is my job, not a game or a pastime. Being editor of an unpublished text is not the same as being editor of a text already published. Some people, unaware, will believe that you are the first editor. I am not upset, I am furious, especially because I see that now you take me for a ride. You have a doctorate and you know perfectly how these works are going. I did not know that the faith on the shroud means also this: it is the SECOND time that a shroudie claim to have done something before me, using my informations. Only because I am generous in explaining things to people who ask me, like you that in this case never heard about manuscript 826 before I told you, and I HAD JUST FINISHED THE WORK YOU CLAIM TO HAVE DONE FIRST. Your money for the images is nothing for me. Again, this is my work, and you were unfair. Stop. I do not tell other things, but you knows perfectly whath think about you..","date":"2015-02-25","mins":"4:40 pm","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191838","author":"andrea_nicolotti","post":".","date":"2015-02-25","mins":"5:53 pm","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191868","author":"andrea_nicolotti","post":"David, thank you. The problem is not what he wrote about the manuscript: if the manuscript is online, it does not mean that it is “published”, it is only “photograhed”. The pictures of it are online because I bought them when I started to work on it. So, it is true that it was unpublished, but only UNTIL I PUBLISHED IT. The problem is that Mario was totally unaware about that manuscript until he read on this blog my posts, and until he read the information about my book AVAILABLE IN NOVEMBER. So he found this manuscript online on 1 December, when my book was on press and knowing that I had just done the work of transcription. I TOLD HIM. So he decided to arrive before me, copied the manuscript (tedious work, but not so difficult) and put on sale claiming to be THE FIRST to publish it. And he was not, because my book PRINTED has the date of january 2015, and his book has the date of 24 February. In order to arrive first, probably because he thought to be the most clever in the world, he was silent with me and did not wait to see my book, that is the NORMAL thing that every honest scholar does in cases like this: BEFORE it is necessary to see the work just done, and AFTER, if necessary, it is possible to publish some integrations, corrections, etc. Probably his work is hurried and incomplete (he did in few weeks). Probably his transcription is useless, because he modernized the text (that means that he did not reproduce the original text with his French language of the XVIII century, but changed it in a modern French language; that, by the way, means that he DID NOT publish a manuscript, but a PARAPHRASE of it). Probably he made a simple transcription with some notes and without historical commentary. So, there is not true “competition” about me and him. But all this he did with all possible speed, only to announce his work as THE FIRST EDITION (that is not). This is simply disgusting. I asked him to change his cover and his introduction on his book, stating unequivocally that: 1) he knew the existence of this manuscript THANKS TO ME ; 2) That my transcription was just done and on print, when he discovered and started to read the manuscript; 3) consequently, his edition is the SECOND edition of the test, DONE after and PRINTED after. And this is not a matter of pro or against authenticity, is a matter of honesty and true..","date":"2015-02-26","mins":"5:29 am","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-157467","author":"andrea_nicolotti","post":"In fact, the only defect of this book is the price : ).","date":"2014-09-28","mins":"10:46 am","url":"https://shroudstory.com/2014/09/26/the-metamorphosis-and-manipulation-of-a-legend/","cat":"books","title":"The Metamorphosis and Manipulation of a Legend?"},{"id":"comment-68576","author":"andrea_nicolotti","post":"In the pdf of the “Papers from 1991 Shroud Conference” are not present the pages 130 154, 226 255, 325 345, 351 ff..","date":"2013-12-26","mins":"6:32 pm","url":"https://shroudstory.com/2013/12/26/papers-from-1991-shroud-conference/","cat":"news_&_views","title":"Papers from 1991 Shroud Conference"},{"id":"comment-126453","author":"andrea_nicolotti","post":"Hide your ass: http://www.hidemyass.com/.","date":"2014-06-03","mins":"6:47 am","url":"https://shroudstory.com/2014/06/03/and-speaking-of-secondo-pia/","cat":"video","title":"And speaking of Secondo Pia"}]
