[{"id":"comment-212889","author":"piero","post":"Dan, do not leave, do not abandon us! There may still be many surprises in the field of studies about the Holy Shroud … — — — B.T.W.: Dan, Have you tried to hear what Marco Leona (the director of scientific research of Metropolitan Museum of Art, in New York) can say to us about the interesting SERS controls?.","date":"2015-10-18","mins":"8:27 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212488","author":"piero","post":"Dear friends, there are a lot of unsolved problems… Here a vague example: “Was the Manopplello’s Veil a byssal veil (composed by weaved threads of silkmarine byssus) coming from Mediterranean Sea or not?” So… Where is the right way that we have to follow about the other more important problems? In my opinion linen … coming from Syria, from India or from Egypt (this last seems to be less credible) cannot change the main problem: the exact individuation about an useful solution for the great old problems: “What is the right action that we have to do in order to demonstrate the true epoch?” “How to find the exact BIF (Body Image Formation) pathway?” “Which is the best Lab?” What is the best mental behavior? A sort of ecstatic waiting time? Have you a new vision? — — Often can be difficult to exchange some simple messages, communicating in a fast manner. For example: Yesterday I wrote a private message about the (minor) problem of “ATR FTIR calibrations and previous Fanti’s measurements” (because I had some doubt regarding the exactness of this “ATR FTIR Shroud dating system”…). Today (until now) I have not yet received an useful answer (perhaps I had my e mail box full of messages [!] and then it was impossible to receive new posts… This can be an example of simple solution about a question!). — — — Here another question. I think it’s possible to compile a protocol to characterize mechanical properties of linen fibrils by means of microindentation using an Atomic Force Microscope (AFM) and other non destructive ways (…for example: an “AFM three point bending test”, etc. …). What is your opinion? — — — Here what I can say returning on the main argument of this “Linen from India?”: If “the authors suggested that the DNA evidence linked to people from India hints that the shroud may have been weaved there…” then we have to deepen this new problem using genetic tools also on Oviedo’s Cloth linen and then comparing the results obtained… — — Regards, Piero.","date":"2015-10-14","mins":"10:50 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-194268","author":"piero","post":"Do you remember what I wrote around the discovery of the italian archaeologist Manacorda about the place of exile of Herod (= Lugdunum Convenarum)? So… I tried to find the ancient roman textiles in the area of Lugdunum Convenarum, but I have not yet found an useful reference… I have been unlucky! — — — In any case there is the following Bibliographic reference: Rome in the Pyrenees: Lugdunum and the Convenae from the first century B.C. To the seventh century A.D. (Routledge Monographs in Classical Studies) Hardcover – October 30, 2007 by Simon Esmonde Cleary (= Author. Simon Esmonde Cleary is Senior Lecturer in Archaeology at the University of Birmingham…) Link: http://www.amazon.com/Rome Pyrenees Routledge Monographs Classical/dp/0415426863 >”Rome in the Pyrenees” is a unique treatment in English of the archaeological and historical evidence for an important Roman town in Gaul, Lugdunum in the French Pyrenees, and for its surrounding people the Convenae. The book opens with the creation of the Convenae by Pompey the Great in the first century B.C. And runs down to the great Frankish siege in A.D. 585 and its aftermath. >Now the town of Saint Bertrand de Comminges, Lugdunum is one of the best known Roman towns in Gaul, with a rich selection of monuments at the town itself and important remains in the countryside, such as the classic villa at Montmaurin or the votive altars, cinerary caskets and sarcophagi in the local marble. The book traces how the Convenae used their marble to help create their identity, invisible before Pompey but amongst the richest and most distinctive in Gaul by the second century A.D. >Drawing on his own excavations at Saint Bertrand and the extensive earlier and recent work there, Simon Esmonde Cleary combines a clear description of the buildings and monuments of Lugdunum and of its countryside with a discussion of what they can tell us about the impact of Rome on this remote corner of its empire. >This book will be extremely valuable to ancient historians, classicists and students of Roman archaeology, and contains a guide to the visible Roman remains of the area… — — — Here another paper: A.S.Esmonde Cleary & J.Wood: Le rempart de la “ville haute”, in R.Sablayrolles ed.: Lugdunum des Convènes (Saint Bertrand de Comminges/Valcabrère, Haute Garonne): acquis récents de la recherche (1992 2002), Aquitania XVIII (2002), 65 74 Link: http://www.birmingham.ac.uk/staff/profiles/caha/esmonde cleary simon.aspx.","date":"2015-03-24","mins":"8:53 am","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-212568","author":"piero","post":"… And … if the Shroud had been a gift of the Magi? If we wanted to remain consistent to the narrative of the Gospels then this idea does not seem to be likely. Anyway … now I want to make clear that with a difference about the origin of weaving (for example: in Israel and in India!) for Sudarium of Oviedo and Shroud, this “possible fact” does not mean anything in terms of possible authenticity … These stories seem to be only interesting subtle differences and and they are not significant about the “two main Misteries”: true age (= Which epoch?) and Image Formation Process (…then, unless there are other pieces to complete the puzzle, we can say nothing [= “Where of one cannot speak, thereof one must be silent”. Or: “What we cannot speak about we must pass over in silence”.= Wittgenstein]!). I see that now (unfortunately …) the discussion tends a bit to degenerate (and, by the way, no one wanted to listen to my feeble warning about the ATR FTIR measurements … [and perhaps that problem too it is getting old and with a white beard …]). Until now we have not yet seen the birth of a powerful “Society for the Suppression of the Relics Trade and/or Manipulation” that can be able to investigate in an useful manner on ancient relics… There are a lot of John the Baptist’s relics (a possible “useful source of DNA”…). In any case “…Dr Kazan’s expertise is archæological, and specifically he knows a lot about reliquary types and designs, especially in the Byzantine world…” Link: https://tenthmedieval.wordpress.com/tag/biblical archaeology/ …But falsification can also be: manipulating research materials, equipment, or processes … — — — In Italy there is an interesting new book written by Enrico Bucci with some useful lines of reasoning. Title: “Cattivi scienziati” (= “bad scientists”)… Yesterday I have read the recension written by F. Vaccarino (a prof. Of Math – Turin Polytechnic). Title of the article: “Anche in laboratorio si bara, ma i nostri anticorpi funzionano. Parla Enrico Bucci, il ricercatore che svela le frodi scientifiche.” Here a rough translation (warning for: “bara” = In this case it’s not “a coffin” [and, instead, https://translate.google.com/# translated in a bad manner that word…], but a verbal expression meaning “faking”): “Even in the laboratory you can fake, but our antibodies work. Talk Enrico Bucci, the researcher who reveals the scientific fraud”… ! There are plagiarisms and manipulations … and also ways to get around the controls. In short, a phenomenon that now affects even the world of research (which is exposed to the pressures of global competition = “publish or perish”, etc. As we have already had some “reading occasion” on this blog…)..","date":"2015-10-15","mins":"11:14 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"}]
