[{"id":"comment-195836","author":"piero","post":"I apologize if I am now a bit ‘off topic … However, there are two issues that I do not seem to have been explored: 1) DNA and Jewish Tombs in Jerusalem and near Giv’at ha Mivtar… 2) The tomb of Josef (= Joseph, the foster father of Jesus). >An ancient tradition states that the tomb of St. Joseph, now empty, is in the Valley of Josaphat. St. Jerome, on the other hand, was of the opinion that St. Joseph’s tomb is within the boundaries of the Garden of Gethsemane. (See Life and Glories of St. Joseph by Edward Healy Thompson, pp.409 410). Link: http://www.st joseph medal.com/ Why Jesus was not buried in the Garden of Gethsemane? I think it was not buried there because of the distance from Golgotha … and, perhaps, to the legal problems associated with the ignominious death on the Cross … But … What is the exact distance between Golgotha and the Garden of Gethsemane? — — — What is your comment?.","date":"2015-04-09","mins":"7:18 am","url":"https://shroudstory.com/2015/04/09/art-scholars-on-scientific-evidence/","cat":"art","title":"Art Scholars on Scientific Evidence"},{"id":"comment-195838","author":"piero","post":"I have written in a hurry and I also forgot to mention the old study (published: December 16, 2009): Molecular Exploration of the First Century Tomb of the Shroud in Akeldama, Jerusalem by Matheson CD, Vernon KK, Lahti A, Fratpietro R, Spigelman M, et al. Link: http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0008319 See also: Correction: Molecular Exploration of the First Century Tomb of the Shroud in Akeldama, Jerusalem >Dr. Boaz Zissu was mistakenly omitted from the author byline. >He should be listed as the ninth author and is affiliated with Martin (Szusz) Department of Land of Israel Studies and Archaeology, Bar Ilan University, Israel. >His contribution included excavating materials for analysis. Link: http://journals.plos.org/plosone/article?id=10.1371/annotation/32ada7b9 3772 4c08 9135 b5c0933f0b5e See also: Mitochondrial and Y chromosome haplogroups extracted from historic human remains in Israel under the address: http://www.ancestraljourneys.org/ancientjewishdna.shtml Another interesting link: http://www.the scientist.com/?articles.view/article No/40956/title/Jewish Heritage Written in DNA/ Jewish Heritage Written in DNA >Fully sequenced genomes of more than 100 Ashkenazi people clarify the group’s history and provide a reference for researchers and physicians trying to pinpoint disease associated genes. Bibliographic reference: S. Carmi et al., “Sequencing an Ashkenazi reference panel supports population targeted personal genomics and illuminates Jewish and European origins,” Nature Communications, doi:0.1038/ncomms5835, 2014..","date":"2015-04-09","mins":"7:49 am","url":"https://shroudstory.com/2015/04/09/art-scholars-on-scientific-evidence/","cat":"art","title":"Art Scholars on Scientific Evidence"},{"id":"comment-195842","author":"piero","post":"Two more words on the “tomb of St. Joseph”: “In an ecstasy, a saint has seen the body of St. Joseph preserved intact in a tomb, the site of which is yet unknown. The more the glorious spouse of the most Blessed Virgin Mary is honored, the sooner will the finding of his body take place, which will be a day of great joy for the Church.” [Words of Fr. Paul of Moll, 1824 1896, from Father Paul of Moll, by Edward van Speybrouck, p. 238] Any news? A secret burial?.","date":"2015-04-09","mins":"8:15 am","url":"https://shroudstory.com/2015/04/09/art-scholars-on-scientific-evidence/","cat":"art","title":"Art Scholars on Scientific Evidence"},{"id":"comment-206952","author":"piero","post":"Do you know “The Miraculous Image Of Our Lady Of Absam”? Here the story: >In 1797, in the small village of Absam near Innsbruck, a young girl was astonished to see an image of the Virgin Mary appear in the windowpane next to her. >The image was determined to be miraculous and began to cause miraculous healings. >Today, the small glass pane with the image of the Virgin is enshrined in the parish church for veneration. … >… The parish priest had the windowpane removed for examination by experts, who discovered that the image disappeared when submerged in water, but reappeared as before when dry. >The origin of the image was declared undetermined, and both the priest and bishop declared the image to be miraculous. … etc. … Links: http://fineartamerica.com/featured/the miraculous image of our lady of absam elzbieta fazel.html http://www.sacred destinations.com/austria/absam shrine of our lady Well. Perhaps this image (=”The Miraculous Image Of Our Lady Of Absam”) can be a moral alternative….","date":"2015-07-30","mins":"8:09 am","url":"https://shroudstory.com/2015/07/30/fyi-tasteless-art/","cat":"art","title":"FYI:  Tasteless Art"},{"id":"comment-195921","author":"piero","post":"Why Jesus went to pray in the Garden of Gethsemane? Was that due (perhaps) to the fact that the tomb of Joseph, the foster father, was nearby? What do you think of this idea? >According to the canonical Gospels, after the Last Supper, Jesus and his disciples went out to Gethsemane, a garden located at the edge of the Kidron Valley, thought by scholars to probably have been an olive grove. >Once there, he is described as leaving the group so that he can pray privately Link: http://en.wikipedia.org/wiki/Arrest of Jesus Perhaps you should explore the idea of a tomb of St. Joseph nearby. Maybe this could better “explain” the phenomenon of sweating blood of Jesus … See also what wrote (about the “hematohidrosis”) the physician Luke, a well educated man and a careful observer by profession..","date":"2015-04-10","mins":"5:18 am","url":"https://shroudstory.com/2015/04/09/art-scholars-on-scientific-evidence/","cat":"art","title":"Art Scholars on Scientific Evidence"},{"id":"comment-206954","author":"piero","post":"Everyone should be free to do what he wants (… but in the artistic field of moral works) and then I do not want to put myself in command of the other home!… In any case: >The glass pane is just seven inches tall and five inches wide, but the face of Mary can be clearly seen. >It is enclosed in a metal shrine with golden rays, a golden crown, golden flowers, and precious jewels. … References: http://fineartamerica.com/featured/the miraculous image of our lady of absam elzbieta fazel.html http://enewschannels.com/2015/07/29/daniel edwards and cory allen contemporary art salute tom cruises 25th anniversary unveil nude shroud of actor enc46286 150253.php/ — — >Daniel Edwards is an American sculptor known for his what the bleep inducing artwork that includes such classic works such as nude Britney Spears on a Bearskin Rug While Giving Birth, a topless Sen. >Hillary Clinton, Bronzed Suri Cruise’s First Poop, and something called a Paris Hilton autopsy. Link: http://www.browardpalmbeach.com/news/artists pop up church of scientology features naked tom cruise statue 7148221.","date":"2015-07-30","mins":"8:31 am","url":"https://shroudstory.com/2015/07/30/fyi-tasteless-art/","cat":"art","title":"FYI:  Tasteless Art"},{"id":"comment-206957","author":"piero","post":"Perhaps a “Laywood statue” can be more interesting… Links: https://3dspacelabs.com/product/laywood laywoo 3 wood filament 1 75mm 250g experimental/ http://3dprintingindustry.com/2014/02/10/journey laywoo d3 interview wood filament inventor kai parthy/ http://3dprintingindustry.com/art sculpture/ https://www.facebook.com/global3dlabs/photos stream?tab=photos albums.","date":"2015-07-30","mins":"8:50 am","url":"https://shroudstory.com/2015/07/30/fyi-tasteless-art/","cat":"art","title":"FYI:  Tasteless Art"},{"id":"comment-73819","author":"piero","post":"If you have followed the story about Bianca Sforza then there are the >Corresponding stitch holes and incison marks between La Bella and the Sforziad. Image via The Guardian Link : http://www.3pipe.net/2011/07/enhancing art of seeing leonardo case.html >….On January 25th 2012, Mystery of a Masterpiece was aired on the NOVA program on PBS in the US. It provided a wonderful overview of much of the evidence presented above, though its true highlight was the section on the identification of the Sforziad source volume in Poland … See also : Mystery of a Masterpiece. (Documentary) NOVA. PBS. Aired 25th January 2012. Excerpt edited by H Niyazi. Link : http://www.pbs.org/wgbh/nova/tech/mystery masterpiece.html — — — In the case of the other claim, there is the starting point, the phrase : IACO:BAR:VIGEN/NIS P.1495 – written on cartouche (of 1495). —– The painting has been generically attributed to Jacopo de’ Barbari due to the presence of a cartouche with the inscription IACO.BAR. VIGENNIS. P. 1495, with the enigmatic presence of a fly above it. However, the attribution to the Venetian painter is now generally regarded as wrong, due to pictorial and historical considerations. The painting has been even attributed to Leonardo da Vinci … Source : http://en.wikipedia.org/wiki/Portrait of Luca Pacioli — Instead, if you love the Mathematics, see under : http://cage.ugent.be/~hs/pacioli/pacioli.html Pacioli clearly is exposing a theorem to one of his pupils … — — and there is a link : http://www.carlaglori.com/cartiglio/decifrazioni e soluzioni 2010 2013/ Here the italian words (for the curious idea about the particular in that portrait) : >Particolare del Ritratto di Luca Pacioli con un allievo: messa a fuoco del dettaglio posto sotto la manica sinistra dell’allievo (Galeazzo Sanseverino, indicato dalla vedova Isabella quale complice del Rosate) comparato con alcuni campioni di arsenico nativo e di arsenico con rame (nel centro). Osservando attentamente, si riscontra analogia tra la forma dipinta e quella naturale dell’arsenico nativo. Arsenic = poison ! …. I am thoughtful … this seems to be only a fur… In my opinion, we have to find a more decisive proof. Have you tried ? — — I hope to see the same deep critical insight for the problems of the Shroud because the acuteness about Leonardo was great, but in the case of the Holy Shroud we are still waiting for the useful exact analyses since the year 1998. The working “aculeus” of the AFM tip was not used on linen fibrils in order to obtain the truth ….","date":"2014-01-20","mins":"11:48 am","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","title":"Most Scientists . . . Don’t You Just Love It"},{"id":"comment-73934","author":"piero","post":"I beg your pardon ! This blog is centered on Turin Shroud and my interventions were a bit far from the Shroud … In any case I have appreciated your past words about the conspiracies (in one of your messages, in September 2013) … and then this is my fast explanation about these strange interventions. — * — * — The other question connected is the multispectral analysis … and the level of resolution obtained about the analyses on linen fibrils. Perhaps we can find other time to discuss that issue ….","date":"2014-01-21","mins":"10:23 am","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","title":"Most Scientists . . . Don’t You Just Love It"},{"id":"comment-207399","author":"piero","post":"It seems to me that you have forgotten to say that the idea of Leonardo as an author of the current “Shroud of Turin” had been made, fifteen years ago, indicating the Shroud as a pyrography (= Irene Corgiat)… Here the story: >Convegno sulla Sindone che il CICAP Gruppo Piemonte ha organizzato per il 24 ottobre 2000 presso la prestigiosa sede dell’Aula Magna del Politecnico di Torino. Rough translation: >Conference on the Shroud that CICAP, Piedmont Group, organized for October 24, 2000 at the prestigious headquarters of the Great Hall of the Polytechnic of Turin. Source: http://www.cicap.org/piemonte/cicap.php?content=sindone&section=convegni >…In sala era presente anche la giornalista Vittoria Haziel, la quale durante il dibattito ha mostrato la fotografia di un volto in tutto e per tutto simile a quello della Sindone, realizzato con la tecnica del pirografo da Irene Corgiat, un’artista di Baldissero Torinese. Rough translation: >…In the room there was also the journalist Victoria Haziel, which during the debate had shown the photograph of a face in every way similar to that of the Shroud, made with the technique of pyrography by Irene Corgiat, an artist of Baldissero Torinese. I do not think that the Shroud is a pyrography, also there is not a clear explanation (for that presumed artwork/pyrography) regarding the simultaneous presence on the cloth for the stains of blood, some of which conceal the image of the body (if I’m not mistaken). Then, try to solve the problem about the Irene Corgiat’s use of an electric pyrotool on linen and the inherent controls on that material using a microscope … How it appears (under a microscope) a linen fiber, before and after, a pyrography? — — — Vittoria Haziel’s book is entitled: “La Passione secondo Leonardo” (= The Passion According to Leonardo). It is written in Italian and was published in Milan by Sperling & Kupfer in 1998… Link: http://carverscompanion.com/Ezine/Vol7 Issue2/K Menendez/K Menendez.html.","date":"2015-08-04","mins":"9:37 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-73813","author":"piero","post":"I am curious about that interesting portrait … and the analyses. If you read under : http://en.wikipedia.org/wiki/Portrait of a Young Fianc%C3%A9e There is the description : >Portrait of a Young Fiancée, also called La Bella Principessa (English: “The Beautiful Princess”), is a portrait in coloured chalks and ink, on vellum, of a young lady in fashionable costume and hairstyle and then You can find something about : The physical and scientific evidence from multispectral analysis and first hand study of the painting, as described by Kemp … — — Here other informations : >Kemp recently published, with a colleague, a book called “La Bella Principessa: The Story of the New Masterpiece by Leonardo da Vinci,” which contains a chapter by Biro, entitled “Fingerprint Examination.” In the manner of a law enforcement officer presenting forensic evidence in court, Biro arranges the images of the “St. Jerome” and the “Principessa” fingerprints side by side, with arrows pinpointing what he identifies as eight overlapping characteristics between them. I asked Charles Parker—a latent fingerprint examiner with more than thirty years of experience in the field, who has helped to establish guidelines for fingerprint examiners in the United States—to review the chapter. He said that most of the arrows don’t point to actual overlapping characteristics, just random details, and that, judging from the images presented, the partial fingerprint on “La Bella Principessa” is too poorly detailed for an identification to be made. “No other examiner I know would sign off on it,” he said. “I couldn’t even get it past the door.” Wertheim agreed with this assessment, and suggested that Biro’s approach was the equivalent of trying to identify a man based on seeing his ear poking out from behind a bush for a fraction of a second. >“The fingerprint community can get quite dogmatic,” Biro told me in another conversation. “They don’t like people who rock the boat, and I could be seen as a loose cannon to some, because I’m questioning a lot of things.” Source : http://www.newyorker.com/reporting/2010/07/12/100712fa fact grann — — and from another source : >The attribution to Leonardo Da Vinci, based on the multispectral scanning of the Research Laboratory Lumiere Technology, was confirmed in 2009 by six Art historians, Nicholas Turner, Carlo Pedretti, Alessandro Vezzosi, Mina Gregori, Cristina Geddo and Martin Kemp. >The main opposition came from the experts in New York and from some observers who had missed this attribution when the work was in the hands of Christie’s and the Gallery Ganz, against the background of lawsuit at the Court of New York brought against Christie’s by Jeanne Marchig, the previous owner who had consigned the drawing to the auction house for sale. >Through the knowledge of the original colours of the restored work, Martin Kemp and Pascal Cotte had tentatively identified the portrait as that of Bianca, the illegitimate daughter of Duke Ludovico Sforza, who was legitimized in 1496 and married to Galeazzo Sanseverino, Commander of the armies of the Duke. She died tragically a few months after her marriage. Link : http://www.lumiere technology.com/discoveries2.html — — But … there are other stories around Bianca Sforza : According to Italian art historian Carla Glori, the face of the enigmatic “Mona Lisa” (also known as “La Gioconda”), painted by the great Renaissance master Leonardo Da Vinci, and the replica, the “Prado Mona Lisa” is the face of Bianca Giovanna Sforza. However, that claim does not convince those who have sustained for many years the belief that it is a portrait of Mona Lisa or Lisa Gherardini. >Based on research by Glori, Bianca Sforza was the wife of Galeazzo Sanseverino and the legitimate daughter of Ludovico il Moro and Bernadina de Corradis, who lived in Bobbio, in northern Italy. The writer claims the portrait was painted from the Malaspina dal Verme Castle, Bobbio, from where there is an observable bridge, the Ponte Vecchio Bobbio (Old Bridge of Bobbio), visible over the sitter’s left shoulder. … … Instead >Retired Oxford professor Martin Kemp, however, said the bridge in the portrait of Lisa del Giocondo and the historic Bobbio bridge do not seem very similar. >“There have been many attempts to identify the landscape as a specific location and I do not find the resemblance to the Bobbio bridge all that close,” Kemp said, according to The Daily Mail. Source : http://www.theepochtimes.com/n2/arts entertainment/the two faces of leonardo da vincis mona lisa 192868.html — — Here the last story : an italian book … Enigma Leonardo: decifrazioni e scoperte vol.1 La Gioconda. In memoria di Bianca di Carla Glori, Ugo Cappello ———————————– At the end … If you want to try to understand the enchantment (see : Galeazzo Sanseverino and Bianca Sforza …) and all the (presumed) findings, you have to translate the words : ROGAS ABACUM SINE VINCI – (P.1495) Source : http://www.carlaglori.com/cartiglio/decifrazioni e soluzioni 2010 2013/ … and do you know Messer Ambrogio da Rosate (a wizard), prime astrologer ? He was able to prepare the poison … for the death of Gian Galeazzo Sforza (1469 1494), Duke of Milan ! Then there is the work by Azzolini : Astrology and Politics in Renaissance Milan, Harvard University Press (2013) Link : (function() { var scribd = document.create Element(\"script\"); scribd.type = \"text/javascript\"; scribd.async = true; scribd.src = \"#{root url}javascripts/embed code/inject.js\"; var s = document.get Elements By Tag Name(\"script\")[0]; s.parent Node.insert Before(scribd, s); })() — — All these stories are far from the Holy Shroud, but there is a possible analogy with the strange stories of attempts, manipulations, “scientific empoisoning”, etc. … Am I an awkward guest ? Sorry … I simply tried to indicate/describe the History and the plots ….","date":"2014-01-20","mins":"10:56 am","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","title":"Most Scientists . . . Don’t You Just Love It"},{"id":"comment-139992","author":"piero","post":"Gamma or L (Lumen)? The Greek letter gamma represents the number Three. Thank you very much for all the informations and explanations about the Gammadia! But … Where is the useful proof about the true epoch of that ancient “reference mark”? Which kind of analyses on that “sealed verdict” (“Gamma = Trinity” … or “L = Lumen”… in medieval era… ?)? The samples have already been taken in 2002 and are held in Turin. But … they have destroyed the original configuration. Which kind of withdrawal or dust sampling (… in order to control the material using adequate analyses) can solve that “poker holes/Gammadia” problem? Another question: Powders are really contaminated? If (after the famous restoration, performed in 2002) we are in those conditions, then (perhaps) we can no longer understand anything (about the ancient origin of the holes)… Am I wrong in my remark? Where is the right analytical solution? … and then you should do as someone who wanted. Thus : to burn those carbonaceous grains (with 14 C tests)… … without further analyses? Now I’m perplexed … How to work accurately? Where is the right nano analytical way to solve the problem? CFM ?.","date":"2014-07-23","mins":"12:45 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-143523","author":"piero","post":"It looks like an alien sculpture. But … Where are the alien hieroglyphics? Where’s the code of the “Life capsule” (= containig insects, flowers, plants, etc. !) launched by ET to populate the solar system? — — Here I will tell you my story … : Thirty years ago I bought the book “Evolution from Space”. Fred Hoyle (in collaboration with Chandra Wickramasinghe) was a champion of the modern theory of panspermia. Panspermia is essentially the theory that life comes from off the Earth … Have you developed your own stories about ‘Cosmic Ancestry’ ? Have you chosen an “anthropo insect” space race ? … Insects from space ? How identify the limit dose of radiation ? Where are the set required experiments? See also the argument : “Life in space and its arrival on Earth (and Mars)” … — — Alexander Ivanovich Oparin (1894 1980) was a Soviet biochemist who was famous for his studies of the origin of life… In the 1920’s and 30’s, he developed the idea of the chemical emergence of life. Oparin argued that, as chemicals mixed together over time, they formed more complex chemicals. With longer periods of time, they formed even more complex organic chemicals. But he rejected the notion of panspermia. Instead Hoyle and Wickramasinghe followed the theory of Panspermia (see also : Svante Arrhenius and his book : “Worlds In The Making: The Evolution Of The Universe”) … — — After a decade long journey (at least) let us return to reality! >COSIMA (Cometary Secondary Ion Mass Analyser) is a secondary ion mass spectrometer equipped with a dust collector, a primary ion gun, and an optical microscope for target characterization. Dust from the near comet environment is collected on a target. The target is then moved under a microscope where the positions of any dust particles are determined. The cometary dust particles are then bombarded with pulses of indium ions from the primary ion gun. The resulting secondary ions are extracted into the time of flight mass spectrometer. >The core of the COSIMA instrument is a time of flight (TOF) secondary ion mass spectrometer (SIMS) equipped with a dust collector, a primary ion gun, and an optical microscope (COSISCOPE) for target characterization. Link: http://sci.esa.int/rosetta/35061 instruments/?fbodylongid=1638 — — Where is a similar plan for the Holy Shroud? Perhaps the unconscious hope of finding evidence of extraterrestrial origin for Life is stronger than the will to analyze the Shroud (here, on Earth!)….","date":"2014-08-12","mins":"7:46 am","url":"https://shroudstory.com/2014/08/12/you-would-think-someone-at-livescience-would-know-better-by-now/","cat":"pareidolia","title":"You would think someone at LiveScience would know better by now"},{"id":"comment-188071","author":"piero","post":"There are very few words under the address: http://test2.e20progetti.it/docbi/modules/smartsection/item.php?itemid=108 = … a Quittengo (oratorio di Roreto). >In conjunction with the exhibitions of the Shroud of 1998 and 2000 started a project in multiple phases, which provided, in collaboration with the Superintendence of Piedmont, cataloging, photographic documentation, the study and the proposed restoration of all representations Shroud recoverable in the Biella … — — — We can read that, with the collaboration of the Superintendence for Artistic and Historical Heritage [who directed the work] was initiated action for recovery of the most damaged works and then had been recovered five paintings depicting the Holy Shroud. Here I want to add that: this place (Roreto) is located only three kilometers from my house (in fact I live in Campiglia) … In my Valley there have been (who have lived or were born there) and there are still some painters … I want to clarify that I am not a painter and I have nothing to do with the restoration of the painting as it was run. — — — Here another address about frescoes depicting the Shroud made on the walls of private homes in Piedmont: http://www.piemontesacro.it/sindone/indirizzi affreschi sindonici piemonte valle d aosta.htm.","date":"2015-02-01","mins":"10:23 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-205860","author":"piero","post":">A well known book is ‘Le Mystère des Cathédrales’ written in 1929 by Fulcanelli (1839 – 1953), the mysterious French alchemist who was one of the first to write about the mysteries surrounding the French cathedrals. >According to Fulcanelli a cathedral is an alchemical book written in stone. … Link: http://www.soulsofdistortion.nl/The%20mystery%20of%20the%20 Cathedrals.html >The Gothic cathedral architecture originated in France in the early 12th century during the heydays of the Knights Templar. >The Knights Templar officially called the ‘Poor Fellow Soldiers of Christ and of the Temple of Solomon’ formed a knight’s order of priests who protected the pilgrimage routes to Jerusalem. >The order was founded in 1118 by Hugo van Payens who managed to team up nine brave knight priests. This group of nine knights became to be one of the richest and most powerful groups in history. >With their huge wealth, collected from financing the crusades, they were able to build the Gothic cathedrals in Europe. … etc. … — — Here another clue: >… the key to the major Arcanum is given quite openly in one of the figures, illustrating the present work. And this key consists quite simply in a colour revealed to the artisan from the first work. No Philosopher, to my knowledge, has emphasized the importance of this essential point. In revealing it, I am obeying the last wishes of Fulcanelli and my conscience is clear. Http://shadowtheatre13.com/mysterycathedrals.html I am joking!… See also: >… Anyone with knowledge of the alchemical books of the past will accept as a basic premise that oral instruction from master to pupil is the most valuable of all. Fulcanelli received his own initiation in this way, as I myself received mine from him, although I owe it to myself to state that Cyliani had already opened wide for me the great door of the labyrinth that week in 1915, when the new edition of his little work was published. … Sorry. I am joking!….","date":"2015-07-15","mins":"10:47 am","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","title":"Swipe of the Day"},{"id":"comment-205861","author":"piero","post":"Alchemy is represented by a woman, in Paris… I am joking!… >Fulcanelli nous indique, dans son Mystère des cathédrales : “l’alchimie y est figurée par une femme dont le front touche les nues. Assise sur un trône, elle tient de la main gauche un sceptre, – insigne de souveraineté, – tandis que la droite supporte deux livres, l’un fermé (ésotérisme), l’autre ouvert (exotérisme). Maintenue entre ses genoux et appuyée contre sa poitrine se dresse l’échelle aux neuf degrés, scala philosophorum, hiéroglyphe de la patience que doivent posséder ses fidèles, au cours des neufs opérations successives du labeur hermétique .” >A sa gauche une femme élève un matras. Il contient la quintessence des plantes, les digitales situées dans son dos, plantes toxiques. C’est un mal dont l’art peut extraire un bien. A droite, l’autre femme tient un astrolabe, instrument d’astronomie. Le point commun de ces trois figurations est de permettre de manifester l’invisible, que ce soit en possibilité de nature ou en compréhension de lois subtiles. Here a rough translation: >Fulcanelli tells us, in his Mystery of the cathedrals. “Alchemy is represented by a woman whose forehead touches the clouds Sitting on a throne, she holds in his left hand a scepter, – insignia of sovereignty – while right supports two books, one closed (esotericism), the other open (exoteric). Maintained between his knees and leaning against his chest rises across nine degrees scala philosophorum hieroglyph patience required of her faithful, during successive operations of the new hermetic labor. ” >To his left a woman raising a flask. It contains the quintessence of plants, located finger in his back, poisonous plants. It is an evil whose art can extract property. On the right, the other woman holds an astrolabe, astronomical instrument. Common to these three representations is to manifest the invisible, whether in kind or ability to understand subtle laws. Link: http://hermetism.free.fr/Alchimie.htm Do you know two works of Fulcanelli ? >His works are the “Mystery of the cathedrals” (see the photography of the original edition) and the “Dwellings of the philosophers”, published between the years 1926 30 and after published again regularly by Jean Jacques Pauvert… >Fulcanelli shows that alchemy, before printed on paper, was engraved on the stone books that are the walls of certain cathedrals or castles. We go today discovering these paper and stone books. Link: http://hermetism.free.fr/index US.htm.","date":"2015-07-15","mins":"11:03 am","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","title":"Swipe of the Day"},{"id":"comment-180304","author":"piero","post":"I have found the following translation (for “¡No dejes de verlos!”): “Do not let see them!”. — — Excuse me, I think we can try to do something even playing with the kids … Look, for example, how to create a portrait of Jesus, starting from the proper processing of a photo of the Shroud. Create your portrait starting from the Man of the Shroud! You just need a photo to start from and then follow the instructions step by step Link: http://www.quercettiart.it/en/ I think that instead of using the supplied color could draw different shades more suitable, but from satisfactory basis (ie: appropriate shades of brown, gray and black, blood red, etc.). So we should ask (for 2015) that the publisher publishes a game specifically to coincide with the exhibition of the Shroud. I see that what seems too elaborate, then (before leaving with requests, perhaps strange …) it would be better to observe what results are achieved with what is already available now. I believe that any of our readers can develop a better idea, maybe doing the tests (crafts) with bits of charred linen soiled linens and a blood red appropriate, indelible … Excuse me if once again I ended up quite off topic ….","date":"2014-12-31","mins":"9:57 am","url":"https://shroudstory.com/2014/12/30/the-awesome-shroud-based-art-of-juan-manuel-miarro-lopez/","cat":"art","title":"The Awesome Shroud-based Art of Juan Manuel Miñarro Lopez"},{"id":"comment-189088","author":"piero","post":"This painting and others are present in the booklet published in 2000: “The Sindoni found. Restoration of the representations in the Biella “. There are already many years that I have this book, that is from October 15, 2000 … The image of Roreto (previously mostrataci) is on p. 39. And is attributed to a Piedmont painter (maybe it was part of Bartolomeo Caravoglia), the second half of the seventeenth century. This instead was shown recently in the blog is located in Biella Vernato (about 15 km from my house). This is a fresco depicting the Shroud better known Biella, made popular by the good conservation (= … see also under the heading: “House of the Shroud”) That fresco on the wall is attributed to a painter Biella (age: third quarter of the seventeenth century). Restoration: 1983, Viviana Horse on behalf of the City of Biella (financing = City of Biella). The Saints are known St. Joseph and St. Philip Blacks (what with unanimous consent, because they are identified with certainty), while the other two figures have been variously identified as St. Stephen’s and St. Anthony of Padua (of Oldenico, 1953) or Gaetano Thiene and Nicholas of Tolentino (and Fist of Oldenico, 1975). — — — The fact of defining Oropa as “Santuario di Oropa Templar of the thirteenth century” it seems a bit too much, but someone has this particular idea … Link: http://icavalierideltempio.blogspot.it/2011/10/la madonna nera quale maria.html B.T.W.: Did you know that the interior of the statue of the black Madonna of Oropa (XII sec.) is hollow? But … what they wanted to hide in the cavity? — — — Under: http://en.wikipedia.org/wiki/Black Virgin of Oropa I have found the following words: >The original image of the Black Virgin of Monte Oropa was made in the third century. She was brought by St. Eusebius of Vercelli from the Middle East to his diocese of Vercelli. >The image was made of cedar of Lebanon and painted black. A mid fourth century intensified the persecution of Mary (mother of Jesus), and St. Eusebius had to hide her in the mountains of Sacro Monte di Oropa, about 9 miles from Biella, Italy. See also: >According to tradition Luke the Evangelist carved this statue and St. Eusebius brought it to Italy. Link: http://interfaithmary.net/pages/oropa.htm So… The previous words accredit the “legend of Eusebius”, but we know that (instead) the statue is made of wood most likely from the Valle d’Aosta (= cirmolo valdostano)… >IL CIRMOLO è in realtà il famoso pino cembro, albero sempreverde ad aghifoglie del genere Pinus, della famiglia delle Pinaceae. >Alto non più di 25 metri, la sua chioma è da piramidale a espansa.Specie montana diffusa principalmente sul crinale alpino, se ne trovano degli esemplari anche nei Balcani ed in Europa centrale. >Cresce a partire dai 1500 metri di quota fino al limite boschivo,circa 2300 metri Rough translation: >THE CIRMOLO is actually the famous stone pine, evergreen conifers to the genus Pinus, in the family Pinaceae. >Not higher than 25 meters, its foliage is from pyramidal expanded. Mountain species spread mainly on the alpine ridge, they are found in specimens also in the Balkans and Central Europe. >It grows from the 1500 meter mark to the tree line, about 2300 meters Link: http://www.pinuscembra.it/cirmolo/index.php/prodotti.html Therefore (probably) the statue was made by a sculptor of the Aosta Valley … See also under the address: http://www.santuariodioropa.it/db/it/storia e cultura/storia del santuario >All’interno del Sacello è custodita la statua della Madonna Nera, realizzata in legno di cirmolo dallo scalpello di uno scultore valdostano nel XIII secolo… = > Inside the chapel houses the statue of the Black Madonna, made of pine wood from the chisel of a sculptor Val d’Aosta in the thirteenth century… Link: http://www.santuariodioropa.it/db/en/hospitality/rooms In any case I think this is a different story compared to the Shroud ….","date":"2015-02-04","mins":"9:59 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189094","author":"piero","post":"I wrote: >The image of Roreto (previously mostrataci) is on p. 39. As usual I was a bit ‘hasty writing my message. So … I wanted to write: > The image of Roreto (previously shown to us) … — — — Black Madonna and the Shroud and Four Saints: At p. 57 of the text (= “Le Sindoni ritrovate. Restauro delle raffigurazioni nel Biellese”October 2000) that I have previously indicated is quoted Giuliano Genta (he dwelled at Piazzo, the ancient neighborhood of Biella), probably the father of the painter Giuseppe Antonio. But it was done also the name of Francesco Chiamorra, of what is known a painting executed in 1672 for the parish of Vandorno (Source: Don Delmo Lebole: History of the church Biella. The parish of Biella., Vol III, Biella, 1986) … That image (which is present in the home of the Shroud of Piazzo) has been inserted in a wide shot architectural trompe l’oeil, which simulates a frame decorated with golden relief applications … Here few words about “the house of the Shroud” of Biella Piazzo = Typical construction of the fifteenth century, what characterizes it is a painting of the Holy Shroud on the entrance door. In the past arose strange rumors about “the home of the Shroud” of Piazzo … http://www.weagoo.com/it/card/6644/casa della sindone For exampe, try to see on Facebook: https://www.facebook.com/events/669358379790331 https://www.facebook.com/events/669358379790331/?ref=51&source=1 = Walking with the ghost. Haunted house at Piazzo… The home of the Shroud of costa del Vernato, municipal property, is infested with appearances … See also: The public testimony of tenants that (because of fear) have abandoned the premises Link: http://biella.netweek.it/notizie/cronaca/biella casa della sindone infestata dai fantasmi br la pubblica testimonianza degli inquilini che per la paura hanno abbandonato i locali br 2343163.html.","date":"2015-02-04","mins":"10:41 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189100","author":"piero","post":"Here are some more words about the plant from which it seems to have been the statue of Our Lady of Oropa : >Pinus cembra, also known as Swiss pine, Swiss stone pine or Arolla pine, is a species of pine tree that grows in the Alps … etc. … Link: http://en.wikipedia.org/wiki/Pinus cembra >Beds and furniture made of Pinus cembra are very popular within the Alpine region of Europe as scientific studies of Joanneum Research in 2003 have shown that exposure to a Swiss Stone Pine can improve sleep … … — — Unfortunately I have no recent scientific references because scientific analyses on the statue were considered unnecessary by His Eminence the Bishop of Biella (I had publicly asked his opinion on that argument about 10 or 15 years ago …). In fact we already knew the results of analyzes made over 100 years ago … Yet someone insists with an eusebian legend… Well … it does not seem that it is appropriate to deepen the analysis on the wood of Vallle Aosta (epoch = the twelfth century) … But you, what do you think?.","date":"2015-02-04","mins":"10:58 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"}]
