[{"id":"comment-87362","author":"piero","post":"Hi, Hugh … If I am right Garlaschelli worked using an acidic paint (= a wrong hypothesis) … But Thibault Heimburger and Giulio Fanti denied the validity of that way … ——————————– Here another question … I have just found an interesting article (on microdrops) : Microdrops Evaporating on AFM Cantilevers by Elmar Bonaccurso Progress in Colloid and Polymer Science Volume 134, 2008, pp 57 65 Abstract >The kinetics of evaporation or drying of microscopic, sessile drops from solid surfaces is relevant in a variety of technological processes, such as printing, painting, and heat transfer applications, besides being of fundamental interest. >Drop evaporation has been commonly observed by means of video microscope imaging, by ultra precision weighing with electronic microbalances or with quartz crystal microbalances (QCM). Abundant information was gained over the years with these techniques, so that the evaporation of macroscopic drops of simple liquids from inert surfaces is nowadays well understood. The same techniques are, however, not applicable to microscopic drops. Furthermore they do not directly provide a measure of the interfacial stresses arising at the contact area between liquid and solid, which are known to play a key role in the evaporation kinetics of small drops. >Here I show how the use of atomic force microscope (AFM) cantilevers as sensitive stress, mass, and temperature sensors can be employed to monitor the evaporation of microdrops of water. Starting drop diameters are always below 100 μm. The foremost interest lies in exploring the last stages of the evaporation process See also : Atomic Force Microscope Cantilevers Used as Sensors for Monitoring Microdrop Evaporation Elmar Bonaccurso, Dmytro S. Golovko, Paolo Bonanno, Roberto Raiteri, Thomas Haschke, Wolfgang Wiechert, Hans Jürgen Butt Applied Scanning Probe Methods XI Nano Science and Technology 2009, pp 17 38 Link : http://link.springer.com/chapter/10.1007/978 3 540 85037 3 2 Abstract >For studying the evaporation of millimetre sized drops of liquids techniques such as video microscope imaging and ultra precision weighing with electronic microbalances or with quartz crystal microbalances have been employed in the past decades. Similar techniques are, however, hardly applicable to microscopic drops. Moreover, they do not provide a measure of the interfacial stresses arising at the contact area between liquid and solid. >Here we demonstrate the use of atomic force microscope (AFM) cantilevers as sensitive stress, mass, and temperature sensors for monitoring the evaporation of microdrops of water from solid surfaces. >Starting from considerations on drops in equilibrium, we will further discuss evaporating drops and details of the experimental technique. We will show how the evaporation of water microdrops on a hydrophobic surface differs from the evaporation on a hydrophilic surface, and how this difference becomes more pronounced towards the end of evaporation. >We further show that one side metal coated cantilevers, acting as bimetals, allow measuring the average temperature of an evaporating microdrop. >Finally, we will discuss two further applications of microdrops evaporating on cantilevers, namely testing the local cleanliness of cantilevers’ surfaces and calibrating cantilevers’ spring constants — — — Perhaps there is the possibility to do the controls about solutions of Saponaria officinalis (and then, see also : the behavior of Saponaria on linen fibrils = concentration evaporation phenomena, etc.) and/or starch (hot) solutions … or water … with dissolved radioactive salts (… !?!?!?). So … the possible next contamination from ukrainian nuclear reactors, during the turmoils, is not an unsolved problem … … because under : http://www.ivanhoe.com/science/story/2011/08/896a.html We can read : >… The earthquake in Japan raised an even bigger issue– radioactivity. But NC State physicist, Dr. Joel Pawlak may have the solution: biodegradable foam. It works like a gooey sponge to pull salt, heavy metals and even radioactive materials like potassium iodide that don’t dissolve out of water. > … … … … >… One liter of the foam can turn a hundred liters of contaminated water into safe drinking water. It’s physics and material science that could save lives. The foam may also offer a new option for turning salt water into water that’s safe to drink. … What is your opinion ? — — — >The soil in Kashiwa city, Chiba, is heavily contaminated by fallout from Fukushima >… … … > … … … .. >… Peaks for 134 Cs and 137 Cs were extremely prominent, overriding all other data. The activity of the radio cesium caused Compton scattering covering half of the entire spectrum effectively hiding any NORM or other potentially detectible radio isotopes. Further tests will need to be performed using extended testing times, perhaps 48 hours, and no lead shielding, reducing the Compton scatter. As a secondary precaution, given the levels of radio cesium found, a sample of 137 Cs with an approximate activity of 37,000 Bq was compared to the J A peaks to fully validate the results. Link : http://fraughtwithperil.com/cholte/2012/05/22/soil samples near tokyo kashiwa in chiba/ —————————————– Then the argument to investigate seems to be the following : Flax retting in contaminated (radioactive) environment … —– —– But I don’t believe in “this explanation” … for the results obtained in 1988 … See also : the book by Carlos Evaristo (Fatima, Portugal) titled : “The Untold Story of the Holy Shroud”. Have you read that particular book ?.","date":"2014-03-11","mins":"10:12 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"}]
