[{"id":"comment-193217","author":"piero","post":"I hope not to be misunderstood. I do not believe that there are strange secret messages based on cotton … What interested me emphasize is the solution to the problem inherent to the study of the frequency with which Cotton appears in blend Linen/Cotton. Linen is the strongest of all the vegetable fibers, perhaps with 2 to 3 times the strength of Cotton and it contains lignin. Instead lignin is absent in Cotton. This is another point where we can start with another type of analyses..","date":"2015-03-12","mins":"12:46 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192920","author":"piero","post":"Chemistry and terpenes. Terpenes may be classified by the number of isoprene units in the molecule; a prefix in the name indicates the number of terpene units needed to assemble the molecule… Links: http://en.wikipedia.org/wiki/Terpene http://chemwiki.ucdavis.edu/Organic Chemistry/Lipids/Terpenes * * * * * * Yesterday Hugh Farey indicated us the word “terpene”, here the excerpt from the phrase (and here that word is at the end of the third line): “… wheter the old threads have been unravelled for a small length and new threads spliced into them and glued with terpene, and then the whole section rewoven to be truly invisible. …” So… I am curious to understand what he thinks about the origin of that terpene. Was that terpene a residual substance, deriving from the use of oil of turpentine? ( link: http://en.wikipedia.org/wiki/Turpentine ) If you want another source for the word “terpene” there are the >triterpene saponin glycosides Here the third source of “terpene”: >Canada balsam, also called Canada turpentine or balsam of fir, is a turpentine which is made from the resin of the balsam fir tree … But, in my opinion, both are wrong ways to follow (regarding the “terpene”)… — — — I believe there is an another interesting argument to discuss: “Flax wax”… What is the exact melting point of the flax wax ? Here an example in the field of vegetal waxes : >Rice bran from the milling of rice, Oryza sativa, contains a wax mixed with triglycerides. The melting point of the pure wax is 75 80°C. >It contains esters of fatty acids (26 to 30 carbon atoms) and long chain alcohols (C26 to C30) and a large amount of unsaponifiable matter (55 67%). I believe you can find interesting informations regarding the Flax Wax. Here I simply remember that, after the Fire of 1532, we have had the different areas (of temperature). I believed that flax wax was a difficult to discover not only because there is the low percentage (or near nothing, after the centuries…) of that material. But Rogers indicated us a simple way to detect the diffrences using colors for food … So… Try to do a few little experiments with food coloring and different kinds of linen cloth (including old primitive linen). Flax wax is hydrophobic. — — A natural linen is coated with residual pectins, hemicelluloses, and flax wax. Rogers indicated us that plasma oxidized and removed them all. It would oxidize and remove some of any coating… So … What happens on linen threads treated with Corona Discharge or … with vacuum UV excimer laser ? — — **** — — Here another kind of analysis = the polarized ATR FTIR… Although I am “a big fanatic of AFM techniques”, today I have found an interesting document on ATR FTIR by P. Garside: “Characterization of Textile Fibers Using the Perkin Elmer Spectrum 100 with Universal ATR Polarization Accessory” Link: http://www.perkinelmer.com/CMS Resources/Images/44 74295 APP Textile Fibersby IR.pdf >Conventional methods such as microscopy and spectroscopy can be used to investigate the morphology and chemistry of a sample, but reveal little about its microstructure. >Combining infrared spectroscopy with a polarizer allows both the nature and orientation of chemical bonds within the sample to be explored, thus yielding vital microstructural information. … … Method >Infrared spectra of fiber samples were collected with a Perkin Elmer® Spectrum™ 100 FT IR spectrometer, fitted with a UATR Polarization Accessory; spectra were recorded over the range 4000 625 cm 1, with a resolution of 4 cm 1 and 32 accumulations. … etc. … etc. … — — — — — — — — — Bibliographic References: 1. P. Garside & P. Wyeth; Studies in Conservation; 51(3); 205; 2006. 2. P. Garside & P. Wyeth; Applied Spectroscopy; 61(5); 523; 2007. 3. P. Garside, S. Lahlil & P. Wyeth; Applied Spectroscopy; 59(10); 1242; 2005. 4. S. Greiff, et al.; Scientific Analysis of Ancient and Historic Textiles (R. Janaway & P. Wyeth, eds); 38; Archetype Publications; 2005. And see also: “Polarised ATR FTIR Characterisation of Cellulosic Fibres in Relation to Historic Artifacts” by Paul Garside and Paul Wyeth Link: http://eprints.soton.ac.uk/15328/3/rest paper.pdf * * * * * * * * * * * * * * * * * * * * * * * * Here an (italian) excerpt from myself: >Dalla lettura del libro risulta che Fanti e i suoi amici professori universitari non hanno usato questo tipo di controlli (cioè quelli dello studio di Garside e Wyeth, della Univ. Di Southampton, UK) quando hanno lavorato con la spettroscopia ATR FTIR. >Per quanto riguarda l’uso di quella Polarised ATR FTIR characterisation of cellulosic fibres, le informazioni fornite circa l’angolo di avvolgimento microfibrillare del lino e la sua direzionalità non dovrebbero avere delle serie connessioni con la questione dei trattamenti CD o VUV, in quanto questi trattamenti non dovrebbero influire in modo decisivo su quei parametri strutturali (ma, certamente, ne variano altri, vedere i cambiamenti della superficie, ecc. ) … >Resta comunque aperta la questione dei controlli meccanici (o nanomeccanici…) su fibrille di lino trattate con CD e VUV… link: http://www.queryonline.it/2013/04/16/datazioni alternative della sindone la controreplica di gian marco rinaldi/comment page 1/ Rough translation: > From reading the book that Fanti and his friends academics have not used this type of controls (ie those of the study of Garside and Wyeth, the Univ. Of Southampton, UK) when they worked with ATR FTIR spectroscopy. > As for the use of the ATR FTIR Polarised Characterisation of cellulosic fibers, the information provided about the winding angle microfibrillar flax and its directionality should not have serious connections with the issue of the treatments CD or VUV, in as these treatments should not have a decisive influence on those structural parameters (but, certainly, they vary more, see the changes of the surface, etc.) … > It remains open the question of mechanical controls (or nanomechanical …) on the linen fibers treated with CD and VUV ….","date":"2015-03-09","mins":"10:19 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192938","author":"piero","post":"Is flax wax soluble in of oil of turpentine? Yes, I think it is soluble. But I have not yet found an useful reference on the Web! … … and you ? What is your idea on that argument? I think it’s possible to run refined microscopic controls….","date":"2015-03-09","mins":"10:59 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192944","author":"piero","post":"Errata corrige: >Is flax wax soluble in of oil of turpentine? Instead of: >Is flax wax soluble in of oil of turpentine?.","date":"2015-03-09","mins":"11:16 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192946","author":"piero","post":"Sorry. .. Here an exact errata corrige: >Is “flax wax” soluble in oil of turpentine?.","date":"2015-03-09","mins":"11:17 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193045","author":"piero","post":"I hope you have understood (despite my many errors) what I wrote in my message. So, I beg your pardon about my many mistakes. First of all: the word “terpene” is located at the end of second line (and not “at the end of third line”, as I wrongly wrote) Second correction: >I believed that flax wax was a difficult thing to discover… Instead of: >I believed that flax wax was a difficult to discover… … And as rightly pointed the finger Hugh (in his first message), in the second part of my message I felt into the pitfall: “opportunities for further research” … Instead of discuss the Vanillin test by Roger (= Vanillin loss from Lignin), the Blue Quad Mosaic, the Kodak Panchromatic Separation Film 2238 [and inherent Spectral Sensitivity (at 370 480 nm = positive values. First small negative peak at 500 520 nm, with a second negative peak at at 560 570 nm), Green VVR99 Filter different with respect Blue and Red (= Gamma versus development time)], etc. But we have to recognize that Polarized ATR spectroscopy is a powerful tool which allows subtle microstructural features of a sample to be investigated. Problematic materials can be accurately characterized, and correlations can be drawn between changes in ordering at the molecular level. — Vanillin test (or Wiesner test). — I had some doubt about the “Vanillin test” because fungal attacks destroy Lignin, etc. And then the method has the limits if applied to the entire cloth. Here my past opinion: the main way was still the use of AFM, CFM, SNOM = the non destructive controls. — — — The old idea of the NMR, by Giulio Fanti and Ulf Winler was not showed in a clear manner. Have you read the paper by Joseph Virlet (Villa Gualino. 2000) ? He wrote speaking about the intervention by Fanti and Winkler : >This paper, whose intention is laudable, cannot be used as a reference paper. — — — Another thing: I don’t know which kind of lignin biotransformation or what substantial demethoxylation and dehydroxylation of lignin will be possible to see under : natrococcus, natronobacterium, nocardiopsys and synechocystis, etc. (as it was the situation of the TS, for centuries). These microbeings are found by prof. Garza Valdes and Stephen Mattingly… Here another bibliographic reference : Kirk, T.K., Farrell, R.L., (1987). «Enzymatic “combustion” : the microbial degradation of lignin». Ann. Rev. Microbiol. 41: 465 505. Have you read this work ? ——————————————— I remember that Berger wrote : >Rien ne prouve, en effet, que plusieurs espèces chimiques n´interviennent pas dans le processus de dégradation de la lignine, bien au contraire (cf. Test de Wiesner). I believe as interesting remark that I also have read some papers on Wiesner test. Have you tried to understand the matter ? I believed in myself (the simple idea to control the linen fibrils with the SPM microscopy, to develop in a good manner with the pertinent experiments) and I saw too chaos in these “lateral” interesting researches. In my opinion Berger exhibited a partial chemical knowledge when he wrote : >il s’agit bien la d’une méthode totalement nouvelle. >L’auteur ne cite aucune référence antérieure et aucun laboratoire de datation au monde ne propose une telle méthode. Because he don’t know the (possible) use of the Vanillin test in analyses about old books… ————— Have you the entire paper quoted by Berger ? Here the title : O 4 Linked coniferyl and sinapyl aldehydes in lignifying cell walls are the main targets of the Wiesner (phloroglucinol H Cl) reaction. By Pomar F, Merino F, Barcelo AR. (Department of Plant Biology, University of La Coruna, La Coruna). The nature and specificity of the Wiesner test (phloroglucinol H Cl reagent) for the aromatic aldehyde fraction contained in lignins was studied. Phloroglucinol reacted in ethanol hydrochloric acid with coniferyl aldehyde, sinapyl aldehyde, vanillin, and syringaldehyde to yield either pink pigments (in the case of hydroxycinnamyl aldehydes) or red brown pigments (in the case of hydroxybenzaldehydes)… Here an old remark that I have found in my own archive = “Till now I have no exact colorimetric data to do a comparison !” — — I remember to know that Van Haelst together with Dr. M. Cl. Van Oosterwijck did claimed they did some experiments and (if I am right in my memory) R. Van Haelst did proposed the temperature of 180 °C. Later Mario Moroni made about the same experiments. He measured ~180 °C for the place were the samples were taken. And (of course) this is in contradiction with the 25 °C proposed by Rogers. Following Rogers, the low thermal conductivity of linen excluded such a high temperature. But Ray Rogers was unaware of the experiments of Moroni… and then this researcher (Rogers) did not continued further in thermochemical textile research because he died in 2005 … Do you know other details? Under the address : https://shroudofturinwithoutallthehype.wordpress.com/page/5/ there was a long commentary … But without mentioning the question of Vanillin in old books… See for example: That “Old Book Smell” Is a Mix of Grass and Vanilla Smell is chemistry, and the chemistry of old books gives your cherished tomes their scent by Colin Schultz = smithsonian.com (June 18, 2013) Link: http://www.smithsonianmag.com/smart news/that old book smell is a mix of grass and vanilla 710038/?no ist >Smell is chemistry, and the chemistry of old books gives your cherished tomes their scent. As a book ages, the chemical compounds used—the glue, the paper, the ink–begin to break down. And, as they do, they release volatile compounds—the source of the smell. >A common smell of old books, says the International League for Antiquarian Booksellers, is a hint of vanilla: “Lignin, which is present in all wood based paper, is closely related to vanillin. >As it breaks down, the lignin grants old books that faint vanilla scent.” … etc. … etc. … Here other links: http://www.compoundchem.com/2014/06/01/newoldbooksmell/ >…A study in 2009 looked into the smell of old books, finding that the complex scent was a mix of “hundreds of so called volatile organic compounds (VO Cs) released into the air from the paper,” says the Telegraph. … http://thescienceoffiction.net/tag/the wonder of books/ >… In total, there are hundreds of VO Cs that can contribute to the overall scent of the book in question. However, there are several chemicals that can be both named and attributed to certain fragrances. One you might recognize is vanillin — the same chemical found in artificial vanilla. As you can guess, this contributes to the “hint of vanilla” mentioned by Strlič. A less familiar name (unless you took organic chemistry, or enjoy looking up chemical compounds) is 2 ethyl hexanol. This chemical offers a gentle floral scent. Http://en.wikipedia.org/wiki/Radiocarbon 14 dating of the Shroud of Turin >…(Rogers) stated that: “The fact that vanillin cannot be detected in the lignin on shroud fibers, Dead Sea scrolls linen, and other very old linens indicate that the shroud is quite old. A determination of the kinetics of vanillin loss suggest the shroud is between 1300 and 3000 years old. Even allowing for errors in the measurements and assumptions about storage conditions, the cloth is unlikely to be as young as 840 years”.[ = Raymond N. Rogers, 2004, Studies on the radiocarbon sample from the shroud of turin, TCA paper] >Rogers concluded from this that the Shroud is much older than the earlier purported estimates… https://shroudofturinwithoutallthehype.wordpress.com/page/5/ >… However, there is another pitfall lurking here if Rogers thought that vanillin was a volatile material, going by the aroma from old wood. That could conceal a major source of error if his sleeping partner, Dr. S.T.Kosiewicz of the title, was not aware of it. … etc. … etc. … >… while the nose can readily detect vanillin at exceedingly low concentrations in air, it’s in fact a white solid with a quite high melting point (82 degrees C). So when Kosiewicz measured remaining “vanillin” (read coniferaldehyde) at 70 degrees C, he would have been measuring some of the vanillin end product that had failed to vaporise, still being a solid with low surface area. But when he raised the temperature to 100 degrees, the vanillin would then be liquid, with a larger surface area, larger vapour pressure, and been able to escape more easily causing less interference in the measurement of remaining “lignin”. You see, the exponential nature of the reaction rate means that any small errors at the higher temperatures is likely to translate into major errors in estimating the tiny rates of decay under normal environmental temperature. >There’s an “if” here, namely that Kosiewicz was measuring lignin by disappearance, using the Wiesner test, rather than some more specific test. But we are not told how he did his chemistry. Thus the title (and chief complaint) of this posting. Since when has it been accepted practice to sub contract vital research to one’s chums, possibly/probably unqualified in the topic of interest, whose data is withheld from publication? So… I do not believe in this type of analysis, however, I also thought of SNOM controls for Wiesner test … See also my post: December 31, 2013 at 9:56 am (Argument to debate = Revisiting Giulio Fanti’s Dating Methods) link: https://shroudstory.com/2013/12/07/revisiting fantis dating methods/ >Vanillin test (= Wiesner test) in itself is not the true solution … The new nondestructive dating technique (that I indicated in 1998) is based on SP Ms (= Scanning Probe Microscopies = AFM, CFM and SNOM ) … — — What is your opinion ? * * * * * * * * Now I wonder to what extent it would be reliable the control of Vanillin (= Wiesner test) after the material of the cloth was sumitted to an indirect treatment (= the one who released thymol)….","date":"2015-03-10","mins":"8:49 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193127","author":"piero","post":"MPH, You was scathing about Hugh (and the Cotton/Linen fact)… But you have forgotten the past criticism by G. M. Rinaldi regarding the exact statistical question (and a different point of view with respect that of Eng. Brunati, a deceased italian researcher, who [years ago] indicated the same number, your clamorous 1,04% )… Obviously this don’t change the fact that we are dealing with a number below 5%. In other words : the tests must be repeated … with other samples, taking other material from the Shroud. Perhaps, proceeding in this manner we can easily destroy the entire sheet of Turin (!!!) due to the fact that we are often persisted in long discussions about a glass of water or similar things… and therefore the time to be able to plan the work is lost. In order to avoid (to prevent) this nefarious (heinous) perspective we can try to do some interesting non destructive analyses as underlined by prof. Barberis, the director of CIS in Turin… But I am preaching that way since 1998, unfortunately my simple claims […and not “mantra”, as wrote Louis several days ago. See also the “mantra intoning” concept by Colin Berry, January 20, 2015] about the use of SPM [= AFM, CFM and SNOM] are often disregarded. In the paper: “Perspectives for the Future Study of the Shroud”, Valencia 2012, Barberis indicated [at p. 2] the use of AFM, yes… But, in my opinion, this SPM technique is not a “new technology” as he wrote because (since years) there are several papers at disposal [and often you can read what I write taking some (right or wrong) examples from the Web…]. I also understand that several years ago AFM controls on linen (with SSNDT as witnesses) were not famous (Dallas, 2005) probbly because I was not an engineer and I had not a Nano Lab at disposal … Instead after 14 years (= 2012) there was a very little revival for AFM. Strangely prof. Barberis disregarded the useful ATR FTIR, remind the paper by P. Garside [a Research Fellow in Conservation Science, Textile Conservation Centre, Univ. Of Southampton, UK. B.T.W: He also quoted two FTIR papers by J. M. Cardamone (a researcher known to the “Shroudies”), read the Bibliography of the paper related to the Historic Artifacts published in 2001… Not the Perkin Elmer paper, 2011] about a particular version of that technique. Instead he sketched a particular perspective about the “poker holes”. He indicated the following techniques : UV Vis, IR, Raman, TOF SIMS … as useful methodologies to verify the hypothesis that the origin of that famous “L” is not due to combustion, disregarding the AFM and CFM (= Chemical Force Microscopy). And I say these words taking apart the fact that, after the restoring of the year 2002, the inherent area changed (= it became a big hole instead of a little one) if I am right in my remark… After having indicated the idea of these controls on the reminds of the past “L” (= what was the area near the “poker holes”), he suggested the use of mass spectrometry on water marks in order to compare the results with other sites without waterstains. I presume he wanted to indicate the TOF SIMS controls that (unfortunately) aren’t “non destructive controls”… In any case : do you remember the strange question of gamma irradiated samples (that I indicated few days ago) and the interesting changes in water adsorption? Well… this case is near similar our problem (to solve without destructions) … See also: the possible exact interpretation about the inherent “chromatographies” on linen! The AFM techniques can also be useful in the case of the tests “on the Holland cloth and on the patches removed in 2002”. But Barberis indicated only (and vaguely) “spectroscopic tests”… So … What was the meaning of this particular “smoke on our eyes” of the year 2012? How is possible to show a very good project of SPM (Scanning Probe Microscopy) line system on linen without any previous true help from the Laboratories? … — — — — — We have seen the past photographies about the Arizona’s sample = Report on the STERA, Inc. – University of Arizona Radiocarbon Dating Laboratory Macro Photography – 30 August 2012 link: http://www.shroud.com/pdfs/arizona.pdf and the observations by Pam Moon and Donna Campbell (“The black thread”) link: http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Three threads files/Arizona%20for%20website.pdf But all these things are insufficient to emit a verdict. So, in my opinion, we have to test this sample under SPM analyses. Is it possible to contact Dr. Timothy Jull in order to obtain that control or few (very little) linen samples to submit to the SPM tests? If the photographies about the Arizona’s sample were non destructive controls, then the same can happen with tests under AFM techniques… But the advanced analyses on the sample of Arizona may not be sufficient to establish the truth regarding the whole cloth of the Shroud! So we have to do the comparisons with the other linen samples already taken from the Holy Shroud of Turin. … And this is the final sentence of my “analytical sermon”. L.","date":"2015-03-11","mins":"9:59 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193129","author":"piero","post":"Here a topic which I thought was interesting: Remote Control & Visualization of Scanning Probe Microscopes via Web by Junyi Sun Anshuman Razdan Link: http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.129.2903&rep=rep1&type=pdf I have read that students and non experienced can use the IN VSEE to control a microscope without any training. The claim was that this interface will in future provide different levels of functionality based on users proficiency in controlling the microscope…. The term “state of the art” refers to the highest level of general development, as of a device, technique, or scientific field achieved at a particular time. So… What is the “state of the art” of remote control SPM ? * * * * * * * * * * * * * * * * * Here a concrete and useful example about the reality : “Imaginenano 2015” Venue:Bilbao, Spain Date:10 – 13 March 2015 It is a fair in Bilbao (Spain) that hosts the 3rd edition of the largest European Event in Nanoscience & Nanotechnology, Imagine Nano, from the 10th until the 13th of March 2015 … at Bilbao Exhibition Centre (BEC). Link: http://www.imaginenano.com/SCIENCE/Scienceconferences PPM2015.php?p=program Is it possible to test the capability of remote operation of the SPM via the Web using a technical fair? Is it easy to show an example of chemical fingerprinting on linen fibrils? In any case “Imaginenano 2015” does not seem to be a conference that is addressed in the particular field of the textile topics … or in archaeo textile field … — — So… I have found another address: the 62nd JSAP Spring Meeting 2015 Link: http://meeting.jsap.or.jp/file/category timetable en.pdf But even that does not seem to be a conference that is centered on our own textile field ….","date":"2015-03-11","mins":"10:52 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193203","author":"piero","post":"In my idea your previous interesting discussions were a bit far from the field of careful Textile Analyses. Although I had some doubt, the question of Cotton presence into the fibres of linen samples taken from the Shroud is not trivial. In other words : we have to show what kind of blend was produced and then we have not only to find the exact percentage of Cotton versus Linen that was produced but the geometrical distribution of Cotton (along the threads). And this doesn’t seem a very difficult problem to solve. Do you agree with me? A more difficult question to solve is the true identification for the origin (of that presence or subsequent contamination). When can we read only some rough words about “actual threads ” and “cotton fibres twisted among them, in varying proportion” we cannot solve our problem because we don’t know if the distribution was at random or periodical… So… What we require it’s an useful and careful drawing or particular photographs (or both) that can describe the difference Cotton versus Linen (and/or viceversa) and their exact positions, one with respect to other (and the first idea that came into my mind was the use of PLM… But this work has to be obtained from adequate samples, not mechanically damaged, etc.). Probably, using that description, we can draw interesting conclusions from: drawings, photographs or maps. Was Raes able to do that? Here my rough opinion: I don’t believe. I am curious to read your answers about the idea to investigate the issue with an adequate research tool. At the end of this message you can read a very short bibliography and after the inherent readings you can draw your own conclusion about the possibility to identificate the textile materials (Linen and Cotton) in blends. The investigative works “were forbidden” in the case of the past rough C14 test (for obvious reasons = the material coming from the Shroud was easily recognizable in comparison with the other samples!). – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – Only a rigorous work (if it is possible to do what I have indicated here, in a vague manner) can show the truth. Obviously vain discussions cannot produce the useful answer. But some exchange of words (perhaps I am more inclined to enter into the boring “problem solving approach”…) is always interesting. – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – Here a Short Bibliography: – M. Sohn, D. S. Himmelsbach, D. E. Akin, and F. E. Barton II, “Fourier transform near infrared spectroscopy for determining linen content in linen/cotton blend products” Textile Research Journal, vol. 75, no. 8, pp. 583–590, 2005 – D. D. Mc Alister III, J. A. Foulk, D. E. Akin, and P. A. Annis, “Cotton fibres: proportion and interaction with flax fibres in blends: focus on rotor spun yarn” in Proceedings of the 26th International Cotton Conference, pp. 207–211, Faserinstitut Bremen, Bremen, Germany, 2002. – ISRN Textiles Volume 2013 (2013), Article ID 649407, 4 pages link: http://dx.doi.org/10.1155/2013/649407 “Near Infrared Spectroscopy for Anticounterfeiting Innovative Fibers” by Jing Cao and Suraj Sharma ********************************************* Then the question to answer can be the following: FT IR, FT NIR or PLM for determining linen content in blends ? ——————— Here another way: >Cotton and linen content measurement meet in textile industry standard FZ/T30003 2000 cotton blended products of microscopic projection method and quantitative analysis method >Conform to the inspection standard of SN/T0756 1999 import and export of linen/cotton blended products quantitative analysis method, the microscopic projection method >Standard: FZ/T30003 2000\\FZ/T32004 1996\\SN/T 0756 1999 Link: http://cici0806.en.hisupplier.com/product 1024100 Fiber Fineness Composition Analysis system Instrument.html ——————————— These avenues of research do not seem dareo great information on the type of distribution of cotton in the mix … What we need is some kind of QR code. See: Quick respone and Denso Wave code … = http://www.qrcode.com/en/history/ In 2012, the QR Code won a prize in the Media for Industry category of the Good Design Award (established in Japan to comprehensively promote industrial design) See alo the first “cryptanalist” and the analysis of frequewncy … Link: http://en.wikipedia.org/wiki/Al Kindi.","date":"2015-03-12","mins":"9:13 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193204","author":"piero","post":"Errata corrige: >See also the first “cryptanalist” and the analysis of frequence … Instead of: >See alo the first “cryptanalist” and the analysis of frequewncy … ********************** http://www.islamwithreason.com/al kindi applied mathematics/ >… Al Kindi was a great mathematician and is knows today in the modern world as “father of Islamic or Arabic philosophy”. He was so advanced in mathematics that his mathematical and medical expertise, he was able to develop a scale that would allow doctors to quantify the potency of their medication. While performing a textual analysis of the Holy Quran, he found out that Arabic has a characteristic letter frequency. This discovery made has allowed him to develop what we called today as Frequency Analysis ….","date":"2015-03-12","mins":"9:17 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193206","author":"piero","post":"Ciphers based on one to one substitutions, also known as monoalphabetic ciphers, can be easily broken by frequency analysis. The method was proposed by the 9th century polymath from Baghdad, al Kindi (800 873 AD), often called the philosopher of the Arabs. But I believe that MPH has some interesting story about Jules Verne and William Legrand (1843, by Edgar Allan Poe…)..","date":"2015-03-12","mins":"9:19 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193207","author":"piero","post":".. That is, we can see the distribution of cotton as a cryptogram to be deciphered as in the story: The gold bug, by Poe … Link: http://en.wikipedia.org/wiki/The Gold Bug So… What is the decoded message (made with Cotton) with spaces, punctuation, and capitalization ?.","date":"2015-03-12","mins":"9:23 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-79360","author":"piero","post":"I strongly advise you to accept my past words about the AFM controls on irradiated linen fibrils (…. With SSNDT [exposed in parallel] as witness materials in order to publish an interesting study) … Prof. Alberto Carpinteri is the Editor in Chief of Meccanica and he is an expert in Building Science. B.T.W. : Do you remember my indications about Structural Mechanics and AFM three point bending test ? Well … I think that prof. Carpinteri (= an expert in the field of Structural Mechanics !) will be happy to receive the adequate answer … because linen fibrils can be properly evaluated by qualified experts using AFM techniques, etc. (see also : Raman analysis techniques)..","date":"2014-02-14","mins":"10:59 am","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake"},{"id":"comment-79003","author":"piero","post":"Yesterday I have sent the following words : >We have to use the AFM instrument in order to see what is the truth about the linen fibrils (= irradiated or not). >We are able to work in the field of astromineralogy but we are not yet able to work on linen fibrils ! This seems to be a strange fact ! — — — — But I have not seen my message ! Then, today I try again … B.T.W. : In this blog I wrote in November 20, 2012 ( https://shroudstory.com/2012/11/02/an image formed by the yellowing of lignon/ ) : > … …we have to see what are the exact references. I have read something of interest 12 years ago (= SSNDT and the inherent AFM controls, etc.) and also I have tried to write my opinion, but the paper (prepared for … … the Dallas Conference) was rejected … — — See for example the following reference : Measurement of bulk etch rate of LR115 detector with atomic force microscopy Ho, Yip, Koo, Nikezic, Yu Journal Radiation Measurements, Vol 35 (6) – Dec 1, 2002 — — P. S. When I indicated the astromineralogy I referred to MIDAS (Micro Imaging Dust Analysis System) the instrument used to explore the Comet Churyumov–Gerasimenko (officially designated 67 P/Churyumov–Gerasimenko). See also under : http://www.lunartech.org/research/rosetta and midas/ >The principle of an AFM is something like that of a record player, in which a sharp needle is moved over the surface and its deflection recorded to reconstruct the three dimensional shape of the object. >MIDAS can operate in such a mode, but the dust particles are expected to be rather fragile and could be broken or distorted by the tip. >To avoid this, many AF Ms including MIDAS have a dynamic mode, in which the cantilever (the springboard like structure on which the tip is mounted) is oscillated. When very close to the sample, the tip “feels” the sample even without touching it, due to various forces acting between the two (electrostatic, magnetic etc.). This changes the resonance frequency of the vibrating cantilever, which is detected by the electronics and used to detect the surface. — — So … I hope you want to discuss the AFM detection of irradiation in a more exact manner ….","date":"2014-02-13","mins":"9:49 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79009","author":"piero","post":"Remember the meaning about the acronym : SSNDT = solid state nuclear track detector ! So … Have you understood my idea about what kind of investigation we have to do using the AFM ? This is an old idea. Unfortunately my old paper (for Dallas Conference) was rejected. — — Here I want to add the beginning of a study (found surfing the Web) : >The interactions between energetic ions and biological and/or organic target materials have recently attracted theoretical and experimental attention, due to their implications for detector and device technologies … Then … I believe that Shroud Science have to improve the serious investigations (… and see also : the need of preliminar experiments on adequate linen materials) on linen fibrils (etc.) using the right tools … What is your comment ?.","date":"2014-02-13","mins":"10:16 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79006","author":"piero","post":"In order to discuss in a serious manner the argument I want to add other lines : I have not yet found the color differences (= delta E) about the blood clots submitted to nuclear radiations (… and where are the inherent experiments with neutrons or the studies ?). But this cannot be used as strong argument because I admit that a miracle (perhaps) is few understandable with our feeble minds … We can only work on linen fibrils trying to see where are the proofs about the (claimed) ancient irradiations … Working in this direction we have to take into account the fungal and bacterial attacks that can create the confusion. In other words : we have to choose the right areas to investigate !.","date":"2014-02-13","mins":"9:59 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-196918","author":"piero","post":"Charles, First of all : I want to underline that I am not happy to work only with material taken in 1988 (from that particular angle of the Shroud) = “the remaining samples”… There are other linen fibrils that can be tested (already taken from the Shroud in the past. For example : read what wrote Dr. P.L. Baima Bollone, who is a great expert) … — — But, here the key point that I want to emphasize : In any case, before to destroy forever the precious material, the linen fibrils can be tested using SPM techniques. >An Atomic Force Microscope (AFM) scans the surface of a specimen with a very sharp tip mounted to a cantilever, the deflections of which are directly related to the surface nanoscale topography and various other physical properties. >AFM has hence a unique ability to analyze and correlate structure and properties of samples ranging from molecules to complex biological systems in their native environments. >Since its inception in the 1980s, AFM has grown to become a key technique for high resolution structural analysis of areas as diverse as biology and material sciences See also: High resolution and high speed AFM with simultaneous advanced optical microscopy. — — Do you want to learn about new developments of fast AFM imaging? Check under the following link: http://www.materialstoday.com/biomaterials/webinars/advances in high res and high speed afm/.","date":"2015-04-20","mins":"8:37 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-51465","author":"piero","post":"I don’t agree about the enthusiasm around a new round of carbon dating. (B.T.W. : … from where we can take the linen sample ? Where is the right place ?). — — I don’t think that’s great because this is a destructive test. I have a different perspective, as you have read what I wrote in the past (March 26, 2013) on this blog (argument treated = New Italian Book: The Mystery of the Shroud by Giulio Fanti and Saverio Gaeta) : >The AFM and the Raman analyses can show the truth. >There are the highest performance AFM Raman systems… The time is ripe. We have to see what happens under the SPM controls. The Micro nanomechanical Properties Analysis is another very interesting point. If I am right, in the past, I wrote something about the application of the well known method : the AFM three point bending test on linen fibrils … — — Also the Nanoscale Chemical Imaging is very interesting. But, here, is uselss to list (enthusiastically) all the possible SPM analyses … — — — … the isolated knowledge obtained by a group of specialists in a narrow field has in itself no value whatsoever, but only in its synthesis with all the rest of knowledge … (Erwin Schrodinger, quoted by Jeff Liss) Yes. This is the right way. There is the Probability Calculus to take into account. The Shroud and the ancient coins (f.e. The solidus by Justinian, see under : http://greatshroudofturinfaq.com/History/Greek Byzantine/Pre 944 AD/Vignon/justinian I Icoin692.html ) are older than the invention of probability calculus … Do you agree ?.","date":"2013-11-15","mins":"11:49 am","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"id":"comment-74237","author":"piero","post":"Hugh Farey wrote : “… let alone discuss, that that the area around the burn holes is exactly the same colour. It is a major argument against Morgan’s hypothesis that difference in colour represents difference in chemical composition, but he doesn’t even notice it. …” Well … Where is the new study ? Where is the “Multivariate analysis of spectroscopic data” ? Sorry. I wrote that because I have read the Abstract of the study : “Application of chemometric analysis to UV visible and diffuse near infrared reflectance spectra.” by Christopher Brent Davis Abstract : >Multivariate analysis of spectroscopic data has become more common place in analytical investigations due to several factors, including diode array spectrometers, computer assisted data acquisition systems, and chemometric modeling software. Chemometric regression modeling as well as classification studies were conducted on spectral data obtained with chili peppers and fabrics samples. Multivariate regression models known as partial least squares (PLS 1) were developed from the spectral data of alcoholic extracts of Habanero peppers. The developed regression models were used to predict the total capsaicinoids concentration of a set of unknown samples. The ability of the regression models to correctly predict the total capsaicinoids concentration of unknown samples was evaluated in terms of the root mean square error or prediction (RMSEP). The prediction ability of the models produced was found to be robust and stable over time and in the face of instrumental modifications. A near infrared spectral database was developed from over 800 textile samples. Principal components analysis (PCA) was performed on the diffuse near infrared reflectance spectra from these commercially available textiles. The PCA models were combined together into a soft independent modeling of class analogy (SIMCA) in order to classify the samples according to fiber type. The samples in the study had no pretreatments. The discriminating power of these models was tested by creating validation sets within a given fiber type as well as attempting to classify samples into a category that they do not belong to. The apparent sub class groupings within the same fiber class were investigated as to whether or not they were caused by chemical processing residues, multipurpose finishes, or dyes — — — I hope in other kind of analyses (see, for example, the investigations using the Chemical Force Microscopy) in order to clarify the question … So … What is your answer about the CFM way in comparison with the other ways ?.","date":"2014-01-23","mins":"9:58 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","title":"Comment Promoted: Are the Quad Mosaics Meaningless?"},{"id":"comment-74392","author":"piero","post":"The first questions to discuss after the proper SPM analyses seems to be the comparison with the exact detection of contaminations and then there is to take into account the question of fungal and bacterial contamination … See, for example, the recent papers by Pam Moon … — — — But, “to begin at the beginning” : … my intervention (in 1998) was temporarily inserted in the field of “Conservation” (because I indicated the ancient plies as interesting areas to control). But soon I agreed to change this field of studies with another, and then the programmed intervention was integrated in the group by Dr. Scannerini (moderator) : “Trace Biology sessions”. The use of SPM investigation permits (in my idea) to underline what is the degree of mechanical aging and offers some useful indication about the cellulosic DP, etc. In any case the interesting argument of ancient fold marks on the Shroud was firstly investigated by Dr. John Jackson, who identified ancient fold marks, individually distinguishable as a ridge or valley type and several interesting areas (listed/catalogued starting from the letter A until to G) have been indicated by Ian Wilson in her own book : “The blood and the Shroud”. I don’t understand why the informations obtained using the Raman analyses (by Renishaw, 2002) were not recollected in the case of the 14 C area … Perhaps the reason is the following : because the first attempt failed (in order to understand what happened, with this kind of Raman controls, read the paragraph of Raman controls in the interesting book by prof. Giulio Fanti and Saverio Gaeta published in 2013) and after that fact, this interesting way (to improve the level of knowledges) was simply abandoned … — — But, before to continue (… for example, see also : the comparisons for the SPM controls with respect the ATR FTIR controls) … I want to ask : What is your remark about this point (= the lack of Raman analyses on radiocarbon area and neighbourhood … ) ?.","date":"2014-01-24","mins":"10:57 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","title":"Comment Promoted: Are the Quad Mosaics Meaningless?"},{"id":"comment-38104","author":"piero","post":"In 1998 (in Turin) I indicated the idea to obtain an evaluation about the cellulosic DP (= degree of polym.) through the use of the SPM techniques = AFM, CFM and SNOM. The aim of that idea (= the advanced control) was to detect the true age of the ancient linen fibrils. Previously Marinelli and Diana indicated the same argument, but the applied viscosimetry (see also the study [1996] by Scicolone, Seves, Testa and others :: http://giovannascicolone.com/pdf/art 10.pdf ) is not useful in the case of the material coming from the Holy Shroud (… or from the repairs … !). So … There is the possibility to check also the cotton fibril in order to understand what is the epoch of that cotton. Now, after 15 years (!), I presume …. This is not only science fiction… Am I wrong ? … or … too fanciful ? Well. Where are the skilled scientists ? In my idea the nanotechnology research in the textile area (see also f. E. : the AFM three point bending test, etc.) can solve the problem for both textile fibrils (linen and cotton). — — — In my opinion also the presumed starch (= wheat starch, following Rogers and Mc Crone … See also the different behavior of the hanks) can be detected in a good manner using the new advanced tools. Do you know the linen sized with starch, to protect the yarn from abrasion and keep hairyness to a minimum ? — — The use of starch as a stiffener and adhesive on textiles has been known from time immemorial. B.T.W. : (in my idea) there is another problem to solve : What is the right way to detect the epoch for the starch that (perhaps) will be detected on linen fibrils ? — — — Why “science is no longer working in the case of the TS” ? This is the unsolved Enigma to turn in a feasible solution using the proper investigations … After the lunar landing, the textile landing (with the proper gloves) !.","date":"2013-06-26","mins":"11:58 am","url":"https://shroudstory.com/2013/06/25/cotton/","cat":"carbon_14_dating","title":"Cotton"},{"id":"comment-209882","author":"piero","post":"Here what I can write in reference to the words (by daveb of wellington nz): “…One might also see it in the lack of adequate consultation in the 2002 so called restoration, with the consequential loss of material information, a result that appears to many to have been caused by incompetent ignorance. …” At the beginning (year = 1998) I was thinking of being able to insert my report (of 1998) on the use of advanced microscopies (= SP Ms) in the field dedicated to the “Preservation of the Shroud” (= “Conservation Sessions”. Moderator: Prof. M. Flury Lemberg …). Then, later on, my speech (“La qualità del microcontrollo tessile della Santa Sindone” = Quality of textile microcontrols for the Holy Shroud) was entered in the field moderated by Prof. Scannerini (= “Trace Biology Sessions”), June 6, 1998. Anyway, we can also try to consider what Prof. William Meacham wrote in the book: “The Rape of the Turin Shroud: How Christianity’s most precious relic was wrongly condemned, and violated” (= That book describes the two major fiascos to have afflicted the Turin Shroud in recent years: the C 14 dating of 1988 and the so called “restoration” of 2002…)….","date":"2015-09-08","mins":"8:18 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209817","author":"piero","post":"Hugh Farey wrote: “…we find that if the temperature was 140°C it would have taken 2 minutes. This means that if the Shroud were ever in a box which became heated to extent that silver melted, there would be no vanillin present, regardless of how recently it had been made. …” I agree with “O.K.” about the question… I would know the “true truth” (= the entire truth) regarding the following particular claim by “O.K.” >”…Anyway, Rogers claims that Raes threads (about 10 cm from burnhole) gave positive for vanillin, contrary to all other areas of the Shroud.” What is the meaning for that? In fact, one can simply think the Raes threads (…and presumably, the entire corner= 14 C area) as new materials added to the ancient cloth… We could try to study a real thermal map of the linen cloth (in order to improve the knowledges connected to the problem of “Vanillin loss from Lignin”), namely (here I try to explain better): the precise mapping of the temperatures reached by the sheet during the fire of Chambery. I do not think that this work was really done and I think this work can only be carried out in an adequate Lab (= Laboratory equipped for thermal tests of precision). — — — (Last week I was in Lourdes [France] and, unfortunately, I have not followed your interesting exchange of messages on that new paper by Marco Bella, Luigi Garlaschelli and Roberto Samperi …). — — — Regarding the solution of the problem about the right analyses (on both “interpolated” and ancient material) to use, you already know what was my idea (= SP Ms). I want to add that I have read something about another technique (= not in the field of SP Ms) called TIRF: >A total internal reflection fluorescence microscope (TIRFM) is a type of microscope with which a thin region of a specimen, usually less than 200 nm can be observed. … >… … … A TIRFM uses an evanescent wave to selectively illuminate and excite fluorophores in a restricted region of the specimen immediately adjacent to the glass water interface. >The evanescent wave is generated only when the incident light is totally internally reflected at the glass water interface. … … >The evanescent electromagnetic field decays exponentially from the interface, and thus penetrates to a depth of only approximately 100 nm into the sample medium. Thus the TIRFM enables a selective visualization of surface regions such as the basal plasma membrane (which are about 7.5 nm thick) of cells… Links: https://en.wikipedia.org/wiki/Total internal reflection fluorescence microscope http://www.ibiology.org/ibioeducation/taking courses/total internal reflection fluorescence tirf microscopy.html http://www.industrycortex.com/datasheets/profile/1582349/total internal reflection fluorescence tirf 204k http://www.tirf labs.com/Compare TIRF Geom.pdf.","date":"2015-09-07","mins":"10:08 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209823","author":"piero","post":"TIRFM Total internal reflection microscopy (TIRFM) is an optical technique used to observe single molecule fluorescence. Some biophysicists have used the technique for many years, while others are just beginning to explore the boundaries of this versatile mechanism for studying phenomena occurring at interfaces. … Link: http://www.olympusmicro.com/primer/techniques/fluorescence/tirf/olympusaptirf.html and, under another adress, I have read that: >The advantages of using TIRF include the ability to obtain high contrast images of fluorophores near the plasma membrane, very low background from the bulk of the cell, reduced cellular photodamage and rapid exposure times. … Obviously the depth of the evanescent field depends on the refractive index of the sample. But, first of all, you have to remember that: the critical angle c can be deduced from Snell’s law… Here another address (about TIRF): https://www.microscopyu.com/articles/fluorescence/tirf/tirfintro.html >… Although TIRFM is limited to imaging at the interface of two different media having suitable refractive indices, a great number of applications are ideally suited to the technique. … … For example, see also the following argument “to deepen): “Detergency mechanisms (…using Saponaria officinalis) and TIRF investigations”… So… In a possible experiment the evanescent field of the totally internal reflected laser excites the dye and the fluctuations of the emitted fluorescence is detected and autocorrelated. … Total internal reflection with fluorescence correlation spectroscopy (TIR FCS) is an emerging technique that allows one to study the reversible interaction between soluble and surface associated species. TIR FCS combines two established techniques: total internal reflection fluorescence microscopy (TIRFM) and fluorescence correlation spectroscopy (FCS). Perhaps TIR FCS can be used to study on off kinetics in our future experiments on linen samples… because: – TIR FCS has been used primarily to investigate the mobility of small fluorescent molecules close to surfaces. – Total internal reflection fluorescence correlation spectroscopy (TIR FCS) allows us to measure diffusion constants and the number of fluorescent molecules in a small area of an evanescent field generated on the objective of a microscope. Here a vague Attempt to write a Short Bibliography: – Axelrod D. Total internal reflection fluorescence microscopy. Methods Cell Biol. 1989; 30:245–270. – Axelrod, D. 2001. Total internal reflection fluorescence microscopy in cell biology. Traffic. 2:764–774. – Rigler, R., Ü. Mets, J. Widengren, and P. Kask. 1993. Fluorescence correlation spectroscopy with high count rate and low background: analysis of translational diffusion. Eur. Biophys. J. 22:169–175. – Tokunaga, M., K. Kitamura, K. Saito, A. H. Iwane, and T. Yanagida. 1997. Single molecule imaging of fluorophores and enzymatic reactions achieved by objective type total internal reflection fluorescence microscopy. Biochem. Biophys. Res. Commun. 235:47–53. – Thompson NL, Lagerholm BC. Total internal reflection fluorescence: applications in cellular biophysics. Curr Opin Biotechnol. 1997 Feb; 8(1):58–64..","date":"2015-09-07","mins":"11:00 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-210200","author":"piero","post":"Perhaps Garlaschelli & C. Did want indicate the tape’s adhesive contamination… Please, read the paper by Rogers (“Pyrolysis/Mass Spectrometry applied to the Shroud of Turin”): “All of the fibers were immersed in the tape’s adhesive, Joan …(Omitted name…) … laboriously cleaned an d prepared Shroud fibers for analyses at the MCMS. …” I don’t understand two things: – Why Bella, Garlaschelli and Samperi, indicated a peak at mass 96 instead of 97? For example : in the paper by Rogers (“Pyrolysis/Mass Spectrometry applied to the Shroud of Turin”) the Figure 2 (“Mass spectrum of the low temperature pyrolysis of fibers from Raes sample #3”) shows a peak at 97 – Why they wrote “…a pigment, alizarin…”? Alizarin was supposed to come from Robbia (see also : the lake with Aluminium)… Then Alizarin is a compound of coloring matter for linen and/or cotton. Links: https://en.wikipedia.org/wiki/Rose madder https://en.wikipedia.org/wiki/Lake pigment Rogers wrote (“Studies on the radiocarbon sample from the shroud of turin”): >…The presence of alizarin dye and red lakes in the Raes and radiocarbon samples indicates that the color has been manipulated. Specifically, the color and distribution of the coating implies that repairs were made at an unknown time with foreign linen dyed to match the older original material. … Links: http://www.casebook.org/forum/messages/4922/Studies on the radiocarbon sample from the shroud of turin 21136.doc. Http://webcache.googleusercontent.com/search?q=cache:NX Xg TKP8p R4 J:http://www.casebook.org/forum/messages/4922/Studies on the radiocarbon sample from the shroud of turin 21136.doc%2 Bshroud+madder+dyeing+lake+aluminium&hl=it&biw&bih&gbv=2&&ct=clnk Mass spectrometry (Wikipedia): >In mass spectrometry, fragmentation is the dissociation of energetically unstable molecular ions formed from passing the molecules in the ionization chamber of a mass spectrometer. >The fragments of a molecule cause a pattern in the mass spectrum used to determine structural information of the molecule. … … …. Link: https://en.wikipedia.org/wiki/Fragmentation (mass spectrometry) Interpretation of Mass Spectra >… Automated computer matching procedures are still only an aid to, not a replacement for, the skilled interpreter; and the path to that skill, as emphasized in every edition of this text, is practice… Link: https://books.google.it/books?id=x Q Wk5 W Qf MQAC&hl=it.","date":"2015-09-12","mins":"8:32 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-215023","author":"piero","post":"Here two links. >The Relics Cluster is a multi disciplinary group of researchers interested in applying studies of text, art and science to improve our understanding of relics: objects of cultural, historical and religious significance. … Link: http://www.keble asc.com/cluster/relics cluster/relics cluster >… a new research group based at Keble College’s Advanced Studies Centre that brings together experts in different fields with an interest in relics. >We have historians, archaeologists, classicists and theologians, as well as computer and medical scientists. >This project shows that even the two traditionally separate worlds of ‘science’ and ‘faith’ have the potential to work together. Link: http://www.oxfordmail.co.uk/news/13879733.University Life  Research into relics that melds science and faith/?ref=arc …so, I ask: Are these gentlemen new possible candidates to also examine the Holy Shroud?.","date":"2015-11-23","mins":"12:44 pm","url":"https://shroudstory.com/2015/11/23/fr-matthew-pittam-on-relics/","cat":"carbon_14_dating","title":"Fr. Matthew Pittam on Relics"},{"id":"comment-215024","author":"piero","post":"Putting aside the strange problem of the foreskin, I have previously sent the message, because (IMO) there was not a very clear statement about the dating of the Holy Shroud… See also the words about the ORAU (= University of Oxford’s Radiocarbon Accelerator Unit) in the School of Archaeology … into the article: >…ORAU took part in the research project that helped date the Turin Shroud, said to be the burial cloth of Christ, to between 1260 and 1390. ….","date":"2015-11-23","mins":"12:56 pm","url":"https://shroudstory.com/2015/11/23/fr-matthew-pittam-on-relics/","cat":"carbon_14_dating","title":"Fr. Matthew Pittam on Relics"},{"id":"comment-215564","author":"piero","post":"Now I here I write something that has to do quite poorly with the topic to be considered. It is the fact that I typed on Google: “David Hoffmeister Dan Porter shroud” and then I did not find anything … See also: David Hoffmeister and the book… “Quantum Forgiveness: Physics, Meet Jesus” e Book Launch August 30th, 2015 Print Launch October 1st, 2015 http://davidhoffmeister.com/quantum forgiveness/ I just wanted to ask your opinion on this new text, but… I did not know where I could put my request! >Quantum Forgiveness combines the science of the material universe as understood by Quantum Physics, forgiveness as taught by Jesus 2,000 years ago, and movie watching as a spiritual tool interpreted in a useful way through the eyes and clarity of a modern day mystic. >David Hoffmeister, a world renowned teacher of A Course in Miracles and expert on Mysticism & Spirituality, uses seven mind expanding movies as modern day parables to guide you into an experience of Quantum Forgiveness, an insightful and original book for Awakening to permanent Peace. In any case, the fact of being “down to earth” and to study the relics (before maybe fly away with your imagination), I think is a good thing ….","date":"2015-12-03","mins":"11:57 am","url":"https://shroudstory.com/2015/11/23/fr-matthew-pittam-on-relics/","cat":"carbon_14_dating","title":"Fr. Matthew Pittam on Relics"},{"id":"comment-215565","author":"piero","post":"Here a past work by Mark Van Strydonck (and other researchers). Link: https://journals.uair.arizona.edu/index.php/radiocarbon/article/download/3517/3032 Then, see also under: http://www.keble asc.com/?id= 2337&cid=1582 >Professor Mark Van Strydonck specialises in radiocarbon dating and stable isotope research (13 C/12 C and 15 N/14 N). >Since 1978, he has been responsible for the radiocarbon dating laboratory at the Royal Institute for Cultural Heritage (KIK IRPA for its initials in Dutch and French, respectively), an institute committed to the inventory, the scientific study, the conservation and the promotion of the country’s artistic and cultural property. … >…Prof. Van Strydonck explained that Christian relics result from people’s need of something material to prove a certain person existed and/or was even a hero, saint or martyr; while a local saint is renowned in a very small geographic area (a few parishes) and have a significant impact in the local area. … >… Prof. Van Strydonck has published the book “Relieken, echt of vals?” (Davidsfonds/Leuven, 2006)..","date":"2015-12-03","mins":"12:11 pm","url":"https://shroudstory.com/2015/11/23/fr-matthew-pittam-on-relics/","cat":"carbon_14_dating","title":"Fr. Matthew Pittam on Relics"},{"id":"comment-215567","author":"piero","post":"Unfortunately… under the address: https://journals.uair.arizona.edu/index.php/radiocarbon/article/download/3517/3032 (previously indicated), we can read the following words: >… Scientific or not so scientific debates, popularized by the media, of artifacts such as the Turin Shroud hardly helped to change that perception. Therefore, it is often thought that relic shrines contain bones that are much younger than the saint they are ascribed to, or that they hide a mixed assemblage of skeletal elements of very different origin and date, not excluding the presence of animal materia… — — “artifacts such as the Turin Shroud” …hmmm… …hmmm, mumble mumble…, this word “artifacts” seems to me that is impossibile to read it without to show a perplexed expression….","date":"2015-12-03","mins":"12:21 pm","url":"https://shroudstory.com/2015/11/23/fr-matthew-pittam-on-relics/","cat":"carbon_14_dating","title":"Fr. Matthew Pittam on Relics"},{"id":"comment-28489","author":"piero","post":"Who is Pierandrea Malfi (following the press release he is the other italian expert who performed the mechanical tests of tension and compression on linen) ? I have found few italian words (= Chemistry) under an old (= 7 6 2009) address : http://takimika.liceofoscarini.it/laboratorio/labindex.html — — Here another italian website (= Physics, 2010) : http://museo.liceofoscarini.it/pierandreamalfi.html — — Have you found other news ?.","date":"2013-03-27","mins":"10:58 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28724","author":"piero","post":"I have found a vague micro mechanical reference. But this study seems to be far from the study by Giulio Fanti and Pierandrea Malfi. As we have read (source = Press release) Prof. Fanti with Dr. Pierandred Malfi performed tests of tension and compression after analizing about a dozen of antique fabrics, etc. … etc. You can read that study : Deformation micromechanics of natural cellulose fibre networks and composites by S.J. Eichhorn, R.J. Young (Manchester Materials Science Centre, UMIST/University of Manchester) published in Composites Science and Technology, Vol. 63, Issue 9, July 2003, Pages 1225–1230 So … there is an interesting diagram, see the first figure : Fig. 1. Stress induced Raman band shift of a flax cellulose fibre … — — What is the possible different approach ? Try to observe the differences (with respect the study by Fanti) reading the study under the address : http://www.sciencedirect.com/science/article/pii/S0266353803000915 — — Abstract : >The deformation micromechanics of cotton and flax single natural cellulose fibres in relation to their use in cellulose based networks and composite materials is reported. The deformation of such fibres induces a shift in the 1095 cm−1 Raman band, corresponding to the ring structure of the particular polymorph, which can be calibrated against strain. It is shown that this band shift can be used to monitor the deformation micromechanics of fibrous networks (cotton paper) and the composite micromechanics of single natural cellulose fibre unidirectional composites. The shear lag approach of Cox [Br. J. Appl. Phys. 3 (1952) 72] is investigated for the fibrous network and composite materials. For the network it is demonstrated that this theory does not apply since bonding across the end modifies the stress transfer by ‘shear lag’. For the natural fibre composites it is thought that bonding occurs across the ends, also modifying this effect, but other possibilities are discussed in detail. — — As you have read this work is far from the explanations about the mechanical tests by Giulio Fanti (who controlled the Modulus of Young in direct and reverse cycle, loss factor and loss factor in reverse cycle, etc.), but you can also think at possible other ways to investigate the material (… and, if it is possible, in a nondestructive manner !). For instance … in the previous messages (on this blog) I indicate the AFM three point bending tests. Then you can read (and see) what is illustrated under : http://www.tappi.org/content/events/08nano/papers/08nan22.pdf The title of the presentation is the following : Young’s Modulus of Cellulose Fibrils measured using Atomic Force Microscopy by Siqun Wang and Qingzheng Cheng, Univ. Of Tennessee (2008) — — Do you know the bending deflections (and Structural Mechanics) ? What is the result from the measurement of the elastic modulus (following that method) ? — — What is your opinion ? Observe the fibril lay on wafer and the fibril on groove … Where is the best way to work ? Perhaps you can try (by yourself) using the extra fine linen found in one of the pharaoh tombs ! Some sources say that fine and even transparent linen apparels were worn by Egyptian queens and it was revealed that the fine yarn was obtained by enzymatic treatment of saliva (… in the human mouth !). I hope in your interesting observations ….","date":"2013-03-29","mins":"12:23 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28492","author":"piero","post":"In the press release there are the interesting words : > …the fibers have been mounted on suitable supports and then, with Dr. Pierandred Malfi performed tests of tension and compression after analizing about a dozen of antique fabrics (from bandages of mummies Egyptians of 3,000 BC, linens of Masada (Israel, 70 AD) and Medieval tissues up to recent ones. >Five mechanical parameters (tensile strength, Young’s modulus in direct and reverse cycle, loss factor and loss factor in reverse cycle) have been selected to obtain five different age dependent curves of the samples. >After this Fanti has measured the corresponding mechanical properties of the Shroud finding the corresponding point on the scales just determined. Combining the five mechanical results, the following date for the Shroud results: 400 AD with an uncertainty of plus or minus 400 years at a 95% confidence level. I am curious to read other informations on these tests, because in 1998 I have indicated the AFM controls on cellulosic chains but these controls are different with respect the three point bending AFM tests (or the other mechanical tests performed by Giulio and Pierandrea). In any case I believe that using the AFM controls we can achieve the good results, with the good level of precision (= statistical results). The true dating is an intriguing problem to solve … Have they solved all the questions in a good manner ? Are the old linen fibrils investigable without destructions ?.","date":"2013-03-27","mins":"11:31 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-29142","author":"piero","post":"First of all You must read in the book (by Fanti and Gaeta) the interesting Chapter 3 : “Le datazioni alternative” = “The alternative dating” The three methods : – FTIR/ATR, – Raman, – mechanical dating are all well explained (for the public). Then, in my opinion, you can learn something of interest (for your studies about the Holy Shroud of Turin) if you buy that new book. There are also some words about the controls for an interesting sample coming from Masada (radiocarbon dated) … that sample was contaminated with Ca CO3 (and then it was washed) … Well. Under the optical controls numerous parameters of this sample seemed to be similar those of the samples taken from the Holy Shroud. But the heat exposure for the samples of the Shroud … … …. Please, read that book ! I cannot copy for you (but see also [in this book] the copyright about the statistical works by E. Brunati. Pages involved : pp. 55 67) the work done by other researchers ! But this question is an interesting open door … also for the problem : Where are previously located the linen samples used by Fanti ? When we test the linen samples we have to know the exact area (in the Shroud map). — — Perhaps you can also try to find the formula (the book indicated that : there is also a squared root …) for the FTIR ATR controls (areas, chemical groups and different regions : crystalline or amorphous regions). For example … I have found the following reference : Dechant J. (1972) Ultrarotspektroskopische Untersuchungen an Polymeren, Berlin Available from [http://www.sprpages.nl/Spr Theory/Spr Theory.htm] But (today) I have no time to read that document. — — — At the end of the book by Fanti there is the following conclusion : >Eseguendo una semplice media artimetica delle tre date si ottiene 33 a C (più o meno 250 anni) Here the rough translation = >Executing (carrying out) the simple arithmetic media for the three dating we obtain 33 BCE (plus or minus 250 years). — — Then 33 BCE is near 33 CE or 30 CE (66 or 63 years of difference). But I have some doubt about the exactness of that simple arithmetic media … What is your opinion ? — — In my opinion we have to improve the controls and in 1998 I have indicated the SP Ms (= AFM, CFM, SNOM) as possible tools to find the truth. As you can see the FTIR/ATR and the other controls are very very interesting, but these controls seem to show some problem… In any case I admit that also the SP Ms are difficult tools to use, but (at least) we have to try to see what happens after all these advanced controls … Have you tried to do the useful works ?.","date":"2013-04-02","mins":"12:41 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-216013","author":"piero","post":"Have you read: “Talks on Natural Dyes and Natural Fibres” by Teresinha Roberts ? Link: http://www.teresinharoberts.co.uk/Talks/talks.html — — — I have found an example of a short piece on the need to use appropriate tools of investigation (= microscopes!)…: >… If you look at a yarn dyed with madder under the microscope, you will see a subtle variation of colour. >A yarn dyed with the synthetic equivalent of madder (alizarin and purpurin) does not have this wealth of colour variation and looks much more uniform. … Link: http://www.wildcolours.co.uk/html/natural dyes comparison.html Apart the old “Summary of Raes observations.doc. Raymond N. Rogers: 1st October 2001.” […that appears in “Appendix I”] I have not yet found particular words describing the use of microscopy nor colorimetric tools… But (perhaps) I am only hasty in my previous fast search… Then I’ll try late, probably tomorrow… when I’ll better with my teeth (unfortunately this morning the dentist has extracted one tooth that seemed enough healthy at its root, but rather destroyed at the top …). Perhaps this “forced physical environment” makes me rather acid and aggressive in this comment on a new useful paper. In other words: it’s a poor comment like that of an “angry black guy” because, in my opinion, that dental work is not yet finished: there is the lack of care for the lateral tooth, near that extracted… So… unfortunately I show a distinct change in focus, due to my (hasty) consideration of how can be of little weight certain (perhaps interesting) considerations without the support of strong instrumental evidence. I would really like to stop here with this disgraceful whining on a paper that, apparently, doesn’t seem to consider the hypotheses of Adrie van der Hoeven….","date":"2015-12-09","mins":"11:15 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216151","author":"piero","post":"An high wax content gives a characteristic luster to linen fibers So… I believe you have to investigate what was the kind of retting used for that linen material. I have never seen appear reasonable speeches, based on accurate data obtained from the control of the luster of the fibers of the Holy Shroud … in comparison to the type of possible retting used to obtain this old material (See also : … papers with related experiments)..","date":"2015-12-10","mins":"12:51 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216144","author":"piero","post":"Joe: >…she will periodically be updating the paper as she gets new information. This is an useful information. I think I would have avoided writing my speech tinged with “persecutory paranoia” (and madder…) if this very simple information had appeared before! I love detailed, well presented, well illustrated papers… I hate disorganized speeches… Sorry..","date":"2015-12-10","mins":"12:17 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-76483","author":"piero","post":"In one of the previous messages daveb of wellington nz February 2, 2014 at 3:46 pm wrote : >There are clearly limits to what can be discovered with NDT methods alone. So, what are the exact limits about the “NDT methods alone” ? For example : I am curious to see what is the result from the SPM controls about the tunic of Saint Francis of Assisi … In the past we have known what was the scientific truth : >”The tunic and cushion from Cortona were found compatible with the period in which Saint Francis lived but the one from Florence wasn’t,” said Pier Andrea Mandò, director of the Nuclear Physics Laboratory in Florence, where the work was done by the Laboratory of Nuclear Techniques for Cultural Heritage. Source : http://www.telegraph.co.uk/science/science news/3305860/St Francis of Assisi robe is a fake.html Perhaps (before to work [in vain] on linen fibrils from the Holy Shroud), it will be interesting to know what is the answer on these relics using the NDT controls. What is your opinion ?.","date":"2014-02-04","mins":"10:18 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76746","author":"piero","post":"Do you know the AFM measurements of nanoscale mechanical properties ? In other words you have to read : Probing delicate samples : stiff AFM mechanics at soft forces http://iopscience.iop.org/0957 4484/labtalk article/48521 Researchers Jason Killgore and Donna Hurley at the National Institute of Standards and Technology in Boulder, US, achieved these results using an AFM technique called contact resonance spectroscopy. The method involves analysing the resonance frequency of a vibrating AFM cantilever when the probe tip is in physical contact with the sample of interest. From measurements of the contact resonance frequencies, information is obtained about the interaction forces between the tip and the sample – for example, contact stiffness. Models for the tip sample contact mechanics can then be used to relate the contact stiffness to mechanical properties such as elastic modulus … ….","date":"2014-02-05","mins":"10:58 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76763","author":"piero","post":"We have to avoid the great destructions. — — You wrote : “Removal of samples from the cloth, representative or otherwise, is in a sense “destructive” of the original object, it is no longer strictly entire” then there are the useful samples at disposal that were taken in the past from the Holy Shroud and we can work (if we have permission to use the precious samples !) using the advanced controls (= NDT with AFM techniques) on these samples. The AFM produces images of materials at the nanoscale level and provides a true three dimensional surface profile. Using the CFM (Chemical Force Microscopy) we can understand the chemical features (chemical mapping the explored areas). See also : the chemical groups ( OH and/or COOH or CHO groups), lignins (See for example : the Wiesner test used by Ray Rogers and the vanillin loss from lignin … and this new way to control the textile material), etc., etc. Perhaps we can detect something of useful around the BIF. Do you agree ? As I wrote in the past, there are two main ways : – AFM controls addressed towards the cellulosic DP detection and – AFM bending tests (three point bending test, etc.) Using atomic force microscopy (AFM), we can probe the mechanical properties. To determine the mechanical properties, we have to perform three point bending tests with an atomic force microscope … So the question is the following : Are we able to use AFM bending experiments as a mechanical characterization method ? Until now we have known that fibers are positioned on a structured substrate and deformed with the AFM cantilever and this is only the basic information … References : http://en.wikipedia.org/wiki/Three point flexural test http://www.pcii.uni bayreuth.de/rg fery/en/projects/micromechanics and interactions/nanomechanics of fibers/index.html.","date":"2014-02-05","mins":"11:54 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-77047","author":"piero","post":"It seems difficult to believe in a roman cloth (= the Shroud = … at sometime, someone, in Jerusalem sold some z spun linen from somewhere … ). Is it possible to prove that particular idea ? Where is the reliable proof ? Have you forgotten the discoveries in Palymira ? — — I have read ( http://digitalcommons.unl.edu/tsaconf/385/) that : >Oriental silks were utilized especially in Palmyrene funerary contexts where they were cut into long strips with which to wrap individual mummies. These bodies had been chemically treated with bitumen and spices to preserve the flesh and the outward appearance of the deceased for as long as possible. … — — B.T.W. : I am curious about that information (= The Women of Palmyra–Textile Workshops and the Influence of the Silk Trade in Roman Syria. Epoch for that scenario : second century A.D.) : perhaps there was … also the silkmarine byssus … Have you found an interesting information on that question ? See also : 1a) Stauffer, Annamarie. “Textiles from Palmyra: Local Production and the Import and Imitation of Chinese Silk Weavings.” International Colloquium on Palmyra and the Silk Road, AAS. Vol. 42. 1996. 1bis) Schmidt Colinet, Andreas, Annemarie Stauffer, and Khālid Asʻad. Die Textilien aus Palmyra. Vol. 8. Ph. Von Zabern, 2000. 2) Title: The Textiles from Palmyra Author(s): SCHMIDT COLINET, Andreas Journal: ARAM Periodical Volume: 7 Issue: 1 Date: 1995 Pages: 47 51 DOI: 10.2143/ARAM.7.1.2002217.","date":"2014-02-06","mins":"1:42 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-77246","author":"piero","post":"There is a book by John Lupia : The Ancient Jewish Shroud At Turin (Regina Caeli Press, 2010). Have you read that book ? Link : http://www.reginacaelipress.com/ Was the Shroud of Turin an ancient Jewish tallit ? You can read the following explanation : >The Ancient Jewish Tallit design was not unique but a common type of himation garment worn by the pagans (Greeks and Romans) as well, but without the sacred fringe in each corner called tzitzyot (plural of tzitzit). >This four arm slit garment was called an amphimaschalos, that it, double arm holed. >The long rectangular linen garment was folded in half so that each pair of arm holes lined up allowing the man to slide his hand and arm through each. Do you agree on that description ? >It was unknown before the 17th century that the tallit was identifiable as the burial shroud of Jesus Christ, and the ancient Jewish tallit form was not known until the 20th century. Do you agree with that information ? Under the address : http://greatshroudofturinfaq.com/Crazy/tallit.html We can read : >The idea that the Shroud of Turin was Jesus’ tallit (prayer shawl) has been proposed by author John Lupia. This, he argues, confirms its authenticity. Unfortunately, Mr. Lupia’s arguments are, at best, tentative. He bases his conclusion on two weak citations from old literature (A.D. 1653 and 1903), some questionable translations of scripture by the author himself and some highly imaginative interpretations of the Gospels … >… … Mr. Lupia has not been able to convince any other scholar of the shroud. But, under : http://www.amazon.com/The Ancient Jewish Shroud Turin/product reviews/0982673906 we read : >Mr. Porter attempts to dissuade the reader that this book fails to demonstrate that the Shroud of Turin is an ancient Jewish tallit when the book is chock full of standard archaeological evidence and proof that it is confirming the identification, not merely presenting an unsubstantiated claim as he would have you think. Porter falsely alleges that this evidence and proof is solely based on “two weak citations from old literature (A.D. 1653 and 1903), when the book contains a myriad of witnesses and citations as well as graphic illustrations that prove the point remarkably. So … Where is the truth ? ….","date":"2014-02-07","mins":"9:58 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-77275","author":"piero","post":"Here the ideas … or the reasoning (= how to proceed) : We have to test the linen fibrils using the preliminar bending tests on treated materials (neutron irradiated, proton irradiated, etc.) in comparison with the other linen material (not treated). So we can observe what happens (= differences from the set of data obtained) … and then you can see the shift (for example : in the case of neutron irradiated linen) on your set of data (graphic representation). — — — Here a link : http://www.catscientific.com/how to prepare linen for radiocarbon dating/ (= February 25, 2013, Bob Wilcox) Have you read that webpage ? Here some line : >Dating ancient samples such as linen is a delicate process made more so by the scarcity of samples. That’s why practice runs are made to refine the process by using small samples of regularly available product that has been purposely neutron irradiated. >Process development is complex. Among other things it involves cutting a well washed sample of neutron irradiated linen into small squares such as 1 cm2. The optimum sample size may vary depending on the texture of the linen. >These squares are homogenized to reduce samples to a size permitting accurate analysis of organic chlorine isotopes, an element present in linen as chlorine 35 and 37. Neutron irradiation causes chlorine 35 to capture a neutron to make chlorine 36. >The analysis to determine the chlorine 36/chlorine 35 ratio is done on an accelerator mass spectrometer. Otherwise stated, knowing the total chlorine content in the linen irradiated with a known amount of neutrons would determine the chlorine 36/chlorine 35 ratio to look for in the real sample. … — — In my opinion the irradiated linen samples are more brittle, fragile … So, performing the bending test we can observe this difference. The main problem to solve is the following : we have to work … Here a link : http://english.keskato.co.jp/products/kes fb2.html >The tensile data obtained by this tester is approximately the same value as that obtained in a strip biaxial tensile measurement, because the mechanical unit uses wide specimen (20cm) with 5cm space between the chucks. >As original sample length is 5cm with 20cm width,similar data as strip biaxial test (biaxal test with one direction restricted) are obtained for tensile property … >Space between clamps: 1cm (maximum 20cm) But … we have to use the advanced controls on linen fibrils (not fabrics)… In other words : we have to modify the test … Is that a confused line of argument ? — — Where is the correct AFM way ? I hope in your comments..","date":"2014-02-07","mins":"11:48 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-78361","author":"piero","post":"I see a complete lack of answers. So… I beg your pardon about the possible confusion. First of all we have to know what can measure the different apparels, because there are two different levels of bending test : the macro bending and the micro or nano bending. The AFM three point bending test is in the field of micro or nano bending. It’s easy to write the diagram of the segment of fiber under analysis. Do you know Structural Mechanics ? In my opinion this matter is useful also in the case of thin layer on linen fibrils … See, for example : the thin walled sections and the controls … A section is said to be thin walled when one of its dimensions (the thickness) is clearly smaller than the others (see also : Bredt) … — — In any case I hope to see the results obtained from the studies about the bending tests on treated linen materials (neutron irradiated, proton irradiated, etc.) in comparison with the other linen material (not treated). These data are useful to discuss the dating and the BIF. Until now we have not yet the useful works (Fanti don’t used the AFM systems) and then we have to wait ….","date":"2014-02-11","mins":"1:58 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-78362","author":"piero","post":"Prof. Fanti didn’t used the AFM but he s a Mechanical Engineer and then is able to write a Plan ….","date":"2014-02-11","mins":"2:02 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-80394","author":"piero","post":"Thank you for your answer ! As I wrote there are two kind of tests : at macro level and at micro nano level (= AFM bending tests). I am curious about your possible comments in the field of Structural Mechanics (AFM test and bending moment, etc.)….","date":"2014-02-18","mins":"1:50 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-194138","author":"piero","post":"What might solve the puzzle is the use of a modern instrument, in short, in a way analogous to the pendulum that allowed Foucault to demonstrate the rotation of the Earth. Link: http://en.wikipedia.org/wiki/Foucault pendulum So I think you have understood my allusion to nanomechanical tests on Young’s modulus … Otherwise, in other words: the nanomechanical tests on Young’s modulus without the destruction of the material (the precious sample of linen! ….","date":"2015-03-23","mins":"11:14 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-177792","author":"piero","post":"Who knows what happens with a different point of the Ancient Sheet?.","date":"2014-12-19","mins":"11:22 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-177956","author":"piero","post":"“Nothing can be said”… This should be the correct judgment resulting from the situation that has been produced from the 1988 radiocarbon tests. Do you feel happy with that definition? I remember another kind of explanation about the blood: >Prodigiosin is the red pigment produced by many strains of the bacterium Serratia marcescens, other Gram negative, gamma proteobacteria such as Vibrio psychroerythrus and Hahella chejuensis. It is in a family of compounds termed “prodiginines”, which are produced in some Gram negative gamma proteobacteria, as well as select Gram positive Actinobacteria (e.g. Streptomyces coelicolor).The name “prodigiosin” is derived from “prodigious” (i.e. Something marvelous). Link: http://en.wikipedia.org/wiki/Prodigiosin The ability of pigmented strains of Serratia marcescens to grow on bread has led to a possible (… or only vaguely presumed) “explanation” of Medieval transubstantiation miracles, in which Eucharistic bread is converted into the Body of Christ. But, in the case of the Holy Shroud, this red pigment seems not credible as explanation for the blood stains. Are there any objections on your part about my statement? — — — — What has always intrigued me is the remote possibility of dating the blood present on the shroud. Maloney (Read the Appendix III of the paper by Maloney = “Dialogue between Ray Rogers and Bryan Walsh”) shows an interesting exchange of messages between Rogers and Bryan Walsh … Ray Rogers response (here short excerpts): > I am retired. … … > … This is a 3 D problem … > I made some 1 D estimates, but I did not even published them. … and finally a nice problem to solve: > … … Remember there are blood spots all over the cloth, and sulphoproteins evolves H2 S at low temperatures (Here’s my note [PI]: … and what are those temperatures, exactly?) and they evolve hydroxyproline through roughly the same temperature ranges. Only blood spots near the scorches showed degradation. … …. … and then it came out the history of the thermal decomposition of the blood (with production of H2 S) seen as an index of validity for the analysis of the loss from Vanillin Lignin. An interesting problem. What do you think? I believe it can be solved with the use of advanced AFM techniques for control. — — I have just found a paper where you can see the image for RBC (=Red Blood Cell) Equilibrium Shape. (Straigth line: Equilibrium shape that arises from bending energy minimization and which was used in the calculations to derive eigenmodes of the bending deformation energies …): Title of that paper: Spatially Resolved Eigenmode Decomposition of Red Blood Cells Membrane Fluctuations Questions the Role of ATP in Flickering by Boss D, Hoffmann A, Rappaz B, Depeursinge C, Magistretti PJ, et al. (2012) P Lo S ONE 7(8): e40667. Doi:10.1371/journal.pone.0040667 Link: http://www.plosone.org/article/info%3 Adoi%2 F10.1371%2 Fjournal.pone.0040667 Temperature plays important roles in RBC deformability (see also the shear modulus, etc. …). So, we have to study the following argument: “Shape and Biomechanical Characteristics of Human Red Blood Cells different Temperature conditions”. So before you run the work (= adequate AFM controls) you must well know how to behave these RB Cs under different temperatures… Do you agree with me?.","date":"2014-12-20","mins":"6:15 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-178425","author":"piero","post":"I was talking about the “Vanillin loss from Lignin”, ù bloor rec cells and different levels of Temperature, etc. … Why do you change the subject? Now you know very well that you can do the cold dyeing of polyamide … and then… What should I tell you different? The head is not seen … In short: What do you expect from me? Here’s what I can tell you: You should not get into the persecution around that incontrovertible argument: the cold dyeing for polyamide 6 !… You must inform yourself in a well manner on the issue of cold dyeing (for polyamide 6)!.","date":"2014-12-22","mins":"11:14 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-177957","author":"piero","post":"Errata corrige: for the analysis of the loss from Vanillin Lignin. Instead of: for the analysis of the loss of Vanillin from Lignin. —————–.","date":"2014-12-20","mins":"6:20 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-178427","author":"piero","post":"Errata corrige: I was talking about the “Vanillin loss from Lignin”, ù bloor rec cells and different levels of Temperature Instea of I was talking about the “Vanillin loss from Lignin”, Red Blood Cells and different levels of Temperature, etc. * * * * * * * * Louis, You must not create confusion! I see no head in Jospice Imprint and then it is useless to speak of “head” if the head there is not in that strange imprint!.","date":"2014-12-22","mins":"11:19 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-136809","author":"piero","post":"I am curious to know what is your opinion on the UV controls (operating with a UV control very short to avoid damage). From money to artwork, fakes and forgeries often look different under blacklight… Is it possible to check all the samples under UV light? Different chemical properties become apparent under a blacklight… So… What are the results (UV versus Vis) from all the samples?.","date":"2014-07-10","mins":"12:38 pm","url":"https://shroudstory.com/2014/07/10/new-photographs-of-the-samples-from-oxford/","cat":"carbon_14_dating","title":"New Photographs of the Samples from Oxford"},{"id":"comment-192634","author":"piero","post":"Where are gone the proper gloves for the right challenge?.","date":"2015-03-06","mins":"11:49 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-33655","author":"piero","post":"So … The only solution can be a new 14 C test [B.T.W. : in the past I read something about a new and exact 14 C test from a researcher of the ENEA. But now I have found nothing of new on that argument using Google !!!] on that “useless material” (and with the preliminar analyses in order to operate with a correct procedure !). There is also the SCR (= So Called Reserve) to test (… and there are also the past samples taken from the Shroud). Then we cannot destroy all the material forever. … What kind of analysis about the different samples of linen material ? — — — — — In a previous message by Louis (May 10, 2013 = Comment Promoted: Do not blindly accept the results of the 1988 dating) I have read “there are now calls for examinations at the molecular level” and then some of the inherent claims have been were written from myself if I am right … The other words by Louis were : “If we reach the molecular level and find what is expected to be seen…” We just passed through the problem, we didn’t stop there … This turns in a sort of pasquinade about the new dating. Then see the claims in the new book by Giulio Fanti (and Saverio Gaeta) : three different methods (= ATR FTIR, Raman and “mechanical dating” or MMP) are indicated and the inherent scientific discussion seems not to be guided with a polished style (and then read my intervention about the “AFM three point bending test” in order to discover what is the mechanical answer from the samples …)..","date":"2013-05-14","mins":"9:13 am","url":"https://shroudstory.com/2013/05/13/paper-chase-shroud-material-lost/","cat":"carbon_14_dating","title":"Paper Chase:  Shroud Material Lost"},{"id":"comment-29219","author":"piero","post":"In my opinion John Paul II was (more or less) a philosopher and a sociologist (and not a textile scientist !!!). In any case … I want to quit with the strange (and various or … several) rumors about the past Popes. These stories seem to be far from the analyses about the famous relic. — — So … I am curious about the point (the last. The number 10 of the long list …) indicated by Jos : 2009 / Materiale della Fondazione 3 M del 1978 88 / Fondazione 3 M / Politecnico di Milano. I ask your opinion because in the book (by Fanti and Gaeta), at page 208 (= Appendice. Ricostruzione del percorso dei frammenti della Sindone, by Marco Conca), there is not the name of the third owner for these samples … or holder… What is your opinion ? Which were the exact agreements ? Where is the inherent document ? Where is the work carried out from the Milan Polytechnic ? It seems a bit strange that Fanti was able to work with Pierandrea Malfi, with Pietro Baraldi (Univ. Of Modena) and Anna Tinti (Univ. Of Bologna) [= FTIR and Raman controls], with the Max Planck Institute of Potsdam, but he was not able to work with the Milan Polytechnic ! … What is the explanation for that fact ? — — By the way : Do you know the FTIR ATR technique ? — — The FTIR ATR absorption spectrum is characteristic of the given sample. The FTIR ATR absorption spectrum slightly differs from that obtained by the transmission method. The analysis involves the intensity and frequency of absorption peaks characteristic of chemical groups … The penetration depth of IR beam can be controlled within some range by selecting an appropriate prism (selection of refractive index) and the incident angle of beam. — — At the end I have the unsolved questions : What is the effect of the Ca CO3:Iron oxides ratio [… of the coating] on linen fibers, in the case of CD and/or VUV treatments ? … And on light fastness ? Where are the inherent controls using the FTIR ATR (or other techniques) ?.","date":"2013-04-03","mins":"11:06 am","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","title":"Res ipsa loquitur:  The facts speak for themselves."},{"id":"comment-33658","author":"piero","post":"Errata corrige : … claims have been written from myself if I am right … etc..","date":"2013-05-14","mins":"9:21 am","url":"https://shroudstory.com/2013/05/13/paper-chase-shroud-material-lost/","cat":"carbon_14_dating","title":"Paper Chase:  Shroud Material Lost"},{"id":"comment-29229","author":"piero","post":"Sorry … He was a great Pope … ! I was in a hurry ! I beg your pardon. — — But … you have to take into account all the concrete scientific problems … if you want to consider the Holy Shroud and the scientific research … and the last works by Fanti. — — In my opinion Fanti (takining apart the controversies) was able to open the door and then we have to improve the analitical works. I hope you want to know something about the works by Fanti and so you have to buy the book because (at least) there are the explanations (about the three kind of controls). — — How to show our ability to improve the evaluations ? Perhaps (before to manipulate [in a bad manner ?] the precious thread coming from the Holy Shroud of Turin) we can try to do something using the little samples taken from the controversial Sainte Coiffe of Cahors (France). Do you know that presumed relic ? Several year ago (in April 2002) I bought a book : Le témoin secret de la Résurrection, by Robert Babinet (the book was published in October 2001 …). — — Le “Soudarion” or Sainte Coiffe … What is your opinion about that particular relic ? I hope in your interesting answer. — — Regards, Piero.","date":"2013-04-03","mins":"12:31 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","title":"Res ipsa loquitur:  The facts speak for themselves."},{"id":"comment-74840","author":"piero","post":"Congratulations ! Hurrah ! Three cheers for that new book !.","date":"2014-01-27","mins":"11:51 am","url":"https://shroudstory.com/2014/01/27/shroud-pope-francis-call-for-new-test/","cat":"carbon_14_dating","title":"Should Pope Francis Call for New Test?"},{"id":"comment-74833","author":"piero","post":"Dan, I have just seen that … … there is an new italian book by Giulio Fanti (and Andrea Malfi), Ed. Segno, Italy … Here the title : SINDONE: PRIMO SECOLO DOPO CRISTO! Here the italian words : Dopo il test radiocarbonico del 1988, gli scienziati si fecero fotografare con la data medievale scritta alla lavagna e seguita da un punto esclamativo; ora il punto esclamativo deve essere riferito a una data del I secolo dopo Cristo… and here my rough (sorry…) translation : After the radiocarbon test of 1988, the scientists were photogrphied with the medieval epoch written on blackboard and the exclamation mark… Now the exclamation mark must be referred to the first century (the right epoch, the right date !) … What is your opinion ? Perhaps the Pope and the responsibles have to take into account that new book … As I wrote several times about the possible use of SP Ms techniques, then I am curious about the textile dating … — — It was difficult to date the Shroud using the “radiometric dating” (14 C tests)… Now we have the new ideas ….","date":"2014-01-27","mins":"11:33 am","url":"https://shroudstory.com/2014/01/27/shroud-pope-francis-call-for-new-test/","cat":"carbon_14_dating","title":"Should Pope Francis Call for New Test?"},{"id":"comment-75178","author":"piero","post":"In my opinion AFM techniques can fulfill the needs about the least damaging approach, restricted to answering crucial questions. No 14 C tests, or (at least) the AFM controls before to destroy (forever !) the samples ! I am not a picker of (long) radiocarbon quarrels. In my idea we can observe the linen fibrils avoiding the great damages. — — See, for example, the fibril deflection determination under : http://www.tappi.org/content/events/08nano/papers/08nan22.pdf The technique is, in other words, the following : measurement (of AFM tip) about the fibril above the groove and measurements about the fibril lay on wafer. — — Instead, if you only want to investigate the surface, You can improve the AFM technique using the CFM tests. . — — What is your reply ?.","date":"2014-01-30","mins":"1:29 pm","url":"https://shroudstory.com/2014/01/27/shroud-pope-francis-call-for-new-test/","cat":"carbon_14_dating","title":"Should Pope Francis Call for New Test?"},{"id":"comment-210465","author":"piero","post":"I have observed (another time) the “oleic acid mas spectrometry” and then I have seen the presence same peaks: 55 (but the right number that was shown in “Raes sample fiber” [Fig. 5 from paper by Rogers] was 56 !!!), 69, 83, 97, 111. Also this (mass spectroscopy) diagram shows the “ CH2 ” peaks… So… Is that a sufficient “proof” to disprove Ray Rogers or Marco Bella ? Yes or not? “No, or not completely…”, it’s my answer… Has been (Prof. Bella) trying to built a sort of chemical “crop circle” with his own interpretation of mass spectrometry (regarding that “Raes sample fiber”) ? …and I then I reach the following conclusion: We have to be more careful when we want to work with mass spectrometry diagrams! Links: http://lipidlibrary.aocs.org/Analysis/content.cfm?Item Number=39508 http://aocs.files.cms plus.com/Lipids Library/images/Importedfiles/lipidlibrary/ms/ms21/file.pdf (page 2 of that file in .pdf format) — — Here an old (1980) reference: Computerized mass spectrum prediction and ranking N. A. B. Gray, R. E. Carhart, A. Lavanchy, D. H. Smith, T. Varkony, B. G. Buchanan, W. C. White, L. Creary Anal. Chem., 1980, 52 (7), pp 1095–1102 Publication Date: June 1980 Link: http://pubs.acs.org/doi/abs/10.1021/ac50057a023 Other bibliographic references: 1 – New Computer Aided Methods for Revealing Structural Features of Unknown Compounds Using Low Resolution Mass Spectra by Konstantin S. Lebedev and Daniel Cabrol Bass J. Chem. Inf. Comput. Sci., 1998, 38 (3), pp 410–419 Publication Date (Web): February 28, 1998 Copyright © 1998 American Chemical Society 2 – Automatic Spectra Interpretation, Structure Generation, and Ranking Patrick Fontana and Ernö Pretsch * J. Chem. Inf. Comput. Sci., 2002, 42 (3), pp 614–619 Publication Date (Web): March 22, 2002 Copyright © 2002 American Chemical Society 3 – Optimization and testing of mass spectral library search algorithms for compound identification. S.E. Stein, D.R. Scott J. Am. Soc. Mass Spectrom., 5 (1994), pp. 859–866 4 An integrated method for spectrum extraction and compound identification from gas chromatography/mass spectrometry data. By S.E. Stein Journal of the American Society for Mass Spectrometry Volume 10, Issue 8, August 1999, Pages 770–781 — — — Do you know what is AMDIS? AMDIS – Automated Mass spectral Deconfolution and Identification System … I have found this acronym with the following link: http://www.nist.gov/oles/upload/11 Stein Steve Mass Spec Reference Libraries for Forensics.pdf Links: http://chemdata.nist.gov/dokuwiki/doku.php?id=chemdata:amdis http://chemdata.nist.gov/dokuwiki/doku.php?id=chemdata:amdisexplained …AMDIS was developed at NIST for the critical task of verifying a major international treaty, the Chemical Weapons Convention. … The overall process involves four sequential steps: 1 – noise analysis 2 – component perception 3 – spectral “deconvolution” 4 – compound identification — — — Where are the experts in the field of mass spectrometry ? … Where are they (…secretly hidden?)?.","date":"2015-09-15","mins":"11:50 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210453","author":"piero","post":"Here some words, trying to return to the particular “chemical sociological analysis” unveiled by Colin… I should be happy if the same relentless pursuit of “analytical perfection” (= regarding “polyethylene oligomers” or not …) would be happen about the ATR FTIR analysis. “The penetration depth into the sample is typically between 0.5 and 2 micrometres” (and this is the same [vague] information we can read in the book by Prof. Fanti). What can see into the linen fibrils using the ATR FTIR analysis? For example : in the book (by Prof. Fanti, it. Edition pp. 294 295) there are two example of linen fiber diameter = 15.7 micrometres and 22.8 micrometres. So, we can try to calculate something… If you take the minimum penetration the percentage is the following: 0.5/15.7 = 0.0318 = 3.18% —> 6.36% with respect the entire diameter 05./22.8 = 0.0219 = 2.19% —> 4.38% with respect the entire diameter Instead if you take into account the maximum penetration the percentage is the following: 2/15.7 = 0.12738 = 12.74% — > 25.48% with respect the entire diameter 2/22.8 = 0.0877 = 8.77% — > 17.54% with respect the entire diameter And then see also what can be the relation between the inherent thickness of PCW, S1, S2 (on observed linen fibrils) and the results obtained using a different lenght of “penetration depth”. In other words: I am curious to know more about the criterion used to calibrate the ATR FTIR penetration depth into the linen samples… This doesn’t appear in the book. Am I wrong in these simple “pre optical remarks”?.","date":"2015-09-15","mins":"10:11 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210529","author":"piero","post":"Altough I had noticed some vague similitudes (= few peaks), I don’t believe in “Olive oil” as true solution of the “identification problem”… and then I agree with Marco Bella (= “I do not think it is olive oil”)… and that starting only from the m/s diagram and not for other explanations (such this = “…It is not on the image, but on a corner (Raes Sample) where there is no image”). Since Mass Spectra are reproducible, I think we have to check (= searching in the mass spectra library) what is the possible Spectrum that exactly matches our mass spectroscopy diagram we have to interpret. Stop. This can be the work to do. In my opinion, this problem is even trivial! So… Where are your own results? * * * * * * Here what we can see under the address: http://www.kayelaby.npl.co.uk/chemistry/3 8/3 8 6.html regarding the problem of identification for “mass spectra obtained from the pyrolisis of a Raes sample fiber” m/z = 55 Possible associated group = C3 H3 O Possible inference = Some cyclic ketones … but we haven’t this number of mass, instead we clearly read the numebr 56 m/z = 56 Possible associated group = C4 H8 Possible inference = Hydrocarbon m/z = 69 Possible associated group = C5 H9 Possible inference = Some Hydrocarbons m/z = 83 Possible associated group = C4 H3 S Possible inference = Monosubstituted thiophenes But it seems hard to believe to the presence of sulfur and then it would seem that this peak was due to the repetition of known period n = 14 (= CH2 = 12 + 2) … m/z = 97 Possible associated group = C5 H5 S Possible inference = Methyl or mono alkyl thiophenes m/z = 131 Possible associated group = C6 H5 CHCHCO Possible inference = C6 H5 CHCHCOX In any case, this analysis seem to be very rough… And then take into account that at 85 we have also the possible furanic ring (with 2 Oxygen, one into the ring and the other out)! Link: https://en.wikipedia.org/wiki/Furan Links about Furfural m/s : http://webbook.nist.gov/cgi/cbook.cgi?ID=C98011&Mask=200 http://webbook.nist.gov/cgi/cbook.cgi?Spec=C98011&Index=0&Type=Mass&Large=on.","date":"2015-09-16","mins":"11:51 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210589","author":"piero","post":"Errata corrige: >Although instead of: >Altough — — *** — — Yesterday I was disturbed. — — — Here what I want to add: in the paper by Dr. Ray Rogers “Pyrolysis/Mass Spectrometry applied to the Shroud of Turin” there is a tridimensional diagram (=”mass/scan/concentration map of the pyrolysis products”) about the sample “Shroud image fiber” (Slide Number: “E1 B”), but there is not a tridimensional diagram for the other sample (Slide Number: “Raes #3”),: “mass spectra obtained from the pyrolisis of a Raes sample fiber”… So… in my opinion, we cannot discuss in a deep manner the entire issue. Sorry. I have just seen that the paper: http://www.shroud.it/ROGERS 3.PDF is a bit different (= there is no diagram about the “mass/scan/concentration map of the pyrolysis products”) with respect the paper I had read years ago (and then this is under the Link: https://www.shroud.com/pdfs/rogers4.pdf). I beg your pardon! Perhaps Joan can help us. In any case I am curious about the probable paper written by “OK”… Also Thibault seems to be promising, but (until now) we have no exact interpretations, apart my goofy attempt (of yesterday)… and then here (regarding the boring problem of identification of “mass spectra obtained from the pyrolisis of a Raes sample fiber”) I want to add the following (presumed) peaks: m/z = 73 Possible associated group = C4 H9 O Possible inference = Alcohols, ethers my comment: it’s possible… — — But, see also: Xylose, that is a component in hemicellulose… >… cellulose contains only anhydrous glucose. >For instance, besides glucose, sugar monomers in hemicellulose can include xylose, mannose, galactose, rhamnose, and arabinose. … (Link: https://en.wikipedia.org/wiki/Hemicellulose ) Xylose, with main m/z = 73 (other peaks at: 31 [29,30; 32], 43 [41, 42,; 44, 45], 60, 61 and 71, 72 ; 74) Ref.: http://webbook.nist.gov/cgi/cbook.cgi?ID=C58866&Mask=200 my comment: probably there is a very low percentage of xylose in linen fibrils (…but I have read that “Cellulose” from cotton (!) contain near 1.5% of xylose and smaller amounts of other monosaccharides…). Probably there is a risk greater than an extraction from “raffle drum” (= caos) with this kind of interpretation of spectra of mass spectrometry … — — m/z = 81 Possible associated group = C5 H5 O Possible inference = Furans my comment: possible/probable m/z = 131 Possible associated group = C6 H5 CHCHCO Possible inference = C6 H5 CHCHCOX my comment: unlikely… — — Few words about: Hydroxymethylfurfural = HMF main M/S peaks at: 41 (and 39), 69, 97, 128 (?) Ref: http://webbook.nist.gov/cgi/cbook.cgi?ID=C67470&Mask=200 my comment: possible but unlikely because Rogers wrote: “The hydroxymethylfurfural deformylates (loses a formaldehyde fragment) …” (https://www.shroud.com/pdfs/rogers4.pdf). Instead Furfural has the main peaks at: 29 (little), 39 (and, less, 38), 67 (very little), 97 and 98 (and both these [that nearly are “twin peaks”] are great peaks) Ref. Under: http://webbook.nist.gov/cgi/cbook.cgi?ID=C98011&Mask=200 I think we have to deepen the analyses about the questions regarding the 95, 96, 97, 98 peaks (I believe this can be another “key area” to investigate, after the other: 69, 131 169, 181 of “Shroud image fiber” [“E1 B”], and the series: 56 69 83 97 of “Raes sample fiber” [“Raes #3”]). Well, under: http://airborne.co.nz/hmf.shtml we can read: >…today HMF is used as an indicator of heating or storage at elevated temperatures … (of honey) >Hydroxymethylfurfural (HMF), also 5 (Hydroxymethyl)furfural, is an organic compound derived from dehydration of certain sugars… Link: https://en.wikipedia.org/wiki/Hydroxymethylfurfural The acid catalyzed dehydration of hexoses results in the formation of 5 hydroxymethylfurfural (HMF). This is a well known fact. Colin, Here some “obvious words” (around “HMF and heat”) that (perhaps) can sound as familiar to your Food Chemistry: A) 5 Hydroxymethylfurfural (HMF), a heat induced food toxicant present in a vast number of food items, has been suggested to be genotoxic after being bioactivated by the sulfotransferase SULT1 A1 … B) 5 (Hydroxymethyl)furfural (HMF), one of the major intermediate products in the Maillard reaction, is present in a wide variety of foods. This aldehyde is formed as a decomposition product of glucose and fructose in foodstuffs subject to cooking or heat sterilization. … C) 5 Hydroxymethylfurfural (HMF), formed by acid catalyzed dehydration and in the Maillard reaction from reducing sugars, is found at high levels in numerous foods. … Here a vague suggestion : Can be possible a series of reactions that includes Hydroxymethylfurfural and cadaveric emissions? This imply the role of a certain amount of heat (…seemingly as coming not from the corpse, because HMF is produced at certain “high temperature”!) — — Dan, have you a new useful answer for us (regarding Mass Spectrometry and “Raes sample”) on this blog?.","date":"2015-09-17","mins":"11:18 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210372","author":"piero","post":"I believe that I’ll not be happy (I say this only speaking for hypothesis…) if someone will want to ask a quantitative assessment of the lignin content on linen fibrils (of the Holy Shroud) using mass spectometry… I say that because Dr. Ray Rogers indicated a quantitative evaluation of Lignin in his paper (= “Scientific Methods Applied to the Shroud of Turin. A review.”) and also he stated that differences between amount of lignin on linen fibers in the Raes sample and on Shroud samples are significant. Rogers indicated us that simple microscopic viewing was not sufficient to prove differences among the linen samples. In any case he indicated us that no samples of the Holland cloth or Raes threads had heavy deposits of lignin… Lignin amounts vary among Shroud locations and this can be an interesting fact when it’s correlated with the observations of bands of different colors… Newer linens are homogeneous and they do not show bands of different colored yarn in the weave. … So… Colin, What is your opinion about the inherent implications What you can say to us about this fact? Have you an useful idea how to try to repeat your experiments using a substrate made (weaved) with different hank of linen yarns ? (…and at same time working with your model…) Link: https://www.shroud.com/pdfs/rogers2.pdf * * * * * * * Here another very little thing: “adhesive tape composition” (…and mass spectroscopy). Colin, What is your evaluation for possible solubility of the adhesive (= part of the tape) in the solvent (Xylene) used? Composition for the adhesive = an epoxy resin ??? Unfortunately I have no past experiences in the field of application of “isotope ratio mass spectrometry” for discrimination and comparison of adhesive tapes….","date":"2015-09-14","mins":"11:35 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210590","author":"piero","post":"3 Furaldehyde Formula: C5 H4 O2 Molecular weight: 96.0841 Mass Spectrum, peaks at: 29 67 (very little), 39 (little) and (great) 97, 98 Link: http://webbook.nist.gov/cgi/cbook.cgi?ID=C498602&Units=SI&Mask=FFFFFF — — Furfural, peaks at: 29 (little), 39 (and 38) , 67 (very little), 97 and 98 (great) link: http://webbook.nist.gov/cgi/cbook.cgi?ID=C98011&Mask=200.","date":"2015-09-17","mins":"11:44 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210643","author":"piero","post":"I have found a different kind of “example” about the 55 69 83 97 peaks and then this is a bit different with respect the presumed (and strange) “polyethylene olygomers”. It’s “The mass spectrum of methyl 7 methyl hexadec 6 enoate (from a jellyfish in this instance, but often present in fish from warm seas). But (in my opinion) “Branched Chain Monoenoic Fatty Acids” have nothing to do with the interpretation of mass spectroscopy for the sample we have to check. Link: http://lipidlibrary.aocs.org/content.cfm?Item Number=39487 In any case this kind of search in the field of mass spectrometry is only a waste of time… Continuing on this way, I think that I can only lose in this “game of individuation” for mass spectroscopy!.","date":"2015-09-18","mins":"9:16 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210792","author":"piero","post":"Here a vague idea about the peak at 69. Do you know what is Squalene? Squalene mass spectrum shows a peak at 69 (and other [more little] peaks at: 81, 41 and 95)… Links: http://webbook.nist.gov/cgi/cbook.cgi?ID=C111024&Mask=200 https://en.wikipedia.org/wiki/Squalene Sebum (and the Shroud taken by hands during the past): >Sebum, secreted by the sebaceous gland in humans, is primarily composed of triglycerides (~41%), wax esters (~26%), squalene (~12%), and free fatty acids (~16%). The composition of sebum varies across species. Wax esters, like squalene, are unique to sebum and not produced anywhere else in the body. Sapienic acid is a sebum fatty acid that is unique to humans, and is implicated in the development of acne. >Sebum is odorless, but its breakdown by bacteria can produce strong odors. … Link: https://en.wikipedia.org/wiki/Sebaceous gland.","date":"2015-09-20","mins":"8:28 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210868","author":"piero","post":"I want to add that in the book by Ray Rogers there is a comparative table about the sebaceous excretions of Homo Sapiens (= comparisons with respect other animal species)… — — I believe that isoprenic fragments ( C5 H9) can also be found in mas spectra of natural gum (natural gum is a polymer based on isoprene units). In other words the C5 H9 fragment (prenyl) is located at m/z 69 and this is an interesting fact… Do you remember the past “identification”? m/z = 69 Possible associated group = C5 H9 Possible inference = “Some hydrocarbons” — — If we are able to work in the field of advanced microscopy, perhaps we can think to improve the investigations about the issue (= presumed presence of natural gum) starting from the other possible presence of mesophilic rubber degrading bacteria G. Polyisoprenivorans (= a rubber degrading actinomycete) … Reference : Case Report. A rubber degrading organism growing from a human body by Mohit Gupta, Deepali Prasad, Harshit S. Khara, David Alcid International Journal of Infectious Diseases Volume 14, Issue 1, January 2010, Pages e75–e76 Link: http://www.sciencedirect.com/science/article/pii/S1201971209001416 Another reference: Gordonia polyisoprenivorans sp. Nov., a rubber degrading actinomycete isolated from an automobile tyre. By A. Linos, A. Steinbuchel, C. Sproer, R.M. Kroppenstedt Int J Syst Bacteriol, 49 (1999), pp. 1785–1791 — — Other words about the “rubber degrading bacteria G. Polyisoprenivorans”: >Gummi abbauende Mikroorganismen können quantitativ an verschiedene praxisrelevante Gummimaterialien anheften. >Zum ersten Mal konnten Gummi abbauende Mikroorganismen (Gordonia westfalica, Gordonia polyisoprenivorans) mit dem AFM visualisiert werden, die an verschiedene Gummimaterialien angeheftet waren. Link: http://www.analytik news.de/Dissertation/Brill Florian H. H..html Here a very rough translation: >Rubber degrading microorganisms can attach to quantitatively different practice oriented rubber materials. >For the first time rubber was degrading microorganisms (Gordonia westfalica Gordonia polyisoprenivorans) are visualized with the AFM, which were attached to various rubber materials. — — But all this talk about the possible presence of natural gum (…and inherent degrading microorganisms) is just pure speculation!.","date":"2015-09-21","mins":"10:05 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210369","author":"piero","post":"If I am not mistaken, the abundances are not in the same proportions. For example: see the comparison for the peak 69 in Fig. The “preview” of Bella Garlaschelli Samperi and the same peak in the other Fig. 2 (in the same “TCA preview” Bella Garlaschelli). Y axis and relative abundance: >…Signal intensity may be dependent on many factors, especially the nature of the molecules being analyzed and how they ionize. >The efficiency of ionization varies from molecule to molecule and from ion source to ion source. … (Link: https://en.wikipedia.org/wiki/Mass spectrum ) Bella wrote: >…It happens that “oligomers from polyethylene” show a spectra which peaks differ by 14 atomic mass units. >The parks at M=96 it is not furfural, but just one of these peak. >Therefore, the two spectra in Rogers paper differ only by the peaks of the contaminant. >I believe it is not necessary to explain that plastic bags were not so common in the Middle Age … etc. … etc. … Unfortunately, until now, I have not found the useful spectra (mass spectroscopy) and (also) Bella has not yet answered to me (on “polyethylene olygomers” …or … on solvated “tape adhesive” or fatty acid [coming from the people who were holding the Shroud during exhibitions/ostensions]???) using proper diagrams for inherent comparisons… So I should only indicate the famous proposition n. 7 of Tractatus Logico Philosophicus, by Wittgenstein: “Whereof one cannot speak, thereof one must be silent.” („Wovon man nicht sprechen kann, darüber muss man schweigen.”)… — — — Yesterday afternoon I have followed the lecture on “crop circles” by Paolo Attivissimo (an italian journalist). After depicting the history of crop circles (see also: the past interesting role played by Dough Bower and Dave Chorley…), he claimed to have participated (during this year 2015) in a construction of a big crop circle near Turin… This in the context of a three day outline for the presentation of the museum “Falseum” (http://www.falseum.it/it/) which I have not visited because I had no more time … Here some particular conjectures: Was Raymond Rogers an absent minded person (because he was a suffering person, with his cancer), a liar, a trickster or (perhaps) a sort of “circlemaker” ?.","date":"2015-09-14","mins":"10:44 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210373","author":"piero","post":"But … Here I want to better clarify the presumed problem: “adhesives” in adhesive tapes …!.","date":"2015-09-14","mins":"11:38 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210448","author":"piero","post":"Colin, your particular “chemical sociological analysis” seems to be interesting (link: https://it.wikipedia.org/wiki/Groupthink and then see also: https://en.wikipedia.org/wiki/Deindividuation). But not decisive as regards the solution of the problem of mass spectroscopy on alleged “oligomers of polyethylene” … The point to clarify seems to be the determination about the chemical chain: “…a long chain aliphatic” ?? (Is really the only key to solve the question?) But … How long is this CH2 chain? Here I speak about the idea to measure the lenght of that methylene chain ( CH2 ) starting from the key number 14 (=12+2= one Carbon and two Hydrogen atoms)… Other questions: – Please, observe the peak 69 in “Shroud image fiber”, this peak seems not to have the same higher (see also: “Y axis and relative abundance”) in “Raes sample fiber”… – The higher of the peak 131 is not the same (because it’s more high in “Shroud image fiber”). – In the mass spectrometric diagram of “Shroud image fiber” are present the peaks: 119(?),126(?), 169, 181 and 219. Instead there are not these peaks in the mass spectrometric diagram of “Raes sample fiber”… So I think that a computer analysis of mass spectrometries (or the trained eye of an expert “mass spectroscopy analyst”) would save us time in order to solve the “little enigma”….","date":"2015-09-15","mins":"9:34 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-88731","author":"piero","post":"I have read the new book by Fanti (and Malfi) … and then … I have read the words about the possible new way (an “easy method” …) based on linen fibrils roughness (= beated linen fibrils, an ancient method to treat the linen material versus modern treatments) … (and the book indicated a message sent by Dr. Botella, Univ. Of Regensburg, in November 2007). Try to see something about the following words : “growth nodes” or “kink bands” … and the possible controls (= studies present on the Web). Here the inherent claim : perhaps we can improve our knowledges using CLSM (= Laser scanning confocal microscopy) and AFM controls … ———————– Here a reference about CLSM : Characteristics of laser scanning confocal microscopes for surface texture measurements Jariya Buajarern, Chu Shik Kang and Jae Wan Kim Jariya Buajarern et al 2014 Surf. Topogr.: Metrol. Prop. 2 014003. Doi:10.1088/2051 672 X/2/1/014003 Received 11 August 2013, revised 23 September 2013, accepted for publication 7 October 2013. Published 23 December 2013. © 2014 IOP Publishing Ltd Abstract >Due to the complexity of the surface topography, accurate surface characterization requires three dimensional (3 D) surface measurements. Confocal laser scanning microscopy (CLSM) is a non destructive and versatile technique for quantifying 3 D surfaces. The response of measurement quality to variations in CLSM hardware settings and specimen properties has been investigated. >Through these investigations, certain criteria have been developed to select the optimal CLSM settings to minimize image noise, maximize contrast and resolution for reliable and accurate 3 D surface measurements. The surface measurement results were then compared with those obtained from the stylus instrument, phase shifting interferometer (PSI) and the coherence scanning interferometer (CSI). With the optimal hardware settings, CLS Ms proved to be an appropriate instrument for measuring moderately rough to rough surfaces regardless of surface reflectivity or surface finish. >It exhibits versatility for measuring surfaces of complex geometry, which is needed in the engineering field. Moreover, preparation of the sample is not necessary. — — What is your idea ? I hope to read a comment ….","date":"2014-03-14","mins":"10:59 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"id":"comment-74109","author":"piero","post":"Perhaps the result from the 14 C test by Bella and Azzi is right and then this “Titulus” is only a replica of authentic relic. Instead other researchers claim that … the entire area was irradiated ! See the presumed sources for that natural radiations : from the piezonuclear reactions and the inherent neutron irradiations or … from the powerful thunderbolts, etc. (and then the obvious claim is : “there was an alteration into the matter due these interactions”). In any case, in the past, prof. Luigi Campanella indicated the interesting systems to work with wood samples. Do you remember ? It was interesting to read these methods. But I believe we have to avoid all the destructive analyses. In my opinion, if you work with the proper SP Ms controls you can obtain the interesting data avoiding the big destructions. In any case I am curious … but not fanatic … about that old wood. — — B.T.W. : Where is the blood on that presumed false relic ? I see nothing around the researches about that precious liquid … There is no dry spot (blood) on that wood. Are we sure for that absence ? Where is the proof ?.","date":"2014-01-22","mins":"1:52 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","title":"Titulus Crucis:  A Fascinating Guest Posting by O.K."}]
