[{"id":"comment-211897","author":"piero","post":"I have just seen that Lucotte (= Exploration of the Face of the Turin Shroud. Pollens Studied by SEM Analysis) indicated Max Frei and Hugh Farey … But Lucotte is an expert of “molecular anthropology” (…) and then he is not a true expert in the field of pollen. In that paper Dr. Lucotte thanked again Dr Thierry Derouin, Director of the “Palynological Unit at the Muséum d’Histoire Naturelle de Paris”… This personage was already thanked in the paper: “Optical and chemical characteristics of the mineral particles found on the face of the Turin Shroud” for his facilities to use the Zeiss photomicroscope “and for his help to study the sample in petrographic microscopy”… Following what wrote Lucotte, Frei seems had wrongly estimated pollen distribution density in his work. In any case I have some doubt about the exact amount of pollen in the estimation… So… We can try to see, with simple calculation, what happens starting from the new data (triangle area = 0.42 mm sqared) indicated by Lucotte Here the simplest calculations about the presumed triangle surface, starting from what Lucotte wrote: >…a small (1.36 mm height, 614 μm wide) sticky tape triangle at the surface of which portions of fibers, spores, pollen grains and some plaques of organic matter… So, this is: 1.36 mm multiplied by 0.614 mm = 0.835 squared mm, but (because it’s a triangle area) we have to divide by 2 = 0.418 Square Millimeters. (=0.42 mm squared. Lucotte was exact!) Then the estimation is: ten pollen in near 0.5 mm Square Millimeters, 0.42 Square Millimeters to be more exact. And this is equal to: 2380 pollen per square centimeters!!! Then, here, Lucotte seems to be wrong, because he (in his new study) has estimated a rough amount of twenty pollen for cm squared. (instead Max Frei estimated [only an oral report] only “about one pollen grain per square centimetre of tape”). Am I wrong in my remark? — — Further remark: Are we sure about the conservation conditions for that adhesive tape? — — Thaks for your kindly attention. Links: http://www.scirp.org/journal/Paper Information.aspx?Paper ID=60135 http://www.academicjournals.org/article/article1380797812 Lucotte.pdf https://www.shroud.com/pdfs/n79part8.pdf — — — In any case (as we have just seen) we have to deal with particular things, very far from serious works of statistical estimation… Here, as a possible key (in order to try to understand the “pollen puzzle” …or only aa a “material to discuss”!), there is a past message by “OK” (dated: November 6, 2013 at 2:50 pm): >…Hugh: It is interesting, is it not, that after vacuuming approximately 10 000 cm2 (yes I’m guessing – how big is it?) of the tunic of Argenteuil, 115 pollen grains were found. >Marion & Lucotte write that more pollens were found, but approximately 2/3 of them are damaged. 115 were identified under SEM. … — — Link: https://shroudstory.com/2013/11/06/of similarities the tunic of argenteuil and the shroud of turin/ — — — I think we’ll can be more serious about pollen investigations!!..","date":"2015-10-06","mins":"11:21 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211900","author":"piero","post":"I am curious about the pollen tube… For example: “The pollen tube: a soft shell with a hard core” The Plant Journal Volume 73, Issue 4, pages 617–627, February 2013.","date":"2015-10-06","mins":"11:47 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211968","author":"piero","post":"I tried to find something in order to solve a curious and particular problem: Where we can find useful data about “Measurement of Calcium isotope ratio in pollen”? …But, unfortunately, I have not yet solved this problem… Here a vague reference: Fractionation of stable calcium isotopes in tissues of date palm trees I. Platzner and N. Degani Biological Mass Spectrometry Volume 19, Issue 13, pages 822–824, 20 December 1990. Abstract >Calcium is an important element in animal and plant tissues, but nothing is known with regard to the fractionation of its stable isotopes in biological systems. >In this work the results of calcium isotope fractionation in date palms are reported. >The palm is a dioecious tree, and thus its pollen is easily collected. >A comparison was made between leaves and pollen from two trees that are approximately 70 km apart, growing in different geographical locations. >Fruit pulp and seeds from the same fruit were also compared. >The results of this work imply preferential depletion of the heavy calcium isotopes in tissues associated with reproduction. Link: http://onlinelibrary.wiley.com/doi/10.1002/bms.1200191306/abstract Have you an useful hint?.","date":"2015-10-07","mins":"8:32 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212043","author":"piero","post":"I hope you will forgive me for my previous work on this topic “Sources of DNA on the Shroud of Turin” since they were quite out of focus … At the end of the Abstract (of “Uncovering the sources of DNA found on the Turin Shroud”), published online (October 5, 2015), we can read: “… Furthermore the results raise the possibility of an Indian manufacture of the linen cloth.” Instead the book (At least, in the Italian edition that I bought in date: March 8, 2014… Then, see the Chapter 8: “Novità e futuri sviluppi” = “Novelties and future developments” …) of Prof. Eng. Giulio Fanti and his pupil Pierandrea Malfi didn’t indicate that particular possibility. — — Yes. >…At the time of Jesus’ birth, gold, frankincense and myrrh were traditional gifts given to royalty in the Middle East, says Fred Horton, John T. Albritton Professor of the Bible at Wake Forest. … >…Gold, frankincense and myrrh were very highly valued in Middle Eastern culture at that time. … >…Myrrh was far more rare in the era of Jesus’ birth. … Link: http://www.wfu.edu/wfunews/2000/120400g.htm But this vague hint doesn’t constitute a solid proof about the manufacture of the Shroud… Perhaps the analytical expertise of Marco Leona, director of the scientific section of Metropolitan Museum of Art (NY) can tell us something on that interesting argument. — — — Dan, you are living “not too far” from that Museum of NY … and then (perhaps) you can do something of concrete in this direction. What is your opinion about Marco Leona and his Raman Spectroscopy expertise? See for example the investigations on “madder species” (but “on wool fibers”!): “Surface enhanced Raman spectroscopy of various madder species on wool fibers: the role of pseudopurpurin in the interpretation of the spectra” Diana C. Rambaldi, Federica Pozzi, Nobuko Shibayama, Marco Leona and Frank D. Preusser Article first published online: 26 MAY 2015 Journal of Raman Spectroscopy Link: http://onlinelibrary.wiley.com/doi/10.1002/jrs.4726/abstract What is your answer?.","date":"2015-10-08","mins":"9:31 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212046","author":"piero","post":"Errata corrige: >I hope you will forgive me for my previous messages Instead of: >I hope you will forgive me for my previous work — — — Here the complete “Abstract” about the work by Marco Leona, Diana C. Rambaldi and other researchers: >Madder has been used as a textile dye and pigment in works of art since antiquity. >Madder dyes from different botanical species are characterized by different series of anthraquinone derivatives. >The occurrence of one or more of these compounds in various relative amounts may provide a useful indication of the plant species used to obtain the dye. In this work, surface enhanced Raman spectroscopy (SERS) was applied to the analysis of textile fibers dyed with madder from two different botanical species, Oldenlandia umbellata L. And Rubia tinctorum L. >The resulting SERS spectra were interpreted in light of the actual composition of the madder dyes as determined by high performance liquid chromatography. Interestingly, the SERS spectra were found to exhibit very distinctive spectral features depending on the different anthraquinone derivatives present in the dyes. In particular, the SERS spectrum of O. Umbellata L. Was found to match the spectrum of alizarin, while the SERS spectrum of R. Tinctorum L. Was surprisingly dominated by signals due to the less studied anthraquinone compound pseudopurpurin. >With this study, we demonstrate that SERS spectra may offer valuable information regarding the major coloring constituents present in different madder species. >Moreover, our work shows that not only can SERS be used successfully to differentiate among closely related anthraquinone derivatives, but also that this technique is particularly suitable for the detection of pseudopurpurin, leading to the identification of this compound in a number of works of art. Copyright © 2015 John Wiley & Sons, Ltd. — — I want to add that I don’t believe this interesting (but possible misleading …or mad?!?) “problem about investigation on madder” (this also in reference to “the madder dyed Shroud” by Adrie van Hoeven and to the previous words by Louis: “…There is mention of the Harappan (Indus Valley Civilisation) custom of dyeing cloth and there seems to be evidence of dyeing with red madder…”) as the “main solving key” for Turin Shroud Enigma….","date":"2015-10-08","mins":"9:50 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211899","author":"piero","post":"Useful details for eventual absent minded readers (…or only a little bit distracted): 100 mm squared divided by 0.42 mm squared = 238.095 and 238.095 multiplied by 10 = 2380.95 (presumed pollen grains) that, rounded, are: 2380 pollen per square centimeters!!!.","date":"2015-10-06","mins":"11:30 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212060","author":"piero","post":"First of all: Dyeing techniques (I am a technician dyer …): >Distinctive features of Indian textiles include the use of madder dye, which gives a vibrant red, and a consistent range of decorative motifs. >Madder comes from the roots of a herbaceous climbing plant known as ‘chay’. … etc. … Words found under the same link: http://www.vam.ac.uk/content/articles/i/indian textiles introduction/ Yes… But in our time, marked by the emergence of specific techniques (and then, here, I can refer also to the CRISPR technique) is certainly interesting to talk about DNA … Link: http://labiotech.eu/sorry crispr youll have to wait another year to win a nobel prize/ >Even if CRISPR was in the short list to win the prize, this trio’s DNA repairing mechanisms were awarded the Nobel prize in Chemistry (which if we’re honest at Labiotech, did not see coming at all…). >Arguably, one possible reason for this is that Lindahl & co.’s discovery is over 30 years old, whilst the gene editing system CRISPR/Cas9 was only published in 2012. CRISPR is currently occupied in an intense patent war … … >…CRISPR will therefore probably have to wait one (or several) years before their discovery is considered ‘seasoned’ enough to join the Nobel elite. … Link: http://labiotech.eu/nobel prize 2015 dna repairing mechanism keeps alive rewarded/.","date":"2015-10-08","mins":"11:32 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212061","author":"piero","post":">Tomas Lindahl, Paul Modrich and Aziz Sancar won the prize for “mechanistic studies of DNA repair.” >Their work mapped how cells repair deoxyribonucleic acid (DNA) to prevent damaging errors from appearing in genetic information. >In many forms of cancer, one of more of these repair systems is broken. … Link: http://in.reuters.com/article/2015/10/07/nobel prize chemistry id INKCN0 S10 ZS20151007 … And what do we do instead? We (ie: prof. Fanti, until now)…, we were only able to break linen fibers … … or maybe get to ramble on the stories of India … Luckily there is a picture of what can happen to the Face (with emissions from the mouth and nose) of a living person covered by cloth or a dead person without the use of the Sudarium of Oviedio ….","date":"2015-10-08","mins":"11:41 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212062","author":"piero","post":"Errata corrige: >of Oviedo … Instead of: >of Oviedio … Please, oberve the model of the DNA helix that sits on the desk by professor Sara Snogerup Linse, member of the Nobel Assembly… — — Do you know Engineered Zinc finger proteins? See for example: Methods Mol Biol. 2014;1148:89 107. Light inducible gene regulation with engineered zinc finger proteins. Polstein LR, Gersbach CA. Here an excerpt from the abstract: >… This system, Light Inducible Transcription using Engineered Zinc finger proteins (LITEZ), is based on the blue light induced interaction of GIGANTEA and the LOV domain of FKF1 that drives the localization of a transcriptional activator to the DNA binding site of a highly customizable engineered zinc finger protein..","date":"2015-10-08","mins":"11:51 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212063","author":"piero","post":"Errata corrige: >observe Instead of: >oberve !.","date":"2015-10-08","mins":"11:52 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212212","author":"piero","post":"Kelly, Thank you for your contribution… — — I have just found a study: “The genome of flax (Linum usitatissimum) assembled de novo from short shotgun sequence reads.” by Wang Z, Hobson N, Galindo L, Zhu S, and other researchers Plant J. 2012 Nov;72(3):461 73. Epub 2012 Aug 14. © 2012 The Authors. The Plant Journal © 2012 Blackwell Publishing Ltd. Here an excerpt from the Abstract >Flax (Linum usitatissimum) is an ancient crop that is widely cultivated as a source of fiber, oil and medicinally relevant compounds. >To accelerate crop improvement, we performed whole genome shotgun sequencing of the nuclear genome of flax. >Seven paired end libraries ranging in size from 300 bp to 10 kb were sequenced using an Illumina genome analyzer. >A de novo assembly, comprised exclusively of deep coverage (approximately 94× raw, approximately 69× filtered) short sequence reads (44 100 bp), produced a set of scaffolds with N(50) =694 kb, including contigs with N(50)=20.1 kb. >The contig assembly contained 302 Mb of non redundant sequence representing an estimated 81% genome coverage. >Up to 96% of published flax ES Ts aligned to the whole genome shotgun scaffolds. >However, comparisons with independently sequenced BA Cs and fosmids showed some mis assembly of regions at the genome scale. >A total of 43384 protein coding genes were predicted in the whole genome shotgun assembly, and up to 93% of published flax ES Ts, and 86% of A. Thaliana genes aligned to these predicted genes, indicating excellent coverage and accuracy at the gene level. … … etc. … etc. … Links: http://www.ncbi.nlm.nih.gov/pubmed/22757964 http://onlinelibrary.wiley.com/doi/10.1111/j.1365 313 X.2012.05093.x/full >…SOA Pdenovo is a de Bruijn graph based assembly program… Do you know what is a de Bruijn graph? Links: http://ojs.academypublisher.com/index.php/jsw/article/view File/jsw090821602168/9782 https://en.wikipedia.org/wiki/De Bruijn graph http://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6616523 — — — Perhaps Kelly can provide us some additional information about the use of “Whole genome shotgun assembly”… Here two “WGS links”: http://www.genomebiology.com/2015/16/1/26 http://www.illumina.com/applications/cancer/research/cancer dna sequencing/cancer whole genome seq.html Sorry… I am going too far….","date":"2015-10-10","mins":"4:35 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"}]
