[{"id":"comment-181834","author":"piero","post":"Colin, Thank you about your “friendly suggestion”… I appreciate your jokes, but now I tell you: be more serious in your messages!! …And, p Please, read what I wrote below about the issue that we are discussing: ————— “Human blood clotting on linen…” But… Which kind of linen? Preliminar remarks about materials used in the research by Lind and Antonacci. I want to tell a textile story about that research. … Reading the small Table on “Relevant Physical Characteristics of Linens used…” we can see what is the difference with respect what is the Shroud. At p. 33 of the book “La Sindone nella sua struttura tessile” (= “Shroud and its own textile structure”) by Piero Vercelli we can read [inherent data are expressed as “number of threads/cm”] : warp weft 38.6 25.7 = Raes 37.6/38 25.8 = Vial 36 24 = Vercelli 37.5 25 = Vercelli Instead in the paper by Lind and Antonacci : 13 15 = German linen 22 18 = French linen 38.6 26 = Shroud Another very interesting fact is connected with the chemical nature of linen threads used. We can read that “French linen ” was a “bleached material”, but we don’t know what was the exact method used during bleaching… For instance, I remember that P. Vercelli indicated me the use of Chlorite during modern bleaching. Probably this treatment can change the level of capillarity of linen fibrils… In any case they had to be more exact working with experiments. Then I suggest to write the exact treatment (= bleaching, in that case) conditions in order to know more on materials used during experiments… At least we have to do a contact angle experiment in order to know something about the behaviour of linen used (= water and blood absorption). In other words : they were incorrect (and I say that only from a textile point of view and not as silly and insulting remark!) in their experiment. Capillarity, warp and weft threads. In the same book (published in Italy by Effatà, in 2010) P. Vercelli wrote something about the observation about the reddish color that was more deep/intense on the points that evidences wefts which (having less torsion than warp) absorbed in a better manner liquids (fluids) that being in the furrow of drawing (and then protected) have been conserved. Vercelli added that publication of scanning for the reverse side of the Shroud confirmed these hypotheses because wefts are evenly stained and coloration appears more evenly than what results on front side. But here I cannot write more, violating copyrights … Sorry. — — If you want to read sometning about “Wet processing engineering”, here the link: http://en.wikipedia.org/wiki/Wet processing engineering = only few lines about the fact that bleaching improves whiteness by removing natural coloration and remaining trace impurities … …and it is certainly not in this way that you can study in depth! See also: the use of peracetic acid [= PAA], in the modern bleaching processes. PAA is produced industrially by mixing acetic acid with hydrogen peroxide … — — — Oxidizing agents (…unknown 2000 years ago!) and potential (e V): – Ozone 2.07 – PAA 1.81 – Cl O2 1.57 – Na O Cl 1.36 Source http://www.textiletoday.com.bd/magazine/printable.php?id=293 — — Have you tried to treat linen with fumes of burning sulfur? Perhaps sulfur dioxide (= SO2) could be used in antiquity, but I do not believe in this hypothesis. — — In any case (if I am right) Berthollet was the first to use chlorine to bleach cotton and linen fabrics… — — As you see now I’m limited to the examination of the topic under consideration. Here I don’t talk about advanced analytical techniques (SP Ms = the useful tools to know the truth !)..","date":"2015-01-07","mins":"9:35 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181473","author":"piero","post":"The key materials on the Holy Shroud seem to be blood and cellulose and both have to be controlled in a non destructive manner. Do you agree on that idea? Link for CFM (= Chemical force microscopy): http://en.wikipedia.org/wiki/Chemical force microscopy#Frictional force mapping >CFM has been primarily developed by Charles Lieber at Harvard University in 1994.","date":"2015-01-05","mins":"11:15 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"}]
