[{"id":"comment-215556","author":"piero","post":"Mario Latendresse wrote : >…In which occasion would Geoffroy de Charny receives the Shroud as a gift and due to his war services to king Philippe VI (and most probably from a relic taken from the Sainte Chapelle, documents: inventories of the Sainte Chapelle)? … So… I cannot resist to the temptation to quote “The Shroud of Turin and the Sainte Chapelle of Paris”, a text written by the same person, Mario Latendresse: >In the chronicle of the translation of some of the relics written by Gérard de Saint Quentin en l’Isle, the Mandylion is described as “tabula quedam quam, cum deponeretur Dominus de cruce, ejus facies tetigit” [p. 298, Miller, 1878] (= a board that touched the face of the Lord, when he was laid down from the cross). Link: http://www.sindonology.org/sainte chapelle.shtml Then I am curious to find more robust proofs (than “The sequences De sanctis reliquiis as Sainte Chapelle inventories” by Karen Gould. [In:] Mediaeval Studies [Toronto: Pontifical Institute of mediaeval studies, Bd. 43 (1981), S. 315 341]) about that strange “board that touched the face of the Lord”…! — — — Here another vague bibliographic reference: “Sacre impronte e oggetti non fatti da mano d’uomo nelle religioni. Atti del convegno internazionale, Torino, 18 20 maggio 2010” by Adele Monaci Castagno Università di Torino, 2011 – 323 pages..","date":"2015-12-03","mins":"10:40 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-210988","author":"piero","post":"Perhaps there was something of similar in the thinking of an italian architect: Leonardo Magno (epoch = 1990 1991)… Reference (a publication in Italian language): Il lenzuolo di Giuseppe d’Arimatea e la Sindone di Torino / Leonardo Magno. – [S.l. : s.n.!, 1991. – 95 p. : ill. ; 31 cm.] It was an interesting series of articles published in the journal “ll segno del soprannaturale” (= “The sign of the supernatural”, a magazine printed in Udine)..","date":"2015-09-23","mins":"9:26 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-210874","author":"piero","post":"An “almost invisible stitching” seem to be an interesting clue, but it’s not a proof… In my opinion (…basing only on that argument) you cannot win your own cause in a sort of “procedural debate of court”. Instead basing on this alleged proof and then showing proper (advanced) microscopical analyses you can hope to win. But if you (and I point my finger on this hypothetical case only as a possible example of “analytical inexperience”, a fact that can happen…) will want to intend as “advanced microscopy” mainly the controls with ATR FTIR and therefore you’ll use only these ATR FTIR checks, then I think I’ll stay with all my doubts … …because (for example): you haven’t yet answered to me about the problem of “ATR FTIR penetration depth” linked to simple observations (of mine) around the fact of different dimensions for diameters of linen fibrils (= material to control) and different lenghts of light penetration into the linen samples (in other words: this was a discourse on the method used for the calibration accuracy […but, unfortunately, these important details did not appear in the popular book by Professor Fanti])..","date":"2015-09-21","mins":"11:11 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-210876","author":"piero","post":"I try to change our perspective. Perhaps the key can also reside in how was cutted the strip… What is your idea on that argument? Is it possible to know more on that question? We can start from the observation on a modern cutting. In 1988 Giovanni Riggi, had in fact cut a strip….","date":"2015-09-21","mins":"11:35 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-210877","author":"piero","post":"Here what I have found now: the “wimpel”. >A wimpel (Yiddish: ווימפל‎, from German, “cloth,” derived from Old German, bewimfen, meaning “to cover up” or “conceal”) is a long, linen sash used as a binding for the Sefer Torah by Jews of Germanic (Yekke) origin. >It is made from the cloth used to swaddle a baby boy at his bris milah, uniting the communal world of the synagogue with the individual’s own life cycle … >…The wimpel is an offshoot of a common Jewish practice. >In the times of the Tannaim, all Torah scrolls were wrapped only with a cloth, known in Hebrew as a “mappah,” or in German, a “wimpel.”… Link: https://en.wikipedia.org/wiki/Wimpel Is that cloth an adequate analogy for the strip? I don’t know. >The wimpel, after being placed on the Torah, would remain there until the next reading when it would be removed and remain in the synagogue’s collection. Some synagogues still maintain a wimpel collection. Links: http://www.chabad.org/library/article cdo/aid/683154/jewish/Bringing Back the Wimpel.htm https://en.wikipedia.org/wiki/Tannaim * * * * * * Barrie, have you an answer?.","date":"2015-09-21","mins":"11:52 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-200525","author":"piero","post":"Although I could not agree with everything says Nicolotti here I am forced to remember what wrote Andrea Nicolotti (November 30, 2014 at 8:08 am): >Oskar, I do not want to start discussions with you, but the letter of Theodore Angelus is a forgery, and does not make the name of Otto nor tell something about shrouds with images or shrouds in Besançon, and the 18th century MS 826, as we know, was written 500 years after, and it is a falsification of medieval sources, as Vignon, Zaccone and other know and explained many years ago. … Link: https://shroudstory.com/2014/11/27/the makeshift body bag of turin/ * * * * * * * See also on this blog: “Dan Scavone Responds to an Earlier Charles Freeman’s Article” Link: https://shroudstory.com/2014/10/28/dan scavone responds to charles freemans article/ November 1, 2014 at 3:57 pm Nicolotti: >… All the Chartularium Culisanense, obviously, is a forgery … — — — So: where we can finish with that story?.","date":"2015-05-29","mins":"9:55 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-172383","author":"piero","post":"I am still very curious regarding the possible link with the particular “numismatic dating” of engineer Giulio Fanti. It seems that everyone (apart our friend Barrie Schwortz!) want to forget or ignore this type of dating. … and then: Why? Perhaps it would be appropriate to include a few lines about the issue (but respecting the copyrights of Prof. Giulio Fanti!.","date":"2014-11-21","mins":"9:52 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-172384","author":"piero","post":"… and then … maybe … some say we should do all this for free….","date":"2014-11-21","mins":"9:59 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-6850","author":"piero","post":"Until now I have only read your answer. So… I am waiting for your “King Neptune”… Probably your future “Shroud Legoland” will offer several “new entries”..","date":"2016-01-25","mins":"5:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6833","author":"piero","post":"Colin, I ask to you a favor: Are you able to do an nteresting (and “simple”) new work on a face (not on hands)? I would be curious to see what are the exact differences (= different geometry = different immage): with the wooden (…or plastic) framework and without the framework… So… I wait….","date":"2016-01-23","mins":"2:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6848","author":"piero","post":"Yes… the technique is exceedingly simple. — — Unfortunately I am too confabulatory and, moreover, I cannot work in my personal Lab! My feeble points, my faults: – I must remember to avoid the humbling approach to your works… – I have to admit that I don’t find the time to deepen all your huge amount of works. You are right if you want to avoid the production of hugger mugger content in your blog, a situation generated from all the possible strange requests. But it would be wonderful if you’ll write a positive answer about my previous request. It’s my belief that I need somebody who works, who can build what I previously indicated. In the past (several years ago) I asked to a Lab in order to see what we can observe (problem = gaseous diffusion and image geometry) from linen clothes treated with Lead Acetate submitted to the H2 S gas (emitted, for example, from an object). This “little work” was indicated useful model to use in order to improve the knowledges. But I didn’t received a positive answer. Here few lines (an, obviously, this is only for the readers. Not for you!) about the “Lead Acetate paper” test: >This test is used for the detection of hydrogen sulphide. >Sulphides occur in the processing of raw oil and can be found in gas, exhaust fumes and sewers. >As sulphides can be toxic even in low concentrations, critical points are checked for the presence of such gases. Sulphide containing solutions will also give a positive result using this test paper. >The test with lead acetate paper has been almost universally used in gas testing, and it seems to be the one best adapted for that purpose. Clearly this “old way” is very different with respect your “flour imprint” and then was only a rough attempt to create an “useful model” for the alleged “cadaveric emissions”. In any case this is the key issue to be explored: What should be the total amount of cadaveric emissions to get a picture like that of the Shroud? Maybe a mixed mechanism, multifactorial, can be much more realistic. Here I do not want to disturb too who use the electronic nose (…and the possible statistics related to the measures done in morgues). So… I hope you can also try to study (after the idea of a particular wooden framework to use in order to improve the area of the Face) the issue of the possible interactions: “flour imprint” with “gaseous emissions” … In any case, I preserve all my doubts about the possibility to obtain a good imitation about that ancient hugely successful Image … — — As usual, I wait for your next patient answer about my purposals/queries..","date":"2016-01-25","mins":"4:00 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6819","author":"piero","post":"Yesterday I wrote: >Have you tried to add a framework (see also: the strange U shaped sign on the Shroud) to sustain / to support (in some manner) the cloth? I think you have understood that I referred to the subject similar to the presumed “two U shaped boxes” indicated by Marion and Courage (see also, for example, what wrote Mark Guscin on this subject: “The “Inscriptions” on the Shroud”, BSTS Newsletter, November 1999). Altough one perhaps cannot agree with Marion and Courage (regarding the presumed writings), the “U shaped sign(s)” seems to still be an interesting open argument. Am I wrong? So… Since you are the proprietary of your blog and you have disregared the argument, then I think is a real waste of time the idea to discuss (= I do not want to invade your blog with my arguments) with you about the “presumed U shaped sign” that (in my opinion) is present on linen cloth. In any case, I hope you will forgive me if I take this opportunity to ask: Have you an interesting objection against the “U shaped sign”? — — — A further speculation can be connected with the famous “Fayum portraits”… Unfortunately there is no record of such particular objects (= wooden frameworks used to improve the imprint of the Face…) as being used in the ancient burials. Perhaps they failed to obtain a decent image (perhaps like in your failed attempt to obtain a decent face with your doll) and then they turned their choice to the true picture (a portrait/painting) of the deceased persons… Until now this can be only a fairy tale because no archaeological parallel can be adduced to confirm the presumed ancient use of frameworks (for faces) in burials… — — — Sorry… I have found another “Colin Berry” and he is Professor of Cardiology and Imaging (Institute of Cardiovascular and Medical Sciences)… Is that professor perhaps a relative of yours?.","date":"2016-01-22","mins":"4:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6814","author":"piero","post":"The image of the head “pear shaped” (therefore with different geometry with respect the Face of the Shroud) is really curious … and the cheeeks seem to be too great. Have you tried to add a framework (see also: the strange U shaped sign on the Shroud) to sustain/ tosupport (in some manner) the cloth? But… what if you then add hair to the head of the doll?.","date":"2016-01-21","mins":"5:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6812","author":"piero","post":"Several years ago I had the opportunity to follow the special theory of lightning (a thunderbolt !!?!)… This lightning would have caused the fire, and according to some speculations even more daring was the cause of the radiocarbonic rejuvenation … (What do you think?). But I never saw a careful analysis about the Fire of 1532: the exact ignition origin, ignition time and flame spread (perhaps from a more exact visual inspection we can guess something)… Flame spread : see also the top layers of the cloth… — — First of all we have to remember that flame retardancy is measured by the amount of oxygen needed to support combustion (= Limiting Oxygen Index or LOI31). Do you know the “Critical Oxygen Index Apparatus”? >…To determine the minimum percentage of Oxygen required to just support flamming combustion of a material at Room Temperature in FTA mode or at a Higher Temperature (up to 400`C) in HFTA mode. … … >…Test applicable for wide range of materials such as Polymers, Cables, Textiles, … etc. … etc. … Links: http://www.saassociates.com/criticaloxygen.html http://www.saassociates.com/products.html — — — Have you read the article by Hugh Farey? Here a further information about “hot iron” (…because a magnet was used to ascertain that the temperature was at least 770°C…): >…In the periodic table of elements only Fe, Co and Ni are ferromagnetic at and above room temperature. As ferromagnetic materials are heated then the thermal agitation of the atoms means that the degree of alignment of the atomic magnetic moments decreases and hence the saturation magnetisation also decreases. Eventually the thermal agitation becomes so great that the material becomes paramagnetic; the temperature of this transition is the Curie temperature, TC (Fe: TC =770°C, Co: TC =1131°C and Ni: TC =358°C). Above TC then the susceptibility varies according to the Curie Weiss law. … Link: http://www.gitam.edu/eresource/Engg Phys/semester 2/magnetic/types.htm.","date":"2016-01-21","mins":"4:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-144551","author":"piero","post":"It occurred to me that you have not considered Phil Dayvault. We have already seen that he is a “good player”. I have not forgotten this name because I saw him in Argenteuil, France (several years ago …) … — — I remember that Diana Fullbright (= “Were sixth century natural catastrophes factors in the transfer of relics from Palestine ?” IWSAI 2010) agreed about the lack of historical truth about the legend of Abgar. But, there is another argument to consider… Here the question : What is your opinion about the Tile/Keramion indicated by Phil Dayvault ? Is that repert (= a mosaic depicting the Face of Christ) compatible with the Antioch’s scenario indicated us by Jack Markwardt ? — — The Shroud scholar Phil Dayvault and the Face on a strange mosaic were already discussed in this blog. See : – Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin, April 21, 2014 – More on the ISA Tile and the “Prince of Peace”, April 22, 2014 and there is also to take into account what daveb (April 23, 2014 at 4:31 am) wrote : > … the evidence is circumstantial and must be considered. It was unearthed in Edessa, the centre of the cult of the mandylion and its home from 540 AD to 944 AD. Syriac monks carried copies of the mandylion throughout the Christian Middle East. I would have to agree with Louis, that it has quite a striking resemblance to the icon now at Kiev formerly at St Cathenine’s, Sinai. Both Wilson and Guscin are expert art critics and have extensive experience in surveying very many representations of the mandylion. They assign the mosaic to 550 650 AD; as such it would have been among some of the earliest copies. Have your the time to look (another time) into the paper by Phil (the former FBI Special Agent) ? Look at the “ancient blackborad” (= the tile) … Perhaps both patways are compatible : Antioch and Edessa… — — I would be grateful if you would send an early reply..","date":"2014-08-18","mins":"9:30 am","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","title":"Jack Markwardt’s Antioch Theory"},{"id":"comment-144562","author":"piero","post":"Errata corrige: “both pathways are compatible” instead of “both patways are compatible” I beg your pardon… — — — H i s t o r y. >Peter (“Rocky”) operated out of Antioch from AD 47 54 and was the first bishop of that city, and it was there that the disciples were first called “Christians.” >The gentile Christians took refuge there until things cooled down in Jerusalem. (And there were disputes between them and the Jewish Christians who had remained in Jerusalem.) Things never did cool down, and Jerusalem was destroyed by Titus in AD 70 and the Jewish Christians were scattered. >Titus took some figures of cherubim from the Temple and mounted them on the South Gate of Antioch. The gate therefore became known as the Gate of the Cherubim, and the adjoining district, called “the Cherubim,” encompassing the old Jewish Quarter (the Kerateion), was likely the place where the refugees from Jerusalem had settled. … link: http://www.freerepublic.com/focus/chat/3054879/posts — — Here another link: http://antioch on the orontes.blogspot.it/2012/09/the cherubim gate and carob trees.htm Antioch – The Queen of the East … http://libaniusredux.blogspot.it/2008/12/cherubim gate.html.","date":"2014-08-18","mins":"10:47 am","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","title":"Jack Markwardt’s Antioch Theory"},{"id":"comment-171403","author":"piero","post":"Having made mistakes, I was a bit ‘wrong in my summary of the case. So … I apologize for my previous mistakes in English. — — In the book (2014) by Giulio Fanti the Byzantine coins of Justinian II of 692 695 were reevaluated to better understand the influence of the Shroud image. Prof. Eng. G. Fanti in his own book used nose/eyes ratio… … and then Barrie Schwortz rejected “Freeman’s claims” and indicated the numismatic proof about the early coins (= byzantine coins, IMO). See also in this blog : “More: Two Coins, Two Lines, Two Questions” (February 23, 2011) Link: https://shroudstory.com/2011/02/23/more two coins two lines two questions/ — — Now I hope you understand better what I mentioned in my previous intervention … B.T.W.: Do you know Craniofacial anthropometry (= the craniofacial anthropometrical parameters and indices) and Applied Statistics?.","date":"2014-11-15","mins":"9:49 am","url":"https://shroudstory.com/2014/11/13/over-at-history-todays-blog-space/","cat":"history","title":"Over at History Today’s blog space"},{"id":"comment-214194","author":"piero","post":"Now I want to drift… I want to depart somewhat from the main theme (the Holy Tunic of Argenteuil): Do you know what is DRIF Ts (= Diffuse Reflectance Fourier Transform spectrometry) ? I have found an old reference : Michael P. Fuller and Peter R. Griffiths, “Infrared Microsampling by Diffuse Reflectance Fourier Transform Spectrometry” Appl. Spectrosc. 34, 533 539 (1980) Links: http://pubs.acs.org/doi/abs/10.1021/ba 1993 0236.ch013 https://en.wikipedia.org/wiki/Diffuse reflectance infrared fourier transform http://proxy.osapublishing.org/as/abstract.cfm?uri=as 34 5 533 IMHO this technique can help us learn something about fragmented samples and dusts (see for example the controversial debate around the materials taken away from the cloth [= vacuumed dusts] from Giovanni Riggi, in the past. And see also what then Eng. G. Fanti did with his controls). I do not think this non destructive technique has been used (or suggested) by Marion for the Holy Tunic, who was a well known expert in optical field….","date":"2015-11-04","mins":"10:09 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-171369","author":"piero","post":"I have read that Barrie Schwortz (dismitting “Freeman’s claims”) invoked the numismatic proof about the early coins (and an interesting “numismatic dating” was well illustrated by prof. Eng. G. Fanti in her own book …) … So … Now I ask: What is your opinion about the numismatic proof / “numismatic dating”? Isn’t it a strong stone against the strange new theory published in the magazine “History Today” ? In other words: What is the weight (on the “Authenticity Balance”) for the numismatic dating? I wait for your answers about an intelligent numismatic dating. Have you considered the frontal facial proportions ? For example : Eng. Giulio Fanti worked with nos/eyes ratios….","date":"2014-11-15","mins":"6:17 am","url":"https://shroudstory.com/2014/11/13/over-at-history-todays-blog-space/","cat":"history","title":"Over at History Today’s blog space"},{"id":"comment-142977","author":"piero","post":"Under the address: http://www.dailymail.co.uk/news/article 1264150/Hitler plot steal Turin Shroud thwarted Vatican.html You can read : >Adolf Hitler wanted to steal the Turin Shroud during World War II, an Italian monk has claimed. But the Vatican helped hide the cloth relic, on which is scorched the image of Christ’s face, in a rural monastery to keep it out of the clutches of the Fuhrer. … … That wartime revelation emerged in an interview Father Andrea Cardin, librarian of the Montevergine abbey, gave in an issue of Italian magazine “Diva e Donna”… — — It seems to me that we are dealing with speculations. See also the stories about the German atomic bomb … Links: http://en.wikipedia.org/wiki/Hitlers Bombe http://en.wikipedia.org/wiki/German nuclear energy project — — — Trying to get back to today’s reality then here is what I can see : If I am right the AFM technique was discovered in 1988 (see: Binning, Quate,Gerber) … Perhaps the radiocarbon test was an attempt to divert attention from the truly decisive techniques… So … What do you think about this particular vision of the facts?.","date":"2014-08-08","mins":"10:47 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","title":"Revised: The Day the Shroud Foiled Hitler"},{"id":"comment-214195","author":"piero","post":"Errata corrige: >I do not think this non destructive technique has been used (or suggested to use on that ancient Tunic made of wool) by prof. Marion (who was a well known expert in Optical field…) for the Holy Tunic. Instead of: >I do not think this non destructive technique has been used (or suggested) by Marion for the Holy Tunic, who was a well known expert in optical field….","date":"2015-11-04","mins":"10:13 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214197","author":"piero","post":"Here a generic example (about ATR FTIR and DRIFT) taken from: “Explosives Detection: A Challenge for Physical Chemistry” Annual Review of Physical Chemistry Vol. 49: 203 232 (Volume publication date October 1998) by Jeffrey I. Steinfeld (Department of Chemistry, Massachusetts Institute of Technology) and Jody Wormhoudt (Aerodyne Research Inc.). >… important application of IR spectrometry to … (here an omitted part, sorry) >… is the use of techniques such as diffuse reflectance IR FT (DRIFT) or attenuated total reflectance to measure adsorption, decomposition, and diffusion kinetics of species such … … etc. … Link: http://www.annualreviews.org/doi/full/10.1146/annurev.physchem.49.1.203 — — — That ancient tunic in tatters seems to suggest us the idea of a person (= Jesus Christ!) hit by a strong blast …. Or not?.","date":"2015-11-04","mins":"10:54 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214252","author":"piero","post":"Although I am interested in the use of ATR FTIR and AFM in order to investigate the material (and the ATR FTIR technique permits a penetration instead AFM is limited to the surface…)… I want to add that there is not only these techniques in my thoughts, since there are also other advanced technologies. For example: the ATR SNOM Raman spectroscopy by M. Futamata, A. Bruckbauer And here the beginning of the Abstract: >In this study, an ATR SNOM Raman equipment was built to obtain topography and SNOM images simultaneously … … Links: http://www.sciencedirect.com/science/article/pii/S0009261401005450 https://www.jstage.jst.go.jp/article/analscisp/17icas/0/17icas 0 i693/ article.","date":"2015-11-05","mins":"11:44 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214196","author":"piero","post":"It seems to me odd that Dr. Raymond N. Rogers, despite being an expert in the field of explosives, he never used the ATR FTIR and DRIFT techniques in order to control linen samples coming from the Shroud. Or … Maybe he wanted to suggest to me the study of such analytical ways when he criticized my excessive dwell in the AFM, saying that the AFM could not see well in depth the ligno cellulosic samples tested ….","date":"2015-11-04","mins":"10:28 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214253","author":"piero","post":"Errata corrige: >I want to add: there are not only these techniques Instead of: >I want to add that there is not only these techniques.","date":"2015-11-05","mins":"11:45 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214298","author":"piero","post":"I must intervene here (…another time!) to clarify that (in my opinion) those advanced analyses are better suitable for linen fibres of the Shroud instead of the wool of the Holy Tunic of Argenteuil. But… I am also curious about the probable levels of degradation for ancient DNA on that Tunic that (if I am right) was not properly conserved [as instead happened for the Holy Shroud]. In any case… What sense does the will to control with sophisticated analysis a relic that was made into pieces [to hidden it, in front to the French Revolution] or that was stolen and then returned? — — — >In honor of the Year of Mercy decreed by Pope Francis — which begins on December 8, 2015 — Stanislas La Lanne, Bishop of Pontoise and “Guardian of the Holy Tunic” has announced that the Holy Tunic of Argenteuil – purported to be the seamless garment worn by Christ on Calvary – will be exhibited to the public for a very brief time: from March 25 to April 10, 2016. … >…During the French Revolution, the integrity of the Z twist patterned woven tunic was lost as the parish priest of Argenteuil — hoping to protect the unique garment from confiscation by the government — cut it into several pieces, burying some, and entrusting other pieces to parishioners. The priest, jailed for two years, attempted to patch the relic back together, but some parts of the tunic were never found. … >… …The tunic — having been stolen in 1983, and then recovered — was last given exposition in 1984, drawing at that time approximately 80,000 pilgrims. As the 2016 display will occur during the 150th anniversary of the Basilica of Saint Denis, and the 50th anniversary of the establishment of the diocese of Pontoise, … … Link: http://aleteia.org/2015/10/12/tunic of argenteuil seamless garment to be displayed in 2016/.","date":"2015-11-06","mins":"11:30 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214097","author":"piero","post":"I visited the Church of Argenteuil, which houses the famous Holy Tunic, many years ago. Then I returned to attend a conference. Here what I have found: >The Robe of Christ (For Cecil Chesterton) >At the foot of the Cross on Calvary Three soldiers sat and diced, And one of them was the Devil And he won the Robe of Christ. When the Devil comes in his proper form To the chamber where I dwell, I know him and make the Sign of the Cross Which drives him back to Hell. And when he comes like a friendly man And puts his hand in mine, The fervour in his voice is not From love or joy or wine. And when he comes like a woman, With lovely, smiling eyes, Black dreams float over his golden head Like a swarm of carrion flies. Page 44 Now many a million tortured souls In his red halls there be: Why does he spend his subtle craft In hunting after me? Kings, queens and crested warriors Whose memory rings through time, These are his prey, and what to him Is this poor man of rhyme, … etc. … … … omitted part of the poem (= here some parts of the poem must be omitted because there is an excessive length for this message) … … …O Mother of Good Counsel, lend Intelligence to me! Encompass me with wisdom, Thou Tower of Ivory! “This is the Man of Lies,” she says, “Disguised with fearful art: He has the wounded hands and feet, But not the wounded heart.” Page 46 Beside the Cross on Calvary She watched them as they diced. She saw the Devil join the game And win the Robe of Christ. Link: http://quod.lib.umich.edu/a/amverse/BAH7920.0001.001/1:16?rgn=div1;view=fulltext Joyce Kilmer (born as Alfred Joyce Kilmer; December 6, 1886 – July 30, 1918) was an American writer and poet He was the author of “The Robe of Christ” and he was killed by a sniper’s bullet at the Second Battle of the Marne, in 1918, at the age of 31. Kilmer was also a journalist, literary critic, lecturer, and editor….","date":"2015-11-02","mins":"12:10 pm","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214098","author":"piero","post":">Born in 1886 into an Episcopalian family in New Brunswick , New Jersey, Kilmer studied at the Rutgers College Grammar School, Rutgers College and graduated from Colombia in 1908. >Shortly after graduation he married Aline Murray, the love of his life, a poet in her own right. >Together they had a happy home and five children to fill it. … Link: https://almostchosenpeople.wordpress.com/2011/03/13/joyce kilmer and the fighting 69th/ * * * * * * Prayer of a Soldier in France (1918): My shoulders ache beneath my pack (Lie easier, Cross, upon His back). I march with feet that burn and smart (Tread, Holy Feet, upon my heart). Men shout at me who may not speak (They scourged Thy back and smote Thy cheek). I may not lift a hand to clear My eyes of salty drops that sear. (Then shall my fickle soul forget Thy Agony of Bloody Sweat?) My rifle hand is stiff and numb (From Thy pierced palm red rivers come). Lord, Thou didst suffer more for me Than all the hosts of land and sea. So let me render back again This millionth of Thy gift. Amen. Link: http://www.firstworldwar.com/poetsandprose/kilmer.htm.","date":"2015-11-02","mins":"12:16 pm","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214100","author":"piero","post":">… …Il était urgent de reprendre et d’approfondir l’enquête passionnante Jésus et la science, la vérité sur les reliques du Christ, parue en 2000. >C’est l’objet de ce nouvel ouvrage, qui ne laisse rien au hasard : nouveaux documents historiques, analyses textiles, carbone 14, travaux comparatifs sur les pollens, les groupes sanguins, les empreintes ADN, etc. >Est ce le même homme qui a saigné sur ces linges ? À quelle époque ? Pourrait il s’agir de Jésus de Nazareth, comme le veut la Tradition ? >Les réponses à toutes ces questions sont apportées par Gérard Lucotte, généticien, professeur à l’École d’Anthropologie de Paris, et André Marion, expert en traitement des images, enseignant à l’université Paris Sud, et déjà auteur de deux ouvrages sur les reliques de la Passion. Here a rough translation: > … … It was urgent to take and deepen the investigation Jesus and the Science, the truth about the relics of Christ, published in 2000. >This is the purpose of this new book, which leaves nothing to chance: new historical documents, textiles analysis, carbon 14, comparative work on pollen, blood types, DNA fingerprinting, etc. >Is this the same man who bled on these cloths? At what time? Could it be Jesus of Nazareth, as is the tradition? >The answers to these questions are made by Gerard Lucotte, geneticist, professor at the School of Anthropology in Paris, and Andre Marion, image processing expert, lecturer at the University Paris Sud, already author of two books the relics of the Passion. Link: http://www.amazon.fr/Le linceul Turin tunique d Argenteuil/dp/2750902045 Unfortunately… I have only bought the book by Marion but not that of Marion and Lucotte..","date":"2015-11-02","mins":"12:37 pm","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214144","author":"piero","post":"Here what I have found about Reed, Henry: “Naming of Parts.” New Statesman and Nation 24, no. 598 (8 August 1942): Today we have naming of parts. Yesterday, We had daily cleaning. And tomorrow morning, We shall have what to do after firing. But today, Today we have naming of parts. Japonica Glistens likecoral in all the neighboring gardens, And today we have naming of parts. … … … Links: http://www.poemhunter.com/poem/naming of parts/ http://www.solearabiantree.net/namingofparts/namingofparts.html http://www.poetrybyheart.org.uk/poems/naming of parts/ ‘Naming of Parts’ forms Part I of a six poem collection called Lessons of the War, each a parody of British Army training during the Second World War. There are two juxtaposing voices in this poem, the first being that of a training instructor delivering a lecture on the parts of a rifle. The second voice, which comes in halfway through the fourth line of each stanza, is more lyrical and seems to be that of the recruit, daydreaming about a beloved garden. Link: http://www.poetrybyheart.org.uk/poems/naming of parts/ — — — Here what I wrote (March 16, 2015 at 9:59 am) on this blog: >…Here two lines about Lucotte… >If I am right in my readings, it appears that the results of the particular analyses conducted by Lucotte have found that Jesus was an opium addict with bad habits … >What is your opinion about Lucotte (a scientist who specialized in the field of DNA) who argued that Jesus was an opium addict ? His statements were based on the analysis of fragments of hair found on the tunic of Argenteuil … >Now the questions are the following: >What can we say of those DNA analysis? >What value can we give to those controls on material very old? Link: https://shroudstory.com/2015/03/14/rebuttal of a long standing sindonological myth/ I think that we can stop here for a moment… and then think if it is a right thing try to waste our time to discuss on analyses about ancient DNA and inherent attempts done by prof. Lucotte, who obtaned these strange results… What is your opinion?.","date":"2015-11-03","mins":"11:27 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214145","author":"piero","post":"I wrote a message but the text doesn’t appeared. So… I don’t know what happened. I have to rewrite my message another time! Here the text that I have sent few minutes ago: ———————————– Here what I wrote on this blog (in March 16, 2015 at 9:59 am): >…Here two lines about Lucotte… If I am right in my readings, it appears that the results of the particular analyses conducted by Lucotte have found that Jesus was an opium addict with bad habits … >What is your opinion about Lucotte (a scientist who specialized in the field of DNA) who argued that Jesus was an opium addict ? His statements were based on the analysis of fragments of hair found on the tunic of Argenteuil … >Now the questions are the following: >What can we say of those DNA analysis? >What value can we give to those controls on material very old? https://shroudstory.com/2015/03/14/rebuttal of a long standing sindonological myth/ I think that we can stop here for a moment… and then think if it is a right thing try to waste our time to discuss on analyses about ancient DNA and inherent attempts done by prof. Lucotte, who obtaned these strange results….","date":"2015-11-03","mins":"11:38 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214147","author":"piero","post":"For the sake of truth, at the beginning of my original message appeared the name of the poet Reed and few other (famous) word: Reed, Henry. “Naming of Parts.” New Statesman and Nation 24, no. 598 (8 August 1942) Today we have naming of parts. Yesterday, We had daily cleaning. And tomorrow morning, We shall have what to do after firing. But to day, Today we have naming of parts. Japonica Glistens like coral in all of the neighbouring gardens, And today we have naming of parts. … etc. … >Lessons of the War is Reed’s most well known poem and also one of the most distinctive poems of the war. He mimics the speech of army instructors, precisely echoing the vocal rhythms and including military jargon Links: http://www.poetrybyheart.org.uk/poems/naming of parts/ http://www.solearabiantree.net/namingofparts/namingofparts.html — — Here other words: Vixi duellis nuper idoneus Et militavi non sine gloria I have found them under the same address: http://www.solearabiantree.net/namingofparts/namingofparts.html See also : Horace begins: Vixi puellis nuper idoneus et militavi non sine gloria. (Till lately I have lived on easy terms with girls, and fought [in love’s battles] … Link: http://www.newcriterion.com/articles.cfm/horace carneross 1816 Then the meaning of my previous intervention (= deleted, or failed, message) was near the following: “Today we have naming of genomics…” Turning the last word of the first line of the beginning of Reed in that manner, instead of : >Today we have naming of parts….","date":"2015-11-03","mins":"11:58 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-191969","author":"piero","post":"Ada Grossi says: >The deceased had to be wrapped in a shroud (‘takrik’ or ‘takrikim’) generally made of white linen … … >…the linen of the Shroud is interesting for two main reasons: the total absence of wool fibers and the considerable value of the cloth, which has a textile structure “highly sought” (= herringbone), … >… The Shroud of Turin is compatible with Jewish burial customs, but because it is traditionally considered that one that wrapped Christ in the tomb… … Link: http://www.lindro.it/0 cultura/2015 02 27/168507 la sindone e gli usi funerari giudaici Yes. Ancient weaving could be highly sophisticated… But, IMO, “herringbone” is more difficult but not “very very sought”. Am I wrong? Perhaps it would be interesting to investigate also the mechanical load borne by different types of fabrics during weaving … and see also: the subsequent ageing during the centuries. Why not? — — *** — — Now I have found a database…: “Database of ATR IR spectra of materials related to paints and coatings” Here the description: >In this page a selection of ATR FT IR spectra of various conservation and painting related materials (pigments, binders, fillers, etc) is presented. >These infrared spectra have been recorded at University of Tartu (Estonia), Institute of Chemistry, Chair of Analytical Chemistry. The spectra have been acquired over the last couple of years in the course of various projects on historic, industrial and construction paints, coatings and pigments. >In the course of the research of inorganic pigments and the usefulness of ATR FT IR for identification of inorganic pigments using the low wavenumber region (550–230 cm–1) two papers have been published (Spectrochimica Acta Part A, 2009, 73, 764–771 and Spectrochimica Acta Part A, 2010, 75, 1061–1072) and a doctoral thesis has been defended. IR spectra of these inorganic pigments are presented in section “Inorganic pigments” in the subsection “Pigment + linseed oil”. Link: http://tera.chem.ut.ee/IR spectra/ I think this database can be useful to discuss the strange case of the claims by Charles Freeman. It’s easy to make some experiment and ATR FTIR control… I never saw ATR FTIR spectra of various conservation – and painting related materials (pigments, binders, fillers, etc) presented for the purpose of studies on Holy Shroud. Am I wrong? In the past (= January 24, 2014 at 10:57 am But the argument was the following = “Comment Promoted: Are the Quad Mosaics Meaningless?”) I wrote: >… But, before to continue (… for example, see also : the comparisons for the SPM controls with respect the ATR FTIR controls) … >I want to ask : What is your remark about this point (= the lack of Raman analyses on radiocarbon area and neighbourhood … ) So, I have neglected to pursue the matter “ATR FTIR” (however also Prof. Giulio Fanti did not go beyond a certain type of study … ie.: what it was absolutely necessary for the purpose of dating, in one of the three methods of “Dating”). Then the question to answer can be the following: “How to organize a true ATR FTIR and AFM workshop around the Shroud of Turin?” Then remember the “Interview with Bruno Barberis, President of the International Center of Sindonology Turin” (February 20, 2015) Link: http://www.lindro.it/0 cultura/2015 02 20/168309 organizzare un laboratorio intorno alla sindone Prof. Barberis = a thirty year career as Professor of Mathematical Physics at the University of Turin… Jewish funeral or painting? The claims of Charles Freeman seem very weak..","date":"2015-02-27","mins":"10:48 am","url":"https://shroudstory.com/2015/02/27/the-lesser-known-aspect-that-of-the-intrinsic-characteristics-of-the-cloth/","cat":"history","title":"The lesser known aspect, that of the intrinsic characteristics of the Cloth"},{"id":"comment-191970","author":"piero","post":"My previous message is not well centered. Perhaps, as I vaguely wrote about the hidden textile secrets of that Linen, we have (also) to do other interesting works….","date":"2015-02-27","mins":"11:18 am","url":"https://shroudstory.com/2015/02/27/the-lesser-known-aspect-that-of-the-intrinsic-characteristics-of-the-cloth/","cat":"history","title":"The lesser known aspect, that of the intrinsic characteristics of the Cloth"},{"id":"comment-1471","author":"piero","post":"Dear Dr. Schauf, I believe that Forensic Sciences can apply the modern controls to solve the problems, using for example : the Scanning Probe Microscopies (= SP Ms) on materials coming from the Shroud (… or presumed materials coming from the Shroud, see : the different claims !) and this is the possible key to open the different secrets of that old relic. — Materials Science and Forensic Science : there are two fields to investigate. 1) the Textile domain. Investigating the linen fibrils (and the cellulosic chains) under the SP Ms we can try to detect the cellulosic DP (as I underlined in Turin in 1998) and then the hope to find the true epoch has an answer. Unfortunately I have not the help about the good SP Ms investigations (= AFM, CFM, SNOM). But I hope to see the truth in the future. — 2) the Biological traces. In Italy the case of the remains of the famous painter Caravaggio (= DNA) was solved. But the death of Michelangelo Merisi happened in 1610. In the case of the Shroud the Ancient DNA seems to be more difficult to detect and control (and see also : the level of degradation about the DNA and the past claims by Garza Valdes). — — — Frankly I am not able to solve the other too difficult questions about the BIF (= Body Image Formation). See for example the three faces of the BIF : 1) Was the Corpse of Jesus vanished through the nanoholes ? Was the Shroud a result of the emission of the Vacuum Energy ? See also : the claims by Eng. G. Fanti and Dr. P. Di Lazzaro about the excimer lasers and the VUV. 2) Was the Image obtained applying the Ark of the Covenant (a great mystery of the Bible as energy source) to the Corpse ? See the idea of the Corona Discharge by Scheuermann, Fanti (who believe in the internal origin = from the corpse and not from an external field) and others. Or : 3) Was the Image the simple result from the cadaveric emissions (with the IR from the corpse and without other energy source) ? — Respectful regards, Piero Iacazio technician dyer (since 1974) — P. S. I have read that : >The first practical demonstration of the vibrating cantilever technique in an atomic force microscope was made by Wickramasinghe in 1987 with an optical interferometer to measure the amplitude of a cantilever‘s vibration. There is another recent forensic archaeological case to take in account : the skin of the Iceman under the AFM (= Atomic Force Microscopy). Here the inherent (2010) control: >In collaboration with the EURAC Bolzano, Professor Dr. Robert Stark’s research group at LMU Munich, has used a Nano Wizard® AFM system to reveal the nanostructure and mechanics of mummified type I collagen from the 5300 year old Tyrolean Iceman. Where is the little remain of the skin of the Man in the Shroud ? I believe that some acarus has eaten a the skin. We have only seen the eggs. But I still hope to see the discovery of the little nanoparticles, the remains of the skin … — PI.","date":"2010-10-01","mins":"12:07 pm","url":"https://shroudstory.com/2010/09/22/trial-of-the-shroud-of-turin-at-newman-university-in-wichita/","cat":"history","title":"Trial of the Shroud of Turin at Newman University in Wichita"},{"id":"comment-214467","author":"piero","post":"Subject: the Orient Forest and the Holy Shroud. On this blog we can find the following words by Eugene Ray (May 29, 2015 at 5:23 pm): >…our ancestor inherited the Shroud of Turin from Othon de la Roche and married the great French knight de Charney bringing it to the Orient Forest where it was deposited in the le Ray (lirey) chapel they built for this preservation… Here other words by Eugene Ray (June 5, 2015 at 11:02 am): >I have published my blog on the history of The Shroud Of Turin in the Orient Forest of France. >At the le Ray (Lirey) Chapel with the Troyes Fraternity (Templars, Priory de Sion) Bernard de Clairvaux led families …of which our de Gruy(ere) Chateau Magny Fouchard was the ancient Center until it was destroyed in the First World War …study carefully the blog… … etc. … and, in the intervention by daveb of wellington nz (June 5, 2015 at 3:26 pm), we can read: >… I remain open to any evidence that Eugene Ray can present here to support his claims. But Eugene Ray didn’t sent an answer for that specific request…! Link: https://shroudstory.com/2015/05/29/challenging the othon de la roche story/ — — Here other vague informations: >… After the Fourth Crusade, three military orders returned from the Holy Land to settle in the region. >Foret du Temple is named for the Knights Templar, one of the most wealthy and powerful of these orders, and the Knights Hospitaler and Teutonic Knights also came to reside in the park area. Links: http://www.wildfuture.co.uk/index.php/foret dorient history a heritage https://en.wikipedia.org/wiki/Orient Forest Regional Natural Park But… To my knowledge there is any tradition or story about Knights Templar who were walking over the water, like instead Jesus did… and also this fact is a different kind of problem….","date":"2015-11-10","mins":"11:46 am","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"},{"id":"comment-182066","author":"piero","post":"Is it possible to infer from the description of hematohydrosis, made by St. Luke (he was a doctor of that time, probably “soaked in Hellenistic culture”, as I highlighted in my recent post) that he saw the Shroud? If this was a real thing, here then we would be facing a different thing from the oral tradition … Traditions report that Luke was a companion of Paul. He was a physician and therefore someone learned in Hellenistic literary and scientific culture. But … where is the evidence related? Perhaps we only know that Saint Luke presented Lord Jesus’ divine deeds for salvation to fulfill what the Greek philosophy and human wisdom were unable to fulfill… — — — *** — — — Here what I have found under the address: http://www.apologeticspress.org/apcontent.aspx?category=13&article=2323 >Luke, the author of the New Testament books of Luke and Acts, by profession, was a physician. His writings manifest an intimate acquaintance with the technical language of the Greek medical schools of Asia Minor. For example, of the four gospel writers, only Dr. Luke referred to Jesus’ ordeal as “agony” (agonia). >It is because of this agony over things to come that we learn during His prayer “his sweat was as it were great drops of blood falling down to the ground” (Luke 22:44). Only Luke referred to Jesus’ sweat (idros), a much used term in medical language, and only Luke referred to Jesus’ sweat as consisting of great drops of blood (thromboi haimatos)—a medical condition alluded to by both Aristotle and Theophrastus (Hobart, 1882, pp. 80 84). The Greek term thromboi (from which we get thrombus, thrombin, et al.) refers to clots of blood (Nicoll, n.d., 1:631; Vincent, 1887, 1:425). >Bible scholar Richard Lenski commented on the use of this term: “‘As clots,’ thromboi, means that the blood mingled with the sweat and thickened the globules so that they fell to the ground in little clots and did not merely stain the skin” (1961, p. 1077). … — — >St. Luke was a physician and sensitive to medical and scientific observation. >He had completed his medical studies at Tarsus and was considered highly educated … Link: http://www.practicalhomicide.com/Research/Rome2012.doc. So, we know that Saint Luke was a physician, but we know nothing about his practice of medicine… and his possible medical observations about the Shroud … — — — Here another link: http://full of grace and truth.blogspot.it/2008/10/st luke evangelist.html >After many investigations, including DNA analyses (which linked the remains to someone of Syriac origin; St. Luke was born in Antioch), C 14 dating, and measurements of the lead sarcophagus, which actually matched the dimensions to the milimeter of St. Luke’s tomb in Thebes, it was determined that there was significant scientific evidence that these remains belonged to St. Luke. To honor the Metropolitan’s request, the Archbishop of Padua gave the Church in Thebes a rib from St. Luke, and the one closest to his heart. … and near the same words under: http://oca.org/saints/lives/2014/10/18/102993 apostle and evangelist luke >…The skeleton was determined to be that of an elderly man of strong build. In 2001, a tooth found in the coffin was judged to be consistent with the DNA of Syrians living near the area of Antioch dating from 72 416 A.D. >The skull in Prague perfectly fit the neck bone of the skelton. >The tooth found in the coffin in Padua was also found to fit the jawbone of the skull. ————————————————— But … I see that everything is just “twisting and turning” on the same things … I believe that relying only on vague historical evidence and no new analyses on the Shroud (…and on the spanish relic = Sudarium of Oviedo), we can not come out by the enigma of the ancient sheet with the Face of Jesus ….","date":"2015-01-08","mins":"12:29 pm","url":"https://shroudstory.com/2015/01/07/we-also-have-the-shroud-of-turin/","cat":"history","title":"We also have the Shroud of Turin"},{"id":"comment-214468","author":"piero","post":"…. For the sake of truth I have to add the following words: >… My de Gruy ancestors chateau in the Orient Forest were related to the Counts de Gruyere & the mother of the last count of Gruyere was a Vergy … Link: https://shroudstory.com/2015/09/06/barrie schwortz to speak in indianapolis on september 19/.","date":"2015-11-10","mins":"12:05 pm","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"},{"id":"comment-6637","author":"piero","post":"First of all : I want to recall that is impossible to write on few lines… So… Don’t try to make confusions mixing up all molecules/arguments (= hemicelluloses, lignins, cellulose, etc.) — — — I think that talking about the use of AFM techniques is no longer to argue about an idea in the field of “disruptive innovation” … In fact I, in 1998 (in Turin), I had indicated the use of AFM techniques as useful ways to improve our knowledge on the Shroud. So… For sake of clarity we must distinguish two problems: 1 – discover the (probable) date of the material 2 – discover which was the BIF (= Body Image Formation) Here you can read the following vague descriptions: To solve the problem to n. 1 I had indicated the way of the control with the use of AFM as possible in order to determine the degree of polymerization of the cellulose (and then to obtain an estimation of the epoch [more or less ancient, depending on the value of the “cellulosic DP” found during the controls. But we have to take into account the bacterial and fungal attacks! And this is only one side of the problems to solve…] which dates back to the material) … The Norm I did consider in 1998 was the UNI 8282 (viscosimetry, viscosity average degreeof polymerization = DP v). The degradative scission of cellulosic chains can be regarded as the changes in the number of glucosidic bonds… Cellulosic degradation of linens caused by micro organisms can be followed by DP measurements and related to changes in the number of glucosidic bands broken…. Here a possible reference: => The intrinsic viscosity was determinedaccording to UNI 8282 … “Effect of thermal accelerated ageing on the properties of model canvas paintings” A.M. Seves, S. Sora, G. Scicolone, G. Testi, A.M. Bonfatti, E. Rossi, A. Seveso published in: Journal of Cultural Heritage 1 (2000) © 2000 Editions scientiﬁques el médieales Elsevier SAS. All rights reserved For problem n. 2 in addition to the AFM techniques (see also the CFM = Chemical Force Microscopy) we have to use the Raman techniques not only to find all the functional groups involved in the BIF, but to do the interesting comparisons with the Lab experiments (and the same is valid for the AFM/CFM controls. See also AFM Raman controls, etc.)… In any case Raman techniques can be used to solve the problem n.1 (See f.e. What was done by Eng. G. Fanti & C.).","date":"2016-01-02","mins":"4:57 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6639","author":"piero","post":"Obviously I had in mind to do checks with the AFM apparel (if possible …using AFM, CFM and AFM Raman controls,..) on some linen samples obtained after laboratory works (= BIF simulations)! … Included the “Corona Discharge” treated linens and irradiated (with VUV = see f.e.: Paolo Di Lazzaro) linen samples… But we can also work on “more humble” linen samples… Remeber that moder linens are different with respect ancient materials… No Optical bleaching, No Na Cl O, etc…..","date":"2016-01-02","mins":"5:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6666","author":"piero","post":"Remember that I do not want to proselytize for anything, I just want to point out what seems to me obvious and that you seems strangely escape to you. Don’t You see much use for a way non destructive or minimally destructive?.","date":"2016-01-06","mins":"1:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6627","author":"piero","post":"I was out of focus (because You indicated us an argument of History: “Geoffroy de Charny’s humble chapel”, etc. ) and then I am displeased for that! Sorry… — — — — Here are a few words that I had forgotten to write: Unfortunately I avoided to remember a famous “scottish failure”… Otherwise : 136 years after a famous bridge disaster (= 28 December 1879) Dan closed the blog… The structural failure is also an interesting key to understand what can happen on linen fibrils (f.e.: submitted to radiations!)… Colin, Your words (in the blog by Dan) about the railway bridge over the Tay estuary remembered me the catastrophic failure that happened on the night of 28 December 1879 : “the bridge collapsed after its central spans gave way during high winter gales…” All seventy five passengers were lost! But the engine itself was salvaged from the river and restored… Link: https://en.wikipedia.org/wiki/Tay Bridge disaster — — — So… I think we have to discuss something about Structural Mechanics and Materials Science… For example: – A gradient theory of crystals plasticity under and after irradiations. – The results from some controls on cellulose defects… – The birefringence of linen fibrils (linen treated or not) under strains….","date":"2015-12-31","mins":"3:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6622","author":"piero","post":"First of all I beg your pardon because my poor answer was not very respectful of what was possible to read in your previous message. In fact I was in a hurry, as evidenced by the addition of a second message where I wanted to also mention that in the blog of Dan Porter I mentioned both the name of Dr. Marco Leona (the Metropolitan Museum in New York) and the SERS technique (a technique where he appears to be an interesting specialist, for several years!)… Dan Porter closed his blog without giving me a clear answer on that point and then this could be further cause for sadness in this end of year … Am I wrong? Even the year 2015 ended without a real analytic progress. I think on this subject your sensitivity of chemical analyst might help to deepen the issue. For what concern the question of scientific model I can agree with you. But the continuous search for a possible useful model should not reach the level of stop the analytical research (instrumental = AFM, CFM, Raman, SERS, etc.). Another (a pessimist/realist approach) little note: … A scientific model may really explain the Resurrection? of that idea I doubt enough … (that is, in a nutshell, I doubt even what seems to be strongly supported by Ing. Giulio Fanti. Maybe science can not really explain the Faith, as instead he claimed …). In any case what we can observe on linen fibrils could bypass our “very limited horizons”. That said I do not want to defend in a certain extremist way Mark Antonacci and Art Lind … they do not convince me yet (…but for sake of truth I have to say that, unfortunately, I have not yet bought the last book by Antonacci. B.T.W.: Have you read that new text?). Also, if you want my advice for your trips to South / Central Italy, then I invite you to go for a ride to: – Manoppello (but I never went there) – Lanciano (I went there instead [several years ago!]) – San Giovanni Rotondo (St. Father Pio. Even there I have never gone).","date":"2015-12-30","mins":"3:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6623","author":"piero","post":"I want to add that you could set up some interesting lab tests about the alleged reaction of alizarin (and purpurin) with blood (see the inherent study on Heme Alizarin written by Adrie van der Hoeven and the control of reaction temperatures) and in so doing can then clarify what happens in reality… See also the behaviour of thin layers of starched and madder dyed linen….","date":"2015-12-30","mins":"3:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6612","author":"piero","post":"PALS is a very interesting techniique. But, for the moment, I prefer AFM techniques… — — I am referring to the dialect of New York because of the type (the little man, perhaps a bit pathetic… Jimmy Durante…!) indicated by Dan Porter in his last message (…the final farewell to all, in his interesting blog). — — — I live in northern Italy. I have been visiting the city of Bari (Puglia) only once. Instead I went only once in Sicily (near Taormina and then, later, in Catania). I never went to Naples, but I know the famous story of Raimondo de Sangro, Prince of Sansevero … Link: https://en.wikipedia.org/wiki/Raimondo di Sangro.","date":"2015-12-29","mins":"3:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6613","author":"piero","post":"Colin, As you can see I wrote too fast … and I have erred by writing: “very interesting techniique.” instead of “very interesting technique.”… … and it is obvious that it must be shown to be able to use the AFM techniques in a truly non destructive manner… or certainly with minimum destructions!.","date":"2015-12-29","mins":"3:54 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6628","author":"piero","post":"I have found a vague reference about the blood and the use of the AFM techniques… Link: http://www.nature.com/articles/srep06033 In any case, in 1998, I had indicated the AFM techniques as useful way for determining the age of the lignocellulosic material (= determination of degree of polymerization of the cellulose by the use of AFM controls, etc.) … But, see also: the diffferent kind of operation (= another problem with respect the controls/evaluations about the cellulosic DP!): the measurement of Young’s modulus ([= elasticity modulus] through AFM bending tests, indentation tests, etc.)….","date":"2015-12-31","mins":"3:18 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6634","author":"piero","post":"Dear Colin, You wrote: >AFM? Atomic Force Microscopy? >Or Annoyingly Futuristic Moonshine? … etc. … I appreciate your fair irony, sorry if I am boring. However… I think the Professor Engineer Giulio Fanti and the new Scientific Committee of Engineers [= CRIS. See under the address: http://www.unipd.it/ilbo/sites/unipd.it.ilbo/files/Giornata%20di%20studi%20sulla%20 Sindone%20a%20 PD3.pdf ] should consider what I have written several times about AFM techniques. Therefore I am also referring to what was not presented during the last conference in Bari (IEEE) on the Shroud … I think that you have to seriously consider the possibility to control linen fibrils with AFM techniques… And here it’s impossible to write (on few lines) a very detailed experimental protocol ….","date":"2016-01-02","mins":"2:27 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6604","author":"piero","post":"Thank you about your intervention about the strange ideas by Fomenko… Yes, the New Chronology is terribly… B.T.W. In the blog by Dan we can read (an old argument): “What if, as the Russian mathematician Anotoly Fomenko believes, ancient Greece, Rome and Egypt were in inventions of the Renaissance and Jesus was was born in A.D. 1053 and crucified in 1086. … … ” — — — Instead, here what I wanted to add (before the “death of the blog”): >…still continuing in the review of the analytical tools now I would indicate what is the PALS … >Here an article: https://www.researchgate.net/publication/263940629 Perspective of Positron Annihilation Spectroscopy in Polymers “Perspective of Positron Annihilation Spectroscopy in Polymers” Y. C. Jean, J. David Van Horn, Wei Song Hung, Kuier Rarn Lee published in “Macromolecules” (Impact Factor: 5.8). 08/2013; 46(18):7133–7145. ABSTRACT Positron annihilation spectroscopy (PAS) is a novel method that provides molecular level information about complex macromolecular structure in a manner different from, but complementary to, conventional physical and chemical methodology. This paper presents a perspective of PAS in polymeric systems covering 12 aspects: historical, spacial, spherical quantum model, anisotropic structure, voids, positronium chemistry, time, positron annihilation lifetime spectroscopy and data analysis, variable monoenergetic slow positron beam techniques and depth profiling, elemental analysis, multidimensional instrumentation advances in PAS, and free volume and free volume theories. Perspective of Positron Annihilation Spectroscopy in Polymers. Available from: https://www.researchgate.net/publication/263940629 Perspective of Positron Annihilation Spectroscopy in Polymers [accessed Dec 28, 2015]. — — — Another thing: New York City English is one of the most recognizable of US dialects… Do you know that dialect? ….","date":"2015-12-28","mins":"3:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6658","author":"piero","post":"It was not in my aim to completely discard the radiocarbon dating of the year 1988. What had been done it was done. Amen (and then: see also the lack of exact informations about the Raman analyses of the year 2002!!!). — — — I had simply seen there was a strange debate that was not able to solve the problem, then I indicated the AFM techniques as useful tools to try to solve the problem. Unfortunately, I see that you can not even follow me (or try to debate in a more decent manner, ie: not having to use the silly cartoons that do not reflect the truth) in my old idea of trying to identify a possible era [who can identify the age of the textile material] using chemical and physical analyses. Instead you invoke the result of a C14 1988 dating which has been questioned by many … By the way: we have never had the raw data obtained in 1988 !!! After this fact we have seen that has been developed by some “seekers of truth” the interesting conjecture about the likely “gradient of time” (see, for example, what has been written by researchers fiercely anchored in search of a possible satisfactory explanation about that “quiz”, even in the absence of special exact data [ie raw data that we lack] these researchers are: Ballabio, Fanti and others …), etc. Apart the presence of cotton, etc. In my opinion there is not yet a true proof (= an incontrovertible result) about a “corner of darning” as the solution of “the strange 14 C result”. We still have to work (to work hard with nondestructive analyses) a lot in order to show the truth. Can “an uranium contaminated water” [perhaps used during “the shutdown of the fire” in 1532] change the perspective ? I don’t know… This seems to be a mere new speculation. I am skeptic. What is your opinion? Have you tried to investigate this particular hypothesis? So… What we can investigate about the riserva of the “subdivided corner”? Thank you for your patience… Is this benevolence a sort of patience of an Indian holy man? or… Are you the new heir of the roasted Knights Templar?.","date":"2016-01-05","mins":"3:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6652","author":"piero","post":"I admit : it can be difficult to solve the problem of dating the material (…using only one parameter!), but I am not of your opinion about the impossibility of using the degree of depolymerization of cellulose in order to determine an interesting estimate (through the comparison of “cellulosic Dp” values) about the antiquity for that particular ancient textile material… — — — Here the old Norm (UNI) [Obviously this is the old standard and therefore does not apply to the possible new rule based on the use of the AFM techniques!]: Standard Number: UNI UNI 8282 1994 Title: Cellulose in dilute solutions. Determination of limiting viscosity number. Method in cupri ethylene diamine (CED) solution. Translated in Italian laguage: Cellulosa in soluzioni diluite. Determinazione dell’indice della viscosità limite. Metodo che usa una soluzione di cuprietilendiammina Language: Italian Publication Date: 1994/10/31 Publisher: Unifica zione Italian no(UNI) Link: http://www.freestd.us/soft4/1756344.htm But, see also under the address: http://www.queryonline.it/2013/04/16/datazioni alternative della sindone la controreplica di gian marco rinaldi/comment page 1/ >… nel 1998 avevo indicato l’uso delle tecniche AFM per poter ottenere il valore del grado della polimerizzazione della cellulosa. Purtroppo (finora) nessuno pare aver seguito quella indicazione. Il grado di polimerizzazione della cellulosa è uno dei parametri già indicati da Diana e Marinelli (però loro parlavano del controllo per via viscosimetrica che avrebbe richiesto una troppo grande quantità di materiale. Vedere anche quanto descriveva la Norma UNI 8282 …). Tale parametro è indubbiamente interessante e bisogna scegliere zone sicure, libere da effetti di deterioramento meccanico (pieghe, vedere anche la questione delle pieghe storiche, già indicata da John Jackson. Dopo il trattamento del 2002 però non sembrerebbe saggio entrare in quelle questioni) o degradazione biologica (da muffe, funghi, ecc.) oppure degradazione termica (incendio di Chambery del 1532). Secondo me occorrerebbe anche confrontare i valori del grado di polimerizzazione (della cellulosa) con le analisi ottenute dall’AFM “three point bending test”. Ecco un possibile riferimento : Here a rough translation: >…in 1998 I had indicated the use of AFM techniques in order to obtain the value of the degree of polymerization of the cellulose. Unfortunately (intil now) no one seems to have followed this indication. The degree of polymerization of the cellulose is one of the parameters already set out by Diana and Marinelli (but they spoke about the viscosimetric control that would require too large amounts of material. See also what described the Norm “UNI 8282″…). This parameter is undoubtedly interesting and you have to choose safe areas, free from the effects of mechanical damage (folds, plies, see also the issue of historical folds, already indicated by Dr. John Jackson. After treatment of 2002, however, it would not seem wise to get into those issues) or biological degradation (mold, fungus, etc.) or thermal degradation (Chambery fire of 1532). In my opinion it should also compare the values ​​of the degree of polymerization (cellulose) obtained by the AFM analyses with the other analyses AFM : “AFM three point bending test”. Here is a possible reference: http://apl.aip.org/resource/1/applab/v84/i9/p1603 s1?is Authorized=no Appl. Phys. Lett. 84, 1603 (2004); http://dx.doi.org/10.1063/1.1651643 (3 pages) Physical properties of a single polymeric nanofiber by E. P. S. Tan and C. T. Lim Division of Bioengineering and Department of Mechanical Engineering, Faculty of Engineering, National University of Singapore The nanostructural and elastic properties of a single polymeric nanofiber extracted from a nanofibrous scaffold are investigated using atomic force microscopy (AFM). AFM imaging of the nanofibers reveals a “shish kebab” structure. A portion of the nanofiber is suspended over a microscale groove etched on a silicon wafer. A nanoscale three point bend test is performed to obtain the elastic modulus. This elastic modulus is found to be … etc. … etc. … etc. … Then there is the elastic modulus [in Italian language = il modulo elastico (o modulo di Young)] as another physical clock to use in order to better arrive to the center the objective … the evaluation of the possible range of historical epoch. Here is the continuation of the message of two years ago: >… Oppure vedere all’indirizzo (translation = Or see under the address): http://www.google.it/url?sa=t&rct=j&q=&esrc=s&frm=1&source=web&cd=4&ved=0 C Fs Q Fj AD&url=http%3 A%2 F%2 Fwww.tappi.org%2 Fcontent%2 Fevents%2 F08nano%2 Fpapers%2 F08nan22.pdf&ei=r Klu Uf D Fcqh7 Ab P5 YC4 CA&usg=AF Qj CNHW9 Ngn P Lrcu Hf2s Mx Qsnb2 J h Sg&sig2=Ne KD Dlvarb LH7a Wo K Mywg&bvm=bv.45368065,d.ZWU > Nano Scale Three Point Bending Test in AFM where F is the maximum force applied, L is the suspended length, δis the deflection of the beam at midspan … etc. … etc. … http://www.deepdyve.com/lp/elsevier/a method for testing the elastic modulus of single cellulose fibrils ipqwh HBJ5y >”A method for testing the elastic modulus of single cellulose fibrils via atomic force microscopy” by Cheng, Qingzheng; Wang, Siqun Follow Composites Part A: Applied Science and Manufacturing , Volume 39 (12) Elsevier – Dec 1, 2008 >…Così si avrebbe un quadro più completo di ciò che potrebbe esser la vera datazione del materiale. Inoltre vorrei poter aver più spazio per spiegare cosa intendo per esatta valutazione del materiale il controllo di altri parametri. Vedere ad esempio (quanto già da me riferito in questo blog) : il grado di carbossilazione della cellulosa e gli studi del prof. Luigi Campanella. … ecc. … Another rough translation: >…So you would have a more complete picture of what could be the real dating of linen material. Also I wish I could have more room to explain what I mean by exact evaluation of the material control other parameters. See for example (as I have already reported in this blog): the degree of carboxylation of cellulose and the studies of Professor. Luigi Campanella. … etc. … So, with the assessment of the degree of carboxylation (perhaps using the CFM = Chemical Force Microscopy… Link: http://www.parkafm.com/index.php/park spm modes/chemical properties/224 chemical force microscopy cfm with functionalized tip ), we arrive at the number of three parameters and then we can try to better go to focus on the center of target to hit (with the “scientific bombardment”)… Then: the probability to find the true epoch should increase … …or not? Here another link: http://www.physics.uoguelph.ca/psi/papers/AFM/Green Trends Anal Chem02.pdf In any case, I think you could easily compare the chemical maps with the viscoelastic maps of linen fibrils (and then you should use these interesting data to guess something!…). — — — Sorry… I was a bit ‘too long in my message, but this is only a little part of what I wanted to say to you!.","date":"2016-01-04","mins":"3:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6638","author":"piero","post":"My AFM determinations wanted to improve what was indicated by prof. Diana and prof. Marinelli (but they indicated the viscosimetry, then see also the Norm UNI 8282 a way that I wanted to improve using the AFM [insterad of the viscosimetry]…) * * * I forgot to write the following words: Happy New Year 2016 !!!.","date":"2016-01-02","mins":"5:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"}]
