[{"id":"comment-203064","author":"piero","post":"Question to answer (in my opinion): do you think the Pope would the will to caress in that manner the theca (built for custody of the Holy Shroud) if the cloth was just a painting?.","date":"2015-06-21","mins":"8:31 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-199191","author":"piero","post":"Fortunately for us someone in the past (and still) has been busy for the Shroud …! The documentation of Barrie Schwotz is truly remarkable. — — — Instead it seems that the city of Palymira (UNESCO site) is ending in the hands of the barbarians of ISIS. It seems to me that in the museum of the city are preserved textile remains that are interesting also to understand the Shroud. Am I wrong? — — I hope that their goals are far from the Museum, perhaps are the destruction of the temple of Baal and and the damages to the main colonnaded avenue. I have read that: >The Temple of Baal is an ancient stone ruin located in Palmyra, Syria. The temple, consecrated to the Semitic god Baal, worshipped at Palmyra in triad with the lunar god Aglibol and the sun god Yarhibol, formed the center of religious life in Palmyra and was dedicated in 32 CE. >Aedeen Cremin considers its ruins the “best preserved” at Palmyra. >The Great Colonnade at Palmyra was the main colonnaded avenue in the ancient city of Palmyra in the Syrian Desert. The colonnade was built in several stages during the second and third century CE and stretched for more than a kilometer. It linked the Temple of Bel, in the southeastern end of the city, to the West Gate and the Funerary Temple in the northwestern part. Links: http://en.wikipedia.org/wiki/Temple of Bel http://en.wikipedia.org/wiki/Great Colonnade at Palmyra But all this (which covers the presumed or probable horrible destructive activities of ISIS) is therefore very far from the important (and longstanding) great documentation work of an American Jew … who is friend not only of leading researchers, experts on that Ancient Sheet, but friend of all the civilized World. The possible systematic demolition of idolatries can pass through the careful examination of Science. It is not with the destructive violence that leads citizens to monotheism (and here I want to clarify that I am neither Jew nor Muslim)..","date":"2015-05-15","mins":"9:50 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","title":"An American Jew in Favor of Authenticity"},{"id":"comment-199263","author":"piero","post":"I do not want to controversy with anyone but I should mention that >Prominent members of the SSPX, including Lefebvre himself, have, at various times, expressed approval or support for a restoration of an absolutist French monarchy; the Vichy government (1940–1944); and the party of Jean Marie le Pen. >On the basis of statements made by Bishop Richard Williamson, the Anti Defamation League has accused the Society of being “mired in anti Semitism”… But now I would like to remind (repeating my tedious “mantra”…) that you can get interesting information using AFM techniques. Nano indentation allows for hardness and stiffness to be directly measured at the submicron level Burgert (see for example: “Micromechanics of Cell Walls”, Ingo Burgert and John W.C. Dunlop) indicated the study by Gindl W, Schoberl T (2004): “The significance of the elastic modulus of wood cell walls obtained from nanoindentation measurements.” (Compos A Appl Sci Manuf 35:1345–1349). So, Burgert recalled us that mechanical parameters (= elastic modulus and hardness) can be determined at the location of the indent (from the force–displacement curve and a knowledge of the shape of the tip). — — — You should then be able to work well (= without useless destructions) using the AFM apparels… There are many interests that can slow Shroud studies, but I would not want to be counted among those who have blocked or block scientific research ….","date":"2015-05-16","mins":"5:17 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","title":"An American Jew in Favor of Authenticity"},{"id":"comment-104960","author":"piero","post":"Is the Shroud of Turin the most studied artifact in human history ? I don’t agree on that false statement ! See also : the lack of SPM studies and the claims on radiations, etc. ! There is a lot of work to do … — — — For example : Here an unsolved problem connected to the paper by Thibault Heimburger (https://shroudofturin.files.wordpress.com/2012/10/scorch paper en.pdf) This problem is the finite element discretization of heat transfer equations and then (taking into account the different heat conduction values for : cellulose, hemicellulose, lignin and pectin…) we have to try to sketch the exact temperature distribution into the linen fibril ….","date":"2014-04-28","mins":"11:14 am","url":"https://shroudstory.com/2014/04/27/an-oh-so-true-observation/","cat":"news_&_views","title":"An Oh-So-True Observation"},{"id":"comment-191370","author":"piero","post":"There is a new book: “Luce dal Sepolcro. Indagine sull’autenticità della Sindone e dei Vangeli” di Emanuela Marinelli, Marco Fasol ——————— “Light from the Sepulchre. Survey on the authenticity of the Shroud and Vangeli” by Emanuela Marinelli, Marco Fasol… http://www.libreriauniversitaria.it/luce sepolcro indagine sull autenticita/libro/9788864093567 Short description: >The Shroud is indeed the burial cloth of Jesus, or it is a medieval fake? The Gospels tell real events or are simply legends? The answer to these questions is not secondary, because it deeply affects our lives. Certainly the Shroud is the most studied archaeological find in the world and the Gospels constitute the only key to the interpretation. This link between the Gospels and the Shroud has therefore suggested to the authors to combine the latest scientific research on the Shroud to an investigation as scientific and documented the reliability of the Gospels, to sum up in a single text the results of the natural sciences and the historical ones, short form and accessible language, in order to provide a summary for the modern man who does not want to remain illiterate about the deepest questions..","date":"2015-02-19","mins":"5:33 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","title":"Ash Wednesday 2015"},{"id":"comment-191372","author":"piero","post":"Here’s another reference (and this is for a presentation of the Italian book that took place in Verona…): >Pubblicato il 15 feb 2015 >Presentazione del libro “Luce dal Sepolcro” scritto da Emanuela Marinelli e Marco Fasol e pubblicato da Fede & Cultura sulla veridicità della Sindone e la storicità dei Vangeli. L’incontro si è tenuto presso la libreria L’Isola del Tesoro di Verona il 12 febbraio 2015. Link: Rough translation: Posted February 15, 2015 Presentation of the book “Light from the Sepulchre” written by Emanuela Marinelli and Marco Fasol and published by Faith & Culture on the veracity of the Shroud and the historicity of the Gospels. The meeting was held at the library Treasure Island Verona February 12, 2015. Title: “Luce dal sepolcro” “Indagine sull’autenticità della Sindone e dei Vangeli” Editore: Fede & Cultura Prefazione: Card. Agostino Vallini Pagine: 224 Collana Storica n. 44 Data di pubblicazione: Febbraio 2015 links: http://www.fedecultura.com/libro/luce dal sepolcro/ http://www.amazon.co.uk/Luce dal sepolcro Indagine sullautenticit%C3%A0 ebook/dp/images/B00 TCKIV0 U — — — During the night I heard an interview with the authors. Marinelli took care of the first part (= scientific themes) instead Fasol speaks on the topic of the Gospels. In the interview the Marinelli cited both the Ing. Fanti and his three alternative methods to C14 that the expert botanical Boi (Marzia Boi, a university researcher at the University of the Balearic Islands) … this researcher has found three types of balms “very expensive”. So … I have found a link: http://www.catholicforum.com/forums/showthread.php?44634 The Turin Shroud and Vatican Insider com >Marzia Boi … >… Her examination with the electron microscope yielded a different result: the main pollen residue comes neither from Ridolfia, nor Gundelia, but from Helichrysum (29.1%). Cistaceae pollen (8.2%), Apiaceae pollen (4.2%) and Pistacia pollen (0.6%) are also present on the shroud in smaller quantities. “All the plants mentioned here are entomophilous, that is, their pollen is carried by insects rather than air. This shows that there must have been direct contact with either the plants or the materials used for the funeral. >The list of pollens reveals traces of the most common plants used in ancient funerals. >The pollens identified clarify that the holy shroud was rubbed with oils and ointments, just as the body contained within it did.” >There used to be a balm made from Pistacia leaves, fruits and bark that was also used as an ointment. However, a high quality oil was once produced from the Helichrysum and this oil was used to protect both body and shroud. See also: https://www.shroud.com/pdfs/boiveng.pdf Now I ask … What was the price (a rough estimation) for the ancient balms used during the entombment of Jesus? I am curious to know your answer. Thank you in advance..","date":"2015-02-19","mins":"5:59 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","title":"Ash Wednesday 2015"},{"id":"comment-191374","author":"piero","post":"What matters is not our poor body but what we did with our bodies… Thus what we used to make fruitful the talents, the natural gifts of God. — — We know that before we talk about a book we should at least have read it … So I apologize for my remarks about the new interesting book. But the theme of the Ashes is linked at the beginning of Lent, a time when it should stop for a moment, read and meditate on something of the Passion of Jesus … and the image of the Shroud is very appropriate for us to start meditation on the Passion of Christ. — — — Perfume today is, as it always has been, a symbol of status and wealth; however, if you were to associate only one thing with perfume, it probably wouldn’t the mummification process – yet there can be no more apt association. Perfumes, oils, and other fragrances played a key role in the process of mummifying a body for burial, as well as denoting what status the person held in life. Scientists have learned so much about the people of the past from studying mummified human remains, and much of the credit goes directly to the oils and perfumes that still reside within the bodies. Scented oils were used as early as 10,000 BCE to help combat body odor and to soften the skin. Some of the most common scents used by the Egyptians were thyme, lavender, peppermint, cedar, rose, almond oil, and aloe. While providing a definitive use in life, these scents also had a purpose in death – namely, the process of Egyptian mummification. The famous method of embalming was developed around 2600 BCE (it does not appear that embalming was practiced by the Hebrews). The Jews did not have that kind of embalming and there was a different kind of treatment for the deceased… — — — Here a title : Medicinal and Aromatic Plants of the Middle East Series: Medicinal and Aromatic Plants of the World, Vol. 2 Yaniv, Zohara, Dudai, Nativ (Eds.) 2014, X, 337 p. 81 illus., 39 illus. In color Plants have been known and cultivated for their therapeutic properties in the Middle East throughout recorded history and most likely – beyond that. With the progress of science, they continue to be cultivated and collected for both traditional and innovative purposes. This volume: “Medicinal and Aromatic Plants of the Middle East” offers the most comprehensive and up to date information on medicinal plants and their increasing importance as cultivated crops, or as plants with significant potential to become crops in this important region. In 17 chapters of meticulous research, this unique volume explores history, taxonomy, ecology and biodiversity, cultivation and breeding, agronomy and medicinal properties. Link: http://www.springer.com/978 94 017 9275 2 Download the Table of contents (pdf, 1.4 MB) ….","date":"2015-02-19","mins":"6:35 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","title":"Ash Wednesday 2015"},{"id":"comment-207063","author":"piero","post":"In the past (April 3, 2015) Hugh Farey wrote to me in this manner: >…If you could write a proposal as to how exactly you think AFM or other microscopes could add to the knowledge about the Shroud, I would be very happy to consider it. … So… I think that this kind of dialogue has a tone quite different from what we can now see for the exchange of lightnings between MPH and Colin Berry … So, before going back to “my usual obsession”, I want to remember that with regard to other techniques, different from the AFM way (which I always consider as valid system to obtain useful informations) I have already mentioned a few things … Recently (July 30, 2015) I have indicated a new way (= SINS). A way that seems to be more powerful with respect an “old method” (= ATR FTIR), because: >SINS combines two pre existing infrared technologies: a newer technique called infrared scattering scanning near field optical microscopy (IR s SNOM) and an older tried and true technique called Fourier transform infrared spectroscopy (FTIR). >A melding of these two tools, combined with the intense infrared light of the ALS, gives the researchers the ability to identify and study clusters of molecules sized as small as 20 to 40 nanometers. … Link: http://www als.lbl.gov/index.php/holding/928 new als technique gives nanoscale views of complex systems .html and in the past I wrote something around Nano MRI (that could image single biomolecules) Here a vague reference: Nanowire based magnetic resonance imaging by Raffi Budakian, Institute for Quantum Computing Here an excerpt from the abstract: >Magnetic resonance imaging (MRI) has had a profound impact on biology and medicine. >Key to its success has been the unique ability to combine imaging with nuclear magnetic resonance (NMR) spectroscopy – a capability that has lead to a host of powerful modalities for imaging spins. >Although it remains a significant challenge, there is considerable interest to extend these powerful spectroscopic and imaging capabilities to the nanometer scale. … … Links: https://uwaterloo.ca/nanomri/schedule/nanowire based magnetic resonance imaging https://uwaterloo.ca/nanomri/schedule — — Returning to the AFM way, here a paper (I think that using NEMS [= Nano Electro Mechanical Systems] sensors we can improve our level of knowledges): http://edoc.ub.uni muenchen.de/15962/1/Rieger Johannes.pdf See also a previous paper by Rieger (and others): “Energy losses of nanomechanical resonators induced by atomic force microscopy controlled mechanical impedance mismatching” Johannes Rieger, Andreas Isacsson, Maximilian J. Seitner, Jörg P. Kotthaus, and Eva M. Weigb Nat Commun. 2014 Mar 4; 5: 3345 Published online 2014 Mar 4. Http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3959189/figure/f1/ So, the simple and very rough idea is the following: try to put your (Maillard treated or fumigated, or both, or VUV or CD treated, etc.) linen fibril over the resonator (or a certain distance from the resonator…) and try to measure what happens with respect (what happens on) linen fibrils taken from the Shroud (or coming from another experiment, etc.) and already measured on the same “AFM NEMS device” … I believe that you will detect something of useful if you carefully measure (and compare) these linen fibrils submitted to vibrations (coming from the resonator)..","date":"2015-07-31","mins":"10:50 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-207073","author":"piero","post":"I apologize for that intervention “a bit too erudite” (= an intervention a bit rough…)… Science can progress if the authors sell books, papers, etc. And so the authors can eat bread, cheese and salads … or whatever way they choose! But speakers (and/or writers) who deliberately flout the maxims (see: “Flouting the Maxims”, in “Cooperative principle” by Grice) usually intend for their listener (or readers) to understand their underlying implication… Perhaps what has drifted myself out from the right way was having to see a spectroscopic technique (= SINS) which is thousands of times better than the FTIR … = >With a spatial resolution 100–1,000 times better than conventional FTIR microscopy, … But, see also a previous case: Nano FTIR – The Chemical Nanoscope Chemical “Fingerprint” Infrared Spectra at Every 20 nm Pixel Link: http://www.imaging git.com/science/light microscopy/nano ftir chemical nanoscope >We show identification of chemical compounds and chemical maps at 20 nm resolution, enabled by a novel combination of infrared spectroscopy and near field microscopy. >Nano FTIR returns the surface topography and simultaneously the local mid infrared spectrum of the tiny volume (20 nm3) just below the probing tip thus allowing correlative topography/hyperspectral infrared images. >In the case of molecular substances, comparison with common infrared databases enables local chemical recognition. … In any case we require a series of techniques that enable us to investigate samples without destructions….","date":"2015-07-31","mins":"11:41 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-207067","author":"piero","post":">…In social science generally and linguistics specifically, the cooperative principle describes how people interact with one another… Links: https://en.wikipedia.org/wiki/Cooperative principle >…Without cooperation, human interaction would be far more difficult and counterproductive. ….","date":"2015-07-31","mins":"11:09 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-207074","author":"piero","post":"Dreaming on NEMS: >Graphene electrodes revolutionize the scaling of piezoelectric NEMS resonators Link: http://www.nanowerk.com/spotlight/spotid=40427.php But… attention to breakage of the fibrils!.","date":"2015-07-31","mins":"11:49 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-192011","author":"piero","post":"John Klotz wrote: >Bracaglia may have “learned to handle his tools”, but in his statement of FACTS that prefaced his work he totally misstated the relationship between Benford&Marino and Rogers. That’s debatable … For example, reading at p 5 (= document by Bracaglia dated 1/24/2015), this seems not to be true. Am I wrong? Please… Can you add some detail (in order to be more clear)? Instead at p 8 of the same document we can read the name Gonella quoted twice. The second time is the following: On 12 December 2003, I received samples of both warp and weft threads that Prof. Luigi Gonella had taken from the radiocarbon sample before it was distributed for dating. … So… Why Klotz wrote that : >The cited paper seems to ignore the fact that … … Rogers was in possession of threads from the … … carbon data sample… … that was held back and was in possession of Gonella. (If I am right I see some error in the phrase by Klotz.) ??? — — As Thibault wrote the paper by Giorgio is not on the Shroud… It was an attempt to work about the cognitive response using Likert scale … Here a key question. Has passed the exam Bracaglia ? The sample size seemed small… and then statistical works (and I have not seen the presence for these works in that paper) turned to be problematic. Although I can (partly) agree with daveb of wellington nz about the “Confirmation Bias” by Bracaglia, I have to remember that the argument is complex. Perhaps Giorgio Bracaglia didn’t passed the “School exam”… and in any case Giorgio Bracaglia didn’t passed the “Sindonology & Shroudology exam” on this blog because there are unproved claims in that work by Bracaglia … = unproved claims about Rogers ??? For sure this verdict is not completely true. Not because …there is a similar interference problem (= peer review independence or …the failure of the Peer Review !) in both the cases considered in the paper (by Bracaglia). In my idea we have to be more clear in our discussion. For instance: What is the exact meaning for “proper protocol producing the chain of custody”? Which kind of standard protocol is required? I believe this is connected to the estimation about the exact limits of “ethical responsibility”. Another curious thing: Were the samples (by Rogers) kept in a strongbox or not? I suggest a polling about the evaluation by Bracaglia on the presumed fact that : “what Rogers failed to offer was the chronological documentation pertaining to the threads” Do you agree on that curious idea? At the end what make me near happy is the strange question (indicated by Bracaglia) about the protocols employed to avoid contamination… … and what happened in Turin during some past operations? Where are the protocols about the works done by naked hands? — — I have written in a hurry these lines. So I apologize if I have been superficial….","date":"2015-02-28","mins":"6:17 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-214814","author":"piero","post":"Last monday I have observed a textile test performed with an interesting instrument : the “Tru Burst” (by John Heal), a burst strength tester… So… I wonder about true effects coming from a sudden change (= the well known “burst of energy”) on linen cloth. Then I ask: What is your exact opinion about the speed of that presumed phenomenon?.","date":"2015-11-19","mins":"12:06 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-191950","author":"piero","post":"Bracaglia has learnt how to handle his tools and then he tried to do something. Unfortunately our Shroud world seems to be too complex to be reduced with statistical parameters … For example: recently I was a bit puzzled about the lack of answer on that controversial argument (the “little work” by Giorgio Bracaglia) from an italian person who knows the Shroud very well … Perhaps he had other problems to solve. — — I have read the interesting intervention by John Klotz, but he has forgotten that the interesting interim report done by Donna Campbell (Thomas Ferguson Irish Linen) using photographic images (found on Oxford University website) was a superficial analysis and then cannot be accurate… So… We have to do a more careful work using adequate advanced tools… As (often) I am accustomed to do in my messages (on this blog) I point the finger towards the “incontrovertible verdict” I indicated that will be obtained from the future “magical AFM works”… But, in my opinion, before these hi tech controls (on faultiness of cellulosic chains, in fact the cellulose chains cannot remain unchanged with a detectable radiation exposure, etc., etc.) a more scientific “fault finding work” can be done… That work can be extended to the entire Shroud of Turin (and then this idea follows [is consequential to] the ending suggestion by Donna Campbell about the “hidden secrets” that can be revealed…)..","date":"2015-02-27","mins":"6:16 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-212991","author":"piero","post":"In 2012 Ugo Amaldi, a well known physicist, received this Prize … Now 25 years have already elapsed since prof. Diana (Istituto Centrale del Restauro, Roma) and prof. Marinelli enunciated the idea to date the Shroud of Turin using the parameter “cellulosic DP” … But their system planned to use the viscosimetric way that consumes a fair amount of material of the ancient cloth (= a way of destructive analysis!). And even during the Symposium of Nice in 1997, while also indicating other interesting parameters, they still, reaffirmed this “old idea” (which is impossible to apply in the case of the Shroud). Instead, in Turin (in 1998) I have shown the way of analyses SP Ms (AFM and SNOM CFM) … In 1998 at University of Pisa, it was made an AFM measurement as force modulation mode, which allows to derive the dynamic mechanical properties of the sample, but… I never published the rough result obtained in 1998… = little maps [= 4.75 microns of wide] about: Topography, Elasticity, Viscosity (achieved through a calibration/comparison with Silicon)… because… I hoped to improve the level of AFM investigations (until to reach a new kind of survey for molecular chains of cellulose. See also what was previously obtained by Andy Baker in 1997 [working on cellulose crystals]). Then, see also: all my remarks about AFM nanoindentation, “AFM three point bending test”, etc., etc. And then the last hope to contact a Lab to obtain AFM Raman and SERS controls, etc. — — — Here an old bibliographic reference: “Imaging viscoelasticity by force modulation with the atomic force microscope” M. Radmacher, R. W. Tillmann, and H. E. Gaub Biophys J. 1993 Mar; 64(3): 735–742. See for example, the beginning of the inherent abstract: >Force modulation and phase sensitive detection was used to image soft surfaces with the atomic force microscope. >This force modulation microscopy allows the simultaneous recording of images of the surface profile, the storage modulus, and the loss modulus of the sample. … — — In any case (taking aside the unsolved scientific problems… sketched above in a rough manner) … I think Prof. Marinelli is a valid personage in the world of the Shroud. For example: thanks to the website “Collegamento pro Sindone” we had the opportunity to read many interesting studies and in the past the book she wrote with another italian person (Orazio Petrosillo, a journalist now deceased) was a fundamental step for an useful information against the false propaganda after the “C14 1988 results”….","date":"2015-10-19","mins":"10:15 am","url":"https://shroudstory.com/2015/10/19/emanuela-marinelli-to-receive-the-international-prize-for-catholic-culture/","cat":"news_&_views","title":"Emanuela Marinelli to receive the International Prize for Catholic Culture"},{"id":"comment-23049","author":"piero","post":"This new paper is a long (near 44 pages) and interesting document. But (into the table “Image Characteristics”, under the chapter : “Evaluation of Image Formation Hypotheses”) there is not the useful combination “contact gaseous diffusion” as we can see in other works (or hypotheses). See f. E. The old work by Volckringer (and the the Volckringer patterns could be reconstructed in 3 D relief …) who was quoted by Dobert Siefker and Daniel Spicer under “contact”. Then, see also : the past study by Eng. Marcel Alonso (CIELT) and the strange question of the japanese gyotaku. … But, unfortunately, in this new paper by Siefker and Spicer there is not the word “capillarity” … this argument was not treated (… if I was right in my reading of the file). — — In any case the question I7.0 (ID) = convex “hills” (the convex hills of the face = eyeballs and tip of the nose !), seems to be an interesting argument. What is your idea about these particular “hills” ? I hope you have the possibility to control the inherent x, y, z data obtained from the different images of the Shroud taken in the past. Then, see also : the old question of the grain (observations by Barrie Schwortz, an expert in this field) in the photographs by Enrie, the different kind of resolution, etc., etc. (included the images taken by HAL 9000, a company specializing in Art photography !) … — — Regards, Piero B. T. W. : Have you tried to see what happens (= detailed image analysis) using the images taken by the company Hal 9000 of Novara ?.","date":"2013-01-30","mins":"11:59 am","url":"https://shroudstory.com/2013/01/30/dj-vu-or-what/","cat":"uncategorized","title":"Déjà vu or what?"},{"id":"comment-176948","author":"piero","post":"Unfortunately I have not yet heard the words of Jackson … I want someone who has seen the movie and then drop us a useful message (a contribution to our discussion). — — So… Which will be the winning novel methodology ? What will be the new winning technology? — — I believe that Raman controls of 2002 should have been displayed. Instead… What happened in Turin? Why there have never been shown that data? — — Here what says the inventor of the AFM, Christoph Gerber : “My research has been focused on nanomechanics ever since we first developed the AFM more than 25 years ago…” Link: http://nanotechweb.org/cws/article/multimedia/59653.","date":"2014-12-16","mins":"8:59 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","title":"Future Testing of the Shroud"},{"id":"comment-212992","author":"piero","post":"I think there is also an interesting fact to take into account: the Construction of the Teachers’ House this building grows thanks to the contributions collected by the initiative of Emanuela Marinelli and Observo Onlus… Links: http://www.observo onlus.org/v2/en/kwauso school/ http://www.kwausoschool.org/p/knowing.html http://www.kwausoschool.org/p/support us.html.","date":"2015-10-19","mins":"10:33 am","url":"https://shroudstory.com/2015/10/19/emanuela-marinelli-to-receive-the-international-prize-for-catholic-culture/","cat":"news_&_views","title":"Emanuela Marinelli to receive the International Prize for Catholic Culture"},{"id":"comment-176954","author":"piero","post":"Atomic force microscopy (AFM) can be used to image in real time the structural changes of treated samples. And I have read that: >the molecular volume of the protein particles can be determined from particle dimensions derived from AFM images. Then… I think it’s possible the following fact: >the molecular volume of the cellulosic chains can be determined from chain dimensions derived from AFM images… Thus the degree of polymerization will be determined via AFM… in order to know the age (epoch) of the material..","date":"2014-12-16","mins":"9:19 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","title":"Future Testing of the Shroud"},{"id":"comment-177489","author":"piero","post":"Compare a meeting on the Shroud a strange gathering of “UFO fanatics” (I once went up to San Marino to follow an UFO conference…) seems a bit ‘too irreverent. Am I wrong in my criticism of this message sent by Hugh? Barberis is the director of CIS of Turin and certainly should not be an amateur scientist … So … what is your reply? In order to clarify … I add that I have not been able to hear what were the words spoken during the meeting. So: are just so much difficult to realize the tests with the use of the techniques SPM (which I have emphasized so much)? The mechanical degradation experiments can be improved with the use of AFM. See also: the AFM three point bending test, etc. What do you think about this vague note about the use of AFM?.","date":"2014-12-18","mins":"4:57 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","title":"Future Testing of the Shroud"},{"id":"comment-179623","author":"piero","post":"I believe it would be important to be able to select the material (for example: the fibrils that were far from fire damage in 1532 …) if we want to know the real age of that Ancient Linen Sheet. It would be nice to be able to do the mapping of the entire linen sheet, but I think this is just a utopia, far from reality… In any case, the SPM mapping [= obtained with the use of AFM techniques] of certain areas (to be able to derive a set of data that give us hope of known what is the true age of the material) would be a very useful thing. — — Another thing that I consider as feasible is the comparison with the results from the future SPM mapping for Sudarium of Oviedo. I have at hand an “old book” by Mark Guscin (“The Oviedo Cloth”), published in 1998. This book has been translated into Italian language only in 2007! … So you should go and see the strange stories: … Mario Moroni, Jodi Barnhill (Arizona Univ.), Paul Damon, Timothy Jull, etc. … So I believe that a comparison with the methods SPM (= control systems nondestructive) would be very helpful! What is your opinion?.","date":"2014-12-28","mins":"10:44 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","title":"Future Testing of the Shroud"},{"id":"comment-201188","author":"piero","post":"This lucky people was able to see the Holy Shroud thanks to the Holy Father! Pope Francis contributed money to cover the expenses. Thus, the struggle against the evil of this world began … See also today’s visit (by the Pope) in Sarajevo. = Pope Francis visits Sarajevo, ‘Jerusalem of Europe’ Link: http://edition.cnn.com/2015/06/06/europe/bosnia pope francis visit/.","date":"2015-06-06","mins":"5:10 am","url":"https://shroudstory.com/2015/06/03/homeless-from-rome-visit-shroud-of-turin/","cat":"2015","title":"Homeless From Rome Visit Shroud of Turin"},{"id":"comment-75161","author":"piero","post":"I have found the following link (but the text is wriitten in italian language !) : http://www.globalist.it/Detail News Display?ID=53979&typeb=0&Furto reliquia di papa Wojtyla spunta la pista estera Title : Furto reliquia di papa Wojtyla, spunta la pista estera — This article was published today : giovedì 30 gennaio 2014 h = 06:11 — — — B.T.W. : reading the italian words : >… La chiesetta, che sorge alla falde aquilane del Gran Sasso, tra le frazioni di Camarda ed Assergi, è la prima dedicata a Karol Wojtyla, che il prossimo 27 settembre sarà canonizzato insieme ad un altro amatissimo pontefice, Giovanni XXIII. I have discovered an error : “27 settembre” instead of “27 aprile” !!! Here the conclusive part of the text (sorry, in italian language !) : >… La reliquia è un pezzettino di stoffa, contenuto in un’ampolla, dell’abito che il pontefice indossava durante l’attentato in piazza San Pietro, il 13 maggio 1981. = The relic is a little piece of cloth and it was contained in an ampulla (= small bottle or phial … Then it is easy to hide that relic !) >A donarla al santuario, nel 2011, fu l’arcivescovo di Cracovia Stanislaw Dziwisz, per 50 anni segretario di Wojtyla. E proprio dal cardinale è partito un appello a chi ha compiuto il furto sacrilego affinchè i profanatori del santuario della Ienca restituiscano la reliquia del Beato prima della sua canonizzazione. «La reliquia, del resto – afferma Dziwisz – non ha alcun valore commerciale, ma solo enorme peso affettivo legato alla devozione di tanti fedeli». — — — If you want to read the english text you have to translate the italian words otherwise, see also under : http://www.thegatewaypundit.com/2014/01/thieves steal vial of pope john paul iis blood from italian church/ >In 2011, John Paul’s former private secretary, Cardinal Stanislaw Dziwisz, gave the local Abruzzo community the relic of the late pontiff’s blood, exhibited at the Shrine in San Pietro della Ienca. (L’Aquila) >Thieves broke into the Shrine in San Pietro della Ienca in the mountains east of Rome and stole a vial of Pope John Paul II’s blood. — — and … try to read under the address : http://www.santuariogiovannipaolo2.com/english.html.","date":"2014-01-30","mins":"9:44 am","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","title":"How Safe is The Shroud of Turin?"},{"id":"comment-75675","author":"piero","post":"I have read the interesting words under the address : http://www.adnkronos.com/IGN/Aki/English/Religion/Italy John Paul II relic found after theft from church 321172985681.html.","date":"2014-02-01","mins":"7:25 am","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","title":"How Safe is The Shroud of Turin?"},{"id":"comment-198858","author":"piero","post":"Archaeometry and Time: The strange Case of “Turin Shroud Archaeometry” … Seventeen years and no one has been able to determine anything from the point of view of nanometric Research (see also: AFM controls…)! In my opinion, this is the stunning fact, an incredible stop to the Archeometry (despite the interesting claims by Campanella and the attempts by prof. Giulio Fanti, etc., etc.)! No true advances in archaeometric research … this is the sad situation (IMO)..","date":"2015-05-11","mins":"9:58 am","url":"https://shroudstory.com/2015/05/09/james-randi-visits-the-shroud-of-turin/","cat":"other_sites","title":"James Randi Visits the Shroud of Turin"},{"id":"comment-184849","author":"piero","post":"Sorry, I tried (using “Google translation”) to translate a message that I wrote yesterday… — — — — — Here’s what I could define as: “The theological proof of a simple error in prediction about the Shroud of Turin” … What can you tell us the Science of God, theology? We know that with the Incarnation the Son of God became man, with Death and subsequent Resurrection Life of the Son of God passed by the Incarnation on this Earth to the Mystery of Life Eternal. ——————— I do not think you can get to say that the Resurrection is arising from a disembodiment of God (perhaps the only infinitesimal moment of the passing of His Body from this World [perishable] to Eternal Life can be seen as a disembodiment, that what may seem the “true Death of God” … a real “disappearance infinitesimal” …). Also I think that a “disembodiment of God” is a strange theological concept and I do not think anyone has ever deepened. Anyway I’ll try to read up about another time … — — — Now I can not immediately put to argue that, in this step, can not be originated trace extremely significant (ie: the effects of nuclear radiation … and many other gadgets you want to bring up …), but my mind can understand very well that if there is a test observable (ascertainable by anyone with the will to investigate, of course …) of something that is not belonging to the ordinary “natural course of events”, then varies the normal condition of man’s freedom before the Mystery of God … In short, free will it can be “crippled” in the sense that in front of “incontrovertible material evidence” of the Resurrection of Jesus (… And this, in a nutshell, what this means? The likely elimination of a Mystery of Faith! That is a fact not permitted by the normal Christian doctrine …) we would not be free (in our belief) but conditioned by a test material … and therefore the merit of our faith would be much diminished, or perhaps (even) voided (… and, among other things, about what I keep doubts) … So that account (consequential) can be drawn? I take it you do not find what they say Antonacci and Linder (= evidence of nuclear radiation, isotopic significant changes, etc.) …and others (Siefker) … “Now if Christ is proclaimed as raised from the dead, how can some of you say that there is no resurrection of the dead?” = 1 Corinthians 15:12 You may get to deduct that existed the Resurrection of Our Lord Jesus Christ (from the testimony of the disciples, the Eucharistic miracles, etc., Etc.), but give the proof of this on the basis of material effects even currently observable (= altered by nuclear radiation, etc.). I think both act contrary to common sense … The Resurrection of Our Lord Jesus Christ was and is only made in the hearts of the disciples, in the conversion … What Hope to save us we could have if we did not have more merits resulting from the Faith? In conclusion: Science can not explain a mystery of faith. Science is the result of a human construction (and it is coming from the origins sometimes obscure or even mysterious connections = see f.e. The life of Newton […and what seems to us to be able to classify as his biblical and alchemical rantings. B.T.W. : Isaac Newton wrote fellow alchemist Robert Boyle a letter urging him to keep “high silence” in publicly discussing the principles of alchemy…]) during centuries … and sometimes fallible … really it is not infallible … If science comes to really explain a mystery of Faith, then it seems to me possible to infer that the Mystery, in a certain sense, is no longer a mystery, it has become something demonstrated that one can not subtract, and, consequentially, the degree of freedom of man facing a Mystery revealed it is involved … — * — * — I’d be really curious (and at the same time, almost very intimidated …) if the predictions of Lindner (= radiocarbon dates move into the future!) come true (established after the appropriate controls) … In fact: what sense could have that “radiocarbon date in the future,” seen as “proof of the Resurrection”? In that case we would have still kept our freedom? No doubt it would be a major stumbling block … and perhaps the only logical explanation that would be immediately indicated would be the objection that these radiocarbon results in the future would result from netron irradiation of the Cloth, presumably in modern times … Strange stories … Perhaps it is better to work in our field more restricted. So the strange matter about emanations of neutrons arising from piezonuclear reaction would not be even a story to be discarded altogether. But apparently this is weak thinking. In any case turns up the question: … at what epoch would receive the Cloth a neutron irradiation? Obviously, you can not go beyond these speculations without running the risk of entering into delusions … or make rapturous applause without rationality….","date":"2015-01-20","mins":"9:19 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-184887","author":"piero","post":"I apologize for the bad translation of what I wrote yesterday (in Italian language), the result (despite the attempt done with a correction of text) was not much precise … See also other mistakes : netron instead of neutron, etc. … and … Linder instead of Dr. Arthur Lind. Because (perhaps) “Linder” was a sort of mix of Lind and Lindner… In the past Eberhard Lindner presented his hypothesis (before the works by Antonacci and Lind): the high C14 content found by the laboratories is explainable if the Shroud was irradiated with neutrons 2000 years ago. [link: https://www.shroud.com/pdfs/ssi3233part4.pdf … B.T.W.: during the same meeting (held in Paris) an old student of the Shroud (since 1942), Dr. Sebastiano Rodante indicated that the Image was formed by natural means: bloody sweat, aloes and myrrh … and several repeated experiments (sometimes on a corpse) in the catacombs of Siracusa have given imprints that are superficial, 3 dimensional and without deformation… ] If neutrons radiated the shroud, the effects can be detectable. Why many people believe that neutrons were emanated during the Resurrection? We have to see a clear proof instead of fairy tales. How the radiocarbon date would be altered and changed to a younger date ? Barbesino, Moroni and Bettinelli have shown us something (in the past). Where are (truly) new proofs? Reactions with Nitrogen (“indigenous to the flax”…) into the flax??? See under: http://www.acheiropoietos.info/proceedings/Lind Web.pdf Mark Antonacci is an attorney, instead Dr. Arthur Lind is a senior scientist and a past manager and research director. But … Where is their true expertise in the field of textile studies? Lind has spoken in this manner: “I like solving problems, so this is a problem that I’m trying to solve.” But, until now, they have not at hand the required proofs. And then, see also the past strange stories about the Sudarium of Oviedo and the lack of new analyses… I would prefer to focus on the old problem of dating, but see my old proposal (= a failed attempt sent to Dallas Conference, 2005) attempting to use the sensors SSNTD (= Solid state nuclear track detectors) in appropriate experiments (in any case treated linen samples have to be observed under adequate AFM controls) … Now I have just found a curious information: A novel nanometric DNA thin film as a sensor for alpha radiation, a paper by Atul Kulkarni, Byeonghoon Kim, Sreekantha Reddy Dugasani, Pranav Joshirao, Jang Ah Kim, Chirag Vyas, Vijay Manchanda, Taesung Kim & Sung Ha Park Abstract: >The unexpected nuclear accidents have provided a challenge for scientists and engineers to develop sensitive detectors, especially for alpha radiation. Due to the high linear energy transfer value, sensors designed to detect such radiation require placement in close proximity to the radiation source. Here we report the morphological changes and optical responses of artificially designed DNA thin films in response to exposure to alpha radiation as observed by an atomic force microscope, a Raman and a reflectance spectroscopes. In addition, we discuss the feasibility of a DNA thin film as a radiation sensing material. The effect of alpha radiation exposure on the DNA thin film was evaluated as a function of distance from an 241 Am source and exposure time. Significant reflected intensity changes of the exposed DNA thin film suggest that a thin film made of biomolecules can be one of promising candidates for the development of online radiation sensors. — — The unexpected nuclear accidents = See also: The Fukushima nuclear accident on March 2011, etc. … The radiation effect on thin films was also studied using Raman spectroscopic analysis to determine the influence of exposure time and the distance of the film from the radiation source. Then, please, observe the comparative Raman spectra without and with radiation exposure… The radiation source (in that work) 241 Am, emits alpha particles. And alpha particles, consisting of helium nuclei, are emitted by various isotopes of actinides including Th, U, Np, Pu, Am and Cm. … So it remains to see the composition of the stones of the walls where the Holy Shroud was guarded. For example: I would start examining some site of Turin …. What do you think of this “obvious idea”? Link: http://www.nature.com/srep/2013/130624/srep02062/full/srep02062.html.","date":"2015-01-20","mins":"12:45 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-215244","author":"piero","post":"Thibault, What do you think about the SERS technique? — — — Here’s another particular question: Do you know of any treatment system of linen clothes with colloidal gold, then subjected to radiation, in order to obtain interesting images? Is there any hope of getting images, even improving the “particular systems” used by De Liso (during earthquakes)? Link: http://pubs.acs.org/doi/abs/10.1021/j150508a015 The Formation of Colloidal Gold John Turkevich, Peter C. Stevenson, J. Hillier J. Phys. Chem., 1953, 57 (7), pp 670–673 Publication Date: July 1953 — — — Here another address: http://pubs.acs.org/doi/abs/10.1021/acsnano.5b01579 = “Turkevich in New Robes: Key Questions Answered for the Most Common Gold Nanoparticle Synthesis” ACS Nano, 2015, 9 (7), pp 7052–7071 Publication Date (Web): July 16, 2015 Copyright © 2015 American Chemical Society Here there is beginning of the Abstract: >This contribution provides a comprehensive mechanistic picture of the gold nanoparticle synthesis by citrate reduction of H Au Cl4, known as Turkevich method, by addressing five key questions. >The synthesis leads to monodisperse final particles as a result of a seed mediated growth mechanism. … etc. ….","date":"2015-11-28","mins":"11:12 am","url":"https://shroudstory.com/2015/11/27/i-hope-this-helps/","cat":"reader_inquiry","title":"I Hope This Helps"},{"id":"comment-185414","author":"piero","post":"Here I want to consider another time the following questionable statement (taken from the words by Siefker) : >The body image would lose its optical properties, a result of alignment being lost over time possibly just by moving the cloth through earth’s magnetic field such as when the cloth is being transported. (“The Enigma of the Apparent Age of the Shroud of Turin … etc. …”, slide 67 of 112) because, in my opinion, this is a too vague hypothesis … Where is the true proof on linen fibrils ? Where are inherent experiments or useful references ? Yesterday I didn’t consider the questions: What were the exact conditions during the transport of the relic to/from Montevergine (Avellino)? Who was the responsible about the (possible) photographic controls? But I believe that I answered to the following question: Where are the exact comparisons on inherent images? because I indicated as irrelevant the possible comparison and this was due to the inherent (probable) small magnitude for the presumed effects… — — — Here the last phrase (of the same slide): >Also, until confirmed the body image should be protected from any extraneous magnetic fields such as magnets and electrical transformers. So … Which kind of magnetic fields were present during controls of 1978 (and subsequent “manipulations”)? Another strange thing = slide 65 of 112 : “The Resurrection Event” = “The electric current is running along the threads of the linen cloth and normal to the surface as is the magnetic field …” In normal conditions electric current doesn’t run along threads of linen because linen is an insulating material. So, Siefker had not specified in a clear manner what were these particular conditions. In short, there is not this useful explanation… —————————————– Here the last curious thing. Observing the document that appears on the slide 83 of 112 we can read: Measured C14 age = 106.8 (and then this is not 2400 !) Then : near 100 years old = “modern”… as you can easily read in that paper. Perhaps that result was a “good approximation” for radiocarbon dating a modern book… On the other side (see at right side of this slide) there was only a simple explanation about the Dendro Calibration ( = Calibration of Radiocarbon Age to Calendar Years…) with an example… Am I wrong in my conclusion? I hope in your attention….","date":"2015-01-22","mins":"12:08 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-185417","author":"piero","post":"The ultimate horrible dream that I made last night was that of two dogs … one of them had broken the head of the other poor dog, with bites… and then, after that scene, the living dog complained in a heartbreaking way… I beg your pardon… Sorry!.","date":"2015-01-22","mins":"12:20 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-185689","author":"piero","post":"Well. But now we have to work a lot for the other open questions… — — Perhaps my words about “The ultimate horrible dream” were a strange reaction, but really I really had this nightmare, after all (ultimately) our brain is working 24 h / 24 hours … Now (perhaps) it is an exaggeration to say that we have foiled the beginning of an attempt to validate the SHC myth / enigma discovering that banal error… Here I want to respect the memory of Sue Benford and I am friend of Joe Marino. I don’t want to discourage the experiments of who believe in SHC, but (now) I am more inclined to believe what underlined Hugh (at the beginning of this discussion) about a certain strange world… Now I pose my question: Is it possible that none of the researchers present at the meeting (= during Saint Louis Conference 2014) detected that simple mistake? That story seems to be too strange. But, always, it can happen a simple fall of attention….","date":"2015-01-23","mins":"8:59 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-215136","author":"piero","post":"If Jesus had not died on the Cross what would be the salvation for humanity? This can only be an unanswered question because it is out of the true History … And the very real history tells us that the stele of Merneptah contains the first mention of the name of Israel in any ancient text survived and offers us the basic question: Who were the Semites in Egypt? For example: it was not found any mention of the name Israel in any of inscriptions or documents related to the period of the Hyksos, nor it appears in Egyptian inscriptions later or in rich cuneiform archives of the fourteenth century BC found at Tell el Amarna in Egypt, which also contained about four hundred letters that describe in detail the social, political and demographic conditions of Canaan at that time. Source: The Bible Unearthed. Archeology’s New Vision of Ancient Israel and the Origin of Its Sacred Texts Israel Finkelstein and Neil Asher Silberman B.T.W.: I bought this book (already mentioned by some friends of this blog) in April 2002. Link: https://en.wikipedia.org/wiki/The Bible Unearthed Well… The life story of the man who (instead) later became a famous American president, John F. Kennedy, would have been different if … an aristocrat: Karin Adele Gunilla von Post Miller [usually Gunilla von Post] (July 10, 1932 – October 14, 2011) had married JFK… >… …”Love, Jack” is the story of a transcendent but heartbreaking love between two people at the peak of their youth and beauty, a love that seemed impossible but could not be denied. Here is an intimate portrait of John Kennedy never before seen: a gentle, kind, and caring man, intensely passionate and full of life but a man who faces great difficulty adjusting to the demanding role history and his father have assigned him. … … https://books.google.it/books/about/Love Jack.html?id=P Zf Zp Cp3 w QC&redir esc=y https://en.wikipedia.org/wiki/Gunilla von Post So, what is “the moral of the story”? “If wishes were horses, beggars would ride.” …Is that? Otherwise: “Faillure on your wife’s part for not staying faithful (or your own part for not keeping her satisfied.)”! And there is another sort of slander: “The one charm of marriage is that it makes a life of deception a necessity” [Oscar Wilde] Who benefited from the sacrifice of the young US President?.","date":"2015-11-26","mins":"10:49 am","url":"https://shroudstory.com/2015/11/23/jfk-and-the-shroud-of-turin/","cat":"news_&_views","title":"JFK and the Shroud of Turin"},{"id":"comment-183725","author":"piero","post":"I think that Turin has a different situation compared to Rome. In any case I think has already been taken “into due consideration” in this blog, the attempt of a dialogue with Islam (= Co.Re.Is… Which, however, does not represent all Muslims in Italy …) implemented by Msgr. Ghiberti. Unfortunately our own dialogue was not very fruitful… — — Today I have read an article (Newspaper source = “Corriere della Sera”) titled: Terrorismo: compare il Colosseo sul sito online dell’Isis La scritta: «Domani il Corano a Roma come a Parigi». Lo rende noto il sito Wikilao Rough translation = Terrorism: the Coliseum appears on the site online Isis. The inscription: “Tomorrow the Koran in Rome as in Paris.” This was announced by the site Wikilao ROMA – Sono molti gli avvertimenti minacciosi per l’Italia comparsi sul web all’indomani delle azioni in Francia dei fratelli Kouachi e di Amedy Coulibaly, alcuni dei quali esaminati con particolare attenzione dagli 007… Rough translation = ROME – Many warnings threatening Italy appeared on the web in the aftermath of the shares in France brothers Kouachi and Amedy Coulibaly, some of which have been examined with particular attention by the 007 agents… — — — Here what appeared in the past (= last year), posted on Aug, 29 2014 @ 04:17 PM >the Roman newspaper “Il Tempo” published a disturbing report that Francis is “in the crosshairs” of ISIS for “bearing false witness” against Islam. Citing anonymous sources within Italy’s intelligence community and pointing to notable heightened security in Rome, the paper went on to say that ISIS plans to heat things up by “raising the level of confrontation” with Europe, Italy and very specifically Pope Francis, the “greatest exponent of the Christian religions.” >The Vatican downplayed the concerns, calling them unfounded despite growing concern in Italy that it is not just the Pope who is under threat. “There is nothing serious to this,” Vatican spokesman Federico Lombardi told Catholic News Agency. “There is no particular concern in the Vatican.” … … — — Here another question: Manfredonia, nasce il premio “Je Suis Charlie” = “Vietate le vignette contro le religioni” Fa discutere il regolamento del concorso “Carnevale in satira” dedicato alla rivista parigina colpita dall’attacco del 7 gennaio. Rough translation: Manfredonia, founded the prize “Je Suis Charlie” = “Prohibited cartoons against religions” Debates on regulation about competition “Carnival in satire” dedicated to the Parisian magazine affected by the attack of 7 January. Link: http://www.tgcom24.mediaset.it/cronaca/puglia/manfredonia nasce il premio je suis charlie vietate le vignette contro le religioni  2089721 201502a.shtml The Carnival of Manfredonia, now in its 62nd edition, will start on 17 January. But there is time until February 13 to try to win the first “Award Carnival Satire: Je Suis Charlie”. — — — **** — — — In Conclusion … …But who would have an interest in destroying that Ancient Linen cloth? I don’t know. What are your views on the problem of security?.","date":"2015-01-16","mins":"9:43 am","url":"https://shroudstory.com/2015/01/13/just-thinking-about-security/","cat":"2015","title":"Just Thinking About Security"},{"id":"comment-19299","author":"piero","post":"I have just seen the new and interesting images. It will be interesting to see the UV photographies … Where are ? At present it seems that Barrie Schwortz was not able to obtain these simple and useful UV controls. In any case, if in the next year we can see the other images, then I hope to read the inherent explanations … What is your opinion ?.","date":"2012-11-21","mins":"9:59 am","url":"https://shroudstory.com/2012/11/21/last-update-this-year-to-shroud-com/","cat":"news_&_views","title":"Last update this year to shroud.com"},{"id":"comment-152200","author":"piero","post":"Hugh wrote: > … … I think that after very careful examination of the whole Shroud, he will find that the medieval patch measures about 440cm x 110cm… So … We have to know the epoch for that ancient linen using a non destructive method and AFM measurements of elastic modulus are an interesting way … — — See, for example, the study : Probing delicate samples: stiff AFM mechanics at soft forces Link: http://iopscience.iop.org/0957 4484/labtalk article/48521 >Atomic force microscopy (AFM) measurements of nanoscale mechanical properties can require relatively large forces to probe elastically stiff materials such as metals or ceramics. Such forces are potentially damaging, particularly to thin or delicate samples. Recently, researchers have demonstrated a solution to this dilemma. The new method enables AFM measurements of elastic modulus with forces less than 20 n N, roughly 10 times the force needed to break a single atomic bond. — — Jason P Killgore and Donna C Hurley 2012 Nanotechnology 23 055702 doi:10.1088/0957 4484/23/5/055702 Low force AFM nanomechanics with higher eigenmode contact resonance spectroscopy link : http://iopscience.iop.org/0957 4484/23/5/055702/ >Atomic force microscopy (AFM) methods for quantitative measurements of elastic modulus on stiff (>10 G Pa) materials typically require tip–sample contact forces in the range from hundreds of nanonewtons to a few micronewtons. Such large forces can cause sample damage and preclude direct measurement of ultrathin films or nanofeatures. Here, we present a contact resonance spectroscopy AFM technique that utilizes a cantilever’s higher flexural eigenmodes to enable modulus measurements with contact forces as low as 10 n N, even on stiff materials. Analysis with a simple analytical beam model of spectra for a compliant cantilever’s fourth and fifth flexural eigenmodes in contact yielded good agreement with bulk measurements of modulus on glass samples in the 50–75 G Pa range. In contrast, corresponding analysis of the conventionally used first and second eigenmode spectra gave poor agreement under the experimental conditions. We used finite element analysis to understand the dynamic contact response of a cantilever with a physically realistic geometry. Compared to lower eigenmodes, the results from higher modes are less affected by model parameters such as lateral stiffness that are either unknown or not considered in the analytical model. Overall, the technique enables local mechanical characterization of materials previously inaccessible to AFM based nanomechanics methods. ————————————————— There are two systems : flexural tests and indentation tests… For this second system, see the nanoindentation : >Nanoindentation is a variety of indentation hardness tests applied to small volumes. Indentation is perhaps the most commonly applied means of testing the mechanical properties of materials. The nanoindentation technique was developed in the mid 1970s to measure the hardness of small volumes of material… http://en.wikipedia.org/wiki/Nanoindentation — — Here a vague reference (not in the field of textiles) : Calculation of Young’s modulus value by means of AFM. Roa JJ, Oncins G, Diaz J, Sanz F, Segarra M. Recent Pat Nanotechnol. 2011 Jan;5(1):27 36. Abstract >In the last years, Atomic Force Microscopy (AFM) has become a powerful tool not only to study the surface morphology but also the nanomechanics of all kind of samples. In this paper, the applicability of this technique is reviewed and its basic aspects of operation, advantages and drawbacks of using the AFM probe as a picoindenter (Force Spectroscopy mode, FS AFM) are discussed. The patents concerning picoindentation measurements are discussed in the text and special attention is paid to measurements performed on hard materials as ceramics, as they have not been as thoroughly reviewed in the literature as in the case of soft matter. The possibilities of AFM in the nanomechanics field include the quantitative determination of the Young’s modulus (E) and the transition force from elastic to plastic deformation regimes, the measurement of adhesion forces and deformation mechanisms while applying vertical forces in the range from tens of p N to μN..","date":"2014-09-18","mins":"7:59 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","title":"Let’s Agree to Agree?"},{"id":"comment-152212","author":"piero","post":"I hope I was understood when I indicated dating tests based on AFM three point bending tests, etc., etc. … After mentioning the possibility of using AFM microscopy (in order to find the elastic modulus), I would not want my vague guidelines and considerations are misrepresented as the words of Hawkings (and Hawking’s bitter attitude towards the Higgs Boson is understandable). Here I refer to the recent interpretations of the thought of Hawkings (= Higgs Boson could spell the end of the universe – Stephen Hawking). Higgs’ elementary particle underpins existence in our universe might become unstable, warns renowned physicist Stephen Hawking. The energy potential of the ‘God particle’ is so vital for the entire universe it could make the cosmos collide, he concluded. Link: http://rt.com/news/185876 universe elimination higgs boson/ With a sarcastic note in fact Hawking adds that “a particle accelerator capable of reaching 100 billion Ge V would be bigger than the Earth, and it is unlikely that we can get the funding to make it happen in the current economic climate.” According to the physicist, however, in the event that it be built, the Higgs boson “could become metastable at energies exceeding 100 billion giga electron volts (Ge V).” Basically, if scientists were to undertake a similar experiment, the universe could suffer a catastrophic decay of the vacuum, ie, the bubble of the true vacuum would expand at the speed of light. The disaster according to Hawking “could happen at any time” … — — Perhaps the matter of the body of Jesus became metastable in a strange manner. Who knows … ??? … In any case I hope that both heresies and false Teachings, they stay far from me ! I was just talking about the applications of advanced microscopy… — — What are your comments ?.","date":"2014-09-18","mins":"8:55 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","title":"Let’s Agree to Agree?"},{"id":"comment-152507","author":"piero","post":"I apologize about the stories on the Higgs boson and the end of the universe. — — I was curious about the following idea : the matter of the body of Jesus became metastable … and you can speculate on the void left by the body of Jesus … — — If Higgs Boson Calculations Are Right, A Catastrophic ‘Bubble’ Could End Universe Link: http://www.npr.org/blogs/thetwo way/2013/02/19/172422921/if higgs boson calculations are right a catastrophic bubble could end universe — — — In any case, under the address: http://en.wikipedia.org/wiki/False vacuum there is the following explanation: >In quantum field theory, a false vacuum is a metastable sector of space that appears to be a perturbative vacuum, but is unstable due to instanton effects that may tunnel to a lower energy state. This tunneling can be caused by quantum fluctuations or the creation of high energy particles. Simply put, the false vacuum is a local minimum, but not the lowest energy state, even though it may remain stable for some time. This is analogous to metastability for first order phase transitions. … and also: >… For decades, scientific models of our universe have included the possibility that it exists as a long lived, but not completely stable, sector of space, which could potentially at some time be destroyed upon ‘toppling’ into a more stable vacuum state. >The Standard Model of particle physics opens the possibility of calculating from the masses of the Higgs boson and the top quark, whether the universe’s present electroweak vacuum state is likely to be stable or merely long lived. … >… … catastrophic bubble of “true vacuum” (per quantum models) could theoretically occur at any time or place in the universe, which means (because the bubble of “true vacuum” will expand at the speed of light) the end of such a false vacuum could occur at any time. … — — Speculations ….","date":"2014-09-19","mins":"11:19 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","title":"Let’s Agree to Agree?"},{"id":"comment-23773","author":"piero","post":"I’m personally fascinated by the vast unknowns in our own studies about the Holy Shroud … AFM based (chemical and mechanical) properties mapping technique can be the useful ways to open the doors. What is your idea ? Regards, Piero.","date":"2013-02-08","mins":"9:59 am","url":"https://shroudstory.com/2013/02/07/mean-and-picayune/","cat":"news_&_views","title":"Mean and Picayune"},{"id":"comment-23779","author":"piero","post":"Last year I read (on nanotechweb.org) the following title : “Probing delicate samples: stiff AFM mechanics at soft forces” See : http://nanotechweb.org/cws/article/lab/48521 And then the interesting words for the useful research about the ancient linen fibrils (coming from the samples taken in the past from the Holy Shroud) were : >Atomic force microscopy (AFM) measurements of nanoscale mechanical properties can require relatively large forces to probe elastically stiff materials such as metals or ceramics. Such forces are potentially damaging, particularly to thin or delicate samples. >Recently, researchers have demonstrated a solution to this dilemma. >The new method enables AFM measurements of elastic modulus with forces less than 20 n N, roughly 10 times the force needed to break a single atomic bond. >Researchers Jason Killgore and Donna Hurley at the National Institute of Standards and Technology in Boulder, US, achieved these results using an AFM technique called contact resonance spectroscopy So … Bulder is located in Colorado … Am I right or not ? I tried to see under the address : http://en.wikipedia.org/wiki/National Institute of Standards and Technology but there is not a great amout of informations. In any case this technique was the point where the concrete hope to know the truth about the linen fibrils of the Holy Shroud can start. And now (perhaps) there are the interesting improvements for this way. — — What is your opinion ? Have you tried to look ? — — Regards, Piero P. S. Instead, in the case of the Jospice Imprint (Liverpool Man : http://www.shroud.com/pdfs/mattress.pdf = “The Jospice mattress cover image”, by Dr. Fred Zugibe) the outside coating was polyurethane, because the manufacturers indicated that the nylon was nylon 6 and that the outside coating was polyurethane … So I tried to search something of interest and then I think that under the address : http://www.sciencedirect.com/science/article/pii/S001430571000340 X You can find the following study : Quantitative mapping of elastic moduli at the nanoscale in phase separated polyurethanes by AFM European Polymer Journal Volume 47, Issue 4, April 2011, Pages 692–698 >Nanoscale mechanical properties of segmented polyurethanes have been investigated by two novel dynamic imaging modes of AFM. Varying stoichiometric ratio of isocyanate and hydroxyl groups resulted in polyurethanes samples with characteristic fingerprint AFM phase images. AFM resolves the elastic moduli of stiff and soft segments of the phase separated polyurethane samples at nanoscale resolution. >Mechanical mappings were in excellent agreement for both modes, opening novel avenues for nanoscale mechanical characterization of heterogeneous polymers. > The PU samples studied show characteristic “fingerprint” AFM phase images. >Novel dynamic imaging modes of AFM, including Harmoni X material mapping and Peak Force Tapping were used to assess the mechanical performance of phase separated polyurethanes quantitatively as a function of their molecular structure. >The values of surface elastic moduli were determined with nanoscale resolution and were in excellent agreement for both AFM modes. >While tensile testing provides a bulk average value for the elastic modulus of the elastomers, the novel AFM based elastic moduli mappings introduced enable the study of surface stiffness with nanoscale resolution in a quantitative way. I hope that you can find an answer for these long gossiping (or boring ?) technical (= Applied AFM on linen, “ghosts” and Jospice Imprint) notes (without measurements or experiments !). PI.","date":"2013-02-08","mins":"10:28 am","url":"https://shroudstory.com/2013/02/07/mean-and-picayune/","cat":"news_&_views","title":"Mean and Picayune"},{"id":"comment-23783","author":"piero","post":"I have found the following title : MML Publishes “How To” Guide for AFM Based Nanomechanics under the address : http://www.nist.gov/mml/acmd/afm based nanomechanics bookchapter.cfm >Publication information is as follows: “Contact Resonance Force Microscopy Techniques for Nanomechanical Measurements,” D. C. Hurley, in Applied Scanning Probe Methods Vol. XI, eds. B. Bhushan and H. Fuchs (Springer Verlag, Berlin Heidelberg New York, 2009), Chapter 5, pp. 97 138. The original publication is available at http://www.springerlink.com. (Date created : February 9, 2009 | Last updated: October 2, 2012) — — — Regards, Piero and the address was the following : Material Measurement Laboratory (MML) Materials Reliability Division 325 Broadway, MS 853 Boulder, CO 80305 3328 http://www.nist.gov/mml/ >The Material Measurement Laboratory (MML) serves as the national reference laboratory for measurements in the chemical, biological and material sciences through activities ranging from fundamental and applied research, to the development and dissemination of certified reference materials, critically evaluated data, and other programs and tools to assure the quality of measurement results. MML is also responsible for coordinating the NIST wide Standard Reference Material and Standard Reference Data programs — — I have read that : >The Material Measurement Lab has more than 900 staff members and visiting scientists, an annual budget of more than $160 million, and serves as the nation’s reference laboratory for measurements in the chemical, biological and materials sciences through activities ranging from fundamental research in the composition, structure and properties of industrial, biological, and environmental materials and processes, to the development and dissemination of certified reference materials, critically evaluated data and other measurement quality assurance programs … — — Unfortunately in the interesting paper written by the Colorado team there is not the word “AFM” … Then, see under the address : https://www.fbo.gov/index?s=opportunity&mode=form&id=2d71e63be27052a2a76409e051de7578&tab=core& cview=0 Asylum AFM, Model MFP 3 D Retrofit Upgrade Jan 18, 2013 5:23 pm >The Department of Commerce, National Institute of Standards and Technology (NIST), intends to negotiate a firm fixed price purchase order, on a sole source basis, with Asylum Research Corporation, Santa Barbara, CA for the purchase of an Atomic Force Microscope (AFM), model MFP 3 D upgrade to allow top down optics for imaging opaque samples under other than full and open competition. … … >Asylum Research Corporation holds the proprietary rights to the specialized hardware and software components of the Atomic Force Microscope (AFM), model MFP 3 D system. … … — — If the scientists were able to do something on Mars (also using the AFM), then they have to be able to control the Holy Shroud using the advanced microscopy. What is your answer ? Have you a Project ? Do you know the AFM instruments ? — — — PI.","date":"2013-02-08","mins":"10:53 am","url":"https://shroudstory.com/2013/02/07/mean-and-picayune/","cat":"news_&_views","title":"Mean and Picayune"},{"id":"comment-196415","author":"piero","post":"… And here is what is my opinion: the study [= Caroline Villers, ed., The Fabric of Images: European Paintings on Textile Supports in the Fourteenth and Fifteenth Centuries. London: Archetype Publications, 2000. Paper. Pp. X, 117 plus color figures; black and white figures and 1 table] published in 2000 can not be a good starting point because I think it is necessary to use advanced microscopies (SPM = AFM, CFM, SNOM) in order to demonstrate the probable truth about the probable epoch of the Shroud of Turin!.","date":"2015-04-15","mins":"9:40 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","title":"More Testing? Maybe."},{"id":"comment-196223","author":"piero","post":"I wrote: >Archbishopp Nosiglia Instead of: >Archbishopp Nosiglia I beg your pardon. — — In short: the heat of the speech has prevailed on the correct writing — —– — I don’t think that most skeptics think the image is not a burial shroud, but a painting and a pious hoax. Another thing: I don’t know the exact weight of such a opinion… In any case I should be curious to observe the reactions regarding my past proposal (as in a good remake …submitted to the large public). What is your idea ?.","date":"2015-04-13","mins":"10:16 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","title":"More Testing? Maybe."},{"id":"comment-196222","author":"piero","post":"It seems to me that our discussions sometimes (or perhaps often) ending up in dead spots … See for example the past argument: “The Manoppello: This little cloth cannot be further ignored in Shroud research!” (June 18, 2014) “OK” answered (to me) in this manner: >Spectroscopic analysis are of course possible. >There is some minor problem with glass, which has its systematic effect on transparency indifferent wavelenght, which should be taken into account. >According to interview with prof. Jaworski (see http://www.manoppello.eu/html/jaworski.html , only polish version, sorry, try Google Translator), the glass is not transparent in the UV band that is responsible for byssus fluorescence. >The blood should be no great problem, but if you want to know my opinion, I doubt that those blood stains are real blood. Rather images of bloodstains. Have you perhaps heard interesting news about new spectroscopic examinations on the Veil of Manoppello? If we want to try to enter in the “great scientific game” we can not limit ourselves only to opinions… Demonstrate the ability to do a spectrosocpic check in transparency of a marine byssus is not difficult. In June 20, 2014 I wrote: >… years ago I have sent a request to I.N.O.A. (Florence)… >Until now (and despite the very interesting claims by Donato Vittore, Giulio Fanti, etc.) I have not yet seen the inherent useful spectroscopic examinations (= transparence spectroscopy, etc.). I do not think that the transparence spectroscopy (despite the problems highlighted by OK = … systematic effect on transparency in different wavelength, which should be taken into account, … the glass is not transparent in the UV band that Is responsible for byssus fluorescence, … etc.) is so difficult to obtain. I believe it is necessary to have work plans credible and possibly already adequately funded… or fundable. The same can be said for the controls on the materials already collected (ie, already available […if then will come the necessary permissions to perform the work!] and without having to perform additional manipulations of the Cloth) by the Holy Shroud … Charles pointed the finger toward the great deal of work done on ancient linens in recent years… Well. I don’t know what exactly he has in his mind… Instead I am sure that we have to start with what we already can have at disposal, without other manipulation on the Ancient Linen. You can get thousands of euros in support of innovation if you have credible plans. That is, if possible, with plans of multinational collaboration … So we need to work in the field of textile innovation in order to be credible and access to finance. — — — Although I judge the provocative idea of Charles as actually an impossible solution, I would like to see emerge (as contrast) the real possibility of new tests and also AFM controls on linen fibers, in order to be able to give probabilistic indications on the age of the precious material without having to destroy the same with the C14 tests! — — So… Who should give money to the adventurers? Who should give money to the adventurers, who (perhaps) want to do new (spectacular) manipulations on the Cloth? Firstly we have to work with the material already taken. In my opinion we have not yet reached the right level (apart few particular/interesting attempts by Eng. Fanti) to do the preparatory works… The issue appears to be quite serious. I hope that the Pope, the Cardinal caretaker (the Keeper, the actual Archbishopp Nosiglia) who is in Turin and the scientific advisers may well ponder the question… What is your opinion?.","date":"2015-04-13","mins":"9:59 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","title":"More Testing? Maybe."},{"id":"comment-148497","author":"piero","post":"I remember many years ago (maybe twenty …or thirty !) I saw a replica of the Virgin of Guadalupe’s icon that was in display at the Notre Dame Cathedral in Paris, France … — — I have read that: >Some claim that upon appearance of Our Lady of Guadalupe in the hill of Tepeyac where Tonatzin’s temple had been burnt by the Spanish priests, the natives accepted Our Lady of Guadalupe as Tonantzin ! But the word Guadalupe may derive from Coatlaxopeuh, meaning: “the one who crushes the serpent”, and thus perhaps relates etymologically to Quetzalcoatl, the word for the feathered serpent itself ….","date":"2014-09-04","mins":"8:16 am","url":"https://shroudstory.com/2014/09/03/new-permanent-shroud-of-turin-exhibit/","cat":"news_&_views","title":"New Permanent Shroud of Turin Exhibit"},{"id":"comment-204249","author":"piero","post":"I think that experiments about gravity and the motion of the Earth around the Sun (and the insistence on Geocentricism [or, also, Anthropocentrism??!? Please, read the note at the end]) had given serious problems because there was a certain fundamentalism in the Church … Perhaps the same can happen with gravity waves, with the “vacuum fluctuations” present before the Big Bang and the alleged “hidden dimensions” of the Universe … In short: science and cosmogonies should be separate from religion. Ie: religion can not dictate science (unless thre are in play questions of ethical principles …) and the same is true for the reverse case. That is, this is the beginning to seriously consider the separated magisteria. Then, try also to read what was said by Stephen Gould … >Non overlapping magisteria (NOMA) is the view advocated by Stephen Jay Gould that science and religion each represent different areas of inquiry – fact vs. Values – so that there is a difference between the “nets” over which they have “a legitimate magisterium, or domain of teaching authority,” and these two domains do not overlap. … Link: https://en.wikipedia.org/wiki/Non overlapping magisteria — — — I believe that you already know the topic, however it is always good to remember these issues … References about Earth’s rotation and experiments: – Jean Bernard Léon Foucault: Démonstration du Mouvement de Rotation de la Terre au moyen du Pendule. Comptes rendus de l’Academie des Sciencies, 32, 5, 1851. – Pendulum: Leon Foucault and the Triumph of Science by Amir D. Aczel SUNY Press, Nov 2007 >In 1851, struggling, self taught physicist Léon Foucault performed a dramatic demonstration inside the Panthéon in Paris. >By tracking a pendulum’s path as it swung repeatedly across the interior of the large ceremonial hall, Foucault offered the first definitive proof — before an audience that comprised the cream of Parisian society, including the future emperor, Napoleon III — that the earth revolves on its axis. … etc. … >…Richly detailed and evocative, Pendulum tells of the illustrious period in France during the Second Empire; of Foucault’s relationship with Napoleon III, a colorful character in his own right; and — most notably — of the crucial triumph of science over religion. … But, despite this particular “crucial triumph of science over religion”, few years later, in 1858, there was the message of Holy Virgin in Lourdes … In any case: >…The veracity of the apparitions of Lourdes is not an article of faith for Catholics. Nevertheless, all recent Popes visited the Marian shine. Benedict XV, Pius XI, and John XXIII went there as bishops, Pius XII as papal delegate. >Working with Le pèlerinage de Lourdes he also issued, an encyclical on the hundredth anniversary of the apparitions in 1958. John Paul II visited Lourdes three times. … … — *** — *** — Anthropocentrism, religion… and findings in Paleoanthropology. Reference: Does Jesus Save the Neanderthals? Theological Perspectives on the Evolutionary Origins and Boundaries of Human Nature. In Zygon® Abstract. >The concept of human uniqueness has long played a central role within key interpretations of the hominid fossil record and within numerous theological understandings of the imago Dei. >More recently, the status of humans as evolutionarily unique has come under strong criticism owing to the discovery of certain nonhuman hominids who, as language and culture bearing beings, lived as contemporaries with early anatomically modern humans. >Nevertheless, many scholars, including those in the field of religion and science, continue to interpret the remains of these other hominids in light of empirically ungrounded implicit assumptions about human uniqueness, which the author calls “anthropocentrism of the gaps.” >This paper argues that “anthropocentrism of the gaps” is philosophically unwarranted and thus should not be assumed by scholars in religion and science when evaluating contemporary findings in paleoanthropology. So, discussing the problems around the origin of the Universe I have felt into the Grotto of Lourdes with questions about the salvation of other humanities (… which at present are only “other humanities” lost in the fog of a prehistorical past …or imaginary “other humanities”, because we don’t know what particular story of progress they would be able to achieve)…. Ending remarks: How many thousands of years these “creatures of a different kind of humanity” would have consumed to measure both cellulosic Degree of Polymerization and Young’s modulus of linen fibrils?.","date":"2015-07-01","mins":"10:52 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204156","author":"piero","post":"Pb WO4 (= Lead tungstate) crystals are used in the CMS (= Compact Muon Solenoid’s) electromagnetic calorimeter. Stolzite is a mineral, a lead tungstate; with the formula Pb WO4. It is similar to, and often associated with, wulfenite which is the same chemical formula except that the tungsten is replaced by molybdenum. … Links: https://en.wikipedia.org/wiki/Stolzite https://en.wikipedia.org/wiki/Compact Muon Solenoid >The goal of CMS experiment is to investigate a wide range of physics, including the search for the Higgs boson, extra dimensions, and particles that could make up dark matter. >The Electromagnetic Calorimeter (ECAL) is designed to measure with high accuracy the energies of electrons and photons. >… The ECAL is constructed from crystals of lead tungstate, Pb WO4. >This is an extremely dense but optically clear material, ideal for stopping high energy particles. >Lead tungstate crystal is made primarily of metal and is heavier than stainless steel, but with a touch of oxygen in this crystalline form it is highly transparent and scintillates when electrons and photons pass through it. >This means it produces light in proportion to the particle’s energy. >These high density crystals produce light in fast, short, well defined photon bursts that allow for a precise, fast and fairly compact detector. … Well. I think there is not the same level of precision (at present) in Shroud studies! CMS and Pb WO4: >The CMS electromagnetic calorimeter consists of over eighty thousand lead tungstate crystals … etc. … >… Pb WO4 is a birefringent, tetragonal, scheelite type crystal belonging to the space group I4 1/a or monoclinic raspite. >It is grown from a 50%–50% mixture of lead oxide (Pb O) and tungsten oxide (WO3) which melts congruently at 1123°C, without a phase transition during cooling. — — “Current trends in scintillator detectors and materials” Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment Volume 487, Issues 1–2, 11 July 2002, Pages 123–128 3rd International Workshop on Radiation Imaging Detectors Abstract >The last decade has seen a renaissance in inorganic scintillator development for gamma ray detection. >Lead tungstate (Pb WO4) has been developed for high energy physics experiments, and possesses exceptionally high density and radiation hardness, albeit with low luminous efficiency. >Lutetium orthosilicate or LSO (Lu2 Si O5:Ce) possesses a unique combination of high luminous efficiency, high density, and reasonably short decay time, and is now incorporated in commercial positron emission tomography cameras. There have been advances in understanding the fundamental mechanisms that limit energy resolution, and several recently discovered materials (such as La Br3:Ce) possess energy resolution that approaches that of direct solid state detectors. Finally, there are indications that a neglected class of scintillator materials that exhibit near band edge fluorescence could provide scintillators with sub nanosecond decay times and high luminescent efficiency. Link: http://www.sciencedirect.com/science/article/pii/S0168900202009555 I believe that discussions about the presumed [http://www.scientificamerican.com/article/gravity waves cmb b mode polarization/ or: http://blogs.scientificamerican.com/critical opalescence/gravitational waves reveal the universe before the big bang an interview with physicist gabriele veneziano/ ] “gravitational waves originated before the Big Bang”, the Big Bang, LHC, Charles Darwin’s theories, etc. And other arguments … are (probably) far from the Shroud and the Person of Jesus… For example: I don’t even know if Christ was really suspended with a certain amount of weight tied to His feet in preparation to be scourged (and, frankly, this seems to me a strange idea = where is the proof?)… I think that the physical evidence about the theory (or theories) should be sought with great skill and patience … or not? — — >February 05, 2015 >Message from the Big Bang –“Confirms Quantum Origin of the Universe” Link: http://www.dailygalaxy.com/my weblog/2015/02/ messages from the big bang confirms quantum origin of the universe.html >Data from the Planck telescope have confirmed beyond any reasonable doubt a theory of the quantum origin of structure in the Universe. … etc. … Another link: https://en.wikipedia.org/wiki/Quantum fluctuation.","date":"2015-06-30","mins":"11:39 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204358","author":"piero","post":"Errata corrige: >… I have felt myself into the Grotto of Lourdes with questions about the salvation of other humanities … Instead of: >… I have felt into the Grotto of Lourdes with questions about the salvation of other humanities … — — — or: I have seen as I was staying in front to the Grotto of Lourdes with questions about the salvation of other humanities … or: >… I have realized that I was staying in front to the Grotto of Lourdes with questions about the salvation of other humanities … — — — Neanderthals had a 1500cc brain volume, while modern humans have 1400cc. >Neanderthals, Denisovans, and modern humans (H. S. Sapiens) are all descended from H. Heidelbergensis. Between 300,000 and 400,000 years ago, an ancestral group of H. Heidelbergensis became independent of others shortly after they had left Africa. One group branched northwest into Europe and West Asia, and eventually evolved into Neanderthals. >The other group ventured eastwards throughout Asia, eventually developing into Denisovans. H. Heidelbergensis evolved into H. Sapiens approximately 130,000 years ago. Links: https://en.wikipedia.org/wiki/Homo heidelbergensis https://en.wikipedia.org/wiki/Homo rhodesiensis https://en.wikipedia.org/wiki/Archaic humans https://en.wikipedia.org/wiki/Archaic humans#/media/File:Sapiens neanderthal comparison.jp — — — >The researchers Konrad Lohse of the University of Edinburgh and Laurent Frantz from Wageningen University investigated the biological relationship between modern humans and a previous human species that became extinct around thirty thousand years ago. >Experts already agreed that both groups came from a common ancestor in Africa before they spread all over the world. Research has shown that both groups have appeared at different times, where the Neanderthals left Africa 200 000 years earlier than humans. >Previous research by other groups resulted in two theories: Genetic exchange between Neanderthals and modern humans and an alternative explanation that modern Europeans and Asians are related to Neanderthals because they descended from the same sub populations from Africa … … Link: https://www.wageningenur.nl/en/newsarticle/DN Aresearch confirms recent interaction between Neanderthals and humans.htm But, unfortunately, these facts and considerations have nothing or few to do …with the claim (or test) by Tipler about the consecrated host….","date":"2015-07-02","mins":"9:05 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-73822","author":"piero","post":"Here I want to ask … If you know a parapsychologist able to investigate the field of precognitive dreaming in the realm of analyses … for the linen fibrils of the Holy Shroud (and see also the controls of the inherent “ghosts”) ….","date":"2014-01-20","mins":"11:56 am","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","title":"Oh no, a mean and nasty smokescreener and clever rationalizationer"},{"id":"comment-208616","author":"piero","post":"Here a question regarding the problem of possible color transfer : how to test this hypothesis ? Have you a suggestion? I think that advanced analyses can be useful to solve also this problem….","date":"2015-08-20","mins":"9:29 am","url":"https://shroudstory.com/2015/08/17/oh-to-be-reminded-of-2002-again/","cat":"2015","title":"Oh, To Be Reminded of 2002 Again"},{"id":"comment-214605","author":"piero","post":"I have read what happened in Paris. In the past I’ve been in the city of Paris few times … …and now “it’s up to Rome, London and Washington”, this the horrible proclamation accompanying the celebrations of the supporters of the Isis, on Twitter, the attacks in Paris, with the hashtag ‘Paris in flames’. The perspective (= after Paris, it’s up to “Rome, London and Washington” this is what threatens the Islamic State on social media) that was presented to our future is terrifying and therefore the States should defend themselves adequately. …No shortage of threats to Spain and Portugal, the territory of the ancient Caliphate in Europe….","date":"2015-11-14","mins":"9:00 am","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-135302","author":"piero","post":"You wrote: >The paper has considerable technical content which may be difficult for some. — — In the book : “Sindone: primo secolo dopo Cristo!” Edizioni Segno (Italy) there are the inherent explanations… You wrote: >Essentially the concept is that the cellulose degrades with time, and by calibrating against properties of known ages of cloths, an estimate of the sample’s age can be made. — — The question was underlined (before myself and Fanti) by Diana and Marinelli. Please read the paper : Natural Textile Fibres – Optical Activity, Racemization and Epimerization link: https://www.shroud.com/diana.htm Dp = the depolymerization degree … — — You wrote: >A significant problem is that time is not the only dependent variable, but also the history of the cloth, its storage, handling, humidity, also affect these properties Yes, but you forgot the attacks by bacteria, the fungal attacks and the insects… — — You wrote: >There is clearly a preference for non destructive testing methods. Yes. Only we have to work following non destructive testing methods. But Fanti came to break the linen fibers subjecting them to loads. Therefore his tests are not completely non destructive… Instead I have underlined (read the past messages) the ideas of : – indentation – three point (or multi point) bending test in order to obtain the interesting estimations about the Elastic Modulus. See also the flexural Modulus of elasticity: http://en.wikipedia.org/wiki/Three point flexural test we can probe the mechanical properties of nanoscale materials: link: http://www.thewalkerlab.com/research/investigation of boron nitride nanotubes/ [Nanoscale Mechanics – Studies of Boron Nitride Nanotubes … = the rigid material, the linen fibers does not seem to be so rigid.!] — — So… What is your comment ?.","date":"2014-07-04","mins":"8:48 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","title":"Part of a Comment Promoted:  A Question for Today"},{"id":"comment-135319","author":"piero","post":"In my idea the “work on materials other than the Shroud by specialists who may never have heard of it” is not a wise idea, because they have to know something (at least) about the Shroud (and lignocellulosic textiles) before to work on this kind of argument. The probable result is nothing = no proper guidance or suggestion (prompt) from who don’t know the matter. So… How to give rise to the adequate scientific team ? …and… Where are the funds to sustain the research?.","date":"2014-07-04","mins":"11:38 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","title":"Part of a Comment Promoted:  A Question for Today"},{"id":"comment-185130","author":"piero","post":"However … I do not think that the (hypothetical) differences indicated by Skurka can be detectable on those possible old images ….","date":"2015-01-21","mins":"11:19 am","url":"https://shroudstory.com/2015/01/20/picture-tweet-of-the-day/","cat":"news_&_views","title":"Picture Tweet of the Day"},{"id":"comment-185129","author":"piero","post":"From 1939 al 1946, during the Second World War, the Holy Shroud was housed in he Sanctuary of Montevergine, in Avellino. For over 7 years the cloth was secretly stored below the altar of the chapel, where the Benedictine monks used to celebrate the Vespers. — — — The most extraordinary Christian icon, until then had been kept in the chapel of the Royal Palace of Turin, was transported first to Rome where it was temporarily placed into the chapel “Guido Reni” of Quirinale, where resided the Savoy, a place that was not deemed safe … Abbot Giuseppe Ramiro Marcone was summoned (by telegram of September 7) to the Secretary of State of the Vatican, Cardinal Luigi Maglione, who told him that the choice for the temporary storage of the Shroud had fallen on the Benedictine monastery of Irpinia, where 25 September 1939, surrounded by more jealous secrecy, the precious relic was transferred by car, with no apparent military escort. In the minutes of delivery signed by Abbot Marcone, by Canon Paul Brusa, guardian of the Holy Shroud, the prior of Montevergine, Bernardo Rabasca and the chaplain of the King, Joseph Gariglio, were contained all the provisions … In an additional report was settled that, in the event of air strikes on Avellino, (as tragically occurred in September 14, 1943…) for greater precaution the abbot of Montevergine would cure to transport it in an even more secure: an artificial tunnel dug into the rock one hundred meters away from Coretto, which is accessed through the hall of the monastery, without the need to go outdoors. The choice of the Montevergine sanctuary was a good one. One imagines that other such sites, such as the abbey of Monte Cassino, might have been chosen… (>The Benedictine monastery at Monte Cassino, about 90 miles (150 kilometers) to the northwest, was heavily bombed by the Allies in 1944, and many Savoy family documents about the shroud that were placed there for safekeeping during the war were destroyed, Cardin said. … link: http://www.huffingtonpost.com/2010/04/10/shroud of turin going bac n 532856.html ) In 1946, after the war, before leaving for exile after the institutional referendum that sanctioned the Republican choice, King Umberto II June 10 with a letter instructing the Archbishop of Turin Maurilio Fossati to obtain the return of the relic to the city of Turin. The cardinal himself, as recounted in a letter written two days later, he came to Montevergine October 28 and, after checking the integrity of the seals, the ceremony ended with a charming stay in Irpinia of precious cloth. — — — — >The Holy Shroud was transferred from Turin during World War II to keep it out of reach of Adolph Hitler, according to a Benedictine priest in a southern Italian abbey. … >The secret was kept throughout the war despite a search of the premises carried out by German soldiers in 1943 following a bombing of Avellino. The relic was protected, said Fr. Cardin, as, upon hearing of the coming of the soldiers, the monks retired to pray at the altar. “An officer,” he explained, “seeing them in prayer, gave the order not to disturb (them) and that was how the sacred relic went undiscovered.” >Hitler apparently sought the linen for its “sacred power.” Perhaps he was obsessed with the occult and with religious artifacts… Link: http://www.catholicnewsagency.com/news/holy shroud hidden from hitlers grasp in benedictine abbey/ — — — Have you read the presentation by Skurka? In that work there is a claim about “superparamagnetism” and there is also the following phrase: >The body image would lose its optical properties a result of the alignment being lost over time possibly just by moving the cloth through earth’s magnetic field such as when the cloth is being transported. Now, in order to compare the images of the Shroud (before and after the transports), the question to solve can be the following: Where we can find photographs of the shroud before and after the secret custody in Montevergine?.","date":"2015-01-21","mins":"11:16 am","url":"https://shroudstory.com/2015/01/20/picture-tweet-of-the-day/","cat":"news_&_views","title":"Picture Tweet of the Day"},{"id":"comment-47016","author":"piero","post":"I asked (your e mail address) to Dan … Unfortunately I have not yet received the answer ! In any case the textile analyses using the SP Ms (Scanning Probe Microscopies = AFM, CFM, SNOM) is an interesting solution in order to discover the truth. But, after 15 years, we cannot see these analyses … What is your opinion about that situation ? — — — What is your particular solution ? Is it the extraction of cryptographic secrets ???.","date":"2013-10-11","mins":"9:57 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-206778","author":"piero","post":"I want to underline something about Carl Sagan (a phrase written by him, taken as a sort of an “Ipse dixit”…) and the Shroud … >Carl Sagan suggested pareidolia is not a psychosis but an innate human tendency necessary for survival. >In The Demon Haunted World, he wrote: “As soon as the infant can see, it recognises faces, and we now know that this skill is hardwired in our brains. … etc. … etc. … Source: “ON THE WATER: Beware the face of the man in the ashtray by Neels Blom, July 27, 2015, 06:30” Link: http://www.bdlive.co.za/opinion/columnists/2015/07/27/on the water beware the face of the man in the ashtray — — >…As an example, he recounts an encounter he had with a cab driver in which the driver asserted a belief in a variety of somewhat silly ideas: frozen extraterrestrials, channeling, Nostradamus’s prophecies, astrology, the Shroud of Turin, and so on. In each case Sagan had to point out that the driver’s belief was almost certainly misplaced, primarily because the evidence supporting those beliefs was lacking. … Link: http://dreamingaboutotherworlds.blogspot.it/2012/08/review demon haunted world science as 5784.html Ipse dixit. >Ipse dixit, Latin for “he himself said it”, is a term used to identify and describe a sort of arbitrary dogmatic statement, which the speaker expects the listener to accept as valid. >The fallacy of defending a proposition by baldly asserting that it is “just how it is” distorts the argument by opting out of it entirely: the claimant declares an issue to be intrinsic, and not changeable. … Link: https://en.wikipedia.org/wiki/Ipse dixit — — So, in my opinion, in “The Demon Haunted World”, Sagan simply wrote a false statement about the Shroud… Then, we still have to check the truth, another time (using the adequate instruments and avoiding destructive approaches!). — — At the end… I suggest you to read Paul Grice (= philosophical logic, divergences and conversation…). Link: http://www.ucl.ac.uk/ls/studypacks/Grice Logic.pd.","date":"2015-07-28","mins":"10:43 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","title":"Posting For a Slow News Day"},{"id":"comment-185383","author":"piero","post":"Dear daveb, Thank you for your attention… — — — Here what I have read today (here a long and rough translation. Sorry!): >September 1939: six days after the German invasion of Poland, the sacred cloth according to the Christians has wrapped the body of Christ in the Sepulchre left Turin for the first time in almost four centuries. Destination, dark abbey avellinese: Montevergine. Officially, it was necessary to protect the only relic from the bombing, but the real fear was that he could throw another cross over its shadow: the Nazi swastika … >Among the documents consulted showed a singular fact: Cardinal Fossati, Archbishop of Turin, had not even been informed of the start of the Holy Shroud in Turin on 7 September 1939. One possible reason may have been the need for the Cardinal, not knowing this, he could not talk even under torture. He would go to Montevergine, after the war, to bring the Holy Shroud in Turin after obtaining the consent of King Umberto II, now in exile for a few months: a consensus being essential property of the House of Savoy, the Shroud. In a letter dated June 10, 1946, just three days before departure for exile, Umberto II wrote to Cardinal Fossati: “The current events lead me today to tell Your Eminence that – while it is my understanding that the precious relic remains sacred and inalienable heritage of my house – do right now my full consent to that returns to its pristine placement in Turin, in the chapel which bears the name. ” >In an exchange of ideas with the researcher and historian Lucan, Dr. Paul Tritto, revealed an interesting argument about a book by Giorgio Galli entitled “Hitler and magical Nazism.” [Here my note = …B.T.W.: I have bought that book several years ago…] >Tritto writes: “In the book of Galli you will find something on the relationship between the Nazis and the esoteric. Upon reading I thought credible reconstructions of Galli. Even today, I think largely valid, but Galli ends, perhaps unwittingly, to draw a picture which comes from outside the usual Hitler schizophrenic. Instead, I believe that Hitler had a vision too shiny to be conceived by the mind of a deranged. Sure, it was totally out of the normal. But I would not speak of schizophrenia; perhaps his was a diabolical design or even the result of a personality “possessed”. Perhaps it is a case of demonic possession. I do not think, therefore, that Hitler wanted to take possession of the Shroud for esoteric rites. In my opinion the Shroud had to represent for him the symbol of something, then had a meaning more realistic. I also cite another book “Conversations with Hitler” Hermann Rauschning. In a chapter called “the Antichrist” the author refers to private conversations in which Hitler had explicitly expressed the intention “of radically eradicate Christianity in Germany with all its roots and its branches.” But it is not a simple hostility to support this diabolical plan, there is rather the intention of usurping the place of the Catholic Church in its mission to redeem humanity. Rauschning reports that Hitler once said: “I want to reveal a secret. Foundations with an Order. “The goal, says Rauschning, was to transform the SS into a kind of caste of priests secrets. The same author also reports that one day a woman in his entourage gave Hitler a strange suggestion that seems to have influenced him; she advised him to follow the path of “white magic” and be wary instead from “black magic”. The most powerful talisman of white magic is considered quite the Holy Shroud. Perhaps it was this – concludes Paul Tritto – the path that led Hitler to design of possession. ” — — — But luckily in Germany not everyone thought like Hitler! Unfortunately >On 19 January 1944 Moltke was arrested and the Kreisau Circle fell into disarray. The focus of some circle members had been turning towards an active political coup, and some participated in the failed assassination attempt on Adolf Hitler by Claus Schenk Graf von Stauffenberg on July 20, 1944. After the failure of this plot, many members of the Circle were arrested and were executed. Libnk: http://en.wikipedia.org/wiki/Kreisau Circle So I wonder how a highly efficient information network could not know anything about the fate of the Shroud. … Do they thought that this relic was transferred to Monte Cassino? In each case the systems of intelligence (= Monarchy and Vatican) had been effective in hiding the information to the German Nazis … Maybe you can make a comparison with a “parallel case”, namely that of “The Library of the Jewish Community of Rome” … Today there is an article in an italian newspaper (“Corriere della Sera”) about that “Library of the Jewish Community of Rome”, this article is titled: “Roman Jews (and the police) chasing the stolen library.” >In 1943 the Nazi raid to document the “lost civilization”. >Lost track of 7000 volumes. The suspicion that they are still together, perhaps in Eastern … — — — See also under: http://en.wikipedia.org/wiki/Reichsleiter Rosenberg Taskforce >The ERR were also active in the west. After the German occupations of Rome in 1943, ERR officers inspected the contents of the Roman Synagogue’s two great libraries, which contained extraordinary collections gathered over the 2,000 year history of Jewish life in Rome. They demanded the libraries’ catalogs; just days before the first deportation of Roman Jews to Auschwitz, two specially ordered railcars destined for Alfred Rosenberg’s institute in Frankfurt were loaded with ten thousand books from these libraries Link: http://www.governo.it/Presidenza/USRI/confessioni/doc/rapporto finale eng.pdf = The Commission for the recovery of the bibliographic patrimony of the Jewish Community of Rome, stolen by the Nazis in 1943 was set up under the Presidency of the Council of Ministers (Italy) with a Decree of 26 November 2002. = the systematic search of the Library of the Jewish Community in Rome… — — — Here a strange secondary information: >Vaincre claims that at one point, one of Alpha Galates’ members was Hans Adolf von Moltke, the German ambassador to Spain. He was an Anthroposophist disciple of Rudolf Steiner, and the cousin of Helmut James von Moltke, a founder of the Kreisau Circle… — — — Two other (= …two different Moltke…) links: http://en.wikipedia.org/wiki/Hans Adolf von Moltke http://en.wikipedia.org/wiki/Helmuth James Graf von Moltke.","date":"2015-01-22","mins":"9:11 am","url":"https://shroudstory.com/2015/01/20/picture-tweet-of-the-day/","cat":"news_&_views","title":"Picture Tweet of the Day"},{"id":"comment-47665","author":"piero","post":"Daer Colin, thank you for your answer. There are a lot of links … Now I have no time … — — We can see something of interest using the CFM (Chemical Force Microscopy) and also … there are the other techniques (Raman controls included). — — No destructive controls are required ! — — If you want to improve the work (or to try another way) you have to wait … because the future works will be interesting. Several years ago (in 2004) Dan Rugar answered (to me) about my question : >If your device could be useful for investigating the atomic structure inside materials… then (I think) this is interesting also for textile fibers… >Do you agree ? Here the answer by DR : >I am sorry, but our instrument is not sufficiently developed to be used to analyze the materials you mention. It is still in an early stage of research. — — Have you read the recent news about the MRI at nanoscale ? Here the title : Nanoscale Fourier Transform Magnetic Resonance Imaging by John M. Nichol, Tyler R. Naibert, Eric R. Hemesath, Lincoln J. Lauhon, and Raffi Budakian, published in : Physical Review X 3, 031016 (2013) — —.","date":"2013-10-16","mins":"12:47 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-47183","author":"piero","post":"Non destructive testing (NDT) can solve the problem. Colin wrote : “…Anything unusual or unexpected can be investigated using the fragmentation pattern from glc mass spec’. Specifically looking for saponins from those “Tales of Mystery and Imagination” would come rather low down my list of priorities. As indicated earlier, the real fun is to see what happens to those sugar profiles if one takes linen that has had its surface discolored by varying degrees of carbohydrate dehydration…” Using this kind of technology seems to be an old way to proceed : a destructive analysis ! … I prefer to wait and see the results obtained from the SPM analyses. The non destructive way is the right way. — — Scanning probe microscopes (SPM) is a branch of microscopy that creates images of surfaces using a physical probe that scans a specimen. — — I want to add : The SPM results can see in comparison with the Raman Spectroscopy results..","date":"2013-10-12","mins":"5:56 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46823","author":"piero","post":"Dear Max, Are you sure for the mendings ? B.T.W. : … 1863 or 1868 ? — — Seeing the fingers of the statue (= the Truth), under the address : it seems that you are not yet in the same condition … — — Where are the analytical proofs (… or limitations on evidence ??) for the process against the past results from the “wrong 14 C test” ? — — In 1998 I indicated the AFM way … But … Until now we have not yet these proofs ! — — Regards.","date":"2013-10-10","mins":"9:17 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-165947","author":"piero","post":"… Crop circles would be the clear signs that herald the second coming of Christ … (!?!?!) >Another sign would be just Giorgio Bongiovanni who would live in itself a remarkable syncretism being both a contactee experiences of cosmic character / alien is one stigmatized “with mystical experiences. >Jaime Maussan, a famous Mexican journalist and researcher, a personal friend of Giorgio Bongiovanni, wanted him to Mexico. >During an interview with Giorgio Bongiovanni explained his great interest in the crop circles. His spiritual experience started young age has always been related with UF Os, and then continue with the mystical phenomenon of Marian apparitions and messages of Jesus Christ (!!! ???!) …. >For the first time Giorgio was able to walk in the middle of a crop circle in the interview and expressed his excitement for the cosmic significance and the inherent spiritual message. … … >The researcher interviewed by Pier Giorgio Caria Jaime played Giorgio’s visit to England with his sacred stigmata as something very important; in his opinion from the moment something could change about the manifestation of the same phenomenon of crop circles. At the end of the program the journalist Jaime Maussan talked about his relationship with Giorgio Bongiovanni that dates back more than 20 years ago. He was very impressed to see him in 1993, at the Hotel Gemellaro, located at the foot of Mount Etna (Sicily), when walking along the corridor of the hotel came into the room where George lying in a bed was bleeding from the stigmata … (…and this was my rough translation) Link: http://www.giorgiobongiovanni.it/messaggi 2014/5650 segni chiamano segni cronaca delle attivita di giorgio bongiovanni e jaime maussan nei cerchi del grano in inghilterra prima parte.html At this point it would be really interesting to know the opinion by Consolmagno on “the phenomenon of Giorgio Bongiovanni” … So, what do you think? I have read that : >While the crop circle phenomenon in England tends to attract its share of fans and curiosity seekers, the addition of a Jesus theme to the already mystical events has added new found meaning. At the moment I think maybe it’s a huge mess … and yet there are already a lot of confusions in our poor world full of war … Does the future of intelligence lie with machines, and if so what will they care about? Have you read “The Eerie Silence: Are We Alone in the Universe?”, by Paul Davies ?.","date":"2014-10-27","mins":"10:59 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-165168","author":"piero","post":"I have read that >A mission to the moon has become one of Russia’s top priorities in space. Russia plans to launch three lunar spacecraft – two to the moon’s surface and one into orbit – by the end of the decade. … So it seems that there is always money to fund space missions of prestige, but the money for the studies on the Shroud are scarce. It seems to me that only Eng. Giulio Fanti was able to get a nice financial aid… This also depends on the knowledge and personal skills. Therefore (going beyond the concrete results of Fanti and Malfi …) … is not it a beautiful thing to see some interesting study on the Shroud? Those jobs can always be a starting point … Or not? — — — Moving on to another topic … I would be interested to know the opinion of Consolmagno about the strange stigmatized Giorgio Bongiovanni (he is alleged contact with extraterrestrial entities … See also : Moving on to another topic … I would be interested to know the opinion of Consolmagno about the strange stigmatized Giorgio Bongiovanni. He is claims to be in contact with extraterrestrial entities …(see also : the “beings of light” Ashtar Shenar and Adoniesis… … ect.) and see also : the strange question of the third (or fourth!) secret of Fatima… — — — See also Socci : http://www.fatima.org/news/newsviews/010207fourthsecret.asp Il Quarto Segreto di Fatima (= The Fourth Secret of Fatima)… However, I beg you to forgive me for the possibility of enormous confusion. There are several strange stories and we have learned that there is only the Third Secret of Fatima, this was the official Truth! But Archbishop Capovilla, former secretary of Pope John XXIII, admitted there are two texts … (Mr. Socci had been in contact with Mr. Solideo Paolini, the young journalist…) Socci’s conclusions seemed to be consistent with reported remarks of the Pope Benedictus XVI himself (when he was still Cardinal Ratzinger) that his “hands were tied” on Fatima by the dictates of the former Vatican Secretary of State … With the publication of Socci’s book, the “hypothesized” censorship of Sister Lucy will be seen as a grim reality by more and more people. It is quite difficult to follow all these stories ….","date":"2014-10-24","mins":"9:57 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-166198","author":"piero","post":"Sometimes you have to play a role unwanted… And then, see for example: John Cantlie, a British journalist who is being held captive by Isil inside Syria and has appeared in a sixth propaganda video … (British journalist John Cantlie used as ‘Isil reporter’ inside Kobane link: http://www.telegraph.co.uk/news/worldnews/islamic state/11191477/British journalist John Cantlie used as Isil reporter inside Kobane.html ) In any case : He (John Cantlie, the prisoner!) does admit that the air strikes “which cost half a billion dollars” prevent ISIL using its heavy armour such as tanks. ….","date":"2014-10-28","mins":"10:12 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-166196","author":"piero","post":"Years ago I read the book on Giorgio Bongiovanni written by journalist and writer Paola Giovetti. In that book (1997) Bongiovanni pointed to a particular interpretation of the prophecy of Fatima belied by what was shown in 2000… According to the idea of Socci (2014) novelty of Fatima would be contained in an official publication of the Carmel of Coimbra, the one where she lived and died (in 2005) Sister Lucia dos Santos, the last seer. It is entitled: “A caminho sob or olhar de Maria” and is a biography of Sister Lucia, written by the sisters, with the valuable unpublished documents of the same seer… If you want to answer you have to try to understand my speech. I do not believe the heresies of Bongiovanni (= reincarnation, etc.), but I’m curious about this strange phenomenon. If this is not a fake could be the testimony of a living phenomenon of Paranormality. Giorgio Bongiovanni presented an investigative film, the discovery of a hidden symbolic language or meaning, a “Cosmic Code” in the Crop Circle formations which began to appear in a whirlwind of mystery in the early 1990s and continues to this day “with stunning geometric complexity, grandeur and beauty”… Link: https://panoffolin.wordpress.com/tag/paranormal/ Do you think it is possible that Bongiovanni has really found the “secret language of crop circles”? — — — Here some words, according to Paul Brosio, journalist and writer: “We are on the countdown, there is not much time because the secrets be fulfilled.” The same Brosio also says: “… Until now has been revealed just a metaphor and not the prophecy of Fatima.” and also : “… Before the triumph of the Immaculate Heart of Mary we have to do path of Calvary, because you do not get to the Resurrection without going through Friday. You have to go to the Passion, and has already begun. Watch what happens in Africa, China, Iraq, outbreaks where Christians are persecuted. And that’s just the physical persecution …” Link (in Italian language): http://www.intelligonews.it/segreti brosio in esclusiva siamo al conto alla rovescia i segni i 100 anni a satana la madonna e papa francesco/ First you need to be able to discern in order to well understand… So, what do you think of these “complex stories”?.","date":"2014-10-28","mins":"9:58 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-165192","author":"piero","post":"Errata corrige: Not >They are however in a little upset by the idea … But: >I am however in a little upset by the idea … ….","date":"2014-10-24","mins":"11:21 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-165191","author":"piero","post":"I am sure that the right way is the one that inspires our hearts! So, see also: the devotion to the Hearts of Jesus and Mary … — — They are however a little upset by the idea of other civilizations in our galaxy or in our universe … Another question: Last Saturday I read a letter published by a magazine (= “Miracoli” =”Miracles”) where the cults to extraterrestrials were defined as satanic rituals. It was listed as a character identifiable as Eugenio Siragusa (the master of Giorgio Bongiovanni …) which (if I remember correctly) said to contact extraterrestrial entities on the slopes of Mount Etna, in Sicily! See also : http://solexmaluniversallanguage.blogspot.it/p/first meeting on sona mount etna sicily.html Extraterrestrial Intelligent Life ??? >… in 2005, a member of the Jesuit order, Father Guy Consolmagno, an astronomer at the Vatican Observatory, a scientist who is the world’s leading authority in the study of meteors, published a small pocket volume entitled: “Intelligent Life in the Universe? Catholic Belief and the Search for Extraterrestrial Intelligent Life” published by the “Catholic Truth Society”, an English Catholic group. The scientist in this text affirms to believe in extraterrestrials and explains that this is not a choice incompatible with the faith. Link: http://en.giorgiobongiovanni.org/heavenly messages/2013/3609 the merkabah the chariot of the gods.html — — Here a strange face on wood … link: http://en.giorgiobongiovanni.org/some news/108 celestial signs/3492 face of jesus appears on cemetery tree stump.html.","date":"2014-10-24","mins":"11:18 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-165461","author":"piero","post":"I did not write: “They are However a little upset by the idea of other civilizations in our galaxy or in our universe …” Because it was a simple mistake of the translator (= Google traslator) … As you can see from my subsequent correction! — — — It seems to me that a famous monk, St. Padre Pio da Pietrelcina, replied that there are other intelligent beings in the Universe… I have read that : >The book written in 1974 by the priest Don Nello Castello, “Così parlò Padre Pio” (“Thus Spoke Padre Pio”), says that someone in Padre Pio’s confraternity asked him “Father, I thought Earth was nothing compared to the stars and all the other planets”, to which Padre Pio replied “Yes, and if we leave the Earth we are nothing. The Lord certainly didn’t restrict his glory to this little planet. On other planets, there will be beings without sin.”. … And this was reported in a curious interview with Monsignor Corrado Balducci at the Second Ufological Conference of Ancona, entitled “Alien civilizations: between doubt and reason” on 17 April 1999…. (= Many saints believed in extraterrestrial life !!!?!?) Link: http://ufodigest.com/vaticanufos.html … and it is for this reason that I would like to understand the position of Consolmagno about the strange case of stigmatized Bongiovanni (a character that a scientist atheist [Margherita Hack] described as fanatical [that in reply to my question]. What happened more than 16 years ago … now Hack is dead and also died the well known physicist Tullio Regge [CICAP] = http://en.wikipedia.org/wiki/Tullio Regge … …).","date":"2014-10-25","mins":"10:23 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-195601","author":"piero","post":"In the image under the address: there are no exact indications about: x, y, z … The same with the link: http://tonylayne.blogspot.com/2013/03/resurrecting authenticity of shroud of.html#.VS Ns Jvn F9 4 So… What seems to be interesting to discuss (and demonstrate) is the placement (based on data for x, y, z = ie the coordinates in space) of linen fibrils and the exact location of the parties involved in what is the Body Image … — — — — … But, during the AFM studies around the Mechanical Properties of Individual linen fibrils, perhaps we can see something that is more interesting for the improvement of the studies….","date":"2015-04-07","mins":"7:40 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-195612","author":"piero","post":"I believe that we should see the same image, but (at least) photographed under an UV light, in order to say something that can be intelligent … or not? …and then: Where we could go and see if there is the same photo, but in UV…?.","date":"2015-04-07","mins":"10:14 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-195725","author":"piero","post":"I bought the book of Baima Bollone (= “Sindone o no”) 25 years ago, but (unfortunately!) I did not have that book at hand … It remains unclear why the bloodstains on the Shroud retain their original carmine color (red), while the normal traces of blood become black quickly and this for the fact due to the degradation of hemoglobin which contain that turns in hematoidin, and then again in hematin who is black. Here two words on haematoporphyrin, which is a porphyrin compound, with generic formula : C34 H38 O6 N4. This compound is obtained from the hemin and hemoglobin and is derived from the action of a strong acid. Differs from protoporphyrin hemoglobin for the presence of two hydroxyethyl groups instead of two vinyl groups. Its importance is especially historic because it was the first prepared for porphyrin synthesis (starting at hemin). Its biological role seems minor and his presence in the wild is not currently certain. Remember also that hemoglobin consists of globulin and hematin. Here other informations: >Hematoidin, similar to bilirubin, is a reddish brown pigment, found in the form of rhombic crystals; does not contain iron, is insoluble in water, alcohol, or ether, but is soluble in chloroform. >It is found at the seat of old hemorrhages, and is generally considered a later form of hemosiderin. … Link: http://chestofbooks.com/health/disease/Pathology/Hematoidin.html * * * * * Hemin and Hans Fischer. He was a German biochemist who was awarded the Nobel Prize for Chemistry in 1930 for research into the constitution of hemin, the red blood pigment, and chlorophyll, the green pigment in plants… Link: http://www.britannica.com/E Bchecked/topic/260817/hemin.","date":"2015-04-08","mins":"8:25 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-195727","author":"piero","post":"Hemosiderin: >Hemosiderin often forms after bleeding (hemorrhage). When blood leaves a ruptured blood vessel, the red blood cell dies, and the hemoglobin of the cell is released into the extracellular space… Link: http://en.wikipedia.org/wiki/Hemosiderin It is well known that iron in living systems is stored in ferritin and hemosiderin. — — I do not know your preferences in the analytical field, however … Now I have just found an old (= 1995) study, and if you want to improve your knowledges the title is the following : “Electron Energy Loss Spectroscopy Study of Iron Deposition in Human Alveolar Macrophages: Ferritin or Hemosiderin?” Authors : Marco Diociaiuti, Mario Falchi and Luigi Paoletti Laboratorio di Ultrastrutture, Istituto Superiore di Sanità, Roma, Italy Abstract >Electron energy loss spectroscopy imaging (EELSI) was used to obtain Fe maps, with molecular resolution, in human alveolar macrophages. Fe concentrations were found in particular structures named siderosomes. The combined application of Extended energy loss fine structure (EXELFS) analysis, a “short range” probe, and Selected area electron diffraction (SAED), a “long range” probe, allowed us to investigate the atomic arrangement of proteins constituting the siderosomes. Results are compared with structural data obtained on purified proteins. It is found that the siderosomes seem to be constituted mainly by normal hemosiderins http://mmm.edpsciences.org/articles/mmm/abs/1995/01/mmm 1995  6 1 33 0/mmm 1995  6 1 33 0.html.","date":"2015-04-08","mins":"8:44 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-195732","author":"piero","post":">An alveolar macrophage (or dust cell) is a type of macrophage found in the pulmonary alveolus, near the pneumocytes, but separated from the wall. … Inhaled air may contain particles or organisms which would be pathogenic. The respiratory pathway is a prime site for exposure to pathogens and toxic substances… Link: http://en.wikipedia.org/wiki/Alveolar macrophage and then this argument seems to be very far from the Shroud, perhaps only the studies about the Sudarium of Ovideo can be interested in that question. But see also: the recent study by De Liso Sky Darkening During Strong Earthquakes as a Hypothesis of the Earth’s Crust Emission in Holy Shroud Image Study. … that are (if I am right) studies about the strange EQ Ls and Earthquakes … or electric storm with dusts….","date":"2015-04-08","mins":"8:58 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-172939","author":"piero","post":"Look here: it seems to me that you, Colin, … you should go for the straight way and be able to nail Charles like you want, but with the exact tests. Instead I have indicated as useful: the “numismatic dating” and a particular dating method with the use of AFM techniques. Was I wrong ? From your message that can not be understood. In fact I do not think you dialogues with me. Instead what we could do? Excuse me, but from your interesting words it is not clear how you really want to nail Charles (ie: without making the turns of phrase …). — — And here’s what I think may be a case to be solved: How can we quantify the necessary amount of occasional microns size paint pigment particles necessary to suppose that the Shroud was a painting? Instead we know that the Shroud image (during the past centuries) was copied many times by painters… By the way (but … changing the subject!) … What do you think of my hypothesis (= cold dyeing of polyamide sheet) for the image obtained from the poor man of Liverpool? Here a very simple question: Are you able to perform cold dyeing of polyamide? And here, again, my advice: Starting with the experiments you have to use purified water (= demineralized). Then you can do the tests with biological liquids, fluids … What do you think? Is that like : “Interstellar polyamide” , a new science fiction film? Here the possible subtitle for that film = “Please note that our dyeing equipment (for “human dyeing” …) is functioning properly …“. I wait for your reply…..","date":"2014-11-25","mins":"9:18 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172918","author":"piero","post":"In the event that we were not quite convinced of “numismatic dating” as evidence to dismantle the hypothesis of Charles Freeman (one thing that I pointed out a few times, tediously…), then we should work more refined. — — — There is a study that employs the technique for AFM measurements. Unfortunately this is not exactly what I would be done on the linen fibers (… to be able to try to determine its age), because what is needed for us would be the Atomic Force Microscopy (AFM) study of the cellulosic DP (= Degree of Polym.) changes… In any case it’s an interesting thing to show that in the past someone has worked with the AFM and that you can work with use of the AFM on cellulosic materials … This study is titled: “Local morphological and dimensional changes of enzyme degraded cellulose materials measured by atomic force microscopy” Here few words: >Each sample was imaged by an atomic force microscope (AFM) in tapping mode. The images were analyzed to determine the dimensional changes of the insoluble CA Fs (CA Fs =cellulose aggregate fibrils) … Link: http://www.researchgate.net/publication/226559372 Local morphological and dimensional changes of enzyme degraded cellulose materials measured by atomic force microscopy — — — And see also: Raman spectroscopic analyses (in comparison with AFM analyses). — — — … And, for the moment, I even talked too ….","date":"2014-11-25","mins":"6:34 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173126","author":"piero","post":"I have seen that my messages are ignored. This is probably due to the fact that I mentioned the “numismatic dating” indicating that proof as useful to deny the thesis of Freeman (… and then… Is not it true that this “numismatic dating” dismantles the strange idea of Charles?). However, despite this, I still want to speak about my suggestion previously given to Colin about cold dyeing system for the sheet of polyamide. Colin alluded to the question of ‘simulated’ sweat imprint but I see that he was not even able to link the question of Jospice Imprint (= of the polyamidic sheet of Liverpool) with the subject under discussion. How so? Maybe he does not know the chemistry of cold dyeing for materials made of polyamide … Now I ask: Are you able to obtain a generic bodily imprint on a polyamide sheet ? You can use mice or other (dead) small animals ….","date":"2014-11-26","mins":"10:59 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173131","author":"piero","post":"I am curious about the possibility to work (with cold dyeing systems for good imprints …) into Movile Cave … …that is a cave in Constanța County, Romania discovered by Cristian Lascu in 1986 a few kilometers from the Black Sea coast. It is notable for its unique groundwater ecosystem rich in hydrogen sulfide and carbon dioxide but very poor in oxygen … But see also the gyotaku imprints… Links: http://en.wikipedia.org/wiki/Gyotaku http://www.michaelcyra.com/artists/rick steingress http://global.yamaha motor.com/business/outboards/life/fishing/chapter10/ >Gyotaku (Japanese = gyo “fish” + taku “rubbing”) is the traditional method of Japanese fish printing, dating from the mid 1800s. This form of nature printing may have been used by fishermen to record their catches, but has also become an artform on its own. … In any case we would wonder (ie: to search!) what was the medieval knowledge of the technique of Gyotaku … I have found the following words: >With the invention of paper, T’A PEN or “stone rubbing” in China prior to 200 BC is in evidence. The first plant printing found on paper is from the early 1100’s on a Syrian manuscript. Japan has the earliest fish printing done in the 1800s. … Link: http://natureprintshawaii.com/history of gyotaku/ — — >Stone rubbing is the practice of creating an image of surface features of a stone on paper. The image records features such as natural textures, inscribed patterns or lettering. >By rubbing hard rendering materials over the paper, pigment is deposited over protrusions and on edges … etc. … etc. … >Rubbings are commonly made by visitors to the US Vietnam Veterans Memorial … Link: http://en.wikipedia.org/wiki/Stone rubbing.","date":"2014-11-26","mins":"11:20 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173611","author":"piero","post":"I’m sorry that you (… and maybe even … Colin Berry!) do not understand that there really is a chance to do something with cold dyeing of polyamidic materials … So if you just can not understand the question of cold dyeing (of polyamide 6) … all the other stories seem to become just frills, minor problems! Listen to me! We need to run at least some simple experiment and I think Colin Berry can do this (for example: using little dead animals…). And …also do not understand what has to do the dyeing of polyamide with the Gospel of Mark … So.. You have to be a bit more consistent with what it is about the cold dyeing..","date":"2014-11-29","mins":"10:35 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173304","author":"piero","post":"Dear Louis, Surfing the Web you can read that nylon does not dye at all well in cool water … But (reading my previous messages) we have known an industrial process (with anionic dyestuffs) for cold dyeing of polyamidic material… … And take care: in the case of trichromatic dyeing (yellow + red + blue) you have to be careful in your cold dyeing work = the rise of the dyes on polyamide sheet (or another polyamidic material) should be as uniform as possible. Unleashing how you want your imagination you can also achieve particular effects using luminescent dyes … — — — Here a diagram of temperature (a scale) as very rough suggestion for your first attempt: Starting temperature 20° C. Permanence at 20° C. For 20 min Heating in 30 min to 25° C. And in another 30 min to 30° C. Permanence for 90 min at 30° C. End of dyeing. Obviously a cool corpse doesn’t reach that temperature. So, after the first attempt (a simulation without corpses!) we have to do some calibrations… You can work using an addition of a bit of ammonia and chemical products that is adapted to impart to the bath an initial alkaline p H and then to lower the p H you have to reach the elimination of volatile bases … But you should be able to go to a temperature sufficiently higher (…and however we can not even exceed 30 C!). Then you need to gradually change the p H making it more acidic … So: Can you follow me in this my attempt to explain the procedure? — — — I am waiting for your reply on the issue ….","date":"2014-11-27","mins":"8:57 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173823","author":"piero","post":"I felt you were wrong about the question of cold dyeing for polyamide. So … I beg your pardon about my short answer with my rough words. Probably, using the cold dyeing system (at low temperatures), you can obtain a polyamidic sheet washable only in cold water… Please, take into account that I have not indicated reactive dyes, but I have suggested to work with anionic dyes. After the first cold dyeing attempt you can see what happens and decide if you want to work with little animals. I have never worked with dead animals (also it is not said that dead animals have the same behavior of human corpses …). And it is for this reason that I wanted to discuss with you… Do you know Dr. Bill Bass and his particular experiments? Maybe we could ask Dr. Bill Bass. He can to try to do the experiment for us. Do you agree with me on That strange idea? But I see that there is a problem: How to avoid to hold in contempt the corpse on that polyamidic sheet? One should not get into these problems….","date":"2014-11-30","mins":"11:00 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-174177","author":"piero","post":"Louis, You wrote: >tell me how the the partial head imprint got to the mattress through the pillow. The “partial head imprint” is only a very bad stain and cannot be compared with the Holy Shroud of Turin. That’s a horrible stain, not recognizable as a head! A good dyeing of textile materials requires that the phenomena connected with the dyeing, such as the dye take up by, and the migration of the dyes in the fibre of the material, occur in an optimal way. These phenomena are influenced by a considerable number of variants, such as the nature of the material to be dyed, the composition of the dye bath, with respect to the dyestuffs and to other substances it may contain, temperature diagram of the dyeing process, the duration of its several stages, and so forth… Are you perhaps a dyer ….? Do you want to know more than me in terms of dye? Do you want to become a dyer? You can buy special acid dyes that work especially well on nylon. They are called acid dyes because they are used with a mild acid, such as vinegar. In any case, nylon, unlike cotton, needs some acid to take up the dye. But you have to start at the beginning with a dye bath with neutral p H, then you can go down gradually to a p H decisively/decidedly (…and excuse me, here I am undecided on the English term to define better [ie: more correctly] the language issue…) acid. Obviously a corpse can not emit a strong heat and therefore the first tests of dye must not exceed the threshold of 25 or 30 degrees Celsius. Do you know the book on Bill Bass? Here’s the headline: “Death’s Acre: Inside the Legendary Forensic Lab the Body Farm Where the Dead Do Tell Tales” (Foreword by Patricia Cornwell) by Dr. Bill Bass and Jon Jefferson. But with the Shroud we have not to deal with shocking facts on deep human decomposition … The body of Jesus disappeared before putrefaction. And then … in this regard I want to ask to you: Have you read the visions of Anne Catherine Emmerich? She was a nun who lived from 1774 to 1824 and Emmerich’s visions allegedly led a French priest Abbé Julien Gouyet to discover a house near Ephesus in Turkey… Please read carefully the paragraph: “Extreme honors “… But, having said that, we must remember, however, that’s not really necessary to automatically believe that particular vision! … honoring the dead body of Jesus, then to the disciples suddenly appeared the image of the Shroud … But the strange story does not convince me really. In any case, the story that offers us the strange “theory of body bag” by Colin Berry is a bit different … We should discuss it… But this message in this space does not seem to create the exact situation to get it right ….","date":"2014-12-01","mins":"10:47 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-174474","author":"piero","post":"Dear Louis, I certainly do not despise your request, but now (unfortunately) I can not have on hand your paper. Every week I buy an Italian magazine (titled: “Miracoli” = Miracles) speaking of miracles… But we can not abandon the serious scientific research on the material in question. So I think it would be appropriate to better understand what it was produced by the corpse of the poor man on the material of polyamide and on that of polyurethane (thin layer)… …And before going away from reality with flights of fancy we have to know what was the exact situation: Were the polyamide yarns (components the polyamidic sheet) coated with a very thin layer of polyurethane? or: Was the polyamide sheet coated with a very thin layer of polyurethane? I’m sorry, but now (…in the heat of the speech) I missed these interesting details. So this shows that it is best to proceed calmly in our discussions on the details… Well. Now I have found your study (= Can the Jospice Mattress Imprint be compared to the Image on the Shroud?)… So, you wrote: >.. Very thin layer of polyurethane which lies on top of the mattress cover. And the italian traslation is the following: >…strato molto sottile di poliuretano che si trova sulla parte superiore del coperchio del materasso. And in portuguese: >muito fina camada de poliuretano que se encontra na parte superior da capa do colchão. Capa do colchão = coprimaterasso (in italian language)… = mattress cover So… “coperchio del materasso” it’s a wrong translation… But… in what consisted that “mattress cover”? Probably it was a misnomer to define the thin layer that covered the sheet of polyamide (but in an adherent manner). … And polyurethane barrier is an interesting question for our next dyeing experiments (after the first attempts using only polyamide). — — — Unfortunately I had some small problems with language (“of type linguistic”….) but I believe that the substance of my thought is completely intact. — — — However keep in mind that I have never claimed that the Shroud of Turin (= a sort of particular “imprint on linen”) and the imprint of that poor man Lierpool (on polyamide…) really have the same characteristics! — — Another question: Why did not you answer to me about the strange vision of Anne Catherine Emmerich? ….","date":"2014-12-03","mins":"10:47 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-217113","author":"piero","post":"Thibault, Do you know how to use the “Hollow AFM cantilever”? It seems to be very easy to try to do something using the “Hollow AFM Chip” on a very little area of a linen cloth in order to observe what happens at micro and nano level with blood (as reagent) on treated (with Madder, Saponaria officinalis, etc.) linen materials … Here a possible reference: “Hollow AFM cantilever pipette”, Murali Krishna Ghateksar, Hector Hugo Perez Garza, Urs Staufer “Microelectronic Engineering” Vol. 124, 25 July 2014, pages 22 25 — — — What is your answer?.","date":"2015-12-23","mins":"10:41 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-23503","author":"piero","post":"Dear Louis, The main way to obtain the solution for the Enigma is the adequate control using the advanced microscopy as I underlined in the past messages … For example, there is a paper : “Characterization of linen modified by low temperature plasma and enzymatic hydrolysis” by Wong, Ka kee It is retrievable under the address : http://repository.lib.polyu.edu.hk/jspui/handle/10397/2104 and (in that paper) we can read : >With the image processing techniques and Atomic Force Microscopy, a comprehensive understanding of the surface morphology of low temperature plasma treated flax fibers was achieved … If I am right Professor Giulio Fanti (or the Prof. Paolo Di Lazzaro, in the case of the VUV hypothesis) has not yet used that modern way to control the material. I hope this is a little help for your interesting message. I want to add : If the researchers have the right contacts, then ,in my opinion, the inherent controls are very easy to do and we can see what is the answer from these experiments because with the microphotographs we cannot observe the important and useful details. See also : the controls about the noncontact and the contact areas (and the BIF), etc. — — Regards, Piero.","date":"2013-02-05","mins":"8:59 am","url":"https://shroudstory.com/2013/02/05/teaser-of-the-day-5-double-superficiality-expialidocious/","cat":"teaser_of_the_day","title":"Teaser of the Day (#5):  Double Superficiality Expialidocious"},{"id":"comment-217119","author":"piero","post":"I believe that “Hollow AFM cantilevers” are more useful to improve the studies in the field of “Fluid force microscopy”… >Fluid force microscopy combines the positional accuracy and force sensitivity of an atomic force microscope (AFM) with nanofluidics via a microchanneled cantilever. >However, adequate loading and cleaning procedures for such AFM micropipettes are required for various application situations. … Source: “A Multifunctional Frontloading Approach for Repeated Recycling of a Pressure Controlled AFM Micropipette” Phillip Roder, Carsten Hille Link: http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0144157 Probably the controls for what happens on treated (and not treated) linen, with blood as reagent, can easily be done without problems at “macro level”… In any case, in my opinion, exact studies (= high precision. Then see the possible use of “Hollow AFM cantilevers”) about the blood can be helpful for the case of bloodstains on Holy Shroud and for the other relic/repert: bloodstains on linen of Sudarium of Oviedo… and see also: the improved study of fibrinolysis using AFM tools..","date":"2015-12-23","mins":"11:48 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216592","author":"piero","post":"Here I was inspired to the book: “Superforecasting: The Art and Science of Prediction”… (I refer to the book by Philip E. Tetlock and Dan Gardner, published last September 29, 2015) Perhaps we are near to reach the level of “Shroud Superforecasters”… What prof. Barberis will communicate on scientific research? What will happen to the field of “Shroud Science” in the next one year? What kind of impact of “advanced tools” on scientific research about the Shroud are we going to see in the next six months? I hope that Next Year 2016 will improve the present situation..","date":"2015-12-15","mins":"12:40 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216593","author":"piero","post":"Financiers, demographers, and climatologists have long mastered the science of forecasting based on leading indicators. This (at short term) can be surprisingly easy. But … “God hides the end of future time in misty night,/ And laughs if mortal worries at what’s right…” [Horace].","date":"2015-12-15","mins":"12:47 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216584","author":"piero","post":"Dan, I’m very sorry for the fact of seeing this blog that starts the end of activity … For example: I would be curious to read the interventions of Prof. Marco Leona (he is in NY, so not too far away from you …) or other experts in the field of analytical chemistry about the concrete possibility to show something to the people about the results obtainable from SERS and TERS on linen fibrils (= samples properly treated) … and the inherent meaning of these analytical controls for the progress of the researches on the ancient Enigma of the Shroud… Dan, I’m sorry if I put on this blog (see f.e. The recent, very short, attempt: “TERS Bibliography”) some message quite intrusive, putting informations about SERS and TERS (and before these informations, other notes about the SPM techniques… ), perhaps weighing down the readability of the blog. Still I felt the need to improve what Rogers had outlined when he spoke on Raman spectrometry in his book (“A Chemist’s Perspective on the Shroud of Turin”): “Raman spectrometry is much like IR spectrometry: However, it sees different motions of the chemical functional groups. It provides a good complement to IR … etc …” See the topic on December 11, 2011: “Mark Andersen Disputed Walter Mc Crone. Substantiated?” link: https://shroudstory.com/2011/12/11/mark anderson disputed walter mccrone substantiated/ The ultrasensitive identification of molecules obtained using SERS and TERS can be an important step to achieve during next controls on linen samples, in order to see the truth about some claims (by Adrie can der Hoeven, etc.)… I apologize to everyone if I could not well communicate with the other friends in some discussions … I think what is important for all, it is the fact of being able to reach the experimental demonstrations of what is presumed to be the right path to follow in order to show the scientific truth to the whole world..","date":"2015-12-15","mins":"11:31 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216968","author":"piero","post":"I apologize if I did not answer before. Perhaps we have to build a little monument to Dan and his last “experimentum crucis” (So… Is Dan Porter similar to Newton, who performed his “crucial prism experiment” ? See also: K. Popper. Link: https://en.wikipedia.org/wiki/Experimentum crucis)… Then, see, f.e., under the address: http://cubify.com/ We have tried to challenge the past groupthink about the Shroud …and … then: What is that we are really able to obtain (at the end) with this blog?… I, strangely enough … I’d be tempted to respond to you with a curious digression, quoting Israel Zangwill: “The goyim refuse us equal rights because they know we’re their superiors.” “Ghetto Tragedies” Israel Zangwill.","date":"2015-12-21","mins":"12:36 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217281","author":"piero","post":"Today someone told me about the strange ideas of Fomenko … What do you think about Fomenko? >Anatoly Timofeevich Fomenko is the son of Timothy Grigorievich Fomenko (Russian: Тимофей Григорьевич Фоме́нко), an industrial engineer, and Valentina Polikarpovna (née Markova) (Russian: Валентина Поликарповна Маркова), a philologist and teacher of Russian language and literature. His parents would later co author his works on history in 1983 and 1996. >Born in Donetsk, then called Stalino, he was raised and schooled in Magadan. In 1959, his family returned to Eastern Ukraine and settled in the city of Luhansk, where Fomenko attended Secondary School No. 26. During secondary school, Fomenko participated in many competitions relating to mathematics and won several medals as a result. … Link: https://en.wikipedia.org/wiki/Anatoly Fomenko >The New Chronology is a fringe theory regarded by the academic community as pseudohistory, which argues that the conventional chronology of Middle Eastern and European history is fundamentally flawed, and that events attributed to the civilizations of the Roman Empire, Ancient Greece and Ancient Egypt actually occurred during the Middle Ages, more than a thousand years later. >The central concepts of the New Chronology are derived from the ideas of Russian scholar Nikolai Morozov (1854 1946), although work by French scholar Jean Hardouin (1646 1729) can be viewed as an earlier predecessor. >However, the New Chronology is most commonly associated with Russian mathematician Anatoly Fomenko (b. 1945), although published works on the subject are actually a collaboration between Fomenko and several other mathematicians. >The concept is most fully explained in History: Fiction or Science?, originally published in Russian. >The New Chronology also contains a reconstruction, an alternative chronology, radically shorter than the standard historical timeline, because all ancient history is “folded” onto the Middle Ages. >According to Fomenko’s claims, the written history of humankind goes only as far back as AD 800, there is almost no information about events between AD 800–1000, and most known historical events took place in AD 1000–1500. … … >The New Chronology is rejected by mainstream historians… Link: https://en.wikipedia.org/wiki/New Chronology (Fomenko).","date":"2015-12-27","mins":"9:24 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216658","author":"piero","post":"Perhaps the right phrase, in Latin, was as follows: …Prudens futuri temporis exitum caliginosa nocte premit Deus; ridetque, si mortalis ultra fas trepidat. … [Quintus Horatius Flaccus] Link: https://archive.org/stream/oxfordbookoflati00garruoft/oxfordbookoflati00garruoft djvu.txt A wise deity shrouds in gloomy night the events of the future, and smiles if a mortal is solicitous beyond the law of his being. => Q. Horatii Flacci Poëmata … Third edition. Edited by J. Boyd (1837) [The British Library] Or: God is wise and dives into the deepest night the events of tomorrow and laughs if a deadly anxious escapes where it can not escape. — — — Here … there is another lapidary phrase (to built a sort of “digital sundial”…) addressed both to Colin B. And to posterity: Dimidium facti qui coepit habet; sapere aude; incipe! Link: https://en.wikiquote.org/wiki/Horace He who has begun has half done. Dare to be wise; begin! — — — Dan, Thank you for your work on this blog..","date":"2015-12-16","mins":"11:38 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216969","author":"piero","post":"Perhaps there has always been a certain amount of violence (…βιαστος, βία, βίαιη) in the relationships of dialogue. Instead meekness (…πραότητα, ήπιος), gentleness, not seem to have had much success in the various communications … Am I wrong in my “feebles considerations”?.","date":"2015-12-21","mins":"12:53 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216721","author":"piero","post":"I think that 2015 was an important year for the four hundredth anniversary of Galileo’s letter … >In February 1615 Galileo Galilei wrote an important Letter to Mary Christine of Lorraine, the mother of Cosimo de’ Medici, the Duke of Tuscany, in the court of whom Galileo worked as mathematician and philosopher. >This letter is entirely dedicated to the relationship between scientific knowledge and biblical exegesis. >In those years, the Italian scientist endorsed the heliocentric Copernican system which, still lacking clearly established physical proofs, was considered by the theological establishment as contrary to sacred Scripture’s teachings. >Intuiting troubles and misunderstandings coming soon, by this letter Galileo intended to gain Madame Christina’s protection against Roman opponents to heliocentrism. >Galileo’s anxiety became reality on March 3, 1616, when the Holy Office judged heliocentric thesis as theologically erroneous and asked the scientist to hold it only “ex suppositione”, that is, as a mathematical resort having no necessary relationship with the real development of phenomena. … etc. … ==> “To the Most Serene, Grand Duchess Mother” “Some years ago, as Your Serene Highness well knows, I discovered in the heavens many things that had not been seen before our own age. The novelty of these things, as well as some consequences which followed from them in contradiction to the physical notions commonly held among academic philosophers, stirred up against me no small number of professors—as if I had placed these things in the sky with my own hands in order to upset nature and overturn the sciences. … etc. … etc. … >The reason produced for condemning the opinion that the earth moves and the sun stands still is that in many places in the Bible one may read that the sun moves and the earth stands still. Since the Bible cannot err, it follows as a necessary consequence that anyone takes an erroneous and heretical position who maintains that the sun is inherently motionless and the earth movable. >With regard to this argument, I think in the first place that it is very pious to say and prudent to affirm that the holy Bible can never speak untruth—whenever its true meaning is understood. But I believe nobody will deny that it is often very abstruse, and may say things which are quite different from what its bare words signify. Hence in expounding the Bible if one were always to confine oneself to the unadorned grammatical meaning, one might fall into error. Not only contradictions and propositions far from true might thus be made to appear in the Bible, but even grave heresies and follies. … etc. … etc. … … etc. … etc. … Link: http://inters.org/Galilei Madame Christina Lorraine What do you think? What is your idea about the “STOQ project” (= Science, Theology and the Ontological Quest)? — — — Three days after the beginning of the Jubilee, the day before the feast of Our Lady of Guadalupe, on December 11 last, the Lord called to Himself Fr Héctor Guerra LC, in Madrid at the age of sixty two, forty six of which He spent in the service of the Legion of Christ. He, with Father Rafael Pascual LC, director of the Institute on Religion and Science, founded in 2009 “Othonia”, an international NGO, non profit organization… Were You members of “Othonia”? — — — Surfing the Web (= Celebrating Galileo, with the moral patronage of the Science and Faith – STOQ Foundation and the Pontifical Council for Culture), under the address: http://luc.edu/theology/codychairevents2015 2016/ after the announcement of a past interesting Round Table: Friday, November 20, 2015 from 9:00 a.m. – 12:00 p.m. Round Table Discussion and Advanced Graduate Seminar “Cosmos, Past and Present: An Interdisciplinary Discussion of Galileo’s Letter to Christina of Lorraine” I have found another subject for a next appointement: Thursday and Friday, February 18 – 19, 2016 A Thursday afternoon lecture and a Friday morning seminar / round table discussion (tentative title: ‘What Does the “Galileo Thing” Mean Today?’) with Alice Dreger, Ph D, author of “Galileo’s Middle Finger” … Then I have read that: >Alice Domurat Dreger is an American bioethicist, author, and former professor of Clinical Medical Humanities and Bioethics at the Feinberg School of Medicine, Northwestern University in Chicago, Illinois https://en.wikipedia.org/wiki/Alice Dreger Unfortunately I see I’m falling in another area of research: >Galileo’s Middle Finger is a 2015 book by Alice Dreger, an American bioethicist and author, about the ethics of medical research. Dreger explores the relationship between science and social justice by discussing a number of scientific controversies. These include the debates surrounding intersex genital surgery,… etc. … etc. … https://en.wikipedia.org/wiki/Galileo%27s Middle Finger So… Probably your wife Maria da Glória, who is learning Theology, can help you in a better manner….","date":"2015-12-17","mins":"10:44 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216726","author":"piero","post":"Today, December 17th, Pope Francis celebrates his 79th birthday. Birthday wishes are coming from all over the world… Yesterday, at the end of the general audience in St Peter’s Square, the devotees sang “Happy Birthday”, and a Mexican journalist gave the Holy Father a special sombrero shaped cake from the people of Mexico who will be waiting for him next February….","date":"2015-12-17","mins":"12:30 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216798","author":"piero","post":"Just now I have found the paper titled: “Study of the Bloodstains in the Shroud of Turin: Chromatic Analysis and Possible Interpretation” Gabriele Bedon, Matteo Linguanotto, Ivan Simionato, and Francesco Zara I never hear the acronym KMC in the field of Colorimetry… [the Kline Mc Clintock (KMC) formula is connected to the Kline & Mc Clintock method, that is a useful tool for uncertainty analysis. Kline & Mc Clintock (1953) defined uncertainty as “A possible value the error might have” and this is the definition we still work with today. ]. Instead I remember the CMC formula… >CMC l:c >In 1984 the CMC (Colour Measurement Committee of the Society of Dyes and Colourists of Great Britain) developed and adopted an equation based on LCH numbers. Intended for the textiles industry, CMC l:c allows the setting of lightness (l) and chroma (c) factors. As the eye is more sensitive to chroma, the default ratio for l:c is 2:1 allowing for 2x the difference in lightness than chroma (numbers). There is also a ‘commercial factor’ (cf) which allows an overall varying of the size of the tolerance region according to accuracy requirements. A cf=1.0 means that a delta E CMC value When several independent variables (X’s) are used in calculating the Result, R, the individual terms are combined by a root sum square method (Method due to Kline and Mc Clintock (1953)) Source: http://antipasto.union.edu/~andersoa/mer331/Week1 Uncertainty Analysis.pptx.","date":"2015-12-18","mins":"12:24 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216799","author":"piero","post":"Someone has distorted and crippled my communication! Here the omitted text: But, eliminated the possible trivial source of confusion, that is the acronym KMC (versus the useful acronym CMC) we still have to do quite a lot of work … I am very curious to observe the differences in color arising from experiments with linen fabrics treated with madder or left as they are (and then stained with blood … and finally suitably aged), this must always be seen with reference to colorimetry the shroud. — — — >When several independent variables (X’s) are used in calculating the Result, R, the individual terms are combined by a root sum square method (Method due to Kline and Mc Clintock (1953)) Source: http://antipasto.union.edu/~andersoa/mer331/Week1 Uncertainty Analysis.pptx.","date":"2015-12-18","mins":"12:27 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216794","author":"piero","post":"Thanks Hugh!!! I knew nothing of that past meeting held in Padua in June 2015… In order to improve the study made by Adrie van der Hoeven about the presumed “Madder Heme lake”, it would be interesting to read (at least) the intervention by Ing. Gabriele Bedon, CRIS: “Analisi colorimetrica delle macchie di sangue” (= Colorimetric analysis of bloodstains.) The same can said about the “ATR FTIR calibration” (… etc. …) and the intervention by Prof. Pietro Baraldi (Uni Mo Re): “Datazione opto chimica della Sindone” (= Opto chemical dating of the Shroud)….","date":"2015-12-18","mins":"11:09 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216807","author":"piero","post":"Adrie van der Hoeven indicated (as reference) the following address: http://www.haltadefinizione.com/it/la sindone So… We have to continue to work in the field of Colorimetry… Have you tried?.","date":"2015-12-18","mins":"12:52 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216800","author":"piero","post":"Here the words about the CMC formula… >CMC l:c >In 1984 the CMC (Colour Measurement Committee of the Society of Dyes and Colourists of Great Britain) developed and adopted an equation based on LCH numbers. Intended for the textiles industry, CMC l:c allows the setting of lightness (l) and chroma (c) factors. As the eye is more sensitive to chroma, the default ratio for l:c is 2:1 allowing for 2x the difference in lightness than chroma (numbers). There is also a ‘commercial factor’ (cf) which allows an overall varying of the size of the tolerance region according to accuracy requirements. A cf=1.0 means that a delta E CMC value <1.0 is acceptable. Link: http://www.colorwiki.com/wiki/Delta E: The Color Difference.","date":"2015-12-18","mins":"12:29 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216894","author":"piero","post":"I beg your pardon. I should have behaved better on this blog… I am not completely sure of what Adrie van der Hoeven wrote [in particular about (met)hemoglobin…]. For example at p. 713 of tthe paper I have read something that doesn’t convince myself about the acid ferric heme and presumed pinkish red color because this color can be obtained with ferrous iron (Fe 2+) and not with ferric iron (Fe 3+)… In other words: with ferrous iron = deep violet, with ferric iron = brownish black Reference: “Chemistry of Colour” M. Satake, Y. Mido Discovery Publishing House, 1995 See at page 133 This book deals with all aspects of the Chemistry of colour… Instead, for what concerns the careful Colorimetric Analyses and the possible experiments (with blood stains on linen fabric treated and untreated) the discussion to do would be even longer … ….","date":"2015-12-20","mins":"8:58 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216895","author":"piero","post":"Errata corrige: >For example at p. 713 of the paper I have read there is something that doesn’t convince myself regarding the claims by A.v.d.H. On “acid ferric heme” and presumed pinkish red color… Instead of: >For example at p. 713 of tthe paper I have read something that doesn’t convince myself about the acid ferric heme and presumed pinkish red color….","date":"2015-12-20","mins":"9:05 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216803","author":"piero","post":"I think these annoying “little disturbances” to messages (that I have previously sent) have no serious influence about the comprehension of the problem about the unsolved color measurement (thus: regarding the color of bloodstains, with and without treatment based on madder…)..","date":"2015-12-18","mins":"12:38 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216896","author":"piero","post":"I become quite nervous when I read strange claims about crop circles … In fact I believe that these crop circles are hoaxes organized by artists well skilled. Obviously I can not be certain for this origin of crop circles to 100 percent, but I think the odds are very very high….","date":"2015-12-20","mins":"9:09 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216970","author":"piero","post":"The title of an old AFM study was as follows: “Structural analysis of red blood cell membrane with an atomic force microscope.” Yamashina S, Katsumata O. Link: http://www.ncbi.nlm.nih.gov/pubmed/11108033 I think that you could consider to use the AFM to improve the control of what happens with linen treated with madder and then stained with blood. See also what happens in the experiments of Giovanna De Liso with the use of madder ….","date":"2015-12-21","mins":"12:58 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217058","author":"piero","post":"I would like to remember that: >The creative power of God is free, unlimited and certainly superior to human rationality. It is therefore not possible to exclude or not to accept the possibility that there may be other forms of life in the universe for which, like us, God has set the rules and limits. All this does not absolutely contradict Christian theology that sees in Jesus Christ the only creator and redeemer of the universe according to which everything exists and has been created… … and in any case you must be very careful to possible neopagan phenomena … Also you have to think …: > One thing is to consider the possibility of extra terrestrial life and its study on technical and scientific (UFO) and another problem are UF Os and all the phenomena that gravitate around them including the spiritual movements led by strange persons (here an example: Giorgio Bongiovanni) and pseudo gurus… Links: http://en.giorgiobongiovanni.org/history/biography/first part.html http://en.giorgiobongiovanni.org/heavenly messages/2015/3736 extraterrestrial aviation is present and operating.html http://en.giorgiobongiovanni.org/some news/ufo and irrefutable evidence/3469 fidel castro spacecraft at a russian base.html.","date":"2015-12-22","mins":"12:02 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217059","author":"piero","post":"Errata corrige: > One thing is to consider the possibility of extra terrestrial life and its study on technical and scientific basis and another problem are UF Os … Instead of: > One thing is to consider the possibility of extra terrestrial life and its study on technical and scientific (UFO) and another problem are UF Os … — — — >… Due to its role as a development site for new technology, Kapustin Yar is also the site of numerous Soviet era UFO sightings and has been called “Russia’s Roswell”. Link: https://en.wikipedia.org/wiki/Kapustin Yar >Kapustin Yar was the former Soviet Union’s most sensitive air base, even exceeding America’s Area 51 for the levels of secrecy that shrouded it. UFO Files claimed that it was to present never before seen footage of the base, reconnaissance photos and even a virtual tour of its hidden depths. >Kapustin Yar was created as the site for the development of the Soviet Union’s space program after the end of World War II. It lies over 500 miles south of Moscow and about 60 miles east of Volgograd, the former Stalingrad. These days it lies close to the Kazakhstan border, but back in those days, the base was deep inside Soviet territory. It was here that captured V2 rockets and the German scientists that created them were set to work with not only the single task of getting into space before the Americans, but also designing and testing new aircraft, missiles and other weapons systems. The base was deemed so secret that the nearby town of Zhitkur was emptied of its population and levelled because it was too close. … Link: http://www.rolfwaeber.com/mystery/russian roswell/index.html — — — — So… What was Kapustin Yar?… Evidence of the importance of Kapustin Yar was obtained by Western intelligence through debriefing of returning German scientists and spy flights… … and now… What is Kapustin Yar?… >”We should yet again explain to our partners in Brussels and Washington that the training range ‘Ashuluk’ and ‘Kapustin Yar’, where the drills are held, are almost 800 kilometers away from the southeast of Ukraine… … etc. …” Link: http://sputniknews.com/russia/20150528/1022675913.html >On November 17, 2015 at 15:12 MSK (12:12 UTC) the Strategic Rocket Forces carried out a successful launch of a Topol/SS 25 missile from the Kapustin Yar test site. According to the official statement, the purpose of the launch was “to test new combat payload for future ICB Ms.” The warhead was said to have successfully reached its target at the Sary Shagan test range. Link: http://russianforces.org/blog/2015 >”A week of tests” kicked off at the Kapustin Yar range of the Russian Strategic Missile Forces, in the Astrakhan Region. … Link: http://sputniknews.com/videoclub/20151221/1032070573/russia weapons tests.html /11/topol launch from kapustin yar 2.shtml.","date":"2015-12-22","mins":"12:31 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-202646","author":"piero","post":"David, You wrote: >…We could very likely solve the authenticity question of the Shroud with a new STURP 2.0 investigation – using non destructive methods. What are we afraid of? … Well. I think this is the same idea that I already indicated in 1998 because the SP Ms techniques are non destructive methods. So… There is another problem to solve: In my opinion, the basic conflict between established religion and modern science can turn drifted when you blindly believe in some unclear statements without having seen the inherent proofs… And then I want to add that I would be still curious to observe in a better manner what happened with the story on fengite and biotite and presumed piezonuclear neutrons, using the HIM (= Helium Ion Microscope) instead of the Energy Dispersive X ray Spectroscopy (EDS) tests conducted on the specimens. But these analyses can be useless… the main opinion is that they failed to obtain a significative amount of piezonuclear fissions, in any case this controversial story seems to be far from the analyses on linen samples. We have not yet seen the advanced analyses on TS like impressions obtained by De Liso (link: http://www.shs conferences.org/articles/shsconf/pdf/2015/02/shsconf atsi2014 00002.pdf). Instead what we have to deepen are the AFM controls and the possible tests about the (speed of the) arrow of elasticity (see also : the elastic modulus = Young’s modulus) for ancient linen fibrils. These are the things where we have to be focused, the other stories are less important. — — We have to choose a technique to visualise how different linen samples behave under stress. Perhaps some vague suggestions can be derived from the reading of the “Nanostrain project”. The reasoning is the following : if you can use the characterisation of nano strain using piezoelectric materials, then you can claim to be able to control what happens on your linen fibrils submitted to a load of certain amount, using the proper devices (based on piezoelectric tools or directly, with the AFM tip) … — — — — It seems that Einstein had the hobby of sailing… Here what I have read: >Einstein loved sailing, even though he wasn’t very good at it — his neighbors on Long Island frequently had to help him right his capsized boat Tinef (Yiddish for “worthless”). And even though Einstein never learned to swim, he kept sailing as a hobby throughout his life. And also: >the renowned physicist spent the summer of 1935 in Old Lyme, CT, often sailing on the Connecticut coast. >Despite sailing for over half a century, Einstein was not a very accomplished sailor. According to his biographers, he would lose his direction, his mast would often fall down, and he frequently ran aground and had near collisions with other vessels. … Link: http://www.sailingscuttlebutt.com/2013/03/21/albert einstein not much of a sailor/ — — Science and religion. In fall 1980, Pope John Paul II ordered a new look at evidence in Galileo’s trial. In 1992 came acquittal….","date":"2015-06-18","mins":"10:51 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-202512","author":"piero","post":"Daveb of wellington nz wrote: >The Europeans seem capable of investigating a lump of icy rock from the outer limits of the solar system, but so far have been unable to make much progress with what is here on earth directly under their collective noses! Yes. The Europeans seem to be able to investigate a piece of icy rock coming from the outer limits of the solar system. But prior to be able to do this study/observation were needed projects, money, etc. … That is, to go from saying to doing up (= really working, turning the rough ideas in a successful history!) perhaps is longer than it seems … — — Do you know where is located a decent AFM (Lab. Of Materials) apparel? Here (for example) some questions to answer : Are we allowed to use the Atomic Force Microscope (= AFM) (on treated linen samples …and the linen fibrils can be also irradiated multiple times…) in their laboratory and they advised us how to operate it efficiently? How an AFM instrument will succeed probing the secrets of Shroud? Finally, by the way, I want to ask if you can get to exactly know the speed of propagation of elastic arrow in treated lignocellulosic materials … ——————– Irradiation can include irradiating with VUV (and/or X rays and gamma radiation if you want to greatly extend the work of comparison. These irradiations perhaps can be useful for the space studies, but I have some doubt on that choice) and/or with electron beam radiation or corona discharge. Irradiation can also be carried out before or after Maillard reaction and this can be another great extension for the work (thus: with a source of a sort of a possible “bottleneck’s production” [or constraint], before to compare the results). I believe that bending fracture of textiles treated with irradiations is greater than the other cases. … and you? — — — I believe you should improve the AFM observations comparing the results obtained on linen fabrics treated with fungi with the other treated with saponin and then (after the saponin’s treatment) submitted to the same fungal attack… In any case, a preliminary inspection performed with the use of light microscopy can exclude any such affected areas. — — — And, until now, there is not an European Shroud Agency….","date":"2015-06-17","mins":"10:19 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-202520","author":"piero","post":"Perhaps here in Biella might be more interested in the Aubusson tapestries (= wool tapestries. By the way I was told to make that kind of tapestries you should use the wool from New Zealand …) that the linen … or the linen of the Holy Shroud. Link: http://www.travelfranceonline.com/aubusson tapestry facts limousin/ >… Aubusson is world famous for the wonderful tapestries that have been produced in its workshops from 14th century onwards. … … — — Other links: http://www.videoguidelimousin.fr/en/pages/visiter les musees 2 http://www.unesco.org/culture/ich/RL/00250 — — — I wonder if traveling around the world there is some ancient tapestry that reproduces the Shroud. Really… nothing? Zero ? Ancient Egyptians and the Incas used woven tapestries as shrouds in which to bury their dead. Medieval tapestries were woven on linen warps to insure their ability to last through the ages. Maybe an ancient tapestry could make the happiness of our friend Charles, who seems very adept buttoning up strange stories … Here what I have found (= Bayeux): >Hic portatur corpus Edwardi regis ad Ecclesiam Sancti Petri apostoli. >Wrapped in a rich Shroud, Edward’s body is carried on a stretcher by eight men of the royal family, the altar boys all blew their tintinnaboli, clerics and prelates sing their funeral orations. Link: http://www.medievale.it/articoli/gli arazzi di bayeux/ — — >The Bayeux Tapestry is one of the most extraordinary artefacts to survive from the eleventh century. A fragile web of woollen thread on linen, its brilliant colours undimmed after nearly a thousand years, this masterpiece is unique as a complete example of an art form beloved of the aristocracy in the Romanesque era – the `historiated’ or narrative embroidery. … … “The Bayeux Tapestry” by Lucien Musset Boydell Press, 2005 – 272 pages — — Linen velvets are ancient in origin, but I never saw a devotional velvet (with the Holy Shroud depicted upon that textile substrate)..","date":"2015-06-17","mins":"11:07 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-73553","author":"piero","post":"If “the materials have been stored for study”, then we can hope that we are able (today or in future) to try the right way to control in a non destructive manner these very little objects … Do you agree ? … and … Which are the best systems to control the material (coming from the Holy Shroud) ? ….","date":"2014-01-17","mins":"2:02 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","title":"The Questionable Restoration of the Shroud of Turin"},{"id":"comment-149445","author":"piero","post":"Excuse me but I was a bit bored by the issue of checks in transparency (= transmission spectroscopy )… and there are near the same words that I have sent in the past message (dated November 23, 2012 at 11:27 am) : > – the Manoppello image is on byssus (= silkmarine byssus). Unfortunately we were not able to obtain the inherent spectral data ! >No spectrophotometric (transmittance) controls about the Manoppello’s Face ! Why ? >I believe as important thing (to add in the archive) the analysis, using the spectral controls (B.T.W. : Do you know the Labert Beer’s law ?), in order to study these data (see also : the adequate comparisons with the spectrophotometric controls on experiments obtained with byssal threads and other similar materials : treated or not with the different kind of painting or colouring systems !). — — — Perhaps at the National Institute of Physics, University of the Philippines, they have some young researcher….","date":"2014-09-08","mins":"9:51 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"id":"comment-149442","author":"piero","post":"Now I send the message that I prepared I wanted to send for a previous intervention about the Veil of Manoppello: — — — — — — — — — — Always I prefer the straightforward solutions ! … and I avoid to read inconsistent studies or who has mainly academic knowledges … The transmission spectroscopy is the solution. Why I.N.O.A. (Italian National Institute of Optics = http://www.ino.it/en/ ) and others had not followed that simple way ? This is another (little) enigma… Jaworski indicated the presence of melanin (= “Properties of byssal threads, the chemical nature of their colors and the Veil of Manoppello”. IWSAI 2010), but (if I am right) he doesn’t indicated the spectral answer of melanin because the scientific tools used (in that study) were HPLC and PLM. So … If he wanted to solve an enigma IMO this solution was a nonsensical approach. Instead if he mainly wanted to show us great academic knowledges, then we can understand the behaviour by prof. Jaworski … Then, we have to find the exact proofs for melanin into the spectra taken from the Manoppello’s Veil… Unfortunately we don’t know how are the spectral lines because there is a lack of data that we must try to fill with the inherent control. … See also what wrote Jaworski : >The microscopic and spectroscopic studies (performed through the glass of the reliquary) did not lead to clear conclusions as to the nature of the image. … What kind of spectroscopic studies ? Reading the text by Jaworski we don’t know what were these controls ! Have you found the inherent reference ? — — — — I admit : I was too harsh in my words against prof. Jaworski. Sorry: unfortunately I am sick and often I see my time lost in vain … and so… I became too rigorous against Jaworski! — — — — Transmission Spectra : Have you tried to see what are the transmission curves for linen and silkmarine? See also the presence of a glass, a question to solve with adequate calibrations. — — — What are your comments ?.","date":"2014-09-08","mins":"9:38 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"id":"comment-149444","author":"piero","post":"Errata corrige: Now I send the message that I prepared (previously) and I wanted to send … Instead of : Now I send the message that I prepared I wanted to send (for a previous intervention … etc … etc. …).","date":"2014-09-08","mins":"9:42 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"id":"comment-198285","author":"piero","post":"Congratulations, Dan! — — Now I have a little gift for your blog. Twenty one years ago I read an article by Dr. Sebastiano Rodante regarding the “immunizing crying” of the Madonna over her son (Jesus Christ) … Here the latin words: Stabat Mater dolorosa iuxta crucem lacrimosa (= the tearful Mother stood beside the cross) The Weeping Madonna of Syracuse >… One of the many visitors who examined the plaque at close range was Mario Messina, who was highly regarded in the neighborhood. >After observing the slow formation of the tears, he removed the image from the wall. Looked at it thoroughly and was satisfied that the tears was not the result of an internal reservoir. >After the plaque was dried, two tears immediately reappeared. … The Weeping Madonna of Syracuse (Italy) is one of the most unusual of the approved miraculous images of the Blessed Virgin Mary… and Dr. Rodante worked in Syracuse… He indicated the possibility that Mary’s tears were abundant spotted on the front of the chest of the dead body of Jesus. (we also know another question: in 1975, Sebastiano Rodante the medical doctor, started some important experiments strongly highlighting an element never considered before in the history of the experimentations on the Shroud: the bloody sweat…) — — We know that: >Lysozyme is abundant in a number of secretions, such as tears, saliva, human milk, and mucus. Link: http://en.wikipedia.org/wiki/Lysozyme — — See also the study by Gorr, Heather Meloy (2013): Lysozyme Pattern Formation in Evaporating Droplets. It was a Doctoral Dissertation, University of Pittsburgh… >… Lysozyme is a globular protein found in high concentration, for example, in human tears and saliva. The drop diameters, D, studied range from the micro to the macro scale (1 µm – 2 mm). In this work, the effect of evaporation conditions, solution chemistry, and heat transfer within the droplet on pattern formation is examined. … Link: http://d scholarship.pitt.edu/17637/ — — Instead here you can read some information about the use of AFM in particular investigations on contact lens. … Imaging Protein Deposits on Contact Lens Materials Link: http://journals.lww.com/optvissci/Abstract/2008/12000/Imaging Protein Deposits on Contact Lens Materials.8.aspx >Purpose. The majority of studies investigating protein deposition on contact lens materials require that the deposit of interest be removed, potentially resulting in erroneous results if some proteins are not removed adequately. The purpose of this study was to investigate the use of in situ imaging methods to examine protein deposition on conventional poly(2 hydroxyethyl methacrylate) (poly HEMA) based and silicone hydrogel contact lens materials… >… AFM data indicated that balafilcon A, lotrafilcon A and polymacon deposited lysozyme in a similar manner, with very little lysozyme being deposited in discrete areas. Galyfilcon A behaved very differently, with the lysozyme exhibiting both aggregates as well as string like formations over the lens surface. … >… Results. AFM studies demonstrated that the lens materials had markedly differing surface topographies … — — If you want to do some useful preliminar tests on linens, then you have to consider the range of values for tears’ surface tension … Components responsible for the surface tension of human tears 1999, Vol. 19, No. 1 , Pages 4 11 B. Nagyová, and J.M. Tiffany Link: http://informahealthcare.com/doi/abs/10.1076/ceyr.19.1.4.5341 Abstract >Purpose. It was previously thought that the surface tension of tears was due to dissolved mucin, but it has recently been shown that very little mucin is present. The surface tensions of solutions of commercial mucin, lysozyme, lactoferrin or secretory Ig A are all higher than that of tears. The influence of tear lipocalin and lipids remained to be tested. Methods. Surface tension was determined by a micro method on pooled. Intact stimulated human tears, and following extraction with lipid solvents. The extracted material was also added back, as was a variety of lipid standards (phospholipids, glycolipids, sterols, etc.). TLC and GLC were used in partial identification of the extract. Another lipocalin, bovine ß lactoglobulin, was also tested alone and mixed with tear lipids, model lipids, or model tear proteins. Results. Intact tears had a surface tension of 42 46 m N/m, but after lipid extraction this rose to 53 55.5 m N/m. Addition of lipids to the delipidised tear fluid gave a range of tensions from 42 to 49 m N/m, with the greatest effects shown by phospholipids (phosphatidylcholine, sphingomyelin), but full recovery was only achieved by using the extracted lipid material. … … etc. … … Link: http://informahealthcare.com/doi/abs/10.1076/ceyr.19.1.4.5341 — — So… I hope to read no irreverent comments on these easy suggestions of “AFM research on linens sprayed on by tears”. I personally, I have doubts about the level of absorption of tears by the linen (it’s a question of the surface tension for both: linen and tears)… What is your opinion ?.","date":"2015-05-04","mins":"8:38 am","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","title":"Three Millions Page Views"},{"id":"comment-198288","author":"piero","post":"Here another very “very particular” question connected to the tears and to the Purkinje images, that are reflections of objects from the structure of the eye… >…They are also known as Purkinje reflexes and as Purkinje Sanson images… Link: http://en.wikipedia.org/wiki/Purkinje images Here the question: What is the effect of tears on Purkinje images? I refer to the presumed “Purkinje images” present on the famous tilma of Guadalupe… Link:.","date":"2015-05-04","mins":"8:59 am","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","title":"Three Millions Page Views"},{"id":"comment-198363","author":"piero","post":"The “Moro affair” and the analyses on tears… An old article (= published January 12, 2012) appeared in an Italian newspaper and said: > A study by a group of Italian researchers reveals a new secret tied to the kidnapping of the secretary of the Christian Democrats. > In 1978 Moro wept about 11 letters he wrote during his stay in the hideout of Fani. The tests, conducted with the scanning electron microscope, have revealed the fact that the paper was wet letters. … Now I am still curious about what happened to the well known italian politician Aldo Moro … More rigorous examination (performed with the use of the use of the AFM techniques …) could confirm whether he actually wept over the 11 letters he wrote during his stay in the den of Fani street. Perhaps the new tests, conducted with the atomic force microscope (instead of the scanning electron microscope) may reveal whether the paper of the letters had been really watered by human tears. This would not be a great step forward but it is another advancement in the field of knowledges … and when it comes to investigations everything is useful. That said, of course I do not exclude that some laboratory has already performed such analysis. So … The issue of advanced analysis on the tears is still interesting! — — Now I beg your pardon about the question of Purkinje reflexes because this was a problem apparently very far from the Shroud. I have read: >The eyes in this acheiropoíetos (“not made by human hands”), which appear to be almost closed from a distance, are of particular significance. Various phenomena discovered in the human eye in the 19th century with regard to light reflexes (Helmholtz) and reflections (Purkinje Samson) have been documented in the eyes of the image of Our Lady of Guadalupe. Furthermore, the scene of the image development is reflected in her pupils as in the eye of a living person, with corresponding distortions due to astigmatism and a shift in the second eye. Numerous people present were identifiable. Link: http://www.sudariumchristi.com/uk/guadalupe/compare.htm But not everyone accepts the idea of the presence of images in the eye of that particular image of the Mexican Madonna … This speech reminds a little about the history of coins on the eyelids of the Man of the Shroud, that is, we need to understand if the resolution of the Image (…and what is the exact resolution for that “mexican Imprint”?) is compatible with the interesting issues related to the effects of Purkinje. For example: I remember that, in the case of the Shroud, Professor Gonella denied the validity of the finding of the “footprints of the coins” because the resolution of the image of the body on the Shroud (not to mention the question of “nuclear shadow of the coins” in the case of those who believe that the image on the linen cloth was caused by nuclear emissions or radioactivity [!?!?!]) is near 5 mm, if I am right… So the discussion is open to your useful contributions ….","date":"2015-05-05","mins":"7:54 am","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","title":"Three Millions Page Views"},{"id":"comment-204934","author":"piero","post":"I will not be impressed by big numbers… The enormous interest in radiocarbon data must not make us forget that this is a kind of destructive examination. Also, speaking from a strictly religious point of view, the fact of burning a relic is certainly blasphemy (… unless it’s a kind of medieval ordeal …). There are control systems nondestructive feasible with the use of appropriate techniques (leaving aside the “small destructions” … made by Fanti and Malfi). So, the question “to which we must pay attention” is the following: Why we do not want to use those ways of fairly reproducible controls? Link: https://en.wikipedia.org/wiki/Trial by ordeal >…In medieval Europe, like trial by combat, trial by ordeal was considered a judicium Dei: a procedure based on the premise that God would help the innocent by performing a miracle on their behalf. … So. Moral of the story … Try to see what is the number (English language articles) about: AFM, CFM, AFM Raman, ATR FTIR, ATR Raman, or SNOM Raman, etc. …!.","date":"2015-07-08","mins":"10:44 am","url":"https://shroudstory.com/2015/07/08/todays-featured-article-in-wikipedia/","cat":"wikipedia_content","title":"Today’s Featured Article in Wikipedia"},{"id":"comment-198366","author":"piero","post":"I beg your pardon for eventual translation error that occurred, in any case the old italian article wrote: >With SEM, the scanning electron microscope which identified the image by mapping the chemical paper fibers were examined points of slobber/blur/smudge: “We realized that there are salts of potassium and chlorine of their tears, but at the same time that the paper was processed with chlorine” did say the biologist. >For more information, you should, however, take the material and analyze the DNA, but this goes against the principles of restoration: “For ethical choice, we can not do destructive analysis. We tend to full compliance with the original” warned the director of the restoration workshop. — — — Why only SEM controls and not also AFM analyses?.","date":"2015-05-05","mins":"8:13 am","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","title":"Three Millions Page Views"},{"id":"comment-204938","author":"piero","post":"Here another reference about the argument: “ATR FTIR spectroscopy and Raman spectroscopy” “Dead Sea Scroll parchments were produced by different techniques” Published: Jul 25, 2013 Author: Steve Down >Spectroscopic examination of fragments of the Dead Sea Scrolls has shown that the parchments were originally produced by at least two different techniques, contrary to popular belief, say a duo of scientists in Germany. >Ira Rabin and Oliver Hahn from the BAM Federal Institute for Materials Research and Testing have studied scroll fragments which were discovered at four sites up to 50 km from the Qumran Cave, where more than 90% of the known fragments were found, as they discussed in Analytical Methods. >Using a combination of X ray fluorescence, ATR FTIR spectroscopy and Raman spectroscopy, they were able to distinguish between contaminants originating from parchment production, which were distributed throughout the material, and contaminants from the caves where they were stored. … etc. … Links: http://www.spectroscopynow.com/details/blog/140166aea2d/Dead Sea Scroll parchments were produced by different techniques.html?&tzcheck=1 http://pubs.rsc.org/en/Content/Article Landing/2013/AY/c3ay41076e#!div Abstract http://pubs.rsc.org/en/journals/articlecollectionlanding?sercode=ay&themeid=4ce476b3 6472 4010 b263 c6632da4ba5b — *** — Here another study (= “Dalí’s paintings and cellulosic DP”): “Looking beneath Dalí’s paint: non destructive canvas analysis” by Marta Oriola, Alenka Možir, Paul Garside, Gema Campo, Anna Nualart Torroja, Irene Civil, Marianne Odlyha, May Cassar and Matija Strlič Anal. Methods, 2014,6, 86 96 From themed collection Molecular Analysis for Art, Archaeometry and Conservation >A new analytical method was developed to non destructively determine p H and degree of polymerisation (DP) of cellulose in fibres in 19th–20th century painting canvases, and to identify the fibre type: cotton, linen, hemp, ramie or jute. >The method is based on NIR spectroscopy and multivariate data analysis, while for calibration and validation a reference collection of 199 historical canvas samples was used. >The reference collection was analysed destructively using microscopy and chemical analytical methods. >Partial least squares regression was used to build quantitative methods to determine p H and DP, and linear discriminant analysis was used to determine the fibre type. >To interpret the obtained chemical information, an expert assessment panel developed a categorisation system to discriminate between canvases that may not be fit to withstand excessive mechanical stress, e.g. Transportation. >The limiting DP for this category was found to be 600. >With the new method and categorisation system, canvases of 12 Dalí paintings from the Fundació Gala Salvador Dalí (Figueres, Spain) were non destructively analysed for p H, DP and fibre type, and their fitness determined, which informs conservation recommendations. >The study demonstrates that collection wide canvas condition surveys can be performed efficiently and non destructively, which could significantly improve collection management. I am curious about this work because Diana and Marinelli indicated the degree of polymerisation (DP) of cellulose as an important parameter and then I suggested to use the SPM techniques in order to know more about linen fibrils already taken from the Shroud… Unfortunately we can read: >… The reference collection was analysed destructively using microscopy and chemical analytical methods. … … destructively??? B.T.W.: … Do you know Partial least squares (= PLS) regression?.","date":"2015-07-08","mins":"11:41 am","url":"https://shroudstory.com/2015/07/08/todays-featured-article-in-wikipedia/","cat":"wikipedia_content","title":"Today’s Featured Article in Wikipedia"},{"id":"comment-204997","author":"piero","post":"First of all, with regard to destructive tests, when you wrote: “… Regarding the earlier destructive tests of the Dali paintings, I would presume that only very small samples of the canvasses were destroyed in the test, and I would hope that the main works were not too badly damaged…”. I believe that with the generic term (= “destructive”), in reality, they are referring to measures around the viscosity (and these are measures that [first of all] require the dissolution of the cellulosic material to be examined and then the measurement of the viscosity, which then it is correlated [or referable] to the degree of polymerization of the cellulose … unfortunately when there are present certain impurities [for example: Ti O2 = Titanium dioxide, in the viscose rayon, etc.], the viscosimetric test fails to provide an exact answer […or you have to calculate the inherent differences due to the pollution]!). See, for example, the norm: UNI 8282:1994 = Cellulose In Dilute Solutions – Determination Of Limiting Viscosity Number – Method In Cupri ethylene diamine (ced) Solution or Standard Number: UNI UNI 8282 1994 Title: Cellulose in dilute solutions. Determination of limiting viscosity number. Method in cupri ethylene diamine (CED) solution. Cellulosa in soluzioni diluite. Determinazione dell’indice della viscositlimite. Metodo che usa una soluzione di cuprietilendiammi Language: Italian Publication Date: 1994/10/31 Publisher: Unifica zione Italian no(UNI) Link: http://www.freestd.us/soft4/1756344.htm — — — Thank you for the answer on the matter of Statistics…. In any case I hope to further deepen the “PLS” argument… Link: https://en.wikipedia.org/wiki/Partial least squares regression >… The PLS algorithm is employed in partial least squares path modeling. … — — B.T.W.: Do you know the methods of measurement for evanescent wave penetration (in ATR techniques)?.","date":"2015-07-09","mins":"9:09 am","url":"https://shroudstory.com/2015/07/08/todays-featured-article-in-wikipedia/","cat":"wikipedia_content","title":"Today’s Featured Article in Wikipedia"},{"id":"comment-205655","author":"piero","post":"I have found: “A beginner’s guide to partial least squares analysis.” by Haenlein, M., & Kaplan, A. (2004). Understanding Statistics, 3(4), 283 — 297. As available at: http://www.stat.umn.edu/~sandy/courses/8801/articles/pls.pdf and I have also found another paper that can be interesting about the PLS… Title: “Correlation coefficient optimization in partial least squares regression with application to ATR FTIR spectroscopic analysis.” by Yifang Chen, Jiemei Chen, Tao Pan, Yun Hana and Lijun Yaoa Anal. Methods, 2015,7, 5780 5786 Link: http://pubs.rsc.org/en/content/articlelanding/2015/ay/c5ay00441a#!div Abstract Abstract: >A wavelength selection method for spectroscopic analysis, named correlation coefficient optimization coupled with partial least squares (CCO PLS), is proposed, and was successfully employed for reagent free ATR FTIR spectroscopic analysis of albumin (ALB) and globulin (GLB) in human serum. By varying the upper bound of correlation coefficient between absorbance and analyte’s content, the CCO PLS method achieved multi band selection. Two PLS based methods, which used a waveband having positive peaks of the first loading vector (FLV) and a combination of positive peaks of the correlation coefficient spectrum, were also conducted for comparison. Based on the leave one out cross validation for CCO PLS, appropriate waveband combinations for ALB and GLB were selected, the root mean square errors of prediction for validation samples were 1.36 and 1.35 (g L−1) for ALB and GLB, respectively, which were better than the two comparison methods. The CCO PLS method provided a new approach for multi band selection to achieve high analytical accuracy for molecular absorption bands that were composed of several spaced wavebands. — — — Dear “daveb of wellington nz”, perhaps our friend Colin knows the article: “PLS regression methods” by Agnar Höskuldsson. It’s an article first published online: 30 Mar 2005. Original article in “Journal of Chemometrics”, Volume 2, Issue 3, pages 211–228, June 1988 Abstract >In this paper we develop the mathematical and statistical structure of PLS regression. We show the PLS regression algorithm and how it can be interpreted in model building. The basic mathematical principles that lie behind two block PLS are depicted. We also show the statistical aspects of the PLS method when it is used for model building. Finally we show the structure of the PLS decompositions of the data matrices involved. — — B.T.W.: Do you know “Kernel principal component analysis”? From Wikipedia, the free encyclopedia: >In the field of multivariate statistics, kernel principal component analysis (= kernel PCA) is an extension of principal component analysis (PCA) using techniques of kernel methods. >Using a kernel, the originally linear operations of PCA are done in a reproducing kernel Hilbert space with a non linear mapping. … … Links: https://en.wikipedia.org/wiki/Kernel principal component analysis http://www.sciencedirect.com/science/article/pii/S002228600600322 X ——————— Unfortunately I turned the discourse in a drifted “analytical journey”, very far away from the argument : “14 C test, etc….”!.","date":"2015-07-14","mins":"10:16 am","url":"https://shroudstory.com/2015/07/08/todays-featured-article-in-wikipedia/","cat":"wikipedia_content","title":"Today’s Featured Article in Wikipedia"},{"id":"comment-205146","author":"piero","post":"I have found a lot of material on PLS… You wrote: “…I cannot yet see how the technique would yield more information if there were only two data points in the three variates y versus u, v, beyond giving a straight line between the two data points. …” I think we can obtain a lot of data points using proper techniques. Am I wrong? B.T.W.: Today I have seen that in the italian translation of the book by Sheldon Ross it’s printed a bit different set of “Data Points” about a Simple Linear Regression (there are indicated only 8 points from the list of Data Points, with a “Sample size” = 15) and there are little differces for set, but … with the same least square estimators: a= 2.51 b= 0.32 “average x value” (= 46.13) “Sum of squares of the x values” (= 33212.0) “estimated regression line” (Y = 2.51 + 0.32x)… The example used to compute the least square estimators was inherent to measurements on relative humidity and moisture content. — — Here the following description, in Wikipedia: >Partial least squares regression (PLS regression) is a statistical method that bears some relation to principal components regression; instead of finding hyperplanes of minimum variance between the response and independent variables, it finds a linear regression model by projecting the predicted variables and the observable variables to a new space. Because both the X and Y data are projected to new spaces, the PLS family of methods are known as bilinear factor models. … etc. … >… PLS regression is particularly suited when the matrix of predictors has more variables than observations, and when there is multicollinearity among X values. By contrast, standard regression will fail in these cases (unless it is regularized). … etc. … … etc. … Link: https://en.wikipedia.org/wiki/Partial least squares regression — — Another argument: Partial Least Squares Regression and Principal Components Regression. >This example shows how to apply Partial Least Squares Regression (PLSR) and Principal Components Regression (PCR), and discusses the effectiveness of the two methods. PLSR and PCR are both methods to model a response variable when there are a large number of predictor variables, and those predictors are highly correlated or even collinear. Both methods construct new predictor variables, known as components, as linear combinations of the original predictor variables, but they construct those components in different ways. PCR creates components to explain the observed variability in the predictor variables, without considering the response variable at all. On the other hand, PLSR does take the response variable into account, and therefore often leads to models that are able to fit the response variable with fewer components. Whether or not that ultimately translates into a more parsimonious model, in terms of its practical use, depends on the context. — — >… These data are described in Kalivas, John H., “Two Data Sets of Near Infrared Spectra,” Chemometrics and Intelligent Laboratory Systems, v.37 (1997) pp.255 259. Link: http://it.mathworks.com/help/stats/examples/partial least squares regression and principal components regression.html — — The Collinearity Problem in Linear Regression. The Partial Least Squares (PLS) Approach to Generalized Inverses SIAM J. Sci. And Stat. Comput., 5(3), 735–743. (9 pages) >The use of partial least squares (PLS) for handling collinearities among the independent variables X in multiple regression is discussed. >Consecutive estimates are obtained using the residuals from previous rank as a new dependent variable y. >The PLS method is equivalent to the conjugate gradient method used in Numerical Analysis for related problems. >To estimate the “optimal” rank, cross validation is used. Jackknife estimates of the standard errors are thereby obtained with no extra computation. >The PLS method is compared with ridge regression and principal components regression on a chemical example of modelling the relation between the measured biological activity and variables describing the chemical structure of a set of substituted phenethylamines. Link: http://epubs.siam.org/doi/abs/10.1137/0905052 — — As you have seen I am not an expert in Statistics! Another thing: I was not completely sure that Dalì paintings were examined using the viscosimetric method (similar what was indicated in the past [several years ago] by Diana and Marinelli, in order to detect the cellulosic DP, etc. …). But I was lucky to deepen the issue and I have found that they used: >…The viscometric method was used to determine the DP of cellulose. >Although sample consumption is considerable ([similar]30 mg), local heterogeneity is thus avoided leading to lower uncertainty. >DP was calculated from intrinsic viscosity [η], … … etc. …. Link: http://pubs.rsc.org/en/content/articlehtml/2014/ay/c3ay41094c >Several methods of sample preparation were tested, as viscometry has not been used for determination of the DP of such a variety of real canvas samples before. If present, the primer layer was manually removed, following which the samples were soaked and washed to remove gelatine, dried and defibred. >The DP of 95 samples was determined. Obviously we cannot destroy 30 mg (or more) of linen fibrils coming from the Shroud (using the viscometric way)!… — — — Apart the ATR FTIR there are other ways: Super Resolution Microscopy: Principles, Techniques, and Applications (Date: 21 Jan 2014) by Sinem K. Saka Here an excerpt from the Abstract >Diffraction sets a physical limit for the theoretically achievable resolution; however, it is possible to circumvent this barrier. That’s what microscopists have been doing in recent years and in many ways at once, starting the era of super resolution in light microscopy. High resolution approaches come in various flavors, and each has specific advantages or disadvantages. … … = AFM, SNOM, etc. Link: http://link.springer.com/protocol/10.1007/978 1 62703 983 3 2 in “Neuromethods”, Volume 86 2014 = Super Resolution Microscopy Techniques in the Neurosciences Editors: Eugenio F. Fornasiero, Silvio O. Rizzoli Link: http://link.springer.com/book/10.1007/978 1 62703 983 3 Links for a comprehensive review of the single molecule localization microscopy (SMLM) software packages: http://bigwww.epfl.ch/palm/ http://bigwww.epfl.ch/smlm/methods/index.html Here another chapter: Data Analysis for Single Molecule Localization Microscopy (Date: 21 Jan 2014) by Steve Wolter, Thorge Holm, Sebastian van de Linde, Markus Sauer Link: http://link.springer.com/protocol/10.1007/978 1 62703 983 3 6 STORM, PALM and f PALM: http://bitesizebio.com/13434/storm palm and fpalm the alphabet soup of super resolution light microscopy/.","date":"2015-07-10","mins":"11:35 am","url":"https://shroudstory.com/2015/07/08/todays-featured-article-in-wikipedia/","cat":"wikipedia_content","title":"Today’s Featured Article in Wikipedia"},{"id":"comment-199448","author":"piero","post":"For many centuries the footprint that Man is there to ask ourselves what we think … But if we read what wrote Charles Freeman and Andrea Nicolotti, then it seems that we still have doubts about the age of the Shroud … Here I would draw attention to an alternative idea: the dating of wooden box belonged to Otto de la Roche … Is that dating a novelty ? You can use whatever you want: C14, Campanella’s method, Piero’s method… — — — … Soon after its invention, the AFM was also used to measure the mechanical properties of a sample with a nanometric resolution. These measurements are accomplished by using the AFM as a nano indenter and by monitoring the cantilever deflection during the process. The curve displaying the force applied as a function of the tip indentation is referred to as a force indentation (FI) curve… — — See also: “Quantification of the Young’s modulus of the primary plant cell wall using Bending Lab On Chip (BLOC)” Link: http://pubs.rsc.org/en/content/articlelanding/2013/lc/c3lc00012e#!div Citation.","date":"2015-05-18","mins":"10:21 am","url":"https://shroudstory.com/2015/05/17/tweeted-picture-for-today-endless-emotion/","cat":"2015","title":"Tweeted Picture for Today: Endless Emotion"},{"id":"comment-203455","author":"piero","post":"Here’s what you can say (and this speech only remaining in the realm of [alone] Science!): When you want to talk about climate change, you must also remember that we receive a lot of energy from the Sun… >…Solar variation, together with volcanic activity are hypothesized to have contributed to climate change, for example during the Maunder Minimum. >Changes in solar brightness are considered to be too weak to explain recent climate change. … Links: https://en.wikipedia.org/wiki/Solar variation http://ossfoundation.us/projects/environment/global warming/natural cycle https://en.wikipedia.org/wiki/Paleocene%E2%80%93 Eocene Thermal Maximum https://en.wikipedia.org/wiki/Maunder Minimum The term Maunder minimum was introduced after John A. Eddy published a landmark 1976 paper in Science. >Astronomers before Eddy had also named the period after the solar astronomers Annie Maunder (1868 1947) and E. Walter Maunder (1851–1928) who studied how sunspot latitudes changed with time. >The period the husband and wife team examined included the second half of the 17th century. >Two papers were published in Edward Maunder’s name in 1890 and 1894, and he cited earlier papers written by Gustav Spörer. In any case I find interesting to think at the vision witnessed by so many people for what they saw in Fatima. See also: the pulsations and / or changes in the sun … Links: https://en.wikipedia.org/wiki/Miracle of the Sun http://www.zenit.org/en/articles/pius xii saw miracle of the sun.","date":"2015-06-24","mins":"8:42 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-199449","author":"piero","post":"Here the last useful paper that I have found: Revealing changes in molecular composition of plant cell walls on the micron level by Raman mapping and vertex component analysis (VCA) by Notburga Gierlinger published in: Front. Plant Sci., 30 June 2014.","date":"2015-05-18","mins":"10:23 am","url":"https://shroudstory.com/2015/05/17/tweeted-picture-for-today-endless-emotion/","cat":"2015","title":"Tweeted Picture for Today: Endless Emotion"},{"id":"comment-199519","author":"piero","post":"I apologize for this curious idea. Unfortunately I was in a hurry, in fact dating the wooden box Otto de la Roche does not solve the interesting riddle of the shroud. However it would be interesting to be able to use that dating also to improve the archaeometric controls..","date":"2015-05-19","mins":"8:21 am","url":"https://shroudstory.com/2015/05/17/tweeted-picture-for-today-endless-emotion/","cat":"2015","title":"Tweeted Picture for Today: Endless Emotion"},{"id":"comment-203467","author":"piero","post":"I have read: >The Roundtable on Sustainable Palm Oil (RSPO) has prohibited Singapore based Golden Agri Resources (GAR) from developing new areas for oil palm plantations in Indonesia, where it is the largest producer of the tropical commodity, for alleged violations of several RSPO norms such as community land rights. … … >The non profit RSPO was founded in 2004 to promote the growth and use of sustainable palm oil through global standards and engagement of stakeholders. According to the World Resources Institute’s (WRI) Global Forest Watch platform, about 12 per cent of global oil palm farming is currently RSPO certified. … Links: http://palmoilaction.org.au/ http://palmoilaction.org.au/2015/06/international body freezes expansion of palm oil giant/ http://www.rspo.org/about/how we work http://www.rspo.org/members/all http://www.rspo.org/consumers/about sustainable palm oil …And You, What do you think about the rough actions against palm oil? Perhaps Colin Berry has the best informations. I believe that he could be an excellent chemist for us (in this specific field). * * * * * * * * * Instead, with regard to the idea of using of oils on the Shroud, I believe they were not used. In fact, we can see that blood stains have not been deburred/smeared for the presence of oil. However try yourself to do the inherent experiments, with blood and olive oil (or with an aromatic oil), so we’ll see the truth… Then we require a sort of “Akademie Olympia & oils” (see also: Einstein and the “Akademie Olympia”, for model… Link: https://en.wikipedia.org/wiki/Olympia Academy But… Where is our Grossmann ?)..","date":"2015-06-24","mins":"10:53 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-203707","author":"piero","post":"Here a speculation: Were the Four Horsemen of the Apocalpyse a christian answer (= four fearsome horsemen) for the strange facts around the favored horse of Caligula? >Incitatus (Latin) was the favored horse of Roman emperor Caligula (who reigned in 37–41 AD). His name is a Latin adjective meaning “swift” or “at full gallop”… >According to Suetonius’ Lives of the Twelve Caesars (121 AD), Incitatus had a stable of marble, with an ivory manger, purple blankets, and a collar of precious stones. Dio Cassius has indicated that the horse was attended to by servants, and was fed oats mixed with gold flake. … etc. … Link: https://en.wikipedia.org/wiki/Incitatus — *** — Other words (= poetry) about Caligula’s folly by Oriana Ivy (a Translation about Zbigniew Herbert): “Caligula Speaks” Among all the citizens of Rome I loved only one Incitatus–a horse when he entered the Senate the unstainable toga of his coat gleamed in the midst of purple lined assassins Incitatus possessed many merits he never made speeches had a stoic temperament I think at night in the stable he read the philosophers I loved him so much that one day I decided to crucify him but his noble anatomy made it impossible. … etc. … etc. … etc. … Link: http://www.thescreamonline.com/poetry/poetry7 2/herbert/oriana ivy.html.","date":"2015-06-26","mins":"9:56 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-203710","author":"piero","post":"The choice to depict the Four Horsemen of the Apocalpyse in that Book was to humiliate the Roman Empire’s hate against the Christianity… But (perhaps) we have also to take into account other opinions about the madness of Caligula: >… “His aim,” Winterling writes, “was to destroy the aristocratic hierarchy as such and expose it to ridicule.” Seen in this light, some of Caligula’s pranks become more understandable. Notoriously, for instance, he wanted to make his favorite horse, Incitatus, a consul—on the face of it, an insane thing to do. But Winterling suggests that this was never a serious plan, merely a way to mock the aristocrats, for whom the consulship was the crown of a career in politics: “To equip the emperor’s horse with a sumptuous household and destine it for the consulship satirized the main aim of aristocrats’ lives and laid it open to ridicule.” >Caligula’s madness, in other words, was a deliberate exercise in political showmanship. This principle allows Winterling to explain another baffling episode in Caligula’s biography, when he supposedly declared war on the English Channel… … …etc. … Link: http://www.newyorker.com/magazine/2012/01/09/the empire strikes back adam kirsch.","date":"2015-06-26","mins":"10:15 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-203721","author":"piero","post":"I think that has not been taken into account also the death of James in the year 62, the rivalry between Judeo Christians and followers of St. Paul and the mediation efforts tried by St. Peter … Another thing: Is it possible to think that in Antioch Saint Paul had the Shroud available for his catechesis? … and … that this was the source of a further division between the two movements of early Christianity? We have to take care until the historical embroidery is removed from its wooden support … The Acts of the Apostles records three missionary journeys of St Paul and his companions. The fourth missionary journey was done by St. Paul alone, as a prisoner in chains, from Jerusalem to Rome, and eventually to his death. >…Pope Benedict said a tiny hole had been drilled in the sarcophaguus, revealing “traces of a precious linen cloth, purple in colour, laminated with pure gold, and a blue coloured textile with filaments of linen. It also revealed the presence of grains of red incense and traces of protein and limestone. There were also tiny fragments of bone, which, when subjected to Carbon 14 tests by experts, turned out to belong to someone who lived in the first or second century. Link: https://lukechandler.wordpress.com/2009/06/30/the apostle pauls bones identified/ … et voilà ! … … And now the strange historical embroidery is placed on its wooden backing! What instead happens if that was a fake of the Constantine epoch ? Where are the careful analyses (= careful works in our Nano analytical epoch) ?.","date":"2015-06-26","mins":"11:51 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-203715","author":"piero","post":"What have to do with the Apocalypse (= the Book of Revelation), Lugdunum Convenarum (now Saint Bertrand de Comminges, the exile’s village for Antipas with Herodias), the recent words by Pope Francis and Al Gore ? I think we can always speculate on History, etc., but what is important is to demonstrate (in a serious manner) that what is claimed to be the truth is really the truth… A land of exile … Is it in this world, of exile, that we are transforming our old planet Earth? Yet we had already destroyed many animal species in the past … In short, where we can find another lowest common denominator? For example: >John’s denouncement was that Antipas had married his brother Philip’s Wife. The Mosaic law forbad the marriage of a brother’s wife (Lev 18:16; 20:21) with the exception of raising children … … >Herodias was not satisfied to leave John in prison and so at a suitable time she arranged for a banquet, probably for Antipas’ birthday, at Machaerus in Perea in order to get rid of John. Her daughter Salome danced before Antipas’ dignitaries and he promised her with an oath that he would give her anything up to half of his kingdom. Being advised by her mother, she requested John the Baptist’s head on a platter. Antipas was sorry that he had made the promise under oath but due to the presence of his guests he had to follow through with the request. Consequently John the Baptist’s ministry had come to an end in around 31 32 A.D. … > …in A.D. 39 Antipas with Herodias went to Rome but meanwhile Agrippa dispatched one of his freedmen to Rome to bring accusations against Antipas which resulted in Antipas’ banishment to exile at Lugdunum Convenarum, now Saint Bertrand de Comminges of France. Although Herodias did not have to go into exile she chose to follow her husband. Antipas’ territories were given to Agrippa (Jos. Antiq. 7. 1 2 ; 240 255; War ii. 9. 6 ; 181 183). Links: http://www.bible history.com/links.php?cat=44&sub=1379&cat name=Bible+Names+H M&subcat name=Herod+Antipas http://www.bible history.com/Herod Antipas/ANTIPAS Coin of Herod Antipas.htm http://www.numismalink.com/fontanille3.html On the other hand, here what I have read (= these words are critical remarks about what wrote the Holy Father!): >… …We have been listening to political environmentalists like Al Gore for years now, partly discounting what he says ever since his alarmist film An Inconvenient Truth was shown to be so full of wild claims, such as that Hurricane Katrina was caused by global warming (there is no evidence at all for this), and that polar bears as a species were under threat from drowning because of melting polar icecaps (on the contrary, the polar bear population has been growing so much it has to be regularly culled): and, anyway, polar ice, if we include the Antarctic, is growing rather than shrinking. >We need, to say the least, to treat the “science” of global warming with extreme care. Any such hesitations, however, form no part of the Pope’s thinking. >Laudato Si’ appears closely to reflect the influence of the environmentalist Hans Joachim Schellnhuber, a pillar of the UN’s tendentiously political Intergovernmental Panel on Climate Change (IPPC), who has been described in the New York Times as “a scientist known for his aggressive stance on climate policy” and who the Pope recently appointed to the Pontifical Academy of Sciences, despite his other beliefs (he is hardly a Catholic thinker). >As the Vatican correspondent Edward Pentin comments: “Critics have warned that by falling in with proponents of climate change science, the Pope risks getting too close to other key supporters of the theory who support population control and abortion.” >Schellnhuber, perhaps not surprisingly given his current prominence as a papal adviser, claims not to be in favour of population control, but that is of course ridiculous, and even in the recent interview with Pentin in which he is taken to be repudiating the idea of limiting the world’s population, he can’t hide his real underlying assumptions. >Here he is: “If you want to reduce human population, there are wonderful means: Improve the education of girls and young women. Then the demographic transition will be a little bit faster… So I subscribe to a good education, and that’s the only way of population strategy I would support.” In other words, teach the girls about artificial birth control. “If you want to reduce human population”, he says. Well, there’s no if about it: the fact is that he clearly does want to reduce the human population. That’s population control. It is nonsense for him to deny he’s not in favour of it. Does he think we are all fools? >Parts of the encyclical are crude in the extreme. “A number of scientific studies indicate,” says Pope Francis, though without specifying which, “that most [that’s right, he says ‘most’] global warming in recent decades is due to the great concentration of greenhouse gases (carbon dioxide, methane, nitrogen oxides and others) released mainly [I repeat “mainly”] as a result of human activity.” Actually, only about five per cent of present atmospheric carbon dioxide is derived from the use of fossil fuels; that is, just 19 parts of CO2 per million parts of atmosphere. Most CO2 is a natural part of the atmosphere. It is not pollution: indeed, human life is largely dependent on it since without CO2 there could be no growth of any kind of vegetable matter: no CO2, no trees. No trees, no oxygen. And yet Francis writes that “Carbon dioxide pollution increases the acidification of the oceans and compromises the marine food chain”: It’s a dubious theory put forward by some: but it is far from having been proved. >The danger of getting too closely involved in the politics of climate change is that they destructively divert our attention, (and that “our” includes the Pope himself), from a political imperative one would have thought much closer to the heart of what Francis, and with him the Church, really cares about. He has always claimed, with evident sincerity, to be on the side of the poor. And yet he attacks fossil fuels, their chief energy source, which he does admit are “at the heart of the worldwide energy system”. … … etc. … … etc. … Link: http://www.catholicherald.co.uk/commentandblogs/2015/06/24/following st francis the pope teaches concern for nature but laudato si will bring no justice for the poor/ So… What is your own opinion ? — — — — So, after a while we will find ourselves discussing about ecology and maybe also around the “misteries” about Rennes le Chateau! Then I believe that it is necessary to know how to properly separate the arguments and then treat them one by one, with great patience! … Now I apologize for my vehemence..","date":"2015-06-26","mins":"11:13 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-29849","author":"piero","post":"I have read your interesting discussions … I agree with some comment sent about the “commercial book”. But Giulio Fanti is a Professors of Mechanical Engineering and we presume he was able to work with the adequate experiments. Then we have to wait before to read the report about the inherent experiments. In my opinion it’s impossible to condemn (… perhaps out of season ?) a work (as some of you are trying to do ) before to read that work ! Then there is the possibility to improve the discussion about the important point indicated by Hugh Farey, probably : “the shroud fragments sucked out with a vacuum cleaner are likely to be more degraded, and thus give an apparently older age for the shroud than it really is…” Then : Where are the right indications ? Where is the right work ? In my idea we have to work using the fibrils taken in the past and keeped in a safe place. Then we can compare the results obtained using the material taken by Riggi .. — — In any case (if we want to work in a proper manner) we have to try to control the certified fibrils using the AFM techniques. Do you agree on that question ? — — In my opinion the five keys (= the Matters) useful to work, in order to obtain a result, are the following : –Materials Science –Applied Mechanics and Structural Mechanics –Textile Chemistry –Nanotechnology –Thermodynamics –Statistics — — You have to discuss the results obtained from (for example) the AFM three point bending test (on ancient and modern linen fibrils), etc. … ! Where are the useful textile works to take into account in order to be right with the claims ?.","date":"2013-04-08","mins":"6:26 am","url":"https://shroudstory.com/2013/04/07/when-it-comes-to-the-shroud-of-turin-has-peer-review-lost-its-luster/","cat":"news_&_views","title":"When it Comes to the Shroud of Turin, Has Peer Review Lost its Luster?"},{"id":"comment-203863","author":"piero","post":"Louis, I think the fact of simply repeating a title and then not to try to comment the entire article (… something that, unfortunately, I have not even managed to do myself) I do not think solves the problem… Or not? In any case I would be curious to read the opinion of the Holy Father about the 2006 documentary film directed by Davis Guggenheim about former United States Vice President Al Gore’s campaign to educate citizens about global warming … Link: https://en.wikipedia.org/wiki/An Inconvenient Truth >Gore became interested in global warming when he took a course at Harvard University with Professor Roger Revelle, one of the first scientists to measure carbon dioxide in the atmosphere. >Later, when Gore was in Congress, he initiated the first congressional hearing on the subject in 1981. >Gore’s 1992 book, Earth in the Balance, dealing with a number of environmental topics, reached the New York Times bestseller list … Useful links: https://en.wikipedia.org/wiki/Keeling curve https://en.wikipedia.org/wiki/Carbon dioxide in Earth%27s atmosphere https://en.wikipedia.org/wiki/Global warming https://en.wikipedia.org/wiki/Representative Concentration Pathways https://en.wikipedia.org/wiki/Greenhouse gases https://en.wikipedia.org/wiki/Climate engineering.","date":"2015-06-27","mins":"9:52 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-29890","author":"piero","post":"The careful studies of the pollen require the adequate knowledges in the field of the B I O L O G Y ! … and see also the blood crust … the figures 23 24 in that book (= under the optical microscope and under the SEM). See also : the inherent spectra about the chemical composition. I believe that using the AFM techniques is possible to improve these controls ! — — Sorry for that unpleasant forgetfulness ! I beg your pardon..","date":"2013-04-08","mins":"12:22 pm","url":"https://shroudstory.com/2013/04/07/when-it-comes-to-the-shroud-of-turin-has-peer-review-lost-its-luster/","cat":"news_&_views","title":"When it Comes to the Shroud of Turin, Has Peer Review Lost its Luster?"},{"id":"comment-80388","author":"piero","post":"I agree about the obvious fact : “The subject of this web site is the Shroud of Turin” ! … and perhaps the geological activities and the Body Image Formation are not well connected… See also : the lack of discussion in this blog about the SSNDT and the advanced controls (SPM analyses, AFM bending tests, etc.) about linen fibrils, etc. … There are a lot of other intersting things when we want to open a discussion about the Shroud … For example : … In my opinion, you have to read an italian book in order to improve your knowledges. Here the title : “Bit Bang. La nascita della filosofia digitale” by Giuseppe O. Longo e Andrea Vaccaro. — — Here few italian words (with english translation). Qual è la vera essenza della realtà? … What is the true essence of reality ? … Questa domanda, che ha inquietato la filosofia sin dal suo primo apparire, ha ricevuto molte risposte … This question, which has disturbed the philosophy since its first appearance, has received many responses … … il “bit”, l’unità elementare dell’informazione, diventa il costituente ultimo della realtà, ancora più fondamentale della materia e dell’energia. … the “bit”, the basic unit of information, it becomes the ultimate constituent of reality, even the most basic of matter and energy. L’universo è un immenso computer che senza sosta calcola se stesso e tutte le proprie componenti: alla sua origine si colloca dunque un vero e proprio “Bit Bang”. The universe is a huge computer that calculates non stop itself and all its components: its origin is somewhere a real “Bit Bang”. A sostegno di questa concezione, gli autori forniscono un’articolata serie di argomenti storici e concettuali e costruiscono un quadro che si configura come una vera e propria filosofia, la “filosofia digitale”. … In support of this view, the authors provide a comprehensive range of historical topics and concepts, and build a framework that is configured as a real philosophy, the “digital philosophy.” … — — Link : http://estropico.blogspot.com/2013/09/bit bang la nascita della filosofia.html#ixzz2tgxc Kny X In other words : I am curious about the strange speculations around the quantity of Information encoded in that Ancient Linen Sheet … and the idea of Resurrection as connected with the concept of “Bit Bang” (!!??!!)… Perhaps going in this direction there is the hope to improve the science theology dialogue. Do you agree or not ? — — — — Look at one of Rembrandt’s most puzzling prints, as its exact subject is a mystery … >It shows an elderly scholar in his study, transfixed by the apparition of a blazing disc of light enclosing a series of letters. The scene may represent an alchemist, but does not correspond with traditional representations of the subject. Although nicknamed ‘Faust’, it does not accord with any passage in Marlowe’s ‘Dr Faustus’. The shining disc also remains unexplained, although the letters ‘INRI’ match the inscription placed over Christ’s head during the crucifixion. The scene possibly shows an allegory of faith … Link : http://www.nationalgalleries.org/collection/artists a z/R/4413/artist name/Rembrandt (Rembrandt van Rijn)/record id/18546 The letters surrounding the disc are intended to be indecipherable, reminding the learned scholar that human knowledge is limited and ambiguous, in contrast with the clarity of divine wisdom … What is your comment ?.","date":"2014-02-18","mins":"1:31 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?"},{"id":"comment-80641","author":"piero","post":"I beg your pardon about Rembrandt and the strange (or ambiguous) scene (… an allusion ?). I was a bit tired because I have followed some ideas (by Aldo Gritti & others) about another mysterious question : the Voynich manuscript (VMS was radiocarbon dated ) ! Now : no fanciful speculations on forgery by Wilfried Voynich or Rosicrucians & Nostradamus, etc. … Sorry … — — I have found a reference about the 14 C test for Voynich manuscript (= VMS). Link : http://www.edithsherwood.com/radiocarbon dating statistics part2/index.php >The non linearity of the tree calibration curve, whether exascerbated by SCD or not, influences the magnitude of the 1 and 2 SD estimates of the calendar year errors. >Table 1 below, gives additional examples of the problems that result when the 1 and 2 SD ranges about an estimated mean 14 C BP age are used to determine calendar age ranges from the tree ring calibration curve. >All the parchment samples are from the Beinecke Library and were analyzed by the U. Of Arizona. The ages of samples (1 4) are known, the Vinland map has been dated to ~1434. The data from which this table was constructed came from Table 2 in http://www.webexhibits.org/vinland/paper donahue02.html (= Determination of the Radiocarbon Age of Parchment of the Vinland Map D J Donahue, J S Olin, G Harbottle) — — Now … I hope to receive an interesting answer about the exact meaning of : calibration, one sigma and two sigma … ! — —.","date":"2014-02-19","mins":"1:45 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?"},{"id":"comment-80877","author":"piero","post":"I have tried to read somenthing abou the laminography… and … I have found the study : Laminographic imaging using synchrotron radiation – challenges and opportunities by Lukas Helfen, Feng Xu, Heikki Suhonen, Peter Cloetens, Tilo Baumbach under the address ; http://iopscience.iop.org/1742 6596/425/19/192025/pdf/1742 6596 425 19 192025.pdf Here an excerpt from the Abstract : >Synchrotron radiation computed laminography (SRCL) was developed as a nondestructive three dimensional (3 D) imaging technique for flat and laterally extended objects. >Complementing the established method of computed tomography, SRCL is based on the inclination of the tomographic axis with respect to the incident x ray beam by a defined angle. >Its ability for 3 D imaging of regions of interest in flat specimens was demonstrated in various fields of investigation, e.g. In nondestructive testing, material science and life sciences. … … Here another version of the study : Nano laminography for three dimensional high resolution imaging of flat specimens by L. Helfen, F. Xu, H. Suhonen, L. Urbanelli, P. Cloetens and T. Baumbach Link : http://iopscience.iop.org/1748 0221/8/05/C05006/pdf/1748 0221 8 05 C05006.pdf?origin=publication detail See also : Nano laminography inspection (X ray) and parchments — — There is another study : Phase contrast laminography based on Talbot interferometry by Venera Altapova, Lukas Helfen, Anton Myagotin, Daniel Hänschke, Julian Moosmann, Jan Gunneweg, and Tilo Baumbach Abstract Synchrotron laminography is combined with Talbot grating interferometry to address weakly absorbing specimens. Integrating both methods into one set up provides a powerful x ray diagnostical technique for multiple contrast screening of macroscopically large flat specimen and a subsequent non destructive three dimensional (3 D) inspection of regions of interest. The technique simultaneously yields the reconstruction of the 3 D absorption, phase, and the so called dark field contrast maps. We report on the theoretical and instrumental implementation of of this novel technique. Its broad application potential is exemplarily demonstrated for the field of cultural heritage, namely study of the historical Dead Sea parchment. Under : http://www.opticsinfobase.org/view article.cfm?gotourl=http%3 A%2 F%2 Fwww%2 Eopticsinfobase%2 Eorg%2 F Direct PDF Access%2 F1 C13568 C%2 DE0 A8%2 D14 E0%2 DFA1122812 ECC863 D%5 F229750%2 Foe%2 D20%2 D6%2 D6496%2 Epdf%3 Fda%3 D1%26id%3 D229750%26seq%3 D0%26mobile%3 Dno&org= You can read the same study : Phase contrast laminography based on Talbot interferometry Copyright 2012 Optical Society of America See also : B.M. Murphy, M. Cotte, M. Mueller, M. Balla and J. Gunneweg, “Degradation of parchment and ink of the Dead Sea scrolls investigated using synchrotron based X ray and infrared microscopy, in Holistic Qumran,” in Holistic Qumran, J. Gunneweg, A. Adriaens and J. Dik, eds. (Brill Leiden, 2010), pp. 77–98..","date":"2014-02-20","mins":"10:12 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?"},{"id":"comment-80642","author":"piero","post":"I forgot to write (into the previous text) an “interesting keyword” : “computed laminography” … Do you know that particular technique ?.","date":"2014-02-19","mins":"1:48 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?"},{"id":"comment-80879","author":"piero","post":"First of all : “About” and not “abou” !!! I beg pardon … Here another reference : Development and trends in synchrotron studies of ancient and historical materials Loïc Bertrand, Marine Cotte, Marco Stampanoni, Mathieu Thoury Federica Marone Sebastian Schöder Abstract : >Synchrotron photon based methods are increasingly being used for the physico chemical study of ancient and historical materials (archaeology, palaeontology, conservation sciences, palaeo environments). In particular, parameters such as the high photon flux, the small source size and the low divergence attained at the synchrotron make it a very efficient source for a range of advanced spectroscopy and imaging techniques, adapted to the heterogeneity and great complexity of the materials under study. The continuous tunability of the source — its very extended energy distribution over wide energy domains (me V to ke V) with a high intensity — is an essential parameter for techniques based on a very fine tuning of the probing energy to reach high chemical sensitivity such as XANES, EXAFS, STXM, UV/VIS spectrometry, etc. The small source size attained (a few micrometres) at least in the vertical plane leads to spatial coherence of the photon beams, giving rise in turn to a series of imaging methods already crucial to the field. This review of the existing literature shows that microfocused hard X ray spectroscopy (absorption, fluorescence, diffraction), full field X ray tomography and infrared spectroscopy are the leading synchrotron techniques in the field, and presents illustrative examples of the study of ancient and historical materials for the various methods. Fast developing analytical modalities in scanning spectroscopy (STXM, macro XRF scanning) and novel analytical strategies regarding optics, detectors and other instrumental developments are expected to provide major contributions in the years to come. Other energy domains are increasingly being used or considered such as far infrared and ultraviolet/visible for spectroscopy and imaging. We discuss the main instrumental developments and perspectives, and their impact for the science being made on ancient materials using synchrotron techniques..","date":"2014-02-20","mins":"10:19 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?"},{"id":"comment-81183","author":"piero","post":"I beg your pardon about my errors : double “I”, parchement instead of parchment … In any case Voynich was an interesting personage ….","date":"2014-02-21","mins":"12:22 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?"},{"id":"comment-81168","author":"piero","post":"Thank you for your answers ! In the past I have read something on odd ratio and bookmaker rule … Sorry… As you have seen I get lost writing something (… of superabundant ?) on laminographic controls (this kind of analyses can be useful in parchement study. See for example : Dead Sea Scrolls, Voynich manuscript, etc.). My approach is a bit different because I pointed your attention toward the SPM analyses and the SSNDT as reference materials (during the tests). — — B.T.W. : Last week I I followed a conference centered on a copy (this old parchment was controlled in Italy, by Baraldi …) of Voynich manuscript and the relator didn’t agreed with Aldo Gritti (who pointed the finger on forgery by Voynich) ….","date":"2014-02-21","mins":"10:59 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?"},{"id":"comment-141641","author":"piero","post":"First of all : Great job, Dan !!! — — — — Perhaps I am a bit nitpicker, but … I am still curious about the book : The Jewish Annotated New Testament Hardcover – November 15, 2011 by Amy Jill Levine >Although major New Testament figures — Jesus and Paul, Peter and James, Jesus’ mother Mary and Mary Magdalene — were Jews, living in a culture steeped in Jewish history, beliefs, and practices, there has never been an edition of the New Testament that addresses its Jewish background and the culture from which it grew — until now. >In The Jewish Annotated New Testament, eminent experts under the general editorship of Amy Jill Levine and Marc Z. Brettler put these writings back into the context of their original authors and audiences. >And they explain how these writings have affected the relations of Jews and Christians over the past two thousand years. … … … link: http://www.amazon.com/Jewish Annotated New Testament/dp/0195297709/ref=la B001 H9 TWM0 1 1?s=books&ie=UTF8&qid=1406910993&sr=1 1.","date":"2014-08-01","mins":"12:45 pm","url":"https://shroudstory.com/2014/07/31/your-comments-count-intellectual-clarity-and-open-discussions/","cat":"news_&_views","title":"Your Comments Count: Intellectual Clarity and Open Discussions"}]
