[{"id":"comment-214438","author":"piero","post":">…The invention of the telescope in the 17th century provided scientists with unprecedented, and ever clearer, views of Mars. >Much remained hazy, however, leaving observers plenty of room in which to exercise their imaginations. … >… …From his observatory in Arizona, Lowell mapped hundreds of supposed canals. Lowell’s many articles and books, including “Mars as the Abode of Life” in 1908, did much to popularize the idea of a race of intelligent Martian farmers. … In 1907 the British naturalist Alfred Russel Wallace published the book “Is Mars Habitable?” that severely criticized Lowell’s claims… >…Debunking Lowell’s theories, Alfred Russel Wallace countered that only “a race of madmen” would build open canals to carry water on Mars because the planet was so cold and airless that any liquid water would instantly evaporate. … Link: http://www.amnh.org/explore/science bulletins/astro/documentaries/geologists on mars/visions and revisions of mars So, here … leaving apart another “curious” fact [= the adherence to intelligent design by Alfred Russel Wallace (1823 1913). Links: http://www.evolutionnews.org/2012/01/the natural and055571.html http://publicdomainreview.org/2013/10/30/alfred russel wallace a heretics heretic/%5 D, I can only recall that interesting rethorical skills are a different thing with respect a true and serious research Project… — — — I think the question: “How much do we know about the cognitive development of hominids?” has (also) something to do with the advancement of SETI (and TS??) researches … ————.","date":"2015-11-09","mins":"12:36 pm","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-56318","author":"piero","post":"In my idea it’s impossible to destroy the Catholicism with few words about the presumed Vatican’s duplicity around the authenticity … — — As you have seen the next exhibition will be held in a period of about 45 days between the Easter season (from mid April 2015) and the closing celebrations of the bicentenary (August 16th, 2015) and then there are other (… better ?) occasions to interpret papal statements … Do you agree ? >… The opening of the exhibition in the Easter refers to the death and resurrection of the Lord, and with it the beginning of the Church’s mission. >The Shroud, Veil of death, for believers becomes a proof which recalls, with a great evocative effectiveness, the victory of the Lord of life. … >Cesare Nosiglia >Archbishop of Turin >Papal Custodian of the Shroud Source : http://www.sindone.org/the holy shroud  english /news and info/00045909 Message from the Custodian of the Shroud.html — — — See also, in the blog : “More on the 2015 Rumors” under the address : https://shroudstory.com/2013/10/09/more on the 2015 rumors/ — — In Wikipedia ( = http://en.wikipedia.org/wiki/Roman Catholic devotions to Jesus Christ ) you can read the following words : >On the first Friday in Lent 1936, Sister Maria Pierina de Micheli, a nun born near Milan in Italy, reported a vision in which Jesus told her: “I will that My Face, which reflects the intimate pains of My Spirit, the suffering and the love of My Heart, be more honored. He who meditates upon Me, consoles Me”. Further visions reportedly urged her to make a medal with the Holy Face based on the image from Secondo Pia’s photograph of the Shroud of Turin. >In 1958, Pope Pius XII approved of the devotion and the Holy Face medal and confirmed the Feast of the Holy Face of Jesus as Shrove Tuesday (the Tuesday before Ash Wednesday) for all Roman Catholics … … — — Here another point to consider : >The International Institute for Research on the Face of Christ was formed in 1997 by Cardinal Fiorenzo Angelini and the Benedictine Sisters of the Reparation of the Holy Face in Rome … Source : http://en.wikipedia.org/wiki/Holy Face of Jesus and try also to read the words under the address : http://www.thereseoflisieux.org/the holy face of jesus/ = St. Therese of Lisieux and the Holy Face of Jesus … >The Holy Shroud of Turin >Discusses the history of the devotion to the Holy Face and St. Therese’s participation in it. Note that Therese never saw the Shroud of Turin, but after Therese’s death her sister Celine painted a famous picture of the Holy Face based on the Shroud. — — So … What is your comment ?.","date":"2013-12-04","mins":"10:43 am","url":"https://shroudstory.com/2013/11/29/a-point-of-view/","cat":"other_blogs","title":"A Point of View"},{"id":"comment-216381","author":"piero","post":"I did not think that our speech can be turned in a set of vague exchanges, with many digressions … I just tried to focus the discussion on the concrete needs for scientific research (AFM controls, etc.). I think that an international company such as NT MDT has a certain level of freedom and good margins to be independent of the influence of the secret services. But I cannot be sure of that. Here (perhaps) there is an example (…five years ago): “NT MDT Co. Participated in Russian Ireland Forum of Nanotechnology” >17.09.2010 >On the 8th of September the one day Russian Ireland Forum of Nanotechnology was held in the head office of the Russian Corporation of Nanotechnologies (Russia). >As the leading Russian manufacturer of equipment for nanoscience NT MDT Co. Participated in the Forum. >The Forum was organized by Science Foundation Ireland (SFI) and the Russian Corporation of Nanotechnologies (RUSNANO). Etc. …, etc. … >RUSNANO is Russian state owned corporation established in 2007 to enable Government policy in the field of Nanotechnology. >The corporation is aimed at commercializing developments in nanotechnology. >RUSNANO co invests in nanotechnology industry projects that have high commercial potential or social benefit …etc. … Link: http://www.ntmdt.com/news/view/nt mdt co participated in russian ireland forum of nanotechnology I have no particular claims about the so called (or presumed) “Putin’s Kleptocracy” (then, see also = …”Who Owns Russia?”!!!)… I am just curious about the possibility to improve the advancement of scientific knowledges on two ancient relics/reperts using SP Ms, etc...","date":"2015-12-13","mins":"8:28 am","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-216487","author":"piero","post":"Perhaps my previous interventions on this blog about the theme: “Putin, Russia, nanotechnology and SPM controls of textiles relics” were only a bit sketched and harsh attempt to depict the situation. Instead, for example, if I had been a creative artist, I should show to you the possibility to obtain a blue madder heme lake using the blood of some little animal (= mollusc)… >…Oxygenation causes a color change between the colorless Cu(I) deoxygenated form and the blue Cu(II) oxygenated form… Link: https://en.wikipedia.org/wiki/Hemocyanin So … Now I want to write something on another, less boring, subject… In a review about the book of Demetrio Paparoni (“Cristo e l’imponta dell’Arte”) I have read: > A footprint: and then a reference to an absent body, who was present, and now it is not … more > Paparoni, critic, curator and founder of the contemporary art magazine “Tema Celeste”, think about the Shroud and especially around the Veronica to expand al’eco de body and the face of Christ in art, resonant as memory or as explicit reference in fingerprint famous as blueprints Rauschenberg and Anthropometries Klein … > … The figure of Christ crucified and buried, the Christ of Good Friday and Holy Saturday, has become an important chapter of a repertoire semantically dense and powerful, but now free from the religious and historical context from which it originates … I think that this kind of return to the paradox of a schizophrenic presence absence of God is what can upset the man. This modern man is immersed in the World and in the evil (the emblematic figure of Putin, a former secret agent […probably involved in who knows what kind of secret plots], can also be seen in this aspect) … Here some words about the artistic attempts made by Rauschenberg: >… Somewhere between the end of the Abstract Expressionism period and the beginnings of the Pop Art movement, Robert Rauschenberg began experimenting with portraiture through the usage of blueprint photograms. Rauschenberg made exposures of his subject’s bodies as they sprawled in elaborate and strange positions across the huge piece of blueprint paper, which he exposed using a lamp. >The ghostly white subjects appear ethereal against the cornflower blue backdrop, framed by salvaged foliage. Delicate and wraithlike, Rauschenberg’s subjects appear as though they are floating through the sky, sometimes appearing with whimsical props, or surrounded by an array of leaves and flowers. >These early photographic experiments of Rauschenberg’s seem worlds apart from the political and colourful work that he is perhaps best known for. >However, this experimentation lead to his usage of found and vernacular imagery alongside his own photographs to create silk screen prints, paintings, sculptures and installations. … Link: http://www.openeye.org.uk/2013/07/painting with light/ In any case I have some doubt about the use of the very materiality of our body shell… See also: “Robert Rauschenberg creating a blueprint photogram, photographed by Wallace Kirkland”… these secular nymphs besides whose shapes often we do not see appear more than a sort of desperate nihilism expressed by artists … Links: https://ikon gallery.org/shop/cameras/sunography paper/ http://www.sunography.com/?page id=86 http://clampart.com/2011/02/mark morrisroe 1959 1989 collected works/ >…This book tells how artists have dealt with in their work relationship with the transcendent and how they treated the image of Christ, interpreting the figure with the goal of making the invisible visible. >Demetrio Paparoni, among the most? >Keen observers of contemporary approaches to analyzing paintings of the past in relation to the visions that come from modern and contemporary art. >This approach emerges already in the cover, a recent painting by Chinese artist Yue Minjun, which incorporates the Deposition from the Cross by Rosso Fiorentino, however emptying of human presence. >With a flat and accessible writing, the book examines the way in which today’s artists have reshaped the iconographic, and inevitably theological, the figure of Christ in the light of historical changes and the development of new languages. >…The book brings into play new combinations to help you analyze the anthropometry of Yves Klein and the many works created by the imprint of the human body in relation to the Shroud of Turin. Also devotes attention to the way in which the figure of Christ appears in contemporary Chinese art. The wealth of references ranging from Matthias Grünewald to Anish Kapoor, by Sebastiano del Piombo to Akseli Gallen Kallela, from ancient icons to Andy Warhol, from Hans Holbein Marlene Dumas by veronica of El Greek to those of Georges Rouault, Mimmo Paladino , Francesco Clemente and Nicola Samori, from the Shroud of Turin to the representations that have made Tony Oursler and Wang Guangyi. Through its analysis and extensive overview of works, reproduced with print quality that characterizes publications Skira, “Christ and the imprint of the Art” makes an important contribution to the contemporary debate about art today. Link: http://webcache.googleusercontent.com/search?q=cache:TR6cn8 NR2 Fw J:www.artslife.com/en/2015/11/05/demetrius paparoni christ and the imprint of the art/+&cd=3&hl=it&ct=clnk&gl=it#sthash.XK0 Pcj4 V.dpuf So: … an empty linen sheet, an empty Art… and an “empty Christ”???.","date":"2015-12-14","mins":"11:42 am","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-216581","author":"piero","post":"Here I want to add a very short “TERS Bibliography”. Tip enhanced Raman spectroscopy (TERS) has been proposed as a method to spectroscopically interrogate a wide variety of chemical, biological, and material samples, with sub diffraction limited imaging capabilities. In TERS, the electromagnetic field enhancement is located at a sharp metallic tip that is irradiated with laser light. When the tip is brought close to the sample of interest, it provides a localized region of SERS enhancement, which enables structural and compositional characterization with spatial resolution of a few nanometers. … — — — >TERS uses a scanning probe microscopy (SPM) tip as an external enhancing unit. >Because the enhancement originates from an external source, this technique makes significantly enhanced Raman signals accessible for any adsorbate on any surface. >When a noble metal SPM tip is irradiated with light that excites the tip LSPR, electromagnetic ﬁeld enhancement takes place near the tip apex. >This enhancement can be used to increase the Raman scattering intensity from molecules in the vicinity of the tip, even though they are not directly adsorbed to it, due to the long range nature of the interaction between the molecules and the enhanced electromagnetic ﬁeld. >SPM tips made from or coated with Ag or Au have been shown to enhance Raman scattering intensities of molecules near the tip by 3 to 6 orders of magnitude (Pettinger et al., 2002, 2004; Watanabe et al., 2004). >An additional advantage afforded by TERS is its nanometer scale spatial resolution. >TERS combines the high sensitivity and rich chemical information content of SERS with the excellent spatial resolution provided by SPM. >TERS can provide Raman spectra with a spatial resolution near the radius ofcurvature of the SPM tip, which is far better than the diffraction limit typically encountered in optical microscopy. >For this reason, TERS has been referred to as apertureless near ﬁeld Raman spectroscopy. >TERS has been used to provide high resolution images of nanoscale samples, and since the light detected is Raman scattering, chemical information is built in. Source: “Plasmonic materials for surface enhanced and tip enhanced Raman spectroscopy” by MA. Y oung, J A. Dieringer, RP. Van Duyne Link: http://sites.northwestern.edu/vanduyne/files/2012/10/2007 Young.pdf — — — >… Opportunities for future research include the development of noninvasive approaches and the application of SERS to the analysis of single layers on stratigraphic cross sections. Bringing the probe directly to the artifact or sample without leaving residues could, for example, be achieved with tip enhanced SERS (TERS) or advanced functionalized SERS active optical fibers. … Source: “Identification of Organic Colorants in Fibers, Paints, and Glazes by Surface Enhanced Raman Spectroscopy” by Francesca Casadio (A.W. Mellon Senior Conservation Scientist at the Art Institute of Chicago), Marco Leona (David H. Koch Scientist in Charge of the Department of Scientific Research at the Metropolitan Museum of Art) and other reserchers….","date":"2015-12-15","mins":"10:31 am","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-216494","author":"piero","post":"Errata corrige: >Link: https://www.bruker.com/fileadmin/user upload/8 PDF Docs/Surface Analysis/AFM/Application Notes/AN136 Rev A2 Advances Combined AFM Raman App Note.pdf >I would be curious to observe what are the exact differences about TERS spectra of linen fibrils Instead of: >Link: o in https://www.bruker.com/fileadmin/user upload/8 PDF Docs/Surface Analysis/AFM/Application Notes/AN136 Rev A2 Advances Combined AFM Raman App Note.pdf >I would be curious to observe whjat are the differences about TERS spectra of linen fibrils.","date":"2015-12-14","mins":"12:42 pm","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-216659","author":"piero","post":"Here’s what we can read, surfing the Web: >… At the recent SPIE conference in San Diego, the Xplo RA Nano equipped, with AFM TERS tips, showed nanoscale chemical imaging of a single carbon nanotube with a spatial resolution of 8 nm, confirmed from the section analysis of the intensity of the TERS bands. The images … >… show an onsite demonstration of TERS mapping of a single carbon nanotube, with an optical spatial resolution down to 8 nm. >“The TERS image on the right, 100 x 100 nm scanning area, is obtained with a pixel step size of 1.3 nm, in a total acquisition time …The HORIBA Scientific TERS instrumentation is robust, compact, and easy to use. It is currently available for chemical imaging at the nanoscale for real world applications. >More information can be found at: http://www.horiba.com/raman afm Link: http://www.horiba.com/scientific/news events/latest news/article/horiba scientific offers unique solution for ters technique 40303/ >HORIBA’s leading Raman technology is now integrated with outstanding scanning probe microscopy (SPM). >The platform integrates Atomic Force Microscopy (AFM), near field optical techniques (SNOM, NSOM), Scanning Tunneling Microscopy (STM), tuning fork techniques and confocal optical spectroscopy (Raman and fluorescence imaging) in one versatile instrument, for fast simultaneous co localized measurements and Tip Enhanced Raman Spectroscopy (TERS). Link: http://www.horiba.com/scientific/products/raman spectroscopy/raman afm and nano raman/ >…TERS (or nano Raman) brings you the best of both worlds: the chemical specificity of Raman spectroscopy with imaging at spatial resolution typically down to 10nm. >This technique can be demonstrated on various samples ranging from nanotubes to DNA. ….","date":"2015-12-16","mins":"12:06 pm","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-216493","author":"piero","post":"Here what I have read about TERS (= Tip Enhanced Raman Scattering): >the full synergistic effect of AFM and optical spectroscopies comes into play when the AFM tip is tasked with “becoming the light source.” … and then we have to find an adequate explanation about the fact that: “The full synergistic effect of optical spectroscopies and atomic force microscopy comes into play when we task the AFM tip with “becoming” the light source.”… — — >By using a suitable AFM tip as a scatter source and subsequently scanning the sample, an optical map together with topography and other typical atomic force microscopy information can be acquired. >If one chooses… … a suitable combination of tip and incident light, and places them in the correct geometry, a strong electromagnetic field is generated at the apex of the tip. >This field is mainly due to the incident light exciting a plasmon resonance in the tip. … Source: “Advances in Combined Atomic Force and Raman Microscopy” by Stefan Kaemmer, Ph.D., Bruker Nano Surfaces Division Link: o in https://www.bruker.com/fileadmin/user upload/8 PDF Docs/Surface Analysis/AFM/Application Notes/AN136 Rev A2 Advances Combined AFM Raman App Note.pdf I would be curious to observe whjat are the differences about TERS spectra of linen fibrils (respectively: not treated, treated only with Madder and then with Madder Heme lake)… But see also the less expensive case of SERS spectra….","date":"2015-12-14","mins":"12:39 pm","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-216661","author":"piero","post":"…the ancient treatment of linen sheet with madder (which has been suggested by Adrie van der Hoeven) couldn’t perhaps be seen as a kind of factor that anticipated modern techniques of surface treatment (textile nanotech)? — — — “Modern Applications of Nanotechnology in Textiles” >Nanotechnology (NT) deals with materials from 1 to 100 nm in length. … NT is defined as the understanding, manipulation, and control of matter at the above stated length, such that the physical, chemical, and biological properties of the materials (individual atoms, molecules, and bulk matter) can be engineered, synthesized, and altered to develop the next generation of improved materials, devices, structures, and systems. >NT at the molecular level can be used to develop desired textile characteristics, such as high tensile strength, unique surface structure, soft hand, durability, water repellency, fire retardancy, antimicrobial properties, and the like. >Indeed, advances in NT have created enormous opportunities and challenges f or the textile industry… Link: http://trj.sagepub.com/content/78/8/731.short So… How is it possible to remain blind to the prospects of textile research that can be connected to the studies on the Holy Shroud?.","date":"2015-12-16","mins":"12:30 pm","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-216305","author":"piero","post":"There are 96 high schools in the Russian Federation equipped with the NANOEDUCATOR training laboratories. All over the world there are around 200 such labs installed so far… So you can ask the help of NT MDT Instead of doing an easy irony of Putin (former agent of the KGB) I believe that you (along with others interested in this particular issue) may ask what can give Russia to improve the Shroud studies. For 16 years Putin was an officer in the KGB, rising to the rank of Lieutenant Colonel before he retired to enter politics … Now there is a secret service FSB … In any case it must be recalled that the company NT MDT is not present only in Russia but also in other parts of the world … I do not think the company NT MDT was involved in acts of espionage, but this is just my personal opinion (and without interesting proofs). See also the article: “FSB: Vladimir Putin’s immensely powerful modern day KGB” >…Many of the brighter or entrepreneurial KGB operatives left the agency in the chaos of the 1990s, using their contacts and know how to enter the business world as security consultants, fixers or businessmen in their own right… >Unlike the KGB, the FSB is not in charge of foreign spies. The responsibility for running agents like such as Anna Chapman and the nine other spies caught by US authorities, has passed to a separate agency, the SVR. But internally, the FSB has an extraordinarily wide remit. … Link: http://www.theguardian.com/world/2013/oct/06/fsb putins modern day kgb Up to now Russia’s war engagement in Syria seems to be very far from the questions inherent to application of nanotechnology in textile research. In my opinion, these operative fields (one with respect the other) are full of different kind of problems and then we have to avoid to mix the questions….","date":"2015-12-12","mins":"8:59 am","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-216211","author":"piero","post":"I don’t know if your idea is well centered. In theory one can try to ask for a direct cooperation between Russia, Europe and USA (…is that only an utopia?) about a scientific research on two “lignocellulosic relics” (one is in Italy and the other in Spain) or “ancient textiles” … … perhaps this attempt can be successfully pursued. But scientists are sometimes jealous of their own findings (obtained against competitors) and are not always well prepared to extensive collaboration … not to mention what happens if politics comes into play … — — — Atomic Force Microscopy for Nanotechnology, Scientific Research & Education… • Record breaking Raman enhancement factors • Nano Raman spatial resolution: down 10nm • High speed TERS* mapping • Mass produced, based on serial AFM cantilevers • Complete commercial solution for TERS Link: http://www.ntmdt.com/ Introduction to TERS (nano Raman) >Tip Enhanced Raman Scattering (TERS, nano Raman) is the technique for enhancement of weak Raman signals and for super resolution Raman imaging with spatial resolution ~10 nm. >Nano Raman imaging provides unique insights into sample structure and chemical composition on the nanometer scale. >In TERS, a sharp metal probe (nano antenna) is used to localize and enhance optical field at the tip apex. The light enhancement is typically reached when excitation laser light is in resonance with localized surface plasmon at the end of the TERS probe. >Enhancement of electromagnetic field (light) intensity on the TERS probe apex can reach many orders of magnitudes. In TERS mapping the sample is scanned with respect to the nano antenna; the enhanced Raman signal localized near the probe apex is measured resulting in Raman maps of the sample surface with nanometer scale resolution. TERS (nano Raman) imaging by NT MDT AFM Raman instrument. >NT MDT develops and supplies unique instrumentation for AFM integration with various optical microscopy and spectroscopy techniques. NT MDT was the first to introduce integrated AFM Raman instrument in 1998 and is now the leading developer and supplier of such instruments worldwide. >NT MDT AFM Raman instrument has been successfully used for TERS (nano Raman) mapping of various objects with spatial resolution reaching 10 nm: graphene and other carbon nanomaterials, polymers, thin molecular layers (including monolayers), semiconductor nanostructures, lipid membranes, various protein structures, DNA molecules etc. … Link: http://www.ntmdt.com/ters probes NT MDT in mass media… Link: http://www.ntmdt.com/page/smi o kompanii I think you can try to contact the Central office: NT MDT Co. Building 100, Zelenograd, Moscow 124482, Russia Link: http://www.ntmdt.com/page/nt mdt head office — — — In 2003 the first device for educational needs NANOEDUCATOR was produced. In 2004 the development of a new platform NTEGRA (probe nanoscale laboratories) was completed. On the basis of NTEGRA 12 models have been manufactured so far this model range constantly extending. In 2006 one of basic systems of the platform NTEGRA Spectra won the prize of the American magazine Research and Development as the best innovative development of the year among devices intended for scientific research. … … Since 1995 the general director of Joint Stock Company «NT – МДТ» has been Bykov Victor Alexandrovich, a Doctor of Technical Science, a winner of the award of the Russian government in the field of science and technology for the year of 2005. Link: http://zelao50.ru/eng/articles/index.php?SECTION ID=304&ELEMENT ID=2594#&slider1=365 NANOEDUCATO Rs are installed in Russian schools and universities by NT MDT Co. In terms of the governmental contract. NT MDT Co. Has already equipped about 70 university centers and more then 40 high schools in Russia. Installations of NANOEDUCATO Rs as well as the conference are essential parts of Government Federal Program aimed to develop highly qualified scientists in Russia. It was the personal idea of the Minister of education and science Andrey Fursenko (here my note : In 1971 graduated from the Leningrad State University named after A. A. Zhdanov. Doctor Degree in physics. From 1971 to 1991 he worked in Leningrad at the Ioffe Physico Technical Institute as a junior researcher, chief of the laboratory, deputy director for science, leading researcher, etc., etc. … ) who after visiting an international nanoexhibition had come to the decision to get Russian pupils and students acquainted with nanoworld in practice. Due to this program young investigators got an opportunity to feel and understand the nanoscale by their own hands and eyes. … http://www.ntmdt.com/news/view/the nt mdt co and the kurchatov institute held an international conference on nanoeducation in russia Rusnano corporation (formerly Russian Corporation of Nanotechnologies) is a joint stock company created by the government of Russia in 2007. Rusnano’s task is to create by 2015 a nano industry in the country that will make marketable products worth 900 billion rubles ($29 billion). >…Rusnano provides equity investments (up to 50% co investment) in later stage nanotechnology related projects with substantial economic potential. In addition to supporting domestic nano industry, Rusnano also seeks for nanotechnology transfer to Russia and invests capital in foreign companies. With this regard, Finnish Industry Investment Ltd and Rusnano came to an agreement in 2010 about an investment program in nanotechnology, allocating a total of 50 million euros for investments in Finnish and in Russian nanotech companies… http://www.tekes.fi/en/programmes and services/grow and go global/russia/ NT MDT President Victor Bykov Accepts The Nanotechnology International Prize RUSNANOPRIZE October 2014 http://www.ntmdt.com/press releases/view/nt mdt president victor bykov accepts rusnanoprize 2014.","date":"2015-12-11","mins":"11:31 am","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-216218","author":"piero","post":"I have found old news (date = 21.02.2011): >… NT MDT Co. Introduced its Scanning Probe Microscope SOLVER NEXT. >It was displayed together with the achromatic microscope invented by Franz Aepinus (member of the Russian Academy of Sciences and professor of physics) in 1784. >It was one of the first devices that provided a glimpse into the micro world. … Link: http://www.ntmdt.com/press releases/view/the president of russia visited nt mdt exhibit.","date":"2015-12-11","mins":"12:46 pm","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-216219","author":"piero","post":"Here other news: “Hybri D™ Mode Atomic Force Microscopy (AFM) from NT MDT – An Interview with Sergei Magonov” >A Zo Nano talks to Sergei Magonov about NT MDT’s new Hybri D™ AFM Mode, which combines the best aspects of contact and oscillatory modes, opening up new applications of AFM technology… Link: http://www.azonano.com/article.aspx?Article ID=3544.","date":"2015-12-11","mins":"12:49 pm","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-96783","author":"piero","post":"Where is the control on adhesion of thin layers on linen fibrils ? … See also the “ghosts” ….","date":"2014-04-05","mins":"9:39 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-206680","author":"piero","post":"Gerd Gigerenzer is Director at the Max Planck Institute for Human Development and Director of the Harding Center for Risk Literacy in Berlin… and, apparently, he leads a team who spend their days thinking about thinking… Research Interests: Bounded rationality and social intelligence Decisions under uncertainty and time restrictions Competence in risk and risk communication Decision making strategies of managers, judges, and physicians Link: https://www.mpib berlin.mpg.de/en/staff/gerd gigerenzer See also under the addresses: http://www.thebookbag.co.uk/reviews/index.php?title=Gut Feelings: The Intelligence of the Uncons http://www.thebookbag.co.uk/reviews/index.php?title=In Search of Memory: The Emergence of a New Science of Mind.","date":"2015-07-27","mins":"11:55 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-83107","author":"piero","post":"It will be interesting to see what is the feasible precision about the result from the SPM tests. So … working with Applied Statistics we have to be careful … and bye bye Apollonius … or not. See also : the epoch obtained by Eng. Giulio Fanti (after the elaborations) and the inherent long discussions. Perhaps we have to solve in another manner the conundum (avoiding to lose control on useful historical data ! …)..","date":"2014-02-27","mins":"1:26 pm","url":"https://shroudstory.com/2014/02/27/apollonius-of-tyana-proof-or-doom-for-christianity/","cat":"other_blogs","title":"Apollonius of Tyana:  Proof or Doom for Christianity?"},{"id":"comment-206769","author":"piero","post":">… A warning, common to many such crypts, is inscribed in Czech above their final resting place: “As you are now, we once were; as we are now, you shall be.” Link: http://www.atlasobscura.com/places/czechs capuchin crypt — — Where are the shrouds for these poor monks? — — Here the rules for “successful conversations”: >Grice explicates what he takes to be necessary elements of successful conversation, insisting that whatever the difference between formal and natural languages, both adhere to the same elements and thus do not significantly diverge in meaning. >For Grice, successful conversation necessitates adherence to an overarching “Cooperative Principle” (or, ‘CP’: communicate that which is required of the conversation such that the purpose of the conversation is achievable), plus – in certain instances at least – further maxims which fall under the following categories: Quantity (that which pertains to the amount of information communicated); Quality (that which pertains to the veracity of the information communicated); Relation (that which pertains to the relevance of the information communicated); and Manner (that which pertains to the way information is communicated). Central to Grice’s analysis are the notion of implicature and the assumption that communication. … … >… … Grice then gives a provisional list of the maxims associated with CP : Maxims associated with Quantity: ‘Communicate information that is as informative as required’; ‘Do not communicate more information than is necessary’. Maxims associated with Quality: ‘Do not communicate things you know to be false’; ‘Do not assert that which you have insufficient evidence for’. The maxim associated with Relation: ‘Be relevant’. Maxims associated with Manner: ‘Avoid obscurity’; ‘Avoid ambiguity’; ‘Be brief’; ‘Be orderly’.is an essentially rational. Links: https://npapadakis.wordpress.com/2012/11/15/article summary logic and conversation by pt geach/ https://en.wikipedia.org/wiki/Implicature#Conversational implicature >Implicature is a technical term in the pragmatics subfield of linguistics, coined by H. P. Grice, which refers to what is suggested in an utterance, even though neither expressed nor strictly implied (that is, entailed) by the utterance. … See also: Blackburn, Simon (1996). “implicature,” The Oxford Dictionary of Philosophy, Oxford, pp. 188 89. Endeavor..","date":"2015-07-28","mins":"9:31 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206960","author":"piero","post":"There is a new technique … >…called Synchrotron Infrared Nano Spectroscopy or SINS, will enable in depth study of complex molecular systems, including liquid batteries, living cells, novel electronic materials and stardust. >“The big thing is that we’re getting full broadband infrared spectroscopy at 100 to 1000 times smaller scale,” says Hans Bechtel, principal scientific engineering associate at Berkeley Lab. “This is not an incremental achievement. It’s really revolutionary.” >In a Proceedings of the National Academy of Sciences paper published May 6 online, titled “Ultra broadband infrared nano spectroscopic imaging,” Berkeley Lab’s Bechtel and Michael Martin, a Berkeley Lab staff scientist, and colleagues from Markus Raschke’s group at the University of Colorado at Boulder describe SINS. They demonstrate the nanoscope’s ability to capture broadband spectroscopic data over a variety of samples, including a semiconductor insulator system, a mollusk shell, proteins, and a peptoid nanosheet. Martin says these demonstrations just “scratch the surface” of the potential of the new technique. Link: http://infrared.als.lbl.gov/content/ — — — SINS combines two pre existing infrared technologies: a newer technique called infrared scattering scanning near field optical microscopy (IR s SNOM) and an older tried and true technique called Fourier transform infrared spectroscopy (FTIR). A melding of these two tools, combined with the intense infrared light of the ALS, gives the researchers the ability to identify and study clusters of molecules sized as small as 20 to 40 nanometers. Link: http://www als.lbl.gov/index.php/holding/928 new als technique gives nanoscale views of complex systems .html — — — Then the question (you have to answer…) can be the following: Is it possible to use the SINS technique on linen fibrils (coming from the Holy Shroud) or on “micro fragment of (a relatively large piece of) the True Cross housed at Sainte Chapelle in Paris” ? … and … Is it truly possible to avoid damages?.","date":"2015-07-30","mins":"9:29 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-83111","author":"piero","post":"I remember that I have read something on that argument … But, now, I have another idea … Read under : http://en.wikipedia.org/wiki/Mind uploading Then the demon was able to transfer (in part) the mind of Jesus into Apollonius … Who was a sort of “monkey of God”… A very strange idea….","date":"2014-02-27","mins":"1:48 pm","url":"https://shroudstory.com/2014/02/27/apollonius-of-tyana-proof-or-doom-for-christianity/","cat":"other_blogs","title":"Apollonius of Tyana:  Proof or Doom for Christianity?"},{"id":"comment-181042","author":"piero","post":"I think that during the debate has been forgotten a professor Lawrence Krauss … Krauss is one of the few living physicists described by Scientific American as a “public intellectual”… In a story cosmological nailing attention and “at the same time enlightens us”, the pioneer of theoretical physics Lawrence Krauss explains the latest innovative scientific advances that overturn the most fundamental philosophical questions. We can read that: >Krauss is an atheist activist and self described antitheist. >Krauss has participated in many debates with theologians and apologists, including Hamza Tzortzis and William Lane Craig… >Krauss also featured in a full length documentary entitled The Unbelievers, in which he and Richard Dawkins travel across the globe speaking publicly about the importance of science and reason as opposed to religion and superstition >In his book, A Universe from Nothing: Why There is Something Rather than Nothing (2012), Krauss discusses the premise that something cannot come from nothing, which has often been used as an argument for the existence of an uncaused cause, or creator. >He has since argued in a debate with John Ellis and Don Cupitt that the laws of physics allow for the universe to be created from nothing. “What would be the characteristics of a universe that was created from nothing, just with the laws of physics and without any supernatural shenanigans? The characteristics of the universe would be precisely those of the ones we live in.” >In an interview with The Atlantic, however, he states that he has never claimed that “questions about origins are over.” >According to Krauss, “I don’t ever claim to resolve that infinite regress of why why why why why; as far as I’m concerned it’s turtles all the way down.” Source: http://en.wikipedia.org/wiki/Lawrence M. Krauss — — — >The book ends with an afterword by Richard Dawkins in which he compares the potential impact of the book to that of The Origin of Species — a comparison that Krauss himself called “pretentious.” … … … … >In “New Scientist”, Michael Brooks wrote: “Krauss will be preaching only to the converted. That said, we should be happy to be preached to so intelligently. The same can’t be said about the Dawkins afterword, which is both superfluous and silly.”… Link: http://en.wikipedia.org/wiki/A Universe from Nothing — — — “Why is there something rather than nothing?” must be understood in the context of a cosmos where the meaning of these words is not what it once was, and the very distinction between something and nothing has begun to disappear, where transitions between the two in different contexts are not only common, but required. Without science, everything is a miracle. With science, there remains the possibility that nothing is. Links: http://www.nobeliefs.com/Krauss.htm http://www.huffingtonpost.com/2012/07/18/lawrence krauss universe from nothing n 1681113.html — — A universe from nothing? Putting the Krauss Craig debate into perspective by Luke Barnes link: http://www.abc.net.au/religion/articles/2013/08/13/3824063.htm — — — I hope you’ll be able to fill this kind of “loophole” that I have identified with the example of the thought of “one of the few prominent contemporary scientists”: Krauss. I hope you’ll excuse me for the “boring form” with which I wrote my message. So I hope in your interesting answers..","date":"2015-01-03","mins":"10:32 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180759","author":"piero","post":"Here what I have found (surfing the Web) about the theoretical physicist (who revolutionized Physics with his theory of general relativity) and the Theosophy: >On the 20th Anniversary of Einstein’s death (1975), physicist Richard Feynman was quoted in Time magazine as saying, “I cannot understand how he arrived at the intuition leading to E mc^2, considering the level of scientific knowledge at the time.”(1905) >A niece of Einstein reported that a copy of “The Secret Doctrine” (*) was always on his desk. Another witness, Jack Brown, reports similarly in an article, “I visited Professor Einstein.” — — — (*) The Secret Doctrine – The Synthesis of Science Religion and Theosophy, H. P. Blavatsky, The Theosophy Company, London, Madras, 1888 — — Einstein met Steiner at Mrs Fanta’s salon and attended several of Steiner’s lectures held in the Café Louvre (**), an Art Nouveau café on Národní třída, and was apparently impressed by Steiner’s views on non Euclidean geometry … (**) Louvre was a preferred café for the Jewish intellectuals of the time, over other cafés such as Café Slavia… — — Here few words in Portoguese language (about Einstein): >A Encyclopaedia Britannica afirma que Einstein é comparável a Isaac Newton porque cada um deles revolucionou a Física do seu tempo. O que a Britannica não diz é que tanto Einstein como Newton foram pensadores místicos e estudantes de filosofia esotérica. … >Grande alma, pensador maduro, Einstein escrevia para gente de todas as religiões e filosofias. Falava sempre do essencial e evitava envolver se desnecessariamente com formas externas. Seu grande tema foi a atitude do homem diante de si mesmo e do cosmo. … >A influência de Blavatsky sobre Einstein foi investigada pela biógrafa Sylvia Cranston: >“Robert Millikan pode ter sido um dos primeiros cientistas a apresentar ‘A Doutrina Secreta’ para Einstein. De 1921 a 1945 ele foi o diretor do Laboratório Norman Bridges no Instituto de Tecnologia da Califórnia, em Pasadena; ele era também o presidente do comitê executivo do Cal Tech. Nos anos 30, Millikan ajudou a trazer Einstein para os Estados Unidos. Por três verões, Einstein trabalhou em Cal Tech, antes de aceitar um posto em Princeton. Millikan estava profundamente interessado em ‘A Doutrina Secreta’. … Link: http://www.filosofiaesoterica.com/ler.php?id=597 Here a rough translation (Google) : The Encyclopaedia Britannica states that Einstein is comparable to Isaac Newton because each revolutionized their time physics. What Britannica does not say is that both Einstein and Newton were mystical thinkers and esoteric philosophy students. … Great soul, mature thinker, Einstein wrote to people of all religions and philosophies. Always spoke of the essential and avoided getting involved unnecessarily with external forms. His great theme was the man’s attitude toward himself and the cosmos. … The influence of Blavatsky about Einstein was investigated by biographer Sylvia Cranston: “Robert Millikan may have been one of the first scientists to present ‘The Secret Doctrine’ for Einstein. From 1921 to 1945 he was the director of the Norman Bridges Laboratory at the California Institute of Technology in Pasadena; he was also the chairman of the executive committee of the Cal Tech. In the 30s, Millikan helped bring Einstein to the United States. For three summers Einstein worked at Cal Tech, before accepting a position at Princeton. Millikan was deeply interested in ‘The Secret Doctrine’. … — — — Sylvia Cranston demonstrated that Einstein was a long time student of “The Secret Doctrine”, the masterpiece written by Mrs. Blavatsky. See “HPB – The Extraordinary Life and Influence of Helena Blavatsky, Founder of the Mode rn Theosophical Movement”, by Sylvia Cranston, a Jeremy P. Tarcher/Putnam Book, published by G.P. Putnam’s Sons, New York, 1994, 648 pp. See preface, p. XX; pp. 434 435; and note 22 to Part 7 of the book, at pp. 605 606. — — ‘The Secret Doctrine’ was the crowning achievement for the literary works of HP Blavatsky. The first volume is primarily concerned with the evolution of the Universe. The backbone of this volume consists of seven rooms, translated from the Book of Dzyan, with commentary and explanation of HPB In this volume there is also an extensive elucidation of the fundamental symbols contained in the great religions and mythologies of the world. The second volume contains a further series of rooms from ‘The Book of Dzyan’ which describes the evolution of Humanity… — — *** *** — — Instead Saint Luke is believed by many scholars to be a Greek physician who lived in the Greek city of Antioch in Ancient Syria, though some other scholars and theologians think Luke was a Hellenic Jew… Links (about the Ancient Hellenistic World):As Jesus prayed on the mount of Olives, “his sweat became as it were great drops of blood falling down upon the ground” (Lk. 22:44). Did blood actually come from the Lord’s skin, or is the language merely a figure of speech emphasizing the Savior’s agony? The only New Testament writer to mention this phenomenon is Luke, a physician (Col. 4:14). Here I should write a few lines on the ancient medical knowledge and the visual examination of the Shroud … I believe that the Shroud has nothing to do with Madame Blavatsky, but … See also the possible (or impossible) connections: Shroud Antioch theory by Markwardt St Luke and the Shroud… The idea of Messiah can also be found in Buddhism, where the bodhisattva Maitreya plays a similar function as a Messiah… It is said that Maitreya’s coming will occur after the teachings of the current Buddha Gautama, the Dharma, are no longer taught and are completely forgotten… Now I apologize for the possible (great) confusion (!) occurred with the use of a series of mental associations (perhaps not always entirely consistent) … But yesterday I have spent some time rereading a book by prof. P.L. Baima Bollone: “L’ identità di Gesù. La vera storia di Gesù Bambino” (= The identity of Jesus. The true story of the Child Jesus.). This book breaks away from misconceptions (and in that book there are also reported interesting theosophical and anthroposophic tracks) and try to trace the identity of Jesus and the events of his birth on the basis of biological and natural that can be seen in the sources. Theosophy teaches the unity of man and the equality of all races, creeds, color and sex. Blavatsky believed in the world religions, and the coming of the Returned Buddha, the Maitreya, the Ajita Bodhisattva, “that would return to teach the pure Dharma, at a time of darkness on the earth, when the Dharma will have been forgotten.” ( Wikipedia) So… Blavatsky believed the Returned Buddha, the Maitreya, is linked to the Return of Jesus and the other ascendant masters. Blavatsky talked of a so called Christ Principle, which in her view corresponds to the spiritual essence of every human being. Maitreya is a bodhisattva who in the Buddhist tradition is to appear on Earth, achieve complete enlightenment, and teach the pure dharma. According to scriptures, Maitreya will be a successor of the historic Śākyamuni Buddha. The prophecy of the arrival of Maitreya references a time when the Dharma will seem to be forgotten on Jambudvipa. … In his eulogy to Isaac Newton written in 1927, the bicentenary of the great man’s death, Einstein called him a “shining spirit”. But I do not think there is a real parallel between Einstein (= science, theosophy, politics, etc.) And Newton (= science, alchemy!). However, I think I see a common denominator in their interest to religious researches. I just tried to paint a picture (only sketched) of the situation. Am I wrong in this vague comparison?.","date":"2015-01-02","mins":"10:35 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-131229","author":"piero","post":"Three stochastic events ? Is credible that strange perspective ? Is the process indicated by Robert Villareal a stochastic process ? Yes (or … Am I wrong ?). But this process seems to be very different with respect the stochastic event indicated by Yannick, Fazio and Mandaglio… Then we have (at least…) three different kinds of stochastic event … … … … At the end (IMO): only a careful analysis of linen samples (= material involved in BIF or not changed because not touched) can solve the enigma. Do you agree on that very simple conclusion ? So … Why you don’t focuse your minds on that “solving approach” instead of only writing interesting but debatable conjectures ? I am curious about the results from the microscopical controls on treated samples obtained using Alpha particles having a certain kinetic energy (then, see also: the use of SSNDT as calibration tools) that are fired toward a linen fibril… What is your opinion about this kind of work ?.","date":"2014-06-19","mins":"9:19 am","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-181436","author":"piero","post":"But … I have more words to say … …then what should I speak when someone questions the existence of God or speaks to us about the beliefs of some scientists? See also the famous case of Laplace … …And so what the famous scientist Hawkings thought of the matter: >In 1999 Hawking said: “I don’t think that Laplace was claiming that God does not exist. It’s just that he doesn’t intervene, to break the laws of Science.” Link: http://en.wikipedia.org/wiki/Pierre Simon Laplace Have you watched a film or television series lately that left you unsatisfied, confused, or vaguely disgruntled? I see that I do not have aroused interest with my previous message about Lawrence Krauss… In his book, A Universe from Nothing: Why There is Something Rather than Nothing (2012), Krauss discusses the premise that something cannot come from nothing, which has often been used as an argument for the existence of an uncaused cause, or creator. Here what I have found under the address: http://www.thedailybeast.com/articles/2014/11/09/why are millenials unfriending organized religion.html >… Krauss says that ending religion is a matter of obligation, but I think our obligations are much different. Instead of eliminating religion—a Sisyphean task if there ever was one—atheists can help to move religion in a more loving, tolerant, and open minded direction. We can’t make much traction tearing religion down, but maybe we can make the world a kinder and better place. So… Krauss announced us something irrational? Perhaps someday we will face the fact that the most palpable assumption in physics is also the deepest unknown: Time… … And then some good intention can exist also in the field of atheists! But we really have to depend on atheists, we are unable to examine our ideas Krauss? — — — Remaining in the field of mythology cosmogony here is what I have found, I have found something about “Abraxas”: A vast number of engraved stones are in existence, to which the name “Abrasax stones” has long been given. But it is uncertain what the actual role and function of Abraxas was in the Basilidian system … …and Basilides (Greek: Βασιλείδης) was an early Gnostic religious teacher in Alexandria, Egypt who taught from 117 to 138 AD, and claimed to have inherited his teachings from Matthew… Is Abraxas the Guardian of the Universe? >Abraxas (Gk. ΑΒΡΑΞΑΣ, variant form Abrasax, ΑΒΡΑΣΑΞ) was a word of mystic meaning in the system of the Gnostic Basilides, being there applied to the “Great Archon” (Gk., megas archōn), the princeps of the 365 spheres (Gk., ouranoi).[1] The seven letters spelling its name may represent each of the seven classic planets—Sun, Moon, Mercury, Venus, Mars, Jupiter, and Saturn … >The Swiss psychiatrist Carl Jung wrote a short Gnostic treatise in 1916 called The Seven Sermons to the Dead, which called Abraxas a god higher than the Christian God and devil that combines all opposites into one being. (= “There is a God about whom you know nothing, because men have forgotten him. We call him by his name: Abraxas. He is less definite than God or Devil…”) >The magic word “Ablanathanalba,” which reads in Greek the same backward as forward, also occurs in the Abrasax stones as well as in the magic papyri. This word is usually conceded to be derived from the Hebrew (Aramaic), meaning “Thou art our father” (אב לן את), and also occurs in connection with Abrasax… Link: http://en.wikipedia.org/wiki/Abraxas — — — In short, what I mean is that believers in God can not stay too anchored to a given cosmology … that maybe it can also be false. In this Scientific American interview with physicist George F.R. Ellis, he discusses Lawrence Krauss’ belief that physics has explained “why there is something rather than nothing.” Krauss’ metaphysical claim is, of course, much loved by New Atheists who believe that science has explained pretty much everything. Ellis, a giant in his field who co authored The Large Scale Structure of Space Time (1973) with Stephen Hawking, disagrees… [ then, read also: “Physicist George Ellis Knocks Physicists for Knocking Philosophy, Falsification, Free Will” by John Horgan Link: http://blogs.scientificamerican.com/cross check/2014/07/22/physicist george ellis knocks physicists for knocking philosophy free will/ ] >… So at any moment we have a vision of reality that is effective, it’s good, it’s the best we have found so far. It’s the most credible we have found so far; it’s mostly correct. But, at the same time, it’s not taken as certain, and any element of it is a priori open for revision. Link: http://genealogyreligion.net/tag/carlo rovelli At this point, I ask again: what do you think?.","date":"2015-01-05","mins":"5:58 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-131325","author":"piero","post":"So… You don’t believe that alpha particles (and Radon into the tomb) are the “third stochastic event”… Perhaps (…or probably) you are right… But : Where are your scientific proofs (obtained from the analyses) ? I prefer to see what are the results (on linen samples) from the comparisons… Am I wrong in my behaviour ?.","date":"2014-06-19","mins":"12:50 pm","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-177519","author":"piero","post":"Lisa Oppenheim was born in New York City and she is >the winner of … >third biennial Shpilman International Prize for Excellence in Photography as American photographer and experimental filmmaker >… Chosen from a pool of 160 applicants spanning 28 countries, Oppenheim will receive $45,000 to continue her prospective project, “Imprint (Shroud of Turin).” Prize jurors included Quentin Bajac, Mo MA’s chief photography curator; Monika Faber, founder and director of the Vienna’s Photoinstitut Bonartes; and Galit Eilat, co curator of the 2014 São Paulo Biennial, among others. Link: http://blogs.artinfo.com/artintheair/2014/12/17/lisa oppenheim wins israel museum photography prize/ – Quentin Bajac is the Chief Curator of Photography at the Museum of Modern Art in New York – Monika Faber is the Founder and Director of the Photoinstitut Bonartes in Vienna. – Ruth E. Iskin is an art historian… – Galit Eilat is an independent curator, a writer and the founding director of The Israeli Center for Digital Art in Holon (2001 – 2010). – Noam Gal is the Horace and Grace Goldsmith Curator and the Head of the Noel and Harriette Levine Photography Department at the Israel Museum in Jerusalem. — — — It would be interesting to know exactly what the project on which she wants to work. An interesting image obtained on lilion (Polyamide 6, link = http://en.wikipedia.org/wiki/Nylon 6 ) should not be too difficult to achieve, but to work on linen is another matter, more complicated if I’m not mistaken ….","date":"2014-12-18","mins":"8:10 am","url":"https://shroudstory.com/2014/12/18/collimated-sweat-acting-at-a-distance/","cat":"other_blogs","title":"Collimated Sweat Acting at a Distance"},{"id":"comment-177522","author":"piero","post":"Errata corrige: I wrote: >It would be interesting to know exactly what the project Instead of: >It would be interesting to know exactly what is the project — — ie: what exactly is the project on which Oppenheim is working or she want to work … and, unfortunately, I have not yet found any information on the Web about this project..","date":"2014-12-18","mins":"8:17 am","url":"https://shroudstory.com/2014/12/18/collimated-sweat-acting-at-a-distance/","cat":"other_blogs","title":"Collimated Sweat Acting at a Distance"},{"id":"comment-177527","author":"piero","post":"Perhaps a project “optimal” (and difficult to implement) would be to create the impression of hot smoking on linen (image first obtained with a geometric figure [realized thanks to a particular spatial confinement] and then with the human form…). So the smoke of incense on linen cloth is a strange substance… But it is not said that the idea of incense smoke is really what gave rise to the famous footprint on linen. In short, Art is something rather more complex than scientific research, however, the two fields can intersect each other. Even the images of thermal footprints on linen (eg: handprints photographed or filmed in the IR field) can be interesting. In a nutshell: here can seem to us to fall in a really fun space… So here we arrive at the border between poetry and photography. But … Do you can realize the “scientific poetry” by the sweat of a dead man? I have several doubts about these vague ideas. Perhaps we will come to think of being able to work with a “Modern Ark of the Covenant” (ie: with appropriate capacitors …). Links: http://en.wikipedia.org/wiki/Atmospheric electricity >Experiments have shown that the intensity of this electric field is greater in the middle of the day than at morning or night and is also greater in winter than in summer. In ‘fine weather’, the potential, aka ‘voltage’, increases with altitude at about 30 volts per foot (100 V/m), when climbing against the gradient of the electric field. Http://en.wikipedia.org/wiki/Global atmospheric electrical circuit http://en.wikipedia.org/wiki/Electric field http://en.wikipedia.org/wiki/Atmosphere ground layer — — — Maybe we should analyze well (with the SPM techniques) the old experiments on linen obtained in the past by Judica Cordiglia … What do you say?.","date":"2014-12-18","mins":"8:57 am","url":"https://shroudstory.com/2014/12/18/collimated-sweat-acting-at-a-distance/","cat":"other_blogs","title":"Collimated Sweat Acting at a Distance"},{"id":"comment-177530","author":"piero","post":"I have found the news about “The Feynman Lectures on Physics”. The Feynman Lectures on Physics is perhaps the most popular physics book ever written. Links: http://en.wikipedia.org/wiki/The Feynman Lectures on Physics http://feynmanlectures.caltech.edu/ Spicer indicated us the question of polar molecules that typically have dipole moments that are 3 4 orders of magnitude larger than non polar molecules (See: Richard Feymann, Robert B. Leighton, and Matthew Sands. The Feynman Lectures on Physics Volume II. Addison Wesley, Reading, Massachusetts, 1965) and the magnitude between 100 and 300 volts per meter in the vertical, downward direction… http://feynmanlectures.caltech.edu/II toc.html — — — The words by Feynman (= “What is Science?”) Here are the last words of his speech: “… … It is necessary to teach both to accept and to reject the past with a kind of balance that takes considerable skill. Science alone of all the subjects contains within itself the lesson of the danger of belief in the infallibility of the greatest teachers of the preceding generation. So carry on. Thank you.” http://www.fotuva.org/feynman/what is science.html Obviously it is not necessary that we take everything at face value, even that which comes from a Nobel..","date":"2014-12-18","mins":"9:18 am","url":"https://shroudstory.com/2014/12/18/collimated-sweat-acting-at-a-distance/","cat":"other_blogs","title":"Collimated Sweat Acting at a Distance"},{"id":"comment-139155","author":"piero","post":"Sorry, surfing the Web, under the address: http://www.sciencedirect.com/science/article/pii/S0926669012006206 I have just found an interesting study: by Alain Bourmauda, Claudine Morvanb, Anis Boualic, Vincent Placetd, Patrick Perrée, Christophe Baleya “Relationships between micro fibrillar angle, mechanical properties and biochemical composition of flax fibers” Here an excerpt from the Abstract: >An elementary plant fiber could be assimilated to a laminate, mainly constituted of the secondary wall S2 layer, made of a few non crystalline polysaccharides reinforced by cellulose fibrils organized in a helix, with a microfibrillar angle (MFA) around 10° relative to the longitudinal fiber axis. That paper investigated the relationships between the MFA, the mechanical properties and the biochemical composition of different varieties of flax… ! Here another detail: >Within the different varieties of flax, Young’s modulus was found to be negatively correlated with the MFA. >The results showed that the ratio between hemicelluloses (matter extracted with alkali) and pectins (hydrolyzed with acids) is highly correlated with the tensile properties; concurrently, we showed the great influence of pectic acids on the fiber’ Young’s modulus, and on the orientation of the microfibrils. … >Lower is the micro fibrillar angle, higher is the Young’s modulus. At the end the question to solve is the following : What happens with ancient linens? * * * * * * * * * * * Unfortunately this argument is completely different with respect your interesting notes on misalignment of shoulders and “absence of neck” ! So… I beg your pardon… … and I want add : It is not in my will to taunt (to disturb) the researches. — — How to tighten up the strings of a violin ? — — Perhaps we have to work with a “volumetric version” of “Shroud Scope” … Are you able to build that new useful tool ?.","date":"2014-07-18","mins":"12:34 pm","url":"https://shroudstory.com/2014/07/18/comment-promoted-a-misalignment-between-the-left-and-right-shoulders/","cat":"comments_promoted","title":"Comment Promoted:  A Misalignment Between the Left and Right Shoulders"},{"id":"comment-208061","author":"piero","post":"We can think that: “The Son of God made himself more human [to help us] in that Divine Image (= icon)” … But… Is that mysterious Image a sort of idolatry? See also: the Knights Templar. The shroud is a legendary object that is claimed to have some connection with the Templars. There are various legends concerning a treasure that some Templars managed to hide from King Philip and that was later lost… This can be another interesting point to discuss. — — We all know that the Shroud of Turin is the legendary funeral cloth of Jesus for centuries surrounded by mystery and reverence… However it remains to understand if some disciples really were able to set up the proper environment, that is: to obtain the imprint on linen (perhaps following a previous [and exact] order of their Divine Master)! So… You could start from the study of Roman death masks, but it seems unlikely that disciples of Jesus were familiar with these roman death masks…. — — In the past few (Dr. Whanger, etc.) have shown the connection between the alleged presence of the Shroud and the changes of Buddhist theology in the second century. … A Christian influence on Buddhism in the second century ??? Here I do not pronounce on that argument because the issue would seem to be quite intricate. Dura Europos was a multicultural city… >The earliest dated images of Christ are preserved in the painted baptistery of Dura Europos on the Euphrates River, excavated by the French and Yale University and now housed at Yale, said Gene Kleinbauer, Indiana University professor of art history emeritus. The representations were done between 240 and 256 A.D. >”These paintings are poorly preserved but show Jesus as both beardless and bearded,” Kleinbauer said. … Link: http://freerepublic.com/focus/f religion/2227973/posts Here too, the speech becomes long… — — — Other links: https://en.wikipedia.org/wiki/Standing Buddha https://en.wikipedia.org/wiki/Buddhism and Christianity B.T.W.: Where are the proofs about the strange connection “Holy Shroud of Jesus and Gandhara Buddha, etc.”?.","date":"2015-08-12","mins":"9:54 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208068","author":"piero","post":"My previous intervention is a bit long. Sorry. What I wanted to underline is the (possible) fact that Holy Shroud of Turin can also be an “embarrassing relic” because in the past the (presumed. See also: the image depicted on wood of Templecombe) cult of Knights Templar to the Holy Shroud was a bit wrong… In short: I believe that Knights Templar were not a great example in fact of ecumenism (despite certain modern speculations: romances, etc.) and this past History (perhaps) can be connected in a wrong manner with the Holy Shroud. The facts of the past, however, do not justify the present violence of religious extremists (be they Muslims or Jews, etc.)!.","date":"2015-08-12","mins":"11:03 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208131","author":"piero","post":"What is the meaning of relics without the study of the inherent miracles? Here what I have read: >One of the many beautiful gifts of Medjugorje, standing a few yards behind St. James Church, is a statue of the crucified Christ, which has been exuding a special oil from its right knee, continuously for many years now. >Healings have been attributed to this oil… Link: http://www.ministryvalues.com/index.php?option=com content&task=view&id=1475&Itemid=99999999 — — But I think that the important need of serious scientific controls is still dimly perceived… B.T.W.: Have you studied the following argument: “Cult and Theft of Relics in the Middle Ages” ?.","date":"2015-08-13","mins":"3:58 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-196921","author":"piero","post":"Colin, First of all: thanks for all the photos of your attempts … Although I do not believe the utility of fumigation with nitric acid, I have a question: Colin, please, can you let us see what we can observe about your linen fibrils under the control of the microscope? — — Sometimes your trials remind me (a bit) a picture obtained by Delfino Pesce that I saw two days ago (Saturday night) in Biella, during a conference by Prof. Emanuela Marinelli (= a meeting on the occasion of the presentation of his new book written with Fasol: “Luce dal Sepolcro. Indagine sull’autenticità della Sindone e dei Vangeli” = “Light from the Sepulchre. Survey on the authenticity of the Shroud and the Gospels”) … Do you know the anthropologist Vittorio Pesce Delfino? He worked with a bas relief in bronze, followed by heating to 230 degrees Celsius and he has produced a very accurate face as on the Turin cloth… But we already know that linen fibrils from the Shroud are not similar those obtained in this manner. What is your reply? — — In any case, in my opinion, we have to know if your treated linen fibrils (compared to the other coming from the other experiments) pass or fail the “gopic hand test”… In my idea heat treated linen fibrils react in a different manner with respect the other textile samples. So… What is your answer about this kind of Lab test? Am I annoying with my idea to test linen fibrils? — — — Today I have read something about the “Institute of Chemistry and The Center for Nanoscience and Nanotechnology” (The Hebrew University of Jerusalem). They are also able to use molecule force spectroscopy measurements. And then I believe that they can do some experiment on ancient linen materials… — — Yesterday I have read what was printed at page 5 of “Luoghi dell’Infinito” (= “Places of Infinity”), the supplement of “Avvenire” (the newspaper of the Italian Episcopal Conference). In the article titled: “Il senso di un pellegrinaggio nuovo” (= “The sense of a new pilgrimage”), the archbishop Nosiglia said: “… La Sindone non è “reliquia”, per molti versi rimane una realtà inesplicabile con gli strumenti della scienza e della storia.” (= “… The Shroud is not “relic”, for many ways remains a reality inexplicable using the tools of science and history. “). In short: Nosiglia speaks of “symbol” or “image” ….","date":"2015-04-20","mins":"9:21 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-201326","author":"piero","post":"Tristan wrote: >… …one possibility offered by your semi natural hypothesis (“manual extraction”) doesn’t take into account an uncontroversial fact: the empty tomb. Instead Yannick wrote: >Effectively, the door would still be left open for the idea of a manual extraction of the body out of the Shroud by some people before the start of active decay. One thing that has always been underlined by many is that there was no rupture of blood clots on the cloth … See, for example, what wrote Habermas: >The cloth contacted the body and the blood was transmitted directly to it, becoming somewhat attached. Separation in such conditions would involve dislodging a number of dried blood clots and disrupting the dried borders of the stains. However, the blood clots on the shroud are not only intact, being visible in almost every wound, but the borders of the wounds are also uninterrupted. … … >… Yet the body was not removed or unwrapped because, among other reasons, the blood clots and borders of the stains are intact. And as a grand climax, there is a probable burst of radiation from the dead body. … etc. … (Originally published in the Journal of the Evangelical Theological Society 24:1 (1981): 47 54. ) Link: http://www.garyhabermas.com/articles/J Evangelical Theological Soc/Habermas JETS Shroud of Turin and significance.htm So… Do you also agree on this alleged fact (= no rupture of blood clots on the cloth …)? I think it is difficult to accurately demonstrate this alleged fact, after centuries of bendings, rollings and unrollings for the cloth. However, a survey with the use of microscopy can highlight what is the effective state of the material. Is it perhaps already enough what was seen under the microscope in the past? I have read that surface topography of blood clots can be evaluated by interferometric profilometry. Do you know this specific analytical way ? — — — In “in vivo” : Platelets interact with fibrin polymers to form blood clots at sites of vascular injury… (= at sites of vascular injury, platelets and fibrin polymers interact to form blood clots that prevent haemorrhage…). But we know that: >Bleeding is caused by the generation of fibrinogen degradation products which interfere with regular fibrin polymerization and inhibit platelet aggregation. Then… What is the post mortem behaviour? I remember to have heard (and read) the term “post mortem fibrinolysis”… — — — — — — Here is a possible reference to the old dried blood : >…During the Mass, when he said the Words of Consecration (“This is my body. This is my blood”), with doubt in his soul, the priest is said to have seen the bread change into living flesh and the wine change into blood which coagulated into five globules, irregular and differing in shape and size (the number supposed to be correspondent to the number of wounds Christ suffered on the cross: one in each hand and foot from the nails, and the wound from the centurion’s spear). … Link: http://en.wikipedia.org/wiki/Miracle of Lanciano.","date":"2015-06-08","mins":"8:57 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201469","author":"piero","post":"I believe that a very sensible thing would be to set up a statistical work about cadaveric emissions (such work, however, must also take into account the environmental conditions = temperature, humidity, etc.) and thus : we have to use the data obtained from controls with an electronic nose. Where we have the data? Do you know Arpad Vass? Link: http://en.wikipedia.org/wiki/Arpad Vass [Dr. Ray Rogers indicated that name in the book: “A Chemist’s Perspective On The Shroud of Turin”…] At present I do not see anything useful around the world. Have you found something of new? I seem to notice a lull in this kind of research. Am I mistaken?.","date":"2015-06-10","mins":"8:59 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201467","author":"piero","post":"I have several doubts about the presumed ethical use “of a freshly amputated limb” (!) coming from the human being (!)… I believe that now we could try to use the “artificial skin”, this seems to me a more ethical choice. Artificial skin can be made in large quantities and frozen for storage and shipping, making it available as needed… What do you think?.","date":"2015-06-10","mins":"8:45 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201618","author":"piero","post":"In a way I’m glad that my intervention (with the figure of a fish reproduced in a Gyotaku) has raised discussions. Obviously the Gyotaku is not my theory. In fact it was a french Eng. (Marcel Alonso) that has indicated this way (as one possible example), the Gyotaku. In fact I only believe what I see, in short, what I can observe carefully… An easy experiment on the phenomenon of diffusion is to use rotten eggs on silver plate and then observe the gradient for the gas action … See: “Silver to Black – and Back” J. Chem. Educ., 2000, 77 (3), p 328 A Publication Date (Web): March 1, 2000 >… In air, a silver object can tarnish owing to the reaction of silver with hydrogen sulfide (H2 S). This is a gas found in the air as a result of some industrial processes and the decomposition of dead plants and animals. … Link: http://pubs.acs.org/doi/abs/10.1021/ed077p328 A?journal Code=jceda8 — — Where are the results obtained from the careful controls (for example: based on SP Ms techniques) for linen fibrils involved in BIF? Until now we have nothing (= no controls on experiments) to discuss. — — I believe we have to improve our own knowledges about Arpad Vass and his researches… Links: http://en.wikipedia.org/wiki/Arpad Vass http://en.wikipedia.org/wiki/Forensic entomological decomposition http://en.wikipedia.org/wiki/Environmental effects on forensic entomology#Factors >Dr. Arpad Vass, Ph.D. Research Scientist. >Research interests: Developing technology to determine the post mortem interval, locate clandestine graves and evaluate chemical markers associated with human decomposition… Links: http://fac.utk.edu/ http://fac.utk.edu/donation.html http://fac.utk.edu/faculty.html >ORNL’s Arpad Vass found that a dead body lying on the surface or in a shallow grave emits more than 400 different chemical vapors, some of which attract cadaver dogs. Link: http://web.ornl.gov/info/ornlreview/v37 1 04/article 18.shtml — — — Is like a Gyotaku the footprint of the poor Les? Maybe … I’d like to read what is your exact idea, what is your definition (for example: “Pa 6 Gyotaku”?) for that curious impression (on polyamide) on matteress cover of Liverpool. I think that, starting from the accurate study of this footprint, you can achieve (= … using “Reverse Engineering Technique”?) artworks on polyamide. This may be an interesting fact for the Art market. … But I don’t like the idea to even arrive to joke with the fires of hell… I have no idea if the fumigation proposed by Max Patrick Hamon may be feasible as a credible solution for the Enigma. For example: Where are the inherent experiments? Here is the other side of the problem: where is the evidence (on linen material) for X rays? — — — In my opinion a key factor to succeed in solving the Enigma (which is a “two faces Enigma” = 1. True epoch and 2. True origin for the Imprint of the Body) is the use of advanced microscopies on linen fibrils involved in B.I.F. (… first of all: during preliminar experiments and after: on samples coming from the Holy Shroud). I wish to Yannick good luck … and I wish him to be able to do something of interest with the help by Fazio..","date":"2015-06-11","mins":"7:59 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201479","author":"piero","post":"Marcel Alonso (a french Engineer) wrote “Le Linceul de Turin est il surnaturel ?” (Conférence de Marcel Alonso) = Is the Shroud of Turin supernatural? (Marcel Alonso Conference, march 2008): >Nous avons obtenu ainsi des “photographies” d’œufs, projetées (quasiment avec des lois d’optique), à plusieurs dizaines de mm. Ces “photographies” ont les mêmes propriétés que celles de Volckringer. Rough translation = We got so “photographs” of eggs, projected (almost with optical laws), tens of mm. These “pictures” have the same properties as those of Volckringer. >Les Japonais pratiquent un art national depuis le moyen âge: il font des GYOTAKU (empreintes de poissons). Elles sont toutes “tridimensionnelles”. Cette apparence de tridimensionnalité est une caractéristique commune à toutes les empreintes que nous avons analysées Here another rough translation: >The Japanese practice a national art since the Middle Ages: it make Gyotaku (fish prints). They are all “three dimensional”. This appearance of three dimensionality is a common feature of all the fingerprints that we analyzed Link: http://archeothonia.com/conferencemntv2008.htm — — — Gyotaku. Links: http://en.wikipedia.org/wiki/Gyotaku — — — It’s already been several years since 2008 … but I do not see major innovations in this area. So… I ask: Is it too difficult to do a gyotaku print with the human blood presence? I believe that our old friend Colin Berry, so imaginative in its experimental attempts, should be able to do something with a Gyotaku… >Gyotaku (gyo = fish, taku = rubbing) was invented in the early 1800s in Japan by fishermen who wanted to record their catch. Japanese fishermen took newsprint, ink and brush out to sea with them. Prints were brought back and displayed in the homes of the fishermen either on walls or in journals to be used as conversation pieces and to relate proud and heroic stories of the catch. Link: https://artsedge.kennedy center.org/educators/lessons/grade 5/Gyotaku Japanese Fish Printing#Preparation — — However I would be curious to see what is the real effect achievable with the use of a special facial shape, starting from the use of ‘eggs by Marcel Alonso “….","date":"2015-06-10","mins":"9:39 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201395","author":"piero","post":"We know that Dr. Romanese was able to obtain images from the faces of the dead persons with sprinkling based on a mixture of aloe and myrrh. Later also Dr. Sebastiano Rodante used that technique adding sweat blood (probably = 10% sweat and 1% of blood) with aqueous solution of aloe and myrrh. Then it is certainly not true that you can not get images pulling away a linen cloth from the body of a deceased person … and >In 1980 also father Gaetano Intrigillo obtained experimental impressions by using cloths soaked in a watery aloe and myrrh solution, put on a clay face with human hair, beard and moustache, squirted with sweat and blood, blood trickled and surrounded by a chinrest … … [And, in any case, Dr. Pierre Barbet, Chief Surgeon at St. Joseph Hospital in Paris was a research that wrote before Habermas… Meanwhile, the technology progressed! So, I believe Nabber has to be more careful. Perhaps also because in an experiment by De Liso there was “the blood trace of a reptile, that left a 3 D image” (Link: http://www.acheiropoietos.info/proceedings/De Liso Web.pdf = at p. 4 of 8. But I do not think it has been performed the advanced control [using AFM or SEM tecniques] for this experiment.)…] Where are the researches about “the integrity of the blood clots” that seem to exclude the deliberate removal of the body? I see nothing of exact about that problem, then I think that this question seem to be rejected/discarded by researchers… Then I do not think is that difficult to do the appropriate experiments using blood and linen suitable for this purpose (and then check them with advanced microscopies!). However, saying this, I do not advocate that, therefore, is thus possible to reproduce all the features of the Holy Shroud!….","date":"2015-06-09","mins":"8:16 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-10246","author":"piero","post":"I think that “Anonymous” (indirectly) rerferred to Lucotte and Thomasset (“An Osseous Remain on the Face of the Turin Shroud” [June 2017], an interesting new research [although they did use optical microscopy and SEM EDX analyses …and not the non destructive SP Ms techniques …] on little particles and a discovery of the bone fragment coming from the broken nose…) when he indicated us the forensic examination of the nose area … However, the problem of Image Formation remains open … I any case (in my opinion) the concept “contact and progressive loss of contact imprint” seems to be very interesting. But we have to know [from “Anonymous”] what are the exact inherent details/implications ….","date":"2017-11-21","mins":"4:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/11/16/hello-all-you-media-reporters-whether-mainstream-msm-minor-tributary-mtm-or-obscure-backwater-media-obwm-isnt-it-time-you-released-some-air-from-the-tyres-of-that-truth-bending-shroud-of-t/","cat":"agenda-driven_narratives","title":"Hello all you media reporters, whether mainstream (MSM), minor tributary (MTM)  or obscure backwater media (OBWM). Isn’t it time you released some air from the tyres of that truth-bending Shroud of Turin juggernaut?"},{"id":"comment-10247","author":"piero","post":"Errata corrige : “referred” and “In any case” instead of rerferred and “I any case” !… Sorry..","date":"2017-11-21","mins":"4:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/11/16/hello-all-you-media-reporters-whether-mainstream-msm-minor-tributary-mtm-or-obscure-backwater-media-obwm-isnt-it-time-you-released-some-air-from-the-tyres-of-that-truth-bending-shroud-of-t/","cat":"agenda-driven_narratives","title":"Hello all you media reporters, whether mainstream (MSM), minor tributary (MTM)  or obscure backwater media (OBWM). Isn’t it time you released some air from the tyres of that truth-bending Shroud of Turin juggernaut?"},{"id":"comment-204062","author":"piero","post":"Thousand years of silence??? Well… Here what I have read about the silence by St. Paul about the Holy Virgin: >…It is often stated that “Mary is never mentioned in the Bible by Paul” … >…it would be a mistake to base a doctrine or even a view of the relationship of Mary to Jesus based on silence in St. Paul’s epistles. … Is a similar case the mysterious problem of the Shroud? — — >Rabban Gamallel (first century) instituted the use of a plain linen shroud for everyone (Bavli Moed Katan 27b. Cf. Matthew 27:59). Link: https://www.shroud.com/faq.htm — — >… …The textile fragments belong to a shroud. The deceased was buried with the shroud because there was no secondary burial. The tomb was probably sealed because of leprosy and there was no bone collecting after a year. The shroud is made of wool. The Z spin of the wool suggests production outside of Israel as Z spun threads form only a small proportion of textiles in Israel and its neighbouring countries in the Roman period. The wool textile from the Ben Hinnom Valley could, therefore, have been imported from Greece or Italy in which Z spinning was the norm. … … Source, the study: “A burial textile from the first century CE in Jerusalem compared to roman textiles in the land of Israel and the Turin Shroud” by Orit Shamir Link: http://www.shs conferences.org/articles/shsconf/pdf/2015/02/shsconf atsi2014 00010.pdf.","date":"2015-06-29","mins":"10:39 am","url":"https://shroudstory.com/2015/06/29/is-the-shroud-really-the-most-studied-whatever-in-history/","cat":"comments_promoted","title":"Is the Shroud Really the Most Studied Whatever in History?"},{"id":"comment-96743","author":"piero","post":"I am curious about the reults … I believe we have to observe (in a careful manner) the thin layers on linen fibrils … Thin layers obtained with different kind of experiments (included your new attempt). — — Ten days ago I observed the slide n. 21 (of 24) : “2002 Restoration Head 300 DPI” versus “Schwortz Positive Head 72 DPI” in “24 Years of Photography : 1978 Barrie Schwortz & 2002 Restoration Comparison”, clearly we can see an interesting difference (a “different aspect of Holy Face”) … but there was not the comparative table (of measurements). (Link : http://www.shroudnm.com/docs/SEAM Turin Shroud Presentation5 Photography.pdf ) … and then … I think we have to investigate the past vacuuming operations (Riggi) and the restore operation (in 2002) because I suspect some detachment of thin layers of linen fibrils (besides the dusts !) … Ageing of thin layers and vacuuming pressure can turn in a bad manner the original Imprint (and that presumed phenomenon is here underlined only from a speaking from a scientific point of view, taking apart the new arrangement of the famous ancient cloth …). I believe that some ghosts were detached from the image. So … we have to observe the dusts in a careful manner. What is your opinion ? Then tiny variations in adhesion of thin layers on linen fibrils can be investigated at nanometric (or angstrom) level using the SPM way and/or the Raman controls … In my idea we have to work in order to know what is the result from the (AFM andor Raman) investigations on values (obtained using the adequate experiments…) for adhesion of thin layers on linen fibrils (See also : “ghosts”, physical parameters and their effects on adhesion). — — What was the pressure level in vacuuming operations (by Riggi) ? … and now … Is it possible to measure and reproduce the presumed effects (= ghosts) on treated linen fibrils (obtained in your experiments) ? In my opinion the answer is : Yes ….","date":"2014-04-05","mins":"6:15 am","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","title":"Let the Experiments Begin"},{"id":"comment-96779","author":"piero","post":"Results and not reults Sorry ….","date":"2014-04-05","mins":"9:28 am","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","title":"Let the Experiments Begin"},{"id":"comment-96781","author":"piero","post":"I believe that you cannot find the same idea about adhesion of thin layers (that I wrote in this blog) into the paper : Microscopic and Macroscopic Characteristics of the Shroud of Turin Image Superficiality Link : http://www.ingentaconnect.com/content/ist/jist/2010/00000054/00000004/art00001 I am near sure of that … !!!.","date":"2014-04-05","mins":"9:36 am","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","title":"Let the Experiments Begin"},{"id":"comment-191270","author":"piero","post":"Here you can find some notes … Some years earlier, in that restless land, took place a process against Guichard, bishop of Troyes… See also: The Debate on the Trial of the Templars (1307–1314) Jochen Burgtorf, Paul F. Crawf Ashgate Publishing, Ltd., june 28, 2013 – 426 pages >Seven hundred years after the dissolution of the order, the trial of the Templars still arouses enormous controversy and speculation. In October 1307, all the brothers of the military religious order of the Temple in France were arrested on the instructions of King Philip IV and charged with heresy and other crimes. In 1312, Pope Clement V, at the Council of Vienne, dissolved the order. … The trial of Bishop Guichard was a complex case whose development can be traced from the summer of 1308 … Following the pontifical mandate of August 1308, an investigation took place and Guichard was suspected of “enormous crimes and sacrileges”… Link: http://www.sites.univ rennes2.fr/cerhio/IMG/pdf/Dossier Alain Provost   conference 24 janvier.pdf See also: “Domus diaboli, un évêque en procès au temps de Philippe le Bel” by Alain Provost Published 2010 by Belin in Paris (written in French). And “The Templars and the Shroud of Christ” by Barbara Frale — — — >The charges of heresy included spitting, trampling, or urinating on the cross; while naked, being kissed obscenely by the receptor on the lips, navel, and base of the spine; heresy and worship of idols; institutionalized sodomy; and also accusations of contempt of the Holy Mass and denial of the sacraments. >Barbara Frale has suggested that these acts were intended to simulate the kind of humiliation and torture that a Crusader might be subjected to if captured by the Saracens. According to this line of reasoning, they were taught how to commit apostasy with the mind only and not with the heart. … Link: http://en.wikipedia.org/wiki/History of the Knights Templar — — — Here an interesting question: Le Linceul etait il à Montfort en Auxois (à cette époque)? See also: “La Seigneurie de Montfort en Auxois au fil de siècles” Michel et Renée Paquet Ed. Mos Forti, 2000 at p 3 of 12 Links: http://suaire turin.fr/wp content/uploads/2013/04/Cahier 39 3.pdf http://en.wikipedia.org/wiki/Ch%C3%A2teau de Montfort (Cote d%27 Or) http://www.shroud.com/pdfs/n77part8.pdf (by Hugh Duncan) http://suaire turin.fr/wp content/uploads/2013/01/Cahier 39.pdf (= … Le Linceul était il à Montfort en Auxois à cette époque ? Il y a cependant une ambigüité importante que nous ne pouvons pas résoudre formellement … …. … … Il est vrai que la seigneurie de Montfort appartenait à la famille de Charny… ) — — — … …Par mariages et successions, le château revient en dot à Jeanne de Vergy qui épouse en 1340 Geoffroy Ier de Charny. Leur petite fille Maguerite épouse en 1400 Jean de Bauffremont qui décède à la bataille d’Azincourt en 1415. C’est son neveu Pierre de Bauffremont qui hérite du château de Montfort. Link: http://fr.wikipedia.org/wiki/Montigny Montfort.","date":"2015-02-17","mins":"8:51 am","url":"https://shroudstory.com/2015/02/17/movement-of-the-shroud-after-1355/","cat":"other_blogs","title":"Movement of the Shroud after 1355"},{"id":"comment-148264","author":"piero","post":"I have read what OK wrote (short presentation about Manoppello, Shroud and Duerer) and I then I am still curious about “the lost technique of painting on transparent fabrics”… I am curious because I have read that : >it is not possible to paint on fabric made of marine byssus. [Here my note : I am not sure of that… In any case Prof. Donato Vittore has found that on the cloth there are no traces of color.] >marine byssus can only be “tinted”, for example through a purple dye, but one can not “paint” anything on it. The salt remaining between the threads sooner of later will cause any color to fall from the threads. Source : “discussion with Fr. Heinrich Pfeiffer on hypothesis put forth by the photographer Roberto Falcinelli”… (Link: http://www.voltosanto.it/Inglese/dettagliofnti.php?x1=19 ) and Pfeiffer also said: >we could say that we would be very proud if we possessed a heretofore unknown original of the great artist of Nuremberg. … — — Unfortunately we have not yet seen the results from the transmitted light spectroscopy (of Manoppello’s Veil) ! This is a negative point. Then, in my opinion, the first useful thing to do can be an attempt to obtain a transparent portrait on byssus (= an usesuf thing for the controls and experiments with transmitted light spectroscopy). That work seems to be important in order to show the comparisons about the spectroscopic controls. Do you agree on that idea ? I hope in your answers….","date":"2014-09-03","mins":"8:39 am","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-191272","author":"piero","post":"Continuation of the notes: >Le linceul arrive à Montfort par la famille de Vergy propriétaire du château de Montfort au X Ve siècle. >Cette famille serait entrée en possession de cette relique grâce à Othon de la Roche, croisé bourguignon de la quatrième croisade, qui l’aurait pris pendant le sac de Constantinople en 1204. L’existence de cette relique reste secrète dans cette famille jusqu’au milieu du XI Ve siècle. L’arrière petite fille d’Othon de la Roche, Jeanne de Vergy, épouse Geoffroi de Charny en 1340. >Geoffroy de Charny fait le vœu d’édifier une collégiale et d’y déposer le suaire en remerciement à la Sainte Trinité, à laquelle il attribuait la réussite de son évasion des prisons anglaises. La collégiale est achevée en 1353, Geoffroy de Charny meurt à la bataille de Poitiers (16 septembre 1356), le linceul est déposé à Lirey (Aube) en 1357 par son fils. >Le linceul demeure à Lirey jusqu’en 1360. À cette date, l’évêque de Troyes Henri de Poitiers interdit les ostentations, considérant que le linceul doit être faux. Jeanne de Vergy prend peur et met alors le linceul en sécurité dans son château fortifié de Montfort, il y restera 28 ans jusqu’à son décès en 1388. Son fils redonne aux chanoines de Lirey la relique en 1389. Craignant pour la conservation du linceul, pendant la guerre de Cent Ans les chanoines de Lirey, le confient en 1418 à Marguerite de Charny, petite fille de Geoffroy de Charny qui le plaça à nouveau dans son château de Montfort. Puis il sera déplacé à Saint Hippolyte (Doubs), un fief de son mari, Humbert de Villersexel. Link: http://fr.wikipedia.org/wiki/Montigny Montfort I apologize to those who were familiar with these ancient stories….","date":"2015-02-17","mins":"8:55 am","url":"https://shroudstory.com/2015/02/17/movement-of-the-shroud-after-1355/","cat":"other_blogs","title":"Movement of the Shroud after 1355"},{"id":"comment-191333","author":"piero","post":"Thierry Leroy Link: http://www.baglis.tv/intervenants/1999 thierry leroy Thierry Leroy est enseignant et historien des Templiers, Titulaire d’un Master en histoire médiévale à l’Université de Reims portant sur Hugues de Payns (le fondateur de l’Ordre des Templiers), il prépare actuellement une thèse sur l’implantation des Templiers en Champagne. Membre de la Société Académique de l’Aube, il est également président de la Fondation Hugues de Payns. Il est l’auteur de “Hugues de Payns, fondateur de l’Ordre du Temple” (éd. La Maison du Boulanger, 2001) qui a reçu le Prix des Arts et Belles lettres de la Société Académique de l’Aube en 2000 et les “Templiers : Légendes et histoire” (Imago, 2007) qui a reçu le Prix littéraire du Conseil Général en 2007. Rough translation: >Thierry Leroy Thierry Leroy is a teacher and historian of the Templars, holds a Master in medieval history at the University of Reims on Hugues de Payens (the founder of the Knights Templar), he is currently writing a thesis on the implementation Templar in Champagne. > Member of the Academic Society of the Dawn, he is also Chairman of the Fondation Hugues de Payens. > He is the author of “Hugues de Payens, founder of the Order of the Temple” (ed. La Maison du Boulanger, 2001), which received the Award of Arts and Belles Lettres of the Academic Society of Dawn in 2000 and the “Templar Legends and History” (Imago, 2007) which received the Literary Award of the General Council in 2007. — — Here another link: http://www.huguesdepayns.fr/.","date":"2015-02-18","mins":"9:59 am","url":"https://shroudstory.com/2015/02/17/movement-of-the-shroud-after-1355/","cat":"other_blogs","title":"Movement of the Shroud after 1355"},{"id":"comment-191274","author":"piero","post":"What bothers me is the lack of true connection with the Forêt d’Orient (= Forest of the East) … Here what I have read: >… Quant à la forêt du Temple ( ou forêt d’Orient) , un trésor templier y serait caché… On le cherche toujours , on a envie d’y croire devant la majesté des grands arbres et la beauté de cette forêt à la biodiversité préservée Rough translation = …As for the Forest Temple (or Orient Forest), a Templar treasure is hidden … there is always seeking, we want to believe before the majesty of the tall trees and the beauty of the forest to preserve biodiversity So… Where were the Templar Rites in forêt d’Orient ?… Link: http://nonnobisdominenonnobissednominituodagloriam.unblog.fr/page/4/ * * * * * * * Here another attempt: Now I have found the following book: “Guide secret des Templiers Relié” (21 mars 2015 !!!) by Thierry Leroy Link: http://www.amazon.fr/Guide secret Templiers Thierry Leroy/dp/273736552 X Descriptions du produit = Product Descriptions Présentation de l’éditeur – Des sujets évocateurs : le symbolisme des Templiers, la quête du Graal, les templiers et le saint suaire, le trésor des Templiers, la forêt d Orient, le rituel secret et l admission de chevaliers, la fin des Templiers… – Des textes illustrés par une iconographie à l’ancienne et une couverture imitation cuir. Rough Translation = presentation (Editor) – Evocative topics: the symbolism of the Knights Templar, the Holy Grail, the Templars and the Shroud, the treasure of the Templars, the forest of the East, the secret ritual and admission of knights, the end of the Templars … – The texts illustrated by an iconography antique and imitation leather cover — — Biographie de l’auteur Historien, doctorant en histoire médiévale à l’université de Reims, Thierry Leroy consacre son travail aux Templiers depuis 30 ans. Il est l auteur de plusieurs livres et articles sur le sujet, notamment la première biographie consacrée à Hugues de Payns, fondateur de l’ordre des Templiers, ainsi que les deux romans : Les croix sanglantes, une enquête de Gondemar le Templier (Pygmalion, 2011) et le Templier et le grand secret (Pygmalion, 2014). Rough translation = About the Author Historian, Ph D student in medieval history at the University of Reims, Thierry Leroy dedicated his work to the Knights Templar for 30 years. He is the author of several books and articles on the subject, including the first biography of Hugh of Payens, founder of the Knights Templar, as well as two novels: The bloody cross, a survey Gondemar Templar (Pygmalion, 2011) and the Templar and the great secret (Pygmalion, 2014). — — — But now I have not more time….","date":"2015-02-17","mins":"9:15 am","url":"https://shroudstory.com/2015/02/17/movement-of-the-shroud-after-1355/","cat":"other_blogs","title":"Movement of the Shroud after 1355"},{"id":"comment-137137","author":"piero","post":"But … What kind of studies perform Dow Parker? What is the specific field of study of the student? Thank you in advance..","date":"2014-07-11","mins":"12:40 pm","url":"https://shroudstory.com/2014/07/08/new-documentary-in-the-works/","cat":"other_blogs","title":"New Documentary in the Works"},{"id":"comment-103273","author":"piero","post":"I am puzzled about the strange fact that happened in Italy. Here the title : “Man crushed by giant John Paul II crucifix in Italy. The cross fell during a ceremony and killed the young man on the spot” … Here the details : >An Italian man was crushed to death on Wednesday, April 23, by a giant crucifix honoring John Paul II that collapsed during a ceremony ahead of the late pope’s canonization. >A piece of the 30 meter (98 foot) high wooden cross fell during the event near an Alpine village, killing the young man on the spot, Italian media reported. >The Jesus Christ statue on the cross is six meters high and weighs 600 kg and the crucifix was curved and fixed to the ground with cables, the reports said. >The victim’s age was given at 20 or 21 years old. >The cross was designed by sculptor Enrico Job and was created for John Paul II’s visit to Brescia in the Lombardy region in northern Italy in 1998. >It was taken down, held in storage and then installed in a picturesque spot near the village of Cevo in 2005. >The unusual shape of the crucifix was intended to represent the scars of World War II. Link : http://www.rappler.com/world/regions/europe/56318 man crushed giant john paul ii crucifix italy?utm source=feedburner&utm medium=feed&utm campaign=Feed%3 A+rappler+%28 Rappler%29 — — In my opinion we have to improve our knowledges in the field of Structural Mechanics because applying the method of “AFM three point bending test” we can obtain some interesting informations (eleasticity modulus = Young’s modulus …) about linen fibrils … and then we can change our own minds based on evidence (= see also : the scientific truth obtained from the experiments). We have a lot of work to do … I want to see open minded discussion about that new “mechanical dating” (based on AFM tests, see also : the question of indentation = a nano damaging technique …). Is that another controversial dating ?.","date":"2014-04-24","mins":"12:26 pm","url":"https://shroudstory.com/2014/04/24/of-pro-authenticists-and-anti-authenticists/","cat":"other_blogs","title":"Of Pro-Authenticists and Anti-Authenticists"},{"id":"comment-191033","author":"piero","post":"Don’t You think that there is a certain degree of caricature in that portrait of Jesus (= the Man of the Shroud) that appears on that ancient Sheet? I am referring to the anamorphisms that are present on the cloth. Are you able to see some degree of “anamorphic” distortion to the image? What do you think about the study (= An Artist’s Study of the Shroud Image) by Roger W. Basset? Link: http://www.shroud.com/pdfs/stlbasset1.pdf — — — *** — — — Another question. Here two lines for those who believe in the C14 1988 : They should at least try to do an attempt to disprove the “numismatic dating” by Prof. Giulio Fanti… And I want to add that this verification (about the “numismatic dating” by Fanti) has nothing to do with the fact of being believers or non believers….","date":"2015-02-14","mins":"9:46 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","title":"On Deaf Ears Here?"},{"id":"comment-191200","author":"piero","post":"Last week we were able to read the news about the death of Michele Ferrero: “Michele Ferrero dead: Nutella billionaire dies aged 89 on Valentine’s Day” >The world’s richest confectioner, whose Nutella spread helped raise generations and Ferrero Rocher chocolates were legendary as the choice for ambassadors, has died aged 89. >Michele Ferrero, who had been ill for several months, died on Valentine’s Day surrounded by his family at his home in Montecarlo. … >The patriarch of the Ferrero empire was said to have defined the Italian confectionary landscape. He and his family were ranked 30th on Forbes’ list of the world’s richest billionaires in 2014, said to be worth $23.4 billion. Link: http://www.independent.co.uk/news/people/news/michele ferrero dead nutella owner and italys richest man dies on valentines day aged 89 10046991.html — — Colin knows Nutella because he was able to do an “impactograph”. … I am still curious about the strange idea of “impactography”… and the possibility to improve the experiments about the “impactography”. See also: the japanese imprint, gyotaku… Link: http://en.wikipedia.org/wiki/Gyotaku In any case Nutella is a form of a chocolate spread. >Nutella is made by harvesting cocoa beans from the cocoa tree and leaving them out to dry for about 10 days. They are then roasted to release the cocoa butter and then pressed to remove all the cocoa butter. This butter is not used in the Nutella, but is taken away to be used for other chocolate products. What’s remaining is pure cocoa, which is then crushed. Hazelnuts are then inspected to ensure quality, and cleaned and then roasted. Each jar of Nutella contains about 50 hazelnuts! After they have been roasted they are added to a mixture of the pure cocoa powder, skimmed milk, sugar. > This mixture is then mixed into a smooth paste that we all love and sent for packaging Link: http://www.chemistryislife.com/the chemistry of nutella >Hazelnuts, (or Corylus avellana), are rich in Folate, an important vitamin that helps prevent megaloblastic anemia and neural tube defects in newborn babies. >They are also an excellent source of vitamin E, which is a powerful lipid soluble antioxidant that is required for maintaining the integrity of cell membrane and mucus membranes and skin because it protects it from harmful oxygen free radicals. >Hazelnuts are also a rich source of minerals including manganese, potassium, calcium, copper, iron, magnesium, zinc, and selenium … … In other words, I think Colin might well explain certain things from the perspective of medical pharmaceutical, but he should not be so harsh towards the blog of Dan making the exchange of opinions really ridiculous … With cartoons Colin could ridicule the blog by Dan, instead I think that he should do the experiments, or improve them, and then it should show us the results that he gets (and, possibly, giving us a probabilistic judgment, his “probabilistic verdict”)..","date":"2015-02-16","mins":"10:34 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","title":"On Deaf Ears Here?"},{"id":"comment-213424","author":"piero","post":"May be… Then, perhaps, Art experts are not always right (but this can be a worrying idea…). But … Here a simple question: Has Mc Crone never worked for such an institution as the Metropolitan Museum of Art of New York? At least, we have to see what Marco Leona director of scientific research of Metropolitan Museum of Art, New York (and … do you remember the past message about SERS?) can do with non destructive and microanalytical techniques… Here the past international conference, the meeting: “TECHNART 2015” (Catania, April 27 – 30, 2015) = Non destructive and microanalytical techniques in art and cultural heritage >The aim of TECHNART 2015 is to provide a scientific forum to present and promote the use of analytical spectroscopy techniques in the field of cultural heritage. >The conference builds on the momentum of TECHNART 2013 offering an outstanding and unique opportunity for exchanging knowledge on leading edge developments. >Cultural heritage studies are interpreted in a broad sense, including pigments, stones, metals, glass, ceramics, chemometrics on artwork studies, resins, fibers, forensic applications in art history, archaeology and conservation science. Conference topics: >X ray microanalysis (XRF, PIXE, XRD, SEM EDX) >Confocal X ray microscopy (3 D Micro XRF, 3 D Micro PIXE) >Synchrotron, ion beam and neutron based techniques/instrumentation >FT IR and Raman microscopy >UV Vis and NIR absorption/reflectance and fluorescence >Laser based analytical techniques >Magnetic resonance techniques >Chromatography (GC, HPLC) and mass spectrometry >Optical imaging and coherence techniques >Mobile spectrometry and remote sensing Link: https://www.prospecthere.com/event/technart 2015 …Unfortunately no mention of the SERS technique! Only a generic “Raman microscopy”….","date":"2015-10-23","mins":"10:17 am","url":"https://shroudstory.com/2015/10/23/proof-that-art-experts-are-not-always-right/","cat":"other_blogs","title":"Proof that art experts are not always right"},{"id":"comment-191197","author":"piero","post":"In my opinion the cartooning by Colin about the attempts (right or wrong) to improve the knowledges about the Shroud has nothing to do with the struggle of the supporters of freedom of speech and freedom of the press … Am I wrong in my boring complaint? — — — Barrie Schwortz (dismitting “Freeman’s claims”) invoked the numismatic proof about the early coins (an interesting “numismatic dating” was well illustrated by prof. Eng. G. Fanti in her own book …) … So far as I know the numismatic dating (prof. Fanti) has never been denied by any paper. So far so good… but some of the friends of this blog by Dan do not want to hear anything about this interesting argument against the C14 1988… — — — Colin, if You want You can play different types of bellows blown bagpipes… Do you know the Angel playing bagpipes (in Edinburgh)? Perhaps you won The star of the Order of the Displeased, so I beg your pardon … Are we (perhaps) the poor pipers? I believe we can try to show something on numismatic dating using examples from Roman archaeology… But … Where are the numismatic experts (professional persons) with an adequate set of new comparative analyses ?.","date":"2015-02-16","mins":"9:59 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","title":"On Deaf Ears Here?"},{"id":"comment-193417","author":"piero","post":"On November 10, 2000 I bought the book by André Marion (CNRS research engineer): “Jésus et la science” (Presses de la Renaissance, Paris, March 2000) and the book has been autographed by Marion the day after, in Argenteuil (where there was a meeting around the research about the Holy Tunic of Jesus). The interesting book was dedicated to Rodolphe, the son of André Marion. In that book you can easily read that there was the experiment where the son of Marion carried the entire cross… Unfortunately I do not see your possible observations (using Structural Mechanics, etc.) about the Cross and the movements of that crucified Man. I do not see even your careful consideration of wounds arising from rubbing on the wood (of the Cross). — — — Unfortunately I have no news about the radiocarbon dating of the cross of the Good Thief … Have you found the inherent news? — — Instead there is a paper about the “Titulus Crucis” : ttps://journals.uair.arizona.edu/index.php/radiocarbon/article/view File/4067/3492 Results: Radiocarbon age of the “Titulus Crucis” = 1020 ± 30 BP Calendar age of the “Titulus Crucis” = AD 996–1023 (1 σ) AD 980–1146 (2 σ).","date":"2015-03-15","mins":"9:15 am","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-193514","author":"piero","post":"I apologize, unfortunately I went off topic!!! But I had already tried to post something on the same subject (= Herod and Lugdunum Convenarum) last week and I had failed because the line was blocked ….","date":"2015-03-16","mins":"11:21 am","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-193505","author":"piero","post":"Here you can read what I wanted to write (yesterday) in my previous message (around the book by Marion [year = 2000. Then, before the other book by Marion an Lucotte, of the year 2008, quoted in the .pdf file] and the transport of the entire cross) when I wrote something about the “careful consideration of wounds arising from rubbing on the wood”: We have to take into account the exact positions of the Man on the Cross! Then we have to discover (using a model) where were these positions (and their source = from what kind of movement of the body hanged on Cross). So, the simple question to answer is the following: What kind of dorsal rubbing on wood of the Cross? This can be the true way to follow in order to clarify the issue, because (in my opinion) nobody wrote the right observations about the exact skin wood contacts … I appreciated the suggestion to re read Barbet and then I ask to you: What are your own conclusions (inherent to the argument “skin wood friction” here touched)? — — — — Here two lines about Lucotte… If I am right in my readings, it appears that the results of the particular analyses conducted by Lucotte have found that Jesus was an opium addict with bad habits … What is your opinion about Lucotte (a scientist who specialized in the field of DNA) who argued that Jesus was an opium addict ? His statements were based on the analysis of fragments of hair found on the tunic of Argenteuil … Now the questions are the following: What can we say of those DNA analysis? What value can we give to those controls on material very old? But those are other stories ….","date":"2015-03-16","mins":"9:59 am","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-193617","author":"piero","post":"I I am right Lucotte indicates that, according to the studies of his colleague Andre Marion, bloodstains on what one considers as being ‘the rear side’ of the Tunic, are arranged in shape of a cross. So, the original book seems to be the text I have indicated in one of my previous messages. — — Yesterday I checked and Figures n. 5 and n. 6 of the book (whose author is only Marion) correspond to Fig. 2 of the file (pdf) of OK. Instead the figures n. 7 and n. 8 (whose author is only Marion) correspond to Fig. 3 of the file (pdf) of OK. — — After consideration of the exact (and amazing) and the corresponding positioning of the bloodstains of the Holy Tunic placed above the silhouette of the dorsal sheet of Turin, prof. Marion concluded that the probability that the two relics (Shroud and Tunica Argenteuil) are authentic are mutually reinforcing. — — Although I am more inclined to think to the “extreme” alternative of the transport of the entire cross (and I have several doubt about the possible weight), I follow the different points of view but I do not regard as essential the disquisition about the transport on the shoulders of the poor condemned (to the sad torture) of the entire cross or only the “patibulum”… — — In my opinion what may seem disturbing in the debate is the lack of studis of Mechanics and Structural Mechanics (see also: the possible concrete effects on the body of the poor Man condemned) on the main alternatives: – The lifting of the entire cross from the ground – The use of the stipes and the patibulum I believe it is necessary to proceed gradually in the study of these problems … — — Surfing the Web … I read that in 2008 Lucotte said that we can redo the whole chain of DNA from traces or fragments. He also said that it is possible to clone a human being and that he believed this was already done… and the same researcher (Lucotte), presented as geneticist, said he found erythrocyte on Holy Tunic of Argenteuil… So we have to consider the book: “Guardare la Sindone: cinquecento anni di liturgia sindonica” (= Watching Shroud: five hundred years of liturgy Shroud) by Gian Maria Zaccone, G. Ghiberti Effata Editrice IT, 2007 – 454 pages where is the thorny issue, that I have already pointed out: Lucotte, not in his book, but in the magazine for the general public (= “Le Point”) claimed that the man of the Tunic of Argenteuil had an opium addict, of bad habits, and these claims were based on the analysis of fragments of hair … — — — Here an excerpt taken from the address: http://www.radio silence.tv/imprimer.php?menug=9&menuh=2&id Ru=267 >… The DNA. Pr. Lucotte recalls that the red blood cells which have been located on the Holy Tunic, don’t have any DNA material. However, several cells of skin, hairs, dandruff, and of white globules, which have been located on the Tunic, contain the human DNA of which the chromosomal analysis, at this stage, indicates the following certainties: a) It is human DNA b) The genetic profiles of this DNA concern only one individual. C) The specific markers mention the presence of the chromosome Y, marker of masculinity. D) The chromosomal formulas indicate a correspondence with an oriental Semitic non Arabic DNA. We got, says the professor, the DNA print (like in legal medicine) of this man according to 15 discriminative markers. >This print, like all prints, is unique and will permit useful comparisons. … So… Here there is not the claim aboout an opium addict person. Now I am curious to read what is the exact opinion by Kelly Kearse on DNA analyses conducted by Lucotte (who has found that Jesus was an opium addict with bad habits!…) — — and the name “Lucotte” also appear in the paper by Prof. Giulio Fanti: “A dozen years of Shroud Science Group” >… the Special Issue consisted of 12 papers signed by the following first authors: F. Alconchel Pecino, G. Baldacchini, A. Carpinteri, G. Lucotte … … etc. … … (at pag 5 of 17) Link: http://www.shroud.com/pdfs/stlfanti2.pdf — *** — *** — The Holy Shroud is always a controversial relic. For example, today came out on the newspaper “Corriere della Sera” an article (centered on the book by Andrea Nicolotti, published by Einaudi) entitled: “The paradox of the Shroud” signed by Paolo Mieli. Link: http://cinquantamila.corriere.it/story Teller Articolo.php?story Id=55082ea7549ff At the end of the summary of that article you can read the following words: >… Tutto ciò che è stato addotto a spiegare quei mille e passa anni di silenzio è nient’altro che frutto di un uso acrobatico della storia. Here the translation: >… All that has been put forward to explain the thousand odd years of silence is nothing but the result of an acrobatic use of History. — — Another short phrase of the text: >Il 1973 fu l’anno dell’ostensione televisiva della Sindone. >A poco a poco nasceva la «sindonologia», che Nicolotti definisce una disciplina con «le caratteristiche tipiche delle pseudo scienze» Here the translation: >1973 was the year of the Exposition of the Shroud television. Gradually arose the “Shroudology”, which Nicolotti defines a discipline with “the typical characteristics of pseudo sciences” So… following that statement, I ask : Who was Vignon ? — — http://www.cartadiroma.org/rassegna/17 marzo 2015 cronaca/ http://cartadiroma.waypress.eu//Rassegna Stampa/Leggi Articolo.aspx?codice=SIM2042.TIF&subcod=20150317&num Pag=3& — — — However, I repeat that I am curious about the C14 dating (… or with another system, possibly non destructive or very little destructive. See also: the interesting methods that prof. Campanella indicated as feasible for wood dating!) about the Cross of the Good Thief ….","date":"2015-03-17","mins":"12:45 pm","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-193618","author":"piero","post":"Errata corrige: If I am right Lucotte indicates Instead of : I I am right Lucotte indicates.","date":"2015-03-17","mins":"12:47 pm","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-194475","author":"piero","post":"On page 136 of the book “Inchiesta sulla Sindone” (= “An Inquiry Into the Shroud”), by Marco Tosatti (Piemme editions, 2009) we can find the idea of a different explanation… It is a hypothesis, a bit less striking, but also with this (perhaps) of its rationality and supported by the experience of the doctor Prof. Baima Bolllone. Which offers a different explanation: “Experimental investigations comparative between the attitude whether of living people and dead persons, lying on a thick glass, allowed to advance the hypothesis that the areas right scapular and left suprascapular not match the injuries, but simply of cadaveric bruises/stripes (= black and blue marks, etc. …) due to compression on the floor support ” Unfortunately I do not have data on the reliability of this supposition. — — — Then, see also: “Post mortem hypostasis” Link: http://www.forensicpathologyonline.com/e book/post mortem changes/post mortem hypostasis.","date":"2015-03-26","mins":"8:52 am","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-193512","author":"piero","post":"I wrote in a wrong manner : >before the other book by Marion an Lucotte, of the year 2008, Instead of: >before the other book by Marion and Lucotte, of the year 2008, — — — — The Torah requires the use of the ashes of the red cow just to purify one who becomes impure through contact with a corpse … This commandment was given to the children of Israel in the second year after the exodus from Egypt, in those days the Tabernacle had been erected and put into use. At that time all Israel, including those who had not made impure through contact with a dead body, followed the ritual of purification through the ashes of the red cow, since they occurred was the incident of the golden calf. From this we learn that idolatry involves the same rite of purification such as contact with a corpse. … And what were the implications of that obligation, in the case of the Shroud? Often M. P. Hamon writes messages citing the history of the ashes of the red cow … The preparation of the ashes of the red heifer must necessarily be done by a priest, that is from a person who had never been impure through contact with a corpse. And, please, read the following words: “There was a man named Joseph, who was a member of the Council, just and good man, who had not consented to the counsel and deed of others.” (Gospel of Luke) In a controversial book by Gilbert Sinoué (Title = “Moi, Jésus” [= I, Jesus], 2007) Joseph of Arimathea is even described as a personal adviser of Caiaphas, the head of the Sanhedrin! Link: http://en.wikipedia.org/wiki/Gilbert Sinou%C3%A9 So… What is your idea about Joseph ? Obviously this is off topic. But Glori (in his IWSAI paper) said: “… According to the Jewish belief, people had to avoid any contamination with all that had touched the blood of a convict or a victim of a violent death. The rule stated that everything had to be burnt or removed. …” B.T.W. : I am still curious about the exil by Herod Antipater known by the nickname Antipas, who was a 1st century ruler of Galilee and Perea and who bore the title of tetrarch … Saint Bertrand de Comminges is a commune in the Haute Garonne department in southwestern France and it is believed to have been the place of exile from 39 AD of Herod Antipas, with his wife Herodias, under Caligula’s orders… Link: http://en.wikipedia.org/wiki/Saint Bertrand de Comminges So… Herod Antipas (and Herodias) journeyed to Rome to appeal to Caligula, but was instead banished to Lugdunum Covenarum in southern France, on the foothills of the Pyrenes. >The oppidum of the Volcae Tectosages was conquered by Pompey in 72 B.C. It became the capital of the civitas of the Convenae, which was successively part of the Provincia, of Aquitania, and of Novempopulania. >The town obtained first Latin, then colonial status. It was ravaged by the Germanic invasions and was destroyed in 585 by the Franks of Gontran. >Lugdunum commands the valley of the Garonne as it emerges from the Pyrenees. The ancient oppidum was placed on the heights and under the Empire was a double town; it was protected by a rampart in the Late Empire and now bears the Cathedral of Saint Bertrand. (this is an excerpt from “The Princeton Encyclopedia of Classical Sites”) Bibliography: – A. Aymard, “Remarques sur des inscriptions de Lugdunum Convenarum,” ibid. 20 (1940 43) 131 88. Sapène, “Saint Bertrand de Comminges” (Lugdunum Convenarum), centre touristique d’art et d’histoire, s.l. (1962). Links: http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3 Atext%3 A1999.04.0006%3 Aalphabetic+letter%3 DL%3 Aentry+group%3 D6%3 Aentry%3 Dlugdunum convenarum >Prendendo le mosse dall’analisi della distribuzione geografica di un bollo ceramico impresso su anfore vinarie della prima età imperiale, la ricerca ne discute la presenza anche in un centro sperduto del versante aquitanico dei Pirenei. >Quella esile traccia archeologica permette di riaprire la questione della sede dell’esilio di Erode Antipa e di sua moglie Erodiade, noto dalle fonti storiche, e di disporre attorno ad essa altre tracce archeologiche di diversa natura, che trovano a loro volta riscontro nel folklore e nelle tradizioni locali in una prospettiva storica plurisecolare Here a rough translation: >Building on the analysis of the geographic distribution of a stamp imprinted on ceramic amphorae of the early imperial age, the research discusses the presence even in a remote center of aquitanico side of the Pyrenees. >That slender archaeological trace allows to reopen the issue of the seat of the exile of Herod Antipas and his wife Herodias, known from historical sources, and to have around it other archaeological traces of a different nature, which are in turn reflected in folklore and in local traditions in a historical perspective centuries I see that I went really far from the Shroud, but Herod is one of the important characters of that terrible historical drama. See also: http://www.teleblu.tv/seminario di studi erode sui pirenei a cura dellarcheologo daniele manacorda/ The next appointment (Univ. Of Foggia, Italy): >Mercoledì 1 marzo 2015, alle ore 10.00, presso l’aula I del Dipartimento di Studi Umanistici dell’Università degli studi di Foggia (via Arpi n.176) si terrà il seminario di studio sul tema: “Erode sui Pirenei: storie di esili, di banchetti, di streghe”. L’incontro, organizzato nell’ambito delle attività didattiche del Dottorato di “Storia e Archeologia Globale dei paesaggi”, sarà tenuto dal Prof. Daniele Manacorda, ordinario di Metodologia della ricerca archeologica presso il Dipartimento di studi umanistici dell’Università degli studi ROMA TRE. >Daniele Manacorda ha diretto vari scavi archeologici stratigrafici specialmente a Roma, in Puglia e in Toscana ed ha organizzato l’allestimento di alcuni nuovi musei e parchi archeologici (Roma Crypta Balbi, Piombino Populonia, Narni). Ha pubblicato circa 250 contributi scientifici, occupandosi di metodologie della ricerca archeologica, storia dell’archeologia, archeologia urbana, produzione e circolazione di merci, relazione tra diversi sistemi di fonti archeologiche e storiche, archeologia e epigrafia, nonché di temi riguardanti la tutela e la valorizzazione del patrimonio culturale. Here a rough translation: >Wednesday, March 18, 2015, at 10:00 am, at the hall of the Department of Humanities of the University of Foggia (via Arpi # 176) will be held the seminar on the theme: “Herod the Pyrenees: stories of exile , of banquets, of witches. ” The meeting, organized as part of the educational activities of the Doctorate of “Global History and Archaeology of the landscapes”, will be held by Prof. Daniele Manacorda, Professor of Methodology of archaeological research in the Department of Humanities of the University Roma Tre. >Daniele Manacorda has directed various stratigraphic excavations especially in Rome, in Puglia and Tuscany and organized the construction of several new museums and archaeological parks (Rome Balbi Crypt, Piombino Populonia, Narni). He has published about 250 scientific papers, dealing with methods of archaeological research, the history of archeology, urban archeology, production and circulation of goods, the relationship between different systems of archaeological and historical sources, epigraphy and archeology, as well as issues concerning the protection and promotion of cultural heritage. But … Is it possible to use “geographical distribution of a stamp imprinted on ceramic amphorae” to locate the exact site of the exile of Herod? I hope in your interesting comments….","date":"2015-03-16","mins":"11:09 am","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-29227","author":"piero","post":"I have found the thermographic image (http://en.wikipedia.org/wiki/Thermographic camera) of some lizards under : But the image of these animals [the scale is from 29.2 C to 42.4 C] is a bit defocused … Perhaps You have to check (or to glance at …) the works obtained by Giovanna De Liso in the past … Try under : http://www.acheiropoietos.info/proceedings/De Liso Web.pdf Look at the key and observe the snake … What is your opinion ? For example, Thibault Heimburger (August 12, 2012 at 6:31 pm) wrote : >The only persuasive set of images I have seen so far are those produced by Giovanna de Liso in her 12 years of experimenting and modelling in relation to seismic activity near Piedmont. They seem to satisfy most of the requirements of the Shroud image. >Her paper “Shroud like image formation during seismic activity”; Giovanna de Liso; ENEA Frascati Conference May 2010″, can be found at: http://www.acheiropoietos.info/proceedings/De Liso Web.pdf Sorry … this is the same address that I have previously indicated. — — In any case the idea (= … the 3 D effect as least as well as the shroud, and sometimes better) by Hugh Farey seems to be wrong … — — But … I want to remember that in Italy there is an interesting example (about the space and the artistic representation) in Milan : Santa Maria presso San Satiro Milano (it’s a church with an illusory systemation made by Bramante) : http://en.wikipedia.org/wiki/Santa Maria presso San Satiro >The choir, which had to be truncated a depth of only 90 cm (3.0 ft) due to the presence of a main road, was replaced by Bramante with a painted perspective, realizing in this way one of first examples of trompe l’oeil in history of art … So … Try to look under the two different perspectives : and.","date":"2013-04-03","mins":"12:15 pm","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-29301","author":"piero","post":"Dear daveb, I am curious about your opinion, because I have read the following words (pseudo science ?): >Drbal explained the results of his razor blade research by asserting, “That such an action on the dipole molecules of water is possible in a resonant cavity, fed with appropriate microwave energy, was proved by the scientists Born and Lertes (see: Archiv. Der elektrischen Uebertragung, 1950, Heft 1, s.33 35. ‘Der Born Lertessche Drehfeldeffekt in Dipolfluessigkeiten im Gebiet der Zentimeterwellen’). It was found that the microwaves of centimetre wavelengths and their harmonics can produce an accelerated rotation of the water dipole molecules, and this effect can have as a result the dehydration process – the ‘driving out’ of water dipole molecules from the smallest cavities and projecting them in the open air. This is exactly the process of electromagnetic dehydration.”4 Similarly, dehydrated cellulose of the Shroud fibrils is the cause of the image according to STURP, not paint, pigments, or other substances5. >Although not fully understood or accepted by mainstream science, some physicists do believe that the pyramid is, not only an accumulator of energies, but also a modifier of these same energies. It is recognized that any object in which energy vibrates is capable of acting as a resonating cavity. It is further speculated that this energy would affect the molecules, or crystals, of any object in the path of the beam of focused energy. Some even equate it to an invisible laser beam, having a different frequency and intensity … — — I beg pardon about the long passages. Source : http://www.gizapyramid.com/benford.htm I want to add that I read some strange words about the Bosnian Pyramid (= Visoko Piramida) See for example under the address : http://www.sbresearchgroup.eu/index.php/en/notizie in inglese/104 conclusion of the conference hidden history 2012 in visoko –> the presentation of Dr. Slobodan Mizdrak on the results of the experiment carried out in April 2012 on the apex of the Bosnian Pyramid of the Sun, for the evaluation of electro magnetic and ultrasound phenomena (in English). And then I am puzzled … about the true possibility of interaction with the linen sheet. But we have to find the truth and then we cannot waste the time with all the puzzle headed persons… Do you agree with me ? What is your idea ? There are no experiments on linen … !.","date":"2013-04-04","mins":"8:57 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-211891","author":"piero","post":"In my opinion Dan’s blog is attractive like an interesting Widmanstatten texture … and now Colin’s Planet is near a flaming fireball… Sorry. I tried to turn myself in a sort of “old science fiction hunter” and therefore I cannot find an useful link with new possible Moon formation pathway, etched with acids, on rocks… Perhaps (… here only irony) Colin’s orbit around this blog in the past may have been elliptical to varying degrees, becoming more circular during periods of low tides like at present. Shroudstory com. Is not a black stone! Links: http://www.museumwales.ac.uk/mineralogy of wales/meteorite minerals/ http://geology.com/meteorites/iron meteorites.shtm http://redbeds geology.com/pages/88832/The origin of red beds.html.","date":"2015-10-06","mins":"9:27 am","url":"https://shroudstory.com/2015/10/04/the-sponge-the-great-black-hole-of-the-shroudie-blogosphere/","cat":"other_blogs","title":"The Sponge: The Great Black Hole of the Shroudie Blogosphere"},{"id":"comment-215012","author":"piero","post":"Subject: authenticity and scientific controls. Daveb: >1) Fanti’s mechanical testing suggesting the possibility of a 1st century date;… …Fanti’s mechanical testing … ??? I hope to see more controls, with more exact works in that field! In the past I wrote some generic remarks (also indicating some particular controls, as the “AFM three bending tests”, perhaps useless due to the possibility to obtain direct AFM [elasticity] maps, etc. …). Then, due to the usual level reached in our “controversial discussions” on this blog, I think you have to try to be more scientific in your approach. And then, please, attention. Be careful in reading my text: Here I don’t write that past mechanical tests done by Fanti and Malfi (an interesting educational work) can mainly be seen as hallucinations or only classified in the scientific field of bad works… or other similar bad things. — — Here a generic reference about “Three point bending tests with an atomic force microscope” and “mechanical properties”: “Measurement of the elastic modulus of spider mite silk fibers using atomic force microscopy” by Stephen D. Hudson, Vladimir Zhurov, Vojislava Grbić, Miodrag Grbić and Jeffrey L. Hutter Link: i http://scitation.aip.org/content/aip/journal/jap/113/15/10.1063/1.4800865 — — — Here I want to add another particular remark/question: Why in the past the researchers did not use ATR FTIR controls on areas covered by serum which prevented the formation of the image on linen cloth? Am I wrong in my question? See also : “depth of penetration” for ATR FTIR controls… Sorry. This problem has to do with the BIF mechanisms proposed as originated the Image on the Cloth. And then, written here, it is off topic ….","date":"2015-11-23","mins":"10:43 am","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"},{"id":"comment-205508","author":"piero","post":"Trying to do something in order to improve the precision of measurements in the field of Textile Archaeometry (using AFM, CFM, AFM three point bending tests, AFM Raman, SNOM, etc.) is an extremely important question… Where is our Science? Only improvements for NASA’s explorations? Anyway, now I want to change the discourse, because I see nothing of new in your minds (for example: I didn’t see any true discussion about ATR FTIR, the inherent depth of penetration on linen fibrils, etc.!) about this basic argument… — — Today I have a further look at a fine book by an Italian mathematician: Odifreddi. In the book we can see the photography of the Face of the Shroud compared to the photography of the funeral mask of Agamemnon. But, unfortunately, this issue has been (“devilish”, but maybe I should write: diabolically, without even use quotes …) reversed into the idea that the Shroud is a fake (…because of “too much verisimilitude “…)! I admit, however, that Geometry is a very important matter [see also: PCA (Principal Component Analysis) and differences from spectral data…] and that Piergiorgio Odifreddi is a strange kind of professor, often funny or original in his scientific speeches …but completely wrong with the idea about the Shroud… The idea of Odifreddi seems to be the following: > Only a bas relief of little depth can leave an imprint similar. But we know that some researchers (and among them … now I want to point out a name: Don Gaetano Intrigillo) were able to perform some tests demonstrating the possibility of obtaining interesting images from a body (especially the Face), or from something that reproduces it….","date":"2015-07-13","mins":"11:24 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"},{"id":"comment-205510","author":"piero","post":"Analytical Archaeometry can describe linen fibrils of the Holy Shroud (involved in B.I.F. Or simply being part of that ancient linen cloth) in a new and gently manner and this interesting and challenging field of research is (or will be) the winning space for new Shroud studies (IMHO). Have you nothing to reproach to me, about the previous words? Perhaps I have to study in a better manner “Multivariate data analysis methods”, such as Principal Component Analysis (=PCA), that are commonly used in the qualitative and quantitative analysis of spectral data… and other interesting things. So, nothing to do with: “sindonists’ revolutionary methods …” only Applied Science!.","date":"2015-07-13","mins":"11:52 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"},{"id":"comment-215020","author":"piero","post":"Subject: The idea of a “New Archaeological Chemistry” and the old problem of absence or presence of an Image under blood and serum. — — Here what I can again say, following the switching from the main argument (“…Seven or So Reasons to Believe the Shroud is Authentic”), arriving to the other problem underlined: The late researcher Dr. Alan Adler wrote that all the blood images show evidence of clot retraction rings of serum about each wound and this is easily seen in the fluorescence photographic studies. And then see also: ultraviolet lighting on blood marks throughout the entire body… What can furthermore observe (about the problem of ATR FTIR controls) a forensic scientist about the (presence or absence of the) Image (under the serum layer)? See also: the absence of body image on the wound image margins (Jumper et al., “Archaeological Chemistry”, 1984) and the RGB image enhancement of photographs of serum flows (by Don Janney [= STURP team]). Has really this “simple ATR FTIR problem” nothing to do with the question inherent the authenticity of the Holy Shroud and the various BIF mechanisms? See also the other problem to solve: the serum layer on linen fibrils and the effect of radiations (and/or electric discharges)… — — — I am sorry for this curious “ATR FTIR diversion” (but see also the possibility to use other more advanced techniques) from the main topic, sometimes the reasonings overlap, but this “source of confusion” should not have a great influence (in order to rule out a possible dialogue) … I hope in your answers..","date":"2015-11-23","mins":"12:00 pm","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"},{"id":"comment-215186","author":"piero","post":"I have forgotten the translation about the previous latin words: “Explicavi sententiam meam eo consilio, tuum iudicium ut cognoscerem.” Then, here my attempts: = I explained my opinion, on going to know your opinion. Or: = I explained my opinion in the intention to know your opinion. Am I wrong for these translations? Please, if I am wrong, prove to me where I am wrong… — — — Another argument: Flexural tests. The three point bending flexural test provides values for the modulus of elasticity in bending, flexural stress, flexural strain and the flexural stress strain response of the material. Links: https://en.wikipedia.org/wiki/Three point flexural test https://en.wikipedia.org/wiki/Euler%E2%80%93 Bernoulli beam theory Bending tests with atomic force microscopes (AFM) is a common method for elasticity measurements on 1 D nanomaterials. — — — The classical example is the following: “A method for testing the elastic modulus of single cellulose fibrils via atomic force microscopy” Qingzheng Cheng, Siqun Wang published in “Composites Part A: Applied Science and Manufacturing” Vol. 39, Issue 12, December 2008 … and here a short excerpt from the Abstract: >… The elastic modulus of cellulose fibrils, of diameter approximately 170 nm isolated from Lyocell fibers by high intensity ultrasonication was evaluated to be 93 G Pa. … Link: http://www.sciencedirect.com/science/article/pii/S1359835 X08002352 There is also something to read, printed in an interesting book, titled: “Carbohydrate Nanotechnology” Keith J. Stine John Wiley & Sons, October 2015 Links: http://eu.wiley.com/Wiley CDA/Wiley Title/product Cd 1118860292.html http://www.hoepli.it/libro/carbohydrate nanotechnology/9781118860533.html — — — And then, see also: the use of micro/nano electronics and micro/nano electromechanical systems (MEMS/NEMS)….","date":"2015-11-27","mins":"12:35 pm","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"},{"id":"comment-215292","author":"piero","post":"As you can easily verify, in a past message (sent in data: January 9, 2015 at 11:16 am), I wrote: >…I indicated the “AFM three point bending test”. But we know that is possible to propose the use of SPM technology to obtain the elastic mapping for ancient linen fibrils (coming from areas not involved in the Fire of the year 1532) instead of acting on each single fibril with a single AFM bending test… Obviously we cannot ignore other sources of mechanical weakness than age alone… For example F Ire damage, bacterial attacks, fungal attacks, and the effects of the repeated flexing of the fabric in a given area (see also: the well known argument, already indicated by Dr. Jackson: historical folds = and then a possible idea, an interesting way to find the epoch for these plies… if these plies were not altered in 2002).etc..","date":"2015-11-29","mins":"8:57 am","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"},{"id":"comment-215061","author":"piero","post":"I hope you will forgive me if I rise again trying to clarify something about the “alternative dating”… Daveb: >#1) Fanti’s mechanical testing: … … … … >…Other methods have also been used including Raman spectroscopy. The other vibrational spectroscopy was based on ATR FTIR (but see also my past generic remarks about the problem of exact ATR FTIR calibrations). In any case there is the book (by Fanti and Malfi) and then all the readers interested on the issue of “alternative dating” can read that interesting book… Link: http://www.amazon.com/The Shroud Turin Century Christ/dp/9814669121 Like I already wrote on this blog particular works, useful for “alternative dating”, can also be done using SPM controls and these works are based on the same idea of degradation of mechanical characteristics of linen fibers after centuries (See also my old intervention, during the International Congress held in Turin [in 1998], where I indicated the SP Ms as useful tools in order to check the cellulosic chains of the ancient linen cloth and the biological materials [blood, DNA, etc.]). But, until now, no one was able to do that SPM survey on Holy Shroud. So, the work done by Fanti mainly seems to be only a preliminar step in order to improve the analyses, working with the SP Ms tools …as I indicated years ago… Then there is another possible thing to take into account in your investigations. See the past exhibition: “Ancient Faces: Mummy Portraits from Roman Egypt” [February 15 – May 7, 2000], “Metropolitan Museum of Art”… From where it come the use (Fayum, etc.) to do the ancient “Graeco Egyptian portraits”? These reperts were rare and fragile works, including the Metropolitan’s entire collection of mummy portraits… So, before to destroy linen fibrils coming from the Holy Shroud there is that field to investigate using: – vibrational spectroscopies : ATR FTIR, IR Raman – advanced microscopies: AFM, CFM, AFM Raman and also: SERS controls (vibrational spectroscopy)! B.T.W.: I have just found a book by Ricardo Aroca with the following title: “Surface Enhanced Vibrational Spectroscopy” John Wiley & Sons, 2006 Links: http://www.metmuseum.org/about the museum/press room/exhibitions/2000/ancient faces mummy portraits from roman egypt https://books.google.it/books?id=4 Wu3a Q3xefw C&dq=SERS+controls+vibrational+spectroscopy&hl=it&source=gbs navlinks s If you find this is an interesting intervention (that worth to deepen), then answer to me!.","date":"2015-11-24","mins":"12:35 pm","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"},{"id":"comment-215021","author":"piero","post":"The first simple and reasonable thing to do is (or it seems to be) the careful measurement, in order to detect the exact thickness of the serum layer on linen fibrils … So… Where are the data (and then see also the results from the old micro FTIR controls) or the useful experiments?.","date":"2015-11-23","mins":"12:13 pm","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"},{"id":"comment-215062","author":"piero","post":"I was interested in the Fayum mummy portraits even before the book by Thomas de Wesselow (“The Sign”, 2012) came out!… In any case see also (…the photographs): Ancient Faces: Mummy Portraits in Roman Egypt (Metropolitan Museum of Art Publications) Susan Walker, Morris Bierbrier Link: http://www.amazon.de/Ancient Faces Portraits Metropolitan Publications/dp/toc/0415927447.","date":"2015-11-24","mins":"12:50 pm","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"},{"id":"comment-215141","author":"piero","post":"I have to rewrite a deleted hasty message. I wanted to add something about AFM Mechanical mapping … Nanoindentation using AFM can be used to examine mechanical properties of fibers at nanoscale. Then the effect of accelerated aging of linen fibers under UV (and/or VUV) and thermal oxidative conditions on mechanical property gradients across the fiber cross section can be investigated. I am curious about the level of UV degradation that produces surface degradation and bulk degradation up to x hours of exposure (See also the lower values of Young’s modulus at surface compared to center). In my opinion we can also try to use the AFM microscopy (= AFM and flexural tests) with bending actuators. See (f.e.) the old controls : “Mechanical characterization of nanofibbers – A review” EPS Tan, CT Lim, published in Composites Science an Technology” Vol. 66, issue 9, July 2006 Here ashort excerpt from the abstract: >… there is a need to characterize the mechanical properties of single nanofibers, namely tensile test bend test and indentation done at the nanoscale….","date":"2015-11-26","mins":"12:55 pm","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"},{"id":"comment-215140","author":"piero","post":"I want to add something about “AFM Mechanical mapping of linen fibres”. Nanoindentation using atomic force microscopy can be used to examine the mechanical properties of fibers at nanoscale. Then the effect of accelerated aging of linen fibers under ultraviolet (UV) and thermal oxidative conditions on mechanical property gradients across the fiber cross section can be investigated. I am curious about the level of UV degradation that produces bulk degradation up to x hours of exposure and surface degradation See also the possible lower values of Young’s modulus at surface compared to center. In my opinion we can also try to use the AFM microscopy (= AFM and flexural tests) with bending actuators… See (f.e.) the old tests: “Mechanical characterization of nanofibers – A review” E.P.S. Tan, C.T. Lim published in “Composites Science and Technology” Volume 66, Issue 9, July 2006, Pages 1102–1111 Nanocomposites Here a short excerpt from the Abstract: >… there is a need to characterize the mechanical properties of single nanofibers. >The aim of this paper is to provide a review of experimental techniques for the mechanical characterization of nanofibers, namely tensile test, bend test and indentation done at the nanoscale. … Link: http://www.sciencedirect.com/science/article/pii/S0266353805003635 Tools: For example, we can try to think at polypyrrole (ppy) based bimorph nanoactuators. These nanoactuators consists of PPY nanowire and Cu thin film. “Determination of Mechanical Properties and Actuation Behaviors of Polypyrrole–Copper Bimorph Nanoactuators” 3 Author(s): Sul, O. ; Mech. Eng. Dept., Stevens Inst. Of Technol., Hoboken, NJ, USA ; Seongjin Jang ; Eui Hyeok Yang Published in: Nanotechnology, IEEE Transactions on (Volume:10 , Issue: 5 ) >… The measured force from the nanoactuator was approximately 1 n N (at ΔT = 100 K). Link: http://ieeexplore.ieee.org/xpl/article Details.jsp?arnumber=5618567 Here another kind of link [piezoceramic actuator © 1996 2015 PI (Physik Instrumente)]: http://www.pi usa.us/piezo motion tutorial/ — — — A possible generic bibliographic reference: Smart Materials Based Actuators at the Micro/Nano Scale: Characterization, Control, and Applications. By Micky Rakotondrabe Springer Science & Business Media, June 2013 This book also includes two of the most emerging topics and applications: Nanorobotics and cells micro/nano manipulation… And then: see also the sad lack of “high technical innovations” during the past Congress (2014) hold in Bari… Links: http://dee.poliba.it/ATSI2014/index.htm http://dee.poliba.it/ATSI2014/Programma ATSI%20final.pdf https://shroudstory.com/2014/01/11/checking in on the bari workshop september 4 5 2014/ So, we can only hope to see more efforts in the next future (in the field that before I have underlined = AFM and “non destructive flexural tests” useful to obtain an evaluation about the probable epoch of linen materials and also [perhaps] for biological remains…)..","date":"2015-11-26","mins":"12:36 pm","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"},{"id":"comment-215183","author":"piero","post":"I apologize for what I quickly wrote (at 12:55 pm), also committing two misspellings… 1) >“Mechanical characterization of nanofibbers – A review” Instead of: “Mechanical characterization of nanofibers – A review” 2) >ashort excerpt instead of: >a short excerpt Unfortunately yesterday evening did not appear to me the text of the message (sent at 12:36 pm) I had written a few minutes before and then I thought that the text of that message (sent at 12:36 pm) was lost … I also wanted to add the following (generic) links: http://www.piezoproducts.com/en/ http://www.piezoproducts.com/fileadmin/user upload/pdf/jm piezoproducts company brochure en 13022015.pdf Explicavi sententiam meam eo consilio, tuum iudicium ut cognoscerem. I have not yet turned the previous statements “Semel in anno licito insanire”… into: “Semel in anno licito cogitare”….","date":"2015-11-27","mins":"11:26 am","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"},{"id":"comment-148058","author":"piero","post":"First of all … Errata corrige : preatement for fibrils = wrong pretreatments for fibrils = right — — — — — You indicated the argument : a contact scorch… So … If we want to control in a careful manner our linen samples (coming from the experiments with materials treated as in ancient times and not from modern treatments !), then we have to observe what happens at nanolevel ! See also : Pre Heating Scan and Post Heating Scan — — Nano TA is a local thermal analysis technique which combines the high spatial resolution imaging capabilities of atomic force microscopy with the ability to obtain understanding of the thermal behaviour of materials with a spatial resolution of sub 100nm. The conventional AFM tip is replaced by a special nano TA probe that has an embedded miniature heater and is controlled by the specially designed nano TA hardware and software. The user can select the spatial locations at which they would like to investigate the thermal properties of the surface Then the user obtains interesting informations by applying heat locally via the probe tip and measuring the thermomechanical response. — — Is that argument (= Nano Thernal Analysis) a speculation ? Nano TA is an useful technique to identify the behavior of the material subjected to heat. Is my intervention only another confusing and discordant note ? I do not think so … Then … I hope in your comments..","date":"2014-09-02","mins":"8:37 am","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147806","author":"piero","post":"Dear researchers, I have found an interesting idea to apply: Local Nano Thermal Analysis with an AFM = Nano heating probes allow for rapid heating and cooling and precise temperature control…. ! — — In this manner we can see what happens on linen fibrils (at nanolevel), perhaps with a great precision (… and on different kind of preatement for fibrils…). Shroud conferences have to take into account that analytical problem. Do you agree ? — — Regards PI.","date":"2014-09-01","mins":"12:48 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-6696","author":"piero","post":"Colin, I think you have to compare your image with the hands of the Holy Shroud! In other words: show us what is the result from a comparison with the hand of the Holy Shroud. In this manner we can understand what is the level you have reached with your attempt. If you want to be honest with us, you have to show us what is this result. Otherwise your science can only be at level of a feeble “fairy tale”….","date":"2016-01-08","mins":"4:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","title":"Who says science can’t explain the Shroud of Turin?"},{"id":"comment-6697","author":"piero","post":"I think your science can only be at level of a feeble “fairy tale”….","date":"2016-01-08","mins":"4:25 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","title":"Who says science can’t explain the Shroud of Turin?"},{"id":"comment-148476","author":"piero","post":"First of all, as first step, we have to distinguish byssus from linen! … and typical spectrum of proteins is different with respect lignocellulosic materials !… All protein fibres – and so all animal fibres – show a similar IR spectrum: at 3300 cm 1 and the amino and hydroxyl peaks at 2800cm 1 CH vibrations at 1650 cm 1, the characteristic vibrations of the amide groups of proteins. In this they differ markedly from the natural fibres of cellulose, which do not have amide groups. Then we have to find the truth investigating the question : Are the fibers made of silk or byssal [= Sea silk] threads? — — — S p e c t r o s c o p i c c o n t r o l s. Until now I have found only as a vague reference… It is the following study: “In situ Raman Spectroscopic Imaging of a Mussel Coating and Adhesive” by Masic, Harrington, Waite and Fratzl AIP Conference Proceedings, v.1267, 358 359 (2010) 08/2010; DOI: 10.1063/1.3482556 Source: OAI Here an excerpt from the Abstract: >The mussel has evolved a very interesting and efficient way of attaching to hard substrata in wave swept rocky seashores. This is enabled by a bundle of fine protein based threads called the byssus. The byssus is emerging as an effective model system for studying the requirements for underwater adhesion, wear resistance and combined hardness and extensibility … … etc. … Here we report in situ high resolution Raman spectroscopic imaging of the byssal coating and plaque showing micron level spatial distribution of various proteins and their interaction … etc. … — — It is important to find the right spectroscopic references about byssal threads and then … to perform the experiments, the controls with spectroscopic analyses on original material (= relic, presumed [as textile material] byssus…) and on a transparent portrait on byssus (or an useful thing obtained on byssus in order to compare spectroscopic results !). — — * * — * * — — We can consider other informations, for example, from the study: Location and analysis of byssal structural proteins of Mytilus edulis Dr. Christine V. Benedict and J. Herbert Waite Journal of Morphology Volume 189, Issue 2, pages 171–181, August 1986 Abstract >The acellular attachment organ (byssus) of the marine mussel Mytilus edulis L. Is composed of threads that emanate from the body of the mussel to adhesive discs that anchor the threads to rocks, sand and other mussels. Three proteins have been purified by immunohistological methods and located to specific regions of the byssus. A collagenous protein with subunit molecular weights of 53,000, 55,000 and 65,000 is found in the matrix of the elastic thread region. Its 73,000 MW precursor was extracted from foot glands in the area proximal to the animal body and was identified by immune cross reactivity. A cystine rich, acidic protein was found in all regions of the byssus associated with a third protein, the polyphenolic protein. The L dopa containing polyphenolic protein appears in the cortex of the entire thread and adhesive plaque and at the substrate plaque interface. Antiserum to this protein stains spherical vesicles in the phenol gland of the foot. Using immuno electrophoretic methods, the polyphenolic protein and the cystine rich protein were shown to form high molecular weight aggregates with aging of the byssus..","date":"2014-09-04","mins":"6:27 am","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-139149","author":"piero","post":"Have you tried to observe the famous bronze corpus of the Man in the Shroud created by an Italian sculptor, Luigi Mattei ? Where are the “”wrong areas/volumes” ? I think we have to take into account the dislocations of the arms, etc. If you are able to have at disposal a transparent model that would be better. You have to paint in red the areas (… or volumes, if you have a transparent model) that are considered important. Then that work would be a step towards a better understanding of your thought … One must of course be able to make good use of a three dimensional model of the body to be able to make those clarifications. — — But … I should have, myself, the same attitude for improvement of the study! Here I want to refer to the issue of nanomechanical controls of linen fibrils… How to pull a cord (the fibril) taut with the adequate frame?.","date":"2014-07-18","mins":"12:01 pm","url":"https://shroudstory.com/2014/07/18/comment-promoted-a-misalignment-between-the-left-and-right-shoulders/","cat":"comments_promoted","title":"Comment Promoted:  A Misalignment Between the Left and Right Shoulders"}]
