[{"id":"comment-195282","author":"piero","post":"From your discussion I assume that there were not present the interesting analyses with the use of advanced microscopies (AFM, CFM, SNOM) as I had already underlined back in 1998 … I do not think that our civilization is so advanced as (sometimes) instead we want to show… But here I am not referring only to the serious damage caused by terrorism, there is a disregard about the Shroud and (perhaps) the recent book by Andrea Nicolotti seems to be in this wrong line … And this does not mean I approve (in a blind manner) outlandish theories that sometimes crop up! After 17 years I’m a bit ‘pessimistic about the possibility to work in a good manner with AFM techniques on linen fibrils. I’m getting older and I do not see that I can really do something to improve the situation for real analyses on linen fibrils unless I have some concrete help… Perhaps I have to write something for BSTS newsletter Hugh, do you agree? What I can do in this regard?.","date":"2015-04-03","mins":"11:22 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-195345","author":"piero","post":"Hugh wrote: I know you are a keen advocate of your various microscopies, but I have never been clear as to what exactly they could tell us. If you could write a proposal as to how exactly you think AFM or other microscopes could add to the knowledge about the Shroud, I would be very happy to consider it. Thank you I hope to write something. Happy Easter ! — — — Now I only have a few lines to bring to your attention: In the article investigation “Il viaggio della Sindone” (= “The journey of the Shroud”) by Dante Matelli, appeared on “National Geographic” (number of Aprile 2015, which I bought a few days ago …), I have read that Prof. Barberis says that there are many definitions dates to the Shroud, but he likes the one that defines an image inexplicable, at least until now … since it emphasizes something that is really surprising: all the theories proposed to date to explain how the image on the Shroud are deficient. All the experiments that have attempted to reproduce the Shroud image copies produced by chemical physical characteristics very different from those of the original… and Prof. Barberis concluded: “In short, the process that caused the formation of the image remains unknown” This is what we have always heard… Although there are systems of investigation which have become refined [For example: I have pointed out the possibility of using the CFM (= Chemical Force Microscopy) and AFM Raman techniques…], I certainly don’t pretend to reveal exactly how it was formed the Shroud (ie: what was the exact process of the formation of the Imprint), what interested me in 1998, and the main point for which I am still very interested, is the problem of the dating of the Shroud. We can see ourselves the strange fact: after the intervention of Freeman (and its stress on the stories “Quem Queritis” …) and after the publication of this interesting book by Andrea Nicolotti, the assumptions on the date of origin of the Shroud now are made to converge to the Middle Ages because of a dating occurred on one corner of the Ancient Sheet … One angle can deny everything else we know? But is it a serious approach to the relic behave this way? I do not think so. The claim to date the Shroud talking about the transition from the Quem Queritis ceremony to the first claims by the de Charny family … I think it is a bit too. But Freeman does not seem to have these claims (if I am not mistaken), he merely states the historical problems, the same approach is taken by Nicolotti. So my proposal (ie: the use of advanced microscopies, in order to determine a credible historical range about the textile material) wants to be an answer also to these new claims (which I can not believe). I see that I am another time a bit vague (about the measurements for cellulosic DP using the AFM techniques. For example: the question of “cellulosic DP” was indicated by Marinelli and Diana before my claims about the possibility of AFM measurements, but they indicated the use of a too destructive technique!…), but I believe to have depicted the situation….","date":"2015-04-04","mins":"5:09 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-195359","author":"piero","post":"I am curious to understan what is your level of discussion around the question: “level of science for the Shroud”, because (in my opinion) I have not yet read the right answers about the AFM mechanical dating, the AFM three point bending test, multi point bending test, vibrations, etc. … — — — See for example the technical words under the address: http://www.unboundmedicine.com/medline/citation/20453278/Winkler boundary conditions for three point bending tests on 1 D nanomaterials  This reference is the: Handbook of Nanophysics: Nanotubes and Nanowires, edited by by Klaus D. Sattler >Bending tests with atomic force microscopes (AFM) is a common method for elasticity measurements on 1 D nanomaterials. >Interpretation of the force and deflection data is necessary to determine the Young’s modulus of the tested material and has been done assuming either of two classic boundary conditions that represent two extreme possibilities for the rigidity of the sample anchor interface. >The elasticity results from the two boundary conditions differ by a factor of four. Furthermore, both boundary conditions ignore the effects of deflections in the anchors themselves. >The Winkler model for beams on elastic foundations is developed here for three point bending tests to provide a more realistic representation. >Equations for computing sample elasticity are derived from two sets of boundary conditions for the Winkler model. >Application of this model to interpret the measurement of mechanical stiffness of a silica nanowire at multiple points in a three point bending is discussed. With the correct choice of boundary conditions, the Winkler model gives a better fit for the observed stiffness profile than the classical beam models while providing a result that differs from both by a factor of two and is comparable to the bulk elasticity. — —.","date":"2015-04-04","mins":"10:20 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-191810","author":"piero","post":"Here what we can read (at the end of the article I mentioned earlier) under the address: http://www.the scientist.com/?articles.view/article No/34793/title/Structure by Feel/ >… When using AFM to image molecules, researchers typically leave the tip alone and rely on sterile laboratory techniques and their knowledge of the sample. “You have to know that the only thing on the surface is DNA,” says Fletcher. “And, if you are scanning DNA but you see things that are larger than it should be and rodlike in shape, you need to know that it is not DNA Below the image (photo) we can read: > In this representation of an atomic force microscopy experiment, a single polyprotein (green) is tethered between a gold coated cover slide (yellow) and a cantilever tip (blue). The protein consists of identical immunoglobulin domains that unfold independently when a stretching force is applied. Unfolding one of the middle domains has exposed its cysteine residues, which can then form complexes with oxidase enzymes (white). Researchers in the Fernandez lab use the technique to study the process of protein folding. — — … These are special tests. Do you remember the interesting questions of structural mechanics? — — Do you know protein engineering ? Do You know anyone who is able/accustomed to using the AFM techniques for analyses?.","date":"2015-02-25","mins":"11:17 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-191552","author":"piero","post":"I agree with the prof. Barberis on the obvious fact that control tests on the samples must be non destructive… And already in 1998, I had proposed the application of SPM controls on linen samples already taken from the Shroud in the past. — — — For example: read my past message (June 2014) on “Anticipating the Conference: Giulio Fanti on SSG” Link: https://shroudstory.com/2014/06/14/anticipating the conference giulio fanti on ssg/ >… The atomic force microscope (AFM) was developed by Binnig, Quate and Gerber in 1986, following its predecessor, the scanning tunnelling microscope (STM). >Both instruments belong to a family of microscopes broadly known as Scanning Probe Microscopes (SPM). >The primary use of AFM is to quantitatively determine surface morphology at the nano scale … >The sharpness of the tip is the key determinant in the resolution of AFM imaging. … etc. … etc. ….","date":"2015-02-22","mins":"8:34 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-191884","author":"piero","post":"Sorry. Yesterday I was in a hurry. I was blocked perhaps because I was entering in biological genetic issues I was stuck going out of my field of expertise (textiles) I lost time by not talking about mechanical analyses… See, for instance: “Analysis of Indentation: Implications for Measuring Mechanical Properties With Atomic Force Microscopy” J Biomech Eng 121(5), 462 471 (Oct 01, 1999) (10 pages) Link: http://biomechanical.asmedigitalcollection.asme.org/article.aspx?articleid=1402091 Here a short excerpt from the abstract: >Indentation using the atomic force microscope (AFM) has potential to measure detailed micromechanical properties of soft biological samples. However, interpretation of the results is complicated by the tapered shape of the AFM probe tip, and its small size relative to the depth of indentation. … … Also the question of particular claims about the nuclear irradiation is interesting (but we know that Ray Rogers denied that irradiation). In the past (rejected paper for Dallas Conference, 2005) I proposed the use of AFM and SSNTD to testify the level of radiations during the experiments (simulations)… Reflections on nuclear power and levels of safety in our world (and concrete steps to enhance nuclear safety for our future) are also connected to the studies about the effect of radiation on materials. A nuclear war is a catastrophic event… For example: Have you seen the effect of nuclear bomb on a cathedral in Japan (Nagasaki)? — — Links: http://www.ccwatershed.org/blog/2013/aug/9/1949 mass ruins nagasaki cathedral/ http://www.schola sainte cecile.com/2013/08/09/et dieu essuiera toutes les larmes de leurs yeux nagasaki 9 aout 1945/ — — So… We have to show (using linen fibrils…) what happens after the use of nuclear bombs. For example: Now the situation in East Ukraine is bad but I don’t believe that the rebels or government of Ukraine or new political and economic characters who want to revive “the glorious czarist past” want to use nuclear weapons to solve their difficult geopolitic economic problems. But sometimes the History gets out of hand its protagonists. See what happened after the famous attack in Sarajevo in 1914 (= WWI). Perhaps the irradiation work can be difficult to obtain (…when we are not high level scientists or true experts in the matter). — — *** — — Here I return on my previous message. Unfortunately I don’t know what are the complete results obtained by Prof. Andy Merrywheater (a world class expert on ancient blood) on degraded DNA coming from the Shroud. Do you know what was obtained (working on small segments of DNA available for replication)? So… Here (avoiding biogenetic derives and vague protein engineering ideas…) I want to underline which were the adequate words (about linen fibrils = lignocellulosic material) to quote (speaking from a textile perspective): >… When measuring elasticity or other mechanical properties of a sample, you’ll want a softer cantilever with a low spring constant so that the cantilever can detect small change in force. Another point: >Good data depends on the quality of your experimental setup. If the sample is inert, measurements can be made with the sample exposed to air. — — Before to leave I have a very short note: Perhaps UV photographs were taken during the past operations on Holy Shroud. If there was any important information in them, I am certain that this can be useful to observe. Here an old reference: R. Gilbert Jr. And M Gilbert, “Ultraviolet visible reflectance and fluorescence spectra of the Shroud of Turin,” Applied Optics 19, 1930 1936 (1980). — — — Here the last question: Have you (included our friend Charles Freeman) observed the so called Rogers Zugibe photomicrographs? These photographs were all taken by Dr. Fred Zugibe at the Leitz facility, using the best equipment available ….","date":"2015-02-26","mins":"8:58 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-191886","author":"piero","post":"Sorry about the mistake: > they cannot can be too difficult to obtain Instead of >they cannot be too difficult to obtain.","date":"2015-02-26","mins":"9:19 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-191885","author":"piero","post":"The development of DNA analysis in our era permits some interesting controls. But the Lab works on ancient DNA are difficult. So … I cannot be the healer of “DNA Lab” workers because I am not an expert about the mitochondrial DNA (if Jesus inherited the mitochondrial DNA of his Mother Mary) … But I can be the healer about “the irradiation analyses” works because they cannot can be too difficult to obtain….","date":"2015-02-26","mins":"9:18 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-191655","author":"piero","post":"AFM microscopy is an useful tool … Advanced microscopy permitted to observe interesting features. — — — >Working with ancient DNA is very challenging, both in terms of finding sufficient material to work with after decomposition has occurred, and in terms of eliminating modern human contamination. Distinguishing between modern human and ancient genetic material is particularly difficult when the ancient DNA comes from close relatives of modern humans. Link: http://humanorigins.si.edu/evidence/genetics/ancient dna and neanderthals/sequencing neanderthal dna — — — The genetic issue is very interesting …. Do you know Svante Pääbo ? Pääbo (born 20 April 1955) is a Swedish biologist specializing in evolutionary genetics. One of the founders of paleogenetics, he has worked extensively on the Neanderthal genome. Links: http://en.wikipedia.org/wiki/Svante P%C3%A4%C3%A4bo http://en.wikipedia.org/wiki/Neanderthal Man: In Search of Lost Genomes http://www.nybooks.com/articles/archives/2014/apr/03/most us are part neanderthal/ Here the title of a book: “Neanderthal Man: In Search of Lost Genomes “ by Svante Pääbo Basic Books, 275 pp., $27.99 —————— Today I have found a paper : Nanomechanical DNA origami ‘single molecule beacons’ directly imaged by atomic force microscopy •Akinori Kuzuya, •Yusuke Sakai, •Takahiro Yamazaki, •Yan Xu •& Makoto Komiyama link: http://www.nature.com/ncomms/journal/v2/n8/full/ncomms1452.html.","date":"2015-02-23","mins":"11:17 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-191657","author":"piero","post":"Do you know direct imaging of DNA sequence by atomic force microscopy ? link: http://www.nature.com/nbt/journal/v26/n10/full/nbt1485.html.","date":"2015-02-23","mins":"11:20 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-191729","author":"piero","post":"Ancient DNA is a controversial argument. The genetic problems are complex and I think that to be sure to get credible results then we should start from material not contaminated. But the Shroud passed through many hands, and then there are also genetic fingerprints do not belong to Jesus. Read what wrote Fanti in the book … We can presume that all of Jesus’ genetic material would have come from his mother Mary and then we can try to test this hypothesis. We can presume that all of Jesus’ genetic material would have come from his mother Mary and then we can think to test this hypothesis using the samples that we can obtain. But I think that is very difficult to obtain something from what should be at disposal if we are not true expert in the specific field with an adequate Lab and a scientific team supporting the difficult enterprise. — — — I wrote the previous messages only to test the level of attention about the “Genetic Problem”… I don’t believe in hasty works of laboratory on genetic materials coming from the Ancient Shroud. Also the findings and ideas by Svante Paabo are controversial since there is not a complete consensus (if I a m right in my knowledges on that biogenetic argument)… This question is also connected with the problem of “Neanderthal mankind” (= Homo Sapiens neandertalensis). See also: A mitochondrial genome sequence of a hominin from Sima de los Huesos Nature 505, 403–406 (16 January 2014) http://www.nature.com/nature/journal/v505/n7483/full/nature12788.html >Excavations of a complex of caves in the Sierra de Atapuerca in northern Spain have unearthed hominin fossils that range in age from the early Pleistocene to the Holocene. One of these sites, the ‘Sima de los Huesos’ (‘pit of bones’), has yielded the world’s largest assemblage of Middle Pleistocene hominin fossils, consisting of at least 28 individuals dated to over 300,000 years ago. The skeletal remains share a number of morphological features with fossils classified as Homo heidelbergensis and also display distinct Neanderthal derived traits. Here we determine an almost complete mitochondrial genome sequence of a hominin from Sima de los Huesos and show that it is closely related to the lineage leading to mitochondrial genomes of Denisovans, an eastern Eurasian sister group to Neanderthals. Our results pave the way for DNA research on hominins from the Middle Pleistocene. — — — >Denisovans or Denisova hominins are an extinct species of human in the genus Homo. In March 2010, scientists announced the discovery of a finger bone fragment of a juvenile female who lived about 41,000 years ago, found in the remote Denisova Cave in the Altai Mountains in Siberia, a cave which has also been inhabited by Neanderthals and modern humans.[1][2][3] Two teeth and a toe bone belonging to different members of the same population have since been reported. >Analysis of the mitochondrial DNA (mt DNA) of the finger bone showed it to be genetically distinct from the mt DN As of Neanderthals and modern humans. >Subsequent study of the nuclear genome from this specimen suggests that this group shares a common origin with Neanderthals, that they ranged from Siberia to Southeast Asia, and that they lived among and interbred with the ancestors of some present day modern humans, with about 3% to 5% of the DNA of Melanesians and Aboriginal Australians deriving from Denisovans. >DNA discovered in Spain suggests that Denisovans at some point resided in Western Europe, where Neanderthals were thought to be the only inhab — — — Perhaps the account of Eve is an interesting and important segment of our genetic history. The Bible says that God put Adam into a deep sleep, took one of Adam’s ribs, and made a woman (Genesis 2:21 22). Adam named her Eve and proclaimed that she was “bone of my bones and flesh of my flesh” (Genesis 2:23 24). … So, how does modern science line up with this account? Were Adam and Eve identical twins? Had they each two copies of every gene: one dominant and one recessive gene? … I am not a fundamentalist, and therefore I believe that the Bible is not to be taken literally when you enter the field of Science… And you? — — We can fantasize about original sin as long as we want, Abel and Cain, etc., etc. In the past I read things like that. Those are particular issues, what seems to be interesting is what you might get from the DNA sequence of the “Man of the Shroud”. But it is difficult to hope to get something meaningful from those genetic fingerprints remained on Linen for centuries… Here I stop my long speech (sorry!) and then I stay on hold..","date":"2015-02-24","mins":"8:57 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-191730","author":"piero","post":"I have just seen that I wrote twice the phrase: >We can presume that all of Jesus’ genetic material would have come from his mother Mary and then we can think to test this hypothesis using the samples that we can obtain I wrote in a bad manner because I was disturbed … The working hypothesis about the DNA of Jesus is a controversial topic and it was done only to indicate problems… — — — Another thing: Kelly Kearse (= DNA Analysis and the Shroud of Turin: Development of a Shroud CODIS) indicated the study by Green, R.E.: “The Neandertal genome and ancient DNA authenticity”, EMBO J. 28: 2494 (2009). — — >The Neanderthal genome project is a collaboration of scientists to sequence the Neanderthal genome. >It is coordinated by the Max Planck Institute for Evolutionary Anthropology in Germany and 454 Life Sciences, a biotechnology company based in Branford, Connecticut in the United States. Founded in July 2006, the project published their results in the May 2010 journal Science detailing an initial draft of the Neanderthal genome based on the analysis of four billion base pairs of Neanderthal DNA. The study determined that some mixture of genes occurred between Neanderthals and anatomically modern humans and presented evidence that elements of their genome remain in that of modern humans. >In December 2013, scientists reported, for the first time, a high coverage genome of a Neanderthal. The genome was extracted from the toe bone of a Neanderthal from over 50,000 years ago, found in a Siberian cave. Link: http://en.wikipedia.org/wiki/Neanderthal genome project — — — Here another link (2010) about Svante Paabo: http://www.eva.mpg.de/neandertal/press/presskit neandertal/pdf/PR MPI Neandertal EN.pdf.","date":"2015-02-24","mins":"9:14 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-191809","author":"piero","post":"In 1998 I wanted to draw attention to the new advanced microscopy techniques (see also their use in explorations performed by space probes …). I have found the following title: “Structure by Feel” > … …Applying the sensitive touch of atomic force microscopy to DNA, cells, and proteins… >One major benefit of AFM is that destructive agents like fluorescent proteins need not be applied. A consequence, however, is that researchers may mistake the wrong molecule for their sample because both it and contaminating particles that get in the way are too small to see. >One way to ensure specificity is to lend the sample a “fingerprint” by engineering your protein of interest with a polypeptide that has a unique and well known repeated sequence of amino acids. As the AFM pulls the protein, one section of it will unravel in a pattern consistent with that polypeptide alone … Link: http://www.the scientist.com/?articles.view/article No/34793/title/Structure by Feel/ I’m not really an expert in molecular biology and genetics, however, I see that no one is able to achieve something concrete in this difficult field. Perhaps we still have to wait. The speeches of Kelly Kearse are very interesting, but at the moment I do not see appear new analyzes on samples from the Shroud … and this is what we all very interested. So you need to review what is the meaning of all references to genetics the humanity of the past (including relations with Neanderthals and Denisovians) and genetic heritage that has come down to modern man. If Jesus was immune from original sin (as was his mother) then his DNA could be different, but this is a long and complex speech … and then we face the problems of accurate analysis on ancient DNA. This is the key point, see also: the degradation of the genetic material and the degree of probability of correctly interpreting the data obtained. — — — Here an example : “Separating endogenous ancient DNA from modern day contamination in a Siberian Neandertal” Pontus Skoglund et al. (Edited by Richard G. Klein, Stanford University, Stanford, CA, and approved December 27, 2013) Link: http://www.pnas.org/content/111/6/2229.short Significance: >Strict laboratory precautions against present day human DNA contamination are standard in ancient DNA studies, but contamination is already present inside many ancient human fossils from previous handling without specific precautions. >We designed a statistical framework to isolate endogenous ancient DNA sequences from contaminating sequences using postmortem degradation patterns and were able to reduce high contamination fractions to negligible levels. >We captured DNA sequences from a contaminated Neandertal bone from Okladnikov Cave in Siberia and used our method to assemble its mitochondrial genome sequence, which we find to be from a lineage basal to five of six previously published complete Neandertal mitochondrial genomes. >Our method paves the way for the large scale genetic analysis of contaminated human remains. — — — Probably, in my opinion, the case of the Holy Shroud is a bit different (= no bones…) with respect the problems of “genomic analysis of contaminated fossil material”….","date":"2015-02-25","mins":"10:55 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-10021","author":"piero","post":"Yes. I have sent two proposals : – Adhesion force and AFM measurements on treated samples. – Seeking the Truth about the Shroud: Investigations on Possible Age and Image Formation. But … I have not an University degree and having not a degree it is more difficult to work in the world… In short : I failed in my attempts to receive an help. Yes, science is a serious thing, but if no one at least tries to do something then it is useless to talk … (And of course I can not do much also because I do not have a private research lab !) and then I did not obtain the useful material to show during the (U.S. Conference) two presentations … — — Instead here you can read the simple and short answer I received from the Nobel Prize (Chemistry) Henderson (yesterday) : = You can do cryo EM on any specimen as long as it is thinner than around 100 nm. And the question I posed (yesterday) to Henderson was the following : >What is your opinion about the possible use of cryo EM in the field of analyses on linen (flax) and thin layers on linen fibrils ? — — I think you know who is Dr. R. Henderson and what is cryo EM, in any case (in order “to help your readers”) there are the following excerpts from the interview : >… in a way cryo EM is just another method of finding out what the atomic structure, high resolution structure, of your molecules are. But the difference is there are quite a lot of structures in biology that were resistant, were recalcitrant to the other methods, like x ray crystallography or nuclear magnetic resonance spectroscopy. So it has opened up essentially a kind of new, previously unapproachable area of structural biology. >Imaging a material with electrons at near atomic resolution requires a thin specimen that is stable in the vacuum of the transmission electron microscope. For biological samples, this comprises a thin layer of frozen aqueous solution containing the biomolecular complex of interest. … etc. … Link: https://www.nobelprize.org/nobel prizes/chemistry/laureates/2017/henderson interview.html — — Have you read the paper “Atomic resolution studies detect new biologic evidences on the Turin Shroud” by Carlino and Fanti ? >… reproducible atomic resolution Transmission Electron Microscopy and Wide Angle X ray Scanning Microscopy experiments studying for the first time the nanoscale properties of a pristine fiber taken from the Turin Shroud. We found evidence of biologic nanoparticles of creatinine bounded with small nanoparticles of iron oxide … Link: http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0180487 — — There are several strategies for preparing samples for imaging by EM, including negative staining and cryogenic freezing… I recognize that cryo EM is an interesting technique and allows you to get useful information without damaging too much the material to be controlled. Well… I still prefer the idea to use ATR FTIR and SPM analyses on linen fibrils and thin layers (and then see also : the controls of the interesting “ghosts”). — — — What are your scientific remarks ? — — Regards, Piero.","date":"2017-10-06","mins":"3:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/08/24/a-solution-at-last-to-the-turin-shroud-based-on-my-5-years-of-continuous-experimental-research/","cat":"shroud_of_turin,","title":"A solution (at last!) to the Turin Shroud – based on my 5 years of continuous experimental research."},{"id":"comment-10028","author":"piero","post":"First of all, I do my compliments for your “bass relief imprint” (the flour imprint of your hand, “using a wet flour paste onto dry cotton”) … …although this might (perhaps) also imply interpretative difficulties about the Shroud image. And then see also the absence of cemented linen fibers (The Orphaned Manuscript, Dr. Alan Adler. See also other works ) … [Question : Are the fibers “cemented” together? The answer was : Not …] — — — Why you haven’t “the faintest clue what you are talking about” ??? I believed to be clear in my indications… Despite the various topics I mentioned, I did think I was fairly clear So… Frankly your short answer seems to me only an inadequate reply and, sorry (here no insults about your person, seen as a searcher of truth !), also a possible first sign of confusion in your mind. Then … What I have to write to you in order to explain my own ideas about the advanced controls of linen fibrils? For example : I think that AFM bending tests are the useful way to know the truth….","date":"2017-10-07","mins":"2:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/08/24/a-solution-at-last-to-the-turin-shroud-based-on-my-5-years-of-continuous-experimental-research/","cat":"shroud_of_turin,","title":"A solution (at last!) to the Turin Shroud – based on my 5 years of continuous experimental research."},{"id":"comment-10022","author":"piero","post":"I beg your pardon about my “long intervention” with the short answer received by the Nobel Prize Henderson. Here I want to underline that I think you (perhaps) had not well understood the meaning of my previous rough message around “dibenzodioxocin” … In fact you indicated “the flour imprint can then be thermally developed in an oven” and this is an interesting fact to check (and see also the other BIF pathways [for example : C.D. Indicated by Fanti, V.U.V. By Di Lazzaro, “Maillard products / melanoidins” by Ray Rogers, Robert Rucker’s radiation and the works by Colin Berry … obviously taking apart “Tipler’s sphaleron quantum tunneling” !] and the possible measurements about the “thermal degradation/decomposition depth”) because if there is not a thermal shock this compound (dibenzodioxocin) don’t decompose ( … if I am right in my rough idea…). Do you agree on that ? [Can you confirm my idea about the use of dibenzodioxocin (as a possible “spy substance”) ?] Then this is a possible way to detect what was the BIF pathway. But this “investigative way” seems to be too refined (as an analytic way to run) and other more simple controls need to be considered in order to know the possible genesis of the Imprint. I think that Raman analyses can show what is the limit of stability obtained from the experiments with linen samples thermally treated (submitted to an increasing level of energy). In other words : a set of Raman controls linked to the thermal scale… — — See also : the use of “Applied AFM Raman Archaeometry” on the supposed tablecloth (of the Last Supper) kept in Spain ( = the relic of Coria) … I think that working with a state of the art Surface Chemical Analysis laboratory, well equipped with an Atomic Force Microscopy apparel, it is possible to achieve the interesting results. See also : mechanical properties of linen fibrils, etc. — — — Contact Resonance Imaging with AFM. CR imaging can provide quantitative nanomechanical information from extremely small material volumes… Link: https://www.asylumresearch.com/Applications/Contact Resonance/Contact resonance Asylum Research AFM GIT.pdf.","date":"2017-10-06","mins":"4:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/08/24/a-solution-at-last-to-the-turin-shroud-based-on-my-5-years-of-continuous-experimental-research/","cat":"shroud_of_turin,","title":"A solution (at last!) to the Turin Shroud – based on my 5 years of continuous experimental research."},{"id":"comment-10052","author":"piero","post":"I have to add few useful words … because I am curious about the controls about the starch on linen fibrils and the possible (… or not ?) interference on blood imprint (since [in my opinion] the Holy Shroud seems to be non only an “ancient sweat imprint onto linen” …) and it was not my intent to insult you ! By the way I was going to include the word “maybe”. But, in a hurry, this clarification (unfortunately) has been lost … I say this with regard to what you had received on Saturday … and of which you complained. Here I try to explain what happened : I had not had time to see all your attempts (that is, to look right) so I referred what I found in your blog … Indeed, in truth, I had taken your words as a reference about your “bass relief imprint” (the flour imprint of your hand, “using a wet flour paste on dry cotton”) … And here’s what I’ve read (your words): > I had made a flour imprint of my hand, using a wet flour paste on dry cotton (old technology) that was flat when it went into the oven. As the temperature increased, the fabric began to heave and buckle, making a glove like 3 D version (or at any rate bas relief) facsimile of my hand … Anyway, in my opinion, my message was just a hasty writing, a short note posted with limited time … and then the result was your obvious irritation. In short, it was just an approximation of my thoughts… You should always be cautious about the exact meaning of the observations I write, which instead (sometimes) can be only approximated (and as a clear example, you can observe what I roughly wrote about “dibenzodioxocin”, that can be linked to the “resurrectional incandescence” or your “oven treatments”… ) and then now you should understand that I did not have enough time to follow everything you’ve written. Now I think I’ve been clear. — * — * — The same talk (about the approximate communication…) may apply to AFM bending controls. With those AFM controls (on very small portions of linen material) it is possible to determine if the material has been damaged by nuclear radiation, etc. But I do not think it’s okay to destroy the flax fibers to do the AFM bending tests. For example: you can use Raman spectroscopy… Depending on the frequencies investigated in the Raman spectrum, different parts of a macromolecular structure can be investigated. Low wavenumbers reveal information on macromolecular skeletal movements and the amorphous and crystalline domains in the fibre whereas higher wavenumbers can be used to investigate particular molecular species or bonds … (source : “Handbook of tensile properties of textile and technical fibres”, edited by A. R. Bunsell, Woodhead Publishing Limited, 2009). — — — Here two links about : “Dynamic AFM for soft surfaces” and “Nanomechanics with Atomic Force Microscopy” (NPL is the UK’s National Measurement Institute, charged by the UK government to carry out research into innovative new measurement techniques, technology and best practice…) Links : http://www.npl.co.uk/science technology/surface and nanoanalysis/research/analytical nanoprobes/nanoanalysis using atomic force microscopy afm/dynamic afm for soft surfaces http://www.npl.co.uk/science technology/surface and nanoanalysis/research/analytical nanoprobes/nanoanalysis using atomic force microscopy afm/nanomechanics with atomic force microscopy AFM techniques and AFM apparels seem to be useful when we have – to study the thickness of thin layer on linen fibril, adhesion of thin layers on linen fibrils, etc. …. – to obtain the maps for carboxylation ( COOH) and methylation ( CH3) degrees … etc. … — — — But before to do the “Nanomechanical measurements using Atomic Force Microscopy”, there are other useful controls to do (but these are things you probably know very well !) … Optical controls, for example : PLM Here a title : “Optical Microscopy in Forensic Science” (Dec 2009) Encyclopedia of Analytical Chemistry [chapter : Forensic Science] Lori J. Wilson, Barbara P. Wheeler — — Otherwise, the use of vibrational spectroscopies : ATR FTIR (see also the penetration depth) and Raman analyses. Both analytical techniques are sensitive to the structural changes in the materials and can show us what is the situation of linen fibres. Taking apart the works by Fanti and Malfi, I have found the following reference: “Application of FTIR and Raman Spectroscopy to Qualitative Analysis of Structural Changes in Cellulosic Fibres”, published on Tekstilec, 2012, letn. 55, št. 1, str. 19–31 Link: http://www.tekstilec.si/wp content/uploads/2012/01/Application of FTIR and Raman Spectroscopy to Quantitative Analysis os Structural Changes in Cellulosic Fibres.pdf —*—*— Another alternative is the use of High Resolution Transmission Electron Microscopy … on linen fibrils (cellulosic chains, hemicelluloses, lignins, etc). Then see also the cryo EM (… with microscopic investigations that require less damages caused by radiations with respect the normal TEM controls) and think to the thicknesses of the samples to submit to the cryo EM investigations … and the spy molecules. At the end “the unsolved problem” : How to accurately visualize flexibility in macromolecular structures ? — — — I am still curious to know what were the results obtained from the Raman controls performed in 2002 (fifteen years ago!) on the Holy Shroud of Turin… Also I am curious to know what can be the results obtained using AFM and Raman controls on residual sample (from the 14 C dating of the Shroud of Turin) kept in by Timothy Jull. … In an y case I will be happy to see (at least) an UV image of the Arizona sample because the photographs taken in the past by Barrie Schwortz (available online) din’t show the UV images. — — — … Archaeometry – also known as archaeological science – is the application of scientific methods and techniques to archeological investigations…. I think we have to deal with “Textile Archaeometry and Analytical Techniques”… * * * * * * * * * * * * * * * * * * * * * * * * * * * Regards, PI.","date":"2017-10-09","mins":"5:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/08/24/a-solution-at-last-to-the-turin-shroud-based-on-my-5-years-of-continuous-experimental-research/","cat":"shroud_of_turin,","title":"A solution (at last!) to the Turin Shroud – based on my 5 years of continuous experimental research."},{"id":"comment-200668","author":"piero","post":"Daveb wrote: >There will never be another STURP, the Italians have seen to that, with their own peculiar agendas. Why? See, for example, what is possible to do with using new nanomechanical techniques: >The Nano Tensile automated test system enables simplified tensile testing by providing materials researchers with a state of the art instrument that solves various scale related challenges involving exceedingly small specimens… Links: http://www.hysitron.com/Portals/0/App%20 Notes/nano Tensile%205000%20 Sell%20 Sheet.pdf http://en.wikipedia.org/wiki/Hysitron — — Here another vague reference: >Modulus mapping is a technique to map and display the mechanical properties of a material surface through joint actions of dynamic mechanical testing (nano DMA) and in situ SPM (scanning probe microscopy) imaging. A high frequency sinusoidal force is applied to the indenter probe while it is being raster scanned over a sample surface. The resultant displacement of the indenter probe at each pixel position then is analyzed for amplitude and phase lag from the dynamic force input signal. As a result, storage modulus, loss modulus and tangent delta of the material surface are quantified at each pixel position and displayed in a colored image. Link: http://www.ebatco.com/modulus mapping.html — — Then I think is possible to test the precious samples (ancient linen fibrils) in a better manner with respect what was able to do prof. Giulio Fanti in the past. I believe that this will also allow you to cut away all the lies that have been said about the alleged painting, etc. … etc. I have confidence in the tools of modern science (when these tools are well applied in research on the Shroud). — — Unfortunately I have successfully completed only some subjects of the course in Textile Engineering and therefore I have not earned that degree in Engineering ….","date":"2015-05-31","mins":"7:47 am","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"id":"comment-198773","author":"piero","post":"Indigo has a very strong affinity for wool, silk, cotton, and linen… I have read that: >Indigo blue is converted by oxidizers, e. G., nitric acid, into yellow red, crystallizable isatin (C16 H10 N2 O4) … So… Have you tried to do the interesting experiments using “linen dyed with indigo” treated with nitric acid? I am curious to see what happens. But I have found only few links… — — — Under another address I have read: >… Indigo plus nitric or chromic acid apparently produces isatin plus anthranilic acid, plus a bunch of other degradation and condensation products. >This is probably why isatin has not been commercially produced from indigo anytime in the twentieth century, because other syntheses are much more practical. … … Link: http://www.sciencemadness.org/talk/viewthread.php?tid=2653&page=2 Here another vague reference: >Isatin (1 H indole 2,3 dione, Figure 1) was first obtained by Erdman and Laurent in 1841 as a product from the oxidation of indigo by nitric and chromic acids. … >… In nature, isatin is found in plants of the genus Isatis … etc. … Link: http://www.scielo.br/scielo.php?script=sci arttext&pid=S0103 50532001000300002 >Isatin C 8 H 5 NO 2, in chemistry, a derivative of indol, interesting on account of its relation to indigo; it may be regarded as the anhydride of ortho aminobenzoylformic or isatinic acid. It crystallizes in orange red prisms which melt at 200 201Â° C. It may be prepared by oxidizing indigo with nitric or chromic acid (0. L. Erdmann, Jour. Peak. Chem., 1841, 24, p. II); by boiling ortho nitrophenylpropiolic acid with alkalis (A. Baeyer, Ber., 1880, 13, p. 2259), or … … Link: http://www.theodora.com/encyclopedia/i/isatin.html.","date":"2015-05-10","mins":"8:09 am","url":"https://shroudstory.com/2015/05/10/colin-berrys-method-and-3d-information/","cat":"other_blogs","title":"Colin Berry’s Method and 3D Information"},{"id":"comment-10031","author":"piero","post":"Here the vague references about an “AFM bending test” : 1 – ” Elastic Modulus of Single Cellulose Microfibrils from Tunicate Measured by Atomic Force Microscopy” Shinichiro Iwamoto, Weihua Kai, Akira Isogai and Tadahisa Iwata Link: http://pubs.acs.org/doi/abs/10.1021/bm900520n and here two very short excerpts from the abstract : >… The nanocellulosic materials were deposited on a specially designed silicon wafer with grooves 227 nm in width, and a three point bending test was applied to determine the elastic modulus using an AFM cantilever. … >… … The result showed that the experimentally determined modulus of the highly crystalline tunicate microfibrils was in agreement with the elastic modulus of native cellulose crystals. — — — 2 – “Measurement of the elastic modulus of spider mite silk fibers using atomic force microscopy” Stephen D. Hudson, Vladimir Zhurov, Vojislava Grbic, Miodrag Grbic, and Jeffrey L. Hutter published on “J. Appl. Phys.” 113, 154307 (2013). And, please, read the following excerpt : >… … To determine the mechanical properties of adult and larval Tetranychus urticae silk fibers, we have performed three point bending tests with an atomic force microscope … … Link: http://www.nanomitech.com/uploads/1/1/2/8/11288642/measurement of the elastic modulus of spider mite silk fibers using atomic force microscopy. m.grbic.pdf — — 3 – there is a book titled : “Natural Fibre Composites: Materials, Processes and Properties” Alma Hodzic,Robert Shanks Woodhead Publishing, 13 feb 2014 – 408 pages — — — … … … … etc. … etc… … So … I think (taking apart the fact that tunicate or spider silk are not a well known textile material…) that AFM is not only a sort of psychical “fixation”… Regards, PI.","date":"2017-10-07","mins":"4:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/08/24/a-solution-at-last-to-the-turin-shroud-based-on-my-5-years-of-continuous-experimental-research/","cat":"shroud_of_turin,","title":"A solution (at last!) to the Turin Shroud – based on my 5 years of continuous experimental research."},{"id":"comment-138744","author":"piero","post":"Here I do not discuss the authenticity, but I stress the issue of attempts to understand the formation of the Image on the Shroud and the inherent limits on imagination… Why was ruled out the idea of the ancient electrical device? What is the power required for the condensator (like the Ark of the Covenant) in order to work on linen sheet? I am curious to read what will be proposed in Bari. We have already seen that even in ancient times were able to build some interesting mechanical device (for example, see : Antikithera) and therefore they could be aable to do something in the electrical field … or not? Try to see what Tesla said about the Ark of the Covenant (But … that was really his own opinion on that biblical enigma? … Or his thinking has been distorted?). However, I say this only speaking from the point of view of the conjecture, in fact the Ark of the Covenant has never been found. So I can not believe much in that particular idea. But I’m curious about the mental mechanisms of investigation and discussion (involving the relationship between religion and science) put in place. The Ark of the Covenant (or a suitable substitute its electric) may have been an interesting source of external energy (see, the past attempt by Judica Cordiglia, who used 90,000 volts of electricity to create an image !), but this is different from the internal power source: the Body of the Dead, as in the original idea [if I’m not mistaken] Giulio Fanti. This is the key point, and yesterday I wanted to remind you of this alternative, which for now is just a fantasy without any archaeological evidence … — — Another question: Radon concentration determination and effect on linen sheet (IMO : there is nothing after 36 hours and without applied electrical discharges !). It’s possible to use alpha detectors applied over linen sheet that covers a plastic dolly. When hit by an alpha particle the material responds becoming black, at then, at end you obtain the interesting corporal map. We have read that : >the fluency of alpha particles would have created an image (on the cloth) of the body of Jesus. So … What was the radon concentration plateau required to obtain an image ? Probably we have to control that statement measuring what happens : from zero radon concentration to a certain threshold, using a “Radon sand trap” over the linen sheet … If we want to continue the joke with a cocktail of radon daughter nuclei accumulation (and electrical charges and alpha particles) we can guess something about the use of an ancient electrical device (the famous biblical Ark of the Covenant) … But (at present) this is only a foolish attempt to explain the unknown origin of the mysterious Image using the Phantarchaeology, like “the method” used in the past by von Daeniken and Peter Kolosimo … See also the strange question of Chronovisor and Father Pellegrino Ernetti (and the inherent criticism by Massimo Polidoro [a member of an italian organization : CICAP] and Silvano Fuso). Attempts to explain the Unknown with other misteries … — — Unfortunately in my previous intervention dated : July 14, 2014 (and the subsequent hironical additions) there was a sort of pseudoscientific description of Dating Problem with a collection of defective statements… and the confusion augmented because the hierarchical structure of linen fibrils was not remembered and discussed in connection with the AFM investigations… Well : don’t imagine that I can accept such as thing … In any case (and with all due respect to Prof. Lattarulo, Prof. Carpinteri, etc.) the earthquake (or the effect of lightning or neutrons emission in association with an earthquake) seem to be a foolish hypothesis because the effect on linen sheet are easily understandable … (= smearing and blurring the sheet) … but that fact didn’t happened. Why? So we can argue that presumed earthquakes (… if they happened, see also [for instance] the question of lack of serious scientific investigations into the grotto under the Temple and in Ezekiah’s tunnel…) were not involved in Image Formation … ———————— Materials Science and a strange question to solve : Is it possible to work [in order to obtain the useful statue] using the concrete containing a good amount of autunite ? … and , at the end, we have to calculate the time required to obtain a decent image ….","date":"2014-07-16","mins":"12:50 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","title":"A Telling Interview with Giulio Fanti"},{"id":"comment-138902","author":"piero","post":"You wrote: > I suspect that the process may be so complex, that the use of Occam’s razor here to isolate a single cause is unlikely to enlighten the true cause of the image. So… I think the best way to learn something really useful is the careful analysis of linen fibrils using advanced microscopy (AFM, CFM techniques) and spectral controls (Raman analyses). — — Radon and effect on linen. >Radium 226 and Radon 222 are both produced during the decay of Uranium. Radon is considered the most hazardous, because as a gas we breathe it into our lungs where it can attach until it decays. Luckily, Radon only has a 4 day half life, which limits the build up in a basement or from a concrete wall. Unluckily, Radon only has a 4 day half life, which means it is extremely radioactive. But … Where are the advanced controls on the linen samples treated by De Liso ? At present I see nothing… — — … … And for the EQ Ls = Earth Quake Lights, please, read under : http://en.wikipedia.org/wiki/Earthquake light >The most recent model suggests that the generation of earthquake lights involves the ionization of oxygen to oxygen anions by breaking of peroxy bonds in some types of rocks by the high stress before and during an earthquake. >After the ionisation, the ions travel up through the cracks in the rocks. >Once they reach the atmosphere these ions can ionise pockets of air, forming plasma that emits light … Here another link: http://www.eurekalert.org/pub releases/2014 01/ssoa ell122013.php Reference: Thériault, R., Freund, F.T. & Derr, J.S. (2014). Prevalence of earthquake lights associated with rift environments. Seismological Research Letters, volume 85 1, Jan–Feb issue, 2014.","date":"2014-07-17","mins":"7:58 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","title":"A Telling Interview with Giulio Fanti"},{"id":"comment-6208","author":"piero","post":"First of all: I admit that I arrive with my message very late … Sorry! I think the problem of bleaching is still interesting. For example: I have never seen a comparison about colored linens from Di Lazzaro and samples (from these linens) that were subjected to Na Cl O bleaching. Most likely there is a difference between the linen samples treated with “Xe Cl laser” (308 nm) and those with “Ar F laser” (193 nm). But I think that a certain amount of color is still visible (although, probably, with a reduced contrast with the surrounding areas). In other words there is only a partial bleaching. I understand that you cannot work on VUV excimer laser treated samples, but you can try to do something on CD (= Corona Discharge) treated linens because this is a more easy way to treat the textile material… If you cannot work, then try to ask a treated linen sample to Di Lazzaro and/or Fanti. I am interested in discussions about this work because we can guess something about the depth of color penetration. For example: probably with a Xe Cl Laser [308 nm. Result= brownish color. Instead (if i am right) an “Ar F laser” produces a yellowish coloration…] there is a more deep penetration. What is your opinion? Have you an idea how to treat treated (and/or irradiated) linens in a washing machine? Link: http://www.frascati.enea.it/fis/lac/excimer/labeccimeri eng.html I think the same color permanence may apply for what obtained Fanti with his system (= Corona Discharge). An easy test: See also the use of a crockmeter or a fingertip, rubbing the images obtained on linen (with an adequate pressure) … The Crockmeter provides a quick and accurate method to determine the amount of color that is transferred by rubbing textile materials to other surfaces. The Crockmeter was originally designed to simulate the action of a human finger. The rubbing action is provided by a “finger” which moves back and forth in a straight line with each complete turn of the crank….","date":"2015-08-19","mins":"3:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/08/03/is-the-shroud-of-turin-really-just-18-years-short-of-its-2000th-birthday-see-this-blog-for-a-daily-acerbic-overview-of-current-wrangling-currently-2015-week-32/","cat":"uncategorized","title":"Is the Shroud of Turin really just 18 years short of its 2000th birthday?  SEE THIS BLOG FOR A DAILY ACERBIC OVERVIEW OF CURRENT WRANGLING ( currently 2015, Week 32)"},{"id":"comment-57461","author":"piero","post":"Dear friends, I believe that Giulio Fanti can improve the system using the NEMS … The nanoelectromechanical way ! What is yourt opinion ? Do you know the NEMS, the Nano Electro Mechanical Systems ? — — Here the World’s Smallest FM Radio Transmitter … link : http://www.sciencedaily.com/releases/2013/11/131118091502.htm > … … Graphene, a single atomic layer of carbon, is the strongest material known to man, and also has electrical properties superior to the silicon used to make the chips found in modern electronics. The combination of these properties makes graphene an ideal material for nanoelectromechanical systems (NEMS), which are scaled down versions of the microelectromechanical systems (MEMS) used widely for sensing of vibration and acceleration. … … >Graphene NEMS can address both problems: they are very compact and easily integrated with other types of electronics, and their frequency can be tuned over a wide range because of graphene’s tremendous mechanical strength. … … >For this study, the team worked with research groups from the School’s Departments of Mechanical Engineering, Electrical Engineering, and Physics. This work is supported by Qualcomm Innovation Fellowship 2012 and the U.S. Air Force, using facilities at the Cornell Nano Scale Facility and the Center for Engineering and Physical Science Research (CEPSR) Clean Room at Columbia University. — — Question : How to work in order to discover the truth about the linen fibrils ? Answer : We have to solve the inherent enigma ! … — — link : http://www.jhunewsletter.com/2013/12/06/smallest fm radio will revolutionize cell phones 97671/ >… Hone and Shepard’s team harnessed these properties to build a specific graphene NEMS known as a voltage controlled oscillator. This system was able to generate a FM signal with a frequency of about 100 hertz, which is in the middle of the FM radio band. They observed that the signal from the graphene could change the frequency of low frequency musical signals, which could then be detected by an FM radio receiver as ordinary as a car radio or a walkie talkie. … — — So … There is a lot of work to do … Then : we have to know the Applied Statistics ! — — Cheers ….","date":"2013-12-09","mins":"1:45 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57463","author":"piero","post":"I prefer the non destructive way. I indicated the use of the AFM, CFM and SNOM in 1998 … — — In any case the depolymerization of cellulose due to the heat is an interesting problem and then we have to see what are the differences. I am curious to read your opinions … and … not “yourt opinion” (Sorry. I beg your pardon !) >… Like any other new technology, the system still has its bugs. Hone and Shepard are currently working to reduce unwanted signals produced by the graphene NEMS and integrate the system into silicon integrated circuits and microchips. This would make the device even smaller..","date":"2013-12-09","mins":"1:51 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-70528","author":"piero","post":"Vanillin test (= Wiesner test) in itself is not the true solution … The new nondestructive dating technique (that I indicated in 1998) is based on SP Ms (= Scanning Probe Microscopies = AFM, CFM and SNOM ) … — — — So … If we want to improve the controls we can use both SPM and NEMS … or/and SPM and nano Raman controls … In any case : it’s difficult to be completely nondestructive when we work with the samples….","date":"2013-12-31","mins":"9:56 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-212047","author":"piero","post":"About three or four hours ago, my eye is accidentally dropped on a page of a modern “general encyclopedia” that claimed it was 10 or 12, the value for the “maximum number of components on mass spectrometry analysis” … Is that fact an example of “significative coincidence”?.","date":"2015-10-08","mins":"10:01 am","url":"https://shroudstory.com/2015/10/08/new-posting-by-joe-nickell-at-cfi/","cat":"other_blogs","title":"New Posting by Joe Nickell at CFI"},{"id":"comment-212055","author":"piero","post":"This seems to be “a banal problem of Materials Science”… In any case the presence of Squalene on “1 EB” sample can be a possible “interesting fact” (but this has few [or nearly nothing] to do not with the “strange claims” by Bella, Garlaschelli and Samperi…on “polyethylene oligomers”) because the main component of human sebum is squalene, an unsaturated lipid … In human sebum there are unique lipids, such as squalene and wax esters not found anywhere else in the body nor among the epidermal surface lipids. >Human sebum consists of squalene, esters of glycerol, wax and cholesterol, as well as free cholesterol and fatty acids. Link: http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2835893/table/T1/ — — See also: the squalene and cholesterol content of sebum and the possible function of squalene in human sebum… Here it is not my intention to enter in particular “Photobionics speculations” (on Squalene and UV role)… And it is not my Intention to intimidate or frighten you with possible “goofy ideas”….","date":"2015-10-08","mins":"10:46 am","url":"https://shroudstory.com/2015/10/08/new-posting-by-joe-nickell-at-cfi/","cat":"other_blogs","title":"New Posting by Joe Nickell at CFI"},{"id":"comment-212051","author":"piero","post":"I think that, obviously, the encyclopedia was referring to the numbers 10 or 12 as the maximum number of identifiable substances IN A MIXTURE of ten or twelve chemicals … And now I ask: Where are the opinions of real experts of mass spectrometry?.","date":"2015-10-08","mins":"10:19 am","url":"https://shroudstory.com/2015/10/08/new-posting-by-joe-nickell-at-cfi/","cat":"other_blogs","title":"New Posting by Joe Nickell at CFI"},{"id":"comment-213641","author":"piero","post":"John Klotz wrote: “…We really risking the extinction of humanity becasue of our abuse of the environment. ..” Impact of Earth by an asteroid would be sensational and possibly cataclysmic. … Link: http://www.permanent.com/asteroids impact earth neo.html …But we also know the consecration of humanity to the Sacred Heart of Jesus. Consecration of the Human Race to the Sacred Heart of Jesus. Link: http://www.catholic.org/prayers/prayer.php?p=26 So the question can be turned in the following possible future problem to solve: “Jesus, the Redeemer of the human race and the possible salvation (against the NE Os), with an escape on planet Mars of few people…” Sorry for these strange and vague speculations about the “future escape on Mars”, etc..","date":"2015-10-26","mins":"12:52 pm","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-213422","author":"piero","post":"“…Blood on Hair is the Trade Mark of Authenticity of the Shroud of Turin. This is the best evidence to prove that image was formed due to Radiation….” Subject: Blood on hair and particular claims (about Radiations […and then: What kind of radiations? …IR, UV, VUV or … what?]). I think there is an old paper to take into account (= to discuss): “Blood on the Shroud of Turin: Part III. The Blood on the Face” by Gilbert R. Lavoie, Bonnie B. Lavoie and Alan D. Adler The purpose of that paper was to show that the blood marks actually originated from blood streams on the Face. Link: in https://www.shroud.com/pdfs/ssi20part4.pdf. Although I am a bit perplexed about the following claim (see in “four things” = point n. 3, in that paper): “…. The body image could not have been produced by any mechanism based on a contact process….” in that study there is not a direct claim regarding the idea “that image was formed due to Radiation”. Am I wrong? And, at the end of the same old paper (by Lavoie and other researchers) we can read: “… … cheeks and beard on the Shroud image do not exhibit the blood marks that must have been on the face of the man under the Shroud. …” So, it seems to me quite obvious to observe that, here (in that statement/phrase), it was not considered the probable role (= a preemptive cleaning of the Face) of Sudarium of Oviedo… Instead we can quietly agree on the fact that the blood marks and the facial image were mainly produced by two different mechanisms, because this seems to be a fact supported by chemical analysis of the Shroud. But we have to be cautious (before to fly with possible imagination/fantasy instead to start from a set of exact analytical data…) because we have not at disposal further and careful analyses regarding the Image on linen sheet (see also, for example: Raman analyses [in Turin, by Renishaw, 2002] perhaps [or probably?] failed, etc.) in order to pronounce a “scientific verdict” on BIF (= Body Image Formation)… I am open to the possibility of scientifically prove the existence of the miracle (…or maybe more miracles!) for that ancient funerary drape, but we must try to be more correct when we write. Is that remark a “toxic input” for your brain?.","date":"2015-10-23","mins":"9:56 am","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213642","author":"piero","post":"…with an “electrically powered spacecraft propulsion system”? Link: https://en.wikipedia.org/wiki/Electrically powered spacecraft propulsion I think we have to improve our own observations….","date":"2015-10-26","mins":"12:55 pm","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-213707","author":"piero","post":"Sorry… I was in a hurry. For sake of clearly I want to add my correction: At least we have to exactly define what is the limit for the phrase : “‘major damage’ to the bloodstains…”.","date":"2015-10-27","mins":"12:40 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213702","author":"piero","post":"HF wrote: > …The UV images show a pronounced halo of ‘serum’ around the tip of a fingerlike bloodstain emerging from the wrist wound, and another along the top edge of the spear wound. … What occurs when the skin is “pinched” between two ropes? I believe the result is an ecchymosis. So… What is the inherent image that we can observe on that ancient linen ? I believe we can try to deepen also this problem….","date":"2015-10-27","mins":"11:14 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213706","author":"piero","post":"It’s very interesting to read something about the relics of the Grande Châsse … Now I have just find your study: “The Shroud of Turin and the Sainte Chapelle of Paris (M. Latendresse)”… >The Mandylion was kept in its original Byzantine reliquary for about a century in the Grande Châsse of the Sainte Chapelle, then given to Geoffroy de Charny by King Philippe VI de Valois as a gift for his great services to France. … Link: http://www.sindonology.org/sainte chapelle.shtml But I would also be curious to know what is the idea by Alessandro Piana regarding your “thesis of the Sainte Chapelle”. >… In the inventories, except for inventory A which has a special status, the first relic listed is always the Crown of Thorns, which was indeed considered the most precious relic at the Sainte Chapelle. …. Then (perhaps) dating the Crown of Thorns (…using a non destructive way of dating !) we can try to improve our level of knowledges. We can think to be very lucky if we’ll find some trace of blood on that Crown of Thorns. Which can be the resolution (on the linen cloth, the Shroud) regarding the thin holes into the Head (holes that come from the Crown of Thorns)? …and onto the other relic, the Sudarium of Oviedo ? If anyone has ever worked I have to admit: there is a lot of work to do…! In any case, I can agree: it’s also highly disputable the following phrase: “…there is no ‘major damage’ to the bloodstains…”.","date":"2015-10-27","mins":"12:35 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-214200","author":"piero","post":">The first representations of the loros are on coins from the reign of Justinian II (r. 685–695 and 705–711). Is that information right or wrong? Probably the work “Reconstructing the Reality of Images: Byzantine Material Culture and Religious Iconography 11 Th 15th Centuries” cannot answer about that ancient epoch of Justinian II ….","date":"2015-11-04","mins":"11:34 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-213759","author":"piero","post":"Mario, I regret the fact that yesterday I contributed to stir your controversies (between you and Alessandro Piana) with the main argument (= the Critical Summary document)… This is here said for the sake of clearness. — — — >Pressed on all sides, the Latin Empire was facing serious financial difficulties, and, in 1237, Baldwin II … The entrance of the Crown of thorns in the capital (where it is deposited to the Palace in Saint Nicolas chapel, August 18, 1239), was the subject of great public ceremony all the way from Saint Denis. >In 1241, a new set of relics, including the True Cross, joins this first assignment. … Link: http://www.sculpturesmedievales cluny.fr/collection/sainte chapelle.php The, one has to wonder what is behind all this activism….","date":"2015-10-28","mins":"12:28 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213840","author":"piero","post":"Errata corrige: >Then, one has to wonder what is behind all this activism… Instead of: >The, one has to wonder what is behind all this activism… — — — *** — — — I am very sorry for the superficiality of my previous interventions, this was due to problems of lack of time available. I then tried to think about the behavior of Dr. Piana, perhaps his tendency to versatility (here I refer to his books about Rennes le Chateau, the Baphomet, etc.) may explain why he wrote with a certain “inclination to superficiality” what may appear a challenge on Medieval History to scholars as Mario Latendresse or other. Sorry… Here I have no sufficient time to unduly deepen these other stories… See also, for example: the question of a [false/faked] letter sent by Theodore Theodore Angelus Comneno to Pope Innocent III [August 1205] that appears at Chapter 5 [The Fourth Crusade] of his book (italian title : “Sindone gli anni perduti”, Sugar Co editions, 2007. I have bought this book eight years ago… ). …And here, perhaps, Dan Scavone doesn’t agree… I have no obiections against the attempts of a curious “polyhedrical writer” (who wrote about Rennes le Chateau, Carol [the enigmatic oeuvre of Louis de Coma], etc.), but I want to know where is the Truth… — — — — B.T.W.: Do you know what is “Carol, the enigmatic oeuvre of Louis de Coma, a priest who was at least as enigmatic as Rennes le Château’s Saunière” ??? Sorry… Here I have no sufficient time to unduly deepen these other stories….","date":"2015-10-29","mins":"12:38 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-214198","author":"piero","post":"Subject: “The lock of hair on the forehead”. Yes. I have to admit : this Face (on that ancient coin) has not a strong evidence for “epsilon” sign, but there is a feeble trace about a lock of hair, maybe a little bit as you can see it in the image of the Holy Face of Manoppello… Can be the Holy Face of Manoppello the “better alternative more readily available” (See also: the message by “daveb of wellington nz”)? But observing the detail of “a hair lock in the middle of the forehead” of the Holy Face of Manoppello we can conclude this Face on the coin is not very similar to the Manoppello’s Veil. Perhaps the dimension of the area was too little and then difficult to exactly work during the coinage for this coin. At the end I have some residual doubt… On the image shown by Nabber the Epsilon seems to be mislocated, only the eyes seem interesting. BTW: Yesterday I saw a child with red eyes and swollen ….","date":"2015-11-04","mins":"11:27 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-164364","author":"piero","post":"Folding and unfolding the centuries passed… I have four question to pose : How fast do linen fabrics age in the museum environment? How fast do linen fabrics age in a sealed environment? How fast do linen fabrics age in an argon environment? How fast do linens age with ironing? In a previous message I vaguely indicated the idea of CNC and AFM controls on these celluloce crystals. But I think we have to work more seriously about “signature of ageing”, cellulosic DP, CNC and inherent controls. Unfortunately today I have lost an entire message (about “signature of ageing” in linen and AFM controls). I am not a false prophet to persecute… I’m just a seeker of the truth about the age of the Shroud cloth and, until now, I have not a graphene based, carbon layered electrode array (CLEAR) device into my brain. Link: http://www.kurzweilai.net/transparent graphene based sensors open new window into the brain (webpage retrieved with Google using “signature for aging”… without “AFM”…) Perhaps Kurzweil has become a false prophet with his interests and his proposals, however I would not want to interfere with his research (as long as it is ethically correct … and here I have some doubt…). My past post on Kurzweil and his ambitious (or perhaps vain) attempts to create “artificial consciousness” (do you remember?) was truncated because someone disturbs me… Unfortunately I do not know the reasons for such incredible nuisance when I write (directly) on the blog by Dan. Is that a robotic control? A Kurzweil device?? — — I have read that: >Rageh Omaar and John Jackson suggest that linen has some sort of memory for creases thanks to permanent deformation of the linen fibres. Then, ironing a linen sheet, linen “memory for creases” can be changed … If I well remember Eng. Fanti used an ironing treatment on some linen sample submitted to CD. — — Other little things: I am curious to see what is the exact “scattering effect” of UV excimer laser. Is it possible to obtain a calibration using sand dusts and impurities with different kind of granulation? In other words: Which kind of halo? What is the exact result from the UV light shining on linen ? The differences in reflection due to the scattering effect can be detected using optical and AFM controls. So… we require new and adequate works ….","date":"2014-10-21","mins":"12:26 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-208570","author":"piero","post":"I admit that Colin Berry has done some work (and with optical microscopy images), instead we are often dealing only with long discussions… But… Where are advanced controls and comparisons about thin layers on treated linens? In any case : “…something which has the same characteristics as the Shroud.” is not the Shroud because (really) it’s something which has NEAR “the same characteristics as the Shroud”, but it IS NOT the Shroud … and then this is a glaring truth. See also another problem: >Often I indicated the AFM three point bending test (a test useful in order to measure the Young’s modulus). Link: https://shroudstory.com/2015/06/29/ces convention in crdoba cabra this october/ Provisional conclusion. Garlaschelli is very smart but we must be more serious when dealing with a topic such as the Shroud (= a great treasure of Faith).. So… Here we are very far from the previous analytical problems/levels (= AFM three point bending test, AFM analyses, etc.)… But one thing is now clear: No one works for nothing … Unless someone follows my “analytical sermons” and then want to really works, with a set of new tests on linen fibrils coming from the Shroud, etc.! Perhaps this can be done by a team that works “for the glory” and then not want money … or a team that is really adept at finding funds (but without stealing USB keys of mine …)..","date":"2015-08-19","mins":"9:51 am","url":"https://shroudstory.com/2015/08/19/why-not-luigi-garlaschelli/","cat":"paper_chase","title":"Why Not Luigi Garlaschelli?"},{"id":"comment-208574","author":"piero","post":"Was Garlaschelli able to solve the nub of the Enigma? Until now I have found nothing of new (about Garlaschelli) surfing the Web. Have you found any interesting link? Am I just a sort of berimbau de barriga singer? … and this has been told in reference to AFM three point bending test… Link: https://en.wikipedia.org/wiki/Berimbau.","date":"2015-08-19","mins":"10:38 am","url":"https://shroudstory.com/2015/08/19/why-not-luigi-garlaschelli/","cat":"paper_chase","title":"Why Not Luigi Garlaschelli?"},{"id":"comment-49904","author":"piero","post":"Before to work perhaps you have to be able to look something in Italy … (or in Europe !) … There are the following links : http://www.nanoxm.it/wp content/uploads/2011/09/depliant en small.pdf http://www.nanoxm.it or (better) : http://www.nanotechitaly.it/ >The sixth edition of Nanotech Italy opens a window onto so called KE Ts, the Key Enabling Technologies defined by the Horizon 2020 program. The conference will demonstrate how they are essential, along with nanotechnology, to promote competitiveness and innovation in priority areas for the international economy, encouraging the meeting of researchers and academics with the industrial world … and this is the interesting link : http://www.nanotechitaly.it/wp content/uploads/2013/10/Nanotech Italy2013 Program.pdf = Nanotechnologies for the Textile Industry by Paolo Canonico — — — See also : http://www.textile platform.eu/structure/ http://www.textile platform.eu — — I hope in your interesting comments !.","date":"2013-11-04","mins":"11:36 am","url":"https://shroudstory.com/2013/11/01/stephen-jones-on-antonaccis-latest-the-vatican-would-probably-want-to-see-a-broad-consensus/","cat":"uncategorized","title":"Stephen Jones on Antonacci’s Latest:  the Vatican would probably want to see a broad consensus"},{"id":"comment-175707","author":"piero","post":"Excuse me, but unfortunately I have to do a fix yet! For dyeing with anionic dyestuffs, the treated substrate was rolled up and rotated at a temperature of 20° 60°… Instead of: For anionic dyestuffs dyeing the treated substrate was rolled up and rotated at a temperature of 20° 60°… — — — I have found a text: Handbook of Biological Dyes and Stains: Synthesis and Industrial Applications R. W. Sabnis ISBN: 978 0 470 40753 0 A complete, up to date resource of information on more than 200 dyes and stains Handbook of Biological Dyes and Stains is the most comprehensive volume available on the subject, covering all the available dyes and stains known to date in the literature for use in biology and medicine. Top dye expert Dr. Ram Sabnis organizes the compounds alphabetically by the most commonly used chemical name. He presents an easy to use reference complete with novel ideas for breakthrough research in medical, biological, chemical, and related fields… — — Unfortunately I have not read this text… and … we’ve all had the experience of someone lying to us… In any case I am curious about the effect of washing the polyamide samples (polyamide samples dyed … or only stained) with biological detergent liquid… and see what happens. So, I suggest to you to read also other chemical (or bio chemical) texts….","date":"2014-12-11","mins":"9:16 am","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","title":"Remembering Ray Rogers at the St. Louis Conference"},{"id":"comment-175701","author":"piero","post":"Louis, Yesterday I have appreciated your attempt to clarify. We should avoid (as much as possible) the cult of personality and I believe Rogers himself would have agreed with us on that on this behavior more moderate … In any case [if I am right] Barrie Schwortz wrote that Ray was graduate, but Colin disagreed about the ability by Ray Rogers to do advanced research (perhaps because Rogers “was not “Dr.” Rogers or “Professor Rogers” but Mr. Rogers” …) But … Now I ask to you: “Please, for Jospice Imprint… doesn’t speak only about Parapsychology, there are also questions regarding Chemistry and Materials Science. First of all: the mattress was made of Polyamide and then it was not polypropylene.” Sorry… I don’t believe you was able to search the entire truth because you refused to take into account the cold dyeing of polyamide. Through doing and learning, people acquire their beliefs and attributes. Here we are not hooded and fanatic persons. Here the story: >At 5.55 a.m. Les died. >At that point, no one could have guessed how important Les’ death was to become. >When other nursing duties had been completed, Les’ body was washed and prepared for the undertakers who arrived at approximately I 1. 00 a.m. [My note: It seems to me that here there is a problem of exact time! Perhaps = 11.00. So, if I am right … there were 5 hours (of “cold dyeing”) at disposal!] >One of the nursing staff was detailed, immediately Les’ body was taken away, to wash down the bed and the mattress cover, in preparation for the admission of a new patient. She scrubbed away but found the task was taking much longer than she had first thought. >There were some difficult stains which were proving to be particularly obstinate. Scrub as she might, they seemed to be indelible. … Link: https://www.shroud.com/pdfs/imprint.pdf So… Do you want to continue to indicate the strange story of the partial head imprint without taking into account the possible cold dyeing for polyamide? We should develop a new document on the issue that takes into account the knowledge of Chemistry of Materials Science and Applied Microscopy. I am waiting for your reply and I hope you want to answer on that question before the beginning of Next Year. Thank you in advance..","date":"2014-12-11","mins":"8:33 am","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","title":"Remembering Ray Rogers at the St. Louis Conference"},{"id":"comment-175703","author":"piero","post":"Errata corrige: on this behavior Instead of: on that on this behavior — — We have to search what is the affinity of the substrate (polyamide) for different types of biological fluids. For anionic dyestuffs dyeing the treated substrate was rolled up and rotated at a temperature of 20° 60°… But, in our case, we can not go over 30 degrees Celsius. We have to explore what is the best condition of biological fluids fixation. We also need to find which is the minimum time required for effective fixation of “biologic dyeing.” I think this requires some preliminary experiments. What is your opinion?.","date":"2014-12-11","mins":"8:51 am","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","title":"Remembering Ray Rogers at the St. Louis Conference"},{"id":"comment-210996","author":"piero","post":"What kind of “religious artifacts”? …and … Why? A world conquest based on religious artifacts? Why? This particualr idea seem to be near analogous to the “Hollow Earth theory” (Link: https://en.wikipedia.org/wiki/Hanns Hörbiger ) In other words, I believe these facts are in the field of psychiatric problems and mental manipulations … — — 124 minutes ago, I lost forever all the hundreds of pictures I had stored in my Samsung phone … and so I’m not very happy about what happened. However, life is beautiful all the same, even without digital memory. But … can be said the same for the Shroud? I think the answer about the Shroud was given by Our Lady of Guadalupe. But, at times, it seems to be difficult to interpret that answer correctly..","date":"2015-09-23","mins":"11:05 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211158","author":"piero","post":"Hitler, in “Mein Kampf”, said the following words: “The typical feature of these people [the modern followers of the ancient religions in Germany] is that in words recite ancient Germanic heroism, the vague prehistory of stone axes, spear and shield, but in reality are the greatest cowards that imaginable. Just those people who brandish slavish imitations of old tin swords German and wear bearskin with a pair of bull horns on their head, they preach of nothing today but they struggle with spiritual weapons only and facing a communist they run away as fast as you can”. So, considering these words, we can only see that he denounced the ravings academic völkisch and the followers of strange cults like dead weights in the battle for the salvation of Germany and showed contempt for their propensities to archeology and the strange ceremonial..","date":"2015-09-25","mins":"4:45 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211429","author":"piero","post":">Several Catholic countries and populations fell under Nazi domination during the period of the Second World War (1939 1945), and ordinary Catholics fought on both sides of the conflict. Despite efforts to protect its rights within Germany under a 1933 Reichskonkordat treaty, the Church in Germany had faced persecution in the years since Adolf Hitler had seized power, and Pope Pius XI accused the Nazi government of sowing ‘fundamental hostility to Christ and his Church’. >Pius XII became Pope on the eve of war and lobbied world leaders to prevent the outbreak of conflict. His first encyclical, Summi Pontificatus, called the invasion of Poland an “hour of darkness”. … etc. … … Link: https://en.wikipedia.org/wiki/Catholic Church and Nazi Germany during World War II … and, on the other hand, we can read an excerpt from an article (dated 14 June 2011) : >An extraordinary secret archive has revealed for the first time how thousands of Soviet citizens collaborated with Nazi invaders during World War II. >The cache of documents, some retrieved from the files of the KGB, shows how many viewed the Germans as Christian liberators – and their own masters as godless Communists. >This view was reinforced when the soldiers of the Third Reich opened up 470 churches in north western Russia alone and reinstated priests driven from their pulpits by Stalin. >In turn, the clergy co operated closely with S.S. Death squads in betraying Communist officials, Jews and partisan resistance groups. Link: http://www.dailymail.co.uk/news/article 2003413/Soviets supported Christian crusader Nazis World War II.html So, IMO, this is another reason to believe that Hitler (probably) was not too inclined to waste time (during WWII) with a (presumed) “Shroud kidnapping plan”….","date":"2015-09-28","mins":"10:54 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211159","author":"piero","post":">…the modern mythology even touches Goodrick Clarke’s topic directly. The rumor that Adolf Hitler had encountered the Austrian monk and anti semitic publicist, Lanz von Liebenfels already at the age of 8, at Heilgenkreuz abbey, goes back to Les mystiques du soleil (1971) by Michel Jean Angbert. “This episode is wholly imaginary.” Link: https://en.wikipedia.org/wiki/Nazism and occultism But in Goodrick Clarke’s book (Chapter 12, if I am right) there is the previous description about the negative words that Hitler wrote (in “Mein Kampf”) about “the modern followers of the ancient religions in Germany” ….","date":"2015-09-25","mins":"4:51 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211431","author":"piero","post":"But… the most famous case that we can try to consider is that of Theresa Neumann: >…During the Third Reich, Therese Neumann was the target of ridicule and defamation, as the Nazis knew about her dissenting views and feared her growing popularity. She was observed by the Gestapo. >She was never physically harmed, though her family home, parish church and priest’s house all received direct attacks. >She encouraged Fritz Gerlich to continue his opposition to Hitler and his national socialist party. Gerlich was subsequently killed for his opposition. … Link: https://en.wikipedia.org/wiki/Therese Neumann.","date":"2015-09-28","mins":"11:04 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211423","author":"piero","post":"Wiligut described the strife, in an ancient mythical Germany, between true positive “Irminists”, followers of Krist, and evil “Wotanists”. >The fight went on for centuries. During this confrontation an Irminist prophet called Baldur Chrestos was crucified (although he managed to escape) by the Wotanists in Goslar, Germany where he said the original Bible was written. >Wiligut claimed to be the heir of an age old Irminist tradition, and delivered a peculiar set of runes … etc. … etc. … Link: http://en.metapedia.org/wiki/Karl Maria Wiligut.","date":"2015-09-28","mins":"10:27 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211432","author":"piero","post":"Carl Albert Fritz (Michael) Gerlich (15 February 1883 – 30 June 1934) was a German journalist and historian, and one of the main journalistic resistors of Adolf Hitler. >He was arrested and later killed at the Dachau concentration camp. … … >… By 1927, he had befriended Therese Neumann, a Catholic mystic from Konnersreuth, Bavaria, who supported Gerlich’s resistance activities. Initially, he wanted to expose her stigmatism as fakery, but Gerlich came back a changed man and later converted from Calvinism to Catholicism in 1931. From that year until his death, his resistance became inspired by the social teachings of the Catholic Church. … Link: https://en.wikipedia.org/wiki/Fritz Gerlich.","date":"2015-09-28","mins":"11:07 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211433","author":"piero","post":"Teresa did not hide the fact that they refuse to address the political and the person of Hitler. But she did not statements in public. She gave advice and directions to many in search of help… an help he had received in a paranormal way. So she also advised dr. Fritz Gerlich, managing editor of the Journal of Monaco “Münchner Neueste Nachrichten” to return to Germany. But he didn’t follow the advice and he was arrested immediately after repatriation. Link (in italian language): http://www.thereseneumann.de/thereseitalian/main/biografie.htm.","date":"2015-09-28","mins":"11:15 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211425","author":"piero","post":">An Irminsul (Old Saxon, probably “great/mighty pillar” or “arising pillar”) was a kind of pillar which is attested as playing an important role in the Germanic paganism of the Saxon people. >The oldest chronicle describing an Irminsul refers to it as a tree trunk erected in the open air… Link: https://en.wikipedia.org/wiki/Irminsul#cite note DALVIELLA112 1.","date":"2015-09-28","mins":"10:32 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211427","author":"piero","post":"Instead see what is the christian claim: >Our Lady of the Pillar (Spanish: Nuestra Señora del Pilar) is the name given to the Blessed Virgin Mary for her miraculous appearance in Zaragoza, Spain at the time of the emergence of Christianity. She is the Patroness of Spain … etc…. While James was praying >by the banks of the Ebro River with some of his disciples, Mary miraculously appeared before him atop a pillar accompanied by angels. >Mary assured James that the people would eventually be converted and their faith would be as strong as the pillar she was standing on. She gave him the pillar as a symbol and a wooden image of herself. … etc. … etc. … Link: https://en.wikipedia.org/wiki/Our Lady of the Pillar.","date":"2015-09-28","mins":"10:38 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211424","author":"piero","post":">Irminenschaft (or, Irminism, Irminenreligion) is a current of Ariosophy based on a Germanic deity Irmin which is supposedly reconstructed from literaric, linguistic and onomastic sources. >Among other sources the Prefix “Irmin” is well documented in the from Irminsul “great pillar that supports all”/”Columna Universalis Sustenans Omni”, as described in Einhards ‘Vita Karoli Magni’, and informed by Tacitus (~1st century) via a mentioned Germanic tribe name of Hermiones … Link: https://en.wikipedia.org/wiki/Irminenschaft See also the book by Nicholas Goodrick Clarke….","date":"2015-09-28","mins":"10:30 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-210999","author":"piero","post":"Today the search of the “Holy Grail” seem to deal with Genomic Biology, Genomic Engineering… Genomics is changing our understanding of biology. And then see also: genome editing, etc. Links: http://www.sciencedirect.com/science/article/pii/S0092867400816931 http://blogs.discovermagazine.com/gnxp/2010/08/hitlers jewish genes/ http://www.independent.co.uk/arts entertainment/tv/news/did adolf hitler marry a woman of jewish descent dna tests show eva braun associated with ashkenazi 9239784.html https://en.wikipedia.org/wiki/The Invention of the Jewish People#Genetic evidence Hitler, Darwin and Eugenics. >…Hitler was strongly influenced by Darwin’s theory of evolution and by Americans who were promoting eugenics. >He closely followed the teachings of university professors in the United States who were teaching eugenics and using the principles of Darwin’s theory of evolution to form a “superior” race of people in America … … >The superior race that American eugenicists and Adolf Hitler envisioned was intended to be free of disability, poverty, and chronic illness. … >… Modern eugenics does not seek to create a superior race, but it does have the potential for creating a superior class of people who will be distinguished by the absence of certain diseases, which they will call “health.” >They will possess a certain set of traits that someone among them has determined to be “best” for humanity. … Link: http://healthimpactnews.com/2015/mapping the genome and modern genetics eugenics repackaged for modern times/#sthash.q Vd S Udio.dpuf But … Really did reach the genetic research of the Nazis a good level? — — Here an example of “Genome engineering technology”, the paper: Applications of CRISPR Cas9 mediated genome engineering by Xiao Yang Mil Med Res. 2015; 2: 11. Published online 2015 May 9. Abstract: >Targeted mutagenesis based on homologous recombination has been a powerful tool for understanding the mechanisms underlying development, normal physiology, and disease. >A recent breakthrough in genome engineering technology based on the class of RNA guided endonucleases, such as clustered regularly interspaced short palindromic repeats (CRISPR) associated Cas9, is further revolutionizing biology and medical studies. >The simplicity of the CRISPR Cas9 system has enabled its widespread applications in generating germline animal models, somatic genome engineering, and functional genomic screening and in treating genetic and infectious diseases. >This technology will likely be used in all fields of biomedicine, ranging from basic research to human gene therapy. Link: http://www.ncbi.nlm.nih.gov/pmc/articles/PMC4433013/.","date":"2015-09-23","mins":"11:47 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-212057","author":"piero","post":"There is an interesting book to take into account: “Himmler’s Crusade: The Nazi Expedition to Find the Origins of the Aryan Race” by Christopher Hale “Himmler’s Crusade” relates the 1938 Nazi expedition through British India to the sacred mountains of Tibet in search of the remnants of the Aryan people, the lost “master race”… If this kind of argument was the true interest of Himmler (and Hitler?) it’s easily understandable the reason for what the nazists failed to stolen the Shroud during WWII … Probably their knowledge of the Shroud was at low level. But this is only my vague speculation. I have no exact proofs… — — In any case see also the speculations by Peter Eisner on Pius XI: “The Pope’s Last Crusade: How an American Jesuit Helped Pope Pius XI’s Campaign to Stop Hitler”. >…”The Pope’s Last Crusade” by Peter Eisner is a thrilling narrative that sheds new light on Pope Pius XI’s valiant effort to condemn Nazism and the policies of the Third Reich — a crusade that might have changed the course of World War II … !!!.","date":"2015-10-08","mins":"11:17 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211060","author":"piero","post":"An encephalitis lethargica can explain us something about the health problems of that dangerous person: >Allegedly, Adolf Hitler, might have had encephalitis lethargica when he was a young adult and subsequent parkinsonism could contribute to making reckless decisions in his later life… Link: https://en.wikipedia.org/wiki/Encephalitis lethargica In order to better understand the issue i think we have to take into account the medical study: “Adolf Hitler had post encephalitic Parkinsonism” by Lieberman. Parkinsonism Relat Disord. 1996 Apr;2(2):95 103. Abstract >Adolf Hitler had Parkinson symptoms in 1934, at age 45 years. He may have had transient symptoms in 1923, at age 34 years. >Young onset parkinsonism, during the 1920s, favored a diagnosis of post encephalitic rather than idiopathic parkinsonism. Hitler had oculogyric crises, phenomena only associated with post encephalitic parkinsonism. >In addition, he had dystonic facial spasms, palilalia and a sleep disorder, phenomena more likely to be associated with post encephalitic than idiopathic parkinsonism. >In November 1918, at age 29 years, Hitler may have had von Economo’s encephalitis, while he was a patient in a hospital, recovering from poison gas. >This paper looks at the possible relationship of von Economo’s encephalitis to Hitler’s asocial behavior; his obsessions and compulsions, his cruelty and rages. >The influence of Hitler’s parkinsonism on his conduct during World War II is discussed. Links: http://www.ncbi.nlm.nih.gov/pubmed/18591024 http://eugrafal.free.fr/Lieberman 1996.pdf https://en.wikipedia.org/wiki/Oculogyric crisis In any case I still do not think his bad health may justify the sad entry in the abominations of the WWII from which he could not abstain or withdraw … To complete this sad historical picture (useful to improve the knowledges about the argument we want to understand) I add some line about Adolf Josef Lanz a.k.a. Jörg Lanz, who called himself Lanz von Liebenfels (July 19, 1874 – April 22, 1954) >… in 1905, he founded the magazine Ostara, Briefbücherei der Blonden und Mannesrechtler [rough translation = Letter library and the blonde man rights activists], of which he became the sole author and editor in 1908. >Lanz himself claimed to have up to 100,000 subscribers, but it is generally agreed that this figure is grossly exaggerated. >Readers of this publication included Adolf Hitler, Dietrich Eckart and the British Field Marshal Herbert Kitchener among others. >Lanz claimed he was visited by the young Hitler in 1909, whom he supplied with two missing issues of the magazine. ….","date":"2015-09-24","mins":"8:39 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211077","author":"piero","post":"Here a book about: “Encephalitis Lethargica During and After the Epidemic” Edited by Joel Vilensky, Ph D OUP USA 336 pages | 35 illustrations >Encephalitis Lethargica: During and After the Epidemic is akin to a detective novel about a major medical mystery that remains unsolved. During the 1920s and 1930s a strange, very polymorphic condition affected much of the world although not at the same time everywhere and certainly not with the same symptoms. >This condition, encephalitis lethargica, could cause death in a short period, or a Rip Van Winkle type of sleep that might last days, weeks or months, but could also, surprisingly, cause insomnia. >Its symptoms were thought to encompass almost anything imaginable, which made its diagnosis exceedingly difficult, to the point where its existence as a distinct neurologic entity could be questioned. … >… Encephalitis Lethargica: During and After the Epidemic also presents a thorough analysis of postencephalitic parkinsonism and its relationship to encephalitic lethargica. Link: http://ukcatalogue.oup.com/product/9780195378306.do “A viral infection of the mind? The curious case of encephalitis lethargica” >Encephalitis lethargica, an infectious disorder that only once appeared in epidemic form (1916 1926), is largely forgotten now. But this curious illness provided significant insights into brain function that still have relevance today. Link: http://theconversation.com/a viral infection of the mind the curious case of encephalitis lethargica 660.","date":"2015-09-24","mins":"11:34 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211078","author":"piero","post":"Several years ago… I have bought the book: “The Occult Roots of Nazism” by Nicholas Goodrick Clarke. >Nicholas Goodrick Clarke (15 January 1953 – 29 August 2012) was a British historian and professor of Western Esotericism at University of Exeter, best known for his authorship of several scholarly books on esoteric traditions. >…Goodrick Clarke was the Director of the Centre for the Study of Esotericism (EXESESO) within the College of Humanities at Exeter until his death on 29 August 2012. … Link: https://en.wikipedia.org/wiki/Nicholas Goodrick Clarke.","date":"2015-09-24","mins":"11:37 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211079","author":"piero","post":"Another link: https://en.wikipedia.org/wiki/The Occult Roots of Nazism — — You can also read a book review by William Main about: “The Occult Roots of Nazism, Secret Aryan Cults and Their Influence on Nazi Ideology” by Nicholas Goodrick Clarke (New York University Press, 1992, 293 pages) under the address: http://www.ewtn.com/library/NEWAGE/NAZIOCCU.TXT >… From 1905 to 1916 Lanz von Liebenfels published a magazine, “Ostara” (the name of the pagan Goddess of Spring). >Goodrick Clarke establishes that during his early years in Vienna, Hitler met with Lanz a number of times to obtain back issues of Ostara and discuss Lanz’s theories on race (this discovery is not original to Goodrick Clarke and has been mentioned by Hitler biographers including Joachim Fest.) Lanz wrote articles for Ostara advocating polygamy for racially pure Aryan men and sterilization of non Aryans both policies put into practice by the Third Reich. >Lanz also explicitly called for the deportation and extermination of all non Aryans living in Germany. >… it is possible that the idea of the Final Solution was first planted in Hitler’s mind by occultist who believed the Germans were the Chosen People and Jesus was an Aryan. … >While Hitler might have been influenced by Lanz’s ideas on race, he contemptuously rejected other aspects of occult mystification and pseudo history. >The Nazi leader who made himself a patron of occult mysticism was the head of the SS, Heinrich Himmler, who retained a self proclaimed Aryan mystic as part of his personal staff. … etc. … etc. ….","date":"2015-09-24","mins":"11:44 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211154","author":"piero","post":"Wewelsburg is a Renaissance castle: >…The castle has a triangular layout – three round towers connected by massive walls. After 1934, it was used by the SS under Heinrich Himmler and was to be expanded into the central SS cult site. >After 1941, plans were developed to enlarge it to be the so called “Center of the World”. … >…Its location is near what was then believed to be the site of the Battle of the Teutoburg Forest of 9 BC. Links: https://en.wikipedia.org/wiki/Wewelsburg https://en.wikipedia.org/wiki/Battle of the Teutoburg Forest.","date":"2015-09-25","mins":"4:01 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211080","author":"piero","post":"So (if we are lucky) we can hope to try to find something about the head of the SS, Heinrich Himmler and his eventual true interests around the Holy Shroud of Turin… Perhaps this requires a certain amount of work (hours to spend searching some proof…)..","date":"2015-09-24","mins":"11:48 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-211157","author":"piero","post":"During 1935, Wiligut (alias Weisthor) had predicted to Himmler that the Wewelsburg would be the “bastion”. Himmler expected a big conflict between Asia and Europe. Wiligut’s influence on Himmler is undeniable, but there were other more significant factors that made Himmler the man that he was. >Wiligut’s medical records reflect violence at home, including threats to kill his wife, grandiose projects, eccentric behavior and occult interests. Eventually, in 1924, he was diagnosed with schizophrenia and megalomania and was declared legally incompetent by a Salzburg court and then committed to a Salzburg asylum, where he remained until 1927. In 1932, Wiligut > abandoned his wife and family, and emigrated from Austria to Germany, residing in Munich. >He is known to have corresponded with many admirers and disciples, including Ernst Rüdiger and members of the Order of the New Templars. >… Wiligut was inducted into the SS (under the pseudonym “Karl Maria Weisthor”) to head a Department for Pre and Early History which was created for him within the SS Race and Settlement Main Office (Ru SHA). >In April 1934 he was promoted to the SS equivalent of his old colonel rank (Standartenführer), and then made head of Section VIII (Archives) for Ru SHA in October 1934. >In November 1934 a promotion followed to the rank of Oberführer (lieutenant brigadier), and then in the spring of 1935 Wiligut was transferred to Berlin to serve on Himmler’s personal staff. He was promoted to the rank of Brigadeführer in September 1936. >In Berlin, where he worked in the office of Karl Wolff, chief adjutant of the SS, Wiligut developed his plans for the rebuilding of the Wewelsburg into an allegorical “center of the world”. Wiligut’s friend Manfred von Knobelsdorff attempted to practise Wiligut’s Irminism on the Wewelsburg. A baptismal ceremony for Karl Wolff’s eldest son Thorisman is published in the Wolf Bibliography by Jochen Lang. The Irministic ‘baptism’ occurred on 4 January 1937, attended by SS dignitaries Reinhard Heydrich and Karl Diebitsch. … Link: https://en.wikipedia.org/wiki/Karl Maria Wiligut It seems to be a little incredible the idea that the Shroud had some possibility to appear in the hands of those Nazi fanatics… In fact, the Italian royal family and the Church had received the proper informations and then (after these informations) they had arranged the things in order to secure the safety for the relic..","date":"2015-09-25","mins":"4:31 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-157691","author":"piero","post":"I tried to look and I have found the following words: “… found particles of aragonite with small amounts of strontium and iron …” under : members.iinet.net.au/~sejones/quotes/T So T/stuc0811.html — — But this claim is too general and does not solve our problem … because the argument to develop is the following : Mg/Ca, Ba/Ca and Sr/Ca ratios (in aragonite) and variability of trace elements (in aragonite) … — — Then try under the following bibliographic indication: Allison, N., Comparative determinations of trace and minor elements in coral aragonite by ion microprobe analysis, with preliminary results from Phuket, southern Thailand, Geochim. Cosmochim. Acta, 60, 3457–3470, 1996. Or Jeffries, T. E., S. E. Jackson, and H. P. Longerich, Application of a frequency quintupled Nd: YAG source (l = 213nm) for laser ablation inductively coupled plasma mass spectrometic analysis of minerals, J. Anal. At. Spectrom., 13, 935–940,1998. — — And I have found both the previous studies in : Determination of intratest variability of trace elements in foraminifera by laser ablation inductively coupled plasma mass spectrometry by E. C. Hathorne, O. Alard, R. H. James, and N. W. Rogers Technical Brief Volume 4, Number 12 5 December 2003 Copyright 2003 by the American Geophysical Union — — — link: http://www.gm.univ montp2.fr/IMG/pdf/Hathorne al 2003 G3 .pdf — — — Here a short excerpt from the abstract: We have developed a technique to determine the variability of trace elements (including Li, B, Na, Mg, Mn, Cu, Zn, Sr and Ba) within foraminifera tests using laser ablation inductively coupled plasma mass spectrometry (LA ICP MS). This technique has a high spatial resolution (width 40–80 mm, depth >0.5 mm), is reproducible (<8% external reproducibility) and has low detection limits (generally <0.05 mg g1). We demonstrate that normalization of data to a calcite standard usually gives results that are more consistent with solution ICP MS data than normalization to NIST 612. … etc. … etc. … — — — Unfortunately I don't believe in this way (for the Shroud !) ….","date":"2014-09-29","mins":"10:47 am","url":"https://shroudstory.com/2014/09/28/searching-stephen-jones-quotation-archives/","cat":"quotations","title":"Searching Stephen Jones’ Quotation Archives"},{"id":"comment-157692","author":"piero","post":"Using the following words: site:members.iinet.net.au/~sejones/ “Shroud of Turin” dirt strontium I have found: >12 Nov 2008 … >Unclassified Shroud of Turin quotes added by me in November 2008. … > … found particles of aragonite with small amounts of strontium and iron … But this claim is too general and does not solve our problem! — — — Then, try under : http://www.gm.univ montp2.fr/IMG/pdf/Hathorne al 2003 G3 .pdf We have developed a technique to determine the variability of trace elements (including Li, B, Na, Mg, Mn, Cu, Zn, Sr and Ba) within foraminifera tests using laser ablation inductively coupled plasma mass spectrometry (LA ICP MS). This technique has a high spatial resolution (width 40–80 mm, depth >0.5 mm), is reproducible (<8% external reproducibility) and has low detection limits (generally <0.05 mg g1). We demonstrate that normalization of data to a calcite standard usually gives results that are more consistent with solution ICP MS data than normalization to NIST 612. … … etc. … etc … … For example : see the bibliography: Allison, N., Comparative determinations of trace and minor elements in coral aragonite by ion microprobe analysis, with preliminary results from Phuket, southern Thailand, Geochim. Cosmochim. Acta, 60, 3457–3470, 1996 and Jeffries, T. E., S. E. Jackson, and H. P. Longerich, Application of a frequency quintupled Nd: YAG source (l = 213nm) for laser ablation inductively coupled plasma mass spectrometic analysis of minerals, J. Anal. At. Spectrom., 13, 935–940, 1998. — — — What is your opinion about laser ablation inductively coupled plasma mass spectrometic analysis ? I don't believe in that for the Shroud ….","date":"2014-09-29","mins":"10:53 am","url":"https://shroudstory.com/2014/09/28/searching-stephen-jones-quotation-archives/","cat":"quotations","title":"Searching Stephen Jones’ Quotation Archives"},{"id":"comment-157697","author":"piero","post":"Using site:members.iinet.net.au/~sejones/ “Shroud of Turin” dirt strontium I have found: 12 Nov 2008 … Unclassified Shroud of Turin quotes added by me in November 2008. … found particles of aragonite with small amounts of strontium and iron … But this claim is too general and does not solve our problem! — — — Then, try under : http://www.gm.univ montp2.fr/IMG/pdf/Hathorne al 2003 G3 .pdf We have developed a technique to determine the variability of trace elements (including Li, B, Na, Mg, Mn, Cu, Zn, Sr and Ba) within foraminifera tests using laser ablation inductively coupled plasma mass spectrometry (LA ICP MS). This technique has a high spatial resolution (width 40–80 mm, depth >0.5 mm), is reproducible (<8% external reproducibility) and has low detection limits (generally <0.05 mg g 1). We demonstrate that normalization of data to a calcite standard usually gives results that are more consistent with solution ICP MS data than normalization to NIST 612. … … etc. … etc … … For example : see the bibliography: Allison, N., Comparative determinations of trace and minor elements in coral aragonite by ion microprobe analysis, with preliminary results from Phuket, southern Thailand, Geochim. Cosmochim. Acta, 60, 3457–3470, 1996 and Jeffries, T. E., S. E. Jackson, and H. P. Longerich, Application of a frequency quintupled Nd: YAG source (l = 213nm) for laser ablation inductively coupled plasma mass spectrometic analysis of minerals, J. Anal. At. Spectrom., 13, 935–940, 1998. ————– What is your opinion ? I don’t believe in that kind of analyses for the Shroud ….","date":"2014-09-29","mins":"10:58 am","url":"https://shroudstory.com/2014/09/28/searching-stephen-jones-quotation-archives/","cat":"quotations","title":"Searching Stephen Jones’ Quotation Archives"},{"id":"comment-157693","author":"piero","post":"Using site:members.iinet.net.au/~sejones/ “Shroud of Turin” dirt strontium I have found: 12 Nov 2008 … Unclassified Shroud of Turin quotes added by me in November 2008. … found particles of aragonite with small amounts of strontium and iron … But this claim is too general and does not solve our problem! — — — Then, try under : http://www.gm.univ montp2.fr/IMG/pdf/Hathorne al 2003 G3 .pdf We have developed a technique to determine the variability of trace elements (including Li, B, Na, Mg, Mn, Cu, Zn, Sr and Ba) within foraminifera tests using laser ablation inductively coupled plasma mass spectrometry (LA ICP MS). This technique has a high spatial resolution (width 40–80 mm, depth >0.5 mm), is reproducible (<8% external reproducibility) and has low detection limits (generally <0.05 mg g 1). We demonstrate that normalization of data to a calcite standard usually gives results that are more consistent with solution ICP MS data than normalization to NIST 612. … … etc. … etc … … For example : see the bibliography: Allison, N., Comparative determinations of trace and minor elements in coral aragonite by ion microprobe analysis, with preliminary results from Phuket, southern Thailand, Geochim. Cosmochim. Acta, 60, 3457–3470, 1996 and Jeffries, T. E., S. E. Jackson, and H. P. Longerich, Application of a frequency quintupled Nd: YAG source (l = 213nm) for laser ablation inductively coupled plasma mass spectrometic analysis of minerals, J. Anal. At. Spectrom., 13, 935–940, 1998. What is your opinion ? I don't believe in that kind of analysis for the shroud !.","date":"2014-09-29","mins":"10:55 am","url":"https://shroudstory.com/2014/09/28/searching-stephen-jones-quotation-archives/","cat":"quotations","title":"Searching Stephen Jones’ Quotation Archives"},{"id":"comment-157695","author":"piero","post":"Using the words: site:members.iinet.net.au/~sejones/ “Shroud of Turin” dirt strontium I have found: >12 Nov 2008 … Unclassified Shroud of Turin quotes added by me in November 2008. … found particles of aragonite with small amounts of strontium and iron … But this claim is too general and does not solve our problem! — — — Then, try under : http://www.gm.univ montp2.fr/IMG/pdf/Hathorne al 2003 G3 .pdf We have developed a technique to determine the variability of trace elements (including Li, B, Na, Mg, Mn, Cu, Zn, Sr and Ba) within foraminifera tests using laser ablation inductively coupled plasma mass spectrometry (LA ICP MS). This technique has a high spatial resolution (width 40–80 mm, depth >0.5 mm), is reproducible (<8% external reproducibility) and has low detection limits (generally <0.05 mg g 1). We demonstrate that normalization of data to a calcite standard usually gives results that are more consistent with solution ICP MS data than normalization to NIST 612. … … etc. … etc … … For example : see the bibliography: Allison, N., Comparative determinations of trace and minor elements in coral aragonite by ion microprobe analysis, with preliminary results from Phuket, southern Thailand, Geochim. Cosmochim. Acta, 60, 3457–3470, 1996 and Jeffries, T. E., S. E. Jackson, and H. P. Longerich, Application of a frequency quintupled Nd: YAG source (l = 213nm) for laser ablation inductively coupled plasma mass spectrometic analysis of minerals, J. Anal. At. Spectrom., 13, 935–940, 1998. ————– What is your opinion ? I don’t believe in that kind of analyses for the Shroud ….","date":"2014-09-29","mins":"10:57 am","url":"https://shroudstory.com/2014/09/28/searching-stephen-jones-quotation-archives/","cat":"quotations","title":"Searching Stephen Jones’ Quotation Archives"},{"id":"comment-157698","author":"piero","post":"An useless work because Using site:members.iinet.net.au/~sejones/ “Shroud of Turin” dirt strontium I have found: 12 Nov 2008 … Unclassified Shroud of Turin quotes added by me in November 2008. … found particles of aragonite with small amounts of strontium and iron … But this claim is too general and does not solve our problem! — — — Then, try under : http://www.gm.univ montp2.fr/IMG/pdf/Hathorne al 2003 G3 .pdf We have developed a technique to determine the variability of trace elements (including Li, B, Na, Mg, Mn, Cu, Zn, Sr and Ba) within foraminifera tests using laser ablation inductively coupled plasma mass spectrometry (LA ICP MS). This technique has a high spatial resolution (width 40–80 mm, depth >0.5 mm), is reproducible (<8% external reproducibility) and has low detection limits (generally <0.05 mg g 1). We demonstrate that normalization of data to a calcite standard usually gives results that are more consistent with solution ICP MS data than normalization to NIST 612. … … etc. … etc … … For example : see the bibliography: Allison, N., Comparative determinations of trace and minor elements in coral aragonite by ion microprobe analysis, with preliminary results from Phuket, southern Thailand, Geochim. Cosmochim. Acta, 60, 3457–3470, 1996 and Jeffries, T. E., S. E. Jackson, and H. P. Longerich, Application of a frequency quintupled Nd: YAG source (l = 213nm) for laser ablation inductively coupled plasma mass spectrometic analysis of minerals, J. Anal. At. Spectrom., 13, 935–940, 1998. ————– What is your opinion ? I don’t believe in that kind of analyses for the Shroud ….","date":"2014-09-29","mins":"10:59 am","url":"https://shroudstory.com/2014/09/28/searching-stephen-jones-quotation-archives/","cat":"quotations","title":"Searching Stephen Jones’ Quotation Archives"},{"id":"comment-210047","author":"piero","post":"I think we, before investigating on many (interesting) miracles … and other phenomena .. We should improve knowledges that can be useful for our research about the Shroud. For example, here a case… I have read that: >MALDI IMS involves the visualization of the spatial distribution of proteins, peptides, lipids, and other small molecules within thin slices of tissue, such as animal or plant. So… the question to pose is the following: Is it possible to work on linen fibrils with MALDI IMS (Link: https://en.wikipedia.org/wiki/MALDI imaging ) in order to detect (in an exact manner) the molecules and the degree of polymerization of cellulose and lignin? In my idea the answer is: not. What is your opinion? How to deepen the analyses on that “textile mystery”?.","date":"2015-09-10","mins":"12:00 pm","url":"https://shroudstory.com/2015/09/07/a-massive-effort-called-sturp/","cat":"press_coverage","title":"A Massive Effort Called STURP"},{"id":"comment-157978","author":"piero","post":"Dear Dan, I am deeply dismayed for what happened yesterday! I apologize, but I was trying to send, and after sending I waited and did not get an answer! Here is the simple explanation for the annoying repetition of similar messages. Maybe there were line problems or other causes. I hope that this never happens again. — — — Here what I have found surfing the Web today: >1. – Where were the Jerusalem samples taken? Dr. Nitowsky (Sr. Damian of the Cross) sampled in Israel, nine sites which included: 1. Emmaus; 2. Jericho, at Herod’s palace; 3. Qumran ; 4. Beth Shan ; 5 Sepphoris; 6 and 7 Beth She’arim; 8 Jerusalem; 9. Mt Carmel”. The Jerusalem samples are further identified as in the École Biblique tomb complex and more particularly from the bench of the tomb.” >2. … … omitted … … >3. – How was the Aragonite identified from Jerusalem? >Kohlbeck analysed with the microscope thin sections of the Jerusalem tomb and he concluded was Aragonite. The strongest way to distinguish Aragonite from Calcite is the X ray diffraction to determine the crystalline structure. However, this test was never mentioned. But Kohlbeck should be able to recognize through the microscope the aragonite versus the common calcite. Nevertheless, this is not the key question because actually, Aragonite is very spread and very common. It should be easy to find Aragonite in the Jerusalem rock and in the Shroud too and its presence in the Shroud cannot be taken as a clue of its stay in Jerusalem. Only specific traces (iron and strontium) could give an indicative fingerprint. Kohlbeck applied the X Ray fluorescence method to detect traces of iron and strontium and being not able to find lead. It is the further analysis conducted by Dr. Riccardo Levi Setti through his high resolution Secondary Ion Mass Spectroscopy that provided the true “little DNA” or “finger print” to be compared with the samples of the Shroud (fibers). Link: http://www.holyshroudguild.org/cesar2.html — — — SIMS link: http://en.wikipedia.org/wiki/Secondary ion mass spectrometry — — — >Ion microprobes, also known as secondary ion mass spectrometers (SIMS), use a finely focused ion beam to probe a selected sample domain. A small percentage of the material sputtered from the polished surface of the sample is ionized, and these ions are accelerated into a mass spectrometer where they are separated according to their mass over charge ratio. An important characteristic of SIMS is its high sensitivity compared to other microbeam sampling techniques: the ability to count individual ions results in detection limits in the parts per billion range for many elements. Also the fact that ions derived from the sample are separated by their mass over charge ratio allows isotopic analyses to be performed on test portion masses that can be as small as 200 picograms. Link: http://www.gfz potsdam.de/en/research/organizational units/departments/department 4/inorganic and isotope geochemistry/infrastructure/secondary ion mass spectrometry sims/ Do you know the dimensions and volumes of the craters produced during secondary ion mass spectrometry (SIMS) analysis ? — — — Super SIMS (SIMS = Secondary ion mass spectrometry) – also called Accelerator SIMS or Trace Element AMS (TREAMS) – is an ultrasensitive analytical method for the determination of stable elements and isotopes. Due to the acceleration of the extracted sample ions to Me V energies and their charge reversal from negative to positive ions, Super SIMS can reach about 2 to 3 orders of magnitude lower detection limits (up to 10 12 or ppt, highly depending on analyte and matrix) as conventional SIMS. … Link: http://www.hzdr.de/db/Cms?p Nid=2809.","date":"2014-09-30","mins":"8:35 am","url":"https://shroudstory.com/2014/09/28/searching-stephen-jones-quotation-archives/","cat":"quotations","title":"Searching Stephen Jones’ Quotation Archives"},{"id":"comment-143094","author":"piero","post":"So … We have to check what was the right age about three different epochs : 1a 16th century (Duchess Margaret of Austria) 1b 1694 Sebastian Valfré 2 1864/68 Princess Clothild Is it possible to believe in a simple solution for that (little) enigma ? The answer (IMO) is : Yes for 1 and 2, because (using the adequate advanced tools [= with nanomechanical or/and nanochemistry controls]) we can try to test these samples. Instead there is too little difference about 1a and 1b… — — In any case I am curious about the results from the control on that “probable” (= are most likely). “micro reconstructions by princess Clothilde of Savoy Bonaparte in 1863/8” … — — B.T.W. : Who was the “Master of upholstery in Royal court” ? (Reference : the same message by Max P.Hamon, dated Aug 8, 20014 at 10:29).","date":"2014-08-09","mins":"9:45 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"}]
