[{"title":"Banding Proves Cloth Was Not Repaired?","post":"This was the point made by no less than John Jackson who showed with photographs that the banding was  uninterrupted throughout the corner.\n\n","date":"October 28, 2015 at 2:07 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213735","author":"Charles Freeman","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Charles,,\n– Do you have that link?\n– I had thought that there were some anomalies.\n\n","date":"October 28, 2015 at 10:45 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213755","author":"Richard Savage","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Charles,\n– Don’t forget me.\n– Do you have a link to Jackson’s claim and photographs?\n– Thanks.\n\n","date":"October 29, 2015 at 10:53 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213833","author":"Richard Savage","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Richard- you will find it on Shroud.com under John Jackson,’A New Radiocarbon Hypothesis’ May 5th, 2008, first paragraph. I have seen this article with the photograph attached but it has not come up here. No doubt Jackson can provide it if you are interested but he I s quite clear that the reweaving hypothesis needs to be ruled out as you will see.\n\n","date":"October 29, 2015 at 12:50 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213842","author":"Charles Freeman","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"P.S. As is not often the case with Shroud research, Jackson’s view is replicated by a different approach, in this case by Flury- Lemberg who has examined the Shroud close-up and does not know of any textile expert who has spotted any reweaving. I think it is a dead issue but it will doubtless get repeated for the rest of time.\n\n","date":"October 29, 2015 at 12:52 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213843","author":"Charles Freeman","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"There are several articles available, here is but one:\nhttps://shroudstory.com/2011/01/23/shroud-of-turin-repairs-and-carbon-dating-more-good-stuff/\nhttp://www.cirac.org/shroud/Discussion/MGS-CESS-36-42.htm\n\n","date":"October 28, 2015 at 3:08 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213737","author":"ekmcmahon","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"All kidding aside, see infra, the authorities cited concur with Ray Rogers observation that there was a significant difference in the weight of the fibers in the samples and the weight of the fibers in the main body of the Shroud. \nThank you EK\n\n","date":"October 28, 2015 at 6:08 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213743","author":"John Klotz","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Thanks EK, and thanks John.\n\n","date":"October 28, 2015 at 9:58 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213753","author":"Richard Savage","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"If the goal of the those that repaired the corner was an invisible repair that they would per force have replicated the banding where necessary. \nThere is an old joke about Hong Kong tailors that illustrate the point. If some find it a little politically incorrect, I apologize.\nIn the days before GB ceded sovereignty to the Chinese People’s Republic, tailors in Hong Kong were credited with legendary prowess. (I recall some decades ago receiving direct mail solicitations for Hong Kong suits tailored to my specifications. Never did it though)\nIn any event, a businessman visited Hong Kong on the eve of an important meeting discovered that he had  burned a cigarette hole into the sleeve of his suit, He was a aghast so he sought out a Hong Tailor  and wanted him to replicate the suit and told him he needed it immediately but he wanted it exactly like the suit with the cigarette burn in the cuff. The tailor asked  “Exactly?) He replied, “yes, perfectly.” The next day the suit was delivered and when tried his new suit on discovered that it had a burn hole in cuff.\n\n","date":"October 28, 2015 at 6:00 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213742","author":"John Klotz","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"John,\n– My fellows came back with a retort to “If the goal of the those that repaired the corner was an invisible repair that they would per force have replicated the banding where necessary.”\n– I.e., “The banding was [b]unknown[/b] until recently so it would have been impossible for any medieval craftsman to even attempt to avoid disrupting it.”\n– Did he ‘getcha’ there?\n\n","date":"October 30, 2015 at 11:30 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213927","author":"Richard Savage","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Just read the article that was posted on fox news website about the DNA that deepens the mystery of the shroud. Farey in the article stated that the shroud have BOTH the significant evidence of being either medieval or real. Hogwash, the only piece of evidence I find for medieval is the carbon dating. For authenticity, the evidence list is long.\n\n","date":"October 28, 2015 at 6:09 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213744","author":"Donn","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Donn, you can always read my article ‘ the Origins of the Shroud of Turin’ for some of the medieval evidence. Easily found on a Google search and still being widely read.\n\n","date":"October 28, 2015 at 3:08 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213769","author":"Charles Freeman","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Evidence, or the so called ‘evidence’?\nI see that the term ‘evidence’ has went through large inflation recently, and any observation can be called ‘evidence’ for some claim, even if already discounted with several other, more significant observations. \nJust a thought.\n\n","date":"October 28, 2015 at 3:13 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213770","author":"O.K.","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"I don’t think the evidence for a significant difference in the areal density of the radiocarbon carbon area, as opposed to the main body of the Shroud, is very strong.\n1) The Shroud has never been weighed, either with or without its backing cloth.\n2) All the overall values for the mass of the Shroud are based on more or less unreliable estimates of the densities of linen and Holland cloth in general, or on abstruse calculations related to Compton scatter.\n3) The mass of the radiocarbon samples was accurately determined several times, but their areas were, on the whole, not. Giovanni Riggi drew several contradictory diagrams with their dimensions, but how accurate they were seems uncertain. (http://www.shroud.com/pdfs/oxley.pdf)\na) In one diagram he gives the first dimensions as 8.4cm x 2.2cm (with a bite taken out of one corner for the Raes sample) and a mass of 479.00mg. However, as two of the edges were rolled seams, the actual area of the cloth was greater, about 8.9cm x 2.7cm (but still with the bite).\nb) Riggi’s second diagram shows the dimensions after the seams were cut off. He gives 7.9cm as the length, and two widths, 1.35cm for the Raes sample end, and 1.70cm for the wider end. The mass is given as 300.00mg. Taking the average of the two widths, the areal density for the trimmed sample is 25.90mg/cm2.\nc) I do not know where Maria Grazia Siliato (http://www.cirac.org/shroud/Discussion/MGS-CESS-36-42.htm) obtained her dimensions of 7cm x 1cm from. Does anyone?\n4) Freer-Waters and Jull (https://journals.uair.arizona.edu/index.php/radiocarbon/issue/view/175) examined a piece of radiocarbon sample retained from the Tucson sampling. It has an area of “approximately 0.5 × 1 cm and originally weighed 12.39 mg”, giving an areal density of 24.78mg/cm2. Barrie Schwortz later photographed this sample, with mm scales, from which it can be calculated that a more accurate value for the area is 0.52cm2 and the areal density therefore 23.83mg/cm2.\nAll in all, this evidence shows no significant discrepancy between the areal density of the radiocarbon sample and the rest of the Shroud. Can anybody refute?\nAnd Hi Donn! Good to hear from you. Unfortunately your inability to find evidence for a medieval date for the Shroud is not evidence that such evidence does not exist. Have you tried Googling “Shroud” “not authentic” “evidence”?\n\n","date":"October 28, 2015 at 2:06 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213762","author":"Hugh Farey","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Hugh, I don’t consider radiocarbon dating as ‘evidence’ because the dating methods are not reliable because of other factors- contamination as one, can skew the data.\n\n","date":"October 28, 2015 at 4:57 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213774","author":"Donn","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"I sure wish I could correct my grammar!\n\n","date":"October 28, 2015 at 5:47 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213777","author":"Donn","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Hugh it seems to me like relying on the C-14 dating to show the Shroud is medieval is a house built on cards much like Richard Carrier’s hypothesis that Jesus didn’t exist is built on a house of cards…For example..\n1.) You need the pray codex to not be connected to the Shroud despite decent evidence (modestly) that it is…\n2.) You need the Sudarium of Oviedo to not be authentic when there are studies/observations that would indicate that is connected to the Shroud…\n3.) You need the repair hypothesis that has been put forward and defended in multiple peer-reviewed papers and has been put forward and defended by textile experts, chemist, other scientist etc. to be dead wrong with no basis in truth\n4.) You need all the Coins that appear to be connected or based on the Shroud before the dating range to be mere coincidence\n5.) You need the Christ Pantocrators to not be based on the Shroud despite a clear congruence between them, and the Shroud. \netc. etc. etc.\nIt seems to me like the dating of the Shroud should be an open question. There is evidence that the dating is wrong, and certain details or evidences that point earlier..The dating should be considered, but not much more then that. It is not proof or hard evidence for anything. If skeptics on here, and elsewhere always need additional independent test on topics like Aragonite, Shroud blood type, and the like I would think to be fair skeptics on here should demand additional independent tests on a carbon-dating this is very controversial and indeed questionable before making claims that it shows the Shroud is medieval.\n\n","date":"October 28, 2015 at 9:43 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213787","author":"Matthew L.","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Matthew. Sceptics are sceptics because they don’t believe that the evidence that the Shroud is first century stacks up. We are happy to follow the evidence where it leads and so would be among the first to welcome any new radiocarbon dating.\nIf you have been keeping an eye on debates you will know that every one of your assertions has been disputed. As yet no textile expert( and Marino, Benford and Rogers had no professional background in textiles) who has examined the Shroud close up has ever found any evidence of any reweaving.\nYou are free to respond to the arguments put forward in my article on the Origins of the Shroud. Where they have proved convincing to many is that they provide interlocking evidence for a medieval origin, e.g. The all over scourge marks on the front and back of what are two different bodies( the length of the arms do not match each other) is only known after 1300, and actually  give a more precise date than the radiocarbon dating but is smack in the middle of it.\nI was told that the aragonite from the feet had been lost- anyone know where it is? If you go around losing what you consider your best evidence, then really you should not be working in this specialist field. It would seem to be similar to the calcium carbonate that STURP found all over the Shroud samples which is indicative of the gesso mix that seals a linen before it is painted on. But untile we find it we cannot make the match- that is assuming that STURP will allow access to the calcium carbonate they collected.\nIncidentally I, like many others, stopped communicating on the  International Sceptics forum. There was only one defender of the authenticity of the Shroud and he was unable to answer  the direct questions put to him so what was the point of continuing.\n\n","date":"October 29, 2015 at 3:29 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213801","author":"Charles Freeman","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Charles – what leads you to believe the arms are different lengths, with regard to the front versus back images? The arm length is indeterminate on the back image because there is no arm image! (as the back of the arms did not touch the shroud).\nSo how can you claim the lengths are different?\nI’m intrigued.\n\n","date":"October 29, 2015 at 4:12 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213804","author":"Thomas","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Charles,\n– It’s me again.\n– As you know, I’m the guy you mentioned from the International Skeptics forum.  I have a lot of excuses for not answering questions — number 1 of which is that I AM the only authenticist on the forum, and for each response I give, I tend to get numerous retorts (DIFFERENT retorts).  \n– I keep asking for someone to act as a spokesperson for my adversaries, but so far, can’t get anyone to just tell me which retort (question/comment) to address next.  And, unanswered retorts keep piling up…\n– If you would come back to the forum, you could provide your own retorts, and tell me which specific retort (maybe yours) to deal with next.\n– I think that’s the way to have some actually effective debate.  I see our debate as a tree with multiple branches, each branch itself having multiple branches, each new branch having multiple branches, etc.  What we need to do is follow one ‘branching’ to its end, then drop back to its preceding branch or branching.\n– Slow and tedious, but forward — which is a lot better than fast and exciting,but in circles,\n– Your position may be correct.  If so, this is the way to show that it is.\n\n","date":"October 29, 2015 at 1:24 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213848","author":"Richard Savage","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Thomas- the length of the arms. One of the most important tasks  still to be done in Shroud research, and one which can be done without access to the Shroud, is to create a database of all the known depictions of the Shroud. Obviously some are more accurate that others so you need to look for features that different artists in different contexts recorded. What is clear is thatis that originally there was a gap between the elbows of the back image and the main part of the body- it is shown again and again by different artists who were recording expositions.\nNow, in the privacy of your own home, lie on your back and recreate the same pattern.  You will see that you are a long way off being able to cross your arms in the front as shown on the front image. So the two bodies are separate creations.\n\n","date":"October 30, 2015 at 1:08 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213933","author":"Charles Freeman","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Yes, Matthew, I do indeed ‘need’ all those things. It is my contention, however, that those needs have been supplied. I really don’t think the Pray manuscript shows any knowledge of the Shroud as we know it, that the Sudarium of Oviedo has even been anywhere near the Shroud, that the repair hypothesis is valid, or that the coins and pantocrators were based on the Shroud rather than the other way about. The reasons why I do not find the evidence to the contrary convincing have been explained elsewhere. That is not to say that there isn’t evidence, of course, just that it isn’t as convincing to non-authenticists as it is to authenticists. Such is the enduring mystery of the Shroud.\n\n","date":"October 29, 2015 at 4:19 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213806","author":"Hugh Farey","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"c) I do not know where Maria Grazia Siliato (http://www.cirac.org/shroud/Discussion/MGS-CESS-36-42.htm) obtained her dimensions of 7cm x 1cm from. Does anyone?\nFrom Nature.\n\n","date":"October 28, 2015 at 2:10 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213763","author":"O.K.","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Yes, in Nature.\nBut the Nature report was wrong on that point (7 cm x 1 cm).\nI have a letter from Tite to Gonella, explaining that the dimensions given in Nature were wrong. He apologized to him for the confusion.\nI also have a letter from Testore to Maria Grazia Siliato criticizing her for using wrong data.\nThe true dimensions and weights are given by Riggi in Fig.2 of this paper:\nhttp://www.shroud.com/pdfs/oxley.pdf\nA quick calculation gives a density for the radiocarbon sample(s) of 20-22 mg/cm2, which is similar to the density of the main Shroud.\nMaria Grazia Siliato is wrong on this point but she was fooled by the Nature report.\n\n","date":"October 28, 2015 at 3:34 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213771","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Hugh,\nYou supply an amazing amount of disinformation. Rogers had access to fibers from both sample and non-sample areas and published the same. Where did you get the information they were never weighed?\n\n","date":"October 28, 2015 at 2:11 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213764","author":"John Klotz","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Hi John,\nPlease list the disinformation. I am ever anxious to be scrupulously correct, as you know and shall be happy to be corrected or amended. For instance, I cannot find where Rogers noted a significant difference between the weight of his radiocarbon fibres and those of the rest of the Shroud. I should be grateful for the reference.\nAs for anybody weighing the Shroud, I guess that was a bit of a challenge. I have attempted to discover any such weighing several times on this blog and elsewhere, and found nothing. If anybody knows anything to the contrary I, and the rest of the Shroud world, no doubt, would be very interested indeed.\nAnd thanks, OK. I think the Nature measurements were little more than a rough approximation, don’t you?\n\n","date":"October 28, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213772","author":"Hugh Farey","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Banding can’t tell you that whether Shroud was repaied or not. If you follow the same weave pattern in the repaired area then you get the same banding pattern from that area.\n\n","date":"October 28, 2015 at 4:16 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213773","author":"Sampath Fernando","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"That’s impossible.  Rogers proved chemically the cloth was repaired.  There is no doubt about that.\n\n","date":"October 28, 2015 at 9:33 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213785","author":"Dcn Andy","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Really? You mean that you personally have no doubt about it. I have considerable doubt about it, and have explained in detail, several times, why.\n\n","date":"October 29, 2015 at 4:12 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213803","author":"Hugh Farey","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Hi Dcn Andy!  Would you like to see up close and personal, live on video, exactly where they cut that sample?   You are going to love this.   The carbon dating is addressed right in the opening scene.  Along with many other people you will be seeing The Shroud as it was in 1978, before it was cut.  Every square inch of the Shroud.  Slow pans.    Enjoy the video.   A little excitement in a otherwise dull day.","date":"October 29, 2015 at 6:32 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213817","author":"Dave Hines","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"HF: “I don’t think the evidence for a significant difference in the areal density of the radiocarbon carbon area, as opposed to the main body of the Shroud, is very strong.” \nAlways and in every case of arguing from evidence, there are two aspects to be considered: 1) the “facts” of the evidence; 2) the “interpretation” of that evidence. \nFor the very same reasons that Hugh lists against heterogeneity, exactly the same can be argued against homogeneity!  \nFacts provided by Gilbert Raes from the two pieces he was given:\nPiece 1:  warp – 16.3 tex;  weft – 53.6 tex;\nPiece 2:  warp – 18.0 tex;  weft – 73.1 tex;\n[ tex = gm / km]  \nInterpretation:  Draw whatever conclusions you might!\n\n","date":"October 28, 2015 at 9:52 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213788","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"The Shroud is just so mysterious! So compelling!\nLying in the bath tonight with my 187m tall, 200 lb frame (similar to the Shroud Man) I jiggled around with different lying postures and thought this:\nSurely a medieval artisan, if creating the Shroud image, would have shown Jesus with legs together and flat, if portraying the image of a dead and buried Christ …eg. like this:\n\nThe apparently bent legs – amongst other things – just make so little sense in the medieval artisan theory!\n\n","date":"October 29, 2015 at 2:48 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213798","author":"Thomas","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Both Daveb and Thomas make valid points. The fact that the evidence for the areal densities of the Shroud being different is not very strong does not mean that there isn’t any evidence at all. \nNevertheless, DaveB knows very well that the comparison Raes makes above is between the side strip and the rest of his sample, not between the ‘rest of his sample’, which intruded into the radiocarbon corner, and the rest of the Shroud; and that there is some evidence that the side strip does not always precisely line up to the place where is was cut off. As the yarn is of variable width and density, it is not surprising that any particular lengths should differ from one another. Raes himself said: “the count could only be determined on a very short length of material, and we have no indication about the irregularities of the yarn. Therefore it is not possible to state with certainty that Pieces I and II originate from fabrics of different manufacture.”\nSimilarly, as has been continuously pointed out, there are few if any convincing comparable artistic renderings of the dead Christ. The point is moot. May I inquire where the photo above comes from?\n\n","date":"October 29, 2015 at 4:06 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213802","author":"Hugh Farey","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Hi Hugh I searched ’14th century effigy’ on google images.\nI remember seeing one like this in a church in the delightful city of Oxford  years ago.\n\n","date":"October 29, 2015 at 4:15 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213805","author":"Thomas","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Very interesting, Thomas. The tomb is a Cadaver Tomb, or Transi, which appears to have developed in medieval Europe towards the end of the 13th century. I have long been familiar with one in Tewkesbury Abbey, but hadn’t realised they were a recognised genre, so to speak. One or two things that could be significant – where the cadaver is shown naked, one or both hands invariably cover his genitals, as I think the left hand does in your example above (Bishop Richard Fleming of Lincoln, and see the tomb of John FitzAlan, 14th Earl of Arundel, for a clearer example), and in at least one example, the cadaverous part of the double effigy is carved in bas relief.\nThis is a whole new avenue of exploration, I reckon. If Charles Freeman is watching this, what do you think?\n\n","date":"October 29, 2015 at 5:15 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213810","author":"Hugh Farey","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"I can’t for the life of me, understand why Hugh would say there is no knowledge of the pray manuscript with the Turin Shroud. Huh? Then what was the purpose of putting an L-shape four pokered holes in the herringbone weaved pattern of the linen? The PM as we all know was drawn in 1192-1195.\n\n","date":"October 29, 2015 at 6:15 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213814","author":"Donn","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"No, well, that’s OK. There are indeed some unexplained markings on that drawing, and I often ask myself the same question as you – why are they there? I don’t know, but I’m not persuaded that they have anything to do with the Shroud.\n\n","date":"October 29, 2015 at 7:21 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213820","author":"Hugh Farey","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"The simple reason is that the first thing anyone notices about the Shroud is two images and the first thing that commentators noted about the medieval, early modern Shroud was the intensity of the blood stains. Christ is being laid out without any bloodstains and the folded shrouds do not have images on them, although there are still some, unaware of the conventions of this iconography, who think the discarded stone coffin lid is actually the Shroud even though the stepped pyramid markings are clearly not herring bone.\nThis is why the Pray Codex scenario is not believed by anyone outside Shroudie circles.\n\n","date":"October 29, 2015 at 8:32 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213821","author":"Charles Freeman","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"“This is why the Pray Codex scenario is not believed by anyone outside Shroudie circles.”  \nUntrue, but more to the point, unprovable by Freeman.\nFallacy in Logic in several categories, esp. Rash Generalization.  \nThe herringbone weave and the 4 L-shaped holes together are statistically a lock, from the standpoint of any fair-minded person, and the Freeman/Farey objections are incredibly stubborn at best and disingenuously cynical at worst…\n\n","date":"October 30, 2015 at 8:52 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213917","author":"Nabber","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"“… the Freeman/Farey objections are incredibly stubborn at best and disingenuously cynical at worst”\n“… Fallacy in Logic in several categories …”\nI think the key similarities drawn by authenticists between the Pray Manuscript and the Shroud are the Herringbone Weave and the Poker Holes. I really don’t think it either stubborn or cynical to say that the zigzag patterns on the lid of the sepulchre in the Pray manuscript look nothing at all like herringbone weave, or that the two unexplained patterns of circles on both the tomb and the lid are not necessarily representations of holes in the Shroud.\nI think before I could be accused of unnecessary obduracy I would like to see any other representation of herringbone which resembles a series of concentric zigzag ‘semi-circles’ centred on different points at the edges on a rectangle, and also any other representation of Three Marys iconography showing a piece of cloth as a rigid sub-rectangle at an unlikely angle.\nI can see that to Nabber, and no doubt to many other readers, similarities between the Pray codex and the Shroud are wholly unequivocal, but I hope that most of them will be able to understand that it is possible to disagree without being either stubborn or cynical.\n\n","date":"October 30, 2015 at 9:09 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213919","author":"Hugh Farey","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Well, Hugh, as you know I have been very interested in the iconography of the images and keeping an eye on all the early descriptions and depictions of the Shroud.  The two body images are not, of course , of the same body. You can see this from the way the arms don’t match (note the gap between the elbows and the body on early depictions which could not match the crossed hands on the front)  -they were painted ( in my view) separately and this also explains why the two bodies are different lengths. A slapdash painter??\n What has particularly interested me lately is the way that the hair at the front does not fall back as one would expect. Yet in any normal work of art it does ( e.g. Giotto in the Arena chapel, in sculpture). Interestingly there are also epitaphioi where the hair of the corpse with crossed hands is also rigid and does not fall back so there may be a link there. (See the epitaphios of King Uros II Milutin of c. 1300, now in the Museum of the Orthodox Church in Belgrade,as an example.) There is an interesting art historian, Anne Derbes, who does argue that western artists did use Byzantine motifs at this period.  Lots more research to do here and the Holy Graves of the fourteenth century Rhineland also seem to provide some examples close to the Man on the Shroud.\nI still think the Holkham Bible of 1330 is the closest template we have to the Shroud,especially the pattern of the bloodstains and the naked body on the cross. I was intrigued to find that there is scholarly backing for the idea that the Holkham Bible was used as a template for artists. See the introduction to the facsimile edition by Professor Michelle Brown, formerly Curator of Illuminated Manuscripts at the British Library.\nNone of this will seem relevant to this site as no one accepts that the  Shroud was once a painted linen. So,when I have time between other projects, I am just quietly getting my material together, knowing there is little point in sharing it here.\nSo I am still on the painted linen, NOT a forgery, but produced for an Easter liturgical ceremony. I have yet to find a specialist medievalist who has shot me down so i shall keep on going! Like any real sceptic I am open to persuasion otherwise! it would do my relics book a great boost if we could find an authentic first century relic- but no evidence I have seen to convince me that we have. (It may be that one of the other shrouds is the real one,of course.)\n.\n\n","date":"October 29, 2015 at 6:31 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213816","author":"Charles Freeman","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"“None of this will seem relevant to this site as no one accepts that the Shroud was once a painted linen. So,when I have time between other projects, I am just quietly getting my material together, knowing there is little point in sharing it here.\nYeah? I wonder why?!\n\n","date":"October 29, 2015 at 1:02 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213845","author":"Matthew L.","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Matthew, Because no one on this site is prepared to consider the evidence that this was once a painted linen when I have other sources that are prepared to. Naturally I am drawn to those who have dealt with these linens and how they disintegrate over time. If there is anyone here who has experience of medieval painted linens  who can explain why the Shroud was never such, then, of course, they are welcome to contribute.\nSTURP stated in the Physics and Chemistry paper that they had not examined any painted linens so they placed themselves outside the argument.  What is important Is the very high rate of disintegration of painted surfaces and the work that experts need to do is to assess what discolouration of the linen takes place when gesso and pigments  have lain over the surface off a linen and then disintegrated. The Zittau Veil images, which also lost their pigments, suggest a discolouration of the linen very similar to the Shroud.\nAs I always say, lots of work still to do but it will have to be done by those with more relevant specialist expertise on painted  linens that I certainly don’t have.\n\n","date":"October 29, 2015 at 1:22 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213847","author":"Charles Freeman","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"It is my opinion that enough evidence has accumulated that we should now realize that there was no invisible repair/reweave in the C14 sample area, and that the solution to the C14 dating problem is what I presented at the St. Louis conference in 2014.  I showed that MCNP nuclear analysis calculations indicate that if 3.0 x 10^18 neutrons are emitted uniformly in the body while it was in the shroud in the tomb, then three mysteries related to C14 dating are solved:\n1) Neutron absorption in N14 in the shroud creates new C14 in the shroud that is identical to the original C14 in the shroud so that the C14 date is shifted from 30 AD to 1260 AD.  The dating laboratories, not realizing that the shroud had been through a neutron absorption event, would have misinterpreted their result by assuming the wrong C14 decay curve.\n2) The results reported by the three dating laboratories were not in good agreement with each other.  Statistical analysis indicates only a 5% chance that their results were within their measurement uncertainty, so that the differences were probably (95% probability?) caused by something.  Plotting their results as a function of the distance from the end of the shroud indicates that there is a slope or gradient of 42 to 57 years per cm across their data depending on the sampling done in Tucson.  This slope in the C14 dates from the three laboratories agrees with the MCNP nuclear analysis calculations, which calculate that a uniform neutron emission in the body causes a neutron distribution in the tomb which produces just this range in the C14 dates across the sample region, so that the disagreement between the laboratory values is the result of the slope of the neutron distribution at the sample location resulting from homogeneous emission of neutrons in the body.\n3) These same MCNP calculations predict that a piece of cloth placed on the side bench about a foot in front of the back bench where the body in the shroud was located would date to about 700 AD.  This location in the tomb is a natural location for the person working on the body in the tomb to lay the face/head cloth.  According to tradition, the Sudarium of Oviedo is the face/head cloth of Jesus.  It was C14 dated to 700 AD, in excellent agreement with the MCNP results.\nWe should realize the importance of not making the common a priori presupposition of naturalism, so that we not automatically rule out anything that is beyond the laws of science as we currently understand them, so that we can follow the scientific evidence where it leads.  When this is done, I believe that the scientific evidence indicates that the solution to the enigma of the shroud is that a burst of radiation occurred within the body that did three things:  1) It caused the image, perhaps either by protons or ultraviolet based on experiments.  2) It thrust the blood off of the body, heated it turning it into a liquid, and thrust it against and into the fibers of the shroud, and   3) It caused the shift in the C14 date from 30 to 1260 AD and the slope in the C14 dates as discussed above.       Bob Rucker\n\n","date":"October 29, 2015 at 8:02 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213875","author":"Robert A. Rucker","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"– Is Joe Marino around?  Does anyone know his current assessment regarding repair, and also regarding the banding implications?\n\n","date":"October 30, 2015 at 9:11 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213920","author":"Richard Savage","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"“My opponents claim that the banding proves that there has been no repair (or, something similar).  What’s our best argument(s) otherwise?”\nThis argument is mainly based on the STURP X-Ray photographs\nSee: https://app.box.com/s/umu5p81xr42jbjqeulztb5g3un3ygdlf\nThe red rectangle shows roughly the radiocarbon area.\nIt’s true that there is no obvious anomaly.\nDoes it exclude any repair ?\nProbably not.\n\n","date":"October 30, 2015 at 4:35 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213938","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Thibault,\n– Why not?\n– Thanks.\n\n","date":"October 30, 2015 at 6:44 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-213952","author":"Richard Savage","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Richard,\nWhy Not?\nI wrote “no obvious anomaly”.\nThe term “obvious” is important.\n1) Contrary to the main part of the Shroud it’s very difficult to see clearly the bands in the C14 corner.\n2) It seems that some anomalies have been detected.\nSee:\nhttp://www.shroud.com/pdfs/whanger.pdf\nSee Fig17-20.\n3) We do not know the true meaning of these bands.\n\n","date":"October 31, 2015 at 3:02 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-214015","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Banding Proves Cloth Was Not Repaired?","post":"Thibault,\n– Thanks.\n\n","date":"November 1, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","id":"comment-214061","author":"Richard Savage","site":"shroudstory"}]
