[{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"Oh, maybe you are right. I’ve been deceived by the color of the puppet which is dark. You should try with a more human like doll.\nNo offence, but why get hung up on “positive” versus “negative”?  That only became a talking point post Secondo Pia, and the startling results of his doing a negative back to positive tone reversal (phrased in modern post-photography jargon).  But I doubt whether the first viewers of the Shroud were at all puzzled by what today we call a negative, or given to lengthy speculation as to how that image was formed. They would simply have recognized it instantly as some kind of  “imprint” left by pressing a solid object, correction, person into linen. It would have seemed no more mysterious than a muddy footprint on a clean white floor. It may have taken them a little longer to figure out the nature of the imprinting medium, but blood would have supplied a clue. They would have arrived finally at one answer only – bodily sweat!\nWhat about the back of the linum? \nThere is a a faint reverse -side coloration on my current linen imprinting. It varies from one experiment to another and it’s tricky to pin down the precise reasons why, there being so many variables to consider. I suspect it’s to do with the distance that a hot brown LIQUID cocktail of Maillard products/melanoidins migrates into the fibres via capillary movement between the fibres.\nHowever, it’s probably not  worth spending too much time to that aspect until I get some herringbone weave linen instead of the plain 1:1 I’ve been using thus far. The 3:1 weave of herringbone allows for a longer migration  on the contact side before the thread runs through to the opposite non-contact side of the fabric.\nIs the imprint only on superficial layers of the fibers like in the Turin shroud?\nCertainly it’s a relatively few fibres in each thread that are coloured. That much I know by teasing out  a single imprinted thread with its 200 of so fibres under the microscope.  Teasing out destroys the initial geometry of course, but it seems reasonable to assume that few coloured fibres equates to highly superficial coloration at thread level, though not necessarily at fibre level. It’s a tricky area, and one that has not been properly addressed by other researchers in my view.\n Before finding your post here I had the idea that maybe the shroud is the result of a chemical process caused by the scented oils they used on corpes in ancient times. The possible combination with special conditions inside the burial place could have triggered this particular reaction, similar to your experiment (there are many examples of weird things happened inside tombs due to particular chemical reactions). Maybe the shroud is not a false, maybe it’s just a singular object. I’m pretty sure that your results can be obtained experimenting with some resin’s oil (myrrh or something similar) and dust (produced by stones?). \nYou’re entitled of course to hold your  pro-authenticity view.  For my part I rejected it  years ago on two chief grounds. The first is the radiocarbon data which while unsatisfactory from a statistical sampling standpoint seems to me more likely to be closer to 1260 -1390 than 1200-1500 years earlier. The second is the small detail as regards the iconic double head-to-head body image. It never appeared until the Lirey pilgrim’s badge in the same ‘radiocarbon’ ballpark, namely the 1350s. The earlier so-called sightings of the Shroud are never of a two-fold body image that folk quickly interpret as a frontal/dorsal imprint on an up-and-over sheet of linen. Taken with the too-good-to-be-true bloodstains, scourge marks included, I regard a 14th century provenance the default position, and am frankly astonished  at the number of folk, yourself included, who still hold to a different view. \nI think this is a more realistic hypothesis than the fraud idea because if a technique like this was known in the middle ages we would have found traces of it in art for sure.\nBut it’s not about art, or at any rate mainstream art. It’s about a top-secret forgery (expressed crudely) that had to be a customized one-off. Any loose talk would have resulted in loss of months, probably years of patient  development and testing of the simple but entirely novel imprinting technology.\n But we know that people like Leonardo or Michelangelo had to use physical models in order to paint the human body in a realistic way. I mean: the use of this technique for artistic purposes It would guarantee more gains than a shroud almost unknown to the vast majority of people.\nWhy are you bringing “painting” into the discussion. The Shroud body image is not painted:  nobody can be expected to paint in those negative reversed tones, even if deliberately intending to imitate the appearance of an imprint, and do it so well as to result centuries later in the spectacular effects of   tone restoration by Secondo Pia.\nThe Shroud body image is/was clearly perceived as a body IMPRINT, so why is it so unreasonable to go one step further – provided  one accepts a medieval date of manufacture – and assume that if intended to be seen as an imprint it was decided to was produce it  by imprinting (as distinct from free-hand painting). Is imprinting any more difficult in principle than painting? Is it not simpler, requiring no artistic skill, just attention to technical detail. What was difficult was finding an imprinting medium that simulated ancient sweat. I say they found the answer in their kitchen larders – white flour and vegetable oil, with the thermal-processing equipment nearby – a bread baking oven.\n By the way I think the chemical reaction hypothesis is the more realistic.\nHave you done any hands-on experimentation to determine what is  “realistic” and what isn’t? I have – 5 years worth no less-  and my current flour-imprinting model is the 10th model to be examined in detail! I consider it simple and realistic. Anyone with an hour or two to spare can test it out for themselves in their own home. All they need, as stated, is  white flour, vegetable oil, linen and a hot oven, not forgetting plain old soap and water for the final rinse.\nThanks for your interest. There’s been a dearth of visitors to this site of late. I spend increasing amounts of time on other sites (which shall remain nameless for now!).\n","date":"February 26, 2017 at 7:00 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-8541","author":"Colin Berry","site":"colinberry"},{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"I find that “provided one accepts a medieval date of manufacture” comment interesting.  You have had several more years to perfect the process and produce a competing shroud.  How is it going?  And have you read and debunked Raymond Rogers’ 2005 peer reviewed and published paper on the carbon dating of the Shroud of Turin?\n","date":"April 1, 2018 at 9:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-10785","author":"Walter Prindle","site":"colinberry"},{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"Hello again Walter. Long time no see (2015?).\nIn fact, that particular year was the one in which  this hands-on ‘sindy’ produced his very best flour imprint (face, albeit with an ‘apparent’ beard and moustache – hmmm)\n\nI did it using my Model 9 (wet flour slurry). Thibault Heimburger MD then came in and said the images obtained with flour slurry were too sharp, not fuzzy enough. That was the signal  to switch to dry powdered  flour onto wet linen (current Model 10).  I’m now thinking there were alternative ways of creating a fuzzy image. I might at some stage revert back to a modified Model 9, especially as there are those who dogmatically maintain  the face is too angular to be imprinted. My image above, conveniently ignored,  says otherwise!\nRay Rogers? \nI did a detailed critique of his chemical dating technique (vanillin loss)  some time ago, see link below,  which still gets plenty of visits and thus far no serious criticism.  It points out the uncertainties in a system that is  somewhat temperature sensitive (vanillin loss).  That makes it impossible to know if the “ageing” loss of vanillin is really age-related (important since my models have an obligatory heating step to develop the tan coloration of a flour imprint to generate Rogers’ melanoidins (albeit via an entirely different mechanism to his, the latter involving vapour diffusion of amine decomposition products which some, myself included, consider to be somewhat credulity-straining).\nhttps://shroudofturinwithoutallthehype.wordpress.com/2014/01/31/critique-of-rogers-so-called-vanillin-clock-for-dating-the-shroud-why-was-stanley-t-kosiewicz-not-a-co-author-and-wheres-the-data/\nRogers claims, nay, assertions,  for late insertion of spliced fibres etc? They were a proverbial can of worms if you ask me – one hardly knows where to start.\nMaybe if you could flag up his claims just one at a time, I could attempt a considered reply, but I have to say I was hugely unimpressed with the overall tone and content of that paper. The main thing lacking was true scientific objectivity – quite out of character with his early contributions to sindonology – notably his detailed critique of what Dan Porter memorably called the snap, crackle and pop model (based on flashes of radiation leaving  behind the world’s first selfie on linen in a 1st century rock tomb).\n","date":"April 2, 2018 at 8:47 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-10786","author":"Colin Berry","site":"colinberry"},{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"Do you know your galaxy man is not a negative, right?\n","date":"February 25, 2017 at 7:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-8534","author":"Rospo","site":"colinberry"},{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"It is actually, since all contact imprints are tone-reversed negatives (the parts that are darkest in tone through being most prominent, thereby making easier contact with the linen,  are the ones that by the same token ( prominence – sticking out most) would reflect most light in a photographic positive).\nAre you maybe matching up the darker parts of the imprint with the seemingly darkest parts of the man? Beware: being dark red, all parts of the man tend to look dark in my small-scale photograph. But that wouldn’t be the case in a larger scale photograph where it would be easier to spot small variations in tonal density, especially if the light came in from one side such as to create better shadows.\n","date":"February 25, 2017 at 8:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-8535","author":"Colin Berry","site":"colinberry"},{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"Oh, maybe you are right. I’ve been deceived by the color of the puppet which is dark. You should try with a more human like doll. What about the back of the linum? Is the imprint only on superficial layers of the fibers like in the Turin shroud? Before finding your post here I had the idea that maybe the shroud is the result of a chemical process caused by the scented oils they used on corpes in ancient times. The possible combination with special conditions inside the burial place could have triggered this particular reaction, similar to your experiment (there are many examples of weird things happened inside tombs due to particular chemical reactions). Maybe the shroud is not a false, maybe it’s just a singular object. I’m pretty sure that your results can be obtained experimenting with some resin’s oil (myrrh or something similar) and dust (produced by stones?). I think this is a more realistic hypothesis  than the fraud idea because if a technique like this was known in the middle ages we would have found traces of it in art for sure. But we know that people like Leonardo or Michelangelo had to use physical models in order to paint the human body in a realistic way. I mean: the use of this technique for artistic purposes It would guarantee more gains than a shroud almost unknown to the vast majority of people. By the way I think the chemical reaction hypothesis is the more realistic.\n","date":"February 26, 2017 at 2:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-8540","author":"Rospo","site":"colinberry"},{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"About seven years ago I attended a prayer meeting at a catholic church in Abercynon . We were praying the holy rosary, at the end of prayer meeting the holy face of the shroud appeared around the crucifix on the altar. There were ten people present eight were able to see it, two were unable to see it. If you look at the face on the shroud you will notice a cross of light across the forehead and down the nose area. This is exactly where the crucifix also appeared to line up with it in the church.\n","date":"February 8, 2014 at 12:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-2943","author":"signsandshrines","site":"colinberry"},{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"Fascinating. But did all 8 see it simultaneously, or did one say “Hey, do you see what I  see”? One always has to factor in impressionability, regardless of whether there’s a real phenomenon there or not. Scientists are as prone as anyone else to seeing what they are supposed to see,  provided they look hard enough (or feel left out of things if they can’t)  as witnessed by those who rushed to say they too had confirmed ‘cold fusion’ back in the 1980s..\nI love “Magic Eye”. For a long time I thought it was some kind of con, but can still recall vividly the first time one of those in depth 3D images suddenly leapt out the page. Correction – into the page and “behind”. Now that’s not just eery, but totally reproducible, once one has acquired the eye for it.\n","date":"February 8, 2014 at 12:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-2944","author":"colinsberry","site":"colinberry"},{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"Hello Colin, (I apologize for the late reply).  A lady by the name of Helen asked if anyone could see anything on the altar. We all looked, I saw nothing at first, then looking at the crucifix I suddenly saw the face of the shroud appear in soft light form. There was a man by the name of Paul present there and we simultaneously said together, “it’s the face from the shroud of Turin” we all saw it, with the exception of the priest father Michael Cronin and another man. Eight of us witnessed it.\nRoger.\n","date":"August 6, 2015 at 7:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-6194","author":"signsandshrines","site":"colinberry"},{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"Thanks Adrie. Even if the Shroud were a hoax/forgery and/or gallows, correction, barbecue humour on the part of the disbanded Templars, it’s a very interesting and infuriatingly elusive hoax/forgery.\n","date":"June 25, 2012 at 5:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-322","author":"colinsberry","site":"colinberry"},{"title":"Shroud Scope 10:  my very own gallery of 20 close-up views of the Shroud – all lightly photo-edited for optimised colour-differentiation","post":"Thanks! It’s interesting.\n","date":"June 25, 2012 at 5:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/","cat":"brightness","id":"comment-321","author":"Adrie","site":"colinberry"}]
