[{"title":"Sorry, Mr.Rogers (RIP), but you got it wrong about banding in the Shroud image ruling out linen modification","post":"Hello Thibault. It is kind of you to visit my humble blog – although I’d have been happier if some of your comments were rather less caustic in tone. My only interest is in the science, as you will see if you were to spare a moment to visit my  science buzz site.\ni have decided to address your points on a new posting, but as I say there, it will take some time to do justice to them all, so you may need to check back at daily intervals to see any new instalments.\nLink:\nhttps://shroudofturinwithoutallthehype.wordpress.com/2012/06/23/reply-in-small-considered-instalments-to-thibault-heimburger-re-my-sorry-mr-rogers-posting-2/\n","date":"June 23, 2012 at 10:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/10/sorry-mr-rogers-rip-but-you-got-it-wrong-about-banding-in-the-shroud-image-ruling-out-linen-modification/","cat":"amines","id":"comment-316","author":"colinsberry","site":"colinberry"},{"title":"Sorry, Mr.Rogers (RIP), but you got it wrong about banding in the Shroud image ruling out linen modification","post":"“Blood is a liquid, albeit a viscous one , but should not some blood at least have penetrated into the furrows between the threads. There is no evidence of penetration”.\nDo you have pictures of the reverse (non image) side of the sheet ?\n“Why should blood be imaged EXACTLY THE SAME in principle as other imaged areas of the body, with the image confined largely to the ribs of the weave?”\nDo you have Mark Evans 1978 macro photos ? If yes you’ll see that blood residues are mainly found in the furrows. More generally all the properties of the blood stains at this level (as well at microscopic level) are the exact opposite of the image-only properties.\n“I now find myself wondering about the key claim that the blood was transferred to the fabric before the image. How reliable is the evidence on which that view is founded? I see from an oft-cited 2004 Rogers paper that he bases his blood-first view on a simple spot test in which he applied proteolytic enzymes to the blood stains, and found that removing the stain revealed/uncovered/exposed no image under the stain. That does not strike me as conclusive evidence for anything, certainly not for a major claim re the bloodstains. I shall obviously have to dig deeper, but if in the meantime anyone knows of better evidence than a single spot test with protein-digesting enzyme, then I’d be grateful for a link. Thanks.”\nAnd the same test applied to image-only fibers did not change at all the yellow color.\nIncidentally, another important difference between blood and image …\nThis test was performed by Adler and Heller under the microscope and not only on coated fibers but also on red globs, orange globs, and golden yellow coating from the golden yellow fibrils (serum).\n” Withing a half hour this [proteolytic] solution completely dissolved the non-birefringent red particulate fibril coatings, leaving no particulate residues; This further indicates that these particulates are blood and not Fe2O3 impregnated protein binder”.\nThey added  “Interestingly, fibrils freed of their coatings using this technique closely resemble the NON IMAGE fibrils when viewed under phase-contrast”.\nNo conclusion ? Really ? Do you have another explanation ? \nShroud Scope is certainly a wonderful tool. But not at all for the kind of studies you are doing.\nDid you ever read the peer-reviewed STURP papers ?\nAs for your “scorch” hypothesis which has been studied in depth by many researchers (including numerous experiments) many decades ago and finally dismissed.\nJust one of them (among many others) : the medulla of the image fibers is clear while the medulla of the lightly scorched fibers on the Shroud is colored.\nPlease, purchase a good microscope and test your hypothesis. \nBeing like a scorch is not the same as being a scorch.  \nRegards.\n","date":"June 23, 2012 at 8:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/10/sorry-mr-rogers-rip-but-you-got-it-wrong-about-banding-in-the-shroud-image-ruling-out-linen-modification/","cat":"amines","id":"comment-314","author":"Thibault HEIMBURGER","site":"colinberry"}]
