[{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"I hadn’t intended to blitz this site with comments, but the stimulants to comment keep coming, so here we go, with a very brief idea (shame that Ray Rogers is not around to respond).\nIf you look at the first of the graphics labelled “variegated patterns,” you can certainly see horizontal banding very clearly, but it is seen mainly where it crosses the image zones, and is scarcely visible outside those zones.\nNow Rogers talks about bleaching and impurities, and how impurities reinforce the image intensity, but is not very clear, at least in the quoted passage as regards precise mechanisms. Where the latter is concerned it gets somewhat confused, because there are so many impurities listed by Rogers – lignin, which can be bleached or unbleached, conjectural starch (“impurity coating”), saponins etc. What makes his exposition ever more opaque, at least to those of us trained in chemistry and botany, is his inclusion of “hemicelluloses” in impurities.Hemicelluloses, with a significant content of pentosans, 5 carbon sugars, are intrinsic to plant cell walls, and are a major component of the primary cell wall (PCW).\nThere is in fact a much simpler explanation for banding than the one proposed by Rogers. It is based on that PCW, a discrete botanical entity that Rogers scarcely mentioned, if at all. The PCW is highly superficial – in other words it is the first layer of cells that one encounters when approaching a flax or linen fibre from outside.  That’s because it is the first formed layer of cells in flax and other plants, and remains on the outside when the secondary cell wall is later added.  \nAll we have to do is to suppose that it is the highly superficial and chemically reactive hemicelluloses of the PCW that were the prime target for image imprinting on the Shroud, producing yellow or tan dehydrated carbohydrates and their condensation products. Secondly, the more adherent the PCW, i.e. through having  resisted flaking off in spinning and weaving, then the more intense the image. So any process, whether mechanical or chemical (as in bleaching) that strips off or reacts with hemicelluloses will lead to a lighter coloured thread, a light band in the final weave, and less intense image. Conversely, any threads in which the PCW is more intact and chemically unbleached will tend to produce a darker band, especially in the image zones where that surviving PCW and its hemicelluloses have acquired colour by whatever process caused the image.\nRaymond Rogers was a gifted chemist, but sadly he seemed to have had a blind spot for the PCW.\nMy own botany was limited to A-Level and fresher year at University, which partly explains why I’ve been having difficulty finding estimates for the precise thickness of the typical plant PCW, but nothing I’ve seen so far would rule out PCW thinness as the reason for the Shroud image layer being a mere 200nm thick or less (as suggested) if the image is formed solely on the outside- facing PCW.  Remember – the linen fibre comprises elongated single cells. (Yes they look thicker in the parent flax, but that’s because the fibres are cemented together in bundles with pectins. Retting is about degrading the pectins, with the aid of bacteria, to liberate the individual fibres that are then reassembled into threads by spinning, but are still independent fibres comprising strings of single cells).\nMany moons ago I showed that one could form an intense contact scorch on the stripped epidermis from dried onion scale leaves – the latter a gossamer thin flake also just one cell thick, presumably with a PCW that is 200nm thick or thereabouts. Don’t be deceived by superficiality.  Highly superficial layers can make excellent surfaces for image capture and colour production. \nWho needs to invoke starch or other impurity layers when there is a receptive PCW,  more in some parts than others, accounting for that banding and those differences in image intensity.\nHere endeth this morning’s lesson. You can all wake up now.\n\n","date":"October 19, 2013 at 6:32 am","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48004","author":"colinsberry","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"So Roger’s assertion that the cloth was hank-beached is incorrect? Do you have any examples of medieval cloths that display similar shade patterns?\n\n","date":"October 19, 2013 at 5:24 pm","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48057","author":"David Goulet","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"Sorry, banding – not shading.\n\n","date":"October 19, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48058","author":"David Goulet","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"Apologies again, I just re-read the post and realized it wasn’t Roger’s assertion about the hank-bleaching, but Dan’s — if I’m following the quotes right now.\n\n","date":"October 19, 2013 at 5:46 pm","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48059","author":"David Goulet","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"I have noted your additions and corrections, David, but have to say that this focus on bleaching variation as a cause of yarn variation, and yarn variation as a cause of banding, and banding as a cause of bilaterally symmetrical image cut off, and bilaterally symmetrical image cut off as a cause of an overly-gaunt face strikes me not as objective science, but more as special pleading. That hunch is reinforced when one sees the entire argument being used to dismiss a medieval provenance for the Shroud.\nSome might think that speculation as to the reasons for the gaunt face is futile unless one knows the mechanism of image imprinting. A point worth noting is that gauntness, in the sense of being narrower than one might expect, is a characteristic that is not restricted to the face. One sees it in the forearms too, one of which looks particularly stick-like, and in the fingers, giving rise to their description of “bony” with some even suggesting an X-ray type of imaging. \nPersonally I think there is a very obvious explanation for all the gauntness effects, and it has little if anything to do with bleaching or banding, and everything to do with the mechanism of imprinting. But the posting is not about that, so I’ll stop here.\n\n","date":"October 20, 2013 at 2:08 am","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48068","author":"colinsberry","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"I can’t imagin what bleaching has to do with the banding.\nThe Herringbone weave pattern which is reproduced as a screened line in contrast with the image which is represented by dots, I believe is what causes the banding effect. \nAs diverging screen lines alter in opposing angles banding will occur. And adding to the mix, a superimposed image imprinted on the linen that is represented by dots, banding becomes more obvious. Here is a basic explanation I found on line. \nIn commercial printing, continuous tone is simulated by dots (called halftone dots) printed in rows (called lines or line screens). Lines are printed at different angles to make the rows less noticeable. \nThis explanation is also the basis for security printers to stop forgeries from using copiers to reproduce images simply by adding line frequencies with dot frequencies.\n\n","date":"October 20, 2013 at 7:01 pm","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48168","author":"Giorgio","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"Giorgio: “I can’t imagine what bleaching has to do with the banding.”\nNeither can I, Giorgio, try as I may. One could imagine differential bleaching having some effect on the appearance and banding of fabric when freshly made, before or after image imprinting (though why uv light/fluorescence are needed to show it up best is another unexplained aspect). But why should it affect appearance now, centuries later, after oxidation and yellowing have reversed any initial bleaching reactions?\nIt all seems suspiciously like a carefully-crafted spin-doctored narrative to me, designed to make the the radiocarbon dating look oh so historically and technologically naive and untutored. But C-14 dating  is concerned purely with the history of C-14 atoms, and their 100% predictable decay curve, and the relevant technology is that of counting the ratio of C-14 to C-12 atoms. What happens to those shanks of thread and bolts of linen cloth now or in past centuries is irrelevant, except for contamination issues which are hardly ignored and where possible tailor-made to the material under test.\nWhat we see with the bleaching/banding story might be viewed uncharitably as the creation of an urban myth, but it’s been done in so neat, plausible and mellifluous a manner that “urbane myth” might be a kinder description.\nYup, neat, plausible but WRONG.\n\n","date":"October 21, 2013 at 5:46 am","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48200","author":"colinsberry","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"If fluorescencing was the cause that was made from individual threads bleached, sewn together that resulted in such a uniform pattern, that in itself is a mystery.\n I like your “Urban Myth” analogy.\n\n","date":"October 21, 2013 at 6:56 am","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48209","author":"Giorgio","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"I don’t see the pattern as uniform. And according to Rogers they were not “sewn” together:\nAnna Maria Donadoni, a curator at the Museum of Egyptology in Turin, pointed out locations where batches of yarn ended in the weave and new yarn had been inserted in order to continue weaving. The yarn ends were laid side by side, and the weave was compressed with the comb. The ends are often visible, and the overlaps correspond to zones of different color in the weave. The different batches of yarn show different colors.\nUV is not required.","date":"October 21, 2013 at 7:57 am","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48219","author":"Dan","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"I assume this image has already gone through the Fourier transform filters. The key function of the Fourier transform filters is to manipulate  specific frequencies. Using this method to conclude chemical analysis to me is very confusing. I would think using a spectrometer would be a better tool. \nThe uniformity of the banding is throughout the shroud. Let me clarify what I mean by uniformity. Today, paper mills adds whiteners to brighten the paper’s white. Printing over these inexpensive papers causes havoc.   Because opaque inks such as spot colors printed on these papers does cause the ink to fluoresce, viewing in different color temperatures these inks will shift hues accordingly to the light source because of the chemical make up of the ink.  However having said that, because of the different frequencies and angles that the spot color inks are laid down on the paper, fluorescing becomes very erratic.  For this reason I would  expect the Shroud’s  variegated markings to have sharp breaks and erratic pattern shapes not uniform or smooth transitions where strips go up and down throughout the shroud. We also have to expect that contaminates have been introduced throughout the Shroud’s history which should caused more erratic patterns. \nThis is why I believe the banding is caused by the linen’s converging screen angles and frequencies. And using the Fourier transform filter is a tool to filter unwanted screen frequencies and should not be used to reach a chemical analyze conclusion.\nKeep in mind, I’m not saying that bleach was not used on the linen. I have no clue.  all I’m saying is Fourier transform filters prints can’t tell you that bleach was used.\n\n","date":"October 21, 2013 at 10:36 am","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48247","author":"Giorgio","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"Dan, I felt from the initial post that your strongest point was the hank-bleaching one. That it was a process not common in medieval times vs the time of Christ. Where did you find this hank-bleaching info?\n\n","date":"October 21, 2013 at 9:57 am","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48234","author":"David Goulet","site":"shroudstory"},{"title":"Today’s How do we know?  Banding patterns and what they might mean?","post":"The Fourier filter function is to manipulate specific frequency not to be used for chemical analysis. The image you posted is displaying filtered screen angles and nothing more unless you speculate the reason for the effect. I think a spectrometry would be a better tool for chemical analysis in imaging rather than The Fourier filter. \nThe uniformity of the banding is throughout the shroud. Let me clarify what I mean by uniformity. Today, paper mills adds whiteners to brighten paper’s white. Printing over these inexpensive papers causes havoc.   Because opaque inks such as spot colors printed on these papers does cause the inks to fluoresce, viewing in different color temperatures these inks will shift hues accordingly to the light source used because of the chemical make up of the ink.  However having said that, because of the different frequencies and angles that the spot color inks are laid down on the paper, fluorescing becomes very erratic.  For this reason I would  expect the Shroud’s  variegated markings to have sharp breaks and erratic pattern shapes not uniform or smooth transitions where strips go up and down throughout the shroud. Contaminates will also have been introduced throughout the history of the shroud creating a greater erratic patterns. \nThat is why I believe the banding is caused by the linen’s converging screen angles and frequencies.  Fourier transform filter is a tool to filter unwanted screen frequencies. Any further explanation why the banding is present on the Shroud would be speculative IMO.\n\n","date":"October 21, 2013 at 11:07 am","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","id":"comment-48253","author":"giorgioprimary","site":"shroudstory"}]
