[{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"The Shroud by Ian Wilson, page 106: “Vial estimated the Shroud’s thread count at approximately eighty threads for the warp and forty for the weft, the fabric being not at all thick or coarse in texture but soft, supple and showing no signs of splitting.”\n\n","date":"July 23, 2013 at 5:31 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39611","author":"Andrew of Nashville","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"Piero Vercelli “La Sindone nella struttura tessile” Effata’ Editrice 2010\np.17-21 “Relazione tecnica sui rilevamenti effetuati sul campione di tessuto della S.Sindone di Torino il giorno 8 ottobre 1997”\n“…Ordito: viene calcolata una media di 36 fili al centimetro su tutta l’altezza del campione;” (p.18)\nTrama: n.25 fili al centimetro nella parte basse e n. 23 fili al centimetro nella parte alta. Viene calcolata una media di 24 trame al centimetro”(p.19)\nThe counting  was done by Piero Savarino, Pietro Vercelli and Giuseppe Vercelli (p.21).\nSo the means given here are 36 and 24 threads/cm This corresponds rather well with the 38/26 as given by Hamon.\n\n","date":"July 23, 2013 at 5:56 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39615","author":"Jos Verhulst","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"Freer-Waters & Jull; Investigating a dated piece of the shroud of Turin, Radiocarbon, Vol 52, Nr 4, 2010, p.1521-1527.\n“The warp fabric count is 30 yarns per cm (76 per inch) and the weft is 40 yarns per cm (102 per inch).” Although the numbers are reasonable, Freer-Waters & Jull clearly have their warp and their weft the wrong way round.\nOn the other hand; Mark Oxley; Evidence is not Proof, http://www.shroud.com/pdfs/oxley.pdf, gives counts from the following:\nTimossi: Warp 40, Weft 27\nRaes: Warp 38.6, Weft 25.7\nVial: Warp 37.6, Weft 25.8\nVercelli: Warp 36, Weft 24\nFanti: Warp 38, Weft 27.5\nThese quotations disagree substantially from Andrew of Nashville’s quote (from Wilson, quoting Vial) above, but agree precisely with Jos Verhulst.\n\n","date":"July 23, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39617","author":"Hugh Farey","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"Did Wilson convert to inches?\n\n","date":"July 23, 2013 at 8:24 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39622","author":"Dan","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"Thanks everyone!  I sent the viewer a link to this page so he could read your comments.\n\n","date":"July 23, 2013 at 8:21 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39621","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"I was unable to corroborate the Andrew of Nashville reference from Vial in either of Wilson’s 1978 or 2010 texts – not on p.106 of either.  However in the 1978 text. he provides a tabulation from the Raes’ samples which seem consistent with other values quoted above. Ian Wilson – “The Turin Shroud” pub. Victor Gollancz Ltd 1978; Ch VII ‘The Shroud as a Textile’, p.54. Piece I was from the main cloth, included cotton contamination; Piece II from side-strip, no cotton. Citing G. Raes, “Appendix B – Rapport d’Analise,” La S. Sindone, supplement to ‘Rivista diocesana torinese’, Jan 1976, p.82:\n[I (II) = Piece I (II); Wp = Warp, Wf = Weft]\nNo. threads / cm: 38.6(I, Wp); 25.7(I, Wf); – (II, Wp); 25.7(II, Wf);\nThread-size in ‘tex’: 16.3(I, Wp); 53.6(I, Wf); 18(II, Wp); 73.1(II, Wf);\nDirection of twist were all ‘Z’: (Direction of spiral matches centrestroke of letter ‘Z’).\n‘Tex’ is a textile specialist term for fineness, indicating that the thread is very fine, but there would seem to be a four-fold difference between warp and weft in both I and II. Because there was no cotton in II, Wilson seemed to think that the side-strip was added subsequently from a different source. It suited his argument of centralising the facial image for his Mandylion theory. However the cotton may have been added at some later time as part of the so-called “invisible reweave” hypothesis, either medieval or later.\n\n","date":"July 23, 2013 at 10:15 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39626","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"Try CLICKING ON THIS, The reference to thread counts is found on page 106.\n\n","date":"July 24, 2013 at 7:11 am","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39641","author":"Dan","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"Well there it is in black and white, but it must be a misprint surely. Nobody thinks there are twice as many threads in one direction as the other per unit length. Presumably Wilson’s reference derives from Gabriel Vial’s CIELT Symposium paper from 1989. Does anybody have a copy?\nMeanwhile, the plot thickens…\nThere are two photos of the same piece of shroud, at https://shroudofturin.files.wordpress.com/2011/01/image12.png and http://www.shroud.com/pdfs/arizona.pdf (Figure 2, top), both with scales, which can be printed out and literally measured. Curiously, while the weft threads (in columns across the photos) are relatively consistent at about 29 threads/cm, the warp threads (in rows from top to bottom) differ remarkably, from about 26 threads/cm in the first picture to about 42 threads/cm in the second, as if the sample had tightened up in that direction by the time Schwortz came to photograph it, or the first photo is considerably distorted in that direction.\nFascinating…\n\n","date":"July 24, 2013 at 12:01 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39656","author":"Hugh Farey","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"Okay I’ll admit my ignorance here, but what is the significance of the thread weave and any discrepancies thereof? Is it linked to sample provenance?\n\n","date":"July 24, 2013 at 12:14 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39657","author":"David Goulet","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"Hi David.  I was just wondering that myself.\n\n","date":"July 24, 2013 at 9:08 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39681","author":"Andy Weiss","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"John Peter Wild, the expert on weaving in the Roman period, notes fine linens from Egypt, Palestine and Syria with 40-70 warp and weft threads per centimetre (Cambridge History of Western textiles, Volume One, p.110). Run of the mill textiles, usually wool, tend to be in the 12-20 threads per centimetre range. So the figures quoted here help place the Shroud within the quality range which is useful to know.  As similar figures of threads per centimetre obtain in the Middle Ages,  this does not help with dating ( a point that Gilbert Raes made). The figures about a change in the number of threads per centimetre over the Shroud needs checking because no one else seems to have spotted it but it would be relevant if true.\nDoes anyone have the original comment that Flury-Lemberg made about the first century sewing techniques from Masada? There were a lot of textile fragments that had been sewn (many are listed in the excavation report with notes on the sewing technique used ) and I wonder if she had specified which one it was.\n\n","date":"July 25, 2013 at 4:20 am","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39696","author":"Charles Freeman","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"1. Figures that Wilson attributes to Vial:\nI eventually found the 80/40 figures quoted by Andrew above on p.71 of my copy of ‘The Shroud’ (Bantam Press 2010). (I wouldn’t know what heppened to the stray 35 pages.) On the same page, next paragraph, Wilson is quoting the cloth dimensions in feet and inches, so we might surmise the figures mean ‘threads per inch’. Divide 80 and 40 by 2.54, and they equate to 31.5 & 15.7 threads per cm, which is coarser than any of the authorities quoted by Hugh above, including Vial. So the 80 & 40 figures quoted by Wilson look meaningless, unless they were intended as rough indications only. Wilson’s 1978 quoting of Gilbert Raes’ figures (my #6 above) are closer to the mark. Wilson’s citation of Vial is: ‘Le Linceul de Turin – Etude Technique’ in ‘Bulletin du CIETA’, 67, Lyon, 1989, pp 11-35. \n2. Charles’ query re Flury-Lemburg’s comments re Masada:\nWilson discusses this at some length on ensuing pages (my pp 72-74).\nMy reading of Wilson is that Mme F-L seemed to envisage that the original bolt of cloth was very much wider than the present Shroud (W’s diagram implies about 3 x wider). The bolt was then expertly cut lengthwise, firstly for the main cloth of the Shroud, and then secondly for a narrow side strip. The two raw edges were then expertly sewn together, so that the final Shroud cloth presented two selvedges on its two outside edges. The seam was not visible from the face side and was only revealed when the backing cloth was removed. It seems that in her 40 years of working with ancient textiles, Mme F-L had only come across this type of invisible seam only once before, on the 1st century textiles found at Masada. Wilson provides a diagram of the seam from a Masada cloth sample. Wilson’s bibliography provides three published references by Mme Flury-Lemburg, for any further information required.\n\n","date":"July 25, 2013 at 6:04 am","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39701","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"Thanks, DaveB. ‘The stitching pattern, which she says was the work of a professional, is surprisingly similar to the hem of a cloth found in the tombs of the Jewish fortress of Masada.’ From an interview with Flury-Lemberg. If you actually look at the excavation reports from Masada- there is a very good section on the textiles in one of the volumes-they list 60 textiles 9the vast majority are wool ,not linen,) with stitchings on them. Obviously the types of stitching used varies but they are only described not illustrated. So presumably Wilson/Flury-Lemberg have either seen the originals or seen an illustrated account of them to which they have been able to relate the stitching on the Shroud .Presumably somewhere there are also illustrations of the stitching of the seam to compare the two. The evidence for these statements  often proves much harder to actually pin down than one would believe.\n\n","date":"July 25, 2013 at 9:59 am","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-39714","author":"Charles Freeman","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"Dan, \nlate in June I had decided to cease my comments on this blog just because of the most unfair and most discriminating way you treated me and systmatically censored my replies. In the ‘mean’ time you begged for CB’s friendship and comments while you completely blocked me from posting comments for one month (till this posting of yours). In the latter, and much  to my utter surprise, you were asking me for more information about the thread count for the Shroud of Turin! Since I have arboured no ill-rancor in spite of your most unfair and discriminating treatment, I willingly answer your request (and take up my comments too MUCH because of Louis’ kind words).\nI myself used Rae’s, Vial’s and Vercelli’s data to reach an average thread count. The latter is confirmed by Yves Saillard who also based his thread count on the same three authors. \nSee:\n– G. Vial Etude technique, Actes du Symposium Scientifique International, Paris 7-8 Septembre 1989, O.E.I.L., Paris (1990).\n– P. Vercelli, The cloth of the Holy Shroud, in the Turin Shroud, past, present and future, International Scientific Symposium, Torino 2-5 March 2000. Effata Editrice, Torino (2000).\n-Y. Saillard, L’inexplicable image, Etude critique d’un véritable défi scientifique, R.I.L.T., n°33/34, Avril 2010.\nHope it can help.\n\n","date":"August 7, 2013 at 6:11 am","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-40630","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max? Anyone? Thread count for the Shroud of Turin","post":"This is a come-lately post. It was actually written on August 3, 2013. Sorry.\n\n","date":"August 7, 2013 at 6:49 am","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","id":"comment-40632","author":"Max Patrick Hamon","site":"shroudstory"}]
