[{"title":"More on Strontium Isotopic Tracing of Bronze Age Danish Textiles","post":"I disagree. I don´t want to repeat myselfbut although strontium by itself migh not be conclusive, in combination with other trace elements (1)(2) may allow identification of textiles’s geographical origin.\n(1)Takako Inoue, Kengo Ishihara and Kyoden Yasumoto.International Journal of Clothing Science and Technology Vol. 22 No. 2/3, 2010 pp. 174-186\n(2) Emily R. Schenk and Jose R. Almirall. Elemental analysis of cotton by laser-induced breakdown spectroscopy. May 2010 / Vol. 49, No. 13 / APPLIED OPTICS\n\n","date":"October 4, 2012 at 6:00 am","url":"https://shroudstory.com/2012/10/04/more-on-strontium-isotopic-tracing-of-bronze-age-danish-textiles/","cat":"news_&_views","id":"comment-17212","author":"Gabriel","site":"shroudstory"},{"title":"More on Strontium Isotopic Tracing of Bronze Age Danish Textiles","post":"Much of the Danish work seems to have been done by Karin Margarita Frei (connections with Max Frei?? – just speculating).  My chemistry is limited, but I note that altho’ 87Sr and 86Sr are both stable isotopes themselves, the amount of 87Sr has been increasing over time because it is also a decay product of 87Rb, and this is said to be evident in meteorites.  Is there a possibility that this may compromise its value as a provenance indicator of ancient textiles?  Thus we may know the 87/86Sr ratios of an ancient textile, which may have remained unchanged over time, but is it valid to compare this with a present geographic / geologic region if the ratio in that regions may have changed because of decay of 87Rb?  Can anyone elucidate?  If this is a potential problem, would it not then be valid to compare textiles of comparitive ages if the provenance of any one of them were known?  Or is this a false problem?\n\n","date":"October 4, 2012 at 6:34 am","url":"https://shroudstory.com/2012/10/04/more-on-strontium-isotopic-tracing-of-bronze-age-danish-textiles/","cat":"news_&_views","id":"comment-17213","author":"daveb of wellington nz","site":"shroudstory"}]
