[{"title":"Paper Chase: The seam and missing corners of the Turin Shroud","post":"quite convincing.i hypothesised independentlyof knowing Adries theory that the shroud might be a greek himation,about 2months ago. What is Adries background?\n\n","date":"April 29, 2013 at 6:47 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","id":"comment-32200","author":"matthias","site":"shroudstory"},{"title":"Paper Chase: The seam and missing corners of the Turin Shroud","post":"Adrie’s present paper appears to be a more developed version of that which has been posted on her JesusKing website “The Turin Shroud as John Mark’s temple garment” and dated October 14,2011.  I have mentioned this previous paper a few times in comments on this web-site, in discussions about Joseph’s resourcefulness in acquiring an expensive burial cloth on Preparation Day, which was likely a semiholiday for shops and the marketplace.   \nI personally think she makes a credible case for the present Shroud cloth having been a temple garment, and it may have been John Mark’s recovered in the manner she postulates.  Alternative options that might need considering are that if it was a temple garment, it may have been Joseph’s own garment, or if not, perhaps Joseph had intended it to be his own burial shroud, as until the time of Gamaliel II (2nd century), it was quite normal for Jewish burials to include items of considerable expense. Plain-weave shrouds only became fashionable for the wealthy after Gamaliel II. \nA major reservation I have with the paper is her apparent identification of John Mark as seemingly the author of both the second and fourth gospels, the beloved disciple, the young man who ran away naked during Jesus’ arrest, and the temple secretary.  I am unaware of any authority who would make the same identification, and I feel there is much that can be said against it. \nJohn Mark is conventionally thought of as being the author of the second gospel (a source for Matthew’s and Luke’s), the cousin of Barnabas, who according to Acts deserted Paul during his mission to the gentiles, whose mother’s house in Jerusalem was a centre for the apostles to where Peter fled after his release from prison; probably the amanuensis to Peter in Rome, and who seemed later to recover Pauls’ favour and also assisted him; and who later is said to have founded the church in Alexandria where he is said to have died. He may have been the young man who fled naked in the garden.  \nBy contrast, the author of the fourth gospel is said to have written it in Ephesus, dying there at an advanced age, is generally identified as the disciple who Jesus loved and who lay on his breast at the Last Supper, could have been one of the sons of Zebedee, and a fisherman in Galilee, seeming unlikely material for a temple secretary.  \nAs the identification that Adrie makes, seems to make up a significant component of her paper, I feel that this attempt at overstating her case is likely to run into serious objections, and the paper may unjustifiably stand to fail on this account. I feel nevertheless that she has made a credible argument for the Shroud cloth having been a temple garment, which may even have been John Mark’s. However I also feel that other explanations are also possible and cannot be entirely excluded.\n\n","date":"April 29, 2013 at 6:58 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","id":"comment-32204","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: The seam and missing corners of the Turin Shroud","post":"Further to mine above: In the fourth gospel John 20:3-10, we are told that Peter and the disciple whom Jesus loved both ran to the tomb, but at first only Peter goes in.  At this point, Adrie postulates that the other disciple is John Mark, wondering if the burial cloth seen there is indeed his temple garment. This disciple whom Jesus loved is more conventionally thought of as being behind the authorship of this gospel, and is more usually thought of as being the son of Zebedee in Galilee. I find it more credible that John Mark as mentioned in Acts Paul’s epistles and I Peter, the likely author of the second gospel, is a different and distinct person from the John mentioned in the fourth gospel as the disciple whom Jesus loved as a euphemism for the author of that gospel, and who hesitated at the entrance of the tomb.\n\n","date":"April 29, 2013 at 7:31 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","id":"comment-32207","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: The seam and missing corners of the Turin Shroud","post":"The true fact is the disciple whom Yeshua loved hesitated as he was a priest and could not run the risk of being defiled in the presence of a corpse.\n\n","date":"April 29, 2013 at 8:50 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","id":"comment-32214","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: The seam and missing corners of the Turin Shroud","post":"Most likely, YoHanan Maqqaba (“John Mark”) was a priest and assistant secretary/scribe to the High Priest. Most likely, the man who wrote the 4th Gospel was not a Galilean fisherman but a priest and scribe.\n\n","date":"April 29, 2013 at 8:58 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","id":"comment-32216","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: The seam and missing corners of the Turin Shroud","post":"The author of the fourth gospel, generally identified as the disciple who Yeshua loved, lay on his breast at the Last Supper as he was the one to receive Yeshua (and his disciples) in his  house in Jerusalem. He is the one who took Mary (Yeshua’s mother) with him and became his son and was afterwards to be identified as John Mark the son of Mary (Acts 12:12).\n\n","date":"April 29, 2013 at 9:12 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","id":"comment-32217","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: The seam and missing corners of the Turin Shroud","post":"At the core of Adrie’s story construction of the burial garment, is the loss of the young man’s linen cloth in the garden. The story is only recounted in the second gospel and nowhere else. For this reason commentators have tended to identify the person as that gospel’s author.  From Papias 2nd century, the traditional author of the second gospel is said to have been Mark, Peter’s amenuensis in Rome. Mark’s role as amenuensis is supported by the closing verses of I Peter, although that epistle is said there to have been transcribed by Silvanus.  \nI find it difficult to ascribe the complex fourth gospel to John the son of Zebedee, a fisherman, although it seems that this John did finish up in Ephesus.  He could well have been the witness referred to in the conclusion of that gospel and provided the oral tradition for much of the narrative. If the long and complex farewell discourses are the authentic words of Jesus, then someone must have written them down at the time or soon after. An alternative view is that the gospel was written by John a presbyter. The gospel is extremely complex operating at several levels, and a more likely explanation might ascribe it to a Johannine school in Ephesus, with contributing elements from various ones, but finally synthesised into a unitary whole, perhaps by a single author and some additional later glosses by others. \nOnly a linguistic analysis of the second and fourth gospels could detect if they were the same author, but in view of the lapse of time between their writings, this may not even be successful, as writers will develop their vocabulary and style over such a period. I suspect that any analysis would conclude that they were different authors.\nPart of the difficulty in identifying the various participants is the very limited number of first names available in first century Palestine, and any single name whom we may assume is attributed to a single person may in fact belong to several.\n\n","date":"April 29, 2013 at 4:53 pm","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","id":"comment-32267","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: The seam and missing corners of the Turin Shroud","post":"Each of the four gospels has a short section on the calling of the first few disciples. The Synoptics all have a reasonably consistent story of this event, although Luke gives a slightly different version of it. In John however the 3rd and 4th disciples have different names from those in the Synoptics, and it is a different story. \nIn both Matthew and Mark, the event takes place at the Lake of Galilee and all four are fishermen, Simon and his brother Andrew are called, together with their partners James and John, the sons of Zebedee; Mt 4:18-22; Mk 1:16-20. Luke does not mention Andrew, but it is still a fishing scene; Jesus gets into Simon’s boat, preaches, a sub-story of a large catch of fish is added in, the three of them then follow Jesus; Lk 5:1-11. In John the story is different. Jesus passes by where John the Baptizer is preaching with two of his disciples, the Baptizer comments “Look there is the lamb of God!” Hearing this the two disciples catch up with Jesus and asks him to show where he lives. One of the disciples was Andrew “the brother of Simon Peter”. Early next morning Andrew meets his brother Simon saying “We have found the Messiah” and takes Simon to Jesus. The next day Jesus meets Philip and says “Follow me.” Philip finds Nathanael, and an interchange between Jesus and Nathanael follows concerning Jesus seeing him under a fig tree, consistent with John’s presenting Jesus as a person with special supernatural knowledge; Jn 1:35-50. \nIn view of the disparities between the 2nd and 4th gospels descibing the calling of the first disciples, there has to be a conclusion that the two gospels were written by two different authors. If the young man who loses his linen cloth in Mark’s gospel is the author of that gospel (Why else mention the incident?) then he cannot be the same person identified as the “beloved disciple” which appears to be a euphemism for the disciple associated with the writing of the fourth gospel. In that case the Adrie hypothesis that the two men are one and the same person has to fail.\n\n","date":"April 30, 2013 at 1:25 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","id":"comment-32298","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: The seam and missing corners of the Turin Shroud","post":"Reminder for Dave: the 2nd Gospel is Peter’s memo in koine/translation Greek NOTJohn Mark’s stricto sensus.Actually it is a literal translation of Peter’s oral Galilean Hebrew by both Peter himself and John Mark acting as an assistant translator and secretary).  Methinks you shall discriminate between the true author (Peter) and his assistant-translator-scribe (John Mark).\n\n","date":"April 30, 2013 at 6:15 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","id":"comment-32322","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: The seam and missing corners of the Turin Shroud","post":"Max, I don’t think I have a problem with that, and I recall we have discussed this very thoroughly in another recent posting.  It is Papias who says that the second gospel was written by Mark, although apparently Papias also makes the reservation, “although not in the right order”, whatever he might have meant by that. The way I read Adrie’s paper is that she identifies the “beloved disciple” in the 4th gospel as John Mark.  I think it is more a euphemism for the disciple associated with the writing of the 4th gospel. The fourth gospel is the only one to use that expression.  Now following your argument that “Mark” is setting down Peter’s version, he would be aware of that gospel’s section on the calling of the first four disciples.  But in the fourth gospel, this story is quite different.  So I maintain that the “John” associated with the writing of the fourth gospel cannot be the “Mark” associated with the second gospel, who seems to be the “John Mark” mentioned in Acts 12 and elsewhere. If you do not see that as a persuasive argument, can you provide sufficient reasons for identifying John Mark as the “beloved disciple” in the fourth gospel? That would then argue that this “beloved diciple” is not in fact associated with the authorship of the fourth gospel at all, because of the disparity of the two stories I’ve mentioned.\n\n","date":"April 30, 2013 at 7:44 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","id":"comment-32336","author":"daveb of wellington nz","site":"shroudstory"}]
