[{"title":"A Guest Posting by O.K. :  Blood on the face of TSM?","post":"To whom is this comment?\n\n","date":"November 24, 2013 at 9:43 am","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","id":"comment-52663","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by O.K. :  Blood on the face of TSM?","post":"To Ruello. I goofed in posting it here.\n\n","date":"November 24, 2013 at 3:50 pm","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","id":"comment-52700","author":"Dan","site":"shroudstory"},{"title":"A Guest Posting by O.K. :  Blood on the face of TSM?","post":"Because their sensitivity in different wavelengths can be different. That’s crucial here. Let’s analyze two photographs, one by Enrie, and one by Schwortz: The differences are obvious. On the Schwortz photo, the blood marks are much more intense in comparison with the body image, than on Enrie one. It is due to the fact that Enrie’s plates were much more sensitive in the yellow part of the visual spectrum, while Schwortz’ were more sensitive in red. The most important observation is, however, that the face on the Schwortz’ is much more intense than on Enrie, almost as intense as the blood marks –thus suggesting that it is actually created by the blood marks!\nCan you explain this further. What is the assumption based on this statement. I’m confused.\n\n","date":"November 24, 2013 at 4:24 pm","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","id":"comment-52701","author":"Giorgio","site":"shroudstory"},{"title":"A Guest Posting by O.K. :  Blood on the face of TSM?","post":"Explanation? See once again “The Real Face of Jesus”  http://www.youtube.com/watch?v=WNJPJ4JwHeE 27:00-28:30\nEssentially different photographic films or plates have different sensitivity in different parts of the visible spectrum -this means that if a plate is more sensitive in red than yellow, red parts of the object (like bloodmarks of the Shroud) are brighter on the photo than yellow parts (body image), and vice versa. The Enrie’s photo were more optimised for yellow body image than for example Schwortz photo -this is why they are still (despite some drawbacks) widely used to analyze details on the Shroud.\nSee Schwortz picture -the red parts of the image (blood marks) are much brighter then the rest of the body, and so is the facy, contrary to Enrie’s photo. This is not due to different contrasts -compare knees and face on both picture’s. On Enrie’s their luminosity is comparable, on Schwortz not, the face is more intense.\n\n","date":"November 24, 2013 at 6:00 pm","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","id":"comment-52710","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by O.K. :  Blood on the face of TSM?","post":"With your experience in printing you have raised good points, Giorgio!\n\n","date":"November 24, 2013 at 4:54 pm","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","id":"comment-52706","author":"Louis","site":"shroudstory"},{"title":"A Guest Posting by O.K. :  Blood on the face of TSM?","post":"Thank you Louis, I’ll leave it at that.\n\n","date":"November 24, 2013 at 9:17 pm","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","id":"comment-52720","author":"Giorgio","site":"shroudstory"},{"title":"A Guest Posting by O.K. :  Blood on the face of TSM?","post":"Tamburelli & Balossino’s 3D eidomatic reconstruction of the TS face covered in blood we see above is almost totally biased. There were/are at least 2-3 times less blood decals than most misleadingly, it shows here since at the time of their reconstruction, T& B were not aware or totally overlooked the presence of possible ghost writings and objects, very faint floral images and coin partial blood decal tiny patterns were also recorded on the  TS fabric on the face area. Actually,T & B mixed up everything and overdid it as far as TS face haematic cartography is concerned.\n\n","date":"November 26, 2013 at 8:17 am","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","id":"comment-52807","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Guest Posting by O.K. :  Blood on the face of TSM?","post":" T& B were not aware or totally overlooked the presence of possible ghost writings and objects, very faint floral images\nThey were aware about ghost writings, at least.\nand coin partial blood decal tiny patterns were also recorded on the TS fabric on the face area.\nThat’s direction I am trying to go now, most of the image of the face is not recorded by the yellow ‘image’ fibers, but by brownish-red blood fibers, according to this hypothesis.\n\n","date":"November 26, 2013 at 8:59 am","url":"https://shroudstory.com/2013/11/24/a-guest-posting-by-o-k-blood-on-the-face-of-tsm/","cat":"blood_studies","id":"comment-52809","author":"O.K.","site":"shroudstory"}]
