[{"title":"Colin Berry is not Seeing Red","post":"From his very look at an actual small fragment of blood he  discerned in his labs high-powered microscope with different mode of viewing, Heller describes what he saw as bright red. Adler later concurred. Explaining the bright red color was a challenge but they believed that it was the result of the torture Christ endured releasing bilirubin into the blood stream. \nThey did not offer off the cuff  anonymous opinions. They checked their findings with associates and received confirmation. They used multispectral analysis down to the nanogram level. They published in a peer review journal.\nNONE of the photographs taken of the  Shroud are fine definition enough to visualize that level.\n\n","date":"May 27, 2015 at 6:22 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200332","author":"John Klotz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Correction: Not nanogram but nanometer. (gram relates to weight,  meter relates to size.)  A  nanometer is 10-9 of meter, or one billionth of a meter\n\n","date":"May 27, 2015 at 10:59 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200346","author":"John Klotz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Various people have commented the the blood has an unexpected redness, not just Heller and Adler, but, more relevantly those who have seen the Shroud under different lighting conditions. Some have said that the blood looks “fresh” as if the redness were witness to a miracle, or to a pathological state (not as yet demonstrated), and others say that the redness is merely witness to the blood not being blood at all, but paint. Some say that the blood could have been real blood, but given its freshness with a bit of paint on top.\nSome observers suggest that the blood looks pinker in daylight than it does inside, which may be due to the different spectra of the illumination, or due to fluorescence derived from the sunlight, not achievable using artificial light. Miller and Pellicori’s fluorecence tests do not confirm this suggestion. \nMy own observations on Shroud 2.0 are that the blood does look too pink to be nothing but blood, regardless of any speculations about bilirubin, methemoglobin etc. But then, it also looks too pink to be iron oxide. It does look like red madder.\nThe identification of blood rests largely on Heller and Adler’s positive tests for porphyrins, both chemically and spectroscopically, and also bilidenes, via a conventional test kit. It has been pointed out that porphyrins are present in other materials such as chlorophyll and urine, but the field is definitely narrowed to a fairly small range of possibilities, including actual blood.\n\n","date":"May 27, 2015 at 7:00 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200334","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"My experts will be acknowledged in any academic articles I write, but so far there has been a consistent assessment that this is not dried blood.\nThere is no reason to believe that it is blood until the tests on Shroud samples are replicated in a forensic laboratory.\n…..but I don’t have access to the STURP tapes.\n\n","date":"May 27, 2015 at 2:50 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200361","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Charles,\nMost of the STURP tapes were sent back to Turin after Adler’s death by his widow..\nIn any case, after McCrone, Rogers, Adler etc., these poor remains are useless.\n\n","date":"May 27, 2015 at 3:10 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200364","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Yes, the blood on the Shroud is “too red”.\nYes the color of the blood strongly depends on lighting etc.\nBut, as a general rule, it is too red.\nNevertheless, it is human blood.\nThe identification of blood rests on Heller and Adler’s tests (not only porphyrin, Hugh, but also many other tests for the other components of blood, including immunology) AND P.B. Bollone’s tests as well.\nDo you really think that it could be rose madder?\nMc Crone himself found some rose madder dye but never said that it is related to the blood.\nIt is not iron oxide and it is not rose madder.\n“The field is definitely narrowed to a fairly small range of possibilities, including actual blood.”\nWhat kind of possibilities?\nIt is real human blood but too red.\nWe simply do not know why.\n\n","date":"May 27, 2015 at 2:55 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200362","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I felt that Colin’s inserted picture of Kim Kardashian (a few weeks back) was too red, but perhaps he used MS Office Picture Manager…..\n\n","date":"May 27, 2015 at 7:22 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200335","author":"Nabber","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Colin Berry is not seeing red, he is not seeing bilirubin either.\n\n","date":"May 27, 2015 at 10:02 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200341","author":"anoxie","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Nitrogenous pigments: \nTetrapyrroles, porphyrins, and their derivatives:\nA biologically important class of water-soluble, nitrogenous 16-membered ring, or cyclic, compounds is referred to as porphyrins. The elementary structural unit of all porphyrins is a large ring itself composed of four pyrrole rings, or cyclic tetrapyrroles. This basic compound is known as porphin.\nPorphyrins combine with metals (metalloporphyrins) and protein. They are represented by the green, photosynthetic chlorophylls of higher plants and by the hemoglobins in the blood of many animals.\nPorphyrins:\nMany invertebrates display in their skins or shells porphyrin pigments (or salts of them), some showing fluorescence (i.e., the emission of visible light during exposure to outside radiation). In addition, various porphyrins occur in secretory and excretory products of animals, and some kinds, predominantly the phorbides, which result from the breakdown of chlorophyll, have been recovered from ancient natural deposits such as coal and petroleum and from muds of long-buried marine and lacustrine strata. Ooporphyrin is responsible for the red flecks on the eggshells of some plovers and many other birds. The African turacos (Musophagidae) secrete a copper salt of uroporphyrin III into their wing feathers. This deep-red pigment, turacin, is readily leached from the feathers by water containing even traces of alkali. The green plumes of these birds owe their colour to the presence of turacoverdin, a derivative of turacin. \nHemoglobins:\nHemoglobins are present in the red blood cells of all vertebrate animals and in the circulatory fluids of many invertebrates, notably annelid worms, some arthropods, echinoderms, and a few mollusks. The hemoglobin molecule consists of a heme fraction and a globin fraction; the former consists of four pyrrole moieties (porphin) with a ferrous iron (Fe2+) atom in the centre. The globin fraction is a protein that may constitute more than 90 percent of the total molecular weight of hemoglobin. Hemoglobins have the capacity to combine with atmospheric oxygen in lungs, gills, or other respiratory surfaces of the body and to release oxygen to tissues. They are responsible for the pink to red colours observed in combs and wattles of birds and in the skin of humans and other primates. Particularly prominent are portions of the face, buttocks, and genital areas of baboons. \nChlorophylls:\nChlorophyll is one of the most important pigments in nature. Through the process of photosynthesis, it is capable of channeling the radiant energy of sunlight into the chemical energy of organic carbon compounds in the cell. For a detailed account of this process, see photosynthesis. A pigment very much like chlorophyll was probably the first step in the evolution of self-sustaining life. Chlorophyll exists in several forms. Chlorophylls a and b are the chief forms in higher plants and green algae; bacteriochlorophyll is found in certain photosynthetic bacteria.\nThe chlorophylls are magnesium porphyrin compounds in which a cyclic tetrapyrrole is attached to a single central magnesium atom. They contain two more hydrogen atoms than do other porphyrins. The various forms differ in minor modifications of side groups attached to the pyrrole groups. In higher plants, chlorophyll is bound to proteins and lipids aschloroplastin in definite and specific laminations in bodies called chloroplasts. The combination of chlorophyll with protein in chloroplastin is of special significance, because only as a result of the combination is chlorophyll able to remain resistant to light.\nBilins:\nAmong the metabolic products of certain porphyrins, including the heme portion of hemoglobin, is a series of yellow, green, red, or brown nonmetallic compounds arranged as linear, or chain, structures rather than in the cyclic configuration of porphyrins. These are the so-called bilins, or bilichromes. Small quantities of the red waste compound, bilirubin (C33H36O6N4); a green product formed from it by the removal of two hydrogen atoms, biliverdin (C33H34O6N4); and various other chemically similar compounds occur in normal tissues and may be conspicuous in excretory or secretory materials under normal circumstances and certain pathological conditions. The bile pigments, although first identified in mammalian tissues or products (e.g., in the bile of the gall bladder), are by no means confined thereto. Various members of the bilichrome series are encountered in invertebrates, lower vertebrates, and in red algae and green plants.\nAlthough the bile pigments of animals arise in all probability from the catabolism of heme precursors, there is evidence that bilirubin, accompanied by iron salts, promotes the synthesis of new hemoglobin when injected into humans, dogs, or rabbits suffering from secondary anemia.    Etc, etc, etc …. …. \nI would conclude that chlorophyll comprises porphyrins attached to a Magnesium atom.  Hemoglobin comprises porphins attached to an Iron atom.  Bilins are non-metallic porphyrins.\n\n","date":"May 27, 2015 at 3:24 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200366","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"The same old story repeated over and over again which hopefully should be brought to an end with Thibault’s comment above. It is evident that Turin accepted the views of Drs. Heller and Adler and in fact it was even stated that the “second face” was nothing but an illusion created by blood marks. See the response to question 8:\n   https://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"May 27, 2015 at 4:06 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200368","author":"Louis","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"The first time I heard about the too red blood was through Barrie Schwortz saying that for him it was the last big issue. He presumably had as much photographic evidence as well as that from personal observation to be sure of his facts.\nI thought it odd that he was persuaded by one test when presumably like the rest of us he could have asked any forensic expert what they thought- or at least got a second opinion.\nIf then bloodstains are two thousand years old ,as some appear to believe, then it is sad that they survived on the Shroud for two thousand years and were then lost by STURP within thirty.\n\n","date":"May 27, 2015 at 4:57 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200372","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I don’t that’s fair on STuRP, do you? The fragments of the Shroud did not belong to them, and were not lost; they were returned to their owner. Nothing wrong with that. Thibault, above has referred to some findings by Baime Bollone. These findings were made by using fragments that were removed from the Shroud by vacuuming, were kept illicitly, and tested without permission. As far as I know the subsequent owners of the Shroud do not acknowledge them.\n\n","date":"May 27, 2015 at 5:12 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200373","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I was approached on Tuesday by a TV producer who wanted to know about the history of the Shroud. Naturally I told them to get Beldon Scott and master that before going any further. If it was history that they were after I would be happy to help further.\nWhat would one say ,if asked, which I was not, was the status of the STURP tapes  which as you will all know were a representative  cross section from different parts of the Shroud image and non-image areas. From the above we can learn that the total sample may have been broken up with some parts going back to Turin but that after MCCrone, Rogers, Adler, etc, had worked on them they were useless and so presumably were not available for replication of the original tests.\n\n","date":"May 28, 2015 at 1:18 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200399","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"“Thibault, above has referred to some findings by Baime Bollone. These findings were made by using fragments that were removed from the Shroud by vacuuming, were kept illicitly, and tested without permission. As far as I know the subsequent owners of the Shroud do not acknowledge them.”\nNo Hugh. Bollone’s findings were based on several pieces of threads (yes threads, mostly from the bloodstains,not only fibers!) taken by him during the night of 9 October 1978, just before the beginning of STURP’s work.\nObviously this was planed and made with the authorization of Gonella and Ballestrero in the presence of the STURP members, Gonella and Max Frei.\nBollone’s work on these fragments were of course authorized.\nIn fact, given the sampling method, Bollone had much more material (blood) than STURP.\nBoth teams (STURP and Bollone et al.), using different methods, obtained the same final result: it is blood beyond doubt.\n\n","date":"May 28, 2015 at 6:03 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200411","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Gosh. I didn’t know that. While STuRP had nothing but a few fibres sucked off the surface, Baima Bollone was able to cut away whole threads? And nobody in STuRP even mentioned this? Curious.\n\n","date":"May 28, 2015 at 6:20 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200415","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hugh,\nThat there was antipathy between members of the  STURP team and Ballone is well documented. Ballone and the Turin Confraternity resented the intrusion of the Americans into what the regarded as their monopoly.\nHere’s a freebie from my book.\n“Less than a week before the scheduled departure for Turin, Centro di Sindonologia cabled D’Muhala asking him to send the twelve hour protocol. D’Muhala immediately called Jumper and asked him what to do about the cable. Jumper replied: “The hell with it. Send them our ninety-six hour protocol, and we will argue it out when we get there.” It ought to have been clear to the American scientists  by this time, that they were facing a good deal of political intrigue in Turin and that many in the Centro were virulently anti-American and resented the intrusion of the Americans. It also appeared that there were those in Turin and the Vatican who were welcoming the American initiative. The issue would be decided on the ground in Turin.\n“On September 28, the sudden death of Pope John Paul I added a whole new complexity to their situation.\n“The following day the STURP team embarked at Kennedy Airport for Turin. To have gotten as far as they did, in as good shape as they did, was a virtual miracle. It was also a combination of hard work, brilliant organization and a collaboration of some of the finest scientific minds in the world. In the UK, the talents of David Rolfe and Ian Wilson had contributed to the impetus for their mission by dramatizing their quest. Clearly, Frs. Rinaldi and Otterbein had found allies in Turin and the Vatican. Just as clearly were those there who wished them ill and resented the American intrusion into their world. \n“So, as their plane roared down the JFK runway, lifted into the air and tucked its landing gear away, no one could know with any surety what awaited them across the sea and whether they might not be totally frustrated in their endeavor. Maybe God knew   although more than one member of the STURP team harbored doubts about whether He existed at all.\nQuantum Christ, p. 68\n\n","date":"May 28, 2015 at 6:32 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200417","author":"John Klotz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"“Gosh. I didn’t know that. While STuRP had nothing but a few fibres sucked off the surface, Baima Bollone was able to cut away whole threads? And nobody in STuRP even mentioned this? Curious.”\nRead John’s answer. It’s the truth.\nAlso read the extraordinary book of Heller: “Report on the Shroud of Turin” , 1983.\nI have it in French.\nPlease purchase this book: it’s a must!\nThis book is the incredible adventure of STURP from the beginning (you will see how serious was the preparation of the whole work).\nWhat I wrote above is entirely described in this book (and confirmed in several papers of Bollone).\nYou will also understand the many conflicts between STURP and the Centro (at the time in the hands of Bollone).\nWelcome in the world of the history of the modern studies of the TS :-)\n\n","date":"May 28, 2015 at 9:47 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200430","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I agree with Thibault: Buy John’s book. It is very informative.\n\n","date":"May 28, 2015 at 12:18 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200438","author":"Dan","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"“Colin wasn’t questioning it then, was he?”\nDan, in the old days Colin wasn’t questioning it.\nHe seemed confident in Adler’s expertise:\n“Alan D.Adler was one of STURP’s top chemists, a porphyrin specialist, someone who could be relied upon to recognize a red colour that was simply too bright to be aged blood.”\nhttps://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/#comment-29550\nIt was even an argument for his leech hypothesis:\nhttps://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/#comment-29673\n“4. It might explain the unexpectedly bright red colour and its longevity.”\nI think you’ve already portrayed Colin Berry as Don Quixote tilting at a windmill, he’s not Don Quixote, he’s the windmill.\n\n","date":"May 28, 2015 at 2:33 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200402","author":"anoxie","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Thought for the day. Anti-authenticists seems as far away as ever from convincingly explaining the Shroud image, Colin’s interesting experiments and ideas not withstanding.\n\n","date":"May 28, 2015 at 4:36 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200406","author":"Thomas","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Thought for tomorrow. So are authenticists.\n\n","date":"May 28, 2015 at 6:09 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200413","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I don’t think so.  To validate any claim of anti-authenticity, it is necessary to postulate a credible craft process to achieve all the properties of the image.  That does not look like succeeding any time soon, despite all the efforts being made to achieve it.  The authenticist can claim it was an unknown natural process, or else a miracle, neither of which are admissible by the anti-authenticist.\n\n","date":"May 28, 2015 at 6:16 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200414","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Daveb- as numerous specialists have pointed out to me, a full size cloth from the ancient world would be so much rarer a survival than one from the medieval world ( which is rare enough to be of interest in itself) and so the onus is on the authenticists to prove their case rather than the other way round. Have you read the fascinating paper on Palestine textiles  by the organic materials specialist from the Bari Conference – one of the nine they published? It seems to have been overlooked here and even includes a reference to a much later example of the Flury-Lemberg stitch.\nChristians did not give spiritual power to and collect relics before the fourth century, there were hundreds of thousands of medieval relics so a relic first recorded in the medieval period is more likely to be of that period. \nIt only needs one expert associated with linen conservation to give specialist support to the idea that this is a linen discoloured by having had gesso and paint on it for several centuries before these disintegrated. Then we would have a solid working hypothesis. I am working on it but would prefer to publish in a recognised specialist textile journal with a specialist co-writer to give me wider credibility.\nMeanwhile the balance of probability is overwhelmingly against the survival of such a large cloth over two thousand years unless it had been in a tomb in Egypt. If it had been first century, we would have had some excited textile specialists crawling over a unique three-in-one herringbone weave , not otherwise known until third century silk damasks, of this size. This is why I like the Bari paper which sets things into perspective.\n\n","date":"May 28, 2015 at 8:43 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200424","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"The painting theory is garbage. The image is clearly based on contact with a bodily form – either a real body or a statue / bas relief.\nI’m open to non-authenticity arguments but painting is not one of them. If you properly inform yourself of shroyd literature charles then you would reach tgat view.\n\n","date":"May 28, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200464","author":"Thomas","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I should think that if I were in the position of Dr Freeman, I should be concerned at the likely adverse effect on my professional reputation than “to publish in a recognised specialist textile journal”, an hypothesis which so contradicts what is scientifically known about the nature of the image, a superficial oxidation limited to the crowns of the threads, reducible by diimide, the absence of any signs of painting whatsoever, a realistic image of a human corpse which lacks any artistic precursor, with no evidence of any similar artifact, and an hypothesis which lacks the slightest support of any scientific corroboration and lacking any intent to research the same.\n\n","date":"May 28, 2015 at 7:06 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200474","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Claiming it was caused by an unknown natural process is not a whole lot more convincing than an unknown artificial one, but I agree that a miracle is an option for the authenticists but not for the non-authenticist.\n“Non-authenticists” not “Anti-authenticists.” There are many of the former, but, I hope, very few of the latter.\n\n","date":"May 28, 2015 at 6:24 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200416","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I should be curious in knowing what both Hugh and Charles make of the pattern of water stains that predate the 1532 fire, and analysed by Aldo Guerreschi which he presented on British TV in 2004, and his explanation that it is consistent with accordian folds and stored in an earthenware jar as were the Dead Sea scrolls which also happened to survive a similar efflux of time.  There is no known record of the TS being stored in such a way post-dating 1355.  However I would not doubt that either of them would be capable of dreaming up some alternative self-satisfying scenario.\n\n","date":"May 28, 2015 at 3:54 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200449","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hi Mr Farey – Everything depend on whether you believe in resurrection or not. If you believe in resurrection, then it is a unknown process to human beings and also the creating of an image on the Shroud is also and unknown process to human beings.\nIf you are not believing in resurrection then the creation of the image is a forgery to human beings. That why Mr Freeman and his experts think it is a painting. Also controversial Carbon dating supports views of Mr. Farey and Mr. Freeman.\nBut most of the Shroud researches proved that image on the Shroud is not a painting.\n\n","date":"May 28, 2015 at 4:07 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200453","author":"Sampath Fernando","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I think Aldo Guerreschi was a major influence on my interest in the Shroud, in that he took perfectly clear and obvious marks that everybody had unthinkingly associated with the 1532 scorch marks and demonstrated incontrovertibly that they were no such thing. Since then, as you know, I have attempted to track every finding about the Shroud which “everybody knows” back to its primary source, often to discover that it wasn’t anything like as clear to the scientist who discovered it as it is to his readers and adherents.\nI do have a copy of Heller’s book and think it gives a wonderful feeling for the atmosphere and activities of the STuRP team, although a little embroidered for the sake of keeping the story alive. However he does not mention Baima Bollone at all.\nBelief in the resurrection is irrelevant to the Shroud. Resurrection theology has moved on a long way from attempts to explain the physics of the empty tomb – which Pope Benedict referred to almost contemptuously as “the mere resuscitation of a corpse” – to what it was that enabled the early church to gain such a foothold in European culture. That’s not to say that there could not have been a miracle, just that it is not necessary for belief in the resurrection or the foundation of the church.\n\n","date":"May 28, 2015 at 5:09 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200458","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"What?????\nSorry that’s gobbly gook Hugh.\nmiracle not necessary for belief in the resurrection? True, I guess, if you believe in the resurrection in a metaphorical sense. But I think the NT is pretty strong testament to the resurrection being much more than metaphorical (although it obviously encompasses meaning).\nSampath is right – if you believe in the resurrection as a literal event then it is perfectly conceivable that the Shroud image would have been created by that event.\nSampath is right\n\n","date":"May 28, 2015 at 5:27 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200462","author":"Thomas","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hugh,\nI am of course indebted to Heller’s book. However, the same person who steered me to Heller’s book and who was a member of the STURP team told me the story of Ballone and his antipathy. I don’t choose to reveal my source but it’s a source I trust.\nOne of the good things that has happened recently is the leadership role now being played by Bruno Barberis at Turin Centro. At one conference he held STURP as a model for  future examinations of the Shroud but a “STURP” with true international membership..\n\n","date":"May 28, 2015 at 5:32 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200463","author":"John Klotz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hugh:  “Belief in the resurrection is irrelevant to the Shroud.”  \nLet me fix that for you:  “I, Hugh, believe that Belief in the resurrection is irrelevant to the Shroud, but I could be wrong.”\n\n","date":"May 29, 2015 at 7:16 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200511","author":"Nabber","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hugh: “I think Aldo Guerreschi was a major influence on my interest in the Shroud, in that he took perfectly clear and obvious marks that everybody had unthinkingly associated with the 1532 scorch marks and demonstrated incontrovertibly that they were no such thing. Since then, as you know, I have attempted to track every finding about the Shroud which “everybody knows” back to its primary source, often to discover that it wasn’t anything like as clear to the scientist who discovered it as it is to his readers and adherents.”\nOK, but you did not answer to the question of Dave.\nHugh: “I do have a copy of Heller’s book and think it gives a wonderful feeling for the atmosphere and activities of the STuRP team, although a little embroidered for the sake of keeping the story alive. However he does not mention Baima Bollone at all.”\nFalse.Please, read it again.\nFor example,in the French Edition (p.116):\n” Alors, le groupe italien se mit à l’oeuvre. Baima préleva des fils entiers aux emplacements des empreintes et des taches de sang, laissant ainsi des marques tout à fait visibles. Ce spectacle faisait bondir Jackson…”\nHugh, I am uneasy.\nWhere are you going now ?\n\n","date":"May 29, 2015 at 3:28 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200540","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Directed to Hugh:\nHugh, where did you get that quote from Benedict XVI? The last paragraph in the link below has the exact opposite:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\n\n","date":"May 28, 2015 at 7:47 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200476","author":"Louis","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Thanks for the link, Hugh. The author is a reactionary and makes use of the fact that Benedict did not express himself clearly.\n\n","date":"May 29, 2015 at 9:42 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200522","author":"Louis","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hi Louis. Your last paragraph, referring to Meier and Benedict XVI, puts the theological position accurately. Apart from the theologically valid but unscientific statements about the fullness of God and pointing beyond history, your key sentence is “That is a reasonable explanation without the need to go into details.” You will find Benedict’s position very well set out in Chapter Nine of his ‘Jesus of Nazareth: Holy Week’ and a somewhat sour condemnation of his theology by Donald Sanborne at http://www.traditionalmass.org/images/articles/RazResArt.pdf.\n\n","date":"May 29, 2015 at 1:52 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200490","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hugh,\nI have read the Sanborne article. Does the reactionary philosophy that Donald Sanborne espoused in that article reflect your view of Catholicism? That’s not an idle or impertinent question. \nAmong other things he seems to be wedded to monogenesis and the teaching of the Scholastics that were totally uninformed by modern science. I am also confused by his reference to Christ’s “physical soul” and his claim that Benedict rejects the concept of a “physical soul.” \nSo do I, if the concept of the soul is not illuminated by the issues of the quantum nature of intelligence and consciousness.\nSanborne seems to be essentially what I identify as a fundamentalist Protestant ethic – we are saved by faith alone. That leads to a certain intellectual arrogance: the authenticity of the Shroud is not an important issue because I have “faith” and don’t need it to be authentic.\nThe authenticity of the Shroud is important because it is a Revelation that gives physical substance to the Gospel accounts. In age where we have advanced so far in Science to be knocking on the door of the nature of consciousness and its survival as a part of the quantum information of the Universe, that is no small thing.\nOne thing, in my opinion, the Gospels make clear: We are saved by love, but that’s another debate.\n\n","date":"May 29, 2015 at 6:14 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200504","author":"John Klotz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"“Does the reactionary philosophy that Donald Sanborne espoused in that article reflect your view of Catholicism?” No, it doesn’t. I’m with Benedict XVI., not Pius X.\n\n","date":"May 29, 2015 at 6:56 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200506","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Phew. It would be hard to teach physics otherwise. Glad we are on the same page on that score.\n\n","date":"May 29, 2015 at 7:31 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200513","author":"John Klotz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hugh. the interviews Benedict XVI gave to Peter Seewald, former editor of “Der Spiegel” and ex-communist, are worthwhile reading. The pontiff refused to see any questions in advance and the blunt-spoken Seewald regained his Catholic faith.\n\n","date":"May 29, 2015 at 9:47 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200523","author":"Louis","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I think it’s fair to say that most of the popes were all men of their age and attempted to deal with the problems of the universal church of their time as best they could.  That was the case with St Pius X, and for that matter all those who came after him.  However that is not to say that everything a pope has to say on any such matter is necessarily infallible. \nI have before me from my youth an old battered soft-cover copy of “The Papal Encyclicals in their Historical Context” written by Anne Fremantle in 1958, which I still value for its content.  In the early 1900s, sound doctrine was in peril as a result of a movement within the Church which sought to follow the extremes of a certain German Protestant trend which saw much of the New Testament as mythology.  Certainly there is mythical content there, but Christianity is founded on definite historical events, centred on the life, death and resurrection of Jesus Christ, and its saving power for humanity.  The response of Pius X was to issue his encyclical “Pascendi Dominici Gregis” in Sept 1907, condemning what he called “Modernism” and which included a list of proscribed propositions.  Reviewing Pascendi now in the 21st century, a few of these propositions now appear quaint, of no great moment, and seem to be from another age which has now passed.    \nThe reforms of the Second Vatican Council of the 1960s, which sought to make the Church more relevant to its presence in the world, seemed to pose a threat to those of an ultra-conservative mind, who sought to freeze the expression of belief and practice in a single moment of time, that which prevailed from a past age.  Out of this we saw such movements as the St Pius X society, the Lefebvre movement, a dogmatic attachment to the old Tridentine rite, a refusal to acknowledge the validity of any subsequent popes, and various other signs, which saw any advance from the 1900s as pure heresy.  \nThus Donald Sanborne condemns Pope Benedict XVI as a modernist, disrespectfully calling him “Ratzinger” with little acknowledgement of his proper religious title.  It is a nasty little piece of polemical writing.  This is notwithstanding that many of us can recall Cardinal Ratzinger in his role as head of a doctrinal congregation as seemingly extremely conservative in his care for sound doctrine, as demonstrated in his treatment of such writers as Hans Kung for instance.  As Pope Benedict XVI, he reached out to those who had fallen away under the Lefebvre spell, and sought to reincorporate them into the universal church.  Small thanks he had for it if we are to judge from such writings as those of Donald Sanborne, who would seem to prefer a church confined to the irrelevance of a past age, with no real witness for Christ in the present world.\n\n","date":"May 29, 2015 at 3:51 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200542","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"1 Corinthians 15:  “And that he was buried, and that he rose again the third day, according to the scriptures: [5] And that he was seen by Cephas; and after that by the eleven. \n[6] Then he was seen by more than five hundred brethren at once: of whom many remain until this present… [7] After that, he was seen by James, then by all the apostles. . \n [12] Now if Christ be preached, that he arose again from the dead, how do some among you say, that there is no resurrection of the dead? [13] But if there be no resurrection of the dead, then Christ is not risen again. [14] And if Christ be not risen again, then is our preaching vain, and your faith is also vain.\n\n","date":"May 29, 2015 at 7:12 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200510","author":"Nabber","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hi Thibault. Interestingly, the exact passage you quote, in my copy of Heller’s book reads:\n“Then the Italian contingent went to work. Whole threads were removed from the image and blood stained areas, leaving visible marks behind. Jackson winced, for everything we had planned was non-destructive.” Presumably Heller wrote in English, so I wonder how Bollone got mentioned in the French translation. Where am I going? I’m not sure. Throughout STuRP literature, the minutest details of investigations into microscopic fragments are covered in intense detail, while the finding of “the Italians”, who appear to have had orders of magnitude more to work on, with much more definitive results, are almost entirely ignored, their authors being grudgingly admitted to a list of references rather than highlighted in the text. Why is this? Heller makes little secret of his contempt for Italian scientists “who had no idea what X-ray fluorescence was.” Did STuRP put no faith in Baima Bollone’s findings? Were they justified in doing so? I don’t know.\n\n","date":"May 29, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200544","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hi Hugh,\nLike you, I don’t understand the difference between the original American Edition of Heller’s book (1983) and the 1985 authorized French translation. This is amazing!\nNevertheless, there is no doubt that “the Italian contingent” means Baima Bollone and his team.\nMay be Barrie could confirm that.\nIn other words, Baima and his co-workers worked on genuine TS threads and your previous sentence: “These findings were made by using fragments that were removed from the Shroud by vacuuming, were kept illicitly, and tested without permission.” is completely wrong (sorry!)\nNo “vacuuming”, not “kept illicitly” and not “tested without permission”.\nDo you agree now?\nWhatever the personality of Baima Bollone, his work is worthy of consideration.\nFor example read again:\nhttps://shroudofturin.files.wordpress.com/2013/12/bbk-7.pdf\nYou wrote: “Where am I going? I’m not sure. Throughout STuRP literature, the minutest details of investigations into microscopic fragments are covered in intense detail, while the finding of “the Italians”, who appear to have had orders of magnitude more to work on, with much more definitive results, are almost entirely ignored, their authors being grudgingly admitted to a list of references rather than highlighted in the text. Why is this? Heller makes little secret of his contempt for Italian scientists “who had no idea what X-ray fluorescence was.” Did STuRP put no faith in Baima Bollone’s findings? Were they justified in doing so? I don’t know.”\n“Why is this”?\nBecause at the time (1978 and later), the Centro (Baima Bollone and co-workers) considered the TS as its own property.\nMoreover, Baima Bollone never published his findings in peer-reviewed journals but only in the journal of the Centro.\nThe whole context explains the attitude of STURP.\nIt was not a scientific problem but a “political” problem.\nKnowing that, what do we have to do now?\nIn my opinion, to look at both STURP’s  and Bollone’s findings.\nThe final result is clear: the “blood” on the Shroud is truly human/primate blood.\nDo you agree?\n\n","date":"May 30, 2015 at 2:55 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200612","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I have always thought that on the whole Heller and Adler’s experiments were sufficient to persuade me that the blood was actually blood, in spite of one or two distinct anomalies. I didn’t appreciate Baima Bollone’s work, principally on the basis of the lack of STuRP’s enthusiasm, and am still concerned that such little respect was made to his findings by the Americans, considering he had so much more to work on.\n\n","date":"May 30, 2015 at 4:53 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200619","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I was told that a book by Dr. P-L Baima Bollone was published last month. In one Shroud article I wrote he was mentioned as having dated the Sudarium of Oviedo to the seventh century. Apparently that was a mistake because no details about how he proceeded are known, but then the dating is cited in só many articles on the topic, including one on the Shroud by Prof. A.Danin.\n\n","date":"May 29, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200546","author":"Louis","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Here’s an odd thing. ‘Google translate’ translates “Baima Bollone” as “Alien Autopsy” which appears to be nonsense. However, Dr Baima Bollone is frequently mentioned in connection with the celebrated, and indisputably fictional Rockwell autopsy film, of which “Baima Bollone has declared very clearly that the technique, the times and the tools, as seen in the Alien Autopsy, are not correct. No samples are being taken and the correct instruments are missing from the room: it’s safe to conclude there are no pathologists performing the autopsy.” (http://www.ufodigest.com/news/0407/alienautopsy2.html) Or at least, he did when he knew it was a fake. Until then “Prof. Dr. Pierluigi Baima Bollone, University of Turin; Prof. Jean Pierre, University of Paris, as well as a dozen pathologists shown the film by my colleague Luc Bürgin, a whole auditorium of Mexican physicians and professors of the University of Cluj/Romania, to which I showed the film, all believed the film showed a real corpse, not a dummy.” (http://www.outtahear.com/beyond_updates/Alien%20Autopsy%20Proved%20Fake/STATEMENT%20BY%20MICHAEL%20HESEMANN.htm)\nAll very peculiar…\n\n","date":"May 29, 2015 at 5:31 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200551","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Strange,indeed.\n\n","date":"May 29, 2015 at 5:33 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200552","author":"Louis","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Without access to new studies of the shroud itself, shroud ‘science’ (whether pro or con authenticity) is becoming little more than farce.\n\n","date":"May 29, 2015 at 10:00 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200564","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"David- I am sure we all hope the the Pope might authorise a new examination of the Shroud which would,in the spirit of the 1973-6 examination ( the findings of which tend to get overlooked) actually include people who deal with the weaving and conservation of ancient textiles.\n STURP ‘s greatest failing was to assume, without any examination of the matter, that the images on the Shroud now are as they have always been, seven hundred or two thousand years ago( for obvious reasons the further back you date the Shroud the more likely it is that the images were originally different from what they are now).\nYet there is much that can be done without revisiting the Shroud itself. The Shroud is exceptionally well documented and there are many early depictions of it by a variety of engravers, painters, etc. We can assemble a database of all these for specialists to pore over at their leisure.\nWith work on painted linens continuing apace, there is also a lot to be done on bringing together all the new research and examples to see how they might illuminate features of the Shroud. It was through this kind of research that the dating of the Horses of St. Mark’s was finally authoritatively settled. No one could dismiss the evidence of similar dated gilding on copper.\nYet, a new close-up examination of the Shroud itself would be best of all. Over to you, pope Francis.\n\n","date":"May 31, 2015 at 4:14 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200648","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"I am interested in the Baima’s theories but I will not buy one of his books. I have other priorities. Baima’s books are not in the librairies of my university (neither in the Theological faculty). Is there any way to consult one of them at least?\n\n","date":"May 31, 2015 at 4:57 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200650","author":"David Mo","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Boa tarde, David Mo\nO livro do dr. P.-Luigi Baima Bollone foi publicado no mes passado, só que está em Italiano:\nhttp://www.libreriacoletti.it/libro/2015-LA-NUOVA-INDAGINE-SULLA-SINDONE/9788880687115dr. \nTranslation:\nGood evening, David Mo\nThe book by Dr.P.-Luigi Baime Bollone was published last month, but it is in Italian.\nLink\n\n","date":"May 31, 2015 at 11:23 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200682","author":"Louis","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Bom dia, Louis, I have asked other thing  and I am not Portuguese. Thank you anyway.\n\n","date":"June 1, 2015 at 1:29 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200729","author":"David Mo","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Hi David Mo\nI wrote in Portuguese, which is not very different from Spanish, only because you saíd sometime ago that you were not sure about yout English and that Spanish was your native language.\n\n","date":"June 1, 2015 at 7:26 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-200771","author":"Louis","site":"shroudstory"},{"title":"Colin Berry is not Seeing Red","post":"Reblogged this on Best of Shroud Story.\n\n","date":"July 11, 2015 at 6:26 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","id":"comment-205315","author":"Dan","site":"shroudstory"}]
