[{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"Maybe the explanation is that the body was not left as it was on the cross before wrapped in the Shroud? maybe it was washed and blamed ( the way the ancient burial customs required) and therefore the blood had different physical characteristics than the simple whole blood does ( did not stick to the cloth as it does to gauze) or the cloth itself was impregnated with substances which influenced the blood?\nWhy is everybody always considering the abilities of the WHOLE blood in a normal situation to reflect those for a Man of the Shroud?\n\n","date":"July 10, 2013 at 10:30 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38824","author":"jesterof","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"typo – balmed, not blamed\n\n","date":"July 10, 2013 at 10:31 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38825","author":"jesterof","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"On the other hand to expect that after 2000 years when the Shroud has been through so many different adventures that there still will be signs of “undisturbed” blood on the cloth as it will be on a gauze is ridiculous.\n\n","date":"July 10, 2013 at 10:34 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38827","author":"jesterof","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"Imagine, that there had been bloodied body wrapped inside the Shroud. If someone had tried to take it away from the Shroud, glued to it with dried blood (+ aloe & myrrh) – wouldn’t he rather torn such a thin 4-meter cloth in pieces? It is hardly possible to remove the body leaving not only bloodstains, but also the Shroud itself intact.\n\n","date":"July 10, 2013 at 11:20 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38829","author":"O.K.","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"Makes you wonder. what other facts are not facts.\n\n","date":"July 10, 2013 at 1:41 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38833","author":"Paulette","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"makes one wonder if the skeptics are from the outer world, or try to invent what else could try try to doubt against plain common sense?\n\n","date":"July 10, 2013 at 2:46 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38835","author":"jesterof","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"My point was Fanti and company cite a document that doesn’t say what they say it does. That is not good scholarship. What, if anything, should they be citing? Or should they retract that part of the paper?\n\n","date":"July 10, 2013 at 3:47 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38839","author":"Paulette","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"But the bigger point is why this should even be discussed as a possibility? after centuries of all the Shroud has been through ( it was even boiled in oil I once read) one would seriously expect the ORIGINAL signs to be still there? Not to even mention that the burial customs of putting the body to rest involving balms and spices definitely washed out the crust of blood which covered the body. details could be provided by Max Patrick Hamon but reference to the practices are in the Scriptures.\n\n","date":"July 10, 2013 at 5:50 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38849","author":"jesterof","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"Quote from Dan : “I don’t know if anyone said this before Goldblatt but it has been said in countless ways since.”\nInfo from me :  To my knowledge, the first who ever noticed this bizarre feature about the bloodstains (which comes from exudates of clotted blood clots) is the French surgeon Pierre Barbet (probably in the 1930s).  I’m pretty sure Vignon also noted this fact but I never had the chance to read his books about the Shroud, so I can’t tell for sure.\nComment from me :  I was struck by the comment made by Phillip H. Wiebe during the Orvieto conference of 2000 because, without ever reading it, I came to the VERY SAME CONCLUSION with my personal reflection.  \nIf it’s true that there is no sign of disturbed bloodstains (which really seems to be the case if you look at HD close-ups from the Shroud), then the ONLY rational explanation for it is to think that the bloodstained corpse only stayed in direct contact with the cloth for a very short period of time; short enough that most of the blood was still not completely dry when the body was taken out of the Shroud.  But, as Wiebe cleverly noticed, in such a context, it seems very improbable that an image like the one on the Shroud could have been formed on the cloth in a so short time frame (most certainly one hour or so), especially if the image formation process only involved a natural phenomenon.\nNevertheless, I still wonder if the presence of a lot of burial anointing oils on the Shroud man’s body and/or on the Shroud itself and/or the presence of a lot of humidity inside the cloth could have been enough facilitating factors that could have allowed the manual extraction of a body from inside the cloth many hours (and even many days) after it had been placed there without disturbing too much the bloodstains and the underlying fibers ???  I guess this question has never been analysed properly under good lab control.  And since no one was present during the burial of the Shroud man, I think honesty forces us to leave the door open for a natural and rational explanation for this very particular feature noted by Barbet and others…\nBut as I often said here on the blog, in the end, it doesn’t matter to me if this feature is or is not a real sign of the Resurrection of Christ.  It doesn’t matter because that’s not there that, in my mind, we can find the most important sign of this Supernatural event…  No!  The most stricking sign of the Resurrection of Jesus versus the Shroud is the fact that such a gruesome and morbid burial cloth that didn’t stayed in contact with a crucified corpse long enough for the arrival of the first liquid of putrefaction had been kept and well-preserved until this day!  Effectively, as the mother of Barrie Schwortz cleverly said to him one day:  If this burial cloth would belong to another person, no one would have thought to kept and preserved it!  Truly, in order for some first century Jews to keep such a cloth, they must have been totally convinced that Jesus was resurrected !  Or else, they would never have dared (or even thought) to keep it!\nBut here again, we must be prudent with this sign because it will never be a proof of anything else than this:  it is only a proof that some followers of Jesus where convinced that he was alive again.  But sadly for all the Thomas out there, it is NOT a proof of that reality…\n\n","date":"July 10, 2013 at 3:15 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38836","author":"Yannick Clément","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"I was waiting for this. This is excellent information. However, I’d love to see a peer reviewed graphically illustrated paper showing the effects of removing a shroud at different phases of decay. How valid would it be may depend on the state of the cadavers used so this may be an impediment. But still if it could be done in an ethical and relevant way I’d like to see it.\n\n","date":"July 11, 2013 at 7:39 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38906","author":"Chris","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"We may not know for certain all that was done to the human body of Christ after he was removed from the cross but before being placed into burial.  We can assume that because of the people’s feelings for Christ that he was treated with love and reverence. Thusly we can assume that he was treated gingerly and cleaned to make him presentable. The body would have placed – back down onto the lower halve of the burial shroud and then the upper halve of the shroud would have been gently put onto the full frontal (face up) body.  Evidence shows that a strip was removed from the side of the shroud and used to wrap around a portion of the enclosed body to secure the full shroud around the body. That was then placed\nonto the burial slab. \nOn the third day the buried body was energized by the living soul/spirit of our Christ.  The body then removed itself  (arose) from the slab and left the grave.\n\n","date":"July 10, 2013 at 3:20 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38838","author":"Emmett McMahon","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"There were a few signs Jesus gave during his earthly life that made him more than what he appeared to be then, Jesus of Nazareth walking the roads of Palestine, and he became Christ after the Easter event, when he was seen in person again.\n\n","date":"July 10, 2013 at 6:55 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38856","author":"Louis","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"This probably has no value here but when I was on active duty in the Military as an NCO, when I was assigned to guard duty and if something out of the ordinary happened I would have to document it.  When Christ arose from the dead, he left the crypt that he was laid in. When he did this the rock was moved from the opening.  If I was on guard there I surely would have made note of that fact.  I wonder if the Romans kept any of those records? .\n\n","date":"July 10, 2013 at 7:31 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38860","author":"Emmett McMahon","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"A good question has been raised here but one that is not that important. Why? It was probably the earthquake that rolled the rock away and the following events demonstrated that matter was no impediment to the risen Christ. He fluctuated between two states, within our “frequency” or beyond our “frequency” and could also fluctuate when within our “frequency” as described in the Emmaus account. There is a key to understand this extremely important detail and it was given by Jesus himself: do not be guided by the material world, the truth lies beyond what is material. This fact was further interpreted by the gnostics and eventually led to the Creed as defined at the Council of Nicaea in the year 325. The problem was whether to interpret Jesus as half-human, half-divine or fully divine and not human. This issue has not been resolved till today and lurks in the background of Church teaching. “Jesus’ relationship to God was his secret and no psychology will fathom it”, Adolf Harnack wrote.\n\n","date":"July 13, 2013 at 8:57 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38973","author":"Louis","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"To me, Jesus is fully divine but as God he could use the human form to aid in contacting the human world.  He started the human existence just as all humans would in being born as a baby, living his human life as we know it and then it was necessary for his human body to die it’s horrible death then he “came back” as the risen Christ.\n\n","date":"July 13, 2013 at 9:29 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38974","author":"Emmett","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"Emmett: “If I was on guard there I surely would have made note of that fact. I wonder if the Romans kept any of those records?” Louis: “It was probably the earthquake that rolled the rock away”\nMatthew’s gospel will be fairly close to what actually happened. Mt 28:1-8 ‘Towards dawn two Marys visit the sepulchre’, ‘sudden violent earthquake’, ‘ “Angel of the Lord” rolls away the stone’ (i.e. earthquake rolls the stone); ”Guards go into shock and are like dead men’; ‘Angel gives two Marys the message that Jesus is risen, and is going to Galilee’;\nSubsequently Mt 28:11-15; ‘Some guards go off to tell the chief priests’, ‘priests consult the elders’, decide to bribe guards’, Instruct guards “This is what you must say ‘His disciples came during the night and stole him away while we were asleep’ and we’ll put things right with the governor if he hears about it.” What’s the penalty for a Roman guard sleeping on guard duty?? \nI think it may have been Jacobivice who suggested that Mt 28:11-15 may be an indication that that’s what actually happened – disciples stole the body – (no provocation to Louis intended) but it doesn’t bear scrutiny as the gospels make it clear elsewhere that they didn’t believe the women anyway. Re the earthquake rolling the stone: I’m familiar with stories about eathquakes in NZ, and at a cliff-face or similar ground discontinuity, it is quite usual for the earthquake wave to split off the rocks and hurl them for quite some distance away. The ‘sealing of the rock’ against the entrance to the tomb may well have ensured that the full force of the EQ wave would be transmitted to the rock forcing it to move.\n\n","date":"July 14, 2013 at 6:32 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38983","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"Emmett McMahon: Yes, that is the traditional position, but which still has its difficuties, as given in #14. Pope John Paul II signed an agreement with the Arab prelate Mar Dinkha of the Assyrian Church of the East, of Iraqi origin, bringing the Catholic and at least one Orthodox Church together when it comes to doctrinal issues. The same cannot be said about the Orthodox Churches in Egypt. Pope Benedict XVI referred to von Harnack during the speech he delivered at Regensburg University, aware that the Lutheran Church also has some difficulties when it comes to this point, not least because Martin Luther also grappled with it. To go further, both Harnack and Albert Schweitzer had problems with the Lutheran Church in which they were raised precisely because of this, distancing themselves from the institution while remaining Christians, in the broad sense of the term.\nDavid: You agree with what I stated in #14 on the rock and the earthquake in the last line of your above comment by giving a very plausible explanation about what really may have happened. This explanation is highly appreciated. Exception is only taken when it comes to Jacobovici, who need not have been cited. He has talent but has been been misled in his agenda-driven “archaeology” and is therefore not taken seriously by Israel’s top archaeologists. See the article “Jesus was not buried in Talpiot”, parts I and II, on the Holy Shroud Guild website, and this material will be expanded in November or  December this year when additional, and more concrete, details will be in my hands.\n\n","date":"July 14, 2013 at 11:45 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38985","author":"Louis","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"If the disciples stole the body then my religion is based on a lie.  I find that too hard to believe as I believe in the risen Christ.\n\n","date":"July 14, 2013 at 8:06 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-38997","author":"Emett McMahon","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"Emett: There have been all sorts of attempts to explain away the Resurrection. This was merely the first such, from those who had condemned him. There have been others, such as de Wesselow’s explanation that the disciples saw the image on the Shroud, to Hans Kung’s attributing it to a type of awareness of Jesus’ presence, to Dom Crossan’s interpretation of it as a parable, and doubtless there will be many others. None of them bear scrutiny. The concept of Resurrection is so mind-boggling that those without faith try to look elsewhere for an explanation which they can rationalise in their minds.\n\n","date":"July 15, 2013 at 6:54 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-39012","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"hank You.\n\n","date":"July 15, 2013 at 2:18 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-39026","author":"Emmett McMahon","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"Agree with DaveB. The real testament to the truth of the Resurrection lies in the fact that these Apostles spread out over the known world at the time and fearlessly faced martyrdom without even the slightest inclination to recant what they had saw. \nIt doesn’t make sense to me that anyone who is knowingly spreading a lie about Eternal Life (professing to have witnessed a miraculous physical Resurrection as proof of that truth) as offered by Jesus would willingly suffer martyrdom. In fact, if Jesus did not rise from the dead they would have had no impetus to do anything. To them He would have been just another well meaning guy who got executed by the jealous powers at that time. No proof, really, that anything He said about Eternal Life was true. Why bother to leave everything to spread the Word? Missionary work was an unbelievably harsh life let alone life threatening when a hostile audience was encountered. There was no self enrichment incentive it was just brutal work. People who supposedly have had their Faith requirement disburdened from them just don’t do that sort of thing.\n\n","date":"July 15, 2013 at 11:15 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-39023","author":"Chris","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"That is why I have belief.  I have read the Gospels.\n\n","date":"July 15, 2013 at 2:30 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-39027","author":"Emmett McMahon","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"The point being that neither the disciples, or first converts from Judaism, nor Paul’s gentiles, would have lived and died for such a religion, unless they believed that the Resurrection had a factual reality. They would not live and die for such, if it were only a vague psychological awareness, or if they saw it as a parable, or an illusion!\n\n","date":"July 15, 2013 at 4:35 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-39035","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"Wesselow tries to rationalise the event, Küng does not go deep enough into other fields of study and reaches somewhat hasty conclusions, Crossan does not rely on the Gospels but on bad archaeology.\n\n","date":"July 15, 2013 at 9:59 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-39018","author":"Louis","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"\ndaveb of wellington nz :\nThe point being that neither the disciples, or first converts from Judaism, nor Paul’s gentiles, would have lived and died for such a religion, unless they believed that the\nResurrection had a factual reality. They would not live and die for such, if it were only a vague psychological awareness, or if they saw it as a parable, or an illusion!\n\nexactly!\n\n","date":"July 15, 2013 at 5:11 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-39036","author":"jesterof","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"“exactly!”  That hit it right on the nail head.  We are talking about The Jesus Christ, the son of the Living God, the 2nd person of the Holy Trinity.\n\n","date":"July 15, 2013 at 10:15 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-39051","author":"Emmett McMahon","site":"shroudstory"},{"title":"Erase the fact from the list. It is not a fact. It never will be.","post":"\ndaveb of wellington nz :\nThe point being that neither the disciples, or first converts from Judaism, nor Paul’s gentiles, would have lived and died for such a religion, unless they believed that the Resurrection had a factual reality. They would not live and die for such, if it were only a vague psychological awareness, or if they saw it as a parable, or an illusion!\n\nExactly! It has also been proven through science that it could not have been ‘illusions’ of Christ by the witnesses. Example; Jesus appearing in the room with basically all the disciples present, as stated quite nicely by Dr. Timothy McGrew in one of his lectures on the reliability of the Gospels, one would have to believe all the disciples had the same illusion and one where Jesus ‘asks’ for a fish, one disciple reaches to another to give the fish to Jesus and they all envision that they see him eating the fish!…..It’s nonsense to believe it was anything but real eye-witness testimony….Why would they make this up? The resurrection was not even a understanding in their beliefs….One should read N.T Wright also on this very issue of resurrection.\nRon\n\n","date":"July 16, 2013 at 1:05 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","id":"comment-39073","author":"Ron","site":"shroudstory"}]
