[{"title":"Everyone’s Own Facts","post":"Here we go again.\nThe expansion of the universe is a strictly scientific question that can only be settled by indirect observation (used to be red-shifts, I’m not sure what they’re doing now).  You can’t stand outside the universe and watch it grow.  The authenticity of the Shroud of Turin is, finally, an historical question, to the resolution of which scientific investigation is undoubtedly quite relevant but not (absent a knock-down countervailing fact, which the carbon dating proved not to be) wholly dispositive, and the Shroud can be observed directly.\nOf course this doesn’t mean theories cannot be proposed and revised about this or that aspect of, say, the manner of image formation.  In the end, however, you have a lot more going on here than science or scientific speculation, and methods of “proof” (read: “authentication”) that are actually more intelligible.  You are, at a certain point, entitled to plead the weight of the evidence, as well as the absence of credible counter-evidence.  The standards involve reasonable doubt, not hyperbolic doubt.\nHyperbolic doubt is a somewhat strained philosophical method inappropriate here.  It is not incumbent upon anyone to doubt, doubt, doubt until his dying breath.  Given enough weight to the total evidence, historical, artifactual (archaeological), scientific, etc., it is not reasonable to do so.  It may be a judgment call as to when the weight of evidence tips the scale, but we are not and should not be free to postpone it indefinitely.\nLegitimate questions and issues will always remain to be investigated.  This is, after all, a highly complex subject.  But such investigations can be done in light of a general consensus.  They do not need to be prodded along by some sort of strange unending scepticism.\n\n","date":"June 20, 2014 at 10:06 am","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-131697","author":"R. H. Cahall","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"Since when Jackson and Whanger are considered “expert” in the field of imagery and since when most of those that signed the “concensus of Valencia” were expert in chemistry and microscopy?\nAdler and Baima Bollone on the contrary were true expert in the field of detecting if a stain is made of blood or not…\nDan, this is the kind of cheap shot that don’t honor you…\n\n","date":"June 20, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-131787","author":"Yannick Clément","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"The “good enough” comment was originally directed towards my response to the claim that it is known with “99% certainty” that the blood on the Shroud is human blood.\nI believe this is an exaggeration to put it mildly, in the category of “I think I know”.\nMy specific reasons for disputing such a 99% certainty claim has been previously written about on this blog before-if interested, see https://shroudstory.com/2013/01/30/guest-posting-by-kelly-kearse-distinguishing-human-blood-from-that-of-other-species/.  Also, see my first comment under the post.  Ironically, in the original manuscript (a link to shroud.com is available in the above link) there is a section titled, “Is primate good enough?”  “Good enough” will mean different things to different individuals depending on their background, experience, and overall interest in the topic. \nWhile the species of origin of the blood and the patterns of the bloodstains are ultimately part of the same larger question, and complement each other, scientifically these are best treated as separate issues.  This approach ensures the most objectivity.  Ideally, the person running such tests would not even know where the samples came from, although this is not always practical.  The current data indicates there are primate, i.e. human blood components on the Shroud.  (For me personally, I try to avoid using just the term “human” without qualifying it-in my opinion, from a scientific standpoint, this is the most accurate representation of the existing data).  It remains to be evaluated if there is blood representative of a single person or more than one individual present.  It also remains to be evaluated if blood from any other species (non-primate) might be present as well.\n\n","date":"June 20, 2014 at 4:05 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-131808","author":"Kelly Kearse","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"Keep on analysing Mr. Kearse.  It’s not me who will stop you…  In fact, I would encourage you, because I know with 100% certainty that such a new analysis would simply back-up Adler and Baima’s main conclusion that the blood and serum stains we see on the cloth comes from a tortured human being that cannot be, in all logic, anyone else than the Shroud man himself.\nAdler made it clear in his book that he was convinced of this.  Baima did the same thing.\nI repeat that it’s good enough for me because both did their analyses totally independent of each other and both were true experts in detecting if a stain is made of blood or not.  And as Adler said it so well in his book:  if the Shroud’s blood comes from a baboon (or some other primate), this would mean a forger would have need to wait until the blood of such an ape would have got time to clot!  This is pure fantasy…\nTo me, the evidence coming from the bloodstains is the most solid piece of evidence that comes from the 1978 scientific investigation.  But as I said, if you (or some other expert) can do a new analyse of some new blood samples taken from the Shroud, let’s go!!!\n\n","date":"June 20, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-131816","author":"Yannick Clément","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"Read the linked blog post and the first comment under it, or better yet the full paper.  Much of what you quote back to me is included there.  I believe you misunderstand my intentions and point of view: too much emotion, way too defensive.   \nBTW, are you 99% certain that Adler wrote a book? Or is this Heller’s book that you keep referring to?  Please, no need to answer, rhetorical question only\n\n","date":"June 20, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-131825","author":"Kelly Kearse","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"[I have removed this paragraph at Yannick’s request. That was a good idea. –Dan]\nAnd for the book of Adler I’m talking about, it is “The Orphaned Manuscript” (link: http://books.google.ca/books/about/The_Orphaned_Manuscript.html?id=J2jBnDN3VxMC&redir_esc=y), which is a collection of almost every papers Adler ever wrote about the Shroud and who was done by Adler near the end of his life at the demand of Dorothy Crispino (founder of Shroud Spectrum International).  If you read this book, no doubt you’ll understand that Adler was 100% convinced that the blood and serum stains on the Shroud were made of the real blood of the Shroud man (he was even more convinced of this fact when he had the chance to see the Shroud up, close and personal in Turin at the end of the 1990s and he talk about that experience in the intro of his book.  This is evident when you read this book, just like it is also evident when you read Baima’s book called in French “101 questions sur le Saint Suaire” (101 question on the Holy Shroud): http://books.google.ca/books/about/101_questions_sur_le_Saint_Suaire.html?id=XO8AvKvWwX4C&redir_esc=y\n\n","date":"June 20, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-131835","author":"Yannick Clément","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"Thanks Yannick, have both of these books.\nPandora’s box?  My idea isn’t that maybe the Shroud blood is not human blood.  My idea is that if it’s going to be consistently referred to as such, what is the strength of evidence for this?  It is important to be scientifically accurate.  Is this something that has, over time, been assimilated into discussions, similar to “all old blood types as AB”.  Is it the slam dunk some think it is?\nProviding more ammo, etc., that’s a sign of insecurity.  And consider that not being scientifically accurate or precise when talking about what is and isn’t known can be perceived as ammo as well.  Particularly for those in the scientific mainstream-it doesn’t look good, it weakens the credibility.\nHere is a quote from Adler’s book that you mentioned:\n“We were only doing a surface precipitate test; there was no way to quantify it.  So we cannot rule out the possibility that this could be some other type of primate blood.  In sum, our testing showed that the substance composing the bloodstains on the Shroud is a blood-derived material; it is definitely from primate blood, and it is the exudate of a wound.”\nHere a quote from Case’s book which contains a transcript of the last interview Heller & Adler ever did together: \nDr. Adler: “Well you put it on, you tag the antibody with some fluorescent tag so you can see if it sticks to the surface you are putting it on.  See if it lights up.  And that’s not the world’s best immunological test.  We found that a chimp antigen gave almost as strong a test.  So our conclusion was a very simple one.  We were only willing to say it was a primate’s blood.  But we were not willing at that point to declare it was human blood.  Like we tell talk show audiences, if you choose to think that the image you see is that of a chimp or an orangutan, you’re perfectly welcome to believe that.\nCase: But there hasn’t been more recent testing that is specific for human blood?  Or can that be done, actually?\nDr. Adler: Well it could be.  But you’d need more sample. And the ultimate test would be DNA testing.  It hasn’t been done.”   \nSound like Adler was 100% willing to say human blood based on such tests?\nI don’t think so, but maybe it’s still “good enough”\nI’m am completely without forensic experience or background to judge the accuracy of the bloodflow patterns, etc., so that, together with the image on the cloth remain separate issues for me regarding the species origin of blood.  Also, for me, that is the best way, scientifically speaking, to remain as objective as possible \nRegarding Baima Bollone’s studies cross-reactivity with the “anti-human” reagents that were used were never addressed.  It’s the nature of the beast in immunology, you have to test for it.  It’s like having a key that opens your front door, and it’s great, until five other people show up with keys and 3/5 work just like yours.\n\n","date":"June 20, 2014 at 6:58 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-131871","author":"Kelly Kearse","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"Mr. Kearse, thanks for those precisions.  Please read the long comment I just posted at the bottom of this page (without ever reading your last comment because I wasn’t aware of it) and you’ll see that we got pretty much the same general idea regarding the whole affair, except that I tend to look at more than just the scientific tests and results obtained by Adler and Baima Bollone, which is probably why I have a stronger conviction than you (at least, as it seem to me) concerning the fact that what appear to be real human blood and serum on the Shroud cannot be anything else than real human blood and serum and, even more than this, that those stains must have come from the Shroud man’s corpse who once was enveloped for less than 72 hours in that cloth. In sum, I consider not only the data but the very strong and positive personal convictions of both Adler and Baima Bollone after having done their tests and after having seen the Shroud up close and personal in Turin, as well as the fact that a vast majority of the medical and forensic experts who have studied the images of those stains came out, just like Adler and Baima Bollone, with the strong and positive conviction that what appear to be real human blood and serum on the Shroud cannot be anything else than real human blood and serum and, even more than this, that those stains must have come from the Shroud man’s corpse who once was enveloped for less than 72 hours in that cloth.  And more than this, the reason why I’m totally convinced of the “authenticity” of those stains comes from the strong conviction, after having read what these experts had to say on the subject, that all of them would have been willing to make a positive and strong testimony about the whole issue in a courtroom.  THIS SHOULD MEAN SOMETHING, especially when it comes from authentic experts in determining if a stain is composed of blood and/or serum or not (or, in the cases of those who only studied the images, if those stains are looking “authentic” or not).\nAgain, thanks for this comment.  After having read it, I can say that you succeeded to calm my fears of a new Pandora’s box, which would have given the sceptics new ammo to discredit the authenticity of the Shroud as being a real burial cloth of a real crucified man who was tortured in the same manner as Jesus of the Gospels…\n\n","date":"June 22, 2014 at 5:25 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-132372","author":"Yannick Clément","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"And if two blood experts study the bloodstains and independently arrive at a different conclusion, then what Yannick? This two expert rule of yours is not how science works. Science by authority of experts is foolishness.  You should be praising skeptics AND those who seek to confirm facts, hopefully by the hundreds.\n\n","date":"June 20, 2014 at 7:02 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-131873","author":"Paulette","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"I believe that if an authentic expert in one field got a “positive confirmation” of a result obtained by another authentic expert in the same field, while working completely indepedent of this other expert, this must be seen as a pretty strong piece of evidence that the first result was good.  That’s exactly what we got concerning the issue of the “authenticity” of what seem to be human blood and serum stains on the Shroud.  And I know I’m not the only one who think like this…\n\n","date":"June 22, 2014 at 5:29 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-132373","author":"Yannick Clément","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"Additional comment: The way I consider the evidence coming from the blood and serum stains on the Shroud (i.e. as being a very strong piece of evidence in favor of the authenticity of this relic because two independent experts came out of their analyses with this same strong conviction) is pretty much the same as the way I consider the evidence coming from the discontinuous distribution and some other data from the Shroud (i.e. as being a very stron piece of evidence to discard all the image formation hypotheses involving a high amount of energy, especially when it comes to energetic radiations, because two independent experts in radiation, namely Rogers and Fazio, came out of their analyses of the data with this same strong conviction).  Again, I have to say that this is good enough for me and I can consider a strong fact both the conclusion that what appear to be real human blood and serum on the Shroud cannot be anything else than real human blood and serum and what was at the origin of the body image must have been a very mild process involving only a weak amount of energy (probably biological in nature).\n\n","date":"June 22, 2014 at 5:54 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-132377","author":"Yannick Clément","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"I’m unsure I would call it a fact, but that does not mean I would not consider the information credible when two different experts in their field come to the same or similar conclusions.  I wonder if Yannick meant his statement more along those lines than black and white facts.\n\n","date":"June 21, 2014 at 11:40 am","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-132096","author":"Andy","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"I would like to complete my thoughts on the subject raised by Mr. Kearse in the summary of the upcoming presentation he will make in St-Louis…\nLet’s take the courtroom analogy for a second:  After having read almost everything published by Adler and after having read the most important things published by Baima Bollone on the issue of the blood and serum stains and remembering that those are the only two specialists who did legit testing on real samples taken from the Shroud during the 1978 investigation that were recognized by both the Church authorities and the vast majority of the scientific community, I’m totally convinced that if they would have been called in a trial about the nature of the stains supposedly made of human blood and serum, both of them would have swear to God and their professional reputations that those stains are definitely made of real human blood and serum.  I have absolutely no doubt about that and I dare anyone who has read what these 2 experts have written on the subject to contradict me about that.\nThis is a fact: Both Adler and Baima Bollone were true experts in determining if a particular stain is made of real blood or not or if it’s made of real serum or not. Both of them were totally convinced that what appear to be real human blood and serum on the Shroud cannot be anything else than real human blood and serum and, even more than this, that those stains must have come from the Shroud man’s corpse who once was enveloped for less than 72 hours in that cloth (i.e. before the apparition of the first liquids of putrefaction), especially when we take into account the FACT that most of those stains came from moistened blood clots and not from fresh blood in liquid form.\nOn the other hand, I agree with Mr. Kearse about the fact that there still data that needed to be gathered in order to get a full and complete profile of those stains and I’m sure both Adler and Baima Bollone would have recognized that fact.  In sum, if the judge during the trial would have ask them a question about that, I’m sure they would have said something like: “It’s true that there are still some missing data, especially when it comes to DNA studies, BUT we already have well enough data to conclude, beyond any reasonable doubts, that what appear as real human blood and serum on the Shroud is exactly this.\nAnd, as complementary experts, if the judge would have call for other experts who have analysed the Shroud over the years (like Pierre Barbet, Rudolf W. Hynek, Giovanni Battista Judica-Cordiglia, Sebastiano Rodante, John Heller, Robert Bucklin, Frederick Zugibe, Gilbert Lavoie, Pierre Merat, etc.), I’m also totally convinced that the vast majority of them would have backed-up the testimonies of Alder and Baima Bollone completely, saying that those stains cannot be made of anything else than real human blood and serum and that those stains must have come from the Shroud man’s corpse who once was enveloped for less than 72 hours in that cloth.\nOf course, like any other scientific inquiry, some (like Mr. Freeman did on this blog the other day) will always find one or two experts to contradict all those positive testimonies, but the sum of the positive testimonies is so huge that no honest and intelligent man will listen to those contradictor at all.  Here’s a parallel example:  Even if the vast majority of the real historian would be willing to testify in court that Jesus of Nazareth really existed and that he was a real Jew who lived in Galilee at the beginning of the 1st Century of our era, there will always be one or two historians to stand up and claim the contrary, but no honest and intelligent man will ever listen to them at all. In other words, even if it would be great to get more proofs of his existence, we have now enough data to consider a sure fact the reality of Jesus of Nazareth as a Galilean Jew of the 1st Century.\nOne more analogy that is a very good one that can be link with the issue of the blood and serum stains on the Shroud:  Even if no credible and professional astrophysicist on this planet would ever testify in court that we already have all the data to get a full and complete proof of the existence of exoplanets in our Universe, we still have well enough data already to claim beyond any reasonable doubts that those planets are real.  I firmly believe it is the very same situation with the question of the authenticity of the blood and serum stains on the Shroud.  \nOf course it would be great to have a full profile of those planets when it comes to the kind of revolution they make around their star, their diameters, their time of rotation, the kind of atmosphere they have, etc., and to get high-definition images and of course it would be great to make a complete DNA study of the stains on the Shroud and to make back-up testing on new samples to verify the reliability of Adler and Baima Bollone’s results, but in both cases, the truth is this:  We don’t need those additional data to be totally convinced, beyond any reasonable doubts, that what appear as real human blood and serum on the Shroud is exactly this and, in all logic, cannot have come from anything else than the tortured corpse of the man who once was enveloped in that cloth for less than 72 hours.  \nI say this mainly because of the fact that both Adler and Baima Bollone, while they worked totally independent of each other, ended up with the same positive conviction concerning those stains, but also because of all the complementary analyses of Shroud images made by credible experts like Zugibe, Barbet, Bucklin, Rodante, Lavoie and many others who also ended up with the same positive conviction as Adler and Baima Bollone. Here, it’s interesting to also note that some great scientists of STURP like Ray Rogers, who are not willing to call something a fact without enough data to back-up such a claim, never expressed any doubt in their scientific writings about the conclusion that what appear as real human blood and serum on the Shroud is exactly this.\nIn sum, when it comes to the blood and serum stains, we can conclude this: Do we have all the possible data concerning those stains? No!  Will it be a good thing to gather those missing data? Of course!  But do we have enough data to be certain that those are made of real human blood and serum? Yes!\nNevertheless, as I said the other day, of course I encourage real experts like Mr. Kearse to ask for more testing on those stains and to perform those tests if its one day possible, but when I got to bed at night, if there is one thing that I’m 100% sure in this world, it is the presence of real human blood and serum on the Shroud of Turin, which cannot have come logically from anything else than the tortured corpse of the Shroud man and which imply that this cloth is a real burial cloth that once contain the remains of a real beaten, scourged and crucified man who look exactly like the Jesus of the Gospels.  And what gives me that great confidence is the fact that both Adler and Baima Bollone had the very same positive and strong conviction after having analysed their samples from the Shroud and having seen the relic up close and personal in Turin.\nTHAT’S GOOD ENOUGH FOR ME TO BE CONVINCED OF THE REAL NATURE OF THOSE STAINS AND WHAT SUCH A CONCLUSION IMPLY (for details, read my paper on the subject: http://shroud.com/pdfs/n76part5.pdf). And I believe this should be the case for anyone interested by the Shroud… That’s precisely why I believe that the paper an expert like Mr. Kearse will present in St-Louis possess the potential to open (re-open would be more accurate) a Pandora’s box versus the blood issue IF (that word is important) such a paper end up with the conclusion that there is still some doubts over the fact that what appear to be real human blood and serum on the Shroud can well be something else than this and/or if such a paper conclude that the real human blood and serum on the Shroud can come from someone else than the Shroud man himself…  \nIf that’s the case, this would leave the door wide open once again for all the sceptics out there (like Colin Berry for example) to say that, because of the opinion of this DNA expert, we are right to consider the so-called evidence coming from those stains (which, in fact, represent the strongest reason to discard every possible human forgery hypothesis) as highly doubtful and, therefore, we are right to consider those stains as being unable to prove the hypothesis that the Shroud is a real burial cloth of a real crucified man who look like Jesus of the Gospels. Therefore, we are right to still claim that this relic can well be a human fake!  Personally, I believe that such a thing would be wrong…  Completely wrong.  But that’s what can happen if the paper of Mr. Kearse still cast strong doubts over the strong and positive conviction showed by both Adler and Baima Bollone after their analyses of Shroud samples.\nConclusion: If we could all (this include the sceptics) start on the base that the Shroud is a real burial cloth that enveloped a real crucified man for less than 72 hours (precisely because of the strong evidence coming from the blood and serum stains), then I’m sure the exchanges here would reach a much higher degree of rationality, credibility and honesty about any issue regarding this relic… \nNote that such a base of discussion doesn’t mean necessarily that the Shroud can offer a strong scientific piece of evidence for the reality of Jesus-Christ’s Resurrection or that it must be seen as a complete proof that it is really his authentic burial cloth.  This is important to understand, especially for all the sceptics out there.  It just means that, in no way now, we can reject the possibility of the Shroud being the authentic burial cloth of Jesus, because the blood and serum stains on the Shroud are telling us that this cloth is a real burial cloth of a real crucified man who had been tortured in the same way as Jesus of the Gospels. In fact, I believe such a hypothesis must be seen as very strong, precisely because of that.\nSorry for the length of this comment, but this issue is the one I have studied the most and which I consider the strongest piece of evidence in favor of the authenticity of the Shroud that came out of the whole 1978 investigation and I had to express in details my fears that a paper like the one Mr. Kearse will present in St-Louis will re-open a debate that should be consider as something that has been already “classified” since a very long time… In the end, my hope is that those fears of mine can end-up being unfounded. And if you don’t agree with this term “classified”, please read carefully the books written by Adler and Baima Bollone.  And if you still have some doubts, then read what Barbet and Zugibe said on the question of the bloodstains in their own books…\n\n","date":"June 22, 2014 at 5:09 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-132368","author":"Yannick Clément","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"“I’m totally convinced that if they would have been called in a trial about the nature of the stains supposedly made of human blood and serum, both of them would have swear to God and their professional reputations that those stains are definitely made of real human blood and serum. I have absolutely no doubt about that and I dare anyone who has read what these 2 experts have written on the subject to contradict me about that.”\nI will accept the dare.  A courtroom drama is not necessary.  One can simply read Adler’s own words published in his papers-I provided two quotes from Adler yesterday.  Here is another (different) quote from his book:\n“Further, in our opinion, the totality of these tests does confirm the blood images areas as blood.  The question as to whether or not the blood is human blood is best left to further immunological testing”\nThese are Adler’s words verbatim. \nI don’t contradict Adler’s claims, he was appropriately cautious in his conclusions-I have gone to much lengths to support them.  You however, choose to overextend them, largely through confusion about the scientific principles behind such experiments and their inherent limitations, strongly laced with emotion.  \nMany reagents advertised as “anti-human” will cross-react with related species.  Adler went on the offensive with this and directly tested the cross-reactivity.  The reagents were not strictly anti-human-this is absolutely no surprise, particularly given the reagents that were available at the time of those studies.  Bollone’s experiments never addressed the issue of cross-serology.  In immunology it is imperative-the caveat is there, whether directly examined or not.  \nHere’s one for you: the relation between MNS and human blood was never realized in the Shroud community, even long after the results were reported by Baima Bollone (in a Shroud journal) and it was known in the serology world that MNS expression was restricted to humans.  The first time this was ever reported, and the connection made to Shroud studies was by yours truly: Dr. (not Mr.) Pandora. Was that okay or should that have been kept under wraps?\nBeing afraid to critically analyze the data, from any and all appropriate scientific disciplines, is like an ostrich with their head buried in the sand.  Very, very deep.  The discipline of immunology seems most appropriate here, as these are immunological tests. Fear of what may or may not be learned about the Shroud from any scientific discipline is characteristic of insecurity.  Skeptics will always have ammo.  You don’t realize this, but you provide a supply line of ammo when you pretend to know what you are talking about (scientifically) and make such bold statements regarding “scientific facts.”  Unless you think you really know what you’re talking about (scientifically, immunologically), and Adler, as well as me, have it wrong?\n\n","date":"June 22, 2014 at 7:19 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-132393","author":"Kelly Kearse","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"Quote: “Being afraid to critically analyze the data, from any and all appropriate scientific disciplines, is like an ostrich with their head buried in the sand.”\nReply:  You got me wrong here.  Read again: “Nevertheless, as I said the other day, of course I encourage real experts like Mr. Kearse to ask for more testing on those stains and to perform those tests if its one day possible.”\nRead also again: “In sum, when it comes to the blood and serum stains, we can conclude this: Do we have all the possible data concerning those stains? No! Will it be a good thing to gather those missing data? Of course!”\nAnd concerning the idea that Adler could have had some doubts if the blood and serum stains could be something else than the blood and serum stains of the Shroud man, the answer is a definitive NO.  In his scientific reports, he couldn’t pretend the blood was surely human, but in his later writings, he made it clear that it cannot, in all logic, be something else.\nIn the case of Baima?  SAME THING.  Read again their books!  I should have note what Adler said in the intro of his book when he saw the Shroud in person.  It was something like:  Look!  It’s blood!  If it’s not the words used by someone who was totally convinced of the “authenticity” of those stains, then I don’t know what it is.  For Adler, seeing those stains with his own eyes was enough to confirm his conviction that this was the real blood and serum stains of the man depicted in the body image.\nAnd it’s the same thing for a wide range of experts on the subject like Pierre Barbet, Rudolf W. Hynek, Giovanni Battista Judica-Cordiglia, Sebastiano Rodante, John Heller, Robert Bucklin, Frederick Zugibe, Gilbert Lavoie, Pierre Merat, etc. \nYou only have to read all their writings to understand they were all totally convinced of the real nature of those stains.  And if it’s so, it can only mean one thing: for all of those specialists, those stains were so obviously coming from a crucified man that they couldn’t thought for one second that they could have come from someone else than the Shroud man himself.  Or else, they would never had showed a so great confidence in their conclusion that what appear to be real human blood and serum on the Shroud cannot be anything else than real human blood and serum and, even more than this, that those stains must have come from the Shroud man’s corpse who once was enveloped in that cloth.\nLast note:  This message of yours prove to me that you’re exactly like a modern astrophysicist who would still cast doubts over the existence of exoplanets because we still have some data to gather in order to get a full profile of those planets or just like a modern historian who would still have doubts concerning the reality of Jesus’ existence because there are still a bunch of unknown data concerning this issue.\nThe question is not if we have the full profile of those stains today (of course no!), but if we have enough data to conclude those stains cannot have come from anything else than the Shroud man himself?  The answer of Adler, Baima Bollone, Zugibe, Barbet, Lavoie and a bunch of other experts is a definitive YES.  Their confidence on this question is good enough for me and I don’t need to wait for the supplementary data because I know those stains couldn’t come from anything or anyone else than the Shroud man, especially when we consider the FACT they most of those stains comes from moistened blood clots.\nIt’s funny to see that you never talked about this FACT and it’s implications…  Adler and Baima knew what this imply.\n\n","date":"June 22, 2014 at 7:45 pm","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-132402","author":"Yannick Clément","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"The scientific tests to determine that bloodstains are of human origin involve immunological and/or DNA analysis.  Period.  It’s irrespective of whether there’s an image of a person on the cloth or not.  Has to be-otherwise it becomes subjective.  The bloodstains are forensically accurate.  Important, yes, but still involves a measure of subjectivity.  The scientific tests to determine that bloodstains are of human origin involve immunological and/or DNA analysis.  Period. Anything less than that, “100% certainty” isn’t warranted-will not hold up in the scientific arena.  The first type of tests (immunological) have been done, but the data has limitations, well-recognized and voiced by Dr. Adler.  Dr. Baima-Bollone did not address this in his studies. Period.  \nIt is important that Shroud studies be grounded in a firm, scientifically transparent and scientifically accurate foundation.  If something is not completely there, to claim it is with “100% certainty” that it is a fact, excuse me, a FACT, is misguided fervor.  Rant all you wish on a blog, it can generate much noise, particularly with an overuse of the caps-lock button- take it out into the professional scientific mainstream-it’s like a tree falling in an isolated  forest: Next…  \nThe exoplanet analogy and reality of Jesus’ existence are completely off base, not to mention somewhat insulting.  This is much too time consuming, much too pointless.\n\n","date":"June 23, 2014 at 5:19 am","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-132477","author":"Kelly Kearse","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"I agree. Dear Yannick, enough already.\n\n","date":"June 23, 2014 at 5:58 am","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-132484","author":"Dan","site":"shroudstory"},{"title":"Everyone’s Own Facts","post":"Kelly Kearse:\nQuote “The scientific tests to determine that bloodstains are of human origin involve immunological and/or DNA analysis. Period. Anything less than that, “100% certainty” isn’t warranted-will not hold up in the scientific arena. The first type of tests (immunological) have been done, but the data has limitations, well-recognized and voiced by Dr. Adler. Dr. Baima-Bollone did not address this in his studies. Period.\nIt is important that Shroud studies be grounded in a firm, scientifically transparent and scientifically accurate foundation. If something is not completely there, to claim it is with “100% certainty” that it is a fact, excuse me, a FACT, is misguided fervor. Rant all you wish on a blog, it can generate much noise, particularly with an overuse of the caps-lock button- take it out into the professional scientific mainstream-it’s like a tree falling in an isolated forest: Next…\nThe exoplanet analogy and reality of Jesus’ existence are completely off base, not to mention somewhat insulting. This is much too time consuming, much too pointless.” Unquote\nDr. Alan Adler was a very serious and honest scientist, the only American to be appointed to the Commission for the Preservation of the Shroud by Turin. He apparently knew how far he could go and paved the way for future research, which is now being taken up for immunological and/or DNA analysis by a professional. This is what we need, not another call for ego bashing.\n\n","date":"June 23, 2014 at 8:11 am","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","id":"comment-132496","author":"Louis","site":"shroudstory"}]
