[{"title":"Getting the Left and the Right Right","post":"Interesting comment made by Dave.  I truly appreciate his use of Barbet’s book.  Dave accurately reported that, for Barbet, the water described in John 19:34 was pericardial fluid which would have accumulated in a great amount from the trauma of crucifixion but even if I agree with Barbet’s point of view, I think it would be fair to report the conclusion of Zugibe and Bucklin who both thought that the water was coming from a pleural effusion instead.  But, as Barbet said, for this to happen, we must assume that this pleural effusion would have been massive because normally, such liquid would be located in the lowest part of the lungs, which is placed UNDER the location of the side wound…   Nevertheless, I thought it was interesting to note this alternative possibility.\nOne thing’s for sure:  Even if the water John reported having seen was understood by many theologian as non historical and only as an image of baptism and new life, the medical examination of the Shroud’s image and bloodstains is a scientific proof that in fact, it is probable that John really saw water coming out of Jesus side, along with blood.  In such a case, we can have a better understanding of John brilliant way to write his Gospel!  Effectively, it’s very probable that most if not all the events reported by him in his book were based on true historical events, but he was able to create some extraordinary theological images and teaching out of those events. Brilliant way to teach Jesus’ message!  That’s why John is, by far, my favorite Evangelist.  Also, let’s not forget that he was probably the only Gospel writer to have been an eyewitness of the events reported in the Gospel…\n\n","date":"December 26, 2012 at 7:46 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21151","author":"Yannick Clément","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"End of my comment should be read like this: eyewitness of the events reported in the Gospels (with an “s” at the end)…  Sorry.\n\n","date":"December 26, 2012 at 7:48 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21152","author":"Yannick Clément","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"My money would have to be on Barbet’s analysis.  It seems that the first suggestion of a pleural effusion was made in a hostile pamphlet “La folie de Jesus’ which Barbet despised and would not even give the author’s name.  It set out to prove that Jesus was of unsound mind and was tubercular, which goes against his apparently robust stamina and the active life he led.  However it was also suggested by a colleague who Barbet respected, Dr Rene Morlot, but Barbet does not accept his views on the matter.  \nBarbet himself conducted various experiments simulating the lancea wound, and was able to draw off significant quantities of pericardial fluid by aiming at the right auricle – the ventricles would be empty of blood.  He deduces that as the blow to the heart from the right was always mortal it was very likely taught in the Roman fencing schools, as the left side was usually protected by a shield.  This would then argue against the pleural effusion theory, as the wound would be too high and it would require too much fluid in the lungs of a normally healthy person for it to have been the source of the flow of “water”.     \nInterpreting the Johannine text in a symbolic way only, goes against the very strong emphasis John gives as it being a real event.  It is certain that the various writers seeing it in this way knew little or nothing  of anatomy, were confused about it, considered that blood could not flow in a corpse, and were desperate in reaching for an explanation.  Barbet limits himself to quoting St Jerome: “”This double flow conescrates at the same time the Baptism of water and the Baptism of blood of the martyr.”  But for Barbet, it was a real anatomical phenomenon which he had tested and proved. \nConcerning the authorship of John’s gospel, the following paragraphs are quoted from Encyclopedia Britannica:\n“Irenaeus calls John the beloved disciple who wrote the Gospel in Ephesus. Papias mentions John the son of Zebedee, the disciple, as well as another John, the presbyter, who might have been at Ephesus. From internal evidence the Gospel was written by a beloved disciple whose name is unknown.”\n“Because both external and internal evidence are doubtful, a working hypothesis is that John and the Johannine letters were written and edited somewhere in the East (perhaps Ephesus) as the product of a “school,” or Johannine circle, at the end of the 1st century. The addressees were Gentile Christians, but there is accurate knowledge and much reference to Palestine, which might be a reflection of early Gospel tradition.”  \nThe insistence of John 19:34 as to the flow of blood and water being an eye witness account, must surely support these verses as being part of this “early Gospel tradition”.\n\n","date":"December 26, 2012 at 10:40 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21160","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"“The considerable power of the lead object left on a rib is dependent on the speed and angle of the object relative to the rib and may as a consequence cause rib fracture (Svensson, 2010). The sharp ends of a fractured rib are able to damage intercostal veins and arteries during respiration followed by bleeding into a damaged lung sac, a common condition in emergency practice known as hemothorax (Svensson, 2010; Zugibe, 2005).”\nScientific Research and Essays Vol. 7(29), pp. 2513-2525, 30 July, 2012\nPleural fluid would not result from a chronic diffuse pleural effusion (tuberculosis ?!), but from direct traumas and rib fractures. The side wound is a direct access to pleural cavity, then, as suggested in Svensso’s article, the lance could have reached the pericardium and cardiac cavities.\n\n","date":"December 27, 2012 at 9:32 am","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21186","author":"anoxie","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"” But you need to view it on one of the several photographic negative images to reorient it to the correct view, when the image will then appear correctly on the right-hand side.”\nA photographic negative image does not reoriente left and right-hand sides. The image on the shroud is a mirror image, not a negative.\nAs sue benford explained, the best way to look at the shroud is to look at a photographic negative image (to correct the contrast) of the shroud in a mirror (to correct the left right-hand sides).\n\n","date":"December 27, 2012 at 11:30 am","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21195","author":"anoxie","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"Anoxie:  I have just read through Sue Benford’s paper published on the shroud.com site.  I believe she is mistaken in this assertion.  I note she appends the initials R.N., M.A. after her name but am otherwise unaware of her scientific qualifications, to make the comments she does.  I also note an appended comment by Thaddeus Trenn who teaches in the science and religion program, Victoria College, University of Toronto:- \n“She is correct that a lens would reverse left and right. The cloth original was not dependent upon any lens since the image pixels were the result of direct impact from object to cloth. While her observation is very valuable at excluding the sort of photography Leonardo allegedly conducted, the image on the cloth is like a photographic negative in the light/dark reversal effect. One only needs to compare the negative of the cloth image with the photographic positive of this negative to see the left-right reversal. So the positive becomes the left/right corrective, returning the side wound to the right side as on the cloth.” \nI am now looking at two illustrations in Ian Wilson’s “The Turin Shroud”, ‘Shroud positive, frontal aspect after Enrie’, ‘Shroud negative, frontal aspect, after Enrie’.  The wrist wound and the forehead bloodflow ‘3’ stain are clearly visible in both.  On the positive print, both images appear on the page left of centre;  On the negative, these are reversed and both appear on the page right of centre.  Looking at the negative as if it were a print we would say that the wrist wound is on the left wrist, and that the forehead blood stain is above the left eyebrow.  In all the literature I’ve read, it is on the left wrist that the wound is clearly visible.  \nBarbet himself is insistent that the wound in the side is on the TS man’s right side, and obviously considers that the Shroud negative shows the correct orientation in direct view without the aid of a mirror as postulated by Sue Benford.  I would have rather more faith in Dr Barbet’s forensics than in Ms Benford’s claims.  I find in close analysis, the comment on orientation by Thaddeus Trenn somewhat ambiguous.  Although the side wound is on the right side of the cloth, viewing it we would say it is on the left side of the body, which would be incorrect.\n\n","date":"December 27, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21206","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"Yes, the wound in the side is on the TSM right’s side.\nThe shroud image is a mirror image.\nA “negative image” may be confusing, but it doesn’t change left-right-hand sides, it projects the image upside-down AND left-right (then doesn’t change left-right-hand sides) and reverses colors. Then it depends on what you call a negative image.\n\n","date":"December 27, 2012 at 4:32 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21209","author":"anoxie","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"When I was in amateur theatrics, more years ago than I care to remember, directions to the actors were always to be understood as “stage-left” and “stage-right”, which were of course reversed from the audience perspective, but there was then no ambiguity as to what was intended!  I recall vaguely that stage-right was for the goodies and stage-left (sinistra) was for the baddies.\n\n","date":"December 27, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21210","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"There is no ambiguity, a negative doesn’t change left-right-hand sides, sue benford explanation is right.\n\n","date":"December 27, 2012 at 5:28 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21212","author":"anoxie","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"I’m sorry, I find her explanation contradictory and confusing, and I know I’m not dyslexic.  When I see a photo-print of a person with a watch on their left wrist, I can see it’s on their left-wrist, although it’s on my right.  When I see a photo-print of the TSM he appears to have a wound on his right wrist, although it’s on my left.  When I see the negative of the TSM, the wound appears to be on his left wrist, and it’s on my right.  There is a clear and unequivocal reversal of left and right between the positive and negative.  The “watch” is actually on the left wrist! Ergo there has been a left-right reversal!  Ergo, contradictory!, .\n\n","date":"December 27, 2012 at 7:34 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21216","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"It depends on what you’re looking at.\nI’m talking about the direct image, the side of the shroud/negative film which took the image.\nThe shroud is a mirror image, left and right hand sides are reversed.\nA lens would reverse right and left and up and down, then if you look at a negative film, the side which took the image, and turn it upside-down, left and right hand sides are not reversed.\nNow, if you’ve a transparent negative film, you can look through it from the other side, and left and right hand sides will be reversed, like in a mirror.\n\n","date":"December 28, 2012 at 5:34 am","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21233","author":"anoxie","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"For a teacher, the problem with negatives is that hardly any of his pupils has seen one. Any computer will produce a light/dark reversed image, but the photographic negative, transparent as anoxie mentions above, is practically a thing of the past. Is that why this thread is getting so convoluted?\n\n","date":"December 28, 2012 at 5:48 am","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21234","author":"Hugh Farey","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"Right.\n\n","date":"December 28, 2012 at 6:23 am","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-21236","author":"anoxie","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"Why doesn’t it show the sides, if he was wrapped in it wouldn’t it show the sides of the body, the image is flat as if it was painted on.\n\n","date":"February 20, 2014 at 11:46 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-81044","author":"audrey","site":"shroudstory"},{"title":"Getting the Left and the Right Right","post":"A good question Audrey, and much discussed. Possible answers from authenticists are…\n1) The shroud was more or less horizontal when the image was made because the body was packed with bags of spices or some such all around.\n2) The shroud was more or less horizontal because of some unknown physics related to the resurrection.\n3) The shroud was not necessarily horizontal, but whatever caused the image moved vertically up and down from the body, so didn’t impact on the more vertical planes of the shroud.\nEach of these has both supporters and gainsayers. There may be other hypotheses as well.\n\n","date":"February 21, 2014 at 9:39 am","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","id":"comment-81154","author":"Hugh Farey","site":"shroudstory"}]
