[{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"One of the most interesting papers is the one by Morgan on digital analysis of the area used for radiocarbon dating. It represents an interesting approach and after some further improvements, could well be accepted in a truly peer-reviewed journal.\nOne of the most obvious consequences of his work is that -although the author does not elaborate in this line- the trend detected by statistical analysis and recently published on a JCR journal, really exists. A simple glance at the figures clearly indicates that it is there.\nThe author provides the figures obtained with the scores corresponding to the first PC.  However in my view, a PC analysis to be really meaningful should be carried out with the whole Shroud, just like Marion did in his JCR paper. One of the purposes of PC analysis is to identify underlying effects and such a general approach could allow identification of what each PC represents. Perhaps, in this work using only a small area this is not possible.\nFinally, instead of using K-means I would recommend the author to confirm his clustering with a more reliable technique like Partition Around Medoids. The value of the silohuette could help identify how many clusters should be used and again, results could be more meaningful. Nevertheless, perhaps a whole image is not available and it is not possible to go any further…..\n\n","date":"August 5, 2012 at 6:41 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14496","author":"Gabriel","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"The SRE website clearly states that, “A handling fee of $550 will be billed to the authors for each manuscript published. . . . Authors may still request (in advance) that the editorial office waive some of the handling fee under special circumstances.”\nI guess the special circumstances, according to Dr. G. Fanti, is “due to the importance of the argument.” What argument is that? The scientific argument that Jesus rose from the dead? That should go over well with the other authors and readers of this journal. \nReaders? Does anyone read SRE? Are there any stats? I imagine that if Barry Schwortz provides links, or this blog does, there will be readers.\n\n","date":"August 5, 2012 at 7:58 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14497","author":"Paulette","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Only an intense, highly localised corona discharge could have produced the image we see. I refer to Giulio’s tie…\n\n","date":"August 5, 2012 at 11:33 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14502","author":"colinsberry","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"And what about the image of the hair my friend ?  Do you have an example of an image of the hair of a person left on linen by a corona discharge ?  That’s just an example of the problems related to this hypothesis.  and that doesn’t come from me but from Ray Rogers himself.  Here’s what he said on that subject : “The lower density of the hair makes it UNLIKELY that large amounts of either HEAT OR RADIATION WOULD HAVE BEEN PRODUCED IN THE HAIR.  This suggests that vapor diffusion was involved in image formation, because any fibrous mat, INCLUDING HAIR, reduces the rate of diffusion of gases.  Fiber mats are used for insulation, because they reduce gas diffusion and heat transfer by convection.”\n\n","date":"August 5, 2012 at 5:00 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14506","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Geez Yannick that one went way over your head. Colinsberry was joking, and referring to the extreme brightness/colour of Fanti’s tie lOl…Take a close look at Fanti’s tie in the picture above Yannick.\nR\n\n","date":"August 6, 2012 at 1:11 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14513","author":"Ron","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Ok thanks !  I read it too fast.\nAnyway, my quote of Rogers is still good concerning Colin (scorch) and Fanti’s (corona) favorite hypotheses of image formation.\n\n","date":"August 6, 2012 at 10:41 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14536","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"That’s a very good one by CB…\n\n","date":"August 6, 2012 at 5:51 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14524","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Just to make sure anyone knows where I stand on the question of the authenticity of the Shroud (because the title of this topic can make people think I stand in the same gang than Colin which is completely false.  Here I stand :  In my recent paper about the evidence of the bloodstains (you can read it here : http://shroudnm.com/docs/2012-07-26-Yannick-Clément-The-evidence-of-the-bloodstains.pdf), I have showed quite clearly that the Shroud is a real burial shroud of a man who suffered the same exact tortures than Jesus of Nazareth, as reported by the Gospels.  On the second part of the question, i.e. the identity of the man of the Shroud, I am currently writting a follow up paper that will analyze the question in deep.  Personally, I have no doubt at all that this is the Shroud of Jesus of Nazareth, since the Shroud is a real burial shroud of someone who bears all his stigmatas.\nBUT…  I don’t believe the body image was formed because of the Resurrection (scenario #4 in my paper).  Instead, in the present state of our knowledge on the Shroud, I favored the scenario #3…  If you want to know what are those scenarios, just read my paper !\nTHAT’S WHERE I STAND IN FRONT OF THE SHROUD.  IT’S VERY DIFFERENT FROM COLIN’S POINT OF VIEW, THAT’S FOR SURE !!!!\n\n","date":"August 5, 2012 at 5:30 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14508","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"I want to ask this question to all of view :  Is it still possible for someone like me, even if I’m a Catholic who believe in the Resurrection of Christ, to think that scenario #3 in my paper is the most probable ???  When I read some comments posted here, it seems to me that you only have two choices :  Like Fanti, you believe the Resurrection is responsible of the image (scenario #4) or like Colin, you believe the Shroud is an artistic forgery (not even include in my 4 scenarios).  Don’t you think an in-between position (like scenario #3 in my paper) could be acceptable for a believer like me ???  I hate to see that most people interested in the Shroud seem to stand in one or the other of these two polarized positions…\n\n","date":"August 5, 2012 at 6:08 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14509","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Yannick, like anyone else, may believe whatever credible hypothesis that he prefers.  But one attitude that cannot be legitmately adopted, is dogmatic assertion.  There is simply insufficient evidence.  And that is unlikely to change in the very near future, because any further access to the Shroud for any further testing is unlikely to be permitted.  The only progress that can now be made is further examination, analysis and interpretation of data that is already available.  No further data or testing is going to happen any time soon.  And furthermore, it seems very likely that despite all the testing that has been carried out, this seems unlikely to yield any new definitive information.  \nYannick may if he so chooses, refuse to believe that the image was caused by the Resurrection.  But this cannot be domatically rejected by the evidence.  A major problem for any rational explanation in my view arises from: 1) The image is projected orthogonally on to the cloth and there are no images from the lateral aspect (side view); 2) The high resolution of the image.  Both of these properties seem to rule out any kind of gaseous diffusion as being the primary cause of the image, but the gases may be conjectured as providing a secondary vehicle allowing the image to be transferred.  \nThe orthogonality of the image is strongly suggestive of some kind of directional mechanism.  I think this may explain why some of the papers offered, look to such possible sources as neutron or proton exchange, either emanating from the body itself (Resurrection?) or release caused by a physical phenomenon such as earthquake or lighting.  And whether we like it or not, this begins to enter the realm of the conjectural. \nOne of the papers referring to possible earthquake source, suggests a Richter 9 earthquake.  This is an absolutely devastating earthquake at any depth at all typical, and the historic evidence for this is scant.  Giovanna De Liso succeeded in getting high resolution images with 3D properties at quite moderate levels of seismic activity.  Christchurch NZ is still recovering some 18 months after a shallow Force 5 earthquake, with many buildings still being demolished as unsafe, and rebuilding is still in its early stages.  A Force 9 earthquake in 1st c. Palestine would have been extensively reported by the likes of Josephus and others.  It would have done a lot worse damage than merely rending a temple veil in two, or rolling away the occasional tombstone!\n\n","date":"August 5, 2012 at 6:50 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14510","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Correction to Christchurch earthquake information.  Reported 5:30 PM Tuesday Feb 22, 2011:\n“The earthquake was magnitude 6.3 and struck at a depth of 5km, 10km south-east of Christchurch CBD. It was shallower and closer to Christchurch than the 7.1 magnitude quake on September 4 (2010), which was recorded at a depth of 10km, near Darfield,  Three Geonet monitors in the Christchurch CBD recorded much worse ground shaking than was felt during the original September 4 quake. It was expected to have caused a fissure in the ground under its epicentre in Lyttelton.\nThe quake has caused devastation. Emergency services reported multiple fatalities, serious injuries and extensive structural damage to buildings. Hospitals throughout the South Island were cleared to take in a flood of patients from Christchurch.” \nEarthquake events of Richter 9 are comparatively rare events, and as I mentioned previously, could expect to be widely documented, even in 1st c. Palestine.\n\n","date":"August 5, 2012 at 7:39 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14511","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"daveb; “Both of these properties seem to rule out any kind of gaseous diffusion as being the primary cause of the image,…” Exactly, but what Yannick doesn’t understand is that we who oppose this scenario DO NOT rule it out completely as a ‘possible’ vehicle. Even Rogers made statement to this in his paper! He was well aware that diffusion (alone) COULD NOT HAVE CREATED THE IMAGE. Another phenomena was present. What this phenomenon was is the Million dollar question. I would also state that I tend to believe the gaseous diffusion hypothesis has issues in explaining the very high resolution of the Dorsal image(especially), and also as gases are known to eminate from the orifices first and foremost, to explain the amazingly precise imaging of the face area, where most gases would be present.\nI also tend to refute ‘lightning’ as having any possible chance of being a catalyst in the process, as the body was inside a tomb surrounded by rock. Earth quake? possible but not probable, but needs more study.\nR\n\n","date":"August 6, 2012 at 3:29 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14542","author":"Ron","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"If you read Rogers book, you don’t have a sense at all that he thought “that diffusion (alone) COULD NOT HAVE CREATED THE IMAGE”…  He NEVER wrote anything like that in his book.  Maybe he wrote something of that nature on the SSG or in a conversation with someone.  Anyway, I don’t think anyone has the right to categorically (without any doubt) state that “diffusion (alone) COULD NOT HAVE CREATED THE IMAGE”.  When you read Rogers book, you have a sense that he was not discarding that possibility IF VERY PARTICULAR AND RARE CONDITIONS WERE REUNITED.  I think it’s much more prudent and correct to think that way, even if I agree on the fact that, on a probabilistic scale, it seems more probable that there was another phenomenon that took part in the image formation along with a gaseous diffusion.  But having said that, I also want to emphasize the fact that it surely doesn’t mean at all that this other possible phenomenon was related with the Resurrection of Jesus-Christ.  And maybe (just maybe because we don’t know yet) this other phenomenon was just in fact something very similar to the alternative hypothesis proposed by Thibault Heimburger in one of his SSG paper concerning the urea that could have been present everywhere on the skin (and on the hair) after the drying of the sweat…\n\n","date":"August 6, 2012 at 3:40 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14543","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Precision :  When I say that “I don’t think anyone has the right to categorically (without any doubt) state that “diffusion (alone) COULD NOT HAVE CREATED THE IMAGE”, it is simply because science has not yet evaluate completely and correctly this hypothesis of Rogers IN EVERY POSSIBLE CONDITIONS REGARDING A 1st CENTURY BURIAL OF A TORTURED AND CRUCIFIED JEW.  So, from a strict scientific point of view, no one can be as sure as Ron seems to be that this hypothesis alone could not have created the image.”  I’m sorry but thinking that way is not correct scientifically, simply because it is mainly speculative (and also very premature versus the lack of experimentations done to test that hypothesis).\n\n","date":"August 6, 2012 at 3:47 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14544","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"\ndaveb of wellington nz :\n1) The image is projected orthogonally on to the cloth and there are no images from the lateral aspect (side view)\n\nIt is debatable. Image density could be correlated to the shortest path between body and shroud.\n\nMario Latendresse :\nWe have also conjectured that the mechanism of projection is probably neither normal to the skin, nor to the sheet, and not really perpendicular to gravity, but is probably following the shortest path to the sheet.daveb of wellington nz :\n2) The high resolution of the image.\n\nIt is debatable. I quote Rogers :\n\nMany claims have been made that no diffusion process could yield the resolution observed in the image. Such claims should not be made or accepted without some realistic calculations and confirmatory experiments.","date":"August 6, 2012 at 5:45 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14553","author":"anoxie","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"As early as 1990s (see my 1998 Turin Shroud International Congress abstract in French and Italian), I wrote there were only 4 possible approaches to the Sindon image formation process mystery: the naturalistic, the “survivalistic”, the “supernaturalistic” and the “halakhistic” approaches.\n\n","date":"August 6, 2012 at 4:30 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14519","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Correction: As early as the 1990s (see my 1998 Turin Shroud International Congress abstract in French and Italian), I wrote there were only 5 possible approaches to the Sindon image formation process mystery: the naturalistic, the “fraudulistic”, the “survivalistic”, the “supernaturalistic” and the “halakhistic” approaches.\n\n","date":"August 6, 2012 at 4:36 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14520","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Another interesting paper is the one by Gerard Lucotte. He has analyzed some mineral particles from the face of the Turin Shroud. Seemengly, the sample was provided to the author by Giovanni Riggi di Numana, a STURP member.\nThe analysis of the particles yields a very low amount of aragonite, and most of the calcium carbonate particles are of very modern origin (washing power). The author provides several SEM photographies for the different types of particles he has analyzed in his sample.\nIt would really represent a step forward if the author could also provide a SEM photography for the few particles of aragonite he has found. The reason is that in the paper of Kohlbeck and Nikowsky of 1986 in Biblical ARcheological Review, they give a spectrum comparing the composition of the aragonite sample they analyzed (provided by Rogers) and that from Jerusalem.\nIt would be great if a comparison of the three aragonite SEM’s (Kohlbeck’s 2 and this new one), could be done. If the same signature were found now independently 25 years later, it would represent an important confirmation of a Jerusalem origin for the Shroud.\n\n","date":"August 6, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14549","author":"Gabriel","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"I read a paper on Shroud.com by August D. Accetta, Kenneth Lyons and John Jackson investigating apparent x-ray qualities on the Shroud. From the paper “The Shroud image suggests quite strongly the presence of many skeletal details e.g. carpal and\nmetacarpal bones, some 22 teeth, eye sockets, left femur, left and possibly right thumbs flexed under the palms of the hands, as well as soft tissue and soft tissue injuries; all presumably originating from some form of radiation emitted from the body enshrouded.”\nHas this line of enquiry been discredited? If indeed these phenomenon can be observed on the Shroud, then seems overwhelmingly in favour of a supernatural burst of energy.\n\n","date":"August 6, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14550","author":"ChrisB","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"My comment at #10 above suggested two SCIENTIFIC reasons why the gaseous diffusion model seemed inadequate alone to produce the image: 1) orthogonality of the image, 2) its high resolution.  I am not the first to have suggested this.  I think either Gabriel or possibly Paulette may have mentioned this previously.  I also mentioned De Liso’s work reported in 2010 – she produced high definition 3D images as a result of moderate seismic activity.  De Liso’s paper is included in the citations mentioned in the Carpentiri et al paper.  It can be found at: “Shroud-like image formation during seismic activitiy”; Giavanna de Liso; ENEA Frascati Conference May 2010: http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\nIt could also account for the xray qualities of the image mentioned by ChrisB at #18 above.\nHowever I don’t necessarily concur with his comment: “…seems OVERWHEMLINGLY in favour of a supernatural burst of energy”, but I believe neither can it be excluded.  \nI suggest Yannick perhaps should reread the header at the top of this posting – a more open-minded approach seems indicated than he seems prepared to acknowledge.  \nI also think that Gabriel at #17 makes an important point concerning the aragonite samples mentioned in the Lucotte paper.  At present the findings mentioned in the Kohlbeck/Nikowsky 1986 paper are orphans, and it would be wonderful if their findings could be given some corroboration.\n\n","date":"August 6, 2012 at 5:40 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14552","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"\nYannick Clément :If you read Rogers book, you don’t have a sense at all that he thought “that diffusion (alone) COULD NOT HAVE CREATED THE IMAGE”… He NEVER wrote anything like that in his book. Maybe he wrote something of that nature on the SSG or in a conversation with someone. Anyway, I don’t think anyone has the right to categorically (without any doubt) state that “diffusion (alone) COULD NOT HAVE CREATED THE IMAGE”. When you read Rogers book, you have a sense that he was not discarding that possibility IF VERY PARTICULAR AND RARE CONDITIONS WERE REUNITED. I think it’s much more prudent and correct to think that way, even if I agree on the fact that, on a probabilistic scale, it seems more probable that there was another phenomenon that took part in the image formation along with a gaseous diffusion. But having said that, I also want to emphasize the fact that it surely doesn’t mean at all that this other possible phenomenon was related with the Resurrection of Jesus-Christ. And maybe (just maybe because we don’t know yet) this other phenomenon was just in fact something very similar to the alternative hypothesis proposed by Thibault Heimburger in one of his SSG paper concerning the urea that could have been present everywhere on the skin (and on the hair) after the drying of the sweat…\nYannick, Rogers did definately make that statement in his paper. I am not making it up. Furthermore, I also think anyone with any sense can “catagorically” make the statement “that diffusion alone could not have created the image”, just as well as one can claim diffusion alone could. The proof is in the science and the science so far has no answer…so let’s leave it at that, already.\nR\n\n","date":"August 6, 2012 at 6:31 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14554","author":"Ron","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"I’ve read anything Rogers wrote publicly on the Shroud and NEVER note a categorical statement like that from his mouth !!!  I think it’s true that he had personal feelings that there should be another phenomenon that was going on along with a gaseous diffusion, but as an honest and good scientist, I really don’t think he was categorical like you say concerning his hypothesis of a Maillard reaction caused by a gaseous diffusion.\nIf I’m wrong about that Ron, show me the proof !  Show me the exact statement (along with the correct reference) of a statement like that from Rogers official writings on the Shroud (whether it be his book or one of his paper).  I’ll wait for you on that.  Honestly, I really don’t remember that Rogers ever officially wrote that “diffusion (alone) COULD NOT HAVE CREATED THE IMAGE”.  Maybe my memory plays game with me.  If it’s the case, please give me the exact statement of Rogers and where he wrote that.  THANKS !\n\n","date":"August 7, 2012 at 10:41 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14586","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"It .\nis \n\n","date":"August 7, 2012 at 3:52 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14558","author":"Gabriel","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"f\n\n","date":"August 7, 2012 at 3:53 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14559","author":"Gabriel","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"w\n\n","date":"August 7, 2012 at 3:53 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14560","author":"Gabriel","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Sorry Dan for my three previous comments, I am having some problems with my connection.\nI wanted to comment on #15: Anoxie says: It is debatable. Image density could be correlated to the shortest path between body and shroud.\nIn my opinion, at this point two different aspects must be analyzed separatedly:\n1. Even though the main direction is not vertical, but following the shortest path to the cloth from the body at every point, there is still the issue of the unique correspondence between each point on the body and on the image. On the cloth we can see that each point on the body corresponds to a point on the Shroud and not to a probabilistic density function (pdf) on the cloth,as could be expected from a difussion process based on Fick’s law.\n2. In this case, a new major challenge arises: what mechanism could it be that makes that the shortest distance to the cloth at each point the main driving vector connecting the body and the Shroud?\n\n","date":"August 7, 2012 at 4:00 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14561","author":"Gabriel","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"1/ I may have misundertood your point but i think you mean each point on the image corresponds to a point on the body.\nLet’s take a probabilistic density function on cloth based on a diffusion mechanism, given a continuous production of amines on the body and an absorbing boundary (cloth).\nThis mechanism conjugates each point on the Shroud to an area on the body (= points reachable through a random walk).\n2/ Given the previous mechanism, image density is correlated to the shortest distance between body and cloth.\nOther parameters are at stake : ditribution of the reactive amine, surface properties (hair/nude skin), local topography.\n\n","date":"August 7, 2012 at 4:44 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14562","author":"anoxie","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Following on from Anoxie’s and Gabriel’s comments #15 & #25, I’ll concede that mine at #10 may be inexact: “1) The image is projected orthogonally on to the cloth and there are no images from the lateral aspect (side view);”  But I’d also query whether the path is following the shortest distance as Anoxie asserts.  It would depend on how the cloth was draped.  In earlier postings, Max Patrick Hamon had asserted that the body was completely wrapped, on the basis that the customary rites were completed.  Others have suggested that the cloth was merely draped over the body, possibly supported at the sides by the 100 lb package brought by Nicodemus.  Still another version has it that if it occurred during the moment of Resurrection, with both the body and the cloth hovering horizontally, suggested by the apparent weightlessness visible on the dorsal image (no dorsal deformation apparent).  For their 3D VP8 simulation calibration, Jumper and Jackson had the cloth lightly draped over.their model.  \nThe point I guess I was attempting to make, was that superficially the image is what we would expect to see in an ordinary 2-D photograph, with none of the body’s sides showing on the image, not even indistinctly.  For me, this seems to be a fairly compelling argument that gaseous diffusion could not be the primary cause of the image.  The boundaries at the edges of the image are reasonably sharp.  There is no sign of wrap-around.  \nGabriel’s comment at #25, ” issue of the unique correspondence between each point on the body and on the image” (not a pdf), also implies high resolution, but needs the qualifier that there are no corresponding points from the sides of the body.  \nTo me it’s starting to look like high energy particles, or a form of radiant energy.  I think that direct contact has to be ruled out because of the apparent 3D properties.\n\n","date":"August 7, 2012 at 5:31 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14564","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"\ndaveb of wellington nz :\n But I’d also query whether the path is following the shortest distance as Anoxie asserts.\n\nI was quoting Mario Latendresse, who was still thinking of a projection mechanism.\nWhat I said is image density could be correlated to shroud-body distance. Correlation can be strong/weak, linear/non-linear, and may depend on local conditions.\n\ndaveb of wellington nz :\n none of the body’s sides showing on the image, not even indistinctly.\n\nIt can be another counter-intuitive aspect of the Shroud image. You claim we can’t see body’s sides, but can you see forearms, hands and fingers sides ? medial sides of the legs ? Hardly, still it could be consistent with a diffusion mechanism, the shroud laid on the body.\nCompare front and back images of upper part of the legs, front image is much larger than back image. Is it simply due to the distortion of the shroud laid on the body or can we see larger parts of sides on front image ?\n\n","date":"August 7, 2012 at 6:25 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14565","author":"anoxie","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Daveb WNZ wrote: “The boundaries at the edges of the image are reasonably sharp. There is no sign of wrap-around.”\nSuch a claim is neither a full-truth nor a proven fact . It may be/is just another optical illusion. as solid objects might well have been pressed laterally and “bridges” between cloth/body been created via wrapping up. \nActually if you take a close look at the discontinuous space betwwen front & back head contrast enhanced HD reflected and raked light images and the forearm, hip, calf, foot contrast enhanced HD reflected & raked light images as well, the boundaries at the edges of such images ARE DEFINITELY NOT “reasonably sharp”…\n\n","date":"August 7, 2012 at 8:30 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14571","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Correction: “solid objects such as flower heads and plants might well have been pressed laterally and consequently  “screens” and “bridges” between cloth/body been made via wrapping up. “\n\n","date":"August 7, 2012 at 9:12 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14577","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Mistyping: HR\n\n","date":"August 7, 2012 at 8:36 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14572","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"…they form a sfumato.\n\n","date":"August 7, 2012 at 8:38 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14573","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"anoxie:This mechanism conjugates each point on the Shroud to an area on the body (= points reachable through a random walk).\nThis is the point where I see a difficulty. If every single point on the Shroud is connected to an area (and not to a single point!) on the body through a random walk, I would expect a diffuse image to appear since contiguous points would partially share the same areas and the image should appear much more blurred than what we see.\nI see the same difficulty if it were the other way round (This mechanism conjugates each point on the body to an area on theShroud(= points reachable through a random walk).\n\n","date":"August 7, 2012 at 9:03 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14575","author":"Gabriel","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Precisely, you can see diffuse borders because each point on the shroud has a conjugate area on the body, the size of which depends on body-cloth clearance and local topography.\nAmmonia mean free path is around 60 nm, given the absorbing boundary (shroud), you can see this area (let’s say the area responsible for 95% of the image coloration at a given point on the shroud), is quite limited.\nConcerning the face, let’s take a point on the shroud in contact with the mustache or the exyebrows, the conjugate area is smaller since diffusion of gases is reduced by hairs (and the contrast higher since hairs may have concentrated sweat).\nI don’t see any theoretical contradiction, but more image-formation experiments are needed.\n\n","date":"August 7, 2012 at 10:51 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14588","author":"anoxie","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"… and what happens if you treat some area of the Face with the talc powder as it seems to be happened following (in an acritical manner) the discovery by Lucotte ?\nRegards,\nPiero\n\n","date":"August 9, 2012 at 9:35 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14657","author":"Piero Iacazio","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"And how can we be sure if Lucotte’s samples are really valid and really come from the Shroud ?  There’s no way to be certain of this and you have to understand that Turin don’t recognized the samples he claim to have in his possession.  I have read a book last year on the Shroud written by a Frenchman and he interviewed this guy Lucotte and it was obvious to me that he’s another member of the lunatic fringe.  Just an example : he claimed he has found pubic crabs in his samples and concluded that Jesus must have had a pretty wild sexual life !!!  He’s just another clown (one more !) that wants to get the spotlight on him while using the Shroud and pretending to do good science !!!  Personally, I wouldn’t put any faith on anything this guy say or conclude concerning the Shroud.  \nIn conclusion, here’s an important message to all of you : BE CAUTIOUS PEOPLE BEFORE PUTTING YOUR TRUST ON ANYONE WHO CLAIM TO HAVE FOUND SOMETHING NEW CONCERNING THE SHROUD !!!  There’s alot of wacos out there who pretend to do good science…  The Shroud seems to act like a magnet on this kind of people.\n\n","date":"August 9, 2012 at 10:37 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14660","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"In any case the discovery of the talc is an interesting fact (if the material controlled is the true material from the Shroud) and now we can try to do some simple experiments (included the works about the hypotheis of the talc as material used during the ceremonies for the “sanctified copies” ! See also : the strange case for the discovery about the HgS and McCrone … ).\nSo, we have to find the truth about the use of the talc powder …\nRegards,\nPiero\n\n","date":"August 10, 2012 at 10:37 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14719","author":"Piero Iacazio","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"I beg pardon : hypothesis and not hypotheis !\n— —\nAt present the question of the bloodstains treated with talc powder seems to be only an hypothesis (without the inherent proofs).\nWhat is your idea ?\nPiero\n\n","date":"August 10, 2012 at 10:42 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14722","author":"Piero Iacazio","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Here, I want to express in detail my opinion versus the samples used by Gérard Lucotte for his researches about the Shroud.  Part of his study and findings has been published in a new article included in this “special edition” about the Shroud.  I must also say that this opinion is valid also for any other researches that could have been made with the same kind of samples that were used by Lucotte. \nLucotte state in his article that the samples he used for his study came from the dust that was vacuum by prof. Riggi in 1978 (and also in 1988 if I’m right) on the BACK OF THE SHROUD.\nIf this is really true, these kind of samples are much more subject to “false positive” results than the sticky tapes samples lifted from the internal surface (the one where we see the image) of the Shroud by STURP because for the vacuum dust, there is absolutely no way to learn the exact original position of any particles on the back of the Shroud.\nAnd even more problematic :  We have no way to know if some parts of this material was originally on or in the Shroud or if it come from the Holland backing cloth that was in direct contact with the back of the Shroud !!!  And it is also possible to think that some particles collected by Riggi were in fact external intrusive stuff that were deposited between the Shroud and the Holland cloth at some unknown dates after 1534, when the Holland cloth was sewn behind the Shroud to solidify the relic after the fire of 1532. \nSo, taking all these things into account, I hope everyone will see the big problem that exist concerning the real scientific validity (and value) of such samples of dust…  \nAnd last but not least, there’s another great danger regarding these particles :  The time gap that exist between when Riggi took them and today.  The last time he collect dust samples with his vacuum was probably in 1988 !!!  It’s been 24 years now !!!  And if we considered only the dust particles he took in 1978, that’s 34 years from now…  The fact is this :  During all these years, there is absolutely NO WAY to be certain if Riggi preserved these dust particles properly, without giving any chances for an external contamination from other dust particles coming from elsewhere than the back of the Shroud, i.e. from all the places he kept his samples during all those years.  This is a MAJOR problem concerning this kind of very fine dust particles and that’s just add to the interrogations I’ve raised above concerning the real scientific validity (and value) of such samples.  How can we be sure if Riggi preserved his dust samples the correct way to avoid any external contamination ?  The truth is this :  There’s no way to be sure about that !!!  In his book The Rape of the Turin Shroud, William Meacham gives a very fine example of such a problem concerning samples that were separated from their original resting place for a long period of time.  He report that in 2000, Jacques Evin and Robert Otlet made a proposal for further testing in order to confirm or not the C14 result of 1988.  Part of their proposal included some tests to be carried out on the reserve piece that was cut out from the original C14 sample and kept in Turin.  Here’s what Meacham wrote about that : “There are several basic PROBLEMS with this approach, notably the fact that the so-called “reserve” has been SEPARATED from the Shroud FOR SO MANY YEARS, that is has been in VARIOUS HANDS and STORAGE CONDITIONS, and cannot be said any longer to REPRESENT even the samples that were dated.”  I really think the same caution principle should be applied to the dust samples that were taken from the back of the Shroud by Riggi so many years ago.  Scientifically speaking, it is simply impossible now to state without any doubt that these particles offers an authentic representation of the original dust that was present on the back surface of the Shroud at the time Riggi collect them…  There’s just too much unknown related to these ancient samples (after 24 to 34 years, I think it’s fair to call them “ancient samples”) to put a blind confidence in them.  That’s what I think.\nBecause of all these potential problems exposed above, a GREAT DOUBT exists and it will never be possible to erase it completely.  So, be very cautious before putting your faith in the finding claims made by Lucotte and anyone else who have studied these dust particles.  It is far from being sure that they really come from the Shroud and/or that they were originally present when the body was removes (or disappeared) from the cloth.  Rogers said this in his book : “Such evidence would never hold up in court.”  He was talking about the real validity of the few red particles that were found outside the inner wrapping that contained the Zina thread, but the same line of thinking can be also applied (even more maybe !) to these dust particles collected by Riggi.  In the particular case of Lucotte’s study, to be more precise, we should say “these mineral particles found in the dust collected by Riggi.  The truth is this :  All these kind of loose particles could have come really from anytime, anywhere…  Since it is IMPOSSIBLE to be sure that all this material was originally on the Shroud, all the claims that can be made from their study should be taken as containing a HIGH RISK OF ERRORS DUE TO BAD INTERPRETATIONS AND CONTAMINATION. \nOf course, you can trust what you want but, personally, I would not put my confidence in any finding made only from these dust particles (whether it come from Lucotte or any other researcher) and I prefer to wait for an independent confirmation of these findings from what was find by the STURP team with their sticky tape samples and also from a future direct sampling on the Shroud’s surface (hypothetical for the moment) that could be performed more properly, scientifically speaking, i.e. with much more precision and professionalism than what was done by Riggi.  To accomplish that, a direct lifting of particles (with a sticky tape like STURP did in 1978 or maybe with another more modern method) should be preferred over another vacuuming of the cloth (that should be avoid completely).  I really think that any finding that come from these dust particles should be considered with a great prudence !!!  That’s what I think.\nCarlos the other day states that the problem in Shroud science (or any other kind of science) could come from the methodology that is used.  Even if I agree with him, it’s obvious that there are other types of problems that could pollute Shroud science.  In the particular case of Lucotte, I think there’s 2 major problems not related to his methodology :  1- The highly questionable validity of his samples and 2- His own questionable credibility and integrity versus the Shroud.  These are two important problems that we can detect (or at least suspect) in this particular case and you can be sure that it’s not the only problematic case of that nature in all the history of Shroud science !!!\n\n","date":"August 12, 2012 at 6:38 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14849","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Dear Prof. Fanti,\nFirst of all I agree with you about the extremely vague certification about the samples used by Lucotte. But you are the responsible for some dust particles taken by Riggi that you used and perhaps you can say some other words also about the advanced analyses, the possible SPMs analyses … remembering that we have to work in a non-destructive manner.\n— — — —\nLast week I have read all the papers of the Special Issue (!).\nThe work by Lucotte seemed interesting because he has found the talc powder sticked together the blood particles.\nThen we have to explain this fact.\nThe possible reasons for that particular fact are the following :\n1) contamination. Included the process similar the inclusion of the HgS particles in the linen cloth that McCrone has found. Then the explanation can be the same. During the copy (contact) the transfer of the particles happened and then the talc powder was sticked with bloodstains (this phenomenon requires a certain pressure).\n2) treatment of the corpse : this happened during the phase of the Deposition. After the use of the Oviedo’s cloth (Sudarium of Oviedo) the disciples used the talc powder (perhaps before to cover the corpse, into the tomb. This fact can also be considered as a proof for the preparation of the corpse (also in order to stolen the body !?!). But we have no proof about this particular idea. The work by Lucotte cannot be used for that purpose. It is too rough (from the point of view of the SPM controls). The level of the analyses for the talc powder sticked with blood particles is not useful because it is too rough. He has not used the SPMs analyses and then, reading that work, we have no exact idea. What is the reason for the blood particles sticked with blood particles ? We can only speak about the vague hypotheses.\n3) the entire linen was covered with talc powder (this seems to be a very strange idea). See the previous scenario. We have no useful proof to speak in one manner or another.\n— — —\nIn conclusion : we have to see what will be the verdict obtained from the use of the Scanning Probe Microscopies (= SPMs).\nDo you agree on that simple perspective ?\nI underlined this fact in 1998…\nRegards,\nPiero\n\n","date":"August 13, 2012 at 10:41 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14893","author":"Piero Iacazio","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Here’s an important note concerning my previous comment about Lucotte sample :  I made a reading mistake.  That’s what happen when you read too fast a document that his written in another language than your native tongue !!! The sample Lucotte analyzed didn’t came from the dust from the reverse side of the Shroud that was collected by Riggi with a vacuum but from a small sticky tape sample applied by Riggi in 1978 in the region of the face where there was a bloodstain.  Nevertheless, the caution principle I exposed is still good to some extend, especially for the part where I talked about the possible problems of contamination and representativity of such an old sample that surely endured different storage conditions and that was probably handled by many persons.  In other words, we must still be very prudent versus the claims made by Lucotte concerning the particles he found in this very little sticky tape sample !  So, don’t be too fast to reach prematured conclusions about that and I’ve noted in Piero’s last comment that his personal prudent interpretation of the results cannot surely be called “prematured” or “inconscious” !  Bravo Piero for being prudent like that.  That’s the right way to see these results obtained by Lucotte.  And remember that Adler and Heller in the US and Baima Bollone in Italy, even if they have done many analyses of blood particles from the Shroud NEVER found anything of that nature in their samples (at least, to my knowledge).  This is one fact that seem to favored the option #1 of Piero, which deals with the idea of a surface contamination of the sample.  In face of all the data collected by STURP and Baima Bollone, I really think there’s a pretty good chance that these mineral particles came from a contamination…  Again, we must remember the old age of this particular sample and the fact that we don’t know the exact conditions (and the number of different conditions) of storage, along with the fact that we don’t know how many hands have touched this sticky tape sample over the years.  Last comment :  This caution principle versus any ancient sample from the Shroud is also true for any sample that was collected by STURP in 1978…  I think Shroud science should avoid making analyses like that on such questionable samples and instead, wait patiently for another series of direct researches and sampling from the Shroud that will surely be accepted one day.  That’s what I think.\n\n","date":"August 14, 2012 at 8:30 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14937","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"“The sample Lucotte analyzed didn’t came from the dust from the reverse side of the Shroud that was collected by Riggi with a vacuum but from a small sticky tape sample applied by Riggi in 1978 in the region of the face where there was a bloodstain.”\nSchwortz claimed as a “FACT” that NO sticky sample was ever lifted off from the Shroud face area in 1978. Now after Max Frei’s sticky sample, we have another one lifted off from the Shroud Face by Riggi!\n\n","date":"August 14, 2012 at 10:01 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14940","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"You got an excellent point Max !  And in his 2000 book, Baima Bollone wrote that Riggi once claimed he was able to analyzed a blood sample from the Shroud that confirmed the high level of bilirubin found by Adler and Heller, but Baima Bollone was extremely skeptical about this claim from Riggi.  In his book, he wrote something like “Riggi said he analyzed a blood sample from the Shroud but what was this sample ?  And when did he took it ?”  As you see, there’s a big problem with the level of validity (and the possible contaminations) of such “non official” samples that some researchers claimed to come from the Shroud…  Personally, I would never put any trust in such findings made from samples that we don’t know the validity.\n\n","date":"August 14, 2012 at 11:29 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14949","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Yannick, don’t you mistook my point. Actually Max Frei DID lift off a sticky tape sample from the Shroud face (and Schwortz is really wrong in “his” fact). As far as Riggi’s is concerned,  contamination is the key-issue.\n\n","date":"August 14, 2012 at 11:46 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14951","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Mistyping: mistake\n\n","date":"August 14, 2012 at 11:47 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14952","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"I was talking about Riggi lone little sticky tape sample used by Lucotte for his testings and not about Frei’s sample…  You’re completely right about the contamination issue.  BE VERY CAREFUL WITH THESE RESULTS FOLKS !!!\n\n","date":"August 14, 2012 at 12:59 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14955","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"Dear Prof. Fanti,\nThank you for your praise …\nNow, what I want to underline is the question opened by Lucotte with these rough analyses (on material not properly certified).\nIs it possible to test in the right (non-destructive) manner the blood  crusts (with direct inspection) ?\nThis seems to be very difficult, but I believe that using the SPMs techniques we can discover the situation (but, after the centuries, the material can be brittle).\nThe evaluation for the adhesion of the blood on linen is another interesting point to investigate. Unfortunately (if I am right) there is no adequate study (for an ancient archaeological linen) on that forensic argument.\nSo, we have to work for the right research about the Shroud.\nI believe that some experiment about the blood stain dried into the weave of the linen samples and the subsequent ageing treatment is the starting point in order to see what happens in the case of the talc treated (or not) stains.\nWhat is your answer ?\nWhat is the true response from the linen treated with blood in the case of vibrations ?\nSee also : the “earthquake scenario” (in the Special Issue : Lattarulo, Carpinteri, and other researchers indicated the presumed earthquake and the inherent consequences) and the different level of vibrations.\nI believe you are an expert in this field of vibrations because I have read your study on damping measurement of bending vibrations in alpine skis (an improvement of Standard ISO 6267, year = 2006).\nSo …\nThank you in advance !\nRegards,\nPI\n\n","date":"August 14, 2012 at 10:39 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-14944","author":"Piero Iacazio","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"I see that my remark about the difficult measurements on linen (connected to the vibrations in the presumed earthquake scenario) has no answers.\nIn my opinion it is possible to measure the cellulosic degree of polymerization in order to understand what is the true epoch of the old material (= the Shroud). This is the right way to work (in my opinion), the earthquake is a particular idea and we have not yet focused the limit to take in account when we speak on that subject.\n— —\nIn order to show what is the true age we have to control the linen fibrils.\nPerhaps we can think to do something about the Viscoelastic Measurements of cellulosic chains (see also : the single cellulosic chains and the hydrogen bonds) by Driven Oscillation of an Atomic Force Microscope Cantilever… or similar works.\nIs it too difficult that control ?\nregards,\nPiero\n\n","date":"August 20, 2012 at 10:45 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-15260","author":"Piero Iacazio","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"In my opinion the way indicated by Lattarulo, Carpinteri, etc. is a particular question. The vibration of the linen sheet during the other seismic activity seems to hinder the good resolution (but we have to try to calculate something about the resolution, the mechanical damping and the linen and the limit of the presumed seismic activity).\n— —\nIn any case our first interest is to find the true epoch of that ancient linen cloth and the second question to solve is the scientific explanation for the BIF (with the inherent proofs).\n— —\nIt seems that we can work to do something for the first point.\nHere some interesting information about the cellulose and the AFM.\nFor example, look at the address :\n\nThe image shows the atomic structure of three strands of fiber, or cellulose. White balls are hydrogen atoms, black balls are carbon atoms, red balls are oxygen atoms, and turquoise lines are electrostatic hydrogen-bonds.\n— — —\nThe title of an old work :\nSurface structure of native cellulose microcrystals by AFM\nA.A. Baker, W. Helbert, J. Sugiyama and M.J. Miles\nApplied Physics A: Materials Science & Processing\nVolume 66, Supplement 1 (1998), S559-S563, DOI: 10.1007/s003399870002 \nThe most significant finding in this work is that it has been possible to image the cellobiose repeat along the chain because of topographic differences associated with the asymmetric glucose unit, and thus identify triclinic structure on the microcrystal surface.\n— —\nAnother work :\nNew insight into cellulose structure by atomic force microscopy shows the i(alpha) crystal phase at near-atomic resolution.\nA A Baker, W Helbert, J Sugiyama, M J Miles\nH. H. Wills Physics Laboratory, University of Bristol, Bristol BS8 1TL, United Kingdom.\nBiophysical Journal (impact factor: 4.39). 09/2000; 79(2):1139-45\n— —\n\n","date":"August 21, 2012 at 8:25 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-15309","author":"Piero","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"I hope you have read the studies by Baker that\nI have indicated in my previous message.\nWell …\nIn my idea the problem to solve is the following :\nHow to  find the length of a single chain ?\nYou can think that a cellulosic chain can be a vibrating string…\nFor example, see under :\nhttp://en.wikipedia.org/wiki/Vibrating_stringv\nYou can also remember Lord Kelvin and the dissipation of the mechanical energy, the mechanical damping, etc.\nThese things are more interesting at level of fibres, for the characterisation of mechanical behaviour of deformations (or stresses) below the level of destruction.  See also : the damping coefficient (and the viscous damping ratio, etc.) and the inherent equations.\nThe range of tensile deformations where the Hook’s law can be applied to the textile fibres can be as small as 0.03%.\nBut (in order to detect the epoch for that ancient material) we have to work at molecular level, perhaps with a great amount of observations…  …\nSo …\nWhich types of playing techniques for the molecular chain ?\nAnd, at the end …\nHaving observed the great number of cellulosic chains you must use the Statistics.\nRegards,\nPiero\n\n","date":"August 24, 2012 at 10:43 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-15428","author":"Piero Iacazio","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"First of all\nI beg pardon about the wrong name Hook, instead of Hooke ! Sorry.\n— — —\nAnother thing :\nWhen we want to observe (in a careful manner) the cellulosic chains we have to take in account the centuries and the fact that perhaps fungi and bacteria secrete glycoprotein cocktails to deconstruct cellulose … and so we have to detect the residual presence for these compounds.\nGlycosylation is the covalent addition of polysaccharides to protein side chains.\n— —\nWe can find some more degraded material with respect the original material.\n— —.\nThen we have to control the right areas of the ancient linen sheet …\n\n","date":"August 27, 2012 at 8:48 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-15501","author":"Piero","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"In my idea there is an interesting argument to develop : the high atomic resolution and the control about the cellulosic chains and the different kind of molecules into the linen fibrils (that are mainly composed by Cellulose).\nI believe there is an interesting indication in the study :\nProspects for Resolving Chemical Structure by Atomic Force Microscopy: A First-Principles Study\nby\nChun-Sheng Guo, Michel A. Van Hove, Rui-Qin Zhang, and Christian Minot\nPlease, read the abstract, under the address :\nhttp://pubs.acs.org/doi/abs/10.1021/la101317s\nUsing a metal tip (of the AFM) terminated in a CO molecule, the authors could image the internal bonding arrangement of a pentacene molecule with remarkable spatial resolution.\nThe findings indicated that further application of that approach requires, for each sample, the careful selection of a suitable “imaging” molecule as tip termination.\nThe name for the adequate system to investigate the material is the CFM (= Chemical Force Microscopy).\nSee, for example, the study :\nChemical force microscopy of cellulosic fibers [Carbohydrate Polymers 62 (2005) 369–378],\nunder the address :\nhttp://biomaterials.forestry.ubc.ca/publications/Carbohydrate%20Polymers%202005.pdf\nReading the inherent abstract you can see that :\n>Atomic force microscopy with chemically modified cantilever tips (chemical force microscopy) was used to study the pull-off forces (adhesion forces) on cellulose model surfaces and bleached softwood kraft pulp fibers in aqueous media. It was found that for the –COOH terminated tips, he adhesion forces are dependent on pH, whereas for the -CH3 (= methyl group) and –OH terminated tips adhesion is not strongly affected by pH. …\nSo (in my opinion), you have to try to work using the AFM-CFM apparels in order to improve the knowledges and also to  discover the material truth, instead to write the heterogeneous things. … sorry.\nFollowing these SPMs (= Scanning Probe Microscopies) systems of control You can also discover something about the presumed BIF (Body Image Formation) and the presence or absence of radiations in the true BIF mechanisms.\nAm I wrong ?\nWhy ?\n— — —\nRegards\n\n","date":"August 28, 2012 at 11:33 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-15539","author":"Piero Iacazio","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"In my boring monologue I want also to add that you can work using the AFM technique in order to obtain the values about the Young’s Modulus for the fibrils.\nFor instance, read the words about the possible system to work (the Three-Points Bending Test), under :\nhttp://www.tappi.org/content/events/08nano/papers/08nan22.pdf\n        = Fibril deflection determination (fibril lay on wafer, etc.)\n2008 International Conference on Nanotechnology for the Forest Product Industry, St. Louis, MISSOURI (USA), June 2008.\nIt was the study by Siqun Wang, Qingzheng Cheng.\nSo, You can apply the Structural Mechanics (B.T.W. : Prof. A. Carpinteri [Turin Polytechnic] is an expert in the field of the Building Science and he is an italian authority in the field of Metrology) in a positive manner instead to destroy the material (working above the right level of vibrations on ancient linen fibrils) or to speak about the presumed effect (on the BIF) from the piezonuclear neutrons … without the inherent adequate experiments on linen fibrils (apart the particular proofs obtained by De Liso).\nRegards\n\n","date":"August 28, 2012 at 12:12 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-15541","author":"Piero","site":"shroudstory"},{"title":"Giulio Fanti Responds. Are you listening Yannick and Colin?","post":"\nYannick Clément :Precision : When I say that “I don’t think anyone has the right to categorically (without any doubt) state that “diffusion (alone) COULD NOT HAVE CREATED THE IMAGE”, it is simply because science has not yet evaluate completely and correctly this hypothesis of Rogers IN EVERY POSSIBLE CONDITIONS REGARDING A 1st CENTURY BURIAL OF A TORTURED AND CRUCIFIED JEW. So, from a strict scientific point of view, no one can be as sure as Ron seems to be that this hypothesis alone could not have created the image.” I’m sorry but thinking that way is not correct scientifically, simply because it is mainly speculative (and also very premature versus the lack of experimentations done to test that hypothesis).\nSorry for the late post here, hope you see this;\nYannick, if you don’t believe me that Ray Rogers himself said “the maillard reaction ‘by itself’ was not the solution, that something else was going on” …please ask our friend Barrie Schwortz. He just happened to mention this ‘specifically’ in his interview on the Dr John radio show, which Dan posted a link to recently.\nR\n\n","date":"September 3, 2012 at 11:31 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","id":"comment-15820","author":"Ron","site":"shroudstory"}]
