[{"title":"Google, McCrone and my Dog","post":"Dan, I hear dogs love this book! I gave my copy to the dog and he tore it to shreds and had great fun doing it.  He seemed to be ready for another and went straight for Inquest on The Shroud of Turin by Joe Nickell.  Amazing!\n\n","date":"August 22, 2013 at 9:37 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41755","author":"Russ Breault","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Don’t you all have too much money for such wastepapers?\n\n","date":"August 22, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41768","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"\nRuss Breault :\nDan, I hear dogs love this book! I gave my copy to the dog and he tore it to shreds and had great fun doing it.  He seemed to be ready for another and went straight for Inquest on The Shroud of Turin by Joe Nickell.  Amazing!\n\nCan I have video? ;-) Put it on You Tube!\n\n","date":"August 22, 2013 at 3:40 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41770","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"While I love reading about The Shroud of Christ, reading the jest about feeding books about the Shroud to one’s dog is another subject.  In poor taste I would say.  But then, that is my opinion.\n\n","date":"August 22, 2013 at 4:03 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41771","author":"Emmett McMahon","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Check out the conclusions of McCrone & Nickell, and you’ll discover why it’s not such a bad idea!\n\n","date":"August 22, 2013 at 4:19 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41772","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"We got to give one credit to McCrone:  According to Ray Rogers, McCrone was the very first researcher to report having discovered traces of starch on linen fibers from the Shroud.\nThis is far from being a banal discovery.  Rogers himself was able to scientifically confirm the presence of this starch on the Shroud, which help to understand that it is a cloth that was most probably made with an antique technique of manufacturing linen cloths and also, this can help to support Rogers hypothesis about the chromophore of the image, which would be located ONLY in a thin layer of carbohydrate impurities. And if it is really the case, then we could absolutely forget once and for all every pseudo-scientific hypothesis involving some kind of energetic radiation.\nHere’s again the most important quote of Rogers on this subject: “I studied the chemical kinetics of the impurity materials and conclude that it was improbable that the impurities had been scorched by heat or any radiation source : the crystal structure of the flax image fibers was no more defective than non-image fibers. It would take very good temperature control specifically to scorch impurities without producing some defects in the cellulose.”\nWith this statement (which can be found in a paper published by Manny Carreira), Rogers made it very clear that it is almost impossible (we can guess something near absolute zero in probability) to ONLY colored a layer of impurities so thin on-top of a linen fiber without causing evident defects in the structure of the linen fiber itself…  Evident defects that are simply not present on the surface of colored fibers, if we believe Rogers expertise.\nSo, like it or not, I hope you can now understand that McCrone truly made an important contribution to our knowledge about the Shroud of Turin.  Makes me say this to conclude: I will be 40 years old next week and I have live long enough to know now that, in life, it is NEVER all white and NEVER all black.  It’s always somewhere in between!\n\n","date":"August 22, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41773","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"For my dog it has been a challenge to chew on the ebook edition of McCrone’s book without ruining my Kindle device.\n\n","date":"August 22, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41774","author":"Dan","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Just a personal reflection:  Imagine if McCrone would have done the same kind of highly questionable and speculative conclusions concerning the Shroud but in a positive way toward authenticity…  I’m sure he would have been elevate at the rank of semi-God by a lot of pro-Shroud folks!  This is exactly what happened for Ian Wilson, so I don’t think it would have been very different for McCrone if he would have produced the same highly questionable set of conclusions versus the Shroud he produced but with a pro-authenticity tone instead of the anti-authenticity tone he really had…\nSome pro-Shroud folks should really meditate on this.  Moral of this reflection: It’s not because you come to a pro-Shroud conclusion versus one particular aspect of the relic that such a conclusion is correct and scientifically sound.  And the opposite can also be true in some cases (especially in the historical field of research), even though I don’t think there really is one solid and unquestionable scientific conclusion that exist which can truly discredit the idea that the Shroud is the authentic burial cloth of Jesus.\n\n","date":"August 23, 2013 at 4:18 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41837","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Sadly, there are some Shroud researchers who are more interested in making a name for themselves than actually trying to find out the truth about the Shroud.\n\n","date":"August 23, 2013 at 8:52 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41845","author":"Joe Marino","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"AMEN.  There are even people like this on this blog…\n\n","date":"August 25, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41967","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I guess I will have to get a dog first to see how he tore this waste to pieces :-))))\n\n","date":"August 23, 2013 at 11:21 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41851","author":"jesterof","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"De mortuis nil nisi bonum. Surely everybody commenting on the image in this blog already has a well-thumbed copy of this book, or their criticism of McCrone’s findings cannot be as well-founded as they should be. It is the only good photographic study of the shroud fibres, and there is no doubt at all, for example, that the little red blobs he identifies as iron oxide look exactly like little red blobs of iron oxide.\nWe look back on his work through a cloud of frustration, antagonism and bitterness which prevents us from seeing the enthusiastic – and pro-authenticity – researcher of 1974, when McCrone was first involved. It is clear from his letters (at holyshroudguild.org) that he was desperately sorry to conclude that the shroud was a fake, and waited over a year before he revealed his findings. Sadly personality differences rather than scientific ones immediately kicked in, and no collaborative discussion between, say, McCrone and Adler, which might have resulted in compromise, ever took place. I don’t excuse him from responsibility for this – his dismissal of Adler’s results was arrogant and his successive resignations from Sturp were petulant – but it may have been possible to work around him with more diplomacy on Sturp’s part, which could have prevented the years of inconclusive disagreement which eventually ensued. Even with things as they are, we should be grateful to him and all his subsequent following (Joe Nickell, for example), as without their continuous irritation it is extremely doubtful that as much subsequent research into the shroud would ever have taken place. RIP.\n\n","date":"August 24, 2013 at 4:00 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41863","author":"Hugh Farey","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"\nYannick Clément :\n This is exactly what happened for Ian Wilson, .\n\nYannick, If I May ask you, what did Ian Wilson to you, so you hate him so much?\n\n","date":"August 24, 2013 at 5:51 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41872","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Conscienciously or not (most probably conscienciously), this guy “forgot” a lot of problematic historical and artistic FACTS (not hypotheses, but facts) in order to keep on selling his very weak hypothesis about the Mandylion and the Shroud.  Such a bad manner to perform historical research have contributed a lot to discredit Shroud research (including the few serious Shroud researchers out there) in the face of the scientific community, who, because of Wilson and many others, see sindonology as a big joke.\nRemember that Wilson is not a professional historian.  In fact, he’s a popular book writer who made a living on the back of the credulity of many people interested by the Shroud who are not aware of the real historical and artistic facts about the Mandylion and the Shroud.\nThat’s why I “hate” this guy so much (even though “hate” is a word a bit too strong because I don’t wake up at night with some bad feelings against him).  In fact, I just can’t stand people (Wilson is just one of the most easy to detect) who are obviously dishonest about the Shroud while trying constantly to persuade everybody that they are not.  And here’s a good way to detect such people (who completely polluted the Shroud world since the STURP days) is the fact that they all end up publishing popular books about the Shroud in order to make money while building “exciting” things around the relic…\nYou can believe what you want :  I know for sure that Wilson is doing bad science (note: historical research is a real branch of science) and he is hurting Shroud science a lot…\n\n","date":"August 25, 2013 at 5:04 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41969","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"It is not a case of liking or hating Ian Wilson. Yannick has shown in detail on this site why his thesis does not hold up in historical terms and I endorse Yannick’s findings. The real tragedy is that Wilson has diverted attention away from other leads. Did you know, for instance, that we have important early medieval relic collections at Sens, 90 kilometres from Lirey, and Chelles, 185 kilometres from Lirey. 31 relics of the collection that remain at Sens and whose dates of arrival are dated to between AD 600 and 1000 are tagged as coming from the Holy Land. Three of the eighth century relics still in the collection are said to be from the ‘Lord’s Tomb’ in Jerusalem. Chelles has five relics whose arrival is dated between 700 and 800 that are tagged as coming from the Holy Land including ‘a stone from Calvary’.  These are detailed in Michael McCormick\\s study ‘The Origins of the European Economy’, Cambridge UP 2001. McCormick was trying to find evidence of trade between Europe and the Holy Land and he realised that relics provided relevant material. However, Shroud researchers should be following up these leads. They may lead nowhere but they certainly cannot be ruled out if one is trying to find out the possible routes an early relic might have reached northern France.\nThen what about the sudarium and shroud reported to have been taken by the prince -bishop of Halberstadt, Conrad of Krosigk, from Constantinople in 1204? Instead of going on about the Knights Templar when he has absolutely no evidence that they ever had the Shroud, why did Wilson not follow up this lead- and why has no one else (so far as I know)?  It is documented in Michael Angold’s The Fourth Crusade.  Was it the one from the Blachernae Church?\nI, and Yannick, and perhaps others ,cannot possibly understand why anyone supports Wilson when his history is so inadequate and there are so many potentially more fruitful lines of research that have been ignored.\n\n","date":"August 24, 2013 at 1:59 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41899","author":"Charles Freeman","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Charles, first, Yannick, with respect, has shown nothing that disproves Wilson’s hypothesis.\nSecond: Wilson’s reconstuction, is just only a HYPOTHESIS, and he (Wilson) always claimed so, as far as I know. Most probable IMHO, but it doesn’t mean that I uncritically accept it at all points.\nThird: Yes there are many possible tracks. The problem with Shroud history up to 1350 is not lack of recrods, the real problem is that there are TOO MANY records, that allows for multiple tracks, how the Shroud possibly came from Jerusalem circa 30 AD to Lirey circa 1350. For example, my own book written in Polish by medical doctor Stanisław Waliszewski, assumes recontstruction based Pietro Savio’s 1957 work, which in my opinion is too archaic for now. It says that the Mandylion was distinct from Shroud, which was the Arculf’s shroud from 670. \nFourth: There are definetly many other interesting relics. What is regrettable, they are very often absolutely forgotten in English speaking world. For example Tunic of Argenteuil, it was already shown in 1934 (and once again by Marion in 1997) that blood (type AB!) marks on the back of the Tunic match the wounds of the Man of the Shroud. But who in the English world has ever heard about that? I live in catholic Poland, and in recent years, there were several books about other Christ’s relics than Shroud and Sudarium, and connections between them. \n  But why to accuse Wilson that he “diverted attention from other leads”? Every track is competing with others. But in one instance I can agree, in 1991 Wilson in his book Holy Faces, Secret Places destroyed interest in the Manoppello Image in the English-speaking world, despite that he present in his book multiple arguments in favour of its authenticity (which were later presented again by Badde, Gaetta and others). That’s his greatest sin I think.\nFifth: Wilson isn’t perfect, I agrre. No one is. Truly I can’t find a single Shroud researcher without a sin. Everyone committed some errors. But I can’t understand such hostility against Wilson. Why? Because he is famous and well known? Jealousy? I don’t know.\nSixth and the point: As I read Yannick’s posts, it is absolutely obvious to me that he has some obseesion about Wilson. No matter what the topic is, always, Wilson,Wilson, how bad greedy, awful that Wilson is! This is really an obseesion, it needs some kind of therapy, I don’t know. Everything to destroy Wilson and his Mandylion hypothesis. Personal vendetta, no doubt. I ask why? What has Wilson done to you, my dear Yannick, that you hate him so much? Just I would like to know what the problem is.  Besides such attitude is definetly not Christian, my dear Yannick.\n\n","date":"August 24, 2013 at 2:27 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41905","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Quote: “Charles, first, Yannick, with respect, has shown nothing that disproves Wilson’s hypothesis.”\nIf this is true, then can you please read WITH AN OPEN-MIND this paper of mine (https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf) and disprove one by one every single facts that I talked about (which all goes against Wilson’s hypothesis) with solid conter-facts (not just speculations but facts please)…  Note: Since the day I published this paper, I still wait for someone to do that!  Some have challenged some points (mainly with the same speculative arguments used by Wilson, Scavone and others).\nLast comment: It’s so pathetic to see people becoming blind when someone is showing them proofs that contradict their preconceive notions about something that it makes me sick.\n\n","date":"August 25, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41973","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Quote: “Wilson isn’t perfect, I agrre. No one is.”\nReply:  The real question here is not being perfect or not but this one:  Is this guy’s honnest or not?  That’s the main point.  Is he doing Shroud research to learn truth about the relic or to try to prove his own preconcieve ideas about it while making money out of it?\nIn the case of Wilson, I think asking the question is already having the answer!  You only have to do some researches about his Mandylion hypothesis WITH NO PRO-WILSON PRECONCIEVE NOTION to know this…\n\n","date":"August 25, 2013 at 6:01 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41975","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Quote: “What has Wilson done to you, my dear Yannick, that you hate him so much?”\nJust read my previous post (https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/#comment-41969) and you’ll understand why I hate that guy so much…\nThe main reason is this:  Because he’s destroying the credibility of sindonology for much too long with help of a Pro-Shroud clique that is buying blindly every one of his fancy, while helping him to sell it to a credulous public who will certainly lost time like I did to investigate with serious and honesty the topic.\nI hope history will end up one day considering that guy as one of the worst Shroud researcher of all time; one who maybe did the biggest damage to the credibility of Shroud science versus the scientific community…\n\n","date":"August 25, 2013 at 6:07 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41976","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Quote: “Besides such attitude is definetly not Christian, my dear Yannick.”\nReply: “It’s funny to see how religious people are always fast at pointing the finger at others while telling them “your action is not christian!  You are making a sin!  Etc, etc.”  I’ve had the opportunity to notice that a lot of time in my life and, almost always, those who are acting like this (i.e. playing God) are very religious man.  It’s impressive to note this.\nAll I can say to you is asking you to go reading again the Gospel of Matthew, chapter 7, verses 3-5.\n\n","date":"August 25, 2013 at 6:10 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41977","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Sorry, I need to write again part of my comment #19 :  \n“The main reason is this: Because he’s destroying the credibility of sindonology for much too long with help of a Pro-Shroud clique that is buying blindly every one of his fancy, while helping him to sell it to a credulous public who will certainly NOT LOSE time like I did to investigate with serious and honesty the topic.”\nNow it’s better.\n\n","date":"August 25, 2013 at 6:13 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41979","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Charles Freeman wrote: “Then what about the sudarium and shroud reported to have been taken by the prince -bishop of Halberstadt, Conrad of Krosigk, from Constantinople in 1204?” What about them? Can you cite the text you are referring to and the reference? My guess is that you are referring to “Gesta Episcoporum Halberstadensium” where pieces of the Shroud (and a sudarium) are said to have been brought back from the Holy Land in 1205 by Conrad of Krosigk. But this is a far cry from a shroud.\n\n","date":"August 25, 2013 at 3:07 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41937","author":"Mario Latendresse","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Fine. Angold mentions just ‘the shroud and the sudarium’ so he is misquoting.We still have yet another report of a cloth, or fragments of one, purporting to be the authentic burial shroud of Christ.\nMy point remains. Among mainstream historians, Wilson’s hypothesis, call it what you will, has little or no standing, but it does appear to have diverted attention away from other early medieval relics in northern France that had direct links with Jerusalem and even with Christ’s tomb. I leave it to others for whom the Shroud is a central part of their lives to follow up these interesting possibilities.\n\n","date":"August 25, 2013 at 1:44 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41956","author":"Charles Freeman","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"There are some excellent points in many of the comments above.  Despite some of Wilson’s faulty research, I believe he has done more than most others to RAISE AN AWARENESS OF THE SHROUD within the English speaking world.  In 1960, I attended a presentation given by our Domincan university chaplain to students at our Engineering School hostel.  This was my first real exposure to some of the forensic aspects of the Shroud, and I guess that much of it was probably based on the work of Pierre Barbet and other early pioneers.  At the time, I mentally filed it away and thought little more about it.  However until I encountered Ian Wilson’s 1978 book on the Shroud, I had never heard of Yves Delage, Paul Vignon, Max Frei’s pollen sampling, the historical aspects involving the De Charnay family, the challenge of the D’Arcis memorandum, and I was ignorant of the Crusaders’ sacking of Constantinople in 1204. I had certainly never heard of the Image of Edessa, and the legends concerning Abgar the Great. I was unaware of the detailed work carried out by the STURP team.  A significant contribution that Wilson himself made at this time was to publicise the many similarities to the Shroud facial image of post-6th century icons, coinage images, and the emergence of the Shroud-like Lamentation scenes such as those in the Pray manuscript. The English-speaking world was largely unaware of many of these aspects, but Wilson’s highly publicised work, which also emerged in paper-back, rectified this large-scale ignorance. Certainly there was an elite that knew a great deal more, but it seems only to have been confined to the enthusuastic few “in the know”. \nClearly, from Charles’ and O.K’s comments above there is a great deal more yet to come to public attention among us Anglophones, such as the various relics mentioned above.  They are certain to remain unknown until such time as another Wilson arises to take the same time, patience, labour and effort to bring them to a more common acquaintance. The world is much larger than the regrettably mutually unknown and diverse mother tongues confined to local pockets in Old Europe, and yet the various forms of English are now the most universal and common means of language communication in the Western World, and so these important aspects will continue to remain largely unfamiliar and unrecognised.\n\n","date":"August 24, 2013 at 5:32 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41911","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Just on this…\nDoes anyone know anything about the text in the Hungarian Pray Manuscript? We all know the much analysed drawings, how about the text? Might the text provide some context o the pictures? Or are the pictures elements somehow isolated from the text? Would seem unliekly to me. Maybe the text refers to the shroud?\nAnyone out there can shed some light on this?\n\n","date":"August 25, 2013 at 4:44 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41938","author":"Matthias","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Extract from Wiki:\n“The Codex Pray, Pray Codex or The Hungarian Pray Manuscript is a collection of medieval manuscripts. In 1813 it was named after György Pray, who discovered it in 1770. It is the first known example of continuous prose text in Hungarian. The Codex is kept in the National Széchényi Library of Budapest.”\n“One of the most prominent documents within the Codex (f.154a) is the Funeral Sermon and Prayer (Hungarian: Halotti beszéd és könyörgés). It is an old handwritten Hungarian text dating to 1192-1195. Its importance of the Funeral Sermon comes from that it is the oldest surviving Hungarian, and Uralic, text.”\n“The Codex also features a missal, an Easter mystery play, songs with musical notation, laws from the time of Coloman of Hungary and the annals, which list the Hungarian kings.”\nYou’ll need to research further for any more detailed info.\nBriefly, Hungary came into existence in the late 9th century, when Finno-Ugaritic Magyars occupied the middle basin of the Danube. The structure was essentially tribal governed by various warring princes. with raids across Europe. Both the Eastern and Western churches strove to draw them into their orbit. Their raiding efforts suffered severe reverses under the German king Otto I in 955, and the Magyars began to be influenced by Christianity. Embassies were sent to Holy Roman Eemperor Otto II, and in 975 Magyar leaders were received into the Western Church. Stephen I applied to Pope Sylvester II for royal insignia, and according to tradition was crowned king on Christmas Day 1000. This was yet another one of the marvellous achievements of the Ottonians and Pope Sylvester II. \nI would surmise that the Pray Manuscript was intended as some kind of handbook for use in meditation and worship in the Hungarian language. Its date of 1192-95 places it some nearly 200 years after the coronation of Stephen I, when it would seem that Christianity would by that time be well-established. Its composite form might suggest a setting down in print of diverse oral worship practices that had developed over that period. Its primary interest in Shroud forums lies in its striking graphics which are strongly suggestive of an early acquaintance of the nature of the cloth and its image well before 1204.  Whether the Funeral Sermon, the Easter Mystery Play or the various hymns may suggest more specific allusions would require a detailed study of the translation of their texts. However the original oral texts might well predate the knowledge that gave rise to the Shroud-like graphics. As you may well surmise I am only trying to attempt some intelligent guess-work here.\n\n","date":"August 25, 2013 at 7:56 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41940","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I’ve spent many frustrating hours trying to interpret the text on the pictures we’re so familiar with, with the aid of assorted paleographic websites. I can say that it’s in Latin, not Hungarian, and nothing like the text of the Hungarian funeral oration, which was considered the most important part of the codex before the pictures achieved their prominence.\nLast March we discussed this briefly. I said, “You [that’s Max Hamon] quote M. van Cauwenberghe, in his identification of the music at the bottom of the Christ Enthroned scene with the Easter ‘Exultet’ which even I can see now, and it is clearly in Latin. The writing above is more difficult to decipher, but I think I can make out “et dixit Lazaro veni foras” which is close to the Vulgate version of Jesus’s calling of Lazarus out of his tomb. Above it are “salvatorem mundu” (Should be mundi) and above that a definite “baptista.” Clearly not a single quotation fro the bible, but definitely Latin. There appear to be several more “salvator”s and “veni foras”s elsewhere in the text. Can anybody get any closer?\nAbove the anointing scene it is even more difficult to make out the words. Do they begin: “In principio creavit deus caelum et terram”?”\nSince then I think I can make out the months of October and November on the bottom line.\n\n","date":"August 25, 2013 at 12:24 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41952","author":"Hugh Farey","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"\nMatthias :\nJust on this…\nDoes anyone know anything about the text in the Hungarian Pray Manuscript? We all know the much analysed drawings, how about the text? Might the text provide some context o the pictures? Or are the pictures elements somehow isolated from the text? Would seem unliekly to me. Maybe the text refers to the shroud?\nAnyone out there can shed some light on this?\n\nText in the Pray Manuscript?\nGuys here it is: http://en.wikipedia.org/wiki/Funeral_Sermon_and_Prayer\n\n","date":"August 25, 2013 at 2:06 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41957","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Er… no… See my comment above…\n\n","date":"August 25, 2013 at 2:19 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41958","author":"Hugh Farey","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Not the same?\n\n","date":"August 25, 2013 at 2:24 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41959","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"No. The Pray codex is a collection of all sorts of liturgical stuff, probably from different places and certainly written at different times and in different languages. It’s a pity that only the four crucifixion, deposition and resurrection pictures, together with two pages of text, are available on the internet. For most historians, the most important page of the entire codex is the funeral oration in Hungarian, which is the oldest example of written Hungarian known. The pictures (found most clearly at http://greatshroudofturinfaq.com) are clearly not related to it.\n\n","date":"August 25, 2013 at 5:00 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41968","author":"Hugh Farey","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Hungarian text with English translation of Funeral Sermon & Prayer can be found at:  http://1moment.hu/halotti_beszed.pdf\nEssentially it relates how the Fall of Adam brought death into the world (Genesis 3), with intercessory prayers to the Saints for the deceased. I saw nothing there linking it to the redemptive act of Christ or the Shroud.  Possibly the text of the Mystery Play might be worth pursuing. Following Hugh’s lead it might be that the hymns give only Latin texts of various canticles used in the Western Church liturgy such as a contemporary version of an Easter Exsultet.\n\n","date":"August 25, 2013 at 4:33 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41966","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Thanks Dave. Yes, perhaps the Mystery Play might be more fruitful.\n\n","date":"August 25, 2013 at 11:31 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42029","author":"Matthias","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"It’s hard to think the pictures have no association with text. But potentially they could sit in isolation as a pictorial account of the deposition, burial and resurrection.\nWhat would be “gold” is text along the following lines ” And Jesus was wrapped in the holy shroud which is now kept in Constantinople”. Probably unlikely. But it would be good to somehow get a translation of the Mystery Play to confirm / deny.\n\n","date":"August 25, 2013 at 11:37 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42030","author":"Matthias","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Hugh: There was perhaps a little confusion here. No one has ever examined the Codex with his own eyes, took some high quality pictures? I don’t think the writings should be so hard to read, if take a close look. Anyway someone wrote them to be read.\n\n","date":"August 25, 2013 at 5:51 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41974","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I have to confess that I am fascinated by the codex.\nA thought that has occured to me today.\nAssuming the mandylion and the shroud were two different objects (not Wilson’s theory!), could the empty tomb scene be illustrating the shroud with the mandylion resting on top of it? With the mandylion, the face sized cloth symbolised by the alpha letter (or whatever it is) connecting with the face of Jesus next to Mary’s sleeve?\nAnd the Shroud the long rectangular object below it, symbolised by the diamond shape in its centre (with crosses inside) symbolising Christ’s image through the central part of the shroud, with the two red streaks just to the left of it symbolising the blood on the cloth, and the L shaped arrangement of 4 holes (which atheist De wesselow describes as not making any sense as an artistic feature due to its odd assymetry) just to the right.\nAssuming the mandylion and the shroud were separate objects and both in Constantinople, then it is quite possible that a holy man or party of holy men either travelled there and viewed them, or were told of the relics and their details. Remember Hugnary and Constantinople were very strongly connected in the 12th century.\nThoughts?\n\n","date":"August 26, 2013 at 8:36 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42058","author":"Matthias","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Just so the record is clear:  when I referred to Shroud researchers who are more interested in making a name for themselves than finding out the truth about the Shroud, I was not including Wilson.\n\n","date":"August 25, 2013 at 6:12 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41978","author":"Joe Marino","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Of course.  He’s an intouchable in the Shroud world…\n\n","date":"August 25, 2013 at 6:14 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41980","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Sorry :  untouchable is the English word for the French “intouchable”…\n\n","date":"August 25, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41981","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Amazon runs a number of ads for copies of the Pray Codex, but says it is temporarily out of stock. No indication of when or if it will become available again. Clearly there are copies of it out there somewhere! Anyone?\n\n","date":"August 25, 2013 at 6:22 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41982","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Be careful of the Amazon books. I believe they are nothing more than reprints of Wikipedia articles. As far as I know there are no studies of the whole thing in English. There is a comprehensive description of the Pray Codex at http://www.jstor.org, which is free to look at if you register with jstor; an article entitled ‘Liturgical Manuscripts preserved in Hungarian Libraries,’ in Traditio, Vol.19 (1963).\n\n","date":"August 25, 2013 at 7:37 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42007","author":"Hugh Farey","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"\nYannick Clément :\nQuote: “Charles, first, Yannick, with respect, has shown nothing that disproves Wilson’s hypothesis.”\nIf this is true, then can you please read WITH AN OPEN-MIND this paper of mine (https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf) and disprove one by one every single facts that I talked about (which all goes against Wilson’s hypothesis) with solid conter-facts (not just speculations but facts please)…  Note: Since the day I published this paper, I still wait for someone to do that!  Some have challenged some points (mainly with the same speculative arguments used by Wilson, Scavone and others).\nLast comment: It’s so pathetic to see people becoming blind when someone is showing them proofs that contradict their preconceive notions about something that it makes me sick.\n\nYes Yannick. I have read your paper. And I am preparing to refute it, point by point. In my opinion, no point is a deadly threat to Wilson.Several are simply the same argument, repeated again and again. With screamings: “If Wilson’s hypothesis is correct, WHY is this so ???” Most if not all of them, have already been answered in Wilson boks, just to read them again. I don’t have to give absolute proofs WHY this is so. Just plausible explanations, that keep the Wilson’s hypothesis still on the surface.\nRemember: lack of proof for one thesis, DOES NOT PROVE THE OPPOSITE THESIS. And as I said, Wilson’s theory is just theory. With some modifications, the one that makes most sense in my opinion. Of course you can disagree.\nI am from Poland, and I have written several articles about the Shroud for one of the Polish apologetics portal. You can see them here, Google translates them quite faithully into English:\nhttp://ok.apologetyka.info/\nI have even gave a link to your article in one of the footnotes. When I come to write an article about the early histry of the Shroud (so far I end it at around 1200 in Constntinople), I will definetly mention and discuss your points.\nAnd as to Wilson, I will add one thing. Yannick, you wrote:”Remember that Wilson is not a professional historian.”\nI would say (forgeting for a moment that the guy graduated from Oxford): FORTUNATELY!\nYou know why? Because from my experience, if I can be honest, most of the professional historians, historians of art, and especially biblical historians, are ignorant, blind, close-minded, and most importantely conformist IDIOTS (of course there are some noble exeptions). That simply follow the tide, no one can move forward with brave, fresh ideas, that goes against the highly authorative society, who made their names by kissing the three letters of their predecessors. It concerns not just the Shroud, but many other issues also.\n You wrote: “Such a bad manner to perform historical research have contributed a lot to discredit Shroud research (including the few serious Shroud researchers out there) in the face of the scientific community, who, because of Wilson and many others, see sindonology as a big joke.” I want to tell you what I see as obvious truth: for most of the so-called “scientific community”, we, the guys who are interested in Shroud research, we are simply pseudoscientic maniacs, of the same sort like those who search for UFO, Yeti or Atlantis. That is true, and that is why the Shroud is considered to be on margin of “serious scholarship”. Despite that usually the level of knowledge of those “serious scholars” about the Shroud is absolutely NULL. Why? Because the Shroud research is politically incorrect. It can shake the basis of our society. And if, for example, Wilson’s hypothesis one day is proven correct, this would be absolutely Copernican Revolution in Byzantine History, and Byzantine Art. That is why the concrete is obviously against it. They would lost their authority and their works, their papers would be nothing more than a trash.\nThat’s I think, everything I have to say in this discussion. At least so far.\n\n","date":"August 25, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41983","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"You wrote: “And as I said, Wilson’s theory is just theory.”  Right here, I just want to remind you that considering Wilson’s weak HYPOTHESIS as a theory is truly a showing a lack of rigor in your analysis.\nEven though I agree that Wilson’s weak hypothesis as been consider as an almost proven and well-recognized scientific theory, the truth is that it is VERY FAR from being the case.  As Mr. Freeman said in one comment : “Among mainstream historians, Wilson’s hypothesis, call it what you will, has little or no standing.”\nBy the way, I would like you to also refute the very interesting two parts paper that was published by Davor Aslanovski in 2012.  Here’s the 2 links: 1- http://deumvidere.blogspot.com/2012/06/image-of-edessa-and-turin-shroud-part.html?m=0\n2- http://deumvidere.blogspot.com/2012/06/image-of-edessa-and-turin-shroud-part_22.html?m=0\nAnd I suggest you to also do the same thing with Mr. Freeman’s own papers that seriously challenge Wilson’s hypothesis (not a theory)…\nNote that by doing my own independent research, I have come to mostly the same conclusions than these two researchers, which speaks very loud to me.  Honestly, I wrote my own paper completely independent of these persons, while knowing nothing about them or the kind of researches they were making at the time I wrote my own article!  \nHow do you explain that we all end up (among many other researchers, most of them being profesionnal historian unlike myself) to the very same conclusion???  Do you think we’re all into a vendetta against Wilson???  NO.  The answer is that we’re OPEN-MINDED on the subject.\nLast thing:  I truly don’t understand (and Mr. Freeman agree with me on this) why many pro-shroud people seem to be affraid to face the possibility that Wilson’s whole ideas about the Shroud’s ancient history can be wrong, while there are certainly other possible avenues to explain the dead silence that seem to envelop the Shroud’s ancient past…  In other words, pro-shroud people should, once and for all, understand that even if Wilson’s hypothesis (not a theory) is proven wrong, that doesn’t absolutely mean that the Shroud itself is not the authentic burial cloth of Jesus Christ…  One conclusion do not necessarily lead to the other one but it seems to me that many people are constantly linking them together, which is ludicrous from a purely scientific point of view.  THERE CAN BE ANOTHER EXPLANATION FOR THE DEAD SILENCE OF ANCIENT MANUSCRIPT VERSUS A BURIAL SHROUD OF CHRIST THAT WOULD HAVE BEARS HIS BODY IMAGE AND HIS STIGMATA…\n\n","date":"August 25, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41987","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Just a complement about one thing I said in the previous comment:  I wrote: “The answer is that we’re OPEN-MINDED on the subject.”  I should have said this instead: “The answer is that we’re OPEN-MINDED AND HONEST about this subject and we have no fear to discover, throughout a long research, that Wilson’s ideas can truly be wrong after all.”   \nNow that’s better.\n\n","date":"August 25, 2013 at 7:02 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41994","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Once again, things have completely going off-track here…  My main point was not at all directed toward Wilson’s dishonest antics but versus the fact that if McCrone would have been on the pro-Shroud side, he would have been considered as a semi-God by the same person who, on this blog right now, are trying at all cost to defend their own semi-God Ian Wilson…  It’s interesting to see this.  It’s obvious to me that, for a fringe of the pro-Shroud community, no matter how serious and credible the hypothesis and conclusion of one person can be, as long as it is pro-authenticity, that’s good!!!  Makes me sick.\n\n","date":"August 25, 2013 at 6:34 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41984","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"No, Yannick, I don’t want to defend Wilson at all cost. And he is not semi-god for me. He has a high authority in Shroud world, I agree, but it doesn’t mean he didn’t make any mistake. He made several. In fact, there is no Shroud scholar with whom I agree 100 %. And bad pro-authenticity argument, is a good anti-authenticity argument. There are many half-baked ideas for both pro-authenticity and anti-authenticity. Just want to make my own honest judgment. I don’t want to decieve myself, nor anyone else. That’s all, I am going sleep, good night everyone. Best wishes Yannick!\n\n","date":"August 25, 2013 at 6:40 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41986","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I hope you think like this my friend…  Please stay open-minded.  That’s all I’m asking you.  Then, with this in hands, go looking at the FACTS for yourself, like I did myself.  If you do that, I’m truly confident you will end up like me saying that Wilson’s hypothesis simply CANNOT be able to explain the Shroud’s ancient history prior to its probable disappearance from Constantinople in 1204.\n\n","date":"August 25, 2013 at 6:51 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41989","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I’ll write again the first line of my previous comment: I’m glad you think like this my friend…  Now that’s better.\n\n","date":"August 25, 2013 at 6:52 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41990","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I wrote:  “Just so the record is clear: when I referred to Shroud researchers who are more interested in making a name for themselves than finding out the truth about the Shroud, I was not including Wilson.”\nYannick wrote:  “Of course. He’s an intouchable in the Shroud world…\nYannick, I find your comment offensive.  By impugning my statement and not even allowing me the freedom to just express an honest opinion, you are apparently showing that you feel that everyone should simply agree with you.  You are not going to win many converts with your M.O.\n\n","date":"August 25, 2013 at 7:09 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41996","author":"jmarino240","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I’m just tired to see every one involved in Shroud research constantly taking their distance with any criticism made against Wilson’s ideas and antics, just like he is the most sacred cow in all the Shroud world, while there are very good reason to highly suspect he’s truly dishonest in many aspect of his Shroud research…\nIf my comment offended you, I’m sorry but I just can’t shut up about that.  It’s very frustrating to see that, amongst Shroud researchers, there truly seem to be a kind of immunity that prevent any of them to criticize the bad antics of a “colleague”.\n\n","date":"August 25, 2013 at 7:19 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41999","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Here’s my previous comment, better written this time: “I’m just tired to see every one involved in Shroud research constantly taking their distance with any criticism made against Wilson’s ideas and antics, just like he is the most sacred cow in all the Shroud world, while there are very good REASONS to highly suspect he’s truly dishonest in many aspect of his Shroud research…\nIf my comment offended you, I’m sorry but I just can’t shut up about that. It’s very frustrating to see that, AMONG Shroud researchers, there truly seem to be a kind of immunity that prevent any of them to criticize the bad antics of a “colleague” EVEN IF THERE ARE VERY GOOD REASONS TO DO SO.”\n\n","date":"August 25, 2013 at 7:26 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42003","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Just a comparative image for you Joe:  To me, Wilson is truly the Dan Brown of Sindonology.  And I’m sure many people in the Shroud world secretly thinks the same.  \nBut why I never see any of them coming publicly to take his distance (like I do) with such a writer (not even a profesionnal historian) who got more imagination than anything else about the Shroud and who is truly discrediting sindonogy in the eyes of the scientific community by inventing a lot of ludicrous “theories” about the Shroud?\nI don’t understand why those from inside the Shroud research world are acting like they fear this kind of “researcher” who is doing much more damage to sindonology than anything else…\n\n","date":"August 25, 2013 at 7:32 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42005","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Each time I read Yannick asking others to stay open-minded as far as the Edessa Image/Holy Face of the Holy Mandylion/Holy Sindon or any such topic like Yeshua’s burial is concerned, I just cannot help thinking “but when is he to ask himself INDEED?”.\n\n","date":"August 25, 2013 at 7:10 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-41997","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"The proof that I am open-minded about the Shroud Max is this:  I don’t blindly buy any pro-Shroud “theory” (SIC) out there but I only want to learn the truth (whatever it might be) about the fascinating relic, which I still consider as being most probably the authentic burial Shroud of Jesus of Nazareth.\nIf I end up one day discovering enough solid facts to come to a different conclusion, I can ensure you that I will change up my mind.  I’ll say it again:  My faith in a God that is Love and Mercy and nothing else than this doesn’t rest on the authenticity of the Shroud of Turin but mainly on my own personal and spiritual (mystic would even be a better word) EXPERIENCE of God.\n\n","date":"August 25, 2013 at 7:22 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42001","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I should have wrote: “The proof that I am open-minded about the Shroud Max is this: I don’t blindly buy EVERY pro-Shroud “theory” (SIC) out there JUST BECAUSE THEY ARE PRO-AUTHENTICITY but I only want to learn the truth (whatever it might be) about the fascinating relic, which I still consider as being most probably the authentic burial Shroud of Jesus of Nazareth.”\nNow, that’s better.  Truly, I write too fast!!!\n\n","date":"August 25, 2013 at 7:24 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42002","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"To Yannick, \n“Please stay open-minded INDEED. That’s all I’m asking you.”\n\n","date":"August 25, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42004","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I do.  Believe me I do.  Of course, since I’m human, I can’t swear I always acted this way, but I try very hard to remain open-minded about anything that is related to the Shroud.  But, after I have investigate the most important pieces of evidences concerning one topic, if I’m truly convinced one hypothesis is most certainly wrong (Wilson’s Mandylion hypothesis is just one example among many), then I will go publicly to tell my opinion about that (freedom of speech, I think this is one of the greatest right we got in our free world) and defend this opinion until someone credible can prove me wrong with solid arguments and facts.\n\n","date":"August 25, 2013 at 7:37 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42008","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I wrote: “Just so the record is clear: when I referred to Shroud researchers who are more interested in making a name for themselves than finding out the truth about the Shroud, I was not including Wilson.”\nYannick wrote: “Of course. He’s an intouchable in the Shroud world…\nYannick, I find your comment offensive. By impugning my statement and not even allowing me the freedom to just express an honest opinion, you are apparently showing that you feel that everyone should simply agree with you. You are not going to win many converts with your M.O.\nYannick wrote: . . . “If my comment offended you, I’m sorry but I just can’t shut up about that. It’s very frustrating to see that, amongst Shroud researchers, there truly seem to be a kind of immunity that prevent any of them to criticize the bad antics of a “colleague”.\nYannick, you didn’t need to put “if my comment offended you…”  There is no “if.”  I told you directly it did offend me.  In another posting you compared Wilson to Dan Brown.  I will give you an analogy for your “if my comment offended you.”  That’s the sort of wording that politicians and celebrities use when they do something offensive and the heat is so great they have to say something.  They rarely just outright apologize because they can’t be wrong.  Their thoughts & behaviors are the gold standard and everyone else has to conform to them.\n\n","date":"August 25, 2013 at 8:16 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42010","author":"jmarino240","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I don’t feel I need to go down on my knees for having told what I consider the truth.  Of course, you can think something else than me.  The main point is this: your reaction concerning the fact that “and by the way, I was not meaning Wilson” was very telling of the kind of politically correctness that goes on and on and on Inside the pro-Shroud world, where nobody got enough balls to tell the other what he truly believe, especially when this other researcher is acting like Dan Brown…  I don’t blame you personally.  I blame all the pro-Shroud researchers out there because, for the moment, I just saw professional historians, along with some non-experts like me, having enough “balls” to tell the truth regarding someone like Wilson who base most of his ideas on pure spéculations and who constantly left aside many critical facts (which always goes against his ideas) in order to only keep the focus on the portion of the facts that can fit (sometimes with the help of a speculation) with his ideas and hypotheses.  Sorry but true profesionnal historical research should never be done like this and I’m sure there are some people Inside the pro-shroud world that know exactly what I’m talking about but who are affraid (for whatever reasons) to criticise a sacred cow like Ian Wilson…\n\n","date":"August 25, 2013 at 8:28 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42011","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Again, I need to write on sentence again: ” I blame all the pro-Shroud researchers out there because, for the moment, I just saw professional historians (ALL OF THOSE BEING NOT PART OF WHAT I CALL THE PRO-SHROUD CLIQUE), along with some non-experts like me, having enough “balls” to tell the truth regarding someone like Wilson who base most of his ideas on pure spéculations and who constantly left aside many critical facts (which always goes against his ideas) in order to only keep the focus on the portion of the facts that can fit (sometimes with the help of a speculation) with his ideas and hypotheses.\n\n","date":"August 25, 2013 at 8:30 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42013","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Last comment to Joe and I’m going out. I really hope Joe that you will feel better after this one.  Honestly, the purpose of my replies to your comments was NOT to offend you in any way.  That’s the main thing you must understand.  I was just trying to express my feeling about what you said and if I said it in a bad way for you (look it was), then sorry.  Again, the truth is this:  my intention with my replies to you was NOT to offend you at all.  I hope you can believe me on this and I hope we can now start talking about something else more constructive, because I truly don’t want to start a public fight with you…\n\n","date":"August 25, 2013 at 8:58 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42016","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Yannick wrote:  “I don’t feel I need to go down on my knees for having told what I consider the truth. Of course, you can think something else than me. The main point is this: your reaction concerning the fact that “and by the way, I was not meaning Wilson” was very telling of the kind of politically correctness that goes on and on and on Inside the pro-Shroud world…\nExpressing what you consider to be the truth is fine, but I resent you taking a statement of mine, which was simply a clarification, and thus chastise me because I didn’t join with you to criticize Wilson.\nWhat you consider to be the truth = your opinion.  Other people have opinions, too.  If you find someone willing to debate with you, fine.  But don’t just try hitting everyone over the head with your opinion, especially when it wasn’t asked for.\nI assume you will post something in response but I am done.\n\n","date":"August 25, 2013 at 9:01 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42017","author":"jmarino240","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I reiterate my comment at #24:\nDespite some of Wilson’s faulty research, I believe he has done more than most others to RAISE AN AWARENESS OF THE SHROUD within the English speaking world.(etc)…”\nI was 40 years old when Wilson published his book in 1978, and as I discussed in that comment it was a revelation to me.  I realised then that even at age 40, I still had a lot to learn.  I do not need the comments of a paranoid Quebecois cartographer to deny me the reality of that experience and who at that time had still to master his first French reader “Jacques & Jeanne” or whatever. \nOthers may be interested in exploring alternative but connected hypotheses to those of Wilson if they have not already done so. \n– “CHAPTER I. Acheiropoietos Jesus Images in Constantinople: the Documentary Evidence”***Daniel C. Scavone, University of Southern Indiana; http://www.scribd.com/slavisa_jevtic/d/66288478-1    \n– Jack Markwardt’s 1998 paper at Dallas “Antioch and the Shroud”\nhttp://www.shroud.com/pdfs/markward.pdf \n–  Markwardt’s subsequent 2008 paper “ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET”\nhttp://ohioshroudconference.com/papers/p02.pdf \nOf course all of these are hypotheses supported by whatever documentary support and argument that the authors can muster in the light of whatever scarce information can be discovered.  As ideas, they are not dogmatic assertions that need to be shot down in flames, but are to be pondered and compared with whatever other hypotheses may be offered.  That is how human knowledge advances.  Of course professional historians may denigrate the efforts of those not within their ivory-towered coterie – they have nothing better to offer! But when has Academia ever been on the side of the Shroud? Not once since the time of Yves Delage in 1905!\n\n","date":"August 26, 2013 at 5:05 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42044","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Dave:\nHere is a chart from Waliszewski’s book “Całun Turyński dzisiaj”, depicting Savio-Waliszewski history of the Shroud, and how it came from Jerusalem to France:\n\nWaliszewski, following Savio, assumes that the Shroud of Turin is the same shroud, as depicted by Arculf in 670, which had to be kept in Jerusalem. Even if it was in Edessa, he thinks that it had been moved back to Jerusalem by 550, and the Mandylion is a distinct cloth. Waliszewski then claims that the shroud was moved around 1050 to Constantinople, and later, in 1247, brought to France by Philippe de Toucy. He also mentions Conrad of Krosigk, and Nivelon de Cherisy, who brought parts of the burial cloths from Constantinople after the 4th Crusade.\nWhat is very often overlooked, is possibility that there may have been MORE than two burial cloths in the Jesus’ tomb,not just the Shroud (of Turin) and Sudarium (of Oviedo). There could be several other cloths, perhaps even TWO burial shrouds (sometimes people were buried with two, or more).\nSavio-Waliszewki theory may be used as an alternative to the Wilson’s, but I give more credibility to the latter (with several modifications). Yannick, of course, you can have a different opinion. I think the Shroud history may be much more complex than anyone (including Wilson, Savio, Yannick, Charles, Dave and me) imagined.\nAs I said the problem with Shroud prehistory is not that there are no records, but that there are too many records. It may be misleading, forces us to reject some of them. Of course, what to reject is a personal decision of a scholar (no matter if his name is Wilson, or any other), and thus it can always be challenged.\n\n","date":"August 26, 2013 at 6:10 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42045","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"The reason why so many people ( outside the community of his fans) distrust Wilson is that any further research on his hypothesis often shows that he has been misleading. I don’t know how to put images on this blog and perhaps Dan can follow this up.\nTake Wilson’s The Shroud: Fresh Light on the 2000 year-old Mystery, 2010. Turn to page 28 where at the bottom of the page is a picture that Wilson has given a caption to as follows:\n‘How the theoretical body was laid in the Shroud. Reconstruction after a painting by the seventeenth-century artist G.B. della Rovere’.\nNote that the painting itself is not illustrated but if you bring it up on a search engine you will find that Wilson has reproduced something completely different.\nDella Rovere showed the elbows of Christ bent and the right hand over the left. Wilson shows the arms straight and the left hand over the right!\nDella Rovers shows the legs straight down on the ground, Wilson has them bent upwards. This means that the soles of Wilson’s feet are almost full on the ground while Della Rovere’s are at a higher angle.\nDella Rover, following the conventions of the day, has put on a loin cloth. Wilson leaves it off.\nNow Wilson could simply have said that he was putting a theoretical reconstruction of the burial but it was HIS choice to say that it was ‘after della Rovere’ when it is most certainly isn’t.\nCan any of Wilson’s fans explain why?\nI can only say that for myself I never accept anything that Wilson says without checking further.\n I am sure that Yannick and I have different approaches to other issues but I can see why he gets so frustrated when no one seems prepared to criticise Wilson. To go back to my original point, by slavishly following Wilson, many other areas of research that provide DIRECT links between relics from Jerusalem and northern France have been ignored.\n\n","date":"August 26, 2013 at 7:10 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42051","author":"Charles Freeman","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Charles:”Can any of Wilson’s fans explain why?”\nThis is the red herring. I can find several similar tiny and unimprotant errors in any book about the Shroud.\n“I can only say that for myself I never accept anything that Wilson says without checking further.” \nMe too. But this concerns not only Wilson’s work, but any sources about the Shroud. Double, or even triple check is always recommended. \nThis has nothing or very little to do with Wilson’s credibility. Charles those are just flawed statements of you, put forward as an attempt to discredit Wilson. In other words: propaganda directed at Wilson, to destroy his name. Eristic arguments, very often used why an opinion of X is wrong.\n\n","date":"August 26, 2013 at 7:55 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42056","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I am sorry, O.K. I do not take your point. You can access my Holy Bones, Holy Dust, How Relics Shaped the History of Medieval Europe, Yale UP, 2011 (reviews on the Yale US website) and see that I have done a great deal of serious research on many medieval cults and used a large number of sources, original and later. I am looking for credible evidence- and there are many scholars who provide this. I simply disregard authors such as Wilson who are not credible. I am simply warning people off him but iI can live with it if you don’t want to listen. \nWilson must have known that his depiction of the della Rovere painting had nothing to do with what della Rovere actually painted, so it is not a ‘tiny and unimportant error’ of the type that all of us make -it was some form of conscious decision which, whatever Wilson intended, is misleading to anyone who is doing serious research. I repeat : I know why Yannick gets frustrated.\nPlease provide, with illustrations, proofs of my ‘flawed statements’. Perhaps we are talking of a different della Rovere painting.\n\n","date":"August 26, 2013 at 10:32 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42067","author":"Charles Freeman","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Well there are plenty of ‘shroudies’ – like me – who do not accept uncritically everything Wilson has said on the shroud. In fact there are some things I outright disagree with. Notwithstanding this, he has made some great findings over the years which are credible.\n\n","date":"August 26, 2013 at 7:52 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42055","author":"Matthias","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Which ones Matthias?\n\n","date":"August 27, 2013 at 4:26 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42149","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Charles: You mean this picture: http://pl.wikipedia.org/wiki/Plik:OntstaanLijkwade_GiovanniBattista.png\nor this?\n\nBecause there are different version of whether the first one was painted by G.B.della Rovera or by Giulio Clovio, and whether the second was painted by della Rovera or by Gaspard Baldouino. (Truly, I still can’t decide whether to buy the newst Wilson’s book in original, or wait for possible Polish edition). Anyway, it is not important. Just as writing that: \n“Della Rovere showed the elbows of Christ bent and the right hand over the left. Wilson shows the arms straight and the left hand over the right!\nDella Rovers shows the legs straight down on the ground, Wilson has them bent upwards. This means that the soles of Wilson’s feet are almost full on the ground while Della Rovere’s are at a higher angle.Della Rover, following the conventions of the day, has put on a loin cloth. Wilson leaves it off.”\nis completely missing the point. Which is that the Man of the Shroud was laid on the one half of the Shroud, and the other half covered him from the top, as those two pictures show. The rest are unimportant details, used by you to discredit Wilson. And just because “Della Rovers shows the legs straight down on the ground, Wilson has them bent upwards.”, Wilson is “not credible”, and the whole Shroud=Mandylion theory had to be abandoned! It is an absurd.\n\n","date":"August 26, 2013 at 11:55 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42072","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"O.K.: There are different printings of Wilson’s 2010 book. In my soft cover Bantam Press edition, the example cited by Charles is on page 9 and the purpose of including the “reconstruction” is merely to illustrate a point made in a paragraph on previous page 8 explaining how the head-to-head frontal/dorsal images came to be in that form.  \nWhoever the artist cited, none of them had the advantage of Secondo Pio’s or Guiseppe Enrie’s photographic negatives demonstrating that the original cloth image is in fact a mirror image, nor did they have access to the 3-D imagery of 20th century VP-8 analysers. In that respect, Wilson’s depiction is the more accurate, showing the left hand over the right and with knees bent. If they had known a little more about crucified bodies, and given some rudimentary thought to how the image might have been formed they might have got it right. At least they placed the hands correctly on the pelvis region for their straight-legged depictions as it generally requires bent knees or long arms to place the hands on the pubis. Perhaps the point of Wilson’s citing the “della Rovere” work was to indicate that some understanding of the placement of the imagery was already appreciated by 17th century artists. They would not have had access to the Pray manuscript discovered in 1813. \nI have often noticed that those who achieve major successes in life often do so by taking short cuts lamented by more thoughtful minds, perhaps more plodding. I have known top professionals who rose to become directors of major enterprises. They relied on others to attend to mundane but absolutely essential details. Their contribution was to cut to the chase, make the point, and to let others attend to whatever was necessary.  Generals attend to strategy and subordinates attend to tactics. Publication deadlines have to be satisfied, and sometimes the cursory is the only right answer for the time available. Scientists may prefer to seek the absolute truth in their research, but engineers need a satisfying answer immediately. There are casualties in even the best-planned battles. Scholars have time to complete their research theses; authors have deadlines to meet! Wilson’s achievement was to publicise. Others after him will hopefully complete a more fulsome task.\n\n","date":"August 26, 2013 at 5:00 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42089","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"If anyone posts the two pictures side by side you will see what I mean. Why did Wilson bring della Rovere into it at all? Why not just say that from the images today this is how the burial might have been? Della Rovere is basically irrelevant unless the Shroud had gone missing and we wanted to know what it might have looked like.\n\n","date":"August 27, 2013 at 11:19 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42138","author":"Charles Freeman","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I’m commenting here because adding to the sub-sections above gets more and more confusing! Anyway, back to the Pray codex. I think the rectangular things are definitely parts of the tomb rather than the shroud, but I do find their markings odd, and have spent some time trying to make sense of them. Overall, the sketch owes a lot to the standard “three Marys” and other resurrection iconography of the medieval period, and has much in common with them. It looks to me, however, as if it is a rather amateur copy of another image that was only half-remembered correctly.\nFor a start, most medieval resurrections show Christ’s tomb as box-like rather than cave-like. This is probably thanks to the emperor Constantine I’s excavations, which carved away almost the entire hillside around the opening to the cave, leaving, indeed, a door into a more or less rectangular stone box. As pilgrims kept chipping bits off it, the whole thing was covered in marble, which may explain the swirly patterns found in some paintings, and possibly the zigzag decoration in the Pray drawing.\nSecondly, there were apertures in this marble edifice, through which pilgrims could peer through to the tomb itself inside. These are sometimes shown as simple squares or circles, and occasionally as quatrefoils, or cross-shaped with rounded corners. These could have provided the inspiration for the little crosses all over the lower shape in the Pray drawing.\nFinally, just outside Constantine Monomarchus’s marble-covered tomb, according to François de Chateaubriand’s travel journal, “there is a stone which is a foot and a half square, and is raised a foot, which is of the same rock, and which served to support the large stone that closed off the entrance; it was from this rock that the angel spoke to the two Marys.” Of course by de Chateaubriand’s time the whole church had been destroyed and rebuilt several times, but a flat stone is usually shown in paintings, usually at an extraordinarily steep angle, with the angel perched on it somewhat awkwardly like a surfboarder.\nA detailed account of the development of the Three Marys design can be found in Neil Conwell Brooks, The Sepulchre of Christ in Art and Liturgy, which can be found on archive.org. He called this design the “Western coffer-tomb type.”\n\n","date":"August 26, 2013 at 12:16 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42073","author":"Hugh Farey","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Hugh, that is an excellent text!!!\nI can see how some think that the rectangular object many shroudies claim represents the shroud is actually a sarcophagus lid, as there are many representations of sarcophagis and their lids in the history of art.\nI’m not entirely sure what to think. I think someone (maybe Max?) has previously argued that the object represents a lid AND the shroud.\nIn many paintings the angel points to two linen objects. If the rectangular object is the shroud, and then sitting upon that is a further cloth, then the codex image is consistent with that.\nNote page 3 of chapter 3 of Brooks’ book says of representations of the time :\n“the open tomb. Angel clothed in white is seated on the lid; he holds a lance with one hand and with the other points to the shroud AND winding sheet in the bottom of the tomb”  (my capitals) \nYou can faintly make out in the codex image that the angel is sitting on a box-like object (a stone?) rather than on the rectangular object.\nthe 4 L shaped cricles are still curious to me. At one point I thought they may symbolise holes like in a ten pin bowling ball ie. holes you could put your fingers into to lift a lid up. But I doubt it. I’ve seen no precedence of such for a sarcophagus lid.\nAnd the two red streaks make absolutely no sense other than representing Christ’s blood.\nOverall, I am more compelled than not that the object DOES represent the shroud, especially when coupled with the very shroud-like image of Christ being anointed above it.\n\n","date":"August 27, 2013 at 9:47 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42131","author":"Matthias","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Matthias: Just want to remind that Wilson also thought that the rectangular shape is a lid rather than the Shroud. However he still maintained that the Pray Codex is based on Shroud (because of various other elements). It shows that there are many possible ways to interpret the Codex, which , without any doubt, share many similarities with the Shroud. Probably too many, for all of them being purely accidental.\n\n","date":"August 27, 2013 at 10:39 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42134","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Re O.K. posting Aug 26, 6:10am ~#64, Savio-Waliszewski hypothesis:\nI see a few problems with the hypothesis.\n1) Identificaton with the Arculf cloth. Arculf’s story is related at least second-, possibly third-hand, it may have been elaborated, the story says it is about 8ft long. If it’s the TS we have to assume it was folded in half, or that Arculf guessed wrongly at its length. How was Jesus transferred from the cross to the tomb? Maybe he was carried in the Arculf cloth, which as it would contain blood would need to be included in the burial linens, possibly as an outer wrapping. Hence a tradition that it was part of the burial linens. Guesses are free! \n2) S-W chart shows Shroud in Jerusalem 33-200. More likely it was transferred to Antioch after Herod’s persecution following execution of Stephen, and unlikely to be in Jerusalem after Roman suppressions 68-72 AD, Masada and all that. Unlikely to be included in Helena’s discoveries or she would have appropriated it along with everything else she took. Check Markwardt’s papers for various deliberately obscure references to Shroud in early Mesopotamian liturgies. JM postulates TS taken from Antioch to Edessa only with the impending destruction of Antioch by both earthquake and Persian invasions. Explains Edessan appropriation of discovery story in a wall, which was more likely in Antioch.\nConceivable that Arculf sheet taken from Jerusalem to Constantinople ~1050. Is there any kind of record to support this?  \n3) S-W chart shows Shroud in Constantinople until 1247. Letters from Patriarch to Pope Innocent III complain that the Crusaders took the Shroud following the sacking of Conatantinople in 1204. \n4) How did Geoffrey de Charnay come by the Shroud? Check Daniel Scavone’s paper, “BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400”. Scavone gives a credible trail through Othon de la Roche, Lord of Athens, ancestor of Jeanne de Vergy (part of her dowry); explains tradition of Shroud in Besancon, which she replaced with a copy, explains D’Arcy memorandum resulting from his confusion with the painted copy.\nhttp://ohioshroudconference.com/papers.htm\n\n","date":"August 27, 2013 at 8:37 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42123","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Good points Dave! There are many problems with this concept, and I said that I prefer Wilson’s theory over it. I just presented it to show that Image of Edessa theory is not the only one possible (and its opponents like Yannick, may be interested in some alternatives). \nI consider Savio-Waliszewski theory as quite obsolete. Savio’s book (which I don’t have ) is from 1957, while Waliszewski, who is extensively using it (remember he was/is medical doctor -if he is still alive, he must be over 100 years old), wrote his book in 1987 (just look at the national borders ;-)\nSo;\n1.) Waliszewski, like many older scholars, believed that the Shroud had been gradually shortened over centuries, while its part had been cut and sold as relics. Now, after Dickinson, and cubit measure of the Shroud, we know that this idea was wrong.\n2.) Waliszewski (this time following Wilson) thinks that the Shroud perhaps was transferred to Edessa (about 200 AD) and discovered (as a Mandylion) in 525/544, but then immediately transferred back to Jerusalem, as an Arculf’s cloth.\nIs there any document supporting transfer of the Shroud to Constnatinople circa 1050? No. I don’t know any documents speaking about it. Waliszewski assumes that the transfer took place before Seljuks captured Jerusalem in 1073. However, we know (letter from Constantine VII Porphyrogennetos to his army) that burial linens were already in Constantinople in 958.\n3.) Waliszewski qutes Savio that there are no records of transfer of the Shroud or Sudarium to the West following the 4th crusade. We know however, that this claim is incorrect (see Besancon hypothesis) He also mentiones Nicholas Mesarites speech of 1207, at the burial of his brother, suggesting that the Shroud is still in Constantinople. Then he mentions Conrad of Krosigk, and Nivelon de Cherisy, Hugo de Cambrai, and also Robert de Clari, who took back home some fragments of burial linens. Then he goes to Baldwin II who sent another fragment to Louis IX in 1247. We know now, however, that this fragment didn’t came from the Shroud of Turin (see Cesar Barta article: http://www.shroud.com/pdfs/n56part5.pdf ). We can be certain that there were multiple burial cloths in Constantinople in 10th-13th centuries.He assumes that the Shroud itself was brought to France by regent of the Latin Empire, Philippe de Toucy, around 1247.\n4.) One of Philippe de Toucy’s descendants was Jeanne, first wife of Geoffrey. According to Savio and Waliszewski inherited the Shroud from her. One of the canons from Lirey, Wulhelm de Baserne was also relative of Philippe de Toucy.\nI have read Scavone and Markwardt’s articles, thanks. As I said, I prefer Wilson’s theory over Savio’s. I believe that the Shroud was in Besancon circa 1208, but I am critical of Scavone’s explanation how it passed to Geoffrey.\n\n","date":"August 27, 2013 at 9:27 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42128","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Here, I would like to set the record straight versus what I said in my previous comments.\nThe heart of the first few messages I post on-top of this page has not been understood well, so it seem.  People, once again, have only placed the focus on my hard critics against Wilson’s hypothesis, while my intention was not at all to start another public trial against Wilson’s antics and ideas.  I want people to realize this: it’s not so much the man that I hate than the way he supposedly do his “scientific” research about the Shroud’s ancient history and, as I know, I’m far from being the only one who thinks like this (see the posts of Mr. Freeman above and you’ll see that even professional historians thinks the same).  And, to me, it is also the same thing for a bunch of other Shroud researchers that I don’t need to mention the name here but who are evidently doing Shroud “science” with dishonesty and for a wrong purpose.\nHaving said that, here’s what is the most important message I wanted to deliver to the pro-Shroud world: You constantly spit in the face of guys like McCrone, Nickell and some others and you got the right to do so since it’s evident that those people are or were dishonest versus the scientific reality of the Shroud and wanted to make money and/or to get fame “on the back” of this prestigious relic.  But, why do I never see the same kind of reactions when someone is publishing ludicrous and unscientific pro-authenticity hypotheses?  In other words, why is it always all black (so it seem) for those who do not believe in the authenticity of the Shroud and is it all white (so it seem) for those who are defenders of its authenticity? \nTo me, there is a very bad politically correctness that pollute the Shroud world since the days of STURP, which is doing a very bad damage for the credibility of Shroud science because it really gives the impression, for people from the outside like me and like most of the scientific community, that every pro-authenticity researchers defend each other’s conclusions AT ALL COST, even when they are aware that some of them are truly dishonest in their way to do their “science” and to build their “theories”.  In such cases, instead of seeing well-deserve and strong critics from those who are pro-Shroud researchers, all I see versus the bad antics of some others pro-Shroud researchers is big pats on their backs, like saying :  Keep on my friend !  You deeds are truly helping to discredit Shroud science some more, but that doesn’t matter to me, since you are convincing people of the authenticity of the Shroud with your pseudo-scientific conclusions and “theories”!\nSo, here’s my advice to all the pro-authenticity researchers out there: If you want to keep on seeing very good and scientific papers like the one written by Kelly Kearse in 2012 about the AB blood type being rejected by every serious scientific journal because of the subject matter, which they considered as a big joke that should be placed in the same category as UFO “science” and ghosts “science”, then KEEP ON DOING WHAT YOU DO WITH GREAT TALENT AND PASSION (i.e. giving a total blank check to every Shroud researcher who is considered a pro-authenticity researcher, no matter how poor he is doing his “scientific” research)!!!\nAnd if you disagree with me (I’m sure many will do), then I ask you to answer to this simple question: Why do you think Shroud science is considered as a joke by a good portion of the scientific community and by most serious scientific journals if it’s not because of all the “Dan Brown” kind of researchers like Wilson and many others (I’m sure you know who they are as well as me) that are at the forefront of modern Shroud research?\nTo conclude this comment, I would like to say that I truly believe that the great political correctness and the great chauvinism that goes on and on and on inside a certain pro-Shroud clique, which lead to a fear of strongly critiquer the researchers who are obviously doing Shroud research with dishonesty is what did the most important damage over the years to the credibility of sindonology, which is seen nowdays as a sick joke by most of the scientific community…  And it’s a shame to see that there’s not seem to be any hopes of change coming about this in a near future.  That’s why it’s not hard for me to presume that the example of Kelly Kearse’s paper rejection from any credible scientific journal just because of its subject matter is going to happen again and again in the future…  Unless the real scientists inside the Shroud world will stand up and dissociate themselves publicly from all the “Dan Browns” of sindonology (who are numerous), I’m sure sindonology will still be classified in the same unscientific category than UFOs and ghosts 20 or 30 years from now.  Again, this is a total shame because I know that there are some real professional and honest scientists in the Shroud world (even if I’m truly convinced that they are in minority)!  \nI think my opinion about the pro-Shroud clique and the damages it is causing for the Shroud and the credibility of sindonology is clear!  In the end, I hope people on this blog will realize that what bugs me the most is not Ian Wilson’s antics and “theories” or some other person like that but the way the pro-Shroud world is reacting to this.\nI don’t have anything else to say.\n\n","date":"August 27, 2013 at 4:17 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42147","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Sorry, again, I need to reprint one sentence from my comment just above:\n“To conclude this comment, I would like to say that I truly believe that the great political correctness and the great chauvinism that goes on and on and on inside a certain pro-Shroud clique, which lead to a fear of strongly CRITICIZE the researchers who are obviously doing Shroud research with dishonesty is what did the most important damage over the years to the credibility of sindonology, which is seen nowdays as a sick joke by most of the scientific community…”\nNow, that’s better.\n\n","date":"August 27, 2013 at 4:30 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42151","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Yannick, you have obviously right to criticize Wilson. And you are absolutely right that we cannot trust some scholars just because they are pro-authenticity. There were several pro guys who are dishonest (for example Kuznetsov and Garza-Valdes), but in my opinion, Wilson is not in that category.\nYou have noted that Wilson is selective, and concealed several things. Right. But also Wilson’s critics are selective, and truly, they don’t understand the point.\nRemember, it is not because of Wilson the “Academia” does not take Shroud serious. No. It is because of prejudice of Academia. For them, the Shroud is nothing elese than medieval forgery (because carbon-dating and lack of records before 1350), and they are not interested that it is not reproducible up to this day.They will gladly accept whatever Nickell, Garlaschelli, Schafersmann, or similar guys will say. Because it is beyond their imagination, that any relics of Christ may have survived up to this day. And in some ways, the Shroud studies are similar to UFO or ghost studies. They are also on the verge between natural and supernatural. And no serious scholar would risk his/her reputation being involved in research of supernatural.\nRemember also, that “Academia” cowardly adheres to some of their dogmas. One of them is that the Image of Edessa could be only small cloth with just a face image on it. The Wilson’s (but actually he was not the first one who invented it) idea that it could be more, is a heresy for them. And for that heresy, they want to burn Wilson at stake. I have read several comments about Wilson’s theory from “serious scholars” saying that it is bad. Why? Because it is bad, and I, The Great Authority say so (without involving in any factual arguments)!\nTo be Continued…\n\n","date":"August 27, 2013 at 6:28 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42157","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I have read your article “Many questions concerning the Mandylion hypothesis proposed by Ian Wilson !!!” As I said, your arguments are no deadly threat to Wilson’s theory. But nevertheless, some of them are really good questions. But I know the possible answers for them. And there is one thing you should be aware. In my opinion Wilson committed one deadly sin. In his “Holy Faces, Secret Places” he disregarded one very important thing: The Manopello Image! There were probably more than one acheiropoietos! There were two, the so callled Image of Edessa, and Image of Camoulia!\nSee this page: http://manoppello.eu/eng/index.php?go=start\nNow back to Edessa. I want to say something that most of the Shroudies never concerned. The Mandylion was not a real object. It was an IDEA! It never existed as a SINGLE OBJECT!\nNo. There were several objects that played the role of the Mandylion. I believe the Mandylion transferred to Constantinople in 944 was the Shroud. But this was not the Abgar’s Mandylion! It was The Manoppello Image! The COLOURFUL image of JUST THE FACE, that looks like A PAINTING! It was later lost, rediscovered in Camulia (which was a town near Edessa) and the Shroud (which was transferred to Edessa at later period, possibly around 200 AD and rediscovered in 525 or 544) took its place! But Mandylion had always been believed to be just a face image of glorius Christ with open eyes. However, as Wilson show, it was not a problem to create anothe “Mandylion” from the Shroud. Just fold it eight times, tetrdiplon, you know. And the confusion that lasted up to this day began…\n\n","date":"August 27, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42159","author":"O.K.","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"O.K., I will way until you publish a paper that will give proper answers to my numerous questions regarding Wilson’s Mandylion hypothesis before answering your comments…  I still wait for you to do this and remember one important thing:  You don’t have the right to base your answers solely on pure spéculations!  You must bring me solid pieces of evidences if you want me to really consider your paper seriously.\nAnd don’t forget to think of doing the same rebuttal tentative versus the paper published in 2 parts by Davor Aslanovski in 2012. Here’s the links: 1- http://deumvidere.blogspot.com/2012/06/image-of-edessa-and-turin-shroud-part.html?m=0\n 2- http://deumvidere.blogspot.com/2012/06/image-of-edessa-and-turin-shroud-part_22.html?m=0\nAnd also, why not doing the same work for the very good paper published recently by Charles Freeman about Wilson’s ideas called “The Turin Shroud and the Image of Edessa: A Misguided Journey”.\n\n","date":"August 27, 2013 at 6:55 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42163","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"You should read “I will wait” instead of “I will way”…\n\n","date":"August 27, 2013 at 6:57 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42164","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"The reasons why Academia and the Scientific Community refuse to take the Shroud seriously has less to do with the work of Ian Wilson than the stiff-neckedness of their ivory-towered residents.  It was thus always so. Refer to the 1902 letter of Yves Delage to the editor of ‘Revue Scientifique’. “… a religious question has been needlessly injected into a problem which in itself is purely scientific, with the result that feelings have run high, and reason has been led astray, If, instead of Christ, there were a question of some person like a Sargon, or Achilles or one of the Pharaohs, no one would have thought of making any objection … I have been faithful to the true spirit of science … I recognize Christ as a historical personage and I see no reason why anyone should be scandalized that there still exist material traces of his earthly life.”  \nFrustrated by the hostile reception his paper had received, and the disinterest of Turin, this agnostic Professor of Anatomy turned his attention to other interests. Wilson writes that since then with the publication and circulation of Pia’s negatives, the situation has changed radically, citing the work of such medical men as Barbet, Moedder, Bucklin, Willis et al. However I believe the stiff-neckedness persists and I cannot be so optimistic. A certain Galilean prophet of the first century had a similar problem with the learned establishment of Jerusalem, apparently with the sole exception of one Nicodemus. \nUniversities and other Research Institutions rely on their funding from various commercial enterprises, hoping to turn research into profits with new products. Even government fundings hope for economic returns, and philanthropic grants are usually specific-goal directed. There are no profits or economic returns to be made from research into the Shroud and so it is ignored.  Research on the TS can only come from voluntary expert enthusiasts, sometimes with personal agendas, often retired from their professional life, or with the hope that their work might sell a book which they can write for meagre returns for their efforts. Even volunteers have to eat. Even movies of the Shroud are made with a distracting “Gee whiz!” factor in order to boost sales, but which are counter-productive to serious research. \nUntil such time as a Bill Gates or some other philanthropist can be pursuaded to fund essential research into this relic, despite it being overly-protected and confined by its ecclesial guardians, any such research can only continue on an amateur basis. Hence it will continue to be ignored by the various “professional” bodies, and they will refuse to take it seriously.\n\n","date":"August 27, 2013 at 6:00 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42156","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Quote: “The reasons why Academia and the Scientific Community refuse to take the Shroud seriously has less to do with the work of Ian Wilson than the stiff-neckedness of their ivory-towered residents. It was thus always so.”\nMy reply: What do you do of the scientific work of Vignon, of Barbet, of the Pellegrino’s commission and, some years later, of the STURP work (along with some others scientists work like Baima Bollone and Riggi)?  All these analyses of the Shroud were performed by true experts in their field…  I don’t see any “stiff-neckedness” scientists in this group (which count a good amount of true experts)!  \nAll these analyses were done with profesionalism and were considered valid (or at least credible) by many persons around the world (not just Christians).  Because of this, I seriously think that things started to go off-track right around the time the STURP team went to Turin, because at the same time, the most obvious and well-known “Dan Brown” of sindonology (named Ian Wilson) was publishing is first book (a popular book and not a scientific publication in a serious history journal) about the Shroud, which exposed some of his most infamous crazyness (often called “theories” by pro-Shroud folks).  To me, historically speaking, this is right then that sindonology really started to lose its credibility among the scientific community and things got even worst since that time, mainly because of the very good reception and diffusion of Wilson’s idea by the pro-Shroud clique (which highly contributed to the commercial and popular success of Wilson’s book), which encouraged many other little “Dan Brown” to follow the same path, thus damaging even more the little credibility that was left since the STURP days.\n\n","date":"August 27, 2013 at 6:42 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42161","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Not being clinically qualified, I do not expect to be able to correct the condition of any deeply ingrained pathological anti-Wilson paranoia. I have stated elsewhere that I consider Wilson’s main contribution was to publicise much of the Shroud research and information that remained largely unknown within the Anglophone world. That is a large sector of humanity, even within the confines of Canada. \nPaul Vignon was a protege of Yves Delage, and we know the reception that their corroboration elicited from the scientific community. Despite the expertise of many later researchers, their Shroud investigations were largely on a voluntary basis, often prompted by a religious persepective. Even Barbet’s work is pervaded by his sense of religiosity.  The STURP project comprised self-appointed experts working only in a spare time capacity, away from their more usual corporate employments. STURP was only made possible by the financial efforts of Thomas D’Mulhalla, a nuclear physicist who owned and ran the firm of Nuclear Technology in Connecticut. D’Mulhalla with others had acquired through gifts and loans some 2.5 million dollars of advanced equipment, without which STURP would have been a No-go! Likewise the various promotions, such as Silent Witness were only possible by the enterprise and financial credibility their promoters could secure from their financial backers. \nIn the area of Academia, there is no such funding available for Shroud research, and so any such further work will remain undone, until such time as there is sufficient financial interest. Meantime it will be limited to voluntary experts with sufficient enthusiasm.\n\n","date":"August 27, 2013 at 8:19 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42169","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"I am going to bow out by remaking my original point, which is nothing to do with stiff-necked academia, but with the way that unquestioning belief in Wilson (who, to my mind, is a very poor and often misleading historian), has stopped other paths being investigated.\n I work in the wider field of relic cults which is why I keep coming across material that seems relevant to Shroud researchers but, so far as I know, has been neglected by them. \n So do you all know (perhaps you do) about the accounts of Antoninus of Piacenza, c. 570, who reported from Egypt (Memphis) of a ‘pallium lineun in quo effigies salvatoris . . .que imago singulis temporibus adorator et nos adoravimus.’ This is important  as one of the problems of tracing an early shroud is that of the high rate of disintegration of linen outside Egypt,yet here is an early example of a LINEN cloth with an IMAGE of the saviour on it WITHIN Egypt.\nThe article you need is Ernst Kitzinger ‘The Cult of Images in the Age before Iconoclasm’, Dumbarton Oaks Papers, Vol.8 (1954), pp 83-150, quote  comes on p. 96.\nI am not going to stand up and defend academia which as  we all know can be narrow and obstructionist of any new ideas. I AM going to criticise Shroud researchers who are so blinkered that they cannot possible look at alternatives to Wilson when there are many to follow up (see my original post on the relics from Jerusalem in churches close to Lirey). \nI must get back to my own researches!!\n\n","date":"August 28, 2013 at 4:21 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42196","author":"Charles Freeman","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Quote from Mr. Freeman’s above comment: “I am going to bow out by remaking my original point, which is nothing to do with stiff-necked academia, but with the way that unquestioning belief in Wilson (who, to my mind, is a very poor and often misleading historian), has stopped other paths being investigated.”\nMy comment:  I agree 100%!  And this is one of the worst outcome of the more than very enthusiastic welcome of Wilson’s hypotheses by the pro-Shroud world since 1978 up until this day!  Because almost every pro-Shroud researcher (most of them being non expert in the field of history) bought many ideas of Wilson without taking time to check it out in deep (which contributed to give Wilson a credit he did not deserve and contributed also to sold them even more to the general public), it produce something like a syndrom in the Shroud world where the Mandylion hypothesis became so well-accepted that it was considered as a real proven “theory” and, consequently, lead the vast majority of Shroud researchers to stop investigate other potentially interesting paths, like if there was only the “Mandylion” poor trail that was left as a real possibility to explain the dead silence of ancient manuscripts versus a shroud of Christ showing a complete body image with all the bloody stigmata of the Passion…  I repeat, this is one, if not the worst tragedy of the whole Mandylion affair.\n\n","date":"August 29, 2013 at 4:28 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42340","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Charles: I think you mistake my point. I for one do not have an unquestioning belief in Ian Wilson’s work, and I see evidence in many pro-authenticity papers that neither do their authors.  Wilson’s work began I believe sometime in the 1970s, he has continued to pursue the investigations he began, certainly up until the last few years. Clearly other information not available to him when he began, has come to light subsequently and needs to be considered.  I consider it not at all implausible that perhaps Coptic Christians may at one time have been guardians of important crucifixion relics, burial cloths, and yes even the relic we call the Turin Shroud, perhaps even for some centuries. \nWhat I and others object to is not thoughtful criticism of Ian Wilson’s work, or the highlighting of some his errors, but the frequent ad hominem castigating of the man that we often see on this site.  Wilson’s publications I believe were not intended as scholarly papers for academic journals, but were intended to inform the public at large of significant information concerning what is arguably the most important relic in Christendom, if it is at all authentic, \nIf it is authentic, then it is not good enough for academicians to confine any knowledge they may have on it, to their own inner circle. I believe they have a moral duty to inform the public, particularly if they have any kind of Christian affiliation.  Wilson is one of the few who have responded to that challenge as best he can. Perhaps in the electronic age, Publication Houses may find it difficult to promote such works and they look for a populist angle, which distracts from the truth. I have mentioned that funding is an issue, “Shroud Research” is hardly a professional calling which puts food on the table, and it seems can only continue as a part-time hobby by those with the means to sustain it.\n\n","date":"August 28, 2013 at 7:49 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42215","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"On a more general note (forget for a second the great damage that Wilson’s hypothesis about the Mandylion did on historical researches about the Shroud), I think that what was the most damaging thing that ever happened to the credibility of Shroud science in the eyes of the scientific community was the failure of STURP to find one natural mechanism that could explain the image, because this lead to what I consider to be the worst extrapolation of all time versus the Shroud, i.e. that this failure MUST be understood as meaning that the Resurrection of Christ had something to do with this image.  The reality is this: STURP NEVER said something like that, nor that its final report can be understood as possibly meaning anything close to such a supernatural and religious extrapolation.  \nThis unscientific notion was push forward mainly by popular book writers like Wilson and a bunch of others, particularly after the publication of the final report of STURP and, to me, this is exactly where things really went off-track for the credibility of sindonology.  And then, another event highly contributed to broke down even more the credibility of Shroud science and this was probably cause at least partially by the C14 dating result of 88 (published in 89), i.e. the publication, around 1991, of John Jackson’s “body of light” hypothesis to explain the image.  Up until that time, the supernatural and religious extrapolation that the failure of STURP to find a natural explanation for the image meant that it was NECESSARILY related directly with the Resurrection of Christ was mainly publicized by popular authors, but now, this new supernatural and religiously based hypothesis proposed by Jackson (which was one of the two leaders of the STURP team) was giving much more credibility to those who were pushing this supernatural and religious issue forward…  \nSince that time, I think it’s fair to say that Shroud science never was able to regain the credibility it had back when STURP, Frei and the Italian team of scientists analyzed the cloth in 1978 and in the following years, despite the fact that some truly professional scientists have accepted to enter the picture.\nIn the end, I really think that the most damaging thing that ever happened to the credibility of Shroud science is the failure of STURP to find a natural cause for the image, which lead many people (including many book writers and even many scientists) to imagine any possible supernatural scenario they could think and sold them to the world…  Having said that, I think the only thing that could be done to help sindonology regain some credibility would be to see true professional and honest scientists form a new group of research regarding the Shroud that would clearly disassociate themselves with anything related with any supernatural or religious hypothesis regarding the relic.  And I seriously believe that if a group like that form one day, that could be the signal the Vatican is waiting to finally allow a new series of direct research on the cloth…\n\n","date":"August 29, 2013 at 5:18 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42352","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Yannick\nI find your resistance to any possiblity of a supernatural cause for the image formation curious. Do you believe the resurrection was metaphorical?\nBecause as I said to Hugh, if the resurrection was a real, literal event, then there is nothing illogical in arguing that the shroud is a by-product of that real, literal (albeit supernatural) event.\nI’m not saying categorically that the shroud image was created by the resurrection. But I am saying that if you are a Christian and belive in a literal rather than metaphorical resurrection, then it is at least a possibility that should not be rubbished.\n\n","date":"August 29, 2013 at 6:51 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42363","author":"Matthias","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"As long as there will be “scientists” who will push the Resurrection issue forward concerning the Shroud, the credibility of sindonology will remain extremely low in the eyes of the scientific community because resurrection is a religious and supernatural concept that, by definition, cannot be explain in any way by science.  As Barrie Schwortz always tells in interview : you can’t go to a lab and resurrect people to see what kind of images they can produce on a linen cloth!  \nBut the main thing is this and I have said it many times on this blog:  On the contrary to what most supernatual fans thinks and try to make believe, science is still very far from having fully tested every possible natural phenomenons that could possibly account for the image and the reason is very simple:  to test most of the most interesting hypothesis, you would need a fresh (and even better, a beaten and tortured) corpse!!!  In such a context, it is highly unlikely that the most promising hypotheses involving natural phenomenons will be successfully tested in a near future…\nAnyway, since it is a fact that science has not come full circle yet versus every possible natural phenomenons that can account for the image, it is scientifically absurd to look at supernatural explanations for the image for the moment and I firmly believe that every scientist who push this issue forward (you know who they are!) are doing each time a bit more damage to the credibility of sindonology.\n\n","date":"August 29, 2013 at 7:29 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42366","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Quote: “But I am saying that if you are a Christian and belive in a literal rather than metaphorical resurrection, then it is at least a possibility that should not be rubbished.”\nMy answer:  In my mind, as well as in the mind of millions of Christians (even Mel Gibson see it like this in his movie about the Passion), Jesus corpse just disappeared (dematerialized) suddenly from inside the Shroud.  Then, later on, he physically appeared a few times to his disciples, while always disappearing suddenly at the end without any release of energy whatsoever (so it seem).\nIn this context, I don’t see why the dead body of Christ should have released any kind of energy whatsoever at the moment of his disappearance.\nOn the contrary, it seem to me highly probable that his dead body released some post-mortem gases (along with maybe some other biological molécules) that could have caused some form of chemical reaction at the surface of the linen cloth with the thin layer of impurities that was probably present there (whether it is a Maillard reaction in the way described by Rogers or some other natural interraction between the body and the impurities).  Such a natural scenario look to me as much more probable and rational in the context of Jesus burial that was done with a linen shroud.\n\n","date":"August 29, 2013 at 8:18 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42370","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Additional comment:  Concerning the natural scenario I shortly described above, I would like to say this:  If I was a scientist trying to find a possible cause for the image, it is exactly in that direction that I would put my focus…\n\n","date":"August 29, 2013 at 8:20 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42371","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"But Yannick the whole point re : the resurreciton is that it is an inexplicable supernatural phenomenon! By its very nature it contradicts the laws of nature!\nIf you accept this, then there is every reason to believe that the image was created by a phenonemon that contradicts the laws of science. So it then becomes futile trying to explain the image creation via scientifically verifiable means, ie. radiation etc.\nI agree that the dematerialisation of Christ’s body didn’t necessarily release radiation which created the image. My point is, because that dematerialisation is scientifically inexplicable, there is every chance that a scientifically inexplciable process caused by that dematerialisation created the image!\nThen, logically, if we accept that, then we will never be able to explain the image creation.\nOf course, the Shroud image could have been caused by natural gases etc.as you suggest. That is not intrinsically incompatible with the resurrection still occuring…BUT my point is, if you believe in a literal resurrection, then at the very least you should consider a supernatural, scientifically inexplicable image formation process at least a POSSIBILITY (even if a remote one) as the shroud covered the body that went through this supernatural process\n\n","date":"August 29, 2013 at 8:49 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42372","author":"Matthias","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"Matthias, if you read well my paper about the evidence of the bloodstains, you will note that I keep a supernatural process as part of my 4 scenarios list!  Here’s the link to my paper: http://www.shroud.com/pdfs/n76part5.pdf\nBut my point is this:  So far, I don’t see why a true scientist should want to explore this supernatural path, while there are still some pretty good potential scenarios that involved some natural phenomenons…\nOf course, because we still searching to find one process that can account 100% for the image, anyone if free to believe the Resurrection caused the image, but I repeat that for a true scientist, there are no good reason whatsoever to look in that direction for the moment.  As I often said here and elsewhere: I’m not aware of one single data coming from the Shroud that lead DIRECTLY AND ONLY to the idea of a burst of energetic radiation released by the body at the time of the Resurrection.\n\n","date":"August 29, 2013 at 8:56 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42375","author":"Yannick Clément","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"OK thanks Yannick, good paper, and glad to see you acknowledge a supernatural cause as at least a possibility!\n\n","date":"August 30, 2013 at 2:30 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42384","author":"Matthias","site":"shroudstory"},{"title":"Google, McCrone and my Dog","post":"If I wanted to remain honest over the whole subject, I had no other choice my friend!  Effectively, since the image process is still undetermined and this cloth is considered as the authentic burial cloth that wrapped the corpse of Jesus until its disappearance from it, I had to leave this as a possibility, even though, as you already know, I don’t consider it to be high at all.\nBut, in the end, the real question regarding the “natural or supernatural” issue is not the probability we can assign to both hypotheses, but the question of whether or not a real professional scientist should start to look for a process that would involve some form of supernatural burst of energy of some kind BEFORE science could have the opportunity to properly and totally discard every possible natural mechanism that could theoretically have produced such an image?\nPersonally, I would answer a big “NO” to this question and I hope most scientists involved in Shroud research these days could answered the same.  I truly don’t think it is ethical for a real scientist to start making links between the Resurrection of Christ and the image on the cloth in the present state of our knowledge on the Shroud…  I have no problem seeing Joe Blo the Christian doing such a link, but when it comes to someone who pretend to be a real scientist, that’s when my latin blood start to boil a little bit.\n\n","date":"August 31, 2013 at 5:41 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","id":"comment-42530","author":"Yannick Clément","site":"shroudstory"}]
