[{"title":"Holding the Shroud to an impossible standard?","post":"excellent comments Dan. I agree with your conclusions.  I especially like your ideas in the last paragraph. I think there is a good chance that the shroud will forever remain an unexplainable object. A mystery. Is that a bad thing?\n\n","date":"October 16, 2013 at 6:44 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47618","author":"Matthias","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Dan,\nWe do not order our lives by proof beyond a reasonable doubt, Even so,  some might believe that the evidence is beyond reasonable doubt.\nThe advocates have a right to demand of skeptics: If not Him, who? There is not a scintilla of evidence of anyone else who could have been the Man in the Shroud. While the New Testaments accounts written several decades after the death of Christs have some inconsistencies, as to the most important facts they are remarkably consistent: Christ died and was  buried.\nSome claim the issue is provenance: where was it? I say the issue is providence? How did it survive with it’s secrets locked in a mysterious image until an Italian photographer unlocked the first one: the image is a negative. Since that initial discovery, in fits and starts science has revealed more of the secrets of image.\nThomas de Wesselow’s remarkable book “The Sign” demonstrates inadvertently the challenge of the Shroud. De Wesselow makes a convincing case for the Shroud’s authenticity but then speculates that the early Christians mistook the Shroud for a risen Jesus. He does so because as an agnostic he can not accept the possibility of the Resurrection.\nThere’s the rub. The reason everyone, included some who believe in authenticity, are reluctant to state a conclusion, is because behind the issue of authenticity lurks the fundamental issue of our existence: the Resurrection. To paraphrase Jack Nicholson in A “Few Good Men,”They can’t handle the truth!” [The paraphrase is to substitute “they” for “you.”]\nPS: How do you italicize in a Comment?\n\n","date":"October 16, 2013 at 6:45 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47619","author":"John Klotz","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Trying lawyers can’t handle the truth.\n\n","date":"October 16, 2013 at 6:53 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47620","author":"Dan","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"That worked. Replace the open and close parenthesis with the less-than and greater-than symbols: (I)lawyers can’t handle the truth(/I).\n\n","date":"October 16, 2013 at 6:57 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47621","author":"Dan","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"‘The reason everyone, included some who believe in authenticity, are reluctant to state a conclusion, is because behind the issue of authenticity lurks the fundamental issue of our existence: the Resurrection.’\nI disagree. Although I think on balance the shroud is quite likely to be authentic, I stop short of being certain in my conclusions. One of the main reasons for this is the carbon dating. Yes, I know it has its critics, and I am open minded enough to consider that it may be flawed. But until more carbon dating is done that refutes it, I think this is a barrier to a more conclusive view.\n\n","date":"October 16, 2013 at 7:22 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47625","author":"Matthias","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"I completely agree with your position Matthias.  Here is my standard answer when someone asks me if I think it is authentic:  “I am 90% certain it is, however I still must give 10% to the notion that there is a medieval artist out there who predated Leonardo DaVinci by several hundred years, we don’t know who is, we don’t know how he did it, and he never did anything else of any significance.  I guess that is possible, but in my view, not very likely.”  Unless and until it is carbon dated again with a definitive first century origin, I will be stuck at 90%.  In the meantime, the message of the Shroud completely correlates with Scripture and I am 100% certain the message of Scripture is true and accurate.\n\n","date":"October 16, 2013 at 8:48 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47634","author":"Russ Breault","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"I just love the way Dan as an archaeological image  NON-analyst AND NON-cryptanalyst can be in denial of the possible presence of partial images of numismatic legends and central devices, floral images, lettering on the shroud. I just love his flight of wild negative fancy…  \nAre archaeological image NON -analysts and NON-cryptanalysts’ past misreading and misinterpretations of intriguing patterns on TS, the proof of absence of really intriguing patterns?\nCan the man REALLY discriminate between a false positive (I think I see) and a false negative (I think I don’t see) as far as numimatics, botany and paleography are concerned.? Most obviously he JUST CAN’T.  His opinion is just a NON PROFESSIONAL one and FAR FROM A FACT.\n\n","date":"October 16, 2013 at 7:47 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47628","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"While the image of teeth is most likely due to banding effect and tight wrapping-up when the burial shroud was in-soaked with a watery solution, the optical illusion (pareidolia) was “faithfully” copied by an artist on the Manoppello Veil to become an “archaeopareidolia” i.e. a data referring to the Turin Shroud as material backing for optical illusions experienced by Late-Antique and Medieval observers.\n\n","date":"October 16, 2013 at 8:25 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47630","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Reminder: the TS bloodied body image “behaves” like an oversized Rorschach, which makes it hard to discriminate between illusive patterns and real patterns at times.\n\n","date":"October 16, 2013 at 8:29 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47631","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"I perceive the Shroud of Turin is being in essence a thought experiment, imagining the effect of removing a victim, condemned to burning at the stake,  while newly deceased but before substantial incineration, and placing in an up-and-over Shroud. The “hot” victim then leaves a scorch-like body imprint on both surfaces of the cloth. The end-result is/was intended as a visual and arresting metaphor – “Look – this is what they did to our blameless man, a latter-day martyr who suffered a fate comparable to that of Christ, i.e. false witness, followed by humiliating and excruciating public execution.\nEvidence? It has to be circumstantial obviously, but it is there if you look for it, first clearing your mind of earlier interpretations, many of which are less than convincing, e.g. that of the so-called “poker holes”. The latter were almost certainly a signal to the viewer that the man depicted had been burned at the stake, that the burn holes were produced by hot charcoal falling onto the linen while still neatly folded, prior to being used to wrap the deceased. The midline fold that is needed to explain the symmetry of the burn holes (original  ones– but later 1532 also) existed before the image imprinting in the case of the original L-shaped burn holes. The later 1532 holes, much larger, were a deliberate attempt to draw attention away from the earlier holes, not by patching (too conspicuous) but by swamping with new ones. The original holes were an embarrassment, you see,  for those who wanted to re-invent Shroud Mk1 as Christ’s shroud, so much so that we see the original holes being represented as “blood”  (red paint) on the 1516 Belgian (Lier) copy, for example, showing that copyist was clearly puzzled and/or confused by the L-shaped holes. \nhttp://www.shroud.com/vanhels2.htm/\nThe 1532 fire (no accident, IMHO) removed that source of embarrassment at one fell swoop (though they had maybe forgotten or conveniently overlooked the ‘incriminating’ Lier copy).\nSo, if you have ever wondered why there is a vertical axis of symmetry about the burn holes in the Shroud, both 1532  AND previous “poker holes” implying a disrespectful and arguably improbable folding down the mid-line of the face –  there’s your answer. It’s to do with the artisan’s deliberate attempt to signal that the victim has been roasted over red-hot charcoal – some of which had fallen onto and damaged the folded linen, prior to it being used pictorially and metaphorically as a burial shroud.\nThe victim? As I and others have suggested before, most probably a Knight Templar, possibly Geoffroi de Charney or Jacques de Molay, both burned at the stake in 1314, approx 40 years before the first display of the Shroud at Lirey.\n\n","date":"October 16, 2013 at 9:16 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47636","author":"colinsberry","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Typo (very first sentence!):  I perceive the Shroud of Turin AS being in essence …\n\n","date":"October 16, 2013 at 9:34 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47637","author":"colinsberry","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Re CB being the victim of a pareidoliac “semblance et avision” is another good example of RE-EXPERIENCED archaeopareidolia… \nActually the first “CRYPTIC SYMBOLICAL” rendering of the vision” of a man been roasted while the observer was looking at the burial Shroud (now kept in Turin) dates back to the first half of the 5th C. CE  (see the Maryrdom of St Lawrence mausoleum of gallia placidia, Ravenna). Many Turin Shroud data are here YET ciphered. \nThere is another late 11th-early 12th Shroud-like cryptic Martydom of Saint Lawrence by Benedictine Abbot-mural artist,  Hugh of Cluny (1049-1109) (see his designed programme of mural paintings in the Cluniac chapel of Berzé-la-Ville in Burgundy).\n\n","date":"October 16, 2013 at 9:53 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47639","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Correction: Read The martyrdom of Saint Vincent (not Saint Lawrence) in Berzé-la-Ville. Actually the two saints are currently mistaken one for the other. Addendum: the 4 series of burn holes are ALREADY cryptically featured in the Ravenna mosaic.\n\n","date":"October 16, 2013 at 9:59 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47641","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Notice in the Ravenna mosaic the most intriguing characterictic of Saint Lawrence’s grate: it has wheels! Actually the two small wheels cryptically feature two of the four roundish waterstains in conjunction with the series of burn holes one can still see on the TS.\n\n","date":"October 16, 2013 at 10:08 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47643","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"For another 390-400 CE mosaic cryptically and symbolically featuring the blackened-rimmed burn holes, see the Santa Pudenziana apse mosaic of Christ in majesty:  black L (for Lumens Christi) marks the latter’s pallium/himation = a very large rectangle of fabric that can be draped as a shawl, a cloak, or a head covering)” (a current 4,20×1,40m for a 6ft tall man was the correct size; a size much like the TS).\n\n","date":"October 16, 2013 at 10:24 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47646","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"CB should read about the primeval fold running along the main axis before passing comments.\n\n","date":"October 16, 2013 at 10:38 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47647","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"CB you wrote: “The later 1532 holes, much larger, were a DELIBERATE (upper cases mine) attempt to draw attention away from the earlier holes”, oh, REALLY?\n\n","date":"October 16, 2013 at 10:42 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47650","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"This is a balanced view of the state of Shroud studies at present.\n\n","date":"October 16, 2013 at 10:45 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47653","author":"Louis","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"CB you also wrote: “I perceive the Shroud of Turin is being in essence a thought experiment, imagining the effect of removing a victim, condemned to burning at the stake, while newly deceased”. \nAre you deep down afraid of Hell after your death? You should ;-)\n\n","date":"October 16, 2013 at 10:57 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47655","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"“It is often said that the images are 3D encoded. What does that mean? No, I understand that you can plot reasonable three-dimensional (height-field) shapes from the images, but why? It is often said that the 3D data represents spatial information (distance between the body and the cloth – somehow). There is no way to know that without presuming something about how the image was formed.\n”\n1) Your answer to “What does that mean” is “No ….”\nWhy do you start with “No”, no to what?\nI guess the “, but Why?” is the real answer.\nYou can plot meaningful 3D because the light-intensity variations on the cloth allow it.\n2) “It is often said that the 3D data represents spatial information (distance between the body and the cloth – somehow). There is no way to know that without presuming something about how the image was formed.”\nNo, this is mostly independent of how the image was formed. Though it is dependent on how the cloth was wrapping the supposed corpse.\nSee how 3D data can be easily decoded at http://sindonology.org/shroudScope/shroudScopeHelp.shtml#3D\n\n","date":"October 16, 2013 at 11:20 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47656","author":"Mario Latendresse","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"… and people wonder why scientists, including retired ones (like me) steer clear of the internet as a medium for expressing their views and ideas…\n\n","date":"October 16, 2013 at 11:21 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47657","author":"colinsberry","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Sorry: my last comment was posted before Mario’s appeared. (Where would we  Shroudie bloggers be without Mario’s ShroudScope?).\n\n","date":"October 16, 2013 at 11:25 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47659","author":"colinsberry","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Dr. I. Colinsberry you wrote  (meaning big S(cience I suppose): “The victim? As I and others have suggested before, most probably a Knight Templar, possibly Geoffroi de Charney or Jacques de Molay, both burned at the stake in 1314, approx 40 years before the first display of the Shroud at Lirey.”\nOh really, you can “scientifically” recognized a naked Templar by means of the head on the Lirey Pilgrim badge? Is that what you call circumstancial evidence. A medieval observer taking a look at the Lirey Pilgrim badge, would have either recognized the Holy Shroud or mistaken the naked man for  Saint Lawrence or Saint Vincent. \nBTW do you know what Jacques de Molay and Geofrroi de Charney look like? Most OBVIOUSLY you just ignore it. The fact is I found two graffiti featuring Jacques de Molay and one Geofrffroi de Charney an they look more than Yeshua/Jesus old or an adult man…\nTo “the scientist” speaking OUT OF his field of expertise on the internet while thinking he knows better than any archaeological image analyst and cryptanalyst. e.g. re the Pray Hungarian MS: MARK MY WORD VERY SOON I will demonstrate beyond the shadow of a rational doubt, the PHM pictures pre-dates the radiocarbon dating and his mummy-leech et al scorch is just pseudo-scientific pseudo-historical pseudo-archaeological theory applied to the TS.\n\n","date":"October 16, 2013 at 5:24 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47682","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Sorry for all the typos just writing in haste (as usual)\n\n","date":"October 16, 2013 at 5:32 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47685","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Just notice the “I and others” used by Dr. I. Colinsberry….\n\n","date":"October 16, 2013 at 7:19 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47694","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Addendum rearding Dr. I. Colinsberry’s big S(cience): Jacquers de Molay and Geoffrroi de Charney were burned at the stakes KNELT AND IN THEiR SHIRTS (and not stak naked) not on a grates or griderion like Saint Lawrence and Saint Vincent. Your pseudo BIg S(cience is FLABBERGASTING!\n\n","date":"October 16, 2013 at 5:30 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47683","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Iconographically and archaeologically speaking, CB you’d better STEER CLERA of  image analysis and cryptanalysis as far as the Ts is concerned.\n\n","date":"October 16, 2013 at 5:45 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47687","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"This thing about Jacques de Molay, hooked on to the stake and the TS comes from Baigent.\nDid you see what he wrote in “The Jesus Papers”? Where is the hard evidence? Where are the papyri dated to AD 45 he found, which he claims were authenticated by Yigael Yadin, the Israeli archaeologist? For God’s sake, Yadin was an honest man, took the Gospels seriously as historian and was the first one to propose that Jesus was anti-Essene, referred to them as “Herodians” and stayed in the house of Simon the leper on the way to Jerusalem, purposely defying the rules of ritual purity so important to the Essenes. Baigent’s agenda is no secret and it looks like there are no limits to what he is trying to get at.\n\n","date":"October 16, 2013 at 6:10 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47689","author":"Louis","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Reminder: Saints who died in imitation of Christ’s self-sacrifice and martyrdom (i.e. in imitatio Christi) could be depicted with Christ-like and even at times Shroud-like characteristic traits whence the steganographic depictions of e.g. Saint Lawrence (in Ravenna, early 5th c. CE) and Saint Vincent (in Berzé-la-Ville, early 12th c. CE).\n\n","date":"October 16, 2013 at 7:10 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47692","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Addeendum: Saints who died in imitation of Christ’s self-sacrifice and martyrdom (i.e. in imitatio Christi) could be depicted with Christ-like and even at times Shroud-like characteristic traits AND/OR (pareidoliac) attributes.\n\n","date":"October 16, 2013 at 7:26 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47695","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Thank you for your reply to my recent email.  You raise good, and sophisticated, points.  However, I had already acknowledged that, of course, more remains to be discovered or determined.  There will always be something else.  That is simply the nature of this sort of inquiry.\n     In a sense you indirectly support my basic contention because none of the questions you raise is potentially disconfirming, a striking fact in itself.  If the absence of an hypothesized Hebrew word, or type of pollen, on the Shroud served to demonstrate its inauthenticity, rather than merely the fallacy of the particular (confirming) hypothesis, then what you say regarding suspension of judgment would, to that extent, hold true.  But none of the issues you raise has that character.  At worst, the mountain of evidence in favor of a positive judgment would have a few less stones.\n     This is the chief thing about the Shroud.  Beyond what I’ve already called a botched carbon 14 test, NOTHING disconfirms its authenticity.  All the solid evidence of which I am aware is in its favor, and that evidence is so striking, and the facts so mutually supportive, I truly cannot see why you would believe the sum to be insufficient.\n     Therefore, I respectfully reiterate my complaint, that you do seem to me to be holding the Shroud to an impossible standard.  There will never be a time when you cannot point to something yet to be proven, but should such a circumstance prevent you from rendering a perfectly reasonable judgment on the basis of what is now known, given the extent and quality of the evidence?\n     Thanks again.  (Very interesting blog by the way.)\n\n","date":"October 16, 2013 at 7:42 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47697","author":"R. H. Cahall","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Hi R.H. Cahall. I often wonder who “a reader writes” is, and whether they follow up the ballyhoo their innocent inquiry can stir up! The problem with most of the evidence about the shroud is that what is unquestioned is circumstantial, and what is direct is never unquestioned. The similarities of the image on the shroud to Gospel accounts, Roman descriptions of crucifixion, or medieval paintings place one in a chicken and egg situation, and cannot be considered more than suggestive. Similarly, the fact that “nobody knows how it was done” applies equally to a natural 1st century image and a manufactured 13th century one.\nThe main scientific points (at least to me) are whether the blood arrived before or after the image, the provenance of the pollen, and the radiocarbon date. All of these would be extremely good evidence if any of them were universally accepted, but they’re not. Max Frei’s pollen analysis is statistically very questionable, and his slides have disappeared into purdah, and the blood first hypothesis has been thrown into question mostly by the apparent discovery that the image is not part of the original flax but on some kind of coating – itself a highly disputed hypothesis. The failure of the radiocarbon date depends either on deliberate fraud, which very few people adhere to, or to the fact that the date was affected by more recent contamination, by oils, wax, sweat, bacterial plaque or patching. Sadly for me, none of the evidence of contamination bears much examination, which has tipped me in favour of a medieval provenance for the shroud.\nI have been both challenged and praised about this recently (depending on the stance of my commenter), as if my medievalist stance were in stark opposition to an authenticists one, but as Dan, Barrie and those others who follow the discussions on this and other blogs will know, the balance between the evidence in favour and the evidence against is extremely delicate. A single photo showing anomalous threads could tip me in the other direction, and a single new medieval find could tip somebody else from authenticist to medieval.\n\n","date":"October 17, 2013 at 9:42 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47764","author":"Hugh Farey","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Mr. Farey:  Thank you for the response.  It well may be that a positive judgment on the Shroud at this juncture comes down to a question of temperament and you, perhaps because of more scientific training in the relevant disciplines, are more judiciously restrained.  Fair enough.  The points you make are certainly worth considering.  It would be precipitous of me to reject what you say outright but not, I think, to place a bit less weight on it insofar as I still find the balance of the case for authenticity convincing.  My reason, at the most basic level, has to do with the confluence of what you call the circumstantial evidence.  In law it is often held that a circumstantial case can be stronger than one depending on direct evidence, eyewitness testimony for instance.  I think the same is true here.  It is not so much one thing alone as the interlocking of many independent pieces of the puzzle, the fit of the facts as much as their individual power to convince.  I said it is a matter of temperament, but perhaps a better way to put it is that the judgment boils down to one of perspective.  Some of us, and as you demonstrate not without reason, focus more closely than others.  Both perspectives may indeed be necessary.  All I would point out is that there is a pretty massive forest here as well as separate trees.\n\n","date":"October 17, 2013 at 5:09 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47813","author":"R. H. Cahall","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"According to Dr. I. Colinsberry, the so-called double blood rivulet at the small of the back or so-called blood-belt was originally the sepia chain motif of a barbecued Templar (for Dr. I. Colinsberry can tell one at first sight); a motif that extended beyond the torso and was touched up with the help of leech/leeches (for the sake of Black humour) into red blood on the dorsal body image as it appears on the Lirey Pilgrims badge. Oh, really? \nMethinks the alleged forger does think “a bit too much” like Dr. I. Colinsberry; the same black humour…\n\n","date":"October 16, 2013 at 7:55 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47698","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Is Dr. I. Colinsberry not so much afraid of hell after as before or on death?\n\n","date":"October 16, 2013 at 8:04 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47699","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Who quoted this-“There is no science for Christ”. Was it Adler or Heller? We will forever search for answers. Maybe one day Jesus himself will reappear and tell us how He did it.\n\n","date":"October 16, 2013 at 9:06 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47706","author":"Donn Reile","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Dr. Alan Adler told “Time” magazine that there was no “lab test for Christ-ness.”\n\n","date":"October 16, 2013 at 10:08 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47709","author":"Louis","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"On October 13, 2013 at 9:00 pm | #18 , leahmoana asked me: “Max, how does one become a cryptanalyst? Is there a course I can take? Online preferably. Textbooks?”\nJust practice, practice and practice: first in terms of bookcase study and solving mysteries with feedback then on your own. Roughly speaking, there are two types of coding: cognitive and optical/graphic coding. \nAN ARCHAEOPERCETIVE SOLUTION for experiencing a “sindonopareidolia-”/Shroud-like semblance- information decoding of the gridiron with small wheels and a rampant fire raging underneath (Gallia Placida Mausoleum Mosaic of Saint Lawrence, early 5th c. CE):\n.\n1/ Firstly read the relation on Saint Lawrence’s and Saint Vincent’s martyrdom\n2/ Secondly mentally relax and try to think “as a child” (in order to develop primary visualisations)\n3/ Thirdly take a substitute cloth for the Turin Shroud only showing the 4 symmetrical series of burn holes in conjunction with the 4 small somehow rounded water stains + the blood belt as seen as at the small of the TS man’s back. First fold up the long cloth four times onto itself widthwise to get a rectangle about 22cm wide x 444cm long and 5 layers; then twice onto itself lengthwise to get a shorter rectangle about 22cm wide x 222cm long and 10 layers and finally nine times onto itself lengthwise to get a square about 22cx22cm and 100 layers. Place a weight on top of it. After a length of time of about 24 hours, take off the weight and carefully unfold the folded cloth. The whole surface of the latter shall appear marked with 100 squares. Now contemplate in primary vision and in conjunction with Saint Lawrence’s or Saint Vincent’s martyrdom. You get your gridiron. Keep the mental semblance or pareidoliac part 1 in store.\n4/ Now contemplate the 4 symmetrical series of burn holes in conjunction with the 4 small somehow rounded water stains. Place the cloth flat on a slab or table 180cm long x 55cm wide so as to have the 4 L-shaped burn holes each in conjunction with a rounded water stains hang down form the four table/slab corners. Now contemplate the view of the 2 dorsal image L-shaped burn holes each in conjunction with its rounded water stain hanging down form the 2 table/slab corners. From your mental storage, get the semblance of the gridiron in. Now you get your gridiron with small wheels. Keep the composite mental semblance of pareidoliac part 2 in store.\n5/ Now contemplate the double blood rivulet at the small of the back or blood-belt in conjunction with the composite mental semblance of the gridiron with small wheels. Now you can light the rampant raging fire underneath…\n\n","date":"October 17, 2013 at 12:52 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47774","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Typos: \nNow contemplate in primary VISUALISATION and in conjunction with…\nKeep the composite mental semblance OR pareidoliac part 2 in store.\n\n","date":"October 17, 2013 at 1:09 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47776","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"More typo: AN ARCHAEOPERCEPTIVE SOLUTION\n\n","date":"October 17, 2013 at 1:21 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47778","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Addendum:  1/ Firstly read the relation on Saint Lawrence’s and Saint Vincent’s martyrdom and check their Late Antique and Medieval icongraphy.\n\n","date":"October 17, 2013 at 2:21 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47784","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Possible variant: First fold up the long cloth THREE times onto itself widthwise to get a rectangle about 28cm wide x 444cm long and FOUR layers; then twice onto itself lengthwise to get a shorter rectangle about 28cm wide x 222cm long and 8 layers and finally nine times onto itself lengthwise to get a rectangle about 28x22cm and 80 layers.\n\n","date":"October 17, 2013 at 2:54 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47785","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Then the whole surface of the latter shall appear marked with 80 rectangles (28cm x 22cm each).\n\n","date":"October 17, 2013 at 2:56 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47786","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"…still evocative of a grid and gridirion.\n\n","date":"October 17, 2013 at 2:59 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47787","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"As the gridiron grate could be placed over the camp fire or else hung from a tripod, what look like small wheels are actually rings attached to the gridiron’s legs for this purpose\n\n","date":"October 17, 2013 at 3:07 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47789","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Most likely the key to solve the enigmatic early 5th c. CE Galla Placidia St Lawrence’s/St Vincent’s mosaic lunette is the burial Shroud bloodied image now kept in Turin. Cryptologically speaking, the gridiron grate can be cryptanalysed as a Shroud-like semblance/Sindonopareidolia while the early 12th c. CE Saint Vincent Benedictine mural fresco in Berzé-la-Ville can be  decoded as a sindonosteganography in terms of TS objective data embedded into the scene of the saint’s martyrdom.\n\n","date":"October 17, 2013 at 3:57 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47794","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Last variant (the most likely all things considered): First fold up the long cloth three times onto itself widthwise to get a rectangle about 28cm wide x 444cm long and four layers; then twice onto itself lengthwise to get a shorter rectangle about 28cm wide x 222cm long and 8 layers and finally eight times onto itself lengthwise to get a square about 28x28cm and 72 layers.Then the whole surface of the latter shall appear marked with 72 squares (28cm x 28cm each).\n\n","date":"October 17, 2013 at 4:14 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47796","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"With respect to opinions to the contrary, there is absolutely no doubt whatever that the Shroud has a mountain of evidence suggesting authenticity and scant if any suggesting the opposite.  One does not have to prove a thing beyond any shadow of doubt before it is accepted.  The Shroud is there.\n\n","date":"October 17, 2013 at 9:35 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47833","author":"Andy Weiss","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"If there is ANY evidence from real science that the Shroud is not authentic, the poorly done 1988 carbon dating is not amongst that evidence.\n\n","date":"October 17, 2013 at 9:37 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47834","author":"Andy Weiss","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"In what way was it “poorly done”? The sample supplied to the three labs was dated as 13th/14th century. The relatively small spread of values is attributable to technical differences in the way the samples were cleaned, to say nothing of random statistical error. Those who go looking for a trend across the three contiguous strips are engaged in an exercise that might have been OK if the samples had been widely spaced, but they were not, and it is hardly fair to lay the blame for that at the door of the three labs. They were, to put it bluntly, fobbed of, and could only analyze what they were given.\nWhy then do we so much about “botched” tests etc, and so little about the obvious solution – which is to repeat the testing in such a way as to remove any doubts re the sampling, alleged mending with modern material or statistics? (Other reservations, e.g. regarding alleged contamination (“bioplastics” etc) are an entirely different issue that have little or nothing to do with “botched” methodology or sampling error, and which can be dealt with by combining radiocarbon re-dating with conventional chemical analysis, e.g. carbohydrate analysis).\n\n","date":"October 18, 2013 at 2:41 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47853","author":"colinsberry","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Mr. Colinsberry:\nYou seem to move between two ways of construing my use of the word “botched”.  In the first, you defend the protocols of the labs themselves as dealing correctly with what they were given.  In the second, you widen the sense to include all the protocols, or lack thereof, for selecting, gathering, and delivering the samples.  The close spread of the dates does seem to indicate that the labs in question performed their respective tasks competently.  My criticism was intended with respect to the broader way of regarding what transpired.  I do agree that the best way to proceed is to do a re-test under scrupulously sound conditions.  Absent that, however, I would still maintain that the tests are, to say the least, anything but dispositive.\n\n","date":"October 18, 2013 at 3:38 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47858","author":"R. H. Cahall","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"\nR. H. Cahall :\nMr. Colinsberry:\nYou seem to move between two ways of construing my use of the word “botched”.  In the first, you defend the protocols of the labs themselves as dealing correctly with what they were given.  In the second, you widen the sense to include all the protocols, or lack thereof, for selecting, gathering, and delivering the samples.  The close spread of the dates does seem to indicate that the labs in question performed their respective tasks competently.  My criticism was intended with respect to the broader way of regarding what transpired.  I do agree that the best way to proceed is to do a re-test under scrupulously sound conditions.  Absent that, however, I would still maintain that the tests are, to say the least, anything but dispositive.\n\nBroad agreement – at last- at least on the need to repeat the dating, but with a properly constructed, randomized sampling frame.\n I personally would like to see terms such as “botched” etc (and worse, much worse) abandoned until the data are in, seeing little to fault the conduct of the labs per se (assuming it was the Shroud’s authenticity that was supposed to be under the spotlight, not the honesty of the scientists and technicians themselves, the latter having been shamelessly impugned, in award-winning documentaries no less that peddle conspiracy theories for the gullible and over-impressionable).\n\n","date":"October 18, 2013 at 4:02 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-47861","author":"colinsberry","site":"shroudstory"},{"title":"Holding the Shroud to an impossible standard?","post":"Addenda: \nMost likely he original size of the bloodied body long burial cloth (TS) was 111x436cm not 113x444cm, present size. Hence folding shall be adapted to get about 28x27cm square folding marks all over the cloth surface.\nActually, in the Ravenna mosaic the gridiron grate leg rings (about 5cm in diameter) are about twice smaller in diameter than expected and look more like small wheels. Now the waterstains in conjunction with the 4 series of symmetrical burn-holes on the TS, are about 5cm in diameter. This is both a spy clue and a derhyming pattern in the composition.\n\n","date":"October 19, 2013 at 10:15 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","id":"comment-48026","author":"Max Patrick Hamon","site":"shroudstory"}]
