[{"title":"Identifying old blood one corpuscle at a time","post":"The saga of the iceman is an interesting case study in molecular forensics.  \nThere are some obvious differences: a fairly well-preserved body vs. a cloth that is thought to have once covered a body, but I think there is some applicability, particularly in regards to the methods and technological advances.  Since the original STURP investigation in 1978, the field of nanotechnology has continued to grow, allowing studies to be conducted with greater sensitivity and much more detail.  \nFor the Iceman, sufficient intact DNA was available from the iceman for full genomic sequencing.  These studies showed he was O-type blood, Rh positive; also, some other interesting characteristics (carrier of lyme disease, lactose intolerant, and had brown eyes).  The images of the preserved red blood cells, and their detail, are quite remarkable.  These were performed on sections taken from punch biopsies of the wound area using atomic force microscopy.  In addition to microscopic data, some Raman spectra studies were shown in the paper, indicating the presence of fibrin.\nWith the Shroud, one is dealing with bloodstains, not an actual wound or biopsy samples, but I think there’s applicability here.  Baima-Bollone described what appeared to be red blood cells on bloodstained fibers of the Shroud using electron microscopy (Sindon Vol. 33 (1984); 9-14; also in the book, Sindon O No, Eds. Torino, IT (1990).  Red blood cells have been reported previously in mummies using microscopy (Science 108, 303-304 (1973), Science 192, 374-375 (1976), and on prehistoric rock tools (Science 220, 1269-1270 (1983), although not with the clarity available in the Iceman studies.\nIn bloodstains, as blood dries red blood cells dehydrate, similar to a tire going flat.  What is most likely being visualized in such samples are aged blood cells that have resealed with each other during the preparation procedure, representing reconstituted cells, not intact red blood cells that have survived over large periods of time.  Because of their distinct biconcave, disc-like shape, red blood cells may be identified microscopically with relative confidence.  The new Iceman studies help to take this to another level.\n\n","date":"May 3, 2012 at 5:59 am","url":"https://shroudstory.com/2012/05/03/identifying-old-blood-one-corpuscle-at-a-time/","cat":"blood_studies","id":"comment-11086","author":"Kelly Kearse","site":"shroudstory"}]
