[{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"Tabor is well-known in the field, writes well, and most of what he says is part of his personal quest. There is a good review of his book by James Strange, available on the internet.\n\n","date":"October 8, 2012 at 9:22 am","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17330","author":"Louis","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"Tabor is a fringe theorist who makes money and prestige for himself by pushing his controversial theories on a heartbreakingly ill-informed populace. The fact that he has hitched his intellectual wagon to Jacobovici really should help us to decide if he is qualified to call other scholars’ ideas into question.\n\n","date":"October 8, 2012 at 1:54 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17335","author":"bill","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"Tabor is a fringe theorist who makes money and prestige for himself by pushing his pet controversial theories on a heartbreakingly ill-informed populace. The fact that he has hitched his his intellectual wagon to Jacobovici really should help us decide if he is qualified to call other scholars ideas into question.\n\n","date":"October 8, 2012 at 1:55 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17336","author":"royalcanadian2011","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"James Tabor’s latest book was completely taken apart in March especially by the American Schools of Oriental Research (ASOR) website. In the ensuing discussion he was shown pretty convincingly to have doctored his photos to fit his thesis that he had found the first Christian tomb. Do not touch.\n\n","date":"October 9, 2012 at 1:30 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17374","author":"Charles Freeman","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"The Book is The Jesus Discovery (Simon and Schuster, 2012)  and here is one extract from a review reproduced on the ASOR blog by Eric Meyers of Duke University. Tabor’s main argument was that he had ‘seen’ a fish on an ossuary which mainstream scholars had seen an amphora!  He eventually became the subject of much ribaldry when some of his less reverent critics began seeing all kinds of things in the photos he reproduced. My own feeling is that he has landed himself in complete ridicule although, as always in these cases, he still has credulous admirers. Go to the ASOR website, access the blog and search James Tabor for a fuller assessment by the leading scholars.\n‘The book is truly much ado about nothing and is a sensationalist presentation of data that are familiar to anyone with knowledge of first-century Jerusalem. Nothing in the book “revolutionizes our understanding of Jesus or early Christianity” as the authors and publisher claim, and we may regard this book as yet another in a long list of presentations that misuse not only the Bible but also archaeology. The image in the book (on page 91, fig.30) is very washed out, and any fish imagery is hardly identifiable let alone  as that of a fish spewing out a human [Jonah claims Tabor]. In fact, the image in the book is so poorly reproduced in my copy that one suspects it has been intentionally altered so that no one could see what the the image really is.’\n\n","date":"October 9, 2012 at 1:45 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17375","author":"Charles Freeman","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"I think RoyalCanadian/Bill summed it up pretty well with this statement; “The fact that he has hitched his intellectual wagon to Jacobovici really should help us decide if he is qualified to call other scholars ideas into question.” …or to be taken seriously at all I would add, as Jacobovici is a total joke.\nAs to Tabor’s insistence that he sees a ‘fish’ on the ossuary; It is simply unbelievable! I have viewed a documentary where they totally rip Tabor’s theory apart; For one they show several other first century ossuaries found in tombs in the vacinity of Jerusalem, and these have cleary ‘amphora’ etched on them. When I see the ‘fish’, I see relatively the same amphora as shown on the other ossuaries, I just can’t understand how one can make such a mistake? Anyways, main point is I am wondering about Mr. Tabor’s credibility; If Mr. Tabor, as I would assume, would have some experience in first century tombs and ossuaries, then he would be quite aware of the amphora designs found on many ossuaries previous to this find….So how can he honestly mistake this one as a fish?\nR\n\n","date":"October 9, 2012 at 4:21 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17381","author":"Ron","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"Charles, yes, Tabor was accused of showing “photoshopped” images to suit his theory and his working together with Jacobovici will only make matters worse for both. They are not bad fellows but do not seem to have learnt from mistakes. Ted Koppel (Discovery Channel) took the “Jesus Family Tomb” apart in the second documentary, where both were present, and it seems he was forced to do so due to pressure from the top biblical scholars and archaeologists. It is obvious that their “archaeology” is tailor-made to suit their worldviews.\n\n","date":"October 9, 2012 at 5:37 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17384","author":"Louis","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"Some news, not exactly anything to do with the book, but within the context of those archaeological “finds”;\nThe Harvard Theological Review has decided that it will no longer publish the paper by Karen King on the “Jesus’ wife” papyrus in January 2013. They have apparently decided to wait. As commented around a month ago by this author, it would have been more prudent to look before leaping.\n\n","date":"October 18, 2012 at 9:18 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17840","author":"Louis","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"Further to the above comments, it seems that Smithsonian has also delayed its documentary on the papyrus. It is written all over the walls that the hesitation of both the HTR and Smithsonian derives from the fact that most scholars have judged it to be  something like a “clumsy counterfeit”. \nWhy just one tiny fragment, with no context, and therefore no narrative? The author, or the person who did the “patchwork,” was obviously well-versed in gnosticism and copied the style seen in “The Gospel of Thomas”, where there are only loose sayings.\n\n","date":"October 19, 2012 at 7:21 am","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17862","author":"Louis","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"In the past I have read some very strange speculations (source = “The Marian Conspiracy: The Hidden Truth About the Holy Grail, the Real Father of Christ and the Tomb of the virgin Mary” by by Graham Phillips, etc.).\nSo …\nWhere are the remains by Antipater ?\nReference :\nhttp://en.wikipedia.org/wiki/Antipater_(son_of_Herod_the_Great)\n>Antipater II (ca. 46 BC – 4 BC) was Herod the Great’s first-born son, his only child by his first wife Doris. He was named after his paternal grandfather Antipater the Idumaean. He and his mother were exiled after Herod divorced her between 43 BC and 40 BC …\n— —\nSee also the book :\nHerodian Messiah: Case For Jesus As Grandson of Herod\nby\nJoseph Raymond …\nWhat is the true proof about the presumed shocking theory, that Jesus was the grandson of both Herod the Great and the last Hasmonean king ?\n— —\nIs it possible to find the DNA by Antipater ?\nWhere is the system to discover the useful DNA remains ?\nRegards\n\n","date":"October 19, 2012 at 10:45 am","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17869","author":"Piero","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"This is rubbish that has to be ignored.\n\n","date":"October 20, 2012 at 1:10 am","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-17911","author":"Louis","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"I believe in Jesus, so I can agree with your (hasty) reply.\nBut if you want to do a great genetic research you can try to search what you are able to show …\nDo you agree ?\nSo …\nWhat is rubbish ?\nIs the strange question of the Antipater’s remains ?\n… and …\nWhere are the presumed bones of Antipater ?\n… or …\nWhere are the other bones, those of the soldier Panthera ?\n\n","date":"October 30, 2012 at 10:20 am","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-18591","author":"Piero","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"Tabor may be onto something concrete, but it needs the critical test of time and the critique of his peers.  He does operate in the area of probability and needs more evidence to convince us.  His claim that Paul “invented” Baptism and the Eucharist should almost be considered heresy.\nBut then again,……………..????????????\n\n","date":"November 1, 2013 at 8:19 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-49493","author":"Cliff","site":"shroudstory"},{"title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes","post":"\nCliff :\nTabor may be onto something concrete, but it needs the critical test of time and the critique of his peers.  He does operate in the area of probability and needs more evidence to convince us.  His claim that Paul “invented” Baptism and the Eucharist should almost be considered heresy.\nBut then again,……………..????????????\n\nCliff, saw your recent comment & (re)read the main post-the boldface phrase caught my eye: “the Shroud of Turin had strangely showed neither X nor Y chromosomes, indicating that Jesus was somehow human, but without normal human blood like the rest of us with two human parents.” \n“Strangely showed neither”…this appears misleading: it is phrased to sound as though the presence of X & Y chromosomes was looked for, but not detected.  \nAs far as I am aware, here is what has been reported: Garza-Valdes described (in a book) that portions of both X & Y sequences present on bloodstained threads from the Shroud.\nCanale and coworkers reported (in a Shroud journal) that they found male DNA with traces of female DNA present on bloodstained threads, with male DNA more abundant; further examination of the samples showed that multiple forms of other, unrelated genes were present, more than could be accounted for by one individual.     \nThat being said, I’ve written before about (what are, in my opinion) over-generalizations about the DNA on the Shroud.  In my judgement, the sex typing of the blood also falls into this category: the data that exists is extremely limited.  In my opinion, a scientific panel or journal would not accept the conclusions based on such results.  The heterogeneity must be addressed.  The reproducibility is an unknown.  The conclusions at this stage are much too preliminary.  \n“Strangely, showed neither?”  This is at the other end of the extreme.  When scientific results become elasticized and stretched beyond what can be conclusively determined from the data, it can quickly become like the party game where you whisper something in the first person’s ear and compare the end result five minutes later.  These issues take on a life on their own-it is always best to stay within the context of the original scientific data-it is unclear to me where this particular line of reasoning (strangely showed neither) is coming from.\n\n","date":"November 2, 2013 at 5:09 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","id":"comment-49635","author":"Kelly Kearse","site":"shroudstory"}]
