[{"title":"John Klotz:  If not HIM, who?","post":"Arnaud Aaron Upinsky has been arguing for years, that thanks to epistemology one can conclude the shroud is the burial cloth Christ.\nHe followed a step by step process in his book :\n1/ artist : no\n2/ forger : no\n3/ historical Jesus : yes\n4/ Jesus of the Gospels : yes\nParadoxally, his main argument for the last point, as far as i can remenber, is not the image and its “miraculous formation” but undisturbed bloodstains/flax fibers.\nHere is his website (French) :\n http://linceuldeturin.info/html/demonstration.html\nIt is not hard science, but is epistemology science ? At least it is more complex than probability.\n\n","date":"March 6, 2013 at 11:05 am","url":"https://shroudstory.com/2013/03/06/john-klotz-if-not-him-who/","cat":"blood_studies","id":"comment-26609","author":"anoxie","site":"shroudstory"},{"title":"John Klotz:  If not HIM, who?","post":"My odds are 75% in favour of authenticity but my 25% of doubt is partially and among other things, because of these celebrations that have been taking place -and still take place- since early Middle Ages in Easter, at least in Spain in not more regions of Europe. The Spanish brought them along with Catholicism to the Philippines in the XVIth century.\nThousands of men have gone through these Easter celebrations in which special emphasis is put in replicating as close as possible all the details we read in the Gospels.  I guess that the more we move back in time, the more realistic and painful these representations must have been. And most likely, in many occasions someone would die due to the realism of the representation.\nThe objective was (and still is) to replicate as faithfully as possible, the details gathered in the Gospels and this includes crucifixion, scourging, and wrapping the body in a linen cloth. Perhaps, at some time in the past also a spear wound.\nAfter all, if the image formation mechanism was 100% natural, as many support in this blog with solid arguments, (Maillard or other) it would have also worked in the Middle Ages with someone tortured in the frame of an Easter celebration.\nIf not him, who? With the aim of being controversial, the answer could perhaps be:”an anonymous man in medieval Spain”.","date":"March 6, 2013 at 2:43 pm","url":"https://shroudstory.com/2013/03/06/john-klotz-if-not-him-who/","cat":"blood_studies","id":"comment-26626","author":"Gabriel","site":"shroudstory"},{"title":"John Klotz:  If not HIM, who?","post":"” I guess that the more we move back in time, the more realistic and painful these representations must have been”\nYou guess.\nBut first, i don’t think the shroud is medieval. Do you ?\n\n","date":"March 6, 2013 at 3:18 pm","url":"https://shroudstory.com/2013/03/06/john-klotz-if-not-him-who/","cat":"blood_studies","id":"comment-26629","author":"anoxie","site":"shroudstory"},{"title":"John Klotz:  If not HIM, who?","post":"What I find quite remarkable about this and several other videos showing ‘real’ crucifixions (usually in the Philippines) is the almost total lack of blood flow from the nail wounds. Although I dare say these people bled quite badly when the nails were removed, I wonder how much would have come out if they had been dead for a couple of hours. There are also videos of flagellants. Although they do not use Roman flagra, their backs are a mass of blood, rather than delicately pocked like the shroud. Quite thought provoking.\n\n","date":"March 6, 2013 at 3:37 pm","url":"https://shroudstory.com/2013/03/06/john-klotz-if-not-him-who/","cat":"blood_studies","id":"comment-26630","author":"Hugh Farey","site":"shroudstory"},{"title":"John Klotz:  If not HIM, who?","post":"What is funny in the question of M. Klotz is the fact that I ended up my recent paper concerning the evidence of the bloodstains (http://shroud.com/pdfs/n76part5.pdf) with almost the same words!\nIf you read again my paper, you’ll noticed that I described 4 different scenarios that I think are still plausible to explain the Shroud and 2 of them imply that another crucified corpse had been covered with that cloth. \nAfter an honest and long reflection on the subject, I came out of this convinced that it is most probably the Shroud of Jesus of Nazareth with a 99% confidence. \nIn fact, I completely reject the second scenario involving an accidental resemblance between an unknown crucified man and the Jesus of the Gospel for a number of good reasons that would be too long to describe here.  But I can at least mention the most important reason in my mind, which is the conjecture created by the fact that this man was very severely scourged (most certainly much more harder than what was done prior to a standard Roman crucifixion), that he was forced to wear a sort of cap of thorny objects, that he was stab to the side after death, that he didn’t had his legs broken, that his corpse was only in contact with the cloth for less than 72 hours and that his bloodstained burial cloth was kept and preserved to this day.\nAnd concerning the first scenario involving a “natural” forgery that would have been done with the use of a real crucified corpse, even though such a scenario seems to offer a better probability than the previous one, it still end up very far from the other 2 scenarios I described that involved the real Shroud of Jesus.  Why?  Among other things, because of the very heavy scourging that was done to the victim that would have been used by the forger to create his false relic of the Passion of Christ.  Almost every medical experts who have studied the Shroud agree to say that the scourging endured by the Shroud man was so intense that it could have kill him before he could reach the place of crucifixion.  Once you understand this most important medical fact, you have to conclude that no forger in the world would have dared to perform such a severe scourging that could have killed his victim before he could nail him on the cross.  This is pure logical thinking!  After all, nowhere in the Gospels, there is a description of the severity of the scourging and most evidently, the main focus of the forger would have been elsewhere, i.e. to reproduce the stigmata of the crucifixion of Christ.  Because of this and because of some other things, I personally evaluate the chances for such a natural forgery scenario to really be able to explain the Shroud at less than 1%.\nAnd that’s it!  Beside these 2 alternative scenarios I described in my paper, I honestly don’t see any other plausible scenario that can explain the Shroud and that would involve another person than Jesus of Nazareth.  Remember that no matter what Colin Berry or Joe Nickell can thing, all the artistic forgery scenarios have been completely discarded by science since a very long time now…\n\n","date":"March 6, 2013 at 4:58 pm","url":"https://shroudstory.com/2013/03/06/john-klotz-if-not-him-who/","cat":"blood_studies","id":"comment-26648","author":"Yannick Clément","site":"shroudstory"},{"title":"John Klotz:  If not HIM, who?","post":"Enough of the Joescolin Berrynickell arrognorant Show allegedly in the name of ‘science’!\n\n","date":"March 6, 2013 at 6:39 pm","url":"https://shroudstory.com/2013/03/06/john-klotz-if-not-him-who/","cat":"blood_studies","id":"comment-26671","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"John Klotz:  If not HIM, who?","post":"If at least these skeptics could focus on the 2 possible scenarios involving another crucified man than Jesus that I described in my paper about the bloodstains instead of keeping to promote their non sense artistic “theories”, which have been discarded by science long ago, then we could start an intelligent debate…\n\n","date":"March 7, 2013 at 9:31 am","url":"https://shroudstory.com/2013/03/06/john-klotz-if-not-him-who/","cat":"blood_studies","id":"comment-26719","author":"Yannick Clément","site":"shroudstory"}]
