[{"title":"Let’s take a closer look at one of the peculiar blood stains on the Shroud – the one in the hair shaped like a question mark","post":"Thanks for your comment on this 5 year old posting Mark (better late than never!).\nEven now, I try to think as little as possible about the Shroud blood (or should that be “blood”?), being a ‘body image’ man.\nYup, even now, nothing about the blood seems to make sense!\n","date":"October 30, 2017 at 9:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/03/lets-take-a-closer-look-at-one-of-the-peculiar-blood-stains-on-the-shroud-the-one-in-the-hair-shaped-like-a-question-mark/","cat":"blood_stain","id":"comment-10199","author":"Colin Berry","site":"colinberry"},{"title":"Let’s take a closer look at one of the peculiar blood stains on the Shroud – the one in the hair shaped like a question mark","post":"PS:I was asked recently to comment (via email) on the pdf by Prof. G.Lucotte of Paris (BSTS Newsletter No.85, June 2017).\nhttp://www.shroud.com/pdfs/n85part3.pdf\nHe and his fellow analysts were given a sticky tape sample from a bloodstain on the eyebrow, just below the ‘reversed 3’ /epsilon stain. Most of it was red/yellow/brown in colour, “like all other bloodstains on the Shroud” . But, shock horror,  it did not analyse as blood, or components thereof, but as “yellow-red clays” (iron-containing aluminosilicates)!\nIf that is the case, then it’s now possible finally at long last to combine the blood and body image into a single narrative with the simulated sweat imprint model. How?\nWell, it’s admittedly a long shot at present, but here we go. The following is based on the fact that  (a) clays are stable to heat (b) can be imprinted onto the linen first, before the flour.\nAre you sitting comfortably? Then I shall begin. \nThe flour was sprinkled onto the oil-smeared subject(s) first. A gooey slurry of fine clay (“blood”)  – selected for its redness – was then trickled onto the flour-coated subject, and wet linen pressed on top. The clay- before- flour imprinted linen was then exposed to the open charcoal fire, giving the apparent dual  two-tone “blood/sweat”- imprinted Shroud. \nGradually with time, some of the clay particles detached, leaving odd unsightly paler patches. Along came a Shroud custodian with a new blood substitute and paintbrush or dabber, probably containing at least some real blood, though lacking intact or recognizable red blood corpuscles (mushed-up medicinal, i.e. blood-sucking leeches?)  and did some touching up. Result: today we have hybrid bloodstains, which give positive tests for porphyrins, albeit with atypical spectra (Adler and Heller) or yellow-red clays, or both. We then have an explanation for why the bloodstains are variously described as having a “peculiar” colour (STURP observer, 1978) or “too red” (Adler and Heller) when seen under the microscope on a well-illuminated stage.\nYou can wake up now. I’ve said what I wanted to say…\nPS: As recent as a year or two ago, I might have wasted no time in modelling the latest idea, in this instance testing out a clay slurry as Mark 1, 14th century ” blood”.\n Not any more – announcing the idea and leaving it at that will now have to suffice. That’s my considered response to the casual indifference of sindonology to experimental modelling – like the scores, possibly hundred of my experiments reported here  on this and other sites, deploying white flour to model a 14th century SIMULATED sweat imprint that have never received the slightest mention… So why bother with the icing on the cake – fine clay to simulate the ancient blood?\n There’s nothing quite so closed as the collective made-up mind of sindonology’s authenticity-promoting clique, forever recycling its fond illusions and facile mantras.\n(I may do the experiment to further my own education, but shall waste no further time in reporting the outcome to those deaf ears/closed minds).\n","date":"October 31, 2017 at 9:24 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/03/lets-take-a-closer-look-at-one-of-the-peculiar-blood-stains-on-the-shroud-the-one-in-the-hair-shaped-like-a-question-mark/","cat":"blood_stain","id":"comment-10203","author":"Colin Berry","site":"colinberry"},{"title":"Let’s take a closer look at one of the peculiar blood stains on the Shroud – the one in the hair shaped like a question mark","post":"Your implicit assumption is that whatever mechanism produced the image would have been effected by the presence of blood on the cloth. Since we do not know with certainty what mechanism produced the image, it may be possible that blood could still have been their prior to image formation.\n","date":"October 30, 2017 at 7:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/03/lets-take-a-closer-look-at-one-of-the-peculiar-blood-stains-on-the-shroud-the-one-in-the-hair-shaped-like-a-question-mark/","cat":"blood_stain","id":"comment-10197","author":"Mark Anthony Rivera","site":"colinberry"},{"title":"Let’s take a closer look at one of the peculiar blood stains on the Shroud – the one in the hair shaped like a question mark","post":"I still disagree with your ultimate conclusions, but your observations and explanations thereof are really fascinating. I’m catching up on this blog with ever-increasing absorption.\n","date":"October 10, 2012 at 9:30 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/03/lets-take-a-closer-look-at-one-of-the-peculiar-blood-stains-on-the-shroud-the-one-in-the-hair-shaped-like-a-question-mark/","cat":"blood_stain","id":"comment-920","author":"Hugh Farey","site":"colinberry"}]
