[{"title":"Let’s Talk Red Blood: Bilirubin, Saponaria officinalis and UV","post":"Dan: I have to say that I’m not the greatest fan of WordPress, which denies me the option of posting under “Anonymous” (as would Google’s Blogger) as and when I feel the need to sound off about this or that abuse of science.  There’s an awful lot of anti-science sentiment about these days, although much of it is largely self-inflicted where the Shroud is concerned –  with headline-seeking pop scientists being largely responsible .\nBut  it’s the same Google that hoovers up the titles that folk choose for their responses, like “Sciencebod – do some homework etc”) which then go onto Page 1 of anyone googling one’s username, which the trolls – that one picks up like fleas – are quick to spot and exploit.\nYup, I may offer a comment from time to time, Dan – especially as I think that the Shroud-fest is being fed by bad science, the recent Italian silliness re ultraviolet lasers being a case in point. That kind of thing  simply serves to feed the abysmal understanding on the internet as to how real  conference-presentation,  peer-reviewed,science operates in the real world.. \nSo don’t take it personally if I suddenly disengage for days or weeks at a time if  -or when – the sniping starts up again, as indeed it will…  Don’t feed the trolls is the best motto – even when they artfully accuse one of being the troll (a favourite tactic of theirs)…\n\n","date":"January 10, 2012 at 3:11 pm","url":"https://shroudstory.com/2012/01/10/lets-talk-red-blood-bilirubin-saponaria-officinalis-and-uv/","cat":"news_&_views","id":"comment-6783","author":"sciencebod","site":"shroudstory"},{"title":"Let’s Talk Red Blood: Bilirubin, Saponaria officinalis and UV","post":"“Don’t feed the trolls” \nThe chutzpah! LOL\n\n","date":"January 10, 2012 at 6:22 pm","url":"https://shroudstory.com/2012/01/10/lets-talk-red-blood-bilirubin-saponaria-officinalis-and-uv/","cat":"news_&_views","id":"comment-6793","author":"trof4st","site":"shroudstory"},{"title":"Let’s Talk Red Blood: Bilirubin, Saponaria officinalis and UV","post":"Dan you wrote: “I have lamented the fact that today there are insufficient, qualified, scientifically-minded skeptics of the shroud.” On this blog I myself have also lamented the fact there are no qualified archaeologically-and-analytically-minded sceptics of the Shroud TO HEAR ME.\n\n","date":"January 20, 2012 at 9:35 am","url":"https://shroudstory.com/2012/01/10/lets-talk-red-blood-bilirubin-saponaria-officinalis-and-uv/","cat":"news_&_views","id":"comment-7225","author":"Max Patrick Hamon","site":"shroudstory"}]
