[{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Wow, interesting.  Thanks Kelly and Dan.\n\n","date":"November 25, 2012 at 11:04 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19488","author":"Andy Weiss","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Indeed this is interesting, BUT I HAVE SOMETHING MORE URGENT. PLEASE WATCH “THE LOST TOMB OF JESUS”.  This video has far far implications for Christianity.\n\n","date":"November 26, 2012 at 3:22 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19509","author":"Senior110","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"It was about time a Kelly Kearse of this world got involve in the Shroud world to set the record straight concerning everything that touch the blood issue concerning that authentic archaeological artefact of a real crucified man…  The only FACT that most blood and serum stains on that cloth really came from exudates of humid blood clots make it a scientific FACT that we’re very far from an artistic forgery made with a scorch or some other artistic technique.  Sorry Thibault…  I needed to say that.\nNow that the Shroud world is happy (and lucky) to have a Kelly Kearse for everything touching the blood issue, don’t you agree with me that it would be EXTRAORDINARY if the Shroud world could also find a true expert like him for everything touching the body image issue ?  An expert who, in my mind, SHOULD BE a CSI type of person who would be a true expert in biochemistry.  \nIt amazes me each time to note that there never was a true biochemist expert involved in Shroud research…  We got some chemists, some physicists, some forensic experts, etc., but no real biochemist !  It’s hard to believe because the most probable hypothesis concerning the formation of the image that is on that cloth involve some kind of biological interraction between the Shroud and the crucified corpse who once was lying inside it…  Some kind of biological interraction that still wait to be determined in detail and in my mind, this will only happened when a real biochemist will get involve in Shroud research, the way M. Kearse is doing.  \nAs a true chemist expert (but not in biochemistry), we can say that Ray Rogers was the closest guy to fit in that category.  Now it’s about time that the Shroud world find a real top-notch biochemist to take over Rogers work and push it further.\n\n","date":"November 25, 2012 at 5:58 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19500","author":"Yannick Clément","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Andy, Yannick, Thank you for the very kind words.  Yannick, might be a bit of hyperbole concerning me there, but thank you :)\nTHE LOST TOMB OF JESUS-for me, a one time viewing will suffice.  Apart from other issues that could be mentioned regarding the inscriptions/validity of this documentary, by numerous others, I’ll stay on topic here and comment on what the DNA “evidence” shows.\nOkay, that’s about it…should I repeat it again?\nForgive me for being so flippant, but in my opinion this documentary is yet another example of hyperbole and sensationalism using the DNA carrot to entice interest.\nHere is the bottom line:\n1. There is no DNA profile of Jesus on record to compare any findings to-scientifically, you have to take it past engravings on a box.\n2. The “evidence” shows that mitochondrial DNA isolated from the remains of two individuals at this site are not identical.  Scientifically this shows they did not have the same mother (or grandmother).  That’s it…nothing more, nothing less.  \nWhat the relationships of these two individuals are, who else they might be related to, who they might be, etc. is total speculation, completely removed from the laboratory.  \nThe anecdotal argument is made that these two individuals must have been married since they weren’t genetically related to each other.  Certain (first) cousins would not show the same mitochondrial DNA pattern either (mitochondrial DNA is inherited from the mother only), but would still be considered family members in most societies.\nI agree, the implications are big, but scientifically, the lack of evidence is even bigger-it’s just not there.\n\n","date":"November 26, 2012 at 7:28 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19510","author":"Kelly Kearse","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"You’re welcome Kelly.  Don’t you know some expert in biochemistry who could be interested to do some researches on the Shroud ? ;-)\n\n","date":"November 26, 2012 at 11:35 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19516","author":"Yannick Clément","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"It’s wonderful having a person of Kelly’s standing on board to give us authoritative info and dispel the various myths concerning blood groups, DNA etc.  I haven’t seen the doco  LOST TOMB OF JESUS, but presume it refers to the Talpiot tomb, on which there has already been much comment on this site.  I’ve made the point before that adoption was very common throughout the ancient world as high mortality rates resulted in prevalance of orphans.  Under both Jewish and Roman Law adoption gave the same rights as birth.  J P Meier in “A Marginal Jew” is insistent from the Greek word used in Mark’s gospel that the “brothers and sisters” of Jesus were precisely that, not half-brothers or cousins as Jerome and other 4th century doctors of the church would have it.  The 4th century doctrine of.Mary’s perpetual viginity is still viable   if said brothers and sisters were adoptees.  It could provide another explanation of why family members in any such tomb, regardless of whether its in Talpiot or elsewhere, would not share the same DNA.  Pellegrino, one of the Talpiot authors is on record as saying that no evidence of human remains were found in the so-called Jesus ossuary, except a small carpal bone, but there were cloth fragments.  Pellegrino was hopeful of making some scientific comparisons with the Shroud cloth, but I believe nothing ever came of it.  Another wasted opportunity!\n\n","date":"November 26, 2012 at 2:59 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19521","author":"daveb of wellington nz","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Dave wrote : J P Meier in “A Marginal Jew” is insistent from the Greek word used in Mark’s gospel that the “brothers and sisters” of Jesus were precisely that, not half-brothers or cousins as Jerome and other 4th century doctors of the church would have it.\nI AGREE TOTALLY WITH MEIER AND THERE GOES THE FAIRY TALE CONCERNING THE VIRGIN MARY (including the virginal birth and all the other tales related to it) !  Someone just have to know a little bit of history to understand that this tale was introduced in the Gospels to makes counterweights to other similar tales from Pagan religions, whether it be in Egypt, in Mesopotamia or elsewhere during Antiquity.  And then, the Byzantine Church got really over their head by making Mary (who was certainly a Saint Lady) the Christian version of the Greco-Roman Goddesses, evidently in the goal to convert the Pagans more easily…  All this is pretty evident for someone who knows history just a bit.\nJesus was a real man and the Incarnation is not a joke as we can see on the Shroud and as a Catholic, I have absolutely no problem at all to accept that Mary and Joseph (the great forgotten man of the bible) conceived Jesus just like any other human being, even though he really had a divine nature too.  This fairy tale concerning the virginal birth and the perpetual virginity of Mary had a desastrous impact on how Christians over the history have seen the sexuality…  Desastrous.  Here in Quebec, up until Vatican II, there were crazy priests who made believe to women that it was a sin to have sexual relation with their husbands if it was in any other goal than to have children !  WHAT A MESS IT WAS.  \nIn fact, in Quebec during those days (the days of my grand-parents), the Catholic religion was a complete religion of fear and shame (very close to the Jewish religion of fear and shame of the Old Testament) while it should have been the most beautiful religion of love and mercy !  It was the complete opposite of the truth that Jesus bring us in his teaching and particularly in his Passion, death and Resurrection.  Look at the Shroud man and tell me that this guy is someone who brought judgement, fear and shame to humankind instead of love and mercy !  I’m so glad that this sick religion is almost completely dead here in Quebec because this is not the kind of religion I would want to be part of, simply because it didn’t represent the God of Love that I have experimented inside of me and that I can recognized on the Shroud of Turin…\n\n","date":"November 26, 2012 at 4:49 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19524","author":"Yannick Clément","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Yannick, there’s already a Catholic Church that has been around for nearly two thousand years. You’ll have to give your cult another name other than “Catholic”.\n\n","date":"November 27, 2012 at 11:53 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19544","author":"ChrisB","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Effectively, I am more Christian in the general sense than Catholic.  The one I follow is named Jesus of Nazareth, not his mommy.  I still go to Catholic mass because it does good for me but I surely don’t follow blindly everything’s coming from Rome.  Anyway, to me, the Catholic religion is the closest (along with the Anglicans) who is the closest to the original message of love and mercy of Jesus.  That’s why I stay inside.\n\n","date":"November 27, 2012 at 4:06 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19555","author":"Yannick Clément","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Effectively, I am more Christian in the general sense than Catholic. The one I follow is named Jesus of Nazareth, not his mommy. I still go to Catholic mass because it does good for me but I surely don’t follow blindly everything’s coming from Rome. Anyway, to me, the Catholic religion is the closest (along with the Anglicans) to the original message of love and mercy of Jesus. That’s why I stay inside.\n\n","date":"November 27, 2012 at 4:07 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19556","author":"Yannick Clément","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"I’ve forgotten to add this: I’m a FREE man versus the Catholic religion just like Jesus was versus the Jewish religion of his time.  Read again the Gospels if you don’t believe me.  I think this is very healthy and truly Christian to be able to criticize and question things that don’t fit with your own conscience.  That’s what Jesus did and that’s what I always try to do.  It’s not always easy, but at least, I try.  One thing’s for sure, just like Jesus, I’m not a blind sheep who follow the herd !  I just hope I won’t end up on a cross.  Nevertheless, I have already been “crucified” a lot on this blog which indicates that I’m a true free thinker…  Effectively, it’s only when you don’t say like the mass that you receive some hits.\n\n","date":"November 27, 2012 at 4:39 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19558","author":"Yannick Clément","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"little mistake again: of course, you should read “follow the masses”.\n\n","date":"November 27, 2012 at 4:41 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19559","author":"Yannick Clément","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"I can understand where Yannick is coming from, but there’s not many Catholics throughout what remains of Christendom prepared to go that far.  In order to deny the virginal birth, Yannick has to deny the doctrinal truths contained in both Matthew’s and Luke’s infancy narratives.  The great German philosopher Hegel observed that all historical movements seemed to go through a threefold process of action, reaction and integration, or as is often expressed: thesis, antithesis, synthesis.  It seems that Quebecois Catholics are going through the second stage of this process, in a similar way that the British reacted against the strait jacket of Victorianism.  A similar situation prevailed in Ireland, and now with all their covering up of abuse cases, the Irish hierarchy have lost any authority they once had.  Such reactions can never be the final answer. The truth has to be distilled in a valid synthesis over a period of time. \nThe doctrine of Mary’s PERPETUAL virginity seems to have arisen in the fourth century, and as Yannick says, it may well have served a very useful purpose in converting pagans to Christianity.  That has to have been a good result.  Nevertheless the fact remains that adoption was very common in ancient times and Mary & Joseph seem to have been the type of generous people who may well have practised adoption.  There are even examples today of childless families practising large-scale adoption.  Augustus Caesar owed his imperial role solely due to adoption, and other emperors likewise. \nEven by the evangelists using the Greek word “adelphos” in preference to “anepsios”, it still cannot be categorically asserted that Jesus’ kin were connected by blood, especially in view of these common adoptive practices, J P Meier notwithstanding.\n\n","date":"November 27, 2012 at 6:29 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19537","author":"daveb of wellington nz","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"A follow up comment just to clarify my previous comment, which made mention of the word “cousins”.    \nIn the aborementioned documentary, they conclude that because the two individuals didn’t share the same mitochondrial DNA & were in a familial tomb, they must have been man & wife.  The example of a cousin was simply to point out how certain family members could be related and not share the same mitochondrial DNA.  Two complete strangers wouldn’t share the same mitochondrial DNA either, but it doesn’t mean they are married.  According to the reasoning of the documentary, they would/could be.\nThere is zero DNA evidence that the remains found in the box have anything to do with Jesus or any members of his family. Zero.  The samples tested showed that the two individuals did not share the same mother (or grandmother).  Any inferences/conclusions past this regarding true brothers/sisters versus cousins were not intended. \nRegarding the virgin birth, how this would happen scientifically is an interesting question.  There are numerous scenarios that have been suggested, including some that seem to stretch the imagination: that Jesus was haploid (having half the normal amount of chromosomes + an additional Y chromosome) or that Mary was underwent a type of parthenogenesis (development of an embryo from an unfertilized egg).  Others, as previously posted, suggest a more natural solution. \nWhether one chooses to believe in a supernatural virgin birth in the case of Jesus, is of course a personal choice.  I myself, have never had a problem believing in a virgin birth.  How a virgin birth might have happened is beyond me-that’s where faith would come in.  If you believe God created the universe and all that’s in it, then, (for me) it’s not so difficult to believe He might have a few other tricks up His sleeve.  If we knew how everything worked, life would be pretty dull.     \nFinally, in closing, it seems fitting to mention that cloning of a man would, in essence, be a virgin birth: in this case, man creating man.\n\n","date":"November 27, 2012 at 12:19 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19545","author":"Kelly Kearse","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"I agree with you M. Kearse about the freedom of choice we have as a Christian to believe in the virginal birth of not.  And for the few materialistic possible explanations you gave us, I think we don’t have to go that far with our imagination.  On the contrary, we just have to know a bit of ancient history to know that it was common during Antiquity to see the hero being born of a virgin and I (and most of the modern biblical scholars) think that this is the main reason why Luke and Matthew introduced this fairy tale in their gospels.  This and also the inconceavable idea for a Jew that God could incarnate himself through natural sexuality…  And as I said, all these ideas linked with the virginal birth and the perpetual virginity of Mary had a disastrous effect on human sexuality until this day and it’s a SHAME !\n\n","date":"November 27, 2012 at 4:45 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19560","author":"Yannick Clément","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"I want to reply to a very interesting comment made by M. Kearse.  He said that for him, it isn’t hard to believe that the Creator of all things can incarnate himself through the virginity of Mary.\nI would say this: For me, it isn’t hard at all to believe that the Creator of all things can incarnate himself through natural human sexuality !\nI have NO PROBLEM at all believing that Mary as sleep with Joseph and that she ended up pregnant and gave birth naturally to Jesus.  Why would it be impossible for the Creator of the Universe to incarnate himself at the very moment of the embryo conception ?  Again, I have NO PROBLEM at all to believe in such a thing…  If it’s true, it would make human sexuality even GREATER than it is already.\n\n","date":"November 28, 2012 at 11:34 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19594","author":"Yannick Clément","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"When you say about the haploid and parthenogenesis, could you explain it in more detail. Thanks\n\n","date":"November 27, 2012 at 1:57 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19552","author":"Gabriel","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Further to my comments above concerning Roman & Jewish practices on adoption.\nSt Paul’s analogy on adoption in asserting that we are adoptive heirs in Christ can be found in Romans 8:15, 9:26 and Galatians 3:26.  Although to some of us now, the analogy might appear a little strained, clearly Paul considers that his readers will relate to it very well, and to me this conveys how widespread the practice was.  There is an excellent commentary on these scriptural references, with significant comment on the practice and entitlements of adoption at:\nhttp://www.abideinchrist.com/messages/rom8v15.html \nAs well as August Caesar being adopted, the URL makes the point that the emperor Nero was also adopted.\n\n","date":"November 27, 2012 at 3:27 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19554","author":"daveb of wellington nz","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Just asking: Are the gospels truly the first time the idea of virgin birth was introduced?  No foreshadowing in the Old Testament?\n\n","date":"November 27, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19564","author":"Kelly Kearse","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Isaiah 7:14 “Behold a young woman will conceive and bear a son and his name will be Immanuel…”  The Book of Isaiah was written over a period of two centuries.  This extract is from the first book, written about 740 – 700 BC.  The reference to the son is sometimes incorrectly interpreted as referring to Cyrus II who liberated the exiles from Babylon, but this is too late.  Isaiah addressed these words to the young Ahaz King of Judah about 733 BC, promising that Jaweh would send him this sign, in his war against Israel & Syria.  When the Septuagint was written in Greek about 200 BC, the translators used a word for young woman which came to be interpreted as “virgin”.  The evangelists e.g. Matthew, picked this up and applied it to the virginal birth of Jesus.  Other remarkable births occur in the OT, e.g. the Genesis story of the birth of Isaac to Sarah when she was well past normal child-bearing days.  There are others.  It seems to be an ancient writers’ convention of signalling that the person being born can be expected to be someone quite remarkable, and is a sign that the person is a sign of God’s (or the gods’) intervention perhaps in a time of some turmoil.\n\n","date":"November 27, 2012 at 8:41 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19569","author":"daveb of wellington nz","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"About haploid and parthenogenesis, Gabriel, here we go:\nHaploid & Diploid\nIn normal conception and development, a sperm fertilizes an egg, resulting in the fusion of the two cell types, bringing together DNA from the sperm (father) and the egg (mother).  Sperm and egg cells have half of the normal genetic material as other cell types (which is called haploid for half); this way, when they fuse, the developing embryo will be diploid (having 2 copies of DNA, one inherited from the father & one from the mother).  Diploid is the normal situation.  All other cell types in the body (except for sex cells, sperm & egg) are diploid, “di” for two.  \nThe suggestion has been made that Jesus was haploid, having 23 chromosomes (half of the normal number, 46) from an unfertilized egg cell, plus a Y chromosome (for maleness), giving a total of 24.  This would certainly be unique-under normal circumstances, haploid organisms do not develop/survive.  A full set of chromosomes is important for viability.\nUnlike the X chromosome, which contains thousands of genes, there are only 28 genes on the Y chromosome.  Of the 28, 15 are unique to the Y, 13 have counterparts on the X.  A very small number of males (1 out of ~20,000) are XX, with one of the X chromosomes containing insertion of part of the Y chromosomes.  The Y insertion provides the necessary genes for maleness.  This type of scenario and variations thereof have also been proposed as a possible mechanism for a virgin birth (Tippler). \nParthenogenesis\nThis word actual translates into “virgin birth” .  Parthenogenesis is the development of an organism from an unfertilized egg cell.  Certain species can reproduce this way, including bees, lizards, certain fish, amphibians, hammerhead sharks, and Komodo dragons to name a few.  Essentially, an (unfertilized) egg cell divides into uneven portions, a major portion and 3 smaller ones; one of the smaller portions can fuse with the major cell, creating a diploid embryo, which develops into a viable, normal organism.  This type of reproduction is not typically observed in mammals, but types of parthenogenic pregnancies have been known to occur, although very, very rarely.  in these circumstances, a virgin female may develop a polyembryoma, a type of tumor developing in the ovaries that may contain XY chromosomes (Garza-Valdes describes experience with such a patient in his book).  There are other chromosomal permutations as well that some have tossed out there, for example, a XXY male, known as Kleinfelter’s syndrome, all of which have associated abnormalities.\nI’ve never quite understood the need for such wild speculating and acrobatic tricks with chromosomes.  I think it might be an attempt to reconcile a belief in the virgin birth with a way that’s scientifically doable as we currently understand it.  In my opinion, it is most reasonable (essential) that Jesus was a physiologically normal, healthy male.  From the limited reports of molecular studies that have been performed on the Shroud, X and Y chromosomal DNA appears to be present, although contamination by exogenous DNA remains somewhat of an open issue.\n\n","date":"November 27, 2012 at 7:34 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19568","author":"Kelly Kearse","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Thanks, Kelly, that was very clear.\n\n","date":"November 28, 2012 at 2:56 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19575","author":"Gabriel","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"For virgin we get the Hebrew עלמה ‛almâh al-maw’ – Feminine of [עלם ‛elem eh’-lem properly something kept out of sight, that is, a lad: – young man, stripling]; a lass (as veiled or private): – damsel, maid, virgin.\n\n","date":"November 27, 2012 at 9:08 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19571","author":"Andy Weiss","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"I am the person who cried “wolf” after seeing “The lost tomb of Jesus” and am very glad that the “evidence” of the documentary is being challenged here. I think it’s important that this discussion/explanation be made available widely so other “innocent” Christians wouldn’t be subjected to unnecessary painful test of their faith. \nYannick, you expressed very well how I approach my faith and  even though I was baptised into the Catholic faith some 25 years ago, I still question some basic tenets of our faith and continue to read other religious materials. For example, I have read a few of Neale Walsch’s books : “Conversations with God”, “Communion with God” and “Home with God”. I would appreciate some comments on Walsch’s work. I would my faith to be an elightened one therefore I don’t accept everything in the bible as true. Clearly some are allegories and metaphors, but I do accept the general thesis of the bible.\nCould someone tackle the following questions:\n1) It is thru Christ that we have redemption. What happened to those souls who predated Christ?\n2) In Luke 21:29, “remember that all these things will take place before the people now living have all died”. I think Christ was referring to certain events (things) will happen before His second coming, BUT before all the people who were living at that time have died. That is, Christ was supposed come back before that generation had passed away. Is this the right interpretation?\n3) The Old Testament portrayed God like an ordinary being – full of vengeance, and hate etc. These can’t be the attributes of a loving and merciful God. How to reconcile the descriptions of God between the Old and New Testaments.\nThanks to Yannick, Kelly, Daveb and others.\n\n","date":"November 28, 2012 at 3:51 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19576","author":"Senior110","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"A brief comment to Senior110: I think crying “wolf” is a very understandable & appropriate response.  DNA evidence has a rather ominous sound to it, as though it is airtight, indisputable, which helps dramatize the selling points of these findings in sound bytes and promotions.  Remove the hype and it is often tabloid science, at best; the impact of the data is typically far less than advertised.  \nIn my opinion, circumstances such as these help to reinforce the idea that science & faith can never coexist; that the two are essentially  diametrically opposed to one another and unable to occupy the same footprint.  The other extreme is to keep science at arms’ length, to not approach issues of faith, to play it safe, such that their validity is not questioned.  A good example of the intersection of science & faith is the use of modern molecular biology (DNA) techniques to corroborate and disprove, respectively, the remains of Luke the Evangelist (PNAS 98: 13460-13463, 2001), and Joan of Arc (Forensic Science International 194: 9-15, 2010).  The Shroud, many would argue, offers a unique (unrivaled) opportunity to explore such issues even further.\n\n","date":"November 28, 2012 at 6:51 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19580","author":"Kelly Kearse","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Senior110 asks some profound questions, but they are somewhat off topic for this website; I’ll endeavour to give my own brief answers, but I don’t expect that others will necessary agree.  I feel he needs to do some reading by good modern Catholic authors which may help to enlighten him.  I suggest he might start by.reading such a simple book as “Jesus of Nazareth” by Pope Benedict XVI – Josef Ratzinger, Doubleday English translation 2007.  The book is simple, authoritative and takes account of modern scholarship and I feel strikes a reasonable balance between conservatism and liberalism.  He can then advance from that to other works of scholarship.  But he should be warned against takng too seriously the liberalism of those who seek to reduce Christianity by a type of rationalism, such as certain writers in the so-called “Jesus seminar” brigade. \nS110 mentions allegories and metaphors and wonders where truth is to be found.  I’ll confine my comments to the gospels by way of illustration.  Briefly, the evangelists were less concerned to write history than they were to proclaim Jesus as Christ.  Do not expect them to write history in the manner of the Jewish historian Josephus for example.  They do draw on history, but they were speaking to a people who had their own perspective of the world, and their message had to be understood inside that perspective if it was to be effective.  \nHis questions:\n(1)  The early and medieval Church considered that the souls of the just who predated Christ, were in a state called Limbo – they awaited the saving power of Christ’s redemption.  It may have been taken from Matthew’s Passion narrative which recounts how the dead came out of their tombs upon Christ’s death on the Cross.  Or was it just the perception from the earthquake?\nMy own Bible Study group recently discussed this question in our study of I Peter, who has Christ descending to Sheol to preach to the dead.  Or there may be another interpretation of the text.  My own view is that we are constrained by our perception of a three dimensional world which is time dependent.  But with the divine there is no time – Everything is Now!  There is no before nor after.  We only ask the question because of our perception of time.  But in reality, I suspect that the question may have no real meaning in terms of the spiritual or divine, neither of which are material substances.\n(2) The general consensus of most scholars is that Matthew was compiled sometime after the Fall of Jerusalem in 70 AD.  Some will disagree with that view.  About 90% of Mark which most maintain was written earlier, can be found in Matthew,  [A dissenting view gives Matthew priority, but I’ll stay with the majority.  Encyclopedia Britannica claims that Matthew was written after 70 AD for example.]  I maintain that Matthew’s “this generation will not pass away before these things occur”  refers to Christ foretelling the Fall of Jerusalem.  Matthew is concerned here in demonstrating the foreknowledge of Jesus as part of Matthew’s understanding of who Jesus really was.  But the story is also mixed in with a story about the Last Judgement, but no-one knows when this will happen.  Certainly there was an expectation in the early Church that Christ would return sometime soon.  Some of Paul’s epistles, many of which were written before 70AD, warn against this early expectation and seem to seek to dispel it, as with God, “a thousand years is but a day”.      \n(3) I do not agree with a certain popular view, seen in some postings here for instance, that the God of the Old Testament was a God of hate or vengeance.  What I feel we have lost is a sense of God being all-powerful, a God of judgement, concerned for justice, and a God of righteousness, because it is fashionable to be uncomfortable with these ideas of God – we are rightfully frightened of a power that is greater than our own mere humanity.  He is a jealous God who will not tolerate the lies of false gods.  He is also a God of consequences.  The punishments that are inflicted on the wicked are seen as a natural consequence of sin, of what happens when one falls away from God.\nThe prophets, and in particular the minor prophets, were concerned with justice for the poor, the weak, the orphans, the widows, and they railed against those who exploited them with a pretence of being holy and following the Law.  God is even patient with Pharaoh in the Exodus story – He gives Pharaoh twelve opportunities of releasing His people from slavery.  There is much more that could be written on this topic.  The Book of Job for example seeks to find an explanation for why bad things happen to good people.  \nI hope that these few notes might go some little way in helping to resolve some of the issues mentioned.\n\n","date":"November 28, 2012 at 6:56 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19581","author":"daveb of wellington nz","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Thanks to you, Kelly, and Daveb. I have never read such in-depth biblical and relevant scientific knowledge on the Shroud as in this site. \nDaveb, my view of God is more along the line of Neale Walsch, but not as extreme in some cases. Neale purportedly recorded the dialogues between God and him in a somewhat trance state. The first 3 books of Conversations with God were “mere” records of these dialogues. Book1 explains the reason for God creating the world in the first place, and  the souls come into being because they seek certain sensations or feelings. Therefore there are no villians or victims because all are willing participants. Far-feteched as it may seem, Hilter came to the world to have his “fantasy” fulfilled and the same for the holocaust victims. All are playing their roles. \nIn Neale’s God’s world, there is no good or evil as everything is relative in this world. (I agree with that to a degree and this really echoes a famous writer who said that “nothing is good or evil but only thinking makes so.. may have misquoted this.)\nEventually we all reunite with God and will come back to this world many times to have different experiences.  I am not doing justice to Neale’s work as I am writing strictly from memory of material I read over 10 years ago. I highly recommend Neale’s Book1 to theists and atheists because of its intellectual merits alone.\nGod bless everyone and thanks again. I am going view video again with a fresh eye.\n\n","date":"November 29, 2012 at 2:14 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19620","author":"Senior110","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Dear Senior110:  I’m sorry to have to dispel your illusions, but your Neale Walsch is just another fake, a false prophet.  Our secular world has left a spiritual vacuum in the hearts of people,  It probably began with Nietsche in the 19th century who proclaimed the “God is dead! We have killed God!”  But as St Augustine said: “Our hearts are restless, O God, until they rest in Thee!”  That is the truth, so that our modern generation looks wherever it can, to fill the vacuum that has been wrought.  Is Walsche’s version of religion, the version that thousands would live and die for, to be martyred for?  Does it uplift the spirit?  Does his relativism provide motivation to do good to do others? Does it motivate to peach the gospel of a saving Christ?  To set high standards of behaviour?  I don’t see how it can do any of these!  His so-called “Conversation with God” have sold over 3 million copies!  Did he give away the profits to charity?  Does he give the same example in his life as did Mother Teresa of Calcutta?  I suggest you read her “Something beautiful for God” if you are searching for something worthwhile in your life.  Relativism is just another modern heresy! \nCheck out the web-site: https://www.christiancourier.com/articles/175-neale-walsch-a-new-guru-for-the-gullible for a thumbnail comment on this fake! \nGod has given us the freedom to believe whatever we will, and you can believe whatever you like.  You say you were baptised a Catholic some 25 years ago.  But I’m afraid if you want to discover the truth, you will have to work very much harder at it, and don’t be fooled by popular gurus whose imaginations run riot, whether televangelists or writers of religious fiction!\n\n","date":"November 29, 2012 at 5:57 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19627","author":"daveb of wellington nz","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Neale Walsch – an eclectic mixture of gnosticism, relativism, pantheism and reincarnation.  All heresies.  Something for everybody, No truth for anybody!  “Conversations with God”? or Conversations with himself? Or Conversations with the father of lies.  I’ve known acquaintances who’ve heard voices, but it usually passed when returning to their medication!\n\n","date":"November 29, 2012 at 9:33 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19655","author":"daveb of wellington nz","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"The Shroud, the Pantocrator, there’s even a reference to the Pray Manuscript (and the lack of visible thumbs/fingers) \nhttp://getthetruthout.icyboards.net/printthread.php?tid=1150\nBefore pasting in your browser, pull your tin-foil hat down nice & snug (heavy duty foil is recommended); the evidence of AB blood is often mentioned in related stories as a clincher.\nI’ve always thought Chris Martin (lead singer of Coldplay) might be worth a closer inspection as well…Viva La Vida\n\n","date":"December 1, 2012 at 9:22 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19722","author":"Kelly Kearse","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"Thanks for this Kelly.  Defiitely tin-hat territory.  I also needed a tightly-bound cincture to avoid excessive side-splitting from laughter.  Is this “getthetruth” site known for sustained tongue-in-cheek irony, or is it intended to be serious conspiracy theory?  Much of it seems dependent on commonly available picture morphing software – you can morph any image to any other.  I see they’re also demonising the Royal Navy insignia.  .\n\n","date":"December 2, 2012 at 12:08 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19726","author":"daveb of wellington nz","site":"shroudstory"},{"title":"MUST READ:  Cloning the man on the Shroud of Turin","post":"To be honest, I am not really sure, but best I can tell it’s serious conspiracy theory, even though admittedly, the “clues” about the thumbs/fingers in relation to the Pray Codex took it to a whole new level.  Searching for information on AB blood typing and the Shroud, the most common related subjects that consistently show up are the Sudarium of Oviedo (makes sense) and the Prince William connection with the Shroud of Turin (huh?).  There is now actually a novel based on cloning Jesus from a sample taken from the Sudarium, a trilogy series no less.  I was a bit surprised when I first saw just how prominent this idea with Prince William was (on images/you tube): cloning and the Shroud intertwined with blood typing, some wild stuff.  I’m old enough to remember when such important and cryptic information was only revealed to the public via the latest Beatles’ album cover…\n\n","date":"December 2, 2012 at 9:23 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-19753","author":"Kelly Kearse","site":"shroudstory"}]
