[{"title":"New Garlaschelli and Borrini Study","post":"Excellent video, but contrary to the propaganda of Union Atheists Agnostics and Rationalists actually confirming forensic accuracy of the Shroud. \nMore later.\n\n","date":"April 11, 2015 at 6:38 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196046","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Here you have the illustrations:\nI see no notable differences, except maybe that the blood of the Shroud Man was likely denser, and his body was suffering severe spasms\n\n","date":"April 11, 2015 at 7:37 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196050","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Was that “propaganda” an agenda driven experiment?\nWhy?\nI want to better understand your remarks…\n\n","date":"April 11, 2015 at 8:41 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196052","author":"piero","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"If Luigi Garlaschelli was making the experiments crucified like Jesus his results would  probably be different.\n\n","date":"April 11, 2015 at 3:31 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196071","author":"Louis","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"PerhapsI have found a more precise reference about the question BPA\n(= Blood Pattern Analysis), it deals with a Digital Measurement Kit that\n“is a versatile tool kit designed to assist the investigator\nat the crime scene with photography, laser trajectory. …”\nLink:\nhttp://www.sirchie.com/digital-measurement-kit.html\n— — —\nSee also:\nSirchie Digital Measurement Kit, with Photography,\nLaser Trajectory & Blood Spatter Equipment\n>The Sirchie Digital Measurement Kit is a versatile tool kit designed\nto assist the investigator at the crime scene with photography,\nlaser trajectory, Blood spatter and other relevant field work.\n>The three measuring devices and accessories make crime scene\ninvestigations easier, quicker and more accurate.\nLink:\nhttp://www.adorama.com/SIDIGMK300.html\n— — —\nOther links:\nhttp://d1zh4ok0q8k7dm.cloudfront.net/media/resourcecenter/item/b/s/bsk500_ti10.06-541eng-rev2e_1.pdf\nhttp://www.clt.uwa.edu.au/__data/assets/pdf_file/0019/2301652/fsb07.pdf\nhttp://www.aafs.org/sites/default/files/2015/abstracts/E39.pdf\n— — —\nSee also the possible problem about the origin of “blood belt”:","date":"April 13, 2015 at 2:57 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196184","author":"piero","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"See also the possible problem about the origin of “blood belt”:\nThe ‘blood belt is more likely not on the body, but blood that was spilled from the side of the body when it was lied on the right side (and not on the back, like in Garlaschelli & Borrini study). The Shroud was also likely not entirely horizontal level, but minimally inclined to the side, so that the blood flowed to the left side. \nSee http://www.sindonology.org/shroudScope/shroudScope.shtml?zl=2&image=4&lon=1669.5&lat=361.5\nWas that “propaganda” an agenda driven experiment?\nWhy?\nI want to better understand your remarks…\nMost likely. The mark of the sponsor explains why. They most likely made conclusions before, and performed some studies to back it up. Why? To make “scientifically-backed” claims, that contrary to near unanimous opinion of medical experts like Barbet, Bucklin, Hynek, Lavoie, Zugibe etc. that Shroud image is anatomically wrong. Based on hasty conclusions from some simplified experiments, and unclear criteria (based on video published, I cannot see any results that would contradict the forensic accuracy of the Shroud).\nI suppose that the purpose of those experiments is to gave their followers  some “arguments” of this kind into their hands. To shout lies that “Garlaschelli & Borrini experiments proved that the Shroud is a fake”.\n\n","date":"April 13, 2015 at 7:32 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196212","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"As far as forensic archaeological techniques of ABPA (Archaeological Bloodstain Pattern Analysis) is concerned, Borrini and Garlaschelli just failed/could not discriminate between, lightly mordanted/degraded ante- and post-mortem blood rivulets; lightly mordanted/degraded freshly dried or half-dried ‘crucifixion blood’ flows, lightly mordanted/degraded remoistened ‘crucifixion blood’ and lightly/mordanted/degraded sweat remoistened washed out ‘blood’.\n  They just totally ignore or overook blood intensifiers (such as pre- or light mordanting and/or carbon monoxide liberated along with smoke in the course of a Second Temple period Judean burial in the shape of fumigation/burning aromatic aloetic woods/myrrh etc) could account for the aged/archaeological blood colour changing (upon exposure to bright sunlight or UV exposure) from standard old brownish to bright carmin red via brownish mauve. Indeed Archaeologically speaking, the TS crucifixion victim haematic cartography is flawless.\n\n","date":"April 13, 2015 at 3:24 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196186","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Their alleged reconstruction is neither ‘forensic’ nor archaeological at all. It light-years away from state-of-the-art experimental archaeology!\n\n","date":"April 13, 2015 at 6:24 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196206","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Sorry. I’m no expert Archaeological Bloodstain Pattern Analysis!\nBut I do not agree with all the criticism, it seems to me that\n(perhaps) we risk going a bit ‘off topic …\nGarlascheli and Borrini tried checks in different locations,\non what you should discuss (= observations about the angles, etc.).\n Another example:\n one thing to clarify is what it is when it comes to Blood Spatter (see, in the movie, the use of liquid in the little dark bottle …). Perhaps they did not use blood at all, but the “synthetic blood” (and now I have found a vague link:\nhttp://www.crimesciences.com/StoreBox/newproducts/ev-3674.htm\n>Synthetic Blood was developed in order to fill a need to eliminate the possibility of pathogens originating from the use of human and non-human blood in the classroom or lab…).\n Also I apologize for that raw image of the dead body of Jesus, seen from the back in order to better show the question of the “belt of blood\n\n","date":"April 13, 2015 at 3:59 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196187","author":"piero","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Thank you, Piero. Your last link is to an abstract of the paper deriving from Guarlaschelli and Borroni’s experiments, and states: “Real human blood and synthetic blood for BPA were used with comparable results.”\nMax, I think you have missed the point. There was no intention in this experiment to investigate the colour or nature of the blood on the Shroud, only the verisimilitude of the blood flows. As such, consideration of what might have happened to the blood after it had flowed was irrelevant. Other experimenters, or theoreticians such as yourself, have considered how a blood flow might be transferred from a body to a cloth, and having done so, how it might, after hundreds of years, present the appearance that it does now, but science proceeds by small steps, and there is no need to try to find the answers to everything at once. There is no need to accuse Guarlaschelli or Borroni of being unable to discriminate, or to have overlooked, or (a favourite of the authenticist) to have “totally ignored” factors which were irrelevant to their experiments.\n\n","date":"April 13, 2015 at 3:59 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196188","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, just in case you missed it:\nTheir alleged reconstruction is neither ‘forensic’ nor archaeological at all. It light-years away from state-of-the-art experimental archaeology!\n\n","date":"April 13, 2015 at 6:32 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196207","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Methinks they just missed the point in terms of ARCHAEOLOGICAL bloodstain pattern analysis.\n\n","date":"April 13, 2015 at 6:35 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196208","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Wrong again, Max. The archaeology of the blood is irrelevant. The blood on the Shroud appears in most cases to have arrived by direct transfer from blood on a body. The patterns made by blood on a body under various circumstances are worth investigating. Human circulatory behaviour not having changed in the last 2000 years or so, valid experiments can be made using modern volunteers and modern blood or blood simulants.\nThere are valid criticisms of Garlaschelli and Borrini’s study, but yours are not, so far, among them.\n\n","date":"April 13, 2015 at 7:03 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196210","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, feel free to swallow B & G’s allegedly ‘forensically’ and ‘archaeologically accurate bloodflow reconstruction’ (B & G are on your side i.e. the anti-authenticists’ side, which does account for your being unsusually uncritical on this experiment). It reminds me of the pro-authenticity pig experiment. Both experiments whether on the authenticists’ or anti-authenticists’ have only the colour of science yet they are not scientific at all.\n\n","date":"April 13, 2015 at 7:22 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196211","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, if you like gross approximations enjoy B & G’s experiment.\n\n","date":"April 13, 2015 at 7:32 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196213","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Max, you are making up things to criticise. “B & G’s allegedly ‘forensically’ and ‘archaeologically accurate bloodflow reconstruction.’ The only person alleging archaeological accuracy is yourself. Why not address yourself to the experiments themselves? What, specifically, do you object to?\n\n","date":"April 13, 2015 at 7:53 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196215","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh,what specifically don’t you object to to swallow it whole?\n\n","date":"April 13, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196232","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, how do you account for your sudden suspension of your usual and systematic critical thinking?\n\n","date":"April 13, 2015 at 1:12 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196233","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Typo: Hugh, what is the reason why you don’t object to swallow it whole?\n\n","date":"April 13, 2015 at 1:13 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196235","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"You’re wandering, Max.”What specifically do [I] not object to?” That doesn’t make any sense at all. However, as it happens, I don’t “swallow it whole.” I agree with Antero, below, that their conclusion was a little hasty. My reasons, however, have nothing to do with archaeology or the preparation of the cloth, but because further experiments are necessary, following OK’s guidance about sweat, dirt, fever, ‘random shivers’ and the difference in viscosity that may be due to intense suffering. Garlaschelli and Borroni are well aware of the limitations of their experiment, and in their more formal statement (http://www.aafs.org/sites/default/files/2015/abstracts/E39.pdf) twice say that further studies should be performed to try to clarify the matter.\n\n","date":"April 13, 2015 at 1:56 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196238","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"An other overlap, sorry. By Piero’s ‘last link’, I meant from his previous post, namely: http://www.aafs.org/sites/default/files/2015/abstracts/E39.pdf.\n\n","date":"April 13, 2015 at 4:02 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196191","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"I’m sorry for the curious fact that my speech and writing\nposted by Hugh have crossed at the same time.\n— —\nUnder the same link that I have indicated\n(= http://www.crimesciences.com/StoreBox/newproducts/ev-3674.htm ,\nsee under : “Detailed Description”) we can read\nthe following words about the question “Spatter Blood”:\n>Spatter Blood is intended for use in spatter reconstructions.\n>Spatter Blood is physically similar to fresh blood, and reacts\non impact to surfaces much like real blood reacts.\n>Spatter blood can be dropped from an elavated position onto a\nvariety of surfaces to recreate impact angles… \n-*-*-*-*-\nThere are several ways to describe a phenomenon…\nFor example : the idea to try to use Chernoff faces on “haematic cartographies” seems to be a bit strange…\nWhat are the Chernoff faces?\nChernoff faces are features of a human face (eyes, nose, mouth, etc.) that can be used to represent different data.\nlINK:\nhttp://en.wikipedia.org/wiki/Chernoff_face\nWhat is your own opinion on Chernoff faces on blood maps?\nThis is a bit irreverent because we have to deal with the death of Jesus and not\nwith a representation of data in thematic maps…\n— — —\nPerhaps we can try to use the curious “Chernoff faces”\nin a poll about the last argument indicated in this blog by Dan:\n “More Testing? Maybe.”…\n— —\nSo, Dan, what do you think?\nDou You can arrange one or two tests\n(= one for the argument “new analyses” and\nthe other about the blood flows and the level of G&B attempts…)\nusing the curious faces?\n— — —\nHere another link (about synthetic blood and Material Safety Data Sheet…):\nhttp://www.crime-scene.com/downloads/msds/msds_synthetic_blood.pdf\n\n","date":"April 13, 2015 at 4:37 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196194","author":"piero","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"I must admit that I really like the idea of using the “Chernoff faces”.\n… and, perhaps, because the same Garlaschelli and Borrini\nare special “Chernoff faces”?\n— —\nHere I have a few words about the use of “Chernoff faces” …\nI have found a reference in the field of statistics:\n>After standardization of the data, Chernoff faces were pictured for each measurement, and a principal component analysis (PCA) was used to reduce the dimensionality and pre-process the data before hierarchical clustering…\nPerhaps one could use those “Chernoff faces” also for the data coming\nfrom the controls on the famous degree of polymerization of the cellulose\n(controls performed by the use of the techniques AFM) …\n… with happy faces when the results are used to define a period close\nto the first century CE (= Current Era, an epoch of …  often\nwidespread general confusion) and ugly faces in the other cases…\n\n","date":"April 13, 2015 at 4:58 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196196","author":"piero","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Just now I have found a study of 110 pages titled:\n“Bloodstain Patterns on Textile Surfaces: A Fundamental Analysis”\nAuthors:\nStephen Michielsen, Michael Taylor, Namrata Parekh, Feng Ji\nLink:\nhttps://www.ncjrs.gov/pdffiles1/nij/grants/248671.pdf\nNow I’m going to have lunch and then\nI ask you to tell me if you have found something of useful\nin that long report, because I tried to find the word “linen”\nbut I have not found that term…\n\n","date":"April 13, 2015 at 5:14 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196198","author":"piero","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Reminder: This is most likely position of the Shroud Man while He was hanging on the cross -according to Ricci:\n\nAll discussions about blood patterns should pertain to this, (or similar) body position on the cross.\n\n","date":"April 13, 2015 at 7:38 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196214","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"It is true that the blood flows on the statue above, especially the one on the right arm, look remarkably similar to Garlaschelli and Borroni’s. They appear to have been dripped on rather than painted. However, they look nothing at all like the interwoven zig-zag rivulets that we see on the Shroud. Gilbert Lavoie’s exploration (http://www.shroud.com/pdfs/ssi07part5.pdf) attempts to relate the actual blood flows on the Shroud to a body, but his conclusion: “Note that the blood clots demonstrate a flow pattern consistent with the vertical position of crucifixion,” is unjustified, as both Garlaschelli and Riggi demonstrate.\n\n","date":"April 13, 2015 at 8:07 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196216","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"It is true that the blood flows on the statue above, especially the one on the right arm, look remarkably similar to Garlaschelli and Borroni’s. They appear to have been dripped on rather than painted. However, they look nothing at all like the interwoven zig-zag rivulets that we see on the Shroud.\nThe 100 % accurate reproduction of the blood pattern on the Shroud is of course impossible -contrary to Garlaschelli who stood calmly with his clean arms, Man of the Shroud was hanging on the cross with high fever, chills, dirty, sweaty, with his arms covered with blood. Any random shiver could put a blood flow in a different direction. As He was dehydrated, the blood was also likely to be denser, especially shortly before death.\nAs I said, I see nothing in this study that would make the Shroud image anatomically inaccurate. More – I see that this study, contrary to the blusterous claims of the UAAR, managed to replicate more less the general pattern of the blood flows on the Shroud, leaving only some hard to replicate details.\n\n","date":"April 13, 2015 at 8:21 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196218","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh you wrote: “Gilbert Lavoie’s exploration (http://www.shroud.com/pdfs/ssi07part5.pdf) attempts to relate the actual blood flows on the Shroud to a body, but his conclusion: “Note that the blood clots demonstrate a flow pattern consistent with the vertical position of crucifixion,” is unjustified, as both Garlaschelli and Riggi demonstrate.”\nIf you mean “Garlascelli and Borroni” (not Riggi), I can’t see such a demonstration.\nTen years ago (!), I performed the same kind of experiments with my own blood (5 ml, no liters !!). I got blood rivulets very similar to those seen on the Shroud but the inclination of my forearm was about 60° (not 80° or more) while the inclination of my arm was about 30°. Therefore the configuration was the same as the anatomical right upper limb in the OK’s picture above. Moreover, the blood rivulet went round my elbow so that the “out-of-image” bloodstain seen on the TS occurred naturally.\nThe late Dr. Zugibe provided some interesting comments about my experiments.\nI can show show photos and comments if necessary.\nG and B conclusion: “Taken together the results of these tests are therefore not consistent with the general trend of the rivulets of blood on the Shroud of Turin and seem to refuse to testify in favor of their authenticity, but rather in an artistic or didactic.” is false.\nThey did not consider the many different possibilities and parameters.\nAnd the utilization of the terms “BPA (Bloodstain Pattern Analysis – analysis of the shape of the blood stains)” is truly false in this context. BPA, which is a term used in the context of analysis of a crime scene has nothing to do with their work.\n\n","date":"April 13, 2015 at 2:35 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196240","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"I can show show photos and comments if necessary.\nIf you have them, please.\n\n","date":"April 13, 2015 at 2:45 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196242","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"I congratulate O.K. on his comments because they make sense nevertheless I’d’like to add:\nIt’s very difficult to analyze the conditions on which the blood rivulets we observe on the Shroud were produced let alone to reproduce them in any kind of experiment.\nIn a real crucifixion by nailing through the wrists and accordingly to Dr. Barbet’s claim no major arterial or venous blood vessels would be injured it seems that along with small venous vessels only tiny carpal branches from the radial and ulnar arteries would be pierced.\nSo being a mixture of arterial and venous blood would be slowly exiting from the carpal exit nail wound.\nWe have also to consider movements of superior limbs while hanging on the cross and the exact position of them relative to the gravity line during those movements.\nContact transter of bloody exudates from forearm clots and washing or not washing he body before wrapping  in the Shroud are certainly other aspects to be considered.\n The bloody rivulets of the experiment were obtained in different conditions.\nConcerning the side wound, the bloody material on the Shroud is surely post mortem blood from the right atrium and superior cava vein  and a serous fluid from a traumatic pericardial or pleural effusion.\nThe «blood belt» would form by gravity when the Man of the Shroud was moved to the suppine position with a little inclination to the right side and residual blood flew from inferior cava vein.\nThis is of course an hypothetical scenario perhaps the closest to reality and it seems to me that the conditions of the experiment of Dr. Matteo Morrini and Professor Luigi Garlaschelli  did not take into account these and perhaps other unknown conditions.\nSo it turns out their conclusion «Taken together the results of these tests are therefore not consistent with the general trend of the rivulets of blood on the Shroud of Turin and seem to refuse to testify in favor of their authenticity, but rather in an artistic or didactic.» was drawn in a hasty way.( fact that does not surprise me)\n                                                                           regards\n                                                            Antero de Frias Moreira\n                                                       Centro Português de Sindonologia\n\n","date":"April 13, 2015 at 12:45 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196231","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Antero is a medical practioner and it always better for professionals to comment. Why waste time with this unconvincing agenda-driven experiment?\n\n","date":"April 13, 2015 at 2:04 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196239","author":"Louis","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Because it is anyway, experiment, with some results that should be critically analysed, no matter possible agenda. \nUAAR claims new experiments put Shroud’s authenticity into doubt. On the argument that forensic experts (Barbet, Buckiln, Zugibe, Hynek, Sava etc.) think different way, they can say that those experts didn’t perform experiments and base only on their opinion, while experimental data performed by Garlaschelli & Borrini show that the Shroud is anatomically inaccurate. The overtone is: you have opinions, we have results, so our arguments are more scientifically grounded, you foolish bigots.\nThen we (pro-authenticity) need to show that their results are 1) not conclusive 2) flawed 3) show entirely different picture than militant atheists would like to see.\n\n","date":"April 13, 2015 at 2:41 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196241","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"“I can show show photos and comments if necessary.” Yes, indeed, Thibault. They would be very interesting.\n\n","date":"April 13, 2015 at 3:14 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196244","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh,\nI will show them but what is exactly the question ?\nThere are so many questions regarding the blood flows !\nExactly, why did you write: ““Note that the blood clots demonstrate a flow pattern consistent with the vertical position of crucifixion,” is unjustified, as both Garlaschelli and Riggi demonstrate.”?\n\n","date":"April 14, 2015 at 1:25 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196331","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Both the Garlaschelli and the Ricci (my apologies for calling him Riggi) blood flows are more or less straight, not twisting, zig-zagging or intertwining. If anybody has achieved anything a bit more like the Shroud, I have yet to see it. Gilbert Lavoie simply laid a copy of the Shroud along an arm and announced that the flow pattern, which he described as ‘blood clots’, was ‘consistent with the vertical position of crucifixion.’ There was no practical or experimental justification for this. Such practical and experimental work as has been carried out has not been consistent with the Shroud.\n\n","date":"April 14, 2015 at 2:12 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196338","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"“Why waste time with this unconvincing agenda-driven experiment?” Because, apart from Thibault’s, it is the only one we have. Non-authenticists are forever being told that unless they can reproduce the image exactly, the Shroud must be genuine. Is it impertinent to suggest that unless authenticists can reproduce the blood-flows exactly, they must be considered fake? Garaschelli and Borroni (and Thibault?) have demonstrated that blood will not flow along an arm unless it is well over 45 degree from the horizontal, and the speed of flow means that there is very little time for it to wriggle about as it flows. If the arm needs to be moist with sweat, or grimy with dirt, or the blood needs to be a little thicker to slow it down, then let these experiments commence! Antero points out that as no major blood vessels are, pierced (and I might add that with the wound level or above the head blood pressure is minimal anyway) very little blood would come out at any time, although if the wound were continuously agitated, perhaps sporadic flow could be stimulated until death, when no more blood would be expected, even after removal of the nail.\n\n","date":"April 13, 2015 at 3:31 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196246","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Garaschelli and Borroni (and Thibault?) have demonstrated that blood will not flow along an arm unless it is well over 45 degree from the horizontal, and the speed of flow means that there is very little time for it to wriggle about as it flows. \nThat’s not great problem, if you observe the actual shape of the blood flows on the left arm:\n\nhttp://www.sindonology.org/shroudScope/shroudScope.shtml?zl=4&image=3&lon=888.0&lat=5159.0\nSee? Contrary to the right arm (which was nearly vertical), there is no continuous flow from the wrist wound. Instead there is a thin smudge on the upper edge of the arm (which constitutes nearly horizontal surface), and along this smudge, there are several drops falling down the arm at proper angle.\nAll of this is, I think, perfectly consistent with the results of Garlaschelli & Borrini experiments.\n\n","date":"April 14, 2015 at 3:49 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196288","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Well, it is one thing to be tortured and crucified as Jesus was and quite another to make experiments.\n\n","date":"April 13, 2015 at 3:40 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196247","author":"Louis","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"When I wrote my comment I had not yet seen Dr. Thibault Heimburger’s comment, so I congratulate him too and I invite him to show us the results of his experiment.\n«If the arm needs to be moist with sweat, or grimy with dirt, or the blood needs to be a little thicker to slow it down, then let these experiments commence! Antero points out that as no major blood vessels are, pierced (and I might add that with the wound level or above the head blood pressure is minimal anyway) very little blood would come out at any time, although if the wound were continuously agitated, perhaps sporadic flow could be stimulated until death, when no more blood would be expected, even after removal of the nail\nThis time I agree with Dr. Hugh Farey that conditions like sweat aand possible particles of dust on the surface of forearms could also have some influence on the aspect of the blood trails.\nActually if a normal individual elevates his superior limb above head level there is an instantaneous blood pressure dropping at distal level but soon homeostatic mechanisms from the sympathetic nervous system adjust blood arterial vessel tonus to the new postural condition so blood pressure dropping is well compensated or minimal.\nOnly in pathological conditions like anomalies of thoraxic outlet or arterial diseases is blood flow to the extremity compromised when one elevates the arms above head level,\nAlthough blood pressure dropping in superior limbs due to the state of hypovolemic schock and crucifixion position of superior limbs( inclination at about 60 degrees to the vertical?) are important aspects to consider, these would not preclude at all some blood exiting from the dorsal (and volar) wrist exit nail wounds.\nNevertheless these conditions would possibly cause a low or very low velocity blood flow and the aspects of the blood trails would also be related to the time the body was hanging on the cross by the progressive adding of small quantities od blood.\nAs we see from previous considerations it is not easy to reproduce in a single experiment the gathering of ALL the conditions present when the Man of the Shroud was crucified and the conclusions of this skeptic experiment are worthless.\nThis does not mean that new experiments shoul not be tried, but not in  such a simple approach.\n                                                                                            regards\n                                                                             Antero de Frias Moreira\n                                                                          Centro Português de Sindonologia\n\n","date":"April 14, 2015 at 5:12 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196292","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Yes.This two-angled argument has been around for a very long time, explained by an alternating two position posture on the cross – standing on the nails in the feet or hanging from the nails in the arms – so that the blood flowed straight down the arms when standing (humerus horizontal, forearms vertical), then poured off sideways when hanging (arms straight at 30° or so). Riggi’s crucifix provided a slightly different, asymmetrical version in which the two arm positions alternated with each other. So reasonable did this seem that as far as I know nobody has actually tried it out. Or, which is not unlikely, it has been tried out and doesn’t work. This is because it relies on quite a ‘reservoir’ of blood along the top of the arm (your longer arrows) to break into smaller rivulets which drop straight off across the arm as it becomes horizontal (your shorter arrows).\nIt’s a good, sensible, naturalistic BPA explanation for the shape of the blood flows as we see them, and it has satisfied a number of eminent pathologists, but I don’t think it works. Not enough blood to fill the ‘reservoir’, blood pressure too low, nail preventing bleeding, blood either too viscous or too fluid, clotting time too rapid, etc. It would be good to be able to discus these points with someone with appropriate experience such as a forensic anthropologist specialising in violent death. The only one I know is the principal lecturer in Forensic Anthropology at John Moores University, Liverpool, whose recent papers at the American Academy of Forensic Sciences have included cannibalism, suicide, poisoning… oh, and two on blood flows…\n\n","date":"April 14, 2015 at 5:33 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196294","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"UAAR concluded: “Taken together the results of these tests are therefore not consistent with the general trend of the rivulets of blood on the Shroud of Turin and seem to refuse to testtify in favor of their authenticity, but RATHER (my upper cases) in an artistic or didactic.”\nHugh, who is wandering? \nHave G & B demontrasted the blood CANNOT BE first century and human and CANNOT have very unique characteristics that may be explained by specific burial practice theory? NOT AT ALL.\nHave G & B demonstrated the bloodflows are totally alien to Roman crucifixion AND Second Temple period Judean burial rite and practice? NOT AT ALL.\nHave G & B demonstrated the bloodstains result from a medieval forgery? NOT AT ALL.\nTheir allegedly ‘forensic’ experiment/BPA is just a masquarade of archaeological bloodstain pattern analysis: nothing is demonstrated, nothing conclusive at all surfaces.\nBTW you refer to “Riggi’s crucifix” when actually it is Ricci’s.\n\n","date":"April 14, 2015 at 6:07 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196299","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Yes, Max. As Antero said, and I agreed, the conclusion is rather more dogmatic than it should be. However, although crucifixion technique is relevant to their experiments, burial practices are not, and mention of them is wandering away from the subject.\nGarlaschelli and Borrini’s experiments did not mimic the blood flows on the Shroud, and “seem to refuse to testify in favour of their authenticity.” That is not the same as saying: “nothing is demonstrated, nothing conclusive at all surfaces” and it is also not the same as saying that they prove non-authenticity. Neither the professors, nor I, not even the article leading this post, claim that they do. To suggest that they do is wandering away from the subject.\nWhen I agreed with the professors’ article, you asked me to name one specific thing with which I did not disagree. This is wandering away from rationality. \nI am very sorry that not only did I get Giulio Ricci’s name wrong, but in all my posts above I have referred to Prof. Borrini as Borroni and twice to Prof. Garlaschelli as Guarlaschelli. I do apologise to them all most sincerely.\n\n","date":"April 14, 2015 at 6:39 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196303","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, you wrote: “although crucifixion technique is relevant to their experiments, burial practices are not, and mention of them is wandering away from the subject.” \nPrecisely because G & B just cannot really discriminate between bloodflows relevant to Roman crucifixion and those relevant to burial practice (re-moistening and drying), their experiment/analysis is VOID (upper cases to make myself clear).\n\n","date":"April 14, 2015 at 7:17 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196306","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, If you take a good look to the short video (above), G & B INDEED are mixing BOTH crucifixion and burial practice in their experiment.\n\n","date":"April 14, 2015 at 7:24 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196308","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Typo:If you take a good look AT\n\n","date":"April 14, 2015 at 7:29 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196310","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"My money would still be on Barbet.  He discusses the blood-flows from the wrists in considerable detail, the scenarios he proposes for the act of crucifixion are I think credible, have several advantages in military efficiency, and include detailed anatomical and triangulation analysis.  I feel that Zugibe’s experimental attempts appear to me to be a little too contrived and represent an inadequate depiction.  \nBarbet of course envisages that the prisoner is nailed to the cross-beam with his arms stretched out along and parallel to it.  On lifting the cross-beam onto the upright, the body then sags, and the arms take up a position at 65 degrees to the vertical.  He postulates a type of seesaw motion as the  prisoner seeks to continue breathing by raising and lowering himself on the nail through the feet. Of the blood-flows emanating from the wrists he writes: \n“… The body thus alternates … between a sagging position and a state of asphyxia and a raised position which brings relief.   In each position the vertical flow of blood, which coagulates slowly on the skin, would make a slightly different angle with the axis of the forearm.  The flow furthest from the hand, which is at an angle of 65^o, corresponds to the sagging position.  The one nearest the hand corresponds with the raised position and gives an angle from of from 68^o to 70^o.”   \nHe supports this scenario with further geometrical and anatomical analysis, the amount of stretch available at the joints, and some Pythagoras, etc.  Altogether a more thorough analysis than the toy experiments of Garlaschelli and Borrini.\n\n","date":"April 14, 2015 at 9:16 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196365","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"In these descriptions, Barbet considers only the twin flows from the wrist wound, not the flows along the arm. With reference to OK’s diagram above, there are three flows from the wound, represented as two short red arrows and one long one. Barbet considers only the shorter two. In order for blood to flow down the arm towards the elbow, his angles have to be considerably steepened. He does not seem to have considered the possibility that the arms may have been bent at the elbow at all.\n\nNevertheless, it would be interesting if Garlaschelli and Borrini were to carry out more experiments with Barbet’s descriptions in mind.\n\n","date":"April 15, 2015 at 3:59 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196378","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"In Barbet’s scenario, I should think that bent elbows would be quite excluded.  Remember he is envisaging that the arms are stretched along the cross-bar, and the wrists nailed to the cross-bar with the arms fully extended.  As the cross-bar is lifted up onto the upright, the body sags with the full weight taken by the arms only.  As the body becomes vertical, simple statics will show that the tension in each arm becomes 207 lb at 65^o.  It is only when the feet are nailed to the upright, that this tension can be relieved.  \nI get the impression from Barbet, that he believes he can confirm the 65^o as much from the limits of joint movement between shoulder and upper arm and the consequential triangulation, as much as from the blood flows.  \nThe lifting of the crossbar onto the upright does not seem admissible in Zugibe’s scenario where his volunteer is attached to a fixed cross already in position.  This allows Zugibe to claim that the arm tensions are much less than 207 lb, and that therefore wrist nailing is not required.  Even so, with any significant arm tension at all, with arms outstretched, I should think it very difficult indeed for any traumatised victim to sustain a bent elbow at all.  Triangulation from a rigid cross-bar would seem to argue against it.  \nWe are of course only seeing the blood-flows on the outer surface of the arm.  One question might need to be resolved by some experimentation, that is, to what extent would the surface contours of the arm under tension provide a track for blood flows along the arm at the angle of 65^o, or would they indeed be vertical.  Would the head of the nail jam the wrists hard against the cross-bar so that the flow is constricted, or is it sufficient if the wrists are merely pinned to the crossbar, allowing a gap, that would not constrict the flow.  The viscosity of the blood at the time of flow, might also be a significant variable. \nYet another aspect might be, at what time during the execution did these now visible flows occur?  Did they occur while hanging from the cross, or did they occur after the victim had died during his removal from the cross?  If the latter, than all bets would be off, as the flows would then depend on the incidental disposition of the arms at the particular time the flows occurred.  But that might depend if wrist wounds can bleed after death.  My own sightings of blood-flows in an abattoir suggest to me that they might well do so, but I would be happy to be corrected by professional opinion.\n\n","date":"April 15, 2015 at 7:20 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196395","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh wrote: “Nevertheless, it would be interesting if Garlaschelli and Borrini were to carry out more experiments with Barbet’s descriptions in mind.” \nReminder: Pr. Luigi Garlaschelli hold a doctorate in Chemistry while Pr. Matteo Borrini holds a doctorate in Evolutionary Biology and Ecology. Absent the fact they are not Second Temple period historians, none of them hold a doctorate in Archaeology and Bloodstain Pattern Analysis. This makes a world of difference as far their credibility/opinion/authority in the TS man Archaeological Bloodstain Pattern Analysis is concerned. Besides G & B are NO Shroud scholars worth their salt as actually it does seem both just ignore Barbet’s AND Ricci’s experiments.\n\n","date":"April 15, 2015 at 6:56 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196392","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"No, Max. I am not bothered about their qualifications, and very much doubt if a ‘second temple period historian’ would be any better at carrying out appropriate experiments involving blood flows. These experiments speak for themselves, and for me, anybody who actually tests their hypotheses is well worth their salt. whether or not one agrees with the conclusions drawn from them,\n\n","date":"April 15, 2015 at 7:27 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196396","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Re their absence of credentials as Second Temple period Historians (and Medieval Historians), it means their experiment is biased from the start as far as Second Temple period Roman crucifixion techniques and halakhic relevance of burial customs, rite and practices are concerned here.\n\n","date":"April 15, 2015 at 8:06 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196403","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"No test of a hypothesis is biased through failure to incorporate other people’s ideas. It is sufficient to state one’s own ideas, assumptions, even preconceptions. It really is time the host of this site made that clear.\n\n","date":"April 15, 2015 at 8:38 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196404","author":"Colin Berry","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hi Max\nI agree with you in the sense that it is always better to get as much information as possible before advancing hypotheses. Both Professors Garlaschelli and Borrini, in the field of science, did not bother or are not interested in studying ancient Jewish burial customs. Obviously they felt that the need did not arise because think they see signs on the Shroud that demonstrate that it is a forgery and it is in their interest to advance their hypothesis also because of the association to which they belong. \nThey have the right to say what they want, but from my point of view at least, their experiment is not convincing. If this will get them to study ancient burial customs  is another story.\nI am working on this topic right now.\n\n","date":"April 15, 2015 at 8:58 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196406","author":"Louis","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"There is no experimental test of a hypothesis that can’t be challenged or attacked through failure to consider other people’s ideas. The purpose of scientific research is to advance one’s own ideas and hypotheses. Other  people’s ideas can be considered in the paper’s final discussion, AFTER one has reported the results of testing one’s own ideas. Let those who have contrary ideas test their own hypotheses.\n\n","date":"April 15, 2015 at 9:07 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196408","author":"Colin Berry","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"A blood flow is a blood flow, regardless of any subsequent occurrence. Burial practices were irrelevant to this experiment. Perhaps either you or Max could explain how expertise in such things could have helped.\n\n","date":"April 15, 2015 at 9:19 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196410","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"For instance, just to mention one obvious shortcomings,  they curiously have failed to account for the void or “shadow” in terms of absence of blood staining in the otherwise continuous bloodstain patterns of the forearm blood wriggles. Would not their  allegedly ‘super genius’ forger have made them continous from the wrist?\n\n","date":"April 15, 2015 at 7:34 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196398","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Would not that tend to demonstrate instead, each of TS man’s wrists was nailed to the cross with a wooden plaque? Reminder: a wooden plaque was also used to nail Jehohanan ben Hagkol’s feet together to the cross (his remains were found in Giv’at ha-Mivtar, a Jewish neighborhood in northern East Jerusalem).\n\n","date":"April 15, 2015 at 7:50 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196400","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"“I should think it very difficult indeed for any traumatised victim to sustain a bent elbow at all.” You may be right, although a number of investigators subsequent to Barbet have disagreed, in two different ways, as I have described – either symmetrically raising and lowering the victim on the nails, or asymmetrically lurching from side to side. However, if the forearms were never more vertical than Barbet surmised, then it would be impossible for blood to flow down them.\nAs for the blood-flows being post mortem, I think Antero would agree that this is unlikely. Although blood remains liquid in quantity after death, almost all the blood in the arms would have drained downwards after the heart stopped, and the size of the blood vessels involved would make it impossible for it to drain back to the wound site, even if the body was tipped upside down. Even if it could, it would then dribble out downwards over the fingers, not back up the arms.\n\n","date":"April 15, 2015 at 7:45 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196399","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh wrote: “These experiments speak for themselves”. Yes, indeed in terms of toy/amateurish archaeological experiments!\n\n","date":"April 15, 2015 at 7:54 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196402","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"No, Max. You’re still not saying anything very coherent. Perhaps you’d like to suggest what a Doctor of Archaeology and Bloodstain Pattern Analysis might do in the way of an experiment to determine if the blood flows are realistic. And what does this mean –  “They curiously have failed to account for the void or ‘shadow’ “? Why should they? They were not trying to imitate a forger, they were aiming for realism. The fact that they did not achieve it does not demonstrate a forgery, and they do not claim it does. They do suggest that perhaps crucifixion was more vertical than generally supposed, which implies an acceptance that the blood flows might be authentic, but they do not discus whether their experiments could be improved, the better to model the pattern on the cloth. Perhaps they will.\nAnd this: “Each of TS man’s wrists was nailed to the cross with a wooden plaque.” It is unlikely that the plaque would be between the back of the hand and the cross, as the cross itself would provide an adequate surface. Johanan’s heel was nailed with the wooden plaque on the side away from the cross.\nIt has been suggested that Jesus was crucified facing the cross, in which case the wooden plaque could be on the back of the hand, and cause the interruption of the blood flow, or that Jesus’s hands were tied together in the tomb, and the blood under the ligature was rubbed away.\n\n","date":"April 15, 2015 at 8:54 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196405","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Quoting me “They curiously have failed to account for the void or ‘shadow’ you comment: “Why should they? They were not trying to imitate a forger, they were AIMING FOR REALISM (my upper cases).” \nWhich realism? Their experiment has nothing to do with archaeology. If, as you claim, they are “not trying to imitate a forger”, it implies they were trying to imitate both the bloodflows AND haematic cartography a 1st c. CE Roman crucifixion victim’s (‘ritually purified’) bloodied corpse lying suspine is supposed to leave on his burial cloth, or were they not?\n\n","date":"April 15, 2015 at 9:58 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196416","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"BTW can you prove a wooden plaque nailed on the front of the hand just cannot modify bloodflows on the back of the forearms as the blood tends to flow from the front of the wrist to the back of the forearm?\n\n","date":"April 15, 2015 at 10:13 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196417","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Colin wrote: “There is no experimental test of a hypothesis that can’t be challenged or attacked through failure to consider other people’s ideas.” \nCan Colin tell me what was G & B exact hypothesis here?\n\n","date":"April 15, 2015 at 10:20 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196418","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Reminder for Colin and Hugh (who wrongly keep asserting “(burial practices were) irrelevant to their experiments”): According to UAAR, their wanted to answer the question: “Does the imprint of the body on the Shroud does match that of a condemned posted in a location similar to the classical representations of the crucifixion and that of a bloody body lying in the tomb?”.\nCan you tell me now how come “burial practices were irrelevant” to G & B experiments”?\n\n","date":"April 15, 2015 at 10:29 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196420","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"There is no obligation on the part of researchers to state their hypotheses. A few do, most do not. They simply report the results of their experiments and their conclusions.That is one more reason for not attacking hypotheses (on the rare occasions when divulged) for failing to reflect or incorporate one’s own ideas. It is mental laziness to expect others to test one’s own ideas, or even pay lip service. If it’s your ideas, do your own hypothesis-testing  (with or without stating in advance what hypothesis you were testing).\n\n","date":"April 15, 2015 at 10:40 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196423","author":"Colin Berry","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"What is scientific cowardice and mental laziness is not to divulge one’s hypothesis and yet present one’s results as if they were purely and scientifically objective when most obviously they are not and are biased.  I do understand you back up such scientists and such toy experiments.\n\n","date":"April 15, 2015 at 11:06 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196424","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Science is never purely and scientifically objective. It’s done by human beings, not pre-programmed electronic  robots. That’s why we put our ‘subjective’ hypotheses to the experimental test. It’s the interpretation of those experimental tests that needs to be objective, meaning that the same could have been arrived at by a totally disinterested outsider invited to examine the data (like a peer-review journal referee) with no personal axe to grind.\n\n","date":"April 15, 2015 at 11:17 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196426","author":"Colin Berry","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Do you really think G & B thought they were just subjective and their allegedly scientific’ experiment was likely biased? Are you kidding? \nMost likely,they thought they were as objective/rational as possible and their experiments were truly scientific/rational, which they are not.\n\n","date":"April 15, 2015 at 11:28 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196427","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"I don’t know what they were thinking at the hypothesizing stage, but then neither do you for that matter. But as I’ve said, it’s of absolutely no relevance. It’s the final data that matter, and the researchers’ conclusions, with or without the initial hypothesis being articulated.\nStop subjecting scientists to the third degree. It’s not how the merits v demerits of a case are judged. Stick to the facts.\n\n","date":"April 15, 2015 at 11:48 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196430","author":"Colin Berry","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Still asking Hugh: Can you prove a wooden plaque nailed on the front of the hand just cannot modify bloodflows on the back of the forearms as the blood tends to flow from the front of the wrist to the back of the forearm?\n\n","date":"April 15, 2015 at 11:44 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196428","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Actually these apparent voids in the bloodflows are totally consistent with nailing  a wooden plaque on the front of each hand.\n\n","date":"April 15, 2015 at 11:49 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196431","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Colin wrote: “I don’t know what they (G & B) were thinking at the hypothesizing stage, but then neither do you for that matter.”\nSorry but I do think this is an easy guess: they just thought they were rational (in their exeriments and interpretations. This is not a wild guess at all.\n\n","date":"April 15, 2015 at 12:13 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196432","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Typo: “Does the imprint of the body on the Shroud match that of a condemned posted in a location similar to the classical representations of the crucifixion and that of a bloody body lying in the tomb?”.\n\n","date":"April 15, 2015 at 10:31 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196421","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"If the image is a man-made forgery, then the blood flows were added for effect. In fact all the blood on the Shroud is added for effect. Much has been made of the scourge marks — too perfect, too artistic – claim some. It’s a valid observation, the scourge marks are very symmetrical and one would almost expect an artist’s hand at work (if one doesn’t consider a Roman scourger an artist of sorts).\nBut then why would an artist add extraneous blood flows? Why not more blood along the forehead – or in the spot where the spear pierced his side – the places an audience would expect to see blood? Why odd arm blood flows and epsilons? Ultra-realism from a medieval artist? Not likely.\n\n","date":"April 15, 2015 at 12:38 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196435","author":"David Goulet","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"“Hugh: Can you prove…” Don’t go on, Max; I’m a scientist, not a mathematician. Scientists don’t prove things, they demonstrate things. But they rarely demonstrate non-things. If you think adding a wooden plaque to the entry place on the wrist before nailing it to a cross has some effect on the blood flow from the exit wound, thats fine. I just don’t believe you. I don’t care to demonstrate why, I just think you’re wrong, and you have absolutely no comeback to my opinion unless you can provide some smidgin of evidence to suggest you might be right.\n“According to UAAR, their wanted to answer the question: “Does the imprint of the body on the Shroud does match that of a condemned posted in a location similar to the classical representations of the crucifixion and that of a bloody body lying in the tomb?”.” Well, no, Max, you’ve made that up. First you demand a hypothesis, and because Colin won’t give you one, you make one up. For the benefit of our public, this is what the UAAR press release actually says: “The scope of work of Borrini and Garlaschelli was to verify – using forensic techniques of BPA (Bloodstain Pattern Analysis – analysis of the shape of the blood stains) – what should be the posture of a human body so that the rivulets of blood you have as it appears on the footprint human in the Shroud of Turin.”\nIt really doesn’t matter whether Garlaschelli and Borrini are devoted advocates for the Shroud or fanatical atheists intent on the downfall of Christianity. They were looking for a correct posture to achieve blood flows like that of the Shroud. They narrowed their field to the arm and the side-wound, and tried a variety of postures for each, none of which matched the Shroud flows well. They could try different postures, or different blood, or different conditions on the arm, and perhaps they will. To claim they have shown that the blood on the Shroud is not the result of a crucifixion would be unjustified, and they do not claim it. They do claim that their results do not match those of the Shroud, which is true, and they do add “ma piuttosto a una rappresentazione artistica o didascalica,” which is assuming too much at this stage.\n\n","date":"April 15, 2015 at 1:15 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196438","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Some photos of my old experiments:\nhttps://app.box.com/s/qd51zbpmli6nc21mfggwpzgp7ka3tlze\n# 2: warning: the true configuration of the experiment was not exactly that shown in the photo. In fact, my forearm formed roughly a 60° angle with horizontal and the elbow was slightly bent.\n#1: The result to be compared with the TS\n#3: close-up of the elbow showing the shape and the final clot, very similar to the “out-of-image” blood flow on the TS\n#4: Blood stain on my forehead when I tensed the muscles of my forehead. \nComments:\n #1 #2 and #3: I made several experiments (not shown). It seems impossible to obtain a blood rivulet along the back of the forearm if its inclination is less than 60°. However, with an inclination of about 60°, the inclination of the arm being about 30°, the natural result matches what we see on the TS. This includes the “out-of-image” blood with its final clot.\nB. and G. experiments are truly too simple and their conclusion is not at all reliable.\nPreliminary conclusion: if a medieval forger painted the Shroud, he had to perform some preliminary experiments with real blood on a person in order to paint the blood on the Shroud, including the “out-of-image” blood stain. \nIn fact, the problem of the bloodstain pattern is much more complex… And my experiments were very preliminary experiments.\nHere is what Dr. Frederic Zugibe wrote (SSG, October 3, 2005):\n”\nDear Dr. Thibault,and others\nTHINGS ARE NOT ALWAYS WHAT THEY SEEM TO BE!\nI would like to comment concerning your blood flow theories. I don’t wish to be\nan iconoclast but you are delving into a very specialized area of forensic\nreconstruction that takes years of specialized training and experience. As you\nperhaps know I have been studying blood patterns on deceased individuals on a\ndaily basis for over 34 years, I have testified in court on numerous occasions\nregarding blood patterns and have published papers in the area of patterned\ninjuries. I enjoyed reading the experiment you performed on yourself in a sense\nof self sacrifice. First of all, there is a complete difference in blood pattern\nreconstruction in the living versus the deceased in most instances. In addition\na knowledge of Human Anatomy and Physiology is of paramount importance in\nunderstanding how the one way valves function within the blood vessels in the\ncirculation through the arms and legs.\nAlso, as I previously related, in violent type deaths, fibrinolysins and altered\nclotting factors are produced causing a fluidity of blood. Moreover there is an\nabsence of the normal contractions of blood vessels that play a prominent role\nin bleeding control.\nAfter death, when the arms are held above the head in the position of\ncrucifixion, the blood in the arms would not flow backwards because the flow is\ngoverned by one way valves unless they are defective as in varicose veins. If\nthe arms of the decedent are above the head in crucifixion, at the time of\ndeath, the ventricles of the heart ejects the blood into the circulation causing\nthe veins to be filled (creating pressure in the veins of the arms on the one\nway valves). In this scenario, when the nail is initially pulled out of the\nhands during removal from the cross, blood would flow out of the hand wound down\nthe arm. The nature of the flow is governed by many variables of position in\ndetaching the victim from the cross and in the act of lowering him where a\nnumber of positions are assumed. It is also of paramount importance to know that\nthe amount of blood on a victim appears many times greater than it actually is.\nI have investigated numerous murder scenes with blood all over the victim, on\nthe walls and floors and when forensic calculations are made, the amount of\nblood extruded is found to be many times less than it appeared to be. It is\ndifficult for the uninitiated to understand these simple forensic concepts that\nonly come with training and experience. If I were to title this scenario, it\nwould be THINGS ARE NOT ALWAYS WHAT THEY SEEM TO BE! …”\nComments welcome.\nThibault.\n\n","date":"April 15, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196448","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh:\nIn these descriptions, Barbet considers only the twin flows from the wrist wound, not the flows along the arm. With reference to OK’s diagram above, there are three flows from the wound, represented as two short red arrows and one long one. Barbet considers only the shorter two. In order for blood to flow down the arm towards the elbow, his angles have to be considerably steepened. He does not seem to have considered the possibility that the arms may have been bent at the elbow at all.\n\nNevertheless, it would be interesting if Garlaschelli and Borrini were to carry out more experiments with Barbet’s descriptions in mind.\nBut the blood does not flow down in continuous stream  on the side of the arm towards the elbow. It flows down on the upper, near-horizontal surface of the arm, occasionally dropping down the arms.\nSee:\n\nHere is the scheme:\n\nIn my opinion this is consistent with Garlaschelli & Borrini results. But truly, on part because they actually didn’t simulate such flow.\n\n","date":"April 15, 2015 at 2:36 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196446","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Thank you OK. \nI can’t can’t imagine how forger included all these features into the image on the Shroud. Why forger believed Jesus was crucified by nailing through the wrists rather than the palm? IN 14th centuary what was influenced the forger to imagine Jesus was crucified by nailing through his wrists?\n\n","date":"April 15, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196453","author":"Sampath Fernando","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, you wrote: “If you think adding a wooden plaque to the entry place on the wrist before nailing it to a cross has some effect on the blood flow from the exit wound, thats fine. I just don’t believe you. I don’t care to demonstrate why, I JUST THINK (upper cases mine) you’re wrong (my comment: how scientific for a scientist!), and you have absolutely no comeback to my opinion unless you can provide some smidgin of evidence to suggest you might be right.”\nE.g. just take a good look at Dali’s Crucifixion above. Is it too much of a strain on your ‘scientific’ imagination to understand how a wooden plaque nailed on the front of the hand CAN modify bloodflows on the back of the forearms as the blood tends to flow from the front of the wrist to the back of the forearm and cause APPARENT voids (shadows) in the bloodflows (as seen on the back of the forearms from the wrist)?\n\n","date":"April 15, 2015 at 4:29 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196451","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Or take a good look at Ricci’s reconstruction of the TS man’s hanging on the cross and do consider the possibily for the two wooden plaques with nail — during crucifixion and when pulled out of the hands during removal from the cross or during — to cause ante and post-mortem blood to flow out of the hand wound down the arm.\n\n","date":"April 15, 2015 at 5:04 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196456","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"You also wrote: “To claim they have shown that the blood on the Shroud is not the result of a crucifixion would be unjustified, and they do not claim it. They do claim that their results do not match those of the Shroud, which is true.” \nTheir alleged ‘reconstructions’ for gullible atheists are bogus and their prose too much circonvoluted as if they wanted to hide their utter failure to reach any really conclusive evidence in favor of forgery.\n\n","date":"April 15, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196454","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"I’ve no idea what you’re talking about, Max.\nThanks very much for your photo, Thibault, but particularly for Fred Zugibe’s letter, which I don’t fully understand. He seems to suggest that at least two of my suppositions are incorrect, which is interesting, firstly that a crucified person’s blood may stay liquid for much longer than normal, and secondly that blood vessel contraction would also be reduced, so liquid blood could still flow out of a hand wound after death. That’s fair enough. However he also says that: “the blood in the arms would not flow backwards because the flow is  governed by one way valves.” I’m not sure what he means here. Is he saying that the blood would not drain down towards the chest? Surely the one-way valves in the veins of the arm prevent the blood from flowing towards the hand, not towards the chest. After all the veins are taking blood back from the extremities to the heart, the valves allow that. Or is he saying that the blood still present in the veins after death could not drain out of the wrist, even if it were lowered, because the valves would prevent it. That makes a lot more sense. However he does say that some blood might be expected to escape from the wound after the nail were pulled out. It’s not obvious to me where from. It’s all very interesting though.\n\n","date":"April 15, 2015 at 5:33 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196459","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, you wrote you’ve no idea what I’am talking about, Max” BUT you JUST THINK (upper cases mine) I’m wrong!???? \nMethinks you cannot think in 3D. The two small rivulets of blood are from the exit wound (back of the hand) and the blood flows on the back of the forearms are from the entry wound (front of the hand not the exit one). Whence the discontinuity/apparent interruption of the blood flows on the back of both forearms.\n\n","date":"April 15, 2015 at 5:51 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196464","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"That’s much clearer; thanks, Max. Now all you need to do is to experiment to find a posture by which blood from the front of the hand can end up on the back of the arm, and you demonstrate your point perfectly. I don’t think you can, but at least I know what it is I disagree with now!\n\n","date":"April 15, 2015 at 5:55 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196465","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, you wrote: “Now all you need to do is to experiment to find a posture by which blood from the front of the hand can end up on the back of the arm.”\nAgain just take a good look at Ricci’s AND G & B’s reconstruction. In the latter’s, most obviously the blood flow from the exit wound on the back of the left wrist tends to flow to the front of the left forearms. In the former’s, most obviously too the blood flows from the entry wound on the front of the wrists tends to flow to the back of the forearms.\n\n","date":"April 15, 2015 at 6:33 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196466","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Now just imagine a wooden plaque nailed on the front of each hand and each front of the forearms extended or turned three-quarter upwards.\n\n","date":"April 15, 2015 at 6:55 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196469","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"No, Max. Blood from either side could drip down around the arm to meet somewhere near the elbow, as the various reconstructions demonstrate, but blood from the front cannot curl over to the back to produce the pattern shown on the Shroud. But all you need to do is to experiment to find a posture by which blood from the front of the hand can end up on the back of the arm, and you demonstrate your point perfectly.\n\n","date":"April 16, 2015 at 2:19 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196485","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"O.K: Your arrows and lines on the pictures are fanciful. You retouch the pictures as you want. \nThibault, your pictures are insufficient. We cannot see the whole process and the body position in a sequence. \nGarlaschelli experiment is not so impressive. It proofs what is of common sense. At least two evident things.\nBarber’s theory about the Christ doing continuous flexions of the arms to survive is a crazy fancy. In regards to the direction of the trails of blood they would run in diverse directions.\nZugibe’s theory of the post washing marks. In a lying corpse the trails of blood would run in a very different direction. See the side wound, for example. \nIt’s better than nothing.\n\n","date":"April 16, 2015 at 2:43 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196487","author":"David Mo","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"O.K: Your arrows and lines on the pictures are fanciful. You retouch the pictures as you want. ","date":"April 16, 2015 at 3:13 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196490","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"BTW can David Mo criticize G & B’s allegedly ‘scientific’ bloodstain patern analyseses and experiments too or MOST CURIOUSLY just cannot he?\n\n","date":"April 16, 2015 at 7:52 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196509","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"“Thibault, your pictures are insufficient. We cannot see the whole process and the body position in a sequence”.\nTrue. I was alone when I made the experiments. Therefore, I made the photographs afterwards.\nNevertheless, I stay on my position: the “out-of-image” blood rivulet and its final blood clot is truly consistent with the crucifixion.\nMoreover, I don’t think that a medieval forger would/could have to paint this “detail”.\nWhy ? How ?\nI am ready to perform new simple experiments.\nSome ideas ?\n\n","date":"April 17, 2015 at 3:41 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196648","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"I am ready to perform new simple experiments.\nSome ideas ?\nPut your blood on the upper surface of the arm -just like I have indicated on illustrations, and let it flow down, unless it comes to the arm side. Let we see whether the results are comparable with the left arm of the Shroud Man.\n\n","date":"April 17, 2015 at 5:00 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196651","author":"O.K.","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"No, Hugh. With the outer surface of the crucified’s anterior foream turned at least three-quarter upwards and through gravity, the blood flow from the entry wound on the front of the nailed wrist can tend to flow to the back of the forearm and follow the latter’s CONTRACTED extensor digiti minimi muscle as we can see it on the TS image.\n\n","date":"April 16, 2015 at 2:55 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196488","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"I long to see a demonstration…\n\n","date":"April 16, 2015 at 3:45 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196494","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"I long to see a demonstration to the contrary…\n\n","date":"April 16, 2015 at 7:01 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196504","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"No, Max, that’s absurd. Garlaschelli’s, Thibault’s and Ricci’s versions are all illustrations to the contrary. All this ‘demonstrate the non-appearance of the elephant’ business is nonsensical.\n\n","date":"April 16, 2015 at 8:13 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196512","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"No Hugh.  Reminder:  the TS man’s extensor digiti minimi muscle of each posterior forearms were CONTRACTED/TETANISED. Now neither Garlaschelli’s, nor Thilbault’s are!  Besides we cannot see the crucified’s extensor digiti minimi muscle of the posterior forearms in Ricci’s reconstruction?!!!!!!!!!!!!!!! Are you kidding?\n\n","date":"April 16, 2015 at 9:19 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196518","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Addition: Neither Garlaschelli’s nor Thibault’s posterior forerms are turned or extended at least three-quarter UPWARDS?!!!!!!!\n\n","date":"April 16, 2015 at 9:23 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196519","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"For instance, in Dali’s painting they are.\n\n","date":"April 16, 2015 at 9:25 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196520","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Typo (sorry): Addition: Neither Garlaschelli’s nor Thibault’s ANTEterior forearms are turned or extended at least three-quarter UPWARDS?!!!!!!!\n\n","date":"April 16, 2015 at 9:44 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196521","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"So, let me get this straight. You’d like me to get a nailed, tetanised arm and fresh blood from someone recently tortured, arrange the arm so that the front is turned three quarters upright, and drip blood down it just to demonstrate that the flow on the Shroud is unrealistic? Well, I’m sorry, Max but if you had any scientific education at all you’d know that that simply isn’t how science works. If I say an alien painted the Shroud and you disagree, you are not required to say why, or produce lots of pictures by aliens which look nothing like it; it is up to me to produce evidence for my claim. If you think blood can turn corkscrews around arms and I disagree, I am not constrained to say why, or to produce tortured bodies which look nothing like it, it is up to you to produce evidence for your claim. Which you have failed to do.\nDali’s painting would have been good except that there are no blood flows on it at all…\n\n","date":"April 16, 2015 at 9:48 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196522","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"First Question to Hugh: do really you think the extendor muscles at the back of the forearm of a crucified victim nailed in his wrists to a cross are as relaxed as in Garlaschelli’s and Thibault’s reconstruction?\n\n","date":"April 16, 2015 at 10:17 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196525","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Second question: do you realy think Thibault’s or even Garlaschelli’s forearms are as muscular as those of a ‘naggar’ (Aramaic for ‘builder’ for ‘stone cutter AND carpenter’; in Greek ‘tekton’)?\n\n","date":"April 16, 2015 at 10:26 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196526","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Exmple of a muscular back of the forearm, link at","date":"April 16, 2015 at 10:40 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196527","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Besides unlike the TS man’s contracted/tetanised extensor muscles, neither on Garlaschelli’s nor on Thibault’s (non-contracted) extentor muscles there are voids (apparent interruption) in the blood flow from the wrist. Absent an airgap or screening object(s), indeed this can be due to the posture (the front of the forearms turned or extended upwards) by which blood from the front of the hand can end up on the back of the forearm.\n\n","date":"April 16, 2015 at 10:03 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196524","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Nope.\n\n","date":"April 16, 2015 at 10:42 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196528","author":"Hugh Farey","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Can you answer my first two questions or cannot you?\n\n","date":"April 16, 2015 at 10:45 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196529","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh you wrote: “Dali’s painting would have been good except that there are no blood flows on it at all…”. \nYou just overlook one ‘small fact’ here: \nIn Dali’s painting, the posture (the front of the forearms turned upwards) is possible. Anatomically speaking this is no wild idea at all! If you just cannot imagine an anatomical fact, nope indeed!\n\n","date":"April 16, 2015 at 10:59 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196532","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Firstly, your arms resting at an angle of 65^o (sagging position), turn the front of your hands and forearms upwards, then just turn your hand forward 90° at wrist level. Secondly raised your arms from 65^o to 68^o, 69^o or 70^o (raised position). Now you get the posture. Neither Garlaschelli nor even Thibault or Ricci checked the posture that is anatomically most plausible as far as the TS crucifixion victim is concerned..\n\n","date":"April 16, 2015 at 11:27 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196537","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, you wrote: “blood from the front cannot curl over to the back to produce the pattern shown on the Shroud”. It can as far as ante AND post-mortem blood flow reconstructions are concerned. Methinks you just cannot think and see the difference in crucifixion and post-crucifixion blood patterns (the latter in terms of nail removal).\n\n","date":"April 16, 2015 at 11:51 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196540","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Typos: \nSecond question: do you really think Thibault’s or even Garlaschelli’s forearms are as SINEWY as those of a ‘naggar’ (Aramaic for ‘builder’ AS ‘stone cutter AND carpenter’; in Greek ‘tekton’)?\nExample of a SINEWY back of the forearm, link at","date":"April 16, 2015 at 12:05 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196543","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Hugh, IF AND ONLY IF you take a good look at the figure above, you’ll notice the very shape of the back of the right forearm blood flow is TOTALLY consistent with the  bulging extensor carpis ulnaris and digiti minimi muscles.\n\n","date":"April 16, 2015 at 12:18 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196545","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"…in terms of CHAIN-LIKE SHAPED crests and valleys.\n\n","date":"April 16, 2015 at 12:29 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196546","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Additional illustration of chain-like shaped bulging extensor carpis ulnaris and digiti minimi muscles of the back of the right forearm. Link at\nhttp://www.muscleandfitness.com/sites/muscleandfitness.com/files/styles/full_node_image_1090x614/public/media/delt-workout-main.jpg?itok=dlNbEDKl\n\n","date":"April 16, 2015 at 12:52 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196549","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"More. Link at","date":"April 16, 2015 at 1:02 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196550","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Re the bloodstain patterns on the TS man’s back of the forearms issue: \nTo paraphrase Bernard Werber, I would say, between what I think, what I want to say, what I believe I say, what I say, what you want to hear, what you believe you hear, what you hear, what you want to understand, what you believe you understand, what you understand…there are 10 possibilities that we might have some problem communicating. But I will try to make myself as clear as possible anyway.\nHere we have two different types of bloodstains most likely altered via burial procedures (remoistening and drying) and the ravages of time (fire and possibly flaking): one transferred when liquid remoistened dried blood has come into contact with the linen surface and three others transferred when the moist or wet surface of the in-soaked wrapping burial sheet comes into contact with dried or half-dried blood.\nWe also have three different types of bloods as far as event chronology is concerned, namely ante-mortem and post-mortem crucifixion blood (the latter in terms of nail removal) + burial post-mortem blood. \n(To be continued)\n\n","date":"April 17, 2015 at 6:49 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196620","author":"Max patrick Hamon","site":"shroudstory"},{"title":"New Garlaschelli and Borrini Study","post":"Typo: ANOTHER (instead of ‘three others’)\n\n","date":"April 17, 2015 at 7:00 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","id":"comment-196621","author":"Max patrick Hamon","site":"shroudstory"}]
