[{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Just in case some of you might lose the thread, here is my reply to Hugh:\n  Hugh, lately Mr Collin Berry wrote my theory about the image formation process (due to a specific Judean burial ritual) was “untestable”.\n  He is totally wrong as he is totally ignorant of experimental archaeology (he would better keep in mind chemistry cannot explain/account for everything he sees or thinks he see on the TS).\n  Experimental archaeology e.g. could show you how blood on stiff rigid corpse can be transferred to a shroud, “without being rubbed or washed off”; how post portem handling of the corpse on burial, the presence of possible pre-burial loin and head cloths can account for most of intriguing bloodstains on the famous cloth etc.\n  Re whether the body was washed or not, the issue shall not be tackled from a modern viewpoint as the correct answer just depends on one’s capacity to archaeologically reconstruct the event (most likely a Judean burial) according to a specific purifying and drying out ritual implying shed (innocent) blood being kept/buried with the body.\n  The only snag with true experimental archaeology is it has a cost and just cannot be done in a kitchen.\n\n","date":"February 19, 2013 at 7:47 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24821","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Typo: the use of possible pre-burial loin and head cloths\n\n","date":"February 19, 2013 at 7:48 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24823","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"+typo: The only snag with experimental archaeology in the state of the art is it has a cost and just cannot be done in a kitchen.\n\n","date":"February 19, 2013 at 7:50 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24824","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Hugh, have you taken this kind of practical experimentation into account: http://shroudofjesus.com/page6.html\n\n","date":"February 19, 2013 at 7:56 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24827","author":"David Rolfe","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Lavoie doesn’t take at all into account the possible presence of an object (a linen head band with Greek and Latin letterings folded into a U shape and placed over the face). A fragment of the relic still exist.\n\n","date":"February 19, 2013 at 9:32 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24854","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Yes indeed; my Point 3 addresses exactly that. It requires that the blood-matted hair be completely dry, or kept conveniently out of the way for the “trickles” to register, and then for the shroud to be completely re-shaped for the hair image to register afterwards. The experiment referred to does not address the very similar flows on the back of the head at all. The complexities of all these bloodstains may not be inexplicable (indeed, I think they must be explicable), but it should not be assumed that a “natural” explanation is per se more likely than a “manufactured” one. There is no Occam’s razor here.\n\n","date":"February 19, 2013 at 9:39 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24857","author":"Hugh Farey","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"What is “natural” or “(accidentally) manufactured” when it comes to observe a funerary ritual as far as the TS image s concerned?\n\n","date":"February 19, 2013 at 9:50 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24859","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"I first read about exactly the same thing in… 1988. Now the Lavoie copyright reads 1998… How come?\n\n","date":"February 19, 2013 at 1:42 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24891","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"David, thanks. I had not seen that before.\n\n","date":"February 19, 2013 at 8:23 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24835","author":"Paulette","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Reminder for both Hugh and Matthias: besides the possible use of a pre-burial loin cloth, the Turin Shroud man’s pronounced convex curvature of the spine (lordosis) can also account for the two rivulets (stiff rigid body tightly wrapped-up in in-soaked inner cloth (aqueous alkaline solution) and laid in extra height first on the left then on the right side for purifying and drying out purposes.\n\n","date":"February 19, 2013 at 9:17 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24853","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"While I don’t find myself able to go along with all Max’s hypotheses, I do agree that for blood rivulets to wander erratically back and forth across the shroud would need a certain amount of turning this way and that, not to mention times of stasis for the blood to dry, and/or remoisten.\n\n","date":"February 19, 2013 at 9:44 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24858","author":"Hugh Farey","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Matthias: I can’t believe you actually read my comment. You begin “I’d like you to explain why you think there is no blood on the small of the back,” when my entire post refers to the blood which is indeed found on the shroud at that position. You say “I can’t see why the trail on the small of the back might not be blood” when I have never disputed that point. You say “If you mimic the shroud figure’s pose like I did you will naturally see that blood would flow down the from the wrists on the underside of the forearms and collect around the hip area.” Indeed it might. You say “why do you conclude that this isn’t blood?” I conclude no such thing.\nAlthough I am truly loath to use capital letters, I beg your (and others’) indulgence if I try to make my point clearer in this way.\nThere is no POOL of blood in the small of the back.\nThere are TRICKLES of blood from one side to the other.\nIt is these trickles that need to be explained. You say that a mass of blood might collect around the hip areas “possibly then trailing off across the small of the back.” Possible, I dare say, but how? Try lying down on a sheet and pouring… tomato sauce? syrup? choose your own blood substitute… wherever you feel appropriate, and then getting it to trickle across your back. Twice. Without smudging. It’s really not as simple as you imply. Go back to the shroud and look at it. You will notice that on the dorsal image, on the “spear wound” side there are a number of blood ‘wriggles’ but no apparent pool. On the “hand wound” side,  almost entirely obliterated by the burn marks, there does appear to be a possible pool, much distorted by the water stains, although it is far from obvious.\n\n","date":"February 19, 2013 at 10:10 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24862","author":"Hugh Farey","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Hugh, fair point I apologise. I read your post late at night here in Australia, and regrettably rushed the read and response!\nI am yet to experiment with tomato ketchup or whatever! Potentially I think if the body was in a stiffened post mortem body state (forgotten the tehcnical term) then the blood could trickle down from the underside of the forearms across the lower back. But only a theory!\nI agree there is no pooling of blood.\n\n","date":"February 19, 2013 at 9:58 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24947","author":"Matthias","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Don’t know if anyone has considered this scenario, but the blood flows maybe a result of the body reanimating during the resurrection. The body was washed prior to being wrapped in the clean shroud, so there wouldn’t be any blood on the shroud prior to the resurrection event. During the resurrection, the heart begins beating and blood flows from the wounds. There isn’t enough time for the blood to pool because the reanimated body is about to leave the shroud, and it is this “leaving” which causes the body image. Simples.\n\n","date":"February 20, 2013 at 11:46 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25050","author":"ChrisB","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Simples? If only. If the body was washed before being enshrouded, then what are those trickles doing along the arms? Are they from Jesus waving his arms about just before resurrection? it is clear that ChrisB knows rather more about the biology of resurrection than I do. When the heart begins beating, for instance, does it not immediately pump out a fair proportion of the blood through the five major holes in the body? How quickly does Jesus sit up, and doesn’t he feel so faint that he immediately loses consciousness? And having re-animated, does does he flip the shroud off with his arms before sitting up? Or does he slide out sideways? Or sit up with the shroud still covering his face? Although these questions sound flippant, they have direct implications for the appearance of the image on the shroud, and cannot be avoided if we follow ChrisB’s line of thinking. Other resurrection experts have assumed the body simply de-materialised, with or without a burst of energy of one kind or another, the shroud collapsing through the void thus created, and some non-believers think the shroud was simply folded back by the Essenes, who lifted Jesus, alive or dead, away, leaving the cloth behind.\n\n","date":"February 20, 2013 at 12:18 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25054","author":"Hugh Farey","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Trickles along the arms are from the wrist wounds after the heart started beating, as are all the other blood stains. Assuming a “dematerializing” resurrection took place not long after the heart began beating then this could explain why there is no pooling.\nOf course to believe this scenario one has to believe that a resurrection actually took place.\n\n","date":"February 20, 2013 at 2:42 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25064","author":"ChrisB","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Along the topic of bloodstains, would be interested in general comments regarding the color of the off-elbow bloodstain.  Visually, does this appear different than the majority of other stains?  If so, could this be explained by gravity flow/position or does it imply that the blood in this region exhibits greater oxidation than most other stains?\n\n","date":"February 19, 2013 at 11:35 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24878","author":"Kelly Kearse","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Hugh,\n– I haven’t kept up as well as I should, but do you believe that the stains are real blood?\n— Rich\n\n","date":"February 19, 2013 at 2:35 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24899","author":"Richard Savage","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"On the whole, my view is that the results of the multitudes of tests carried out on the ‘blood’ do indicate that it is real blood. I’d even go as far as to say human blood. Whether it derives from injuries to a body which lay on the shroud I think is less well demonstrated and far from proven. The standard riposte to this statement is that no forger would have done this or that, and that therefore a natural ‘dead body’ explanation is the only one possible. This dichotomous view of the shroud – that it can only be either an out and out deliberate fake or the inevitable result of a temporarily wrapped corpse – in my view ignores quite a gamut of intermediate alternatives, including the deliberate enhancement of a genuine relic, a largely accidental result of some experimentation, a replacement for a relic destroyed by fire, a backing cloth for something else, and so on. Perhaps it is mere obduracy on my part, but whenever I’m offered a choice between A and B, I usually try to find out if there might be a C.\n\n","date":"February 19, 2013 at 4:08 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24910","author":"Hugh Farey","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"good points Hugh, there is not necessarily a black or white answer/s. Like you, I think there is the potential that the shroud is an authentic relic of Christs’s crucifixion, however this was modified over time by things like blood touch ups etc.\n\n","date":"February 19, 2013 at 10:01 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24948","author":"Matthias","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Hugh,\n– I meant to thank you before, but got distracted…\n– Thanks.\n— Rich\n\n","date":"February 22, 2013 at 1:47 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25304","author":"Richard Savage","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Note to Richard and Hugh:  Check posting of Jan 30, 2013, “Guest Posting by Kelly Kearse: Distinguishing human blood from that of other species”, a detailed posting by Kelly.  The standard serological tests are sufficient to distinguish human and non-human primate blood from that of other animals.  Regarding non-human primate blood other means are required using other blood components.  The posting includes the following: \n“To date, the only study that directly addresses the human nature of the Shroud bloodstains is an often overlooked report by Baima Ballone et al. that evaluated the expression of additional blood components found on red blood cells, specifically the M,N, and S antigens. (Such antigens have also been studied in the blood analysis of King Tut). The conclusion was that the bloodstains on the Shroud are characterized as MNS positive. What is most significant about these studies is that unlike M and N antigens, which are shared between certain primates and humans, the S antigen is exclusive to humans only. No S counterpart exists in other species, including apes or monkeys. This point was not emphasized (or mentioned) in the report, as the significance of this relationship among primates was not fully elucidated until several years later (in non-Shroud related studies). Of the six serological analyses of blood components on the Shroud, this brief study remains the single most definitive piece of serological evidence that directly addresses the human origin of the blood on the Shroud. For a more detailed discussion see: “Empirical evidence that the blood on the Shroud of Turin is of human origin: Is the current data sufficient?” recently published on shroud.com. The full-length manuscript is available at http://www.shroud.com/pdfs/kearse1.pdf.”\nAlso mentioned is that the tests were carried out some thirty years ago, and better tests are now available. \nRegarding Hugh’s comment: “obduracy on my part(?)” I can only say “Probably!” Kelly comments: “Moreover, Adler has effectively commented on the difficulties a forger would encounter in trying to apply clotting blood [of any species] to various regions on the Shroud.”\n\n","date":"February 19, 2013 at 5:22 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24917","author":"daveb of wellington nz","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Further thought. Why would a touch up with blood include the placement of a trail of blood across the lower back? It doesn’t make any sense, in terms of an attempt to try and “sell” the relic as the authentic burial cloth of Jesus. Side wound – yes. Wounds on head – yes. Wrist wound – no. Trickle of blood across small of back – no.\nOf course, there is always the possibility that some monk thought a trickle of blood across the back would be a nice addition. But I am not convinced. There is no biblical or artistic precedence for it.\n\n","date":"February 20, 2013 at 2:08 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24972","author":"Matthias","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"did a quick experiment with thick orange juice, lying down with my torso raised at about 20-30 degrees. juice was poured back from just behind wrist position, its trail carried through my hip region, and extended some way through to my back. Repeated on the other side, and there were two trails nearly connecting, approaching something not too dissimilar to the trail on the shroud back image. I’m slightly stocky around the mid-rift, a lean Jesus is somewhat different, this would no doubt have impact! (possibly would get more shroud like result with leaner body under experiment!)\nNot very scientific, I know, but I thought interesting at least\n\n","date":"February 20, 2013 at 4:21 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24984","author":"Matthias","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"I love it! That’s real science, and it is so much more valuable to be able to say “this is what happened” than “this is what would have happened.” An experiment like that leads on to lots of interesting follow-ups – how much blood had to flow from each wrist to produce the required trickle, did it smudge or seep in to the cloth, do adjustments to the viscosity (vide daveb) make a difference and so on. Nobody, as far as I know, has explored this area at all well, so the field is wide open.\n\n","date":"February 20, 2013 at 7:04 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25004","author":"Hugh Farey","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Hi Matthias, like Hugh I also think this is a very interesting experiment and might open up a new explanation for the mysterious double blood trails at the back. I am generally a sceptic but this sort of subtle unexpected blood trail would start moving my stance a bit or at least make the explanation by means of a cunning forger more difficult to swallow. Well done for actually trying out this out … I might even be inspired enough when I’m having my birthday celebration drinks tonight to try it with some tomato juice to see how close to the intertwining pattern you can get (yes, my wife already thinks I’m bonkers;).\n\n","date":"February 20, 2013 at 12:18 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25055","author":"ArtScience","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"ha ha yes my wife definitely thinks I am bonkers!\nThanks. Yes the trails along the small of the back are very interesting and curious. If you can, I’d be interested in what you find from a self experiment!!!!\nStill lots of questions / issues with my theory….\n\n","date":"February 20, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25076","author":"Matthias","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"A question would have to be when did alleged trickle occur, on the cross or during transport to the tomb?  We don’t know how he was transported, maybe two men with body in a carrying sheet, maybe some other means, perhaps strapped over a donkey (but rigor mortis could be a problem this way).  To get it closer to blood viscosity, suggest trying the experiment with vegetable oil, see if you get any closer to the same path, Might be a problem seeing the path clearly unless you do it with a separate observer.\n\n","date":"February 20, 2013 at 6:04 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-24997","author":"daveb of wellington nz","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"El “deliberate enhancement of a genuine relic” es IMPOSIBLE.\nNinguna sangre añadida podría mantener el color ROJO de la sangre tal como se muestra en la Sábana, y ninguna sangre añadida podría adoptar la forma y los bordes tal como aparecen en la Sábana. Las experiencias en el laboratorio no dan esos resultados.\nEn el suplicio de Jesus de Nazaret se dan todas las circunstancias que favorecen la aparición de un DIC, una “consumptive coagulopathy” o “disseminated intravascular coagulopathy”, como son el enorme politraumatismo de partes blandas (los azotes) y los traumas de la propia crucifixión.\nEsto ya ha sido apuntado por Bergeron en 2011 (aunque no he podido leer su trabajo) y es recogido por  Svensson y Heimburger en “Forensic aspects and blood chemistry of the Turin Shroud Man”.\nEn el DIC hay unos enormes trastornos de los fenómenos de coagulación y hemorragia, además de intensa hemolisis (destrucción de glóbulos rojos) con aumento de la bilirrubina indirecta (que podría tener cierta relación con el color rojo).\nLa patogenia de este gravísimo trastorno era desconocida hasta hace pocos años (he visto morir en muy pocas horas muchos pacientes con él), pero afortunadamente hoy día es bien conocido y tratado médicamente.\nCreo que es un camino en el que se debe profundizar, aunque en sus aspectos macroscópicos (observación directa de los comportamientos de las hemorragias, coagulaciones y lisis con nuevas hemorragias) sea muy poco factible pues el tratamiento se instaura de inmediato ante el primer signo de un CID.\nCarlos Otal\n\n","date":"February 20, 2013 at 6:19 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25000","author":"escipion","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"To Kelly et al re the colour/nature of the off-elbow-tipped bloodstain:\nThe archaeological blood stain pattern analytical pieces of evidence indicate the TSM’s body was ‘pre-washed’ via its very long burial sheet used as ‘purifying medium’ (see undisturbed permanent red bloodstains, neat tidy wound transfer contact patterns, shooting-star-shaped like diluted blood stain passive pattern off elbow-tip). \nMost likely the Shroud was soaked in aqueous alkaline solution, tautly wrapped lengthwise as inner burial cloth and compressed widthwise with outer burial cloths to tightly wrap up the stiff rigid body.  The shooting-star-shaped like diluted blood stain passive pattern off elbow is consistent with body resting in extra height on its left side and diluted blood pearling at elbow tip to be drained from the corpse to the fabric. Thus tightly wrapped up the corpse was subjected to an aloetic fumigation and dry out. Most likely, it was also laid on its right side to complete the whole purifying-drying procedure.\nReminders:\n1/starch residuals (present in ancient linen cloth) + ammonia (present both in clotted blood and urea residues from heavy perspiration of sweat) + purifying aqueous alkaline solution (e.g. Red Heifer ashes and/or Jerusalem limestone dust mixed with water) bubble and gelatinise at low temperature (55°-85° Celsius) and thus can be used in turn as imprinting paste thin film, mordanting and pre-washing agent.\n2/In the most likely hypothesis the Shroud is Yeshua’s, the latter’s corpse (still in hyperthermia?) was subjected to (aloetic?) fumigation.\n3/flow pattern below the back is most likely pre-burial flow transfer contact pattern\n4/purifying-drying out procedure was performed with minimum and extra careful post- mortem handling.\n5/as ‘purifying medium’, the inner burial cloth (a.k.a. Turin Shroud) ‘took up’ all the impurities (in terms of remoistened body fluids namely dried-up blood & stale heavy sweat all mixed with Judean desert dust and /or Jerusalem dust) to form a very thin impurity layer for the bloodied body image to collimate and imprint onto its warp side.\n\n","date":"February 20, 2013 at 11:36 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25043","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Typo: diluted blood droplet pearling at elbow tip\n\n","date":"February 20, 2013 at 6:40 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25088","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Typo: is consistent with body resting in extra height on its RIGHT side\n\n","date":"February 21, 2013 at 5:30 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25202","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Can anyone please translate the above comment? This is a great thread.\n\n","date":"February 20, 2013 at 11:38 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25044","author":"Donn Reile","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Typo: dried out\n\n","date":"February 20, 2013 at 11:38 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25045","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"\nDonn Reile :\nCan anyone please translate the above comment? This is a great thread.\n\nComment from Escipion\n\n","date":"February 20, 2013 at 11:39 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25046","author":"Donn Reile","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"+ Typo:\nthe corpse was subjected to aloetic fumigation and dried out\nAND form a very thin impurity layer for the bloodied body image to collimate and imprint onto its warp side.\n\n","date":"February 20, 2013 at 12:34 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25056","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"A translation of Carlos Otal’s comment:\nThe “deliberate enhancement of a genuine relic” is impossible.\nNo blood added [to the shroud] would have the same red colour as the blood on the shroud, nor would it have the same form, such as the edge definition. Laboratory experiments have demonstrated this.\nThe [gospel] descriptions of the agony of Jesus of Nazareth are entirely consistent with a body suffering the onset of Disseminated Intravascular Coagulopathy (DIC), sometimes called “consumptive coagulopathy.” This could be caused by the multiple trauma of the soft tissue (from the scourging) as well as the crucifixion itself.\nThis was noted by Bergeron in 2011 (although I have not read his work) and is further developed by Svensson and Heimburger in “Forensic aspects and blood chemistry of the Turin Shroud Man.”\nIn DIC there is massive disorder of the normal regulation of coagulation and bleeding, as well as intense haemolysis (breakdown of the red blood cells) leading to increased ‘indirect’ bilirubin (which might have something to do with the red colour of the blood on the shroud).\nThe pathogenesis of this serious disorder was unknown until a few years ago (I’ve seen many patients with it die in a few hours), but fortunately it is now well known and treated medically.\nI think this could well be studied more intensively, although macroscopic aspects of the progress of the disorder (direct observation of the behavior of bleeding, coagulation and lysis rebleeding) are very unlikely as treatment is started immediately at the first sign of CID.\n—ends—\nFrom my point of view, although I don’t think a little touching up is any less unlikely, I’m grateful to Carlos for introducing me to Svensson and Heimburger’s paper, which is very interesting.\n\n","date":"February 20, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25067","author":"Hugh Farey","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"\nHugh Farey :Simples? If only. If the body was washed before being enshrouded, then what are those trickles doing along the arms? Are they from Jesus waving his arms about just before resurrection? it is clear that ChrisB knows rather more about the biology of resurrection than I do. When the heart begins beating, for instance, does it not immediately pump out a fair proportion of the blood through the five major holes in the body? How quickly does Jesus sit up, and doesn’t he feel so faint that he immediately loses consciousness? And having re-animated, does does he flip the shroud off with his arms before sitting up? Or does he slide out sideways? Or sit up with the shroud still covering his face? Although these questions sound flippant, they have direct implications for the appearance of the image on the shroud, and cannot be avoided if we follow ChrisB’s line of thinking. Other resurrection experts have assumed the body simply de-materialised, with or without a burst of energy of one kind or another, the shroud collapsing through the void thus created, and some non-believers think the shroud was simply folded back by the Essenes, who lifted Jesus, alive or dead, away, leaving the cloth behind.\nEvidence shows the blood was not disturbed, therefore the Shroud could not have been simply pulled or lifted away from the body…so much for the Essene theory. As for the washing of the body and why there would still be blood on the body; I think some reading on your part into the ancient burial practices and beliefs of pias Jews is warranted. These beliefs and practices could explain the presence of blood, even if the body had been washed.\nR\n\n","date":"February 20, 2013 at 5:53 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25083","author":"Ron","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"The red color of the bloodstains is, I think, one of the most interesting aspects of the Shroud-even if one were to conclude that the cloth was created only 700 or so years ago.\nAdler once noted that “hemoglobin exists in a lot of states and it’s a real problem on the Shroud to know what some of the states are”.  Would be interesting to compare spectra with the off-elbow site as it has been reported to appear distinct in coloring relative to other areas.  Elevated Bilirubin may be one of several variables that contribute to the blood’s appearance.\n\n","date":"February 20, 2013 at 6:20 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25086","author":"Kelly Kearse","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"What about myoglobin, much more easily O2 saturated than hemoglobin under ambient atmosphere ?\n\n","date":"February 21, 2013 at 8:37 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25146","author":"anoxie","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Elevated bilirubin/hemoglobin from heamolysis ? Wouldn’t be the serum red-orange ?\nCan we see such a gradient in the halo of serum around blood stains ?\n\n","date":"February 22, 2013 at 3:48 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25248","author":"anoxie","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"I’m frustrated by not knowing what is meant by the blood was ‘not disturbed.’ I can see that it is not smudged or smeared, but once it’s dry, even if it is adhering to something, such as a wound, pulling the cloth off would not smudge or smear the bloodstains anyway. What might happen is that a lump or lumps of dried blood might flake off. And, well, I notice that most of the thickest clots, such as those at the back of the head, do indeed look as if their middles have been flaked off, and many of the trickles have sudden very pale sections, as if there has been more flaking there than at other places. Even in the bloodiest places it is clear that most of the surface of the blood has flaked or crumbled away as the pale colour of the cloth is clearly visible through it, and none of Mark Evans’s micrographs show continuous patches. None of the bloodstains looks as it did when first laid down; most of the blood has eroded away. Can someone explain what is meant by ‘not disturbed’?\n\n","date":"February 20, 2013 at 7:54 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25093","author":"Hugh Farey","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"I just redid my experiment, this time with coconut oil (after I bathed my five year old in the bath with  touch of oil, helps her eczema).\nI assumed the shroud pose, and started on the left side. On the left side I took two tablespoons of oil and slowly fed it under my wrist, which was sitting over the left side of my lower waist.After a brief mini pooling around the wrist area, two thin trails of oil escaped down through my hips, running around my back, not quite to the mid point of my lower back. I repeated the same exercise on my right side, this time with one tablespoon of oil. Again I got a similar trail, but only one this time, probably a result of less oil volume.\nA question I have is this fine in theory, but how might it have happened in reality. Was Jesus wrapped in the shroud shortly after being brought down from the cross, and there was some immediate post mortem bleeding from the wrists which caused these trails of blood on his bac kto be transferred to the shroud?\nThoughts?\nI’d be interested to hear if others get the same results from the same experiment….\n\n","date":"February 21, 2013 at 6:48 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25131","author":"Matthias","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"A possible scenario. His heart would have started beating from the resurrection event, making blood flow for a short time before the body leaving the cloth. The resurrection event could also have sealed the wounds.\n\n","date":"February 21, 2013 at 2:29 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25176","author":"ChrisB","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"sorry there’s more.  In the above scenario he would have been wrapped in a clean cloth in the tomb – the shroud.\n\n","date":"February 21, 2013 at 2:32 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25178","author":"ChrisB","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"A specific purifying-drying out procedure could account for pre-wrapping distinct flow pattern on the back below being recorded undisturbed as contact transfer pattern. \nMost likely the twin trickles in the back below occurred on post mortem handling (in conjunction with chest wound, the presence of a pre-burial loin cloth and/or convex curvature of the spine /lordosis) and had almost dried up before they were actually remoistened (with a purifying watery solution) and re-dried (via subjection to an exothermic source). \nThe distinct bloodstain patterns were maintained ‘as are’ to be buried with body, once the wounds an bloodstains mixed with urea residues and dust were remoistened (with a purifying watery solution) and dried out (re-dried). \nReminder to Hugh: Forensically speaking, the TS image was UNANIMOUSLY found by experts to be anatomically flawless down to minor details and the wounds, blood flows, and the stains themselves to appear flawless and save from forgery. In terms of ‘blood disturbances’ re “deliberate enhancement of a genuine relic” associated with flaking off on image formation process and/or through time, this is just ‘another story’ without any truly scientific or forensic ground.\n\n","date":"February 21, 2013 at 10:10 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25156","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"++Typo: Reminder FOR Hugh\n\n","date":"February 21, 2013 at 10:21 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25159","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Typo: A specific purifying-drying out procedure could account for pre-wrapping distinct flow pattern on the ANATOMICAL back below being recorded undisturbed ON THE SHROUD as contact transfer pattern.\n\n","date":"February 21, 2013 at 10:12 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25157","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"+ typo: The distinct bloodstain patterns were maintained ‘as are’ FOR THE BLOOD to be buried with body,\n\n","date":"February 21, 2013 at 10:14 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25158","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"I have followed all Max’s ideas about the fairly complex procedures he thinks may have resulted in the shroud’s image with interest, and even a certain amount of humility, as they are way beyond my scope, but I think he must be careful in claiming unanimity among the pathologists. Zugibe disagrees with Bucklin, for example, to a considerable degree, and neither of them has much time for Vignon. Like all good pathologists, they all agree that their observations are “consistent with” (rather than “proof of”) their conclusions. As far as I know none of them has been cross-examined by a ‘counsel for inauthenticity,’ but I suspect that they would agree that some of their observations are also ‘consistent with’ alternative conclusions. My own, inexpert, examination of the shroud shows a number of irregularities of colour even along trickles which appear otherwise regular in thickness, numerous ‘clots’ whose insides are much paler than their rims, and, through every single bloodstain the ordinary colour of the cloth is clearly visible. I believe these observations are ‘consistent with’ much of the blood having fallen, flaked or crumbled off. If that is not ‘disturbance,’ then what is?\n\n","date":"February 21, 2013 at 10:56 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25161","author":"Hugh Farey","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Hugh, e.g. when it comes to the off-elbow bloodstain, forensically  it may be described as a passive pattern or, to be more accurate, an altered gravity trail drop pattern left by free falling drop produced from stationary source (body resting in extra height (on two stones?) and laid on its left side). ‘Disturbance’ or ‘non disturbance’ is first and foremost here from a forensic viewpoint in terms of bloodstain pattern recording/formation process as reference T-Time.\n\n","date":"February 21, 2013 at 12:23 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25167","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Typo: laid on its RIGHT side\n\n","date":"February 21, 2013 at 2:40 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25181","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"I meant unanimity among true forensic medical examiners as far the TSM’s anatomical and haematic imaging accuracy is concerned.\n\n","date":"February 21, 2013 at 12:42 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25168","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Addendum: Re twin blood rivulets on the back below area: gravity (stiff rigid corpse as stationary source having been laid on its left side), the very contour of the surface (anatomical convex curvature of the spine /lordosis) and sufficient volume of blood mixed with serum (from chest wound as blood source) caused twin flows to trickle from one side to the other of the back below (via pre-burial post-mortem handling). On burial they were transferred from the devastated body onto the long inner burial cloth as diluted blood passive contact stain patterns.\n\n","date":"February 21, 2013 at 2:47 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25183","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"+ typo: on performing the purifying-drying procedure, they were transferred from the devastated body onto the long inner burial cloth\n\n","date":"February 21, 2013 at 3:13 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25187","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Typo: the very contour of the surface (anatomical convex curvature of the spine /lordosis + presence of a pre-burial loin cloth?)\n\n","date":"February 21, 2013 at 3:07 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25186","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Dear all,\nCongratulations to all of you for your very interesting messages.\nSome years ago the “bloodstain questions” were discussed on SSG (even with Dr. Zugibe). We were not able to reach a consensus.\nLet’s try again!\nI would like to begin with Hugh’s excellent question, that can be summarized so: How can we explain the blood rivulets seen on the small of the back ?\nThere is absolutely no doubt that these rivulets are made of blood.\nLooking at the Lirey badge made before the 1532 fire, we see that these blood marks were larger than the image. Today, we can see blood and charred blood bellow the patches, i.e. where we don’t see any image.\nWhat does it mean ?\nI am waiting for you thoughts and conclusions.\nIn any case, the blood rivulets of the small of the back are not easy to explain.\nI can perform some experiments with my own blood. Yes, I can. I did it some years ago.\nFortunately, no crucifixion is necessary !!\nI am waiting for some propositions of experiments.\nThibault.\n\n","date":"February 21, 2013 at 4:10 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25193","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"In the most likely hypothesis the TSM’s is Yeshua’s, to both keep/bury the shed (innocent) blood with the deceased and cause the flow pattern on the small of the back area to be recorded larger than the body image on the Shroud, it takes:\n1/ remoistened dry blood (through in-soaking the long linen sheet with purifying aqueous alkaline solution and using it as inner burial cloth)\n2/ accumulation of sufficient volume of blood mixed with serum from main serum diluted blood sources (namely lower cave vein by the wound of the right side as blood source) and secondary diluted blood source (namely the resulting pool made on left side opposite to wound side)\n3/ a stationary source (a stiff rigid tightly wrapped-up corpse covered with dry blood mixed with urea residues from stale heavy sweat and dust and laying in extra height twice (first on two stones placed over the unction slab during wrapping procedure performed within the funerary ante-chamber then on heaps of granulised/pulverised myrrh during purifying-drying procedure/ (aloetic?) fumigation performed within the burial chamber)\n4/ a specific surface contour (lumbar section of spine in a condition of lordosis)\n5/altered gravity and body displacement (tightly wrapped-up stiff rigid corpse being laid first on the left and then on the right side twice, first in the antechamber then the tomb chamber) to have twice the remoistened diluted blood trickle from one side to the other with no pooling of blood in the middle but only on both sides of the small of the back)\nThus, in the most likely hypothesis the TSM’s is Yeshua’s, the transfer on the long inner cloth of the twin flow patterns of the chain-like shaped passive flowing present on the anatomical small of the back occurred on performing four of the Jewish/Judean burial core procedures namely speedy burial, specific wrapping in shrouds, purifying and drying.\n\n","date":"February 21, 2013 at 10:21 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25217","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Max,\n– I haven’t been able to find a source for the aspects of “Jewish/Judean burial core procedures” that you describe above.  Got something handy?  I’m arguing with the skeptics at http://forums.randi.org/showthread.php?p=9022566&posted=1#post9022566, and they want my sources.\n— Rich\n\n","date":"February 22, 2013 at 10:01 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25283","author":"Richard Savage","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Typo: first on two stones/two piles of granulised/pulverised myrrh small bags placed on the unction slab during wrapping procedure performed within the funerary ante-chamber then on two piles of granulised/pulverised myrrh small bags during purifying-drying procedure/ (aloetic?) fumigation performed within the burial chamber\n\n","date":"February 22, 2013 at 6:03 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25266","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Anoxie,\nMyoglobin is expressed in muscle cells-released into the serum following a heart attack or severe muscle damage.  Hemoglobin is found in red blood cells-an increase in red blood cell  lysis due to shock would result in elevated serum hemoglobin levels-hemoglobin is broken down to biliverdin, which is converted to bilirubin.  Hemoglobin eventually loses the oxygen it carries and the deoxygenated form (methemoglobin) is brown, which gives most blood stains their typical appearance.  Adler suggested that the combination of elevated bilirubin (yellow/orange) + methemoglobin (brown) together results in the red appearance.  A byproduct of hemoglobin breakdown is CO, which binds the porphyrin ring around 200x times greater than oxygen, and can result in a red appearance of blood-this was suggested by Baima Bollone to contribute to the red color; in victims of CO poisoning, persistent red blood color in the lab is an indicator of bound CO-this can be confirmed by spectral data-when kept in the refrigerator under sealed conditions, such samples can remain red for several years; under normal conditions, the bound CO is eventually exchanged for oxygen, and the hemoglobin is deoxygenated to methemoglobin, which the Shroud spectral data indicate is present-binding of CO to the free heme ring, not associated with the hemoglobin polypeptide is of much higher affinity, around 25,000x greater than oxygen-Adler commented that the spectral patterns at certain wavelengths show scattering with some peak shifts-the data are indicative of methemoglobin being present-perhaps additional information could be found there as well-these are samples of aged, dried blood, methemoglobin is expected to be the predominant form\n\n","date":"February 22, 2013 at 6:05 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25267","author":"Kelly Kearse","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Thank you for these explanations.\n\n","date":"February 22, 2013 at 6:52 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25269","author":"anoxie","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"To Richard: see e.g. Was the burial of Jesus a temporary one – A Christian Thinktank on the internet. Here is an extract:\n“A FULL burial included washing/anointing (done with spices, oils, and water), bindings (linen strips, with spices), shroud (recorded from the Synoptics), entombment, and sealing the tomb.  [Actually, it looks more like a “some-rite” burial, because of the quantity of spices and statue of the burial party–Joseph and Nicodemus.] This indicates that Jesus was buried–whether it was an honorable burial or not, whether in shame or not–in accordance with the already-documented Jewish requirements. He was fully buried. The seven days of mourning–shiva–(in case it was NOT a dishonorable burial) would have begun when the tomb was closed.\n[Note: If the historical data leads us to believe that Jesus actually was considered to have died on the Cross that day, then we have every right to believe He was buried by nightfall–regardless of how we view the accuracy of the gospel accounts. The Jewish social/religious pressures to bury-by-nightfall insure us that (absent an entourage of people who wish to eulogize Jesus too long) He was buried that night. Accordingly, it is not ‘begging the question’ to assert that Jesus was buried. This can be confidently believed, irrespective of our confidence or non-confidence in the gospel narratives, on the basis of Jewish custom/culture of the day… As for the gospel narratives, I  consider the fact that the ‘operational’ or physical aspects of the burial (e.g., carry, anoint, wash, rock, etc) are not ‘theologized’, but are simply described, as indicating that these physical details are adequate historical data to work with. A secular historian might raise eyebrows at the quantity of spices, the sudden appearance of J of A, or the remark about “in which no one had been buried before”, but the “non-interpreted” nature of the  physical details in the narratives seems trustworthy enough to consider the description of the burial as being true-to-fact.]\n·         “They took the body of Jesus and wrapped it with the spices in linen cloths, according to the burial custom of the Jews” [John 19.40]\n·         “The burial of the body was hasty and had to be completed before sundown. The process is uncertain. The spices, being of somewhat gummy character, may have been laid in the folds of the cloth to provide a rigid casing for the body, or they may have been ground and mixed with oil to form an ointment to rub on the body. The former procedure agrees better with the text. “Strips of linen” is a translation of othoniois. Later usage in the koine Greek made the term a generic equivalent of clothes (cf. MM, p. 439). In the case of Lazarus, the graveclothes were wrapped around him in such a way that he had to be released after he was raised.” [EBCNT, at John 19.40]\n·         “Shroud. In Mt. 27:59 par Mk. 15:46; Lk. 23:53 sindoµn describes a linen cloth used for the wrapping of a dead body in preparation for burial. Jewish burial practices in NT times included washing and anointing the body, perhaps even after it had been earlier cleaned with oil and washed at the place of death (cf. Jn. 19:40) or in the deceased’s home. Anointing might be repeated in the tomb itself (cf. Mk. 16:1). The dead were then buried in their own clothes or specially prepared ones such as a simple linen cloth on which spices would be spread as the cloth was wound around the body. With regard to Jesus’ burial, the Synoptic Gospels all relate how Joseph of Arimathea wrapped the body of Jesus in a shroud. The Johannine account states that Joseph and Nicodemus followed “the burial custom of the Jews,” anointing the body with a mixture of myrrh and aloes weighing about 45 kgs. (100 lbs.) and binding it in “linen cloths” (Jn. 19:39f). Those “linen cloths” were found in the empty tomb on Easter morning along with a “napkin, which had been on his head,” which was “not lying with the linen cloths but rolled up in a place by itself” (20:6f). [ISBE, s.v. ‘shroud’]\nThis data, of course, argues that Jesus was formally buried on Friday night–as the text says, and as the customs dictated.\nBut what were the women planning to do, if Jesus was already buried?\nAs far as the text indicates, they didn’t know what all Joseph/Nicodemus/burial tradesmen had done (some only watched from a distance initially–this makes sense if Joseph and Nicodemus were known Council members, yet unknown disciples of Jesus!). They might not have assumed that these Jewish leaders had performed all the anointing/washing.  They did, however, see the tomb and ‘how the body was laid’ (Lk 23.55: “Now the women who had come with Him out of Galilee followed after, and saw the tomb and how His body was laid.”). But the text (Mr 16.1) only speaks of them wanting to ‘anoint’, not ‘wash’ him. This means they were aware that the core procedure of burial had been done.\nThey probably were also intending on adding the personal touches, much as when a grieving parent wants to put a special toy into a casket, to put a special necklace on the deceased, or to straighten the clothes of a lost one. So they carried their spices and their grief, and went to be with the One who loved them…\nFrom the textual data, there is no reason to assume that they regarded the burial of Jesus as ‘uncompleted’ at all. They had seen the spices and perhaps saw the wrapping of the body, spoken of in John 19.40: “And so they (Joseph/Nicodemus/company) took the body of Jesus, and bound it in linen wrappings with the spices, as is the burial custom of the Jews” .\nBut I am not trying here to address all the issues in the burial/resurrection accounts–just the ‘temporary tomb’ issue for now…so let me try to get back on track here…\nSo, I think it’s very accurate to say that “temporary tomb” and “temporary burial” do NOT refer to ‘holding areas, prior to initial FULL burial’, from the standpoint of Semahot, Kloner, and the rabbinic literature.”\n\n","date":"February 22, 2013 at 11:57 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25290","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"To Richard (again): here is a ‘more legible’ link: Bereavement in Judaism – Wikipedia, the free encyclopedia.\n\n","date":"February 22, 2013 at 12:05 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25291","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Extract: “Preparing the body — Taharah\nThere are three major stages to preparing the body for burial: washing (rechitzah), ritual purification (taharah), and dressing (halbashah). The term taharah is used to refer both to the overall process of burial preparation, and to the specific step of ritual purification.”\n\n","date":"February 22, 2013 at 1:40 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25302","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"To Richard: as to fumigation/burning aromatic woods/spices on burial see 2 Chronicles 16:14 – 21:19\n\n","date":"February 22, 2013 at 12:19 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25293","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Typo: 2 Chronicles 16:14 – 21:19 TARGUM\n\n","date":"February 22, 2013 at 12:51 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25297","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Addendum: Malky/Jerusalem limestone dust mixed with collected rainwater could be used to purify the deceased’s body (alkaline waters to kill flesh flies’ larvae and blow-flies’ eggs) and Red Heifer ashes mixed with pure living water to purify Yeshua’s shed innocent blood).\n\n","date":"February 22, 2013 at 12:50 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25296","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion","post":"Max,\n– Thanks.  That ought to do it.\n— Rich\n\n","date":"February 22, 2013 at 1:37 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","id":"comment-25301","author":"Richard Savage","site":"shroudstory"}]
