[{"title":"Oy vey!  We’ve got a problem?","post":"Let’s begin with one real error by the author that indicates either a certain ignorance or deliberate disingenuousness.\nBarrie was not “hired” to be a photographer. None of the STURP team were “hired.” Expenses were reimbursed when money was raised but they were not working for a fee. \nThere is an arrogant attitude displayed by the authors in his dismissal of Barrie as a hired photographer. Barrie had a Masters degree from the leading photography school  in the United States and had in fact done complex work with scientists who were dealing with photographs of nuclear explosions and readouts on analytical scientific devices.\nPhotography is in fact an instrument of science. No where is that fact demonstrated more than the Pia photographs and the reactions to them.\nAs there being “no sign of death on these clots” there were plenty of signs of death on the Shroud including the high levels of bilirubin and the seepages from the the wounds particularly the lance wound which has been identified as post-mortem. Then there is the finding of rigor mortis by a slew of pathologists.\nBut there is one thing that troubles me: it’s the authors use of Yiddish argot to depict the words of the scientists. There were Jewish scientists who worked with STURP, they were not a majority of the scientists. They were well-educated and well qualified. Why the use of Yiddish? \nIs the author Jewish seeking to debunk Christ? Or is the author crudely anti-semitic? Or is he simply a Don Rickles, Lenny Bruce fan?\nMuch of contemporary American humor has it roots in the Jewish experience by comedians, who learned and honed their in the Catskills. None of them were a part of the STURP team.\nThen again, I sometimes feel that story of my life is like the punchline of Yiddish joke about a man who was offered a job  by his Rabbi: a shekel a day to sit by the village gate and watch for the Messiah.”The pays not much, but the work is steady,” the Rabbi assured him.\n\n","date":"August 24, 2015 at 5:31 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208848","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Good morning\nI have a very busy day today and will get back later. Two things can be said now:\n— It does not seem that the people at the Shema Israel International Burial Society have got their facts right. Have they read about Herod? He may have been cruel but he also finished the Temple. He got the funeral he wanted, with “tons” of spices\n— Has the reader really read Josephus? I don’t think so. My advice to him: Please don’t distort Josephus. If you want to prove what you are saying please provide the passages you are referring to.\nI sense a hidden agenda.\n\n","date":"August 24, 2015 at 6:19 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208853","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hi anonymous reader!\nYou play the role of a partypooper – don’t expect applaus. Dan Porter has already given you my website address (www.shroud.info). You are perfectly right in your opinion that Jesus might have survived the crucifixion. But I am not sure whether pre- and postmortem blood can really be destinquished on a chemical basis. Especially in Russia corpse-blood was used for blood-transfusion. Therefore there can not be much difference. But I think there are many other signs for life on the cloth.\nMost of the “shroud-researches” are (strong) christian believers and therefore per definition biased in this point. Of course STURP examined the Shroud under the assumption of a corpse under the shroud. But I would not allege that results in favour of a living person have bin suppressed – they were just not looked for and therefore not seen: projection makes perception.\n\n","date":"August 24, 2015 at 7:07 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208855","author":"Helmut Felzmann","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Statement #1:  “…assume that “The Man of the Shroud” was not dead, but was merely unconscious; that is, that he did not die as a result of his ordeal; ….the only blood stains on the Shroud are pre-mortem blood stains.”\nQuestion #1:  Why exactly would they drape with a shroud, a man near death that they were trying to keep alive?  Counter-intuitive and very counter-productive.\nStatement #2:  “a new study has concluded that oils were on the Shroud … contrary to what was concluded by STURP.  And those oils were burned off in 1532, at the fire, which is why STURP found no oil residue.”\nQuestion #2:  ALL OF THE OILS were burned off in the Fire of 1832?  Impossible, or maybe just extremely unlikely.\nStatement #3:  “a couple of the scientists were wearing crucifixes.”\nQuestion #3:  How could a couple of scientists wearing crucifixes have swayed a group of 33 independent scientists/technicians?  There were atheists and agnostics in the mix.\nJust for starters….\n\n","date":"August 24, 2015 at 7:25 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208858","author":"Nabber","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Excellent questions.\n\n","date":"August 24, 2015 at 8:20 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208862","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"OK folks, I’m off till the end of the day.\nMeanwhile, there is something for you to read if you are interested. It is essential to understand what exactly is behind the above:\n https://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\n\n","date":"August 24, 2015 at 8:51 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208864","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Louis,\nA superb, scholarly piece. Thank you.\n\n","date":"August 24, 2015 at 9:02 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208866","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Thanks, John. I think that instead of reading bits and pieces about the controversies on this blog those interested in learning the whole story, with the latest updates, should also read your book: “The coming of the Quantum Christ. The Shroud of Turin and the Apocalypse of Selfishness.”, available at Amazon. A much clearer and fascinating picture will emerge.\n\n","date":"August 24, 2015 at 6:40 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208894","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Again, we have fallen prey to the practice of drawing conclusions based on one piece of evidence to the exclusion of all others. If Jesus was still alive the cloth would have been lifted (or pushed off ) His body and the blood stains would have been smudged.\n\n","date":"August 24, 2015 at 9:09 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208867","author":"tomdevins","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Beware attempts to implant the idea that either John Heller or Alan Adler went to Turin in 1978 as part of the STURP team. That was not the case.  Both worked with sticky-tape samples supplied by Ray Rogers.\nI’m not saying this reader’s comment is trying to mislead – though it might have been better if he’d indicated that the “meal with Barrie Schwortz” must have been much later. But this is not the first time I’ve seen something that could be taken to mean that two absentee-members were there,  possibly to boost their credentials as fully-involved rather than associate-status STURP\nDoes it matter? Oh boy does it matter. (“Blood too red, must be trauma-bilirubin  bla bla”).\n\n","date":"August 24, 2015 at 9:49 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208870","author":"Colin Berry","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Colin,\nDo you check under your bed fo bogeymen at night? I know of no researcher who has tried to plant the idea that either Heller or Adler were a part of the STURP examination in Rome in 1978. Heller was a late addition to STURP but did not travel to Rome as is clearly indicated in Chapters “8” and “9” of my book Quantum Christ. They did work with fiber samples that were obtained by Ray Rogers in 1978. Eventually, Adler had access to fiber samples that were in possession of Prof. Gonella, scientific advisor to the Archbishop of the Turin.\nThe fact is they had access to something you never have had: actual fibers from the Shroud. Your message is disingenuous becasue you seem to be trying to equate their access to Shroud fibers down to your non-existent level.\n\n","date":"August 24, 2015 at 10:30 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208872","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"“Dr. Adler told him that, no, no such test had ever been performed on the Shroud.  That is very hard to believe.” To be frank, this doesn’t ring true, but then, time could have made the memory a little hazy. Alan Adler almost certainly knew very well that there is no a priori difference between pre- and post-mortem blood, and that consequently no differentiating test could have been performed. The blood emerging from a man who bleeds to death on a cloth does not change in composition after his heart ceases to beat, and having emerged, both pre- and post-mortem blood are subject to similar changes. As Helmut mentions above, early blood transfusions were successfully done using blood from dead people.\nHowever, some differentiation can be made between the shape of pre- and post-mortem bloodflows on the Shroud, based on the pressure with which it was expressed, and this has been recognised and commented on. The trickles down the arms are most unlikely to have been possible from a dead man, and are generally assumed to have arrived in place while Jesus was still hung on the cross, while the zig-zag ooze from the chest wound seems to be from a simple gravitational process, rather than the copious squirt (sometimes depicted in medieval art) that would have been the result of a beating heart. Other bloodmarks are more ambiguous.\nI think the author’s suggestion that religious convictions may have led to unfounded conclusions is not, in my opinion, supported by any evidence, and is best set aside in favour of more objective observations. One is tempted to wonder whether the author’s affiliations are reflected in his comments as well. A few pathologists have considered it possible that the image and its bloodstains could only have been caused by a living person, and the point about myrrh being more of a healing unguent than an embalming one is well made. You are welcome to your doubts, and are not alone in them – ten million Ahmadiyya Muslims would agree with you – but a doubt is not, of course, a certainty, nor a comprehensive discreditation of the opposite point of view.\n\n","date":"August 24, 2015 at 11:24 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208875","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Quote from John Heller, p 88:\nTo Ray Rogers, at a piloting session pre Turin, August 1978:\n“If blood is present, we’ll find it,” I assured him, and added , “I just wish I were going with you”\n(Roger’s reply): “You’re not coming?”\n“Nope. Just one extra body. I guess I’ll have to wait till you get back.”\n(Rogers): “Too bad. It’s the chance of a lifetime.”\n“Yeah, but I guess they also serve who only stand and wait,” I found myself saying wistfully.”\nBizarre: totally bizarre – to be proactive as Heller was in expressing an interest in being part of the STURP team, and then to back out of actually seeing it with his own eyes at close quarters – passing up a once in a lifetime opportunity – to say nothing of seeing the blood and image samples in situ instead of relying entirely on Rogers’ sticky tape samples  with a few attached fibres and no “context”.\nNope, not just bizarre but a total dereliction of scientific duty, or even mere curiosity (supposedly the driving force of science, the thing that supposed to make scientists tick). Sorry, someone had to say it. \nThen there’s the small matter of how he recruited Alan D.Adler, someone else who didn’t bother to go to Turin, the scientist who Barrie Schwortz routinely describes as a world expert on blood  (he was nothing of the sort, being a porphryin chemist).  \nSee how Heller describes his first mention of Alan Adler:Page 132:  “Then a colleague, Professor Alan Adler, popped into my mind. I had worked with Dr.Adler on various projects over the years. He would admit to being a physical chemist, thermodynamicist, and a porphyrin nut. He is a Renaissance man, with an encylopedic knowledge of the physical and biological sciences, military history, ecology and many other fields. I wondered whether he would be interested, and I decided to approach him sideways.”\n“Al,” I said enthusiastically, “how would you like to get involved in a real fun project? It even involves porphyrins.”\n“Oh yeah? Did you say fun project?”\n“Yup. It might turn out to be the most fun you’ve ever had on a problem.”\n“Sounds interesting. Are you guaranteeing it will be fun?”\n“Definitely”\nSome might consider that the above exchange adds a whole new meaning to “enthusiastically” and “fun”, namely to insinuate oneself “enthusiastically” or be recruited by a chum into a “fun” project and then let others do the tedious trudge to Turin to collect the samples. \n “Yup, the blood is unnaturally red, didn’t ya know? I’ve seen the fibers in Rogers’ sticky tape with my own eyes and oh boy are they red” or “Yes, there’s “extraordinary amounts of bilirubin” based on my microchemical spot tests (just don’t ask for the hard data).” \nAnd this is the stuff of books and memoirs? Science at second hand?  Science by special courier delivery? The Sticky Tape of Turin?\n\n","date":"August 24, 2015 at 12:37 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208880","author":"Colin Berry","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Further to my previous comment, I want to reiterate that no one has been able to disprove the assertions refuting the claim about the burial of Jesus in a location outside Jerusalem made in:\n  https://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nThe claims that Jesus survived the crucifxion is the result of an obsession with monotheism,when people thought that God would not allow any “prophet” to die crucified.\nWe must remember that the New Testament is in many ways a Jewish document, because\nexcept for Luke, the authors of the Gospels were Jews. It is for that reason that there is now   an “Annotated Jewish New Testament”, a Jewish interpretation and a nice job, not drifting from the Jewish milieu.\nThe Jews never denied the crucifixion. Not long ago the Israeli writer Amoz Oz wrote that guilty conscience was invented in his country 2000 years ago. Lest I be misunderstood, I hasten to say that there can be no accusation of “Christ killers”. The Gospels narratives leave no room for doubts that both Roman and Temple authorities were responsible for Jesus’ crucifixion and death. According the late Pinchas Lapide,who was a respected Jewish scholar and holocaust survivor, the Temple authorities handed Jesus over to the Romans.\nNo Jewish archaeologist or scholar has any doubt that Jesus was crucified and buried in Jerusalem. It is some unfounded claims that led to the controversy about the place of burial in Jerusalem, but no doubt was expressed about the crucifxion, death and burial in Jerusalem:\n https://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nThere are claims that some pathologists in Europe have stated that Jesus survived the crucifixion. The fact that they are not named, much less seem to have published any paper on the topic,makes them suspect.\nThere are pathologists/coroners who have identified themselves while dwelling on the bloodstains seen on the Sudarium, in connection with Turin Shroud studies:\nhttps://www.academia.edu/11804110/Is_the_Sudarium_of_Oviedo_the_key_to_unraveling_the_mystery_of_the_Shroud_of_Turin\n\n","date":"August 24, 2015 at 6:16 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208892","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I think it is important that I correct and clarify the statement made by this blogger and some of the comments that followed.  \nFirst, my actual comment regarding the crucifix in 1978 was made only to John Jackson. What I told John was that 20 years from now, when looking at my photographs of the STURP team at work, someone would see the crucifix and use that against us or our work. That proved to be prophetic since 20 years later, Harry Gove did just that in his book, “Relic, Icon or Hoax.” He included one of those photographs and stated: “Note the wooden crucifix around Jackson’s neck” (or words to that effect), as if somehow that would affect our data or conclusions. Remember that there were 3 Jews (including Adler) and several atheists and agnostics on the team so the wearing of a crucifix by one team member was totally irrelevant. As I have pointed out for years, that had no impact on the spectral, chemical, photographic and other data gathered by STURP and would simply be used as a red herring by some future skeptic to attack STURP on a personal basis.  Jackson had every right to wear that symbol of his faith if he so desired. I never asked John to remove the crucifix but only that he tuck it under his shirt. However, in 1978 most of the STURP team members were not very media savvy (due to the nature of their work in the weapons industry) and did not understand the impact such a simple and innocent gesture might cause years later. So sadly, Gove (and now Colin Berry) have proven me to be correct. \nAs for Heller and Adler (and several other team members who did not go to Turin for the data gathering portion of our work but examined the data upon our return), that was mainly because we were under-funded and the cost of airline tickets and hotels had to be kept to a minimum, so only those team members who were essential for the data gathering went to Turin.  To be clear, NO ONE ever claimed that Heller and Adler were present during the examination in 1978.  One only has to look at the 1978 STURP Team page of Shroud.com, which has been online for nearly 20 years (http://www.shroud.com/78team.htm) to see a complete list of all the formal team members and which ones participated directly in the data gathering event. \nFrankly, I find it totally ridiculous that Colin would claim that Heller and Adler used their positions on the team to “boost their credentials as fully-involved rather than associate-status STURP” (members).  Both were fully involved and were active, full-fledged team members BEFORE we went to Turin and did not need the STURP project to boost their careers. The only one who fell into that category was Walter McCrone, who became an associate member when Rogers delivered his tape samples to him AFTER our return and it was only then that he signed the appropriate non-disclosure agreement. That is why McCrone is not on that list, as it reflects only those who were original members of the team. Others who were full fledged team members but did not participate in the data gathering included Diane Soran and Larry Schwalbe (of Los Alamos National Laboratory), Dr. Robert Bucklin and Dr. Joseph Gambescia (forensic and medical experts), and Jim Drusik of the Los Angeles County Museum of Art (who I have mentioned previously to Charles Freeman on this blog). \nSo once again Colin, you have selected and presented certain facts completely out of context to try and prove your point and once again, you attack the character of the researchers rather than their science or their conclusions. I suppose I’ll have to compile a list of the deceased STURP team members and send it to you to make it easier for you to plan your next ad hominem attack on those who are not alive to defend themselves. Like several other skeptics over the years, you must believe that if you can’t attack the science, your only recourse is to personally attack the scientists themselves. Shame on you.\n\n","date":"August 25, 2015 at 1:35 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208967","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"John Heller wrote a complete book, all 225 pages of it, relating his involvement with STURP from its early beginnings, starting with his secretary making the first contact with John Jackson. In addition, it was he who recruited Alan Adler to STURP, someone whom he describes as an acquaintance. Yet neither he nor Adler could be bothered to make the trip to Turin to see the linen with their own eyes, yet felt competent to make highly cited comments about “blood that was too red” etc, all based on sticky tape samples supplied to them by Ray Rogers, and then went on to write books and memoirs.\nSpeaking as a retired scientist who once held a highly responsible postition, advising an entire industry on matters to do with food safety (FMBRA, 1978-1990), often at short notice, requiring that I “drop everything” I frankly find the failure of either of them to accompany the STURP team to Turin, yet write books and memoirs as if fully fledged members, an appalling lapse of professional standards which Heller’s book fails to explain (certainly there’s no hint of financial considerations).\n If it’s “ad hominem” to condemn a gross breach of professional standards the I plead guilty as charged. Would it be “ad hominem” to report a physician who failed to spot the symptoms of meningitis, sending a child home with some junior aspirin, or an airline pilot who looks unsteady on his feet? University academics are not usually held to the same professional standards as those in front-line professions, but in this instance – where there was a rare, once-in-a-lifetime invitation to  scrutinize the “Shroud” at close quarters for an entire week, and indeed take samples – the failure of two senior STURP “team members” to be there, viewing the object with their own eyes, is frankly beyond belief. I say it was a gross lapse of professional standards on both their parts, hopefully temporary.\nSorry to speak ill of the dead – but that’s the nature of science – one’s positive OR negative contributions can live on long after one has shuffled off the proverbial. People chancing on published work, today or in 10 or 20 years time, have no way of knowing if the author(s) are still alive.\n\n","date":"August 25, 2015 at 2:56 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208969","author":"Colin Berry","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I am sorry if I missed Barrie’s reference to Drusik that he provided for me. None of us can read everything and I for one have stopped reading Colin completely as he is always changing his mind. I am sure he will tell us when he has finally found the end of the rainbow.\nI had come across Drusik in Rogers and Schwalbe’s  paper on the Shroud and was interested in him because he suggested that the calcium carbonate may have been on the top of the linen and influenced the discolouration that we now have on the Shroud. This fits with other evidence that this was originally a sealed and painted cloth and, unlike anyone on the STURP team, Drusik may actually have known something about painted linens and what one can expect to find when, as happened eventually in most cases, the painted/ gessoed surface disintegrated.\nI am still waiting for the scientific evidence that dates the Shroud to before 1000 AD. It seems to be assumed that there is some but it is never properly set out. I would be more interested in Fanti’s dating if his three methods had come to the same result . The fact that the three dates were so disparate suggests that he has not found a reliable dating method- also there is the problem with his samples and his averaging methods seems a bizarre way of dealing with three widely differing dates, only one of which at most, may be accurate.\nAgain Rogers’ guess at an earlier date based on vanillin,etc., is  not supported by any replicable method of dating. \nSo if there is any replicable SCIENTIFIC evidence for a date from the first century, perhaps it can be put on record.\n\n","date":"August 25, 2015 at 4:18 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208970","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Druzik is coauthor of a paper (*) in 1988 along with one of the top experts in isotopes and paleoclimate Michael DeNiro, that unfortunately has largely gone unnoticed. This paper was published in a peer-reviewed journal, and in my view, even today, 27 years later, their conclusions and the research line they propose could be one of the most promising to move forward in Shroud research.\n(*) Relation between from linen and maize—Implications for paleoclimatology and for sindonology. Geochimica et Cosmochimica Acta. Volume 52, Issue 9, September 1988, Pages 2189–2196\n\n","date":"August 25, 2015 at 5:26 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208973","author":"Gabriel","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Thanks very much for bringing the paper to our attention. I was not previously familiar with it, and agree that it offers a most interesting line of inquiry.\n\n","date":"August 25, 2015 at 6:22 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208975","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"J. Druzik of the Los Angeles County Museum of Art-  I assume that he is the same one as the Drusik that Barrie mentions, ‘’suggested that if the large calcium concentrations had been present in the cloth before the image was formed, it might be expected that it would have buffered certain types of reactions and, thereby, assisted in confining the discoloration to the tops of the thread crowns.’\nFrom Rogers and Schwalbe. Physics and Chemistry of the Shroud.  This needed to be followed up as it fits with the possibility, no more than that,that the discoloration took place under a gessoed surface in which calcium carbonate was an ingredient.\n\n","date":"August 26, 2015 at 3:47 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209002","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Colin, perhaps I should remind you that STURP’s primary objective was to determine the properties of the image on the Shroud. To that end, the majority of the experiments were oriented towards that goal. We understood the blood would be significant, which is why we welcomed Heller and Adler to the team, but they did not have to be in Turin to gather the data, since they had complete access to ALL of STURP’s data, including the tape samples, Vern Miller’s superb scientific photography and Mark Evans’ excellent photomicroscopy, not to mention all the spectral and other data. That is what they used to evaluate the bloodstains (just as you have).\nThere was no time in STURP’s test plan to do any in situ analyses in Turin. The goal was to gather as much data as we could in the short time allowed to us and evaluate it in depth after we returned. A geologist doesn’t have to take the core sample himself, he just has to evaluate it afterwards. I should also mention that Adler was given the opportunity to examine the Shroud up close and personal on multiple occasions in later years. He was the only American scientist on the conservation commission of the Turin Archdiocese and was highly regarded by everyone. \nThis also explains why a significant amount of STURP’s time was spent performing the various photographic and imaging experiments. They would provide a qualified database of accessible materials for future research, since we were the first group ever given such access to the Shroud and it was unknown whether any similar research would be permitted in the future. As you know, no such permission has ever been granted since. In many ways we were charting new territory, as no other similar examinations had ever been performed.\nHowever, calling Adler and Heller’s absence in Turin a “gross breach of professional standards” is a gross exaggeration and doesn’t take into account any of the countless factors and circumstances that STURP encountered along the way in their effort to obtain permission to examine the cloth. It is very easy to be critical 38 years later, but you do so without any real knowledge or context of what took place. It’s too bad you weren’t there in 1978, as I am sure you could have made a valuable contribution, but you weren’t there and now you are passing judgement on these men without any of the facts.\nI am sure you had an esteemed career and held many responsible positions. Just remember that Ray Rogers had an equally esteemed career and advised the U.S. government and military on matters of national security, even after his retirement as a Fellow at Los Alamos National Laboratory. As he was dying of cancer, he devised a method to foil IED’s in Iraq, and probably saved many lives by doing so.\nAs for writing memoirs, only Heller wrote such a book, and it was less a memoir than an overview of STURP and his personal experiences as a member of the team. Adler wrote a number of papers about the Shroud that were posthumously compiled into a book by Dorothy Crispino. Heller spent considerable time with each team member during his research for his book. In fact, he spent a full week at my studio in Santa Barbara, California interviewing me and did the same with most of the others. He did it when the experiences were all fresh in our minds so it is probably the most accurate rendition of what we did throughout the process. To my knowledge, you are the first (and only) person to level that type of criticism on what is a truly important historical document.\nIt is perfectly acceptable to disagree (even strongly) with the methods and conclusions of any researcher. In fact, Rogers and the others would have vehemently defended your right to do so. But it is absolutely unnecessary to launch baseless attacks on their character and accuse them of negligence or worse, which you have done on numerous occasions. That is true whether they are alive OR dead. A little respect goes a long way.\n\n","date":"August 25, 2015 at 5:47 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208974","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"First group to have access to the Shroud?. I thought the 1973-6 Commission was the first.\nBarrie reminds us that e scope of the STURP investigation was very limited. Any systematic study of the Shroud as a whole must start with the cloth itself, its weave,etc, as without the cloth there would be no images to look at. STURP never pretended to do that.\nSTURP always seemed to assume that the images on the Shroud as they are now, are as they have always been. I think this was a major omission as they make no attempt to deal with the evidence from earlier documentation and depictions that suggest the surface was originally very different. This was simply ignored.\nAnd with much more sophisticated equipment can any of the STURP findings now be replicated with material from the original tapes?\n\n","date":"August 26, 2015 at 1:34 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208994","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"The three in one herringbone is a recognised weave today- used for the inaugural vestment in silk of Rowan Williams as Archbishop of Centerbury. A BBC researcher found a Welsh weaver who said she could produce one similar to the Shroud on her treadle loom. Whether she asked too much money or whatever, the BBC could not find the funding to go ahead!\nIt would have put the weaving issue centre stage to have shown one way in which the Shroud would have been woven on a medieval travel loom so I am sorry that it did not go ahead.\nAny crowd funding available from anyone?\n\n","date":"August 26, 2015 at 2:13 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208997","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"P.S. Naturally quite a lot of people have contacted me via History Today to make comments on my article and one of them still felt very angry about what he called the suppression of the 1976 Commission report.\n\n","date":"August 26, 2015 at 3:51 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209003","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"“But it is absolutely unnecessary to launch baseless attacks on their character and accuse them of negligence or worse, which you have done on numerous occasions”\nBut that statement is itself a character attack! What’s more it broadens the issue to things I’ve said in the past, attempting to portray me as a serial offender in making “baseless” attacks. \nALL my comments re John Heller, Alan Adler, Ray Rogers etc, far from being baseless, have addressed highly technical details to do with experimental  protocols and modus operandi, with a common factor emerging in all cases, namely scientists with certain specialized backgrounds going way beyond their areas of specific competence, and performing essentially as gifted and in some instances ungifted amateurs, often mixing fact and speculation leaving this reader at least flummoxed and bemused. This is NOT a character attack. It’s a criticism of their lack of professionalism in certain highly specified areas  (it is and never was generalized beyond that).\n Barrie has gone way, way beyond the initial flagged-up issue re Heller and Adler’s failure to go to Turin in 1978. The issue has been widened and turned into a serious slur on this investigator’s character. I request that he (or Dan Porter) remove the quoted passage at the earliest opportunity. Now would seem to be as good a time as any.\n\n","date":"August 26, 2015 at 1:38 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-208995","author":"Colin Berry","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"As I understand it, Dr. Robert Bucklin proved from his surface autopsy that the man on the Shroud was most certainly dead.  If that is the case, then does this entire thing matter?\n\n","date":"August 26, 2015 at 10:33 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209064","author":"Dcn Andy","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Dr Robert Bucklin knew very well that you can’t tell from a photograph of an imprint on a cloth of a body whether the man was dead or not, and did not claim to have proved anything. He did say: “The body appears to be in a state of rigor mortis” and “This [chest] wound has all the characteristics of a postmortem type flow of blood” and “the forensic pathologist can come to a reasonable conclusion as to the circumstances of death” and clearly thinks that he has established the fact of death, but that’s not the same as proving it. The distinction is subtle, but it leaves room for others to disagree with his findings, and to come to different conclusions. In particular, I was talking to a young surgeon last week who did not believe that the blood-flow from the chest wound could have come from a body which had been dead for any length of time, based on his own recent experience with traumatic deaths.\nIn addition to this, some of Bucklin’s observations are clearly guesses. His estimate of the height of the man, confidently given as 71″, is not substantiated by the measuring tool on Shroud Scope, and his calculations about the angle of the arms appear to be based simply on the angles between the arms and the bloodflows on them, which are not borne out by experimentation such as Garlaschelli’s. He also notices “a square imprint giving the appearance of an object resting on the skin” on the forehead, and “rounded foreign objects can be noted on the imprint in the area of the right and left eyes.”\nNone of this, of course, ‘proves’ that the eminent pathologist was wrong in his conclusions, but the statement “Dr. Robert Bucklin proved from his surface autopsy that the man on the Shroud was most certainly dead” is unjustified.\n\n","date":"August 27, 2015 at 3:29 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209085","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"“In particular, I was talking to a young surgeon last week who did not believe that the blood-flow from the chest wound could have come from a body which had been dead for any length of time, based on his own recent experience with traumatic deaths.”\nHugh,\nI have been impressed by what I perceive to be a more open skepticism on your part in the past month or so. However, I think your quote of a “young surgeon” to rebut Bucklin is a bit off the mark if you are seriously pitting his opinion against Bucklin’s.\nYour “young” surgeons statement is not very precise. What does  “length of time” mean. Ten minutes? Two hours, a day?  From the Gospel account we are told that a Roman soldier thrust a lance into Christ’s side and “blood and water” flowed out. What the pathologists have told us is that the water was in fact a clear fluid. It was in fact a signal of his death as the Roman soldiers probably knew from their experience as executioners. Christ was hanging on the cross at the time.\nHow familiar was your young surgeon with the STURP findings and subsequent analysis. Had he scanned it once or twice or did he labor long hours into the night reviewing its multitudinous reports?\nHow many autopsies has your young surgeon done? A ten? A hundred? a thousand? Bucklin had performed thousands. Is Bucklin’s report in inerrant scripture? Of course not. Zugibe has disputed among other things the cause of death as determined by his multiple predecessor pathologists – but Zugibe found a cause of death. He also critiqued the nail through the wrist finding which was frankly a matter of anatomical semantics. \nWhat we come down to is really a question of circumstantial evidence which in other contexts “atheist Pope”  Richard Dawkins as decreed to be superior to eye witness testimony in many cases. The accumulation of circumstances can lead to a conclusion. We do not order our life by proof beyond a reasonable doubt but in the case of the death of the man in the shroud, doubt, in the totality of the circumstances, death is more than reasonable and beyond “reasonable” doubt. Jurors are sometimes told that “reasonable doubt” is a not a doubt “that come in the meddle of the night” but in the light of day.\nIn law we have what are called “curbstone opinions.” That means someone asks a lawyer a question about the law when there is no lawyer-client relationship. When the lawyer answers the questions he often ends with Of course, that’s my curbstone opinion.”What that means is “you are not my client and you can not rely on it.”\nAn opinion identified by someone as only by “young surgeon” is a classic medical “curbstone opinion.” \nIt’s like the guy in his kitchen performing research with his tea kettle. Another example of “curbstone opinions” is Charles Freeman’s unidentified experts who are free with their opinions but OMG don’t cite them by name.\nCircumstantial evidence about Christ is all that we have. The eyewitnesses are long gone.\nIf I am sounding a bit too much like a lawyer, proving facts in real life is what we do. One of those facts often litigated is cause of death. In jurisdictions which still have a death penalty, circumstantial evidence can also cause death.\n\n","date":"August 27, 2015 at 7:04 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209103","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Point taken, Hugh.  I should have worded it differently.\n\n","date":"August 27, 2015 at 10:13 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209178","author":"Dcn Andy","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I agree absolutely with everything John has just said. My ‘young surgeon’ was someone I met at the Jalsa Salana, and I did not go into details about his experience. He described himself as a ‘general surgeon’ and said he had had some experience of traumatic death. Whether he was a practicing forensic pathologist or a freshly qualified student I’ve no idea.\nBut that’s not the point. I was not querying Dr Bucklin’s qualifications or experience; I was merely saying that his views are not “proof” of anything, and that there is room for disagreement of his findings. Dcn Andy, above, implied that after Bucklin’s ‘autopsy’ the question of the authenticity of the Shroud was settled conclusively, and I wanted to explain that that isn’t so.\nOf course I do realise that the word proof means something different to a lawyer than it does to a mathematician (it doesn’t mean anything to a scientist). To a lawyer, a guilty verdict is declared after proof beyond reasonable doubt. He knows only too well, however, that there is an elaborate appeals structure, suggesting that ‘reasonable doubt’ can be a variable quantity. I am certain that I could establish reasonable doubt against the authenticity of the Shroud – but then, I think John could probably establish reasonable doubt about its medieval provenance if the indictment was worded in the other way.\n\n","date":"August 27, 2015 at 8:18 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209113","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hugh,\nThe Islamic sect which sponsored Jalsa Salana accepts the reality of Christ but not his death on the Cross. There are, I am sure you know, a whole tradition of Christ in India – just as there is a tradition of Christ in Gastonbury before his public life. There is even a hymn about that (Jerusalem) based upon a poem by Blake that was song in movie Chariots of Fire. It was a favorite of my late son Michael. See http://johnklotz.blogspot.com/2007_10_01_archive.html In that piece I used scientific metaphors for that became the guts of “Quantum Christ.”\nI think the authenticity of the Shroud is a very, very important issue. I am beginning preparation of new work which will be essentially a palimpsest of “Quantum Christ.”\nI first saw the first word palimpsest in the opening credits of the movie version of “The Name of the Rose.” Umberto Eco is one of the foremost , if not the  foremost, scholar of  semiotics in the world. I just had to use it now.\n\n","date":"August 27, 2015 at 8:58 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209118","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"As I mentioned sometime back, we have not come across any person who is dead or alive leaving a image like TS on his burial cloth if dead or on his covered cloth if he is still alive.\nSo far no human being has managed to explain how person can resurrect from dead or what reactions are happening during the resurrection process.\nOld or young doctors can give their own opinions based on their experience on dead or live human bodies.\nJohn what is the real meaning of Quantum Christ?\n\n","date":"August 27, 2015 at 11:06 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209180","author":"Sampath Fernando","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hi John\nSee my comment above. The Islamic sect accepts Jesus, not Christ. The tradition of Christ in India does not correspond to what the sect is saying. We are now to believe that Jesus was the greatest trickster in history, saying that he would be resurrected on the third day, but actually quietly recovered in the tomb and went to Kashmir? Is this the way to promote religious harmony? Really? Why were Cardinal Vincent Nichols and Archbishop Justin Welby not present? Were they afraid that what they would hear would make them lose their jobs overnight?\n\n","date":"August 27, 2015 at 9:39 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209122","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Religious harmony begins with listening to what your neighbour believes and respecting his free will to believe it. Discussion can begin when he reciprocates. The Truth will reveal itself in the process.\n\n","date":"August 27, 2015 at 10:35 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209126","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"And what truth is that?\n\n","date":"August 27, 2015 at 10:53 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209127","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I shall respond to that question the same as Jesus responded to Pilate. :)\n\n","date":"August 27, 2015 at 11:09 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209129","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"That is beside the point. I did not see any discussion taking place in Hampshire. What I read was what about harmony, but it is easy to talk about harmony when there is no discussion.\nSee the comment directed to John above.\n\n","date":"August 27, 2015 at 12:42 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209131","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Then let us pray discussion flows from the harmony.\n\n","date":"August 27, 2015 at 12:55 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209134","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"OK, that’s fine for me, however I doubt that will happen because an agenda is involved and “Shroudies” are pretending that it is not there for PR’ sake.\nI see more ethics here:\nhttp://news.yahoo.com/muslims-not-doing-enough-fight-jordans-queen-rania-155209217.html;_ylt=AwrBTz9RVN9VYKIAM35XNyoA;_ylu=X3oDMTBybGY3bmpvBGNvbG8DYmYxBHBvcwMyBHZ0aWQDBHNlYwNzcg\nShe said that because she went with King Abdullah to see Pope Francis not long ago. He was also worried:\nhttp://www.christianpost.com/news/pope-francis-deeply-concerned-about-christian-persecution-says-stronger-than-1st-century-church-121562/\n\n","date":"August 27, 2015 at 1:27 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209136","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"It is your contention then that certain Islamic groups would like to use the Shroud as a wedge against Christians, using it to deny the Resurrection ever happened. As such, you see the Ahmadiyya event as a means to that end, and thus any prominent Shroudies that attended (like Hugh and Barrie) as unwittingly aiding and abetting that agenda. This in turn will make Church officials more nervous as to the direction Shroud thought is heading and make them less open to new study of the relic.\nHave I summarized this correctly?\n\n","date":"August 27, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209139","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Wrong. I see an agenda and have the means to prove it and will do so at the right time. Other “Shroudies” are of course free to draw their own conclusions, but I would advise you to watch the video by Simon Brown carefully.\nWatch it again and let me have your views.\n\n","date":"August 27, 2015 at 1:53 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209141","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Fair enough. I’ll do so this evening.\n\n","date":"August 27, 2015 at 2:01 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209142","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Good, take your time, there is no need to hurry.\n\n","date":"August 27, 2015 at 2:18 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209143","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"In reading Fr. Richard Rohr, ” The Naked Now” I find he writes that St. Francis, “told us friars that if we found a page of the Koran, we should kiss it and place it on the altar.” I could not find that direct quote but I found this by Pope Francis,\n “Jesus Christ, Jehovah, Allah. These are all names employed to describe an entity that is distinctly the same across the world. For centuries, blood has been needlessly shed because of the desire to segregate our faiths. This, however, should be the very concept which unites us as people, as nations, and as a world bound by faith. Together, we can bring about an unprecedented age of peace, all we need to achieve such a state is respect each others beliefs, for we are all children of God regardless of the name we choose to address him by. We can accomplish miraculous things in the world by merging our faiths, and the time for such a movement is now. No longer shall we slaughter our neighbors over differences in reference to their God.”\nI also find that many of the things that are taught in Eastern beliefs are the same as what is taught in the Bible.\n\n","date":"August 27, 2015 at 1:05 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209135","author":"John Green","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Excellent post John. Do you have a specific reference for that quote from Francis?\nI look that the things he has accomplished and is trying to accomplish an I think: Someone has let the Holy Spirit lose. I alter found out that a classmate of mine who is pastor of an inner city Syracuse NY parish, had a banner hanging in hanging in the choir loft church: “Someone has left the Holy Spirit lose and “she” is wild.” There was no communication between us for years. Noosphere anyone?\n\n","date":"August 27, 2015 at 1:31 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209138","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Found it here John\nhttp://nationalreport.net/pope-francis-followers-koran-holy-bible/\n\n","date":"August 27, 2015 at 2:42 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209144","author":"John Green","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Mr Green\nJesus Christ, Jehovah, Allah– please include Brahma as well\n“We can accomplish miraculous things in the world by merging our faiths, and the time for such a movement is now. No longer shall we slaughter our neighbors over differences in reference to their God.””\nWhat a wonderful saying Mr. Green. Thank you very much we must discard all sort of fundamentalism. (unlike Christians believe Jesus discarded all sort of fundamentalism)\n\n","date":"August 27, 2015 at 8:49 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209172","author":"Sampath Fernando","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Well, wouldn’t that be nice. How often must one emphasise the importance of primary sources. This quote comes from the National Report, which by its own description “is a news and political satire web publication, which may or may not use real names, often in semi-real or mostly fictitious ways. All news articles contained within National Report are fiction, and presumably fake news. Any resemblance to the truth is purely coincidental.”\nIn other words, Pope Francis said no such thing. http://athanasiuscm.org/2015/06/03/more-reasons-to-ignore-pope-francis-quotes explores the report in more detail.\n\n","date":"August 27, 2015 at 1:30 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209137","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Don’t know Hugh, but Fr. Richard Rohr did write in his book(pg 53), ” The Naked Now” that St. Francis, “told us friars that if we found a page of the Koran, we should kiss it and place it on the altar.”. \nAs I wrote I was looking for what was behind what Fr. Richard Rohr wrote. I noticed in a footnote Rohr gives Kathleen Warren, “Daring to cross the Threshold” (Rochester, Minn.:Sisters of St. Francis,2003).\n\n","date":"August 27, 2015 at 3:04 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209147","author":"John Green","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Father Rohr expresses his own views, in the way he likes, and has had problems with the Church. As for Pope Francis, he did a lot of good work as archbishop of Buenos Aires, but I doubt he knows much beyond what the Peruvian priest Father Gustavo Gutierrez has written.\nPope John Paul II had a doctorate in philosophy, Benedict XVI taught at German universities for forty years.\n\n","date":"August 27, 2015 at 3:28 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209151","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"There are indeed similarities in many religions, however there are also differences. It was because of this that atheist philosopher Bertrand Russell said that only one of them could be true. It is essential to understand the differences instead of living in a world of make believe.\nThe Goan scholar Professor Gavin d’Costa, at the University of Bristol, is the expert in this field, advises both Catholic and Anglican Churches in England as well as the Holy See, and has written a number of books:\n http://research-information.bristol.ac.uk/en/persons/gavin-g-dcosta(0a9d8782-e5f7-4f10-a973-c83542bb7fb0).html\n\n","date":"August 27, 2015 at 1:41 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209140","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Thanks Louis. Yeah, Fr. Rohr tends to put things in his own words and that’s why I was looking for a direct quote. \nFr. Rohr is a Mystic and believe in nondualism, that’s why his books interest me.\n\n","date":"August 27, 2015 at 3:48 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209155","author":"John Green","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"You’re welcome, John. I have had to read and even conduct some on-site research on sects and religions in the past. People are sometimes confused. Once the editor of a big publishing house asked me whether a well-known author demonstrated satanic elements in his book and on another occasion I was requested by another editor to read the biography of a world-renowned scholar and give an opinion.\nOne has to read different points of view and then reach a conclusion about the most viable hypothesis.\nIn Hinduism there is confusion about whether there is dualism or non-dualism in Jesus, the great Hindu sages studied the Gospels thoroughly. It is important for them because he is generally considered to be avatar in Hinduism.\n\n","date":"August 27, 2015 at 4:29 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209159","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"ACTUALLY THERE IS POST MORTEM BLOOD ON THE SHROUD AND NO I DON’T REALLY THINK WE HAVE A PROBLEM\n«Now if, indeed, no post-mortem blood exists on the Shroud, and it has simply been assumed, by the scientists, including Heller, that the Shroud contains post-mortem blood [Hang with me, here!!], then would our conclusions regarding the scientific results of studies on the Shroud change?»\nIt seems to me that this discussion is going astray from the topic and as a modest Shroud researcher and medical doctor I’d like to give my contribution to it.\nDespite all the naif arguments presented by skeptics and  partisans of the swoon theory reliable forensic evidence regarding the image and bloodstains pointing to the fact that the Shroud did wrap a corpse is overwhelming.\nIs there human blood on the Shroud?\nSpectroscopic chemical and immunological tests namely ABO and MNS blood typing allow us to give a positive answer.( I understand that absolute scientific exactness allows us to state that there is primate blood on the Shroud possibly human…)\nWhat are main blood changes after death?\nBiochemical analysis of blood show that within a period of 96 hours there is a Ph decrease and an increase in blood concentration of lactate NADH and nitrogen containing metabolites like hypoxantine, uric acid and ammonia   http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0082011\nHave these metabolites been found in conducted blood analysis on colllected Shroud samples?\nNO BUT IT DOES  NOT PRECLUDE THE EXISTENCE OF POST MORTEM BLOOD.\nRemember the difficulties in proving the presence of blood on the Shroud.not to mention that the mentioned study on this subject  was performed on blood samples within 96 hours after death NOT CENTURIES or MILLENNIA !!!\nBlood cells also experience metabolic and membrane changes and  die .\nAlthough few blood red cells have been found on the Shroud-and there is a reasonable explanation why, I recall that bloodstains on the Shroud are not whole blood but blood exsudates from clots, the cells remained trapped by the fibrin network- Professor Baima Bolllone and Dr. Gerard Lucotte found red blood cells with altered shape.\nSo the presence of ante mortem and post mortem blood when applied to the Shroud cannot be approached by analysis of metabolites or blood cells BUT BY THE MACROSCOPIC OBSERVATION OF THE BLOODSTAINS ON THE SHROUD BY EXPERIENCED FORENSIC PATHOLOGISTS- this is my humble opinion and my mind is opened to advices from experts on forensic and biochemical sciences..\nAre Professors Judica Cordiglia, Sebastiano Rodante,, Pierluigi Baima Bollone, Frederick Zugibe,, Dr. Robert Bucklin Dr. Delfin Villalain experienced forensic patholgists? YES THEY ARE.\nWhat is their opinion?\nI’ll quote only a few\nDr. Robert Bucklin: Upon examining the chest, the pathologist notes a large blood stain over the right pectoral area Close examination shows a variance in intensity of the stain consistent with the presence of two types of fluid, one comprised of blood, and the other resembling water. There is distinct evidence of a gravitational effect on this stain with the blood flowing downward and without spatter of other evidence of the projectile activity which would be expected from blood issuing from a functional arterial source. This wound has all the characteristics of a postmortem type flow of blood from a body cavity or from an organ such as the heart. At the upper plane of the wound is an ovoid skin defect which is characteristic of a penetrating track produced by a sharp puncturing instrument.\nDr Delfin Villalain (and orthopedic surgeon Professor de Palacios Carvajal):\n5.2 The separated blood of the side wound\nComment to § 3.2. Would the side wound reveal that the blood circulation was still active?\nThe side wound resulted from a blow with a sharp instrument, like a spear, driven through the 5th\nintercostal space (Barbet, 1954; 1970; Baima Bollone, 1990, 2000).\nIt consists of an oval, elongated mark (4 x 1.5 cm, Fig. 3, in yellow) corresponding to the area\nwhere the spear entered, plus a bloody outflow 6 cm wide and 15 cm long. The injury shows that\nthe skin has been sharply cut, having pointed extremities and rectilinear wide open lips as if the\ndamaging agent had deeply penetrated (Baima Bollone, 1994). The wound does not show signs of\nvital retraction, as should happen in the case of a living person, and the blow must have been\ninflicted on a corpse (Baima Bollone, 1990, 1994, 2000; Zugibe, 2005).\nThe outflow is composed of some rivulets of red liquid (blood) plus a clearer liquid (serum), as\nrevealed by UV photos (made by G.B. Judica Cordiglia 1988 and V. Miller 1981). See Fig. 3 and\nthe graphic elaboration of TS high resolution photos (Bedon et al., 2008). Such kind of stain is\npossible if internal body structures have been wounded. In addition Baima Bollone (1994) observes\nthat wounds of a living person bleed actively, whereas this outflow has all the characteristics of a\npassive drainage.\nFig. 3. On the upper left, ultraviolet photograph of the lance\nwound which enhances the serum contraction rings around\nthe bloodstain (courtesy of V. Miller 1981 and A. Adler, from\nThe Orphanated Manuscript, 2002, Fig. 2). On the right side,\nwound bloodstain as seen on the TS. The main blood rivulet\nhas been enhanced in red.\nINTERNATIONAL CONFERENCE ON THE SHROUD OF TURIN PERSPECTIVES OF A MULTIFACETED\nENIGMA: COLUMBUS – OHIO AUGUST 14-17, 2008\n7\nA possible source for the blood is liquid accumulation in situ (within the thoracic cavity) and\nsubsequent separation of its components after a hemopericardium (most probable), a hemothorax\n(Baima Bollone, 1990; 2000) or a huge thoracic trauma (Battaglini, 1987, 1990; Pisano, 1991).\nThe blood separation into its components is considered a sign of death, because the blood must\nrest still for a certain period of time and blood circulation must be obviously stopped to allow it\n(Baima Bollone, 1994, and references therein, Zugibe, 2005).\nThe repeated bleeding of this wound does not mean that the heart was beating and the man was\nalive, but can be easily explained by passive flowing of blood during body transport (Baima Bollone,\n1990, 1994; Coppini, 1992), probably responsible also for the blood belt on the dorsal image.  in «The death of the Shroud Man an improved review» http://www.ohioshroudconference.com/papers/p07.pdf \nProfessor Baima Bollone has a similar opinion regarding the side wound and  states that blood flow from the feet left an imprint of mixed vital and post mortem blood. in The Forensic Characteristics of the Blood Marks, International Scientific Symposium Torino 2-5 March 2000\nI could cite more examples but not to make this comment too long I’ll end here.\nSO DESPITE ALL THE FUSS IT TURNS OUT THAT THERE IS POST MORTEM BLOOD ON THE SHROUD\n                                                                        regards\n                                                        Antero de Frias Moreira\n                                                (Centro Português de Sindonologia)\n\n","date":"August 27, 2015 at 3:02 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209146","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Thanks for bring us back on point with this important post.\n\n","date":"August 27, 2015 at 3:33 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209152","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"You”re welcome\n\n","date":"August 28, 2015 at 4:11 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209188","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"WHOA!!  Look at the lengthy exchanges that my PRIVATE [or so I’d thought!!] email to Mr. Porter generated.  I’M IMPORTANT!!!   LOL!!!\nYes, I am the author of the email that you guys have been SO gracious to pay so much attention to, thus bestowing upon my…ahem…wholly unworthy self, such honor!!  \nOh, lest anyone think that I have been trying to HIDE, or DUCK, for some subterranean reason, let me introduce myself:\nMy name is Ronald Dennis Chism\nI’m not Jewish.  I just LIKE the term, “Oy vey,” because I have YET to find a term, anywhere, that SO expresses that special kind of frustration that, I’ve noticed, can only be expressed by COMPETENT speakers of Yiddish.  And I’m NOT that competent.\nI am NOT, as I said, a professional scientist, and I’m not ANY kind of scientists.  There was no attempt, on my part, to [ahem, JOHN] suggest anything by using the word “hire,” as regards Barry’s participation in the STURP studies.  Hired, JOINED, whatever.  I certainly was not using the term “hired” as meaning ANYTHING other than that he was part of the team.  Yet, my apologies displaying…well, WHATEVER it is you think I was trying to display.\nNo, I’m not Jewish, ALTHOUGH I have been TOLD that black people of the United States are the descendants of the “original,” ancient Israelites all “white” Jews in Israel must, poste haste, LEAVE that land and make room for US [Uh…No, I DO NOT subscribe to that idea, in part because the IDF has proven to posses some of the BAAAAAADEST cats on the planet, and I have NO desire whatsoever to tangle with THEM.  In addition, as a somewhat “former” martial artist, I am aware that a Jewish guy won, THREE YEARS IN A ROW, the annual, underground, fight-to-the-death martial arts contest, sometimes held in…Well, I suppose I shouldn’t reveal that here.]\nAnyway, I have MUCHO respect for the Jewish warriors that would not think to kindly of my going to Jerusalem, and “re-claiming” my “rightful” home as an “original” black Jew.  Naw, John, no big deal.  I just LIKE the term, “Oy vey.”  I think it’s cool!!\nNow, for a little background, before I reveal some more “startling” information about…ahem…my august self, that has been able to draw so much attention from such a distinguished crowd of Santa Sindone researchers, Santa Sindone enthusiasts [Hey, Barry!!  Long time no rap!!]\nI was born and raised in Chicago, on Chicago’s south side.  Although my carpenter dad was not into religion, he sent me to Catholic school, because, back then, Catholic school was considered to offer a superior “education” than public school.\nI LOVED my Catholic/Christian religion.  For 8 years I attended Corpus Christ Grammar school, under the watchful…ahem…”CARE” of Fransiscan nuns, that would, BEAT YO ASS, just for not placing your winter boots directly under your coat, in the “cloak room.”  IN FACT, with my own eyes, in the 8th grade, I witnessed Sister Mary Teresita [I omit her real name] WHUP, and I mean OUT-BOX, the baadest cat on the south side of Chicago, whose name I shall also omit.  \nWell, after graduation, I attended Hales Franciscan High School, under the EQUALLY watchful care of Franciscan PRIESTS–another group of ass-kicking, GREAT scholars, that didn’t take crap from students.  \nSomething happened along the way, in my Catholic sojourn: COMMON SENSE.  I believed the doctrine–totally.  But, in the 7th grade, something wasn’t making sense.  It was not until my Junior year in high school that I faced what was OBVIOUS, with regard to that Jewish guy whose Jewish mamma gave him [for some reason] a GREEK name: “Jesus Christ,” probably actually known as Yehoshuwah, or Yeshuwah.\nWhat did I discover?\n“And as they thus spake, Jesus himself stood in the midst of them, and saith unto them, Peace be unto you [Shalom Alaikum]. But they were terrified and affrighted, and supposed [SUPPOSED]  that they had seen a spirit. And he said unto them, Why are ye troubled? and why do thoughts arise in your hearts? Behold my hands and my feet, that it is I myself: handle me, and see; for a spirit hath not flesh and bones, as ye see me have. And when he had thus spoken, he shewed them his hands and his feet. And while they yet believed not for joy, and wondered, he said unto them, Have ye here any meat? And they gave him a piece of a broiled fish, and of an honeycomb. And he took it, and did eat before them. [The Bible].\nNow, I didn’t “discover” that verse.  I had known that verse, inside and out, all of my Catholic life, from kindergarten, all the way up to when I FINALLY read the verses, AS THEY WERE, without attaching anything supernatural to them.  \nThe more I questioned those Franciscan priests, the more I realized that I had been sold FALSEHOOD.  The had no decent answers, relying instead on doctrines that made no sense whatsoever.  \nI have never needed the Santa Sindone, or any such artifact, to conclude what was RIGHT THERE IN THE BIBLE (Read the verses again).   “Hey, dudes, IT’S ME!  I survived!  And I’m HUNGRY!!  Ya’ll got anything to eat?  Lemme tell ya, being CRUCIFIED will leave ANYONE famished!”\nRight there in the Bible, DE-MYSTIFIED, was a truth that I had ignored, for all of those years, as a Catholic.  He had survived.  No Shroud needed.  No tomb of Jesus in Kashmir needed.  The testimony supporting his survival was right there in the Bible.  And the stuff about “rising up to heaven” is something you should probably talk to Dr. Thomas Sheehan about, as well as other Christian scholars that KNOW BETTER, and have openly stated that, as per their intense studies, the “rising to heaven” stuff was what they call a “pious embellishment” [We would have called it something ELSE, in MY old neighborhood].\nNow, continuing.  After having “discovered,” in my Bible, that “Jesus Christ,” the Jewish guy with the Greek name, had survived the Crucifixion, I decided that I wanted to know MORE, and that I would commit a portion of my life to finding out WHAT ELSE was out here that the Catholics had LIED about.\nAnd I found The Ahmadiyya Movement in Islam, now called The Ahmadiyya Muslim Community.  And I JOINED that Movement in the year 1976.  So, hey, I have nothing to hide.  I didn’t need Ahmadiyyat to tell me that the Jewish guy with the Greek name had survived the crucifixion.  I’d ALREADY discovered that simply by reading my Bible!!\nWhat Ahmadiyyat did was SPELL IT OUT; Ahmadiyyat went deeper, its founder, Hazrat Mirza Ghulam Ahmad, performing his own, independent studies, and reporting on those studies in a book entitled, Masih Hindustein Mein (Messiah in India), later, in 1939, translated, in the English language, to Jesus in India.\nIn time, I created The Tomb of Jesus Christ Website (www.tombofjesus.com), which was the first, super lengthy website dealing with the theory that the Jewish guy with the Greek name had survived the crucifixion, and made his way to India.\nOh, you mean you DIDN’T KNOW that Flavius Josephus had reported that he witnessed a crucifixion victim SURVIVE that ordeal??  Here is what he said:\n“”I was sent by Titus Caesar with Ceralius and a thousand riders to a certain town by the name of Thecoa to find out whether a camp could be set up at this place. On my return I saw many prisoners who had been crucified, and recognized three of them as my former companions. I was inwardly very sad about this and went with tears in my eyes to Titus and told him about them. He at once gave the order that they should be taken down and given the best treatment so they could get better. However two of them died while being attended to by the doctor; the third recovered.” (Flavius Josephus, Vita, IV, 75)\nNo one’s trying to be sneaky.  My interest in the Santa Sindone occurred a LONG TIME ago, and I have no problem whatsoever acknowledging that I might have forgotten some things.  But one thing I DIDN’T forget: Barry Schwortz DID tell me that he had met with Adler, in Turin; that he had had tea, or lunch, or something with him; and that Adler had told him that NO TEST OF POST-MORTEM BLOOD had been performed.  Now, maybe he meant something that I didn’t understand, but that’s what he said to me.\nBy the way, I’m cool with Barry.  Barry and I got along REAL well, for a short period of time, a long time ago, through email correspondence.  I got no beef with ANYBODY.  I have no agenda.  I’m a VERY lowly member of Ahmadiyyat, 65 years old, somewhat “retired” as it relates to “tabligh” (preaching, and all that).\nI am no longer a proselyte.  Those were my YOUNGER days.  I have no interest in tearing down Christianity.  Indeed, Christianity has done an EXCELLENT job of tearing ITSELF down, and without anyone’s help [Crusades,  Inquisition, house arrest, burning of “witches,” decapitation, CHATTEL SLAVERY (one of the slave ships that brought my people to America was called, “The Good Ship Jesus.”  HELLO!!!]\nSo, CARRY ON, good people!!  My wife just called, and I told her how much I’ve been HONORED here, and she burst out laughing–Oh, not at YOU!  But, only because she knows that I LOVE to see folks duking it out over alleged 2,000-year-old artifacts [It’s my hobby].\nLook, I’m not making lite of YOU guys, but I think that SOME of you are a bit too serious, making charges against other people, etc.\nLast, I repeat for emphasis: I discovered the truth about the Jewish guy with the Greek name IN HIGH SCHOOL, and I did so by reading the Bible.\nNow, whether or not the Santa Sindone is the cloth that covered him?  I have NO IDEA whatsoever.  All I did, as not even a good amateur, was ASK A FEW QUESTIONS, that’s all. \nBut, I do appreciate the LOVE that you all have extended to me.  It’s HARD, these days, for a black man to get some LOVE, what with a bunch of us being SHOT TO DEATH IN THE STREETS, here in my country.\nUh oh…Who’s that standing on my porch…Some….some guy….WITH A GUN!!!  WAIT….DON’T SHOOT!!!!! \nHey, look, if you can’t laugh, in THIS world, you’re in SAD SHAPE!!\nAs we used to say in the ’60s,\nPEACE OUT!!\nYour loving trouble-maker,\nRonald Dennis Chism, formerly known as,\nThe Tomb Master (Because of my single-handed authorship–and yes I’m proud of it–of The Tomb of Jesus Christ Website).\n\n","date":"August 29, 2015 at 4:35 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209268","author":"Ronald Dennis Chism (The Tomb Master)","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Ronald:\n¡El problema es que su Biblia debía estar MUY INCOMPLETA…..!\n– Mateo 27:50\n[“Jesus, when he had cried again with a loud voice, yielded up the ghost.”]\n– Marcos 15:37\n [“And Jesus cried with a loud voice, and gave up the ghost”.].\n– Lucas 23:46\n[“And when Jesus had cried with a loud voice, he said, Father, into thy hands I commend my spirit: and having said thus, he gave up the ghost.”]\nJuan 19:30\n[“When Jesus therefore had received the vinegar, he said, It is finished: and he bowed his head, and gave up the ghost.”]\nCarlos\n\n","date":"August 29, 2015 at 6:44 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209276","author":"Carlos","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Uh, you DO NOT wish to engage me in this manner, believe me.  Also, let’s not hijack what has become a SCIENTIFIC discussion here.  I came here to clarify my identity, not to argue or debate about doctrine.  My mention about my conclusions regarding “Jesus” was only for the purpose of offering a more complete bio of myself, NO MORE than that.\n\n","date":"August 29, 2015 at 7:03 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209277","author":"Ron","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Then why don’t you respond to some of the rebuttals and questions raised by John, Louis, Nabber, and Barrie. And Carlos’s quotes also are not doctrine but Gospel evidence that Jesus died….yeah as in his heart stopped beating and he was decidedly deceased. And don’t be givin’ me no jive, now. ;)\n\n","date":"August 29, 2015 at 10:40 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209282","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Oy vey.  Did you not understand my previous response?\n\n","date":"August 30, 2015 at 5:41 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209295","author":"Ron","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"To David & John:\nPerhaps I have been a bit too humble.  And perhaps because of that, you have made assumptions.\nIt is quite clear to me that, either both of you have not caught my hint, or you choose to ignore it.  I tried to crawl out of this discussion, explaining that I had written a PRIVATE email to Mr. Porter, which he chose (without my permission) to post.  Secondly, I explained, or hinted, that, years ago, I sat at one of the very CENTERS of this discussion, having worked with Professor Fida Hassnain, former Director of Archives, Archaeology, Research and Museums, for the Indian state of Kashmir.   \nI have written a book on this subject entitled, “Saving the Savior: Did Christ Survive the Crucifixion.”  I have written a large website on this subject, entitled, The Tomb of Jesus Christ Website.  I am familiar with many things that, I am 100% certain, NONE of you are familiar with, including ancient documents, including CHRISTIAN documents, such as The Acta Thomae, that stand as testimony to the FACT that the man kinown as “Jesus Christ” did  survive the crucifixion.\nI’m sorry if I sound arrogant, but I have done a form of research that none of you have, and I can say that with confidence.  And UNLESS you have done the research that I have done, then it is utterly impossible for you to engage in an exchange with me, nor I with you.  It’s just not possible, because I would have to reproduce a voluminous amount of information, and it can’t be done at a little blog.\nFor one thing, most of you are Christians, as it seems.  And, for you [FOR YOU] the authoritative account of the life of “Jesus Christ” is the Bible and ONLY the Bible.  That is not the case for me.  Not at all.  I am not a Christian.  As such, I am not bound by the Bible.  \nWhat I have done, in my DECADES of research, is use the Bible as ONE source.  And I have to do that, because the Bible is flawed.  It cannot be relied upon as the SOLE source of information on Jesus, or anything else for that matter.  So, some of the information about “Jesus,” in the Bible is correct.  And some of it is flawed beyond expression.  \nHaving DISCOVERED those flaws, a long time ago, I set out to find OTHER information about Jesus, though not discarding that information, in the Bible, that HAPPENS to be correct.  And, yes, one HAS to “pick and choose,” in this manner, because the Bible has been tampered with, mis-translated, INTERPOLATED.  Entire BOOKS of the Bible were taken out by “inspired” (criminal), so-called “Fathers” of the Church.  \nSo, the Bible is very far from an authoritative account of the life of the figure known as “Jesus.”  It takes lots of detective work to round out the life of Jesus, and that work involves reading Christian (including so-called “apocryphal”) accounts, as well as non-Christian (Buddhist accounts, accounts from Sanatana Dharma (“Hinduism”), accounts from other cultures, in other languages (Persian, Sanskrit, Urdu, etc.)\nIf you have not read, or at least gained some familiarity with [and these are NOT Ahmadiyya books),\nThe Bhavishya Mahapurana.\nThe oral traditions of The Followers of Jesus, of Afghanistan\nThe Rauzat-us-Safa\nIkmal-ud-Din\nThe Book of Balauhar & Budasaf (Yuz Asaf)\nThe Tariikh-i-Kashmir\nThe Tarikh-i-Kabir-i-Kashmir\nThe History of Religions and Doctrines\nThe Wajees-ut-Tawarikh\nThe Bagh-i-Sulaiman (Garden of Solomon)\nThe Official Decree of the Grand Mufti of Kashmir\nThe Acta Thomae\nThe Ain-ul-Hayat\nThe inscriptions of the Takhat Sulaiman monument,\nthen you are not in a position to have a discussion with me.  It’s not possible.  You have not done the necessary homework that is NEEDED in order to get a more complete picture of the life of Jesus.  And, since you’re bound by your Christian doctrine, which means your Christian texts, you are LOCKED.  You will not allow yourself to reach OUTSIDE of Christian references, because you believe the Bible, and other Christian references, to be THE authority on the life of “Jesus Christ.”  This is incorrect.  And there’s NO WAY I can reduce DECADES of my life, 376 pages of my book, my correspondence with Dr. Hassnain, Aziz Kashmiri, and others; work with such scholars as Suzanne Olsson, Arif Khan, and others.\nBy the way, if you are offended by my ETHNICITY that’s YOUR problem, not mine, and you NEED to get a grip.  I speak freely, as a MAN, not somebody’s BOY.  Nobody is going to tell me how to SPEAK.  I learned VERY WELL how to speak the “Kang’s” language, from FRANCISCAN priests and nuns.  I am very competent with the English language.\nBut I’m a BLACK MAN, and neither YOU nor anyone else is going to tell me to NOT speak from my culture.  Nobody rules me.  Those days NEVER EXISTED–not in MY life, anyway.  My dad’s middle name was ANDALUSIA.  I don’t expect you to understand what I’m alluding to.\nI’m not some ideologue that was handed a tract, on the street, about Ahmadiyyat, and then, eyes wide opened like some CULTIST, began MEMORIZING and repeating ideology.  No.  I RESEARCHED, and I did so for decades.\nI’m no longer in the game, though.  I sent Mr. Porter a PRIVATE EMAIL, and I was VERY surprised when he posted my PRIVATE email.  I was informed by Arif Khan that my PRIVATE email had been posted here.  That’s the only reason I posted anything here: to clarify.\nWhen I saw all the conversation that that PRIVATE email had caused, I decided to ENJOY myself [MY choice, not yours], and respond.\nOne of you talked to me about how serious this subject is.  OH???  REALLY???  You have NO idea how serious it is, NONE of you.  It’s way more than just religion and spirituality.  You won’t understand this, but I’ll say it anyway.  The belief that Jesus “died on the cross for the sins of the world” is DIRECTLY responsible for that sheet of debris, in one of our oceans, that’s the size of TEXAS.  The very manner in which Euro-man developed his science; his attitutde to LIFE; to nature, is directly influenced by his DISCONNECTION from The Divine, and his deification of a simple human being.\nPaul (the renegade!!) is perhaps the biggest TRAITOR to human progress that ever existed.  He destroyed the SIMPLE message of Yuz Asaf (Jesus); He ripped the SOUL out of humanity, and placed The Most High way, way at a DISTANCE from humanity.\nPaul is DIRECTLY (you won’t see this either) responsible for the eventual creation of THE SLAVE TRADE, which managed, as a consequence, to make BOTH of my uncles ALCOHOLICS!!!!  Both my uncles, and my mother and father DIED as a result of their natural rhythms being snatched away from them by SICK, so-called “Christians” that didn’t know that God was INSIDE of them, as Jesus had said:\n“The Kingdom of God is inside of you.”\nSo, don’t you DARE tell ME about how “serious” this discussion is, sir, because you don’t even have a CLUE.  The very philosophies that developed as a REACTION to Church-Christianity have wreaked havoc on the world.  \nYour Christian “god” RUINED the world.  Christianity ripped the very SOUL out of planet earth, and out of the collective consciousness of humanity.\nI know way more than you could ever imagine, or that you have ever thought about, and I say that with 100% confidence.  My people, to THIS day, are suffering on account of YOUR sick, Christian doctrine, that raised a simple human being to the Godhead.  \nTwo black slaves were taken to the Pope, and he “blessed” the Slave Trade.  That’s Christianity for you.  No, not the TRUE Christianity that Jesus talked about, which the Church DESTROYED.  \nThe True Christianity would never have spawned the Slave Trade; would never have arrested Galileo; would never have condemned the Jews, for TWO-THOUSAND YEARS, for a “crime” that Christianity said was supposed to happen ANYWAY: The “death” of “Jesus Christ” for the “sins” of the world.\nI have paid BIG dues–dues none of you have paid.  So, how can there be any exchange?  And THAT was my HINT!!  \nI tried to allow you guys to continue your scientific discussions (limited as they are, since you have only a tiny picture of “Jesus,” and have not gone beyond the few documents of the Church).\nYeah, you’re right!  It’s a SERIOUS subject.  And such a serious subject cannot properly be debated at some blog.  Books on the historicity of Jesus go back to the 1700s.  How am I supposed to come here and “discuss” anything.\nBesides, i dropped out of this subject about 13 years ago.  I gave The Tomb of Jesus Christ Website to Awais Khan, of Canada, and Arif Khan is the official editor of that site.  \nI SHO NUF ain’t gonna get back into this.  I”m gone gwine on on ’bout my BIZness [and if you don’t like my “ethnic” talk, that’s YOUR problem, no mine.  Talking “ethnic” doesn’t mean I’m not INTELLIGENT, or that I can’t carry on a conversation, or debate, using the “Kang’s” English].\nThe Santa Sindone is ONE piece of circumstantial evidence, and the jury is still out.  We can see this from the fact that SOME coroners claim that the Man of the Shroud was DEAD.  Others claim that the markings, stains, images, etc., in the Santa Sindone “prove” that he was alive.  \nMy conclusion regarding “Jesus” is NOT based solely on interpretations of studies on the Santa Sindone.  My conclusions are based on the GOOD DETECTIVE work of those that came before me, as well as my own detective work.\nThere IS no smoking gun, yet, unless the Rozabal is opened, and we find something definite.  What we have are a LOT of pieces of circumstantial evidence, that, taken together, prove that Jesus survived.  You guys are not familiar with all that evidence, so you’re limited.\nThe evidence goes from Jerusalem to Syria to Persia to Afghanistan to India to Tibet, to Kashmir, and even to China.  \nIn a court of law, accumulated circumstantial evidence can be MORE decisive than the smoking gun.  The smoking gun is there next to the body.  No finger prints.  But!!!  Detectives discover:\n1. The gun is registered to John Doe\n2. John doe BRAGGED, in front of 50 people, in a bar, that he was going to blow his wife’s head off on April 25th, 1975; that he was going to purchase a ticket to Paris, and stay in a certain hotel.\n3. The detectives go to the gunshop, from which the gun was purchased, and the salesman says, “Yeah, when the guy came in here, he said he was going to blow his wife’s head off, and he then smiled.  I thought he was joking.”\nWell, that’s enough.  John Doe is going to the slammer.\nThat’s how the historicity of “Jesus” has to be approached.  The Bible AIN’T enough.  The Santa Sindone AIN’T enough.  But, once you have TAKEN THE TIME to read ALL of the evidence; examined ALL of the accumulated, circumstantial evidence, it is THEN and ONLY then that we can have a conversation.\nPROMISE; I’m OUTTA here!!  And I won’t be back, no matter how much anyone tries to goad me into responding.\nThis was a BIG mistake, coming here, and I should have known better.  \nLast, do not assume that my particular way of communicating is indicative of how Ahmadi Muslims communicate.  Some Ahmadi Muslims will be DISPLEASED at how I’ve talked, but that’s THEIR problem.  I never claimed to be anybody’s example of anything.\nBut I DO say this: “Jesus Christ” is dead and buried in the Rozabal structure.  His sarcophagus lies UNDER that structure, underground, and could once be seen by a small aperture on the side of the building.  The facade sarcophagus on the ground level of that structure is just that–a facade.  \nThe story of his survival; his travels; and his SUCCESSFUL end of his life–teaching, marrying, having children, is a WONDERFUL story ahd truth.  His prayers were answered–those prayers that he prayed in the Garden of Gethsemane, that God SPARE him from the coming ordeal.\nHis prayers were answered.  And you’ll discover that IF you’re interested in taking the time to crawl out of your LIMITED, Christian references, and go out into the world and follow the trail.  You’ll find it.  You don’t have to be a scholar, either.  But you DO have to be FEARLESS, and have a strong desire to find the truth.  Selah.\nYours,\nWillie Bobo,\nThe King of 47th Street\n(“Say it loud!!  I’m black and I’m PROUD!!”   \nhttps://www.youtube.com/watch?v=j0A_N-wmiMo )\n— James Brown: Released, 1968–\n\n","date":"August 30, 2015 at 7:26 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209301","author":"Ronald Dennis Chism (The Tomb Master)","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Ron,\nI think the dispute over whether Christ had died on the Cross or survived and was revived, is simply too serious to lend itself to ethnic humor. I have dealt sarcastically with some of the claims made here. For example that the man in the Shroud was actually Jacques de Molay.\nThat is a claim that can be answered with scorn, maybe even satire. \nThe issue of whether Christ was dead or alive is not such an issue becasue it goes to the very heart of Christian belief.\nI did not have the benefit of a “Jesuit” education. In law school one of my colleagues who had attended a Jesuit College stated that he had been told by a Jesuit priest that the only doctrine that was a sine qua non for a Christian was the Resurrection. Now there are some who regard themselves Christian who will argue with that but I think it is a fair statement. \nOthers may disagree and that’s okay for in the final analysis our individual salvation is determined to our fealty to two great commandments of love.\nThe bookend holy days that mark the Christian faith are the nativity which celebrates the transfiguration of the human spirit by the birth of God made man and Easter, which is the hope of our salvation. They have been both satirized cruelly and ignorantly in the past. So when you begin a discussion of the issue of the reality of Christ’s death and Resurrection with a rather crude ethnic patter, that’s just not okay.\nOn the other hand, the reputation of the Islamic sect that has your  adherence is very okay. There is more than one road to paradise but they are all paved with the same thing: love.\n\n","date":"August 29, 2015 at 10:42 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209283","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Not enough room on this ‘little blog’ for detailed defences of theory, but room enough for a personal rant.\nGo in peace.\n\n","date":"August 30, 2015 at 4:51 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209322","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Ronald needs to revisit his presumptions concerning the survival of Jesus after crucifixion.  Of the three victims recovered at the request of Josephus, only one of them survived even after medical attention, and none of them had been given the fatal percussio blow.  \nIn Rome as part of the Capitoline collection, can be found the famous so-called Dying Gaul statue, a marble copy of a now-lost bronze original probably dating to about 220-230 BC.  The model has been identified as a Galatian, and the statue shows a sword wound at the lower right chest, quite identical to the chest wound of the Man of the Shroud.  It is a classic blow, known as the percussio, and was taught in the Roman military academies.  The consequences are always fatal, as the blow pierces both the heart and the pleural cavity.  \nUnder Roman Law, victims of crucifixion could be released to the family upon request, and this would only be denied for the most serious crimes of sedition or piracy.  In such cirumstances, the body could only be released after the percussio blow had been delivered to ensure that death had occurred.  In the gospel of John we read that the soldiers pierced the side of Jesus so that the body could be released to Joseph of Arimathaea, and that blood and water came out, the ‘water’ being the pericardial fluid.  The stain from this flow is apparent on the Shroud.  Upon death, the right ventricle is full of blood, and this is the source of the blood at the chest wound of the Shroud.  Quite likely it is also the source of the blood across the back flowing there as a result of the transport operation.\nIt may suit some religious perspectives to claim that Jesus survived his crucifixion to be eventually buried in Kashmir.  However this claim is utterly lacking in any adequate factual supporting evidence, in view of the manifest percussio blow delivered.  Citing one such survivor as reported by Josephus is inadequate, as the circumstances were clearly quite different.  One does not wrap a person in a Shroud, and roll a large boulder across the tomb entrance, as reported in all four gospels, if there is any prospect at all that the person might still be alive.  Jesus was dead!\n\n","date":"August 29, 2015 at 11:44 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209285","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"John in his gospel does not say which side the wound in the chest was. it was only later convention that established it on the right side ( e.g. Rabula Gospels, c. 585, often said to be the earliest representation). This can be used either way by authenticists and non-authenticists- the wound in the right represented some earlier tradition, or the artist of the Shroud was purely following convention by showing the negative image of the wound on the left side of the man on the Shroud.\n\n","date":"August 31, 2015 at 1:16 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209377","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"This reminds me of a book I read in the 60’s, the “Pastover Plot.” Oh, and there were other books I read in the 60’s which claimed Jesus was a spaceman. I guess we’ll go there next.\n\n","date":"August 30, 2015 at 8:12 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209303","author":"John Green","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Is there any evidence that the “percussio” was a recognised method of assuring death in crucifixion victims? Or that it was taught in Roman military academies? I can’t find anything so specific among the classical references at perseus.tufts, but it may be mentioned elsewhere.\n\n","date":"August 30, 2015 at 8:59 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209304","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"The Galatians were defeated by the Attalids of Pergamum, and Pergamum was not incorporated into the Roman empire until 133 BC, so no need to look at Roman sources for wounds on the Dying Gaul. There is no reason to suspect was anything but a wound received in battle.\n\n","date":"August 30, 2015 at 11:06 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209310","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Curiously it is the only wound apparent on the statue, and from the disposition of the figure, it is easily surmised that it was considered to be a fatal blow, rather than a mere incidental battle wound.  Apparently Polybius wrote an evocative account of Galatian tactics against a Roman army at the Battle of Telamon of 225 BC.  It would seem that knowledge of the blow was not necessarily confined to the Roman army, but was more widely known among general military circles.\n\n","date":"August 30, 2015 at 2:58 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209314","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"This is an Hellenistic statue and you need to consider it within the particular tradition.  The Romans developed an obsession with Greek statuary and copied the famous ones as they did here. No need to try and develop a link in any way to the Shroud.\n\n","date":"August 31, 2015 at 2:30 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209342","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Barbet discusses the percussio on pp.51 & 52 of his text.  He cites ‘Digest’ a compendium of ancient Roman laws, “The bodies of those condemned to death shall not be refused to their relations (etc)”;  Quintilian of 1st century, “Percussos sepelevi carnifex non vetat”;  Origen, “percussio sub alas”;  Sextus Empericus of the 3rd c. “… the wound in the heart is the cause of death”; discusses ‘blow at the heart … from right side of chest … was certainly studied and well-known … in the fencing schools of the Roman armies’; Etc.\n\n","date":"August 30, 2015 at 3:50 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209320","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Thanks, daveb. I think Barbet is more confident about his conclusions regarding Roman military training than his rather disparate quotations justify, but they are not\nunreasonable. \nQuinitilian’s remark is an aside in a story about the ruthlessness of pirates, Sextus Empiricus, in his “Against Logicians” was merely giving an example of logic (If you stab a man in the heart – he will die”), and all three quotations from Caesar (and there are several others) refer to the undefended side of a military formation, which was often the right side, as soldiers carried their shields on their left, but does not necessarily define it.\nIt certainly makes sense that soldiers were taught how to attack the undefended side of an enemy, but Barbet’s “must have become classical and have been taught in the fencing-schools of the Roman armies” is not directly attested for anywhere.\n\n","date":"August 31, 2015 at 2:36 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209343","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I get the impression that Barbet had access to scholarly reports that might not now be generally available or in print.  His chapter 2 on archaeology aspects, for example, refers to his indebtedness to a Jesuit scholar Fr Holzmeister who had published a study on the subject of crucifixion in Verbum Dei (review of the Pontifical Biblical Institute) in 1934.  Likely  he also had access to other concurrent sources as well, and he himself was no mean classics scholar.  His extremely detailed commentary on the chest wound pp 129-139 etc, suggest to me that it would take some skill and accuracy to direct the spear to pierce the right auricle, the mortal target, and if it were misjudged, the thrust might be unsuccessful.  However it is clearly a skill that could be taught with proper training, and his assertion that it would be so taught does not seem unreasonable.  I do think it curious that the very same wound also appears on the Dying Gaul statue, and seems consistent with Barbet’s description, notwithstanding Charles’ dismissal of the idea.  Ian Wilson first mentioned it, and for all I know perhaps that might be a problem for Charles.\n\n","date":"August 31, 2015 at 5:24 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209349","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I am simply making the point that the Dying Gaul is a pre- Roman Hellenistic statue that was copied by the Romans.\nJohn’s account of the lance was widely represented in art from the sixth century onwards- the gospel was obviously the source for this.\nNothing to do with Wilson, whose knowledge of the ancient /Byzantine world is very sketchy.\n\n","date":"August 31, 2015 at 1:52 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209378","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Yes, I think that’s more or less fair enough. On a broader note, it is almost impossible for a right handed man (particularly if he is holding a shield in his left) to inflict a stab wound to the heart on the right side of an opponent facing him. A cut across the ribs, possibly; a thrust, no, although I have seen a reconstructed sword Roman sword drill which included a diagonal thrust out to the right, stabbing an enemy who was actually fighting the man standing next to you. I suspect that the wound on the Dying Gaul had more to do with the orientation of the body and his position in the place where it was to be displayed than any military considerations. Of course that wouldn’t apply to a soldier with a lance and a crucifixion victim.\n\n","date":"August 31, 2015 at 6:30 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209351","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"The discussion is off the track because the post is about a provocative email that Dan received and leading to a comment that refers to a website, that has no scholarly content.\nJohn Klotz and David Goulet have expressed their opinions.\nWould Hugh Farey and daveb please comment? I will wait till the end of the day.\n\n","date":"August 31, 2015 at 8:11 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209354","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"“I will wait till the end of the day.” Indeed? And then what? It’s irresistible. I shall have withhold comment to find out…\n\n","date":"August 31, 2015 at 8:39 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209358","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I will wait till the end of the day because of daveb, who is in Wellington, NZ. I can see that you unfortunately have no courage to comment, although you are editor of the BSTS newsletter. What I have seen here is some people quietly waiting for the dust raised by the provocative email and comment to settle and then post cooments that have gone off the track.\n..\n\n","date":"August 31, 2015 at 9:08 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209361","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"What piffle, Louis.\n\n","date":"August 31, 2015 at 11:02 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209368","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Ron, in all of your research, did you ever consider that a sick, bleeding Jesus asking for something to eat wouldn’t inspire belief in a resurrection? The disciples would have tried to get a doctor for Jesus, they wouldn’t have proclaimed Him risen from the dead. Unless, in your research, you also found evidence of magical healing potions that can restore good health to a man who was beaten to a bloody pulp, had nails hammered into His hands and feet, and received a spear wound in His side.\n\n","date":"August 31, 2015 at 11:06 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209369","author":"Larry","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hi Dan\nPercussio and Barbet will not soften the approach of those at the other end. They have drawn attention to a website that contains no scholarly material, is purely agenda-driven, and unable to tackle my refutation, the link to which is given above, on this thread.\n\n","date":"August 31, 2015 at 11:28 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209371","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"If nothing else, I feel Ron has brought to the surface an underlying motivation for the ‘Jesus in Kashmir’ theory: it eliminates all traces of European culture from the Christian story. There is, not without warrant, a deep resentment in Asia, Africa, the Americas of European empire making which so often was hand-in-hand with the Church. Certainly there’s a huge disconnect between the message and life of Jesus and the impact so-called Christian nations have left on the Earth. Gandhi said it well, “‘I like your Christ, I do not like your Christians. Your Christians are so unlike your Christ.’\nBy finding alternative narratives for Jesus, those with an axe to grind against European Christianity can lay claim to Jesus as their founder too. They can boast that the Jesus they follow is unsullied by Western thought.\nIt is unfortunate that non-Europeans feel this aversion to European Christianity, but given the history of the Holy Roman Empire and beyond, I can sympathize with the sentiment.\n\n","date":"August 31, 2015 at 12:06 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209372","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Interesting insight David. It makes the emergence of Pope Francis and his intent to designate third world Cardinals all the more important.\nOne thing I have learned from this thread is the importance using “Jesus” instead of “Christ” when engaging in cross-culture colloquies.\n\n","date":"August 31, 2015 at 1:08 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209376","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I consider that the discussion above on the percussio is indeed relevant to the posting, and also the email to Dan submitted by Ronald.  As I understand, it is an Islamic belief that Jesus survived his crucifixion.  The arguments against this include the gospel accounts “that he gave up the ghost” i.e. that he died, specifically the percussio blow would ensure death as discussed at length by Barbet, the evidence of the chest wound and the blood & serum stains from the chest wound evident on the Shroud cloth, the recorded astonishment of the witnesses afterwards at his resurrection, and the opinion of very many pathologists who have examined the Shroud cloth. \nDavid Goulet has pointed to a likely explanation for the belief, and it seems corroborated by a reading of the Ronald email.  There we read more of motivation rather than any logical argument.  The adaptation of religious beliefs to suit the local culture has always been practised from time immemorial.  Thus late Judaism was clearly influenced by the cultures they came in contact with, whether it was from Babylon during the exile, Zoroastrianism from Persian influences, observation of Egyptian funerary practices in Alexandria, or the adaptation of Greek Platonism.  \nIt was evident in the founding of Mormonism, and it can be seen in later Pacific cultures, specifically in NZ, with the founding of the Ringatu and Ratana indigenous religions. \nThe interaction of early missionaries with local cultures has often not been a happy one.  They have too often neglected the advice of that arch-missionary to the east, St Francis Xavier.  The following extract on St Francis Xavier, seems apt: \n“Twentieth-century scholarship has dispelled many of the legends connected with Xavier and has also defended him against his critics. A modern estimate puts the figure of those baptized by him at about 30,000, as opposed to the 1,000,000 asserted by Baroque exaggeration. In reality he had to struggle with language wherever he worked and did not possess the gift of tongues attributed to him. He is justly credited for his idea that the missionary must adapt to the customs and language of the people he evangelizes, and for his advocation of an educated native clergy—initiatives not always followed by his successors.”\n“Research has shown that he always provided for the continuing pastoral care of the communities he founded and did not abandon them after Baptism as some critics maintained. In fact, many of his own efforts were spent instructing those baptized hastily by others. The areas he evangelized in India have remained Catholic to the present day. Vigorous and prolonged persecution in the 17th century did destroy the missions he founded in the Moluccas and Japan but only after thousands had died as martyrs. Even before his death Francis Xavier was considered a saint, and he has been formally venerated as such by the Catholic Church since 1622. In 1927 he was named patron of all missions.”  Rev Robert L Birely SJ.\n\n","date":"August 31, 2015 at 3:58 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209385","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Essentially what seems to happen is that the subject culture, being exploited by colonizers, and even venal missionaries, rejects what it sees as the trappings of the imported religion, more so particularly if these have a colonizing aspect, attempts to accept what it sees as the core message, and then creates its own set of myths and legends to create their own version of the new religion.  This seems to have happened with the Ahmadiyya sect, asserting that Jesus was buried in Kashmir.  Possibly a reaction against the excesses of the earlier British Raj might have been a factor in creating these mythologies.  However, unlike very many religious movements, Christianity is founded less on a set of myths and legends, and is in fact rooted in real historic events, the life, death and resurrection of Yoshua bar Joseph of Nazareth in 1st century Palestine, of which there is ample historic evidence.  There is no historic evidence that he was ever in Kashmir, but only myths, legends and subjective interpretations created by local peoples as their way of importing into their culture what they saw as the teaching of a particularly gifted prophet.\n\n","date":"August 31, 2015 at 6:57 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209393","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I have to reiterate that to have brought both percussio and Barbet into the discussion was a waste of time and took the discussion off the track. It will not convince anyone at the other end that Jesus was buried in Kashmir, despite my article, the link to which is above, on this thread.\nThe centuries that followed Christianity were marked by gnosticism and an obsession with monotheism. We see the results today with non-Christian scholars challenging the beliefs of the “Abrahamic faiths”, insisting that new discoveries in science demonstrate that they are wrong. In fact, this began in the eighteenth century, when Sir Francis Younghusband was told by Hindu scholars that the Genesis creation account did not correspond to reality.\nFreud only concentrated on the Bible’s monotheism in his book “Moses and Monotheism”, and did not take other cultures into account:\n   https://www.academia.edu/15308857/Freuds_incomplete_speculation_on_monotheism\nC.G.Jung went much further, although he was baffled in India when he found that good and evil could exist together with no problems.\nIt is important to remember that in the next few decades there will have to be a science-theology dialogue where “what kind of monotheism is there” will have to be discussed.\nIt is wrong to think that racism only existed in some cultures. The Muslim arabs imported black slaves from Zanzibar and the Portuguese are said to have learnt from them. Racism is is there in Israel,in India (with the caste system) and in other cultures and among people of all religions. “The lighter the colour of your skin, the better” is something one sees in all cultures.\nThe British may have been brutal in India at times, but that did not prevent M.Gandhi from being “obsessed” with Christ, to the extent of being accused of being a Christian secretly. He was so influenced by the Sermon on the Mount, that it became the basis of his “Ahimsa” (non-violent resistance), that ultimately led to the country’s independence. Christ is generally recognised as avatar, incarnation of God, by the Hindus. They did not mix things up, rejecting Christ because of occasional British brutality.\nThe Jesus in Kashmir story has nothing to do with colonialism, slavery and so on, it is based on religious belief.\n\n","date":"August 31, 2015 at 7:32 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209396","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"But Louis you act like religious belief springs from a vacuum. Even the belief of the first believers in Jesus, in Judea, was formed by their experience of Roman colonialism. Your comment about Gandhi proves my point. There is an internal yearning for what Jesus of Nazareth is offering us, but too often it comes packaged by those who have expropriated it for their own ends.\nTruth is, we do not know how and why exactly the Jesus in Kashmir myth took root. A host of variables were likely in play. To dismiss the cultural context of the time seems rather short-sighted.\n\n","date":"August 31, 2015 at 8:16 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209399","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"David, I’ll get back to you tomorrow.\n\n","date":"August 31, 2015 at 8:40 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209400","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"David, further to the comment directed to you, which you will find below, let me say something about the internal yearning you mentioned in your comment.\nYou see it in one of the twentieth century’s greatest philosophers:\nhttps://www.academia.edu/6085481/Why_was_Wittgensteins_burial_attended_by_a_religious_ceremony\nas well as in biblical scholars:\nhttps://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\nIn the second case it did not come packaged as wanted and what others saw as distortions had to be eliminated.\n\n","date":"September 1, 2015 at 12:53 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209437","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"David, generally no religious belief springs from a vacuum, but the revelation of Christ does. The Why will be explained in an article I will write in the future.\nDidn’t you read my article “The Quest for Jesus in Shroud research”, the link to which is given above? The Kashmir tomb myth derives from religious belief, culture is only in the background.\nThe three “Abrahamic faiths” were involved in a dispute about who offered the true revelation, and therefore what monotheism meant. That led to an obsession with monotheism, seen in many circles today.\nAs I said, Freud, taking the lead from Breasted and Karl Abraham, dismissed Moses as an Egyptian and hurled insults at the deity described in the Old Testament. He only went upto a certain point because of the culture from where he came:       https://www.academia.edu/15308857/Freuds_incomplete_speculation_on_monotheism\nThe real threat comes from modern science and that is what those who are obsessed with monotheism, in its traditional form, will have to tackle.\n\n","date":"September 1, 2015 at 11:31 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209433","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Louis,\nThat is a fascinating article and I am in awe of the scope of your intellectual inquiries. Of course, neither you or I write errantantly. \nAs important as Freud was, he is but a footnote in the march of philosophy and science when compared to Teilhard.\n\n","date":"September 1, 2015 at 11:55 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209434","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Typo errantly = inerrantly\n\n","date":"September 1, 2015 at 11:56 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209435","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hi John\nThanks for the kind remarks. Hereditary dispositions as well as experiences in life led me to question almost everything under the sun, that is why I was said to be a “philosopher” even in school!\nThere is no way to disagree with you that Teilhard was superior to Freud in many ways, but there are problems to be tackled and some “fine tuning” will be necessary, taking both biology and physics into account. Stephen Jay Gould knew about that, and therefore proposed his NOMA:    https://www.academia.edu/14727603/Why_Stephen_Jay_Gould_proposed_the_principle_of_Non-overlapping_Magisteria\n\n","date":"September 1, 2015 at 12:44 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209436","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Typo, in the first paragraph I meant convince anyone  “that Jesus was not buried in Kasmir”.\n\n","date":"August 31, 2015 at 7:35 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209397","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I beg to disagree with Louis that a discussion about the bloodstains on the Shroud is “a waste of time” and takes “the discussion off the track.” As far as I’m concerned, the relevance of Ron Chism’s posts to this bog is entirely to do with whether the Shroud shows a man living or dead, and the bloodflow from the chest is central to that discussion. Louis’ ridiculous comment “I can see that you unfortunately have no courage to comment, although you are editor of the BSTS newsletter” is a feeble attempt to goad me into a discussion about Kashmir, which is nothing to do with the Shroud, or the BSTS, and hasn’t worked.\nRon Chism’s website has a section entitled “Did Jesus survive the Cricifixion?” and lists 8 pieces of evidence, some of which have sindonological relevance. Readers are invited by Ron (“recommended” in fact) “to examine each of these in more detail.” \nPoints 1, 2 and 3 are biblical, and do not elucidate the Shroud. \nPoint 4 assumes that crucifixion invariably lasted days rather than hours. Such meagre contemporary evidence that we have cannot justify the word ‘invariably’. If the bible is to be believed, in this particular place at this particular time, crucifixion victims were not left alive over the sabbath anyway, even if they could have lasted much longer, but were definitively killed off by crurifragium or percussio. \nPoint 5 claims that while the crurifragium invariably lead to death, the percussio might leave a victim alive. This is where the Shroud (assuming that it is genuine) may be evidence. For a start it seems that if there were any doubt about whether the victim was alive, the crurifragium was used, so the Roman guards were satisfied that Jesus was indeed dead before they lanced him, and secondly, the wound as it appears on the Shroud appears approximately as wide as the width of a Roman lance, implying more than a surface scratch. Some scholars have suggested that as percutio can refer to being stung by an insect or snake, that perhaps the Roman guard was part of a plot to keep Jesus alive and only scratched him. This is not borne out by the blood image on the Shroud.\nPoint 6 looks at the “blood and water.” This has been interpreted in all sorts of ways. It has been the opinion of some pathologists that a living man stabbed in that manner would have produced copious amounts of blood and pleural fluid, squirting out and spattering both body and any adjacent material until he was dead. A dead man would simply leak the liquid contents of the heart and lungs above the wound. Assuming this is true, then the Shroud supports the second version. Other pathologists claim that only a beating heart could have produced the amount of blood blood flow as seen on the Shroud, including not only the chest wound but the streams across the back, and probably including a lot of other blood which did not mark the Shroud, either because it missed or because it was washed off, so that what remains is the result of the rather feeble heartbeat of a man close to death, but revivable. These pathologists claim that the blood of a dead man becomes too viscous to flow at all within a short time of death, and could not have oozed as claimed by the former group.\nAs far as I know, pathologists of both kinds have been or are very rarely challenged about their opinions, or engaged in discussion. I would be a very good thing if they were. Sadly, the most quoted ones of the past – Barbet, Bucklin, Zugibe, etc. – have passed, and there don’t seem to any sufficiently bold today to have their ideas compared to those of the opposite persuasion. From ‘the man in the street”s point of view, this must remain a matter of opinion rather than fact.\nPoint 7 says that Jesus’ body was looked after by Joseph of Arimathea and Nicodemus. This certainly seems a mark of considerable respect, but does not necessarily imply that Jesus was alive or dead.\nPoint 8 considers the “hundred pounds” of myrrh and aloes. There is, I think, no doubt that these were used extensively in medicine (for alive people), and no doubt that the Jews, then as now, did not embalm their dead. If Jesus were alive, and his accomplices knew it, then myrrh and aloes would have been helpful in aiding recovery – although the wrapping over the head with a shroud seems a little odd in these circumstances. On the other hand, if Jesus was dead, then a hurried attempt to preserve the body until it could be properly attended to after the sabbath could also explain the myrrh and aloes adequately.\nI think in general that early Christianity rested on the “fact” of the Resurrection, in whatever form it took, and that therefore something occurred after the crucifixion of Jesus that must be able to be thought of as a Resurrection. A story put about by Peter, John or Mary Magdalen, or invented by St Paul does not seem an adequate explanation for this “fact,” nor a man who seems to have simply recovered after being crucified, but what, exactly, constituted it is currently further than most theologians, let alone historians, and certainly not me, are prepared to speculate.\n\n","date":"September 1, 2015 at 4:10 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209414","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hugh,\nExcellent post in many respects. It all comes down in my opinion, to the carbon dating. Without the carbon dating I submit the evidence for authenticity far out weighs the claims of inauthenticity,\nThe carbon dating fails for a number of reasons. First its accuracy is over sold to begin with and second, and more importantly, was the abandonment of the protocols which had been the subject of discussion for several years before 1988. That responsibility lies ultimately with [St.] Pope John Paul II. \nWithout acceptable protocols ANY scientific test is garbage. I have conducted an informal poll of a few individuals with experience in scientific testing. Simple question; have you ever applied for a grant without approved protocols. The answer is no. Can’t happen.\nThe skeptics who claim intellectual superiority are either benignly or malevolently accepting of the flawed carbon testing. \nAs far as the physical reality of the Resurrection, if it began with the physical body it could have left physical traces. It fact it did. They are in the Shroud of Turin.\n\n","date":"September 1, 2015 at 5:32 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209418","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hugh says that a discussion about Kashmir has nothing to do with the Shroud and the BSTS and that I am being ridiculous.  Whoever is interested can read:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nand judge whether what he says is correct. If Kashmir (the tomb) and the BSTS have nothing to do with the Shroud, why was he, the editor of the BSTS newsletter, and a couple of other “Shroudies” invited to the convention in Hampshire? It doesn’t appear that it was just to taste some nice curry or tandoori chicken when food was served.\nHe also advises us to look at a website. It contains little material that is useful and most of the sources cited are spurious.\n\n","date":"September 1, 2015 at 1:38 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209438","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hugh will repeat what he said, in case anybody thinks Louis’ remarks accurately represent him. The Ahmadiyya belief that Jesus did not die on the cross is intimately connected with the Shroud, which could, if authentic, shed some light on the controversy. What it cannot help with is any of Jesus’s alleged further peregrinations, or whether the temple in Shrinagar is really Jesus’s tomb. A discussion about Kashmir is nothing to do with the Shroud. Where Louis was being ridiculous was in his suggestion that I might be too scared to comment on Ron Chism’s  remarks. That’s ridiculous. Why was I invited to the Jalsa? Well it was nothing to do with Kashmir. Is Louis’ paper at all relevant? The first half is devoted to refuting the idea that Jesus went to Kashmir – and has nothing to do with the Shroud. The second half is devoted to the authentication of the Shroud – and has nothing to do with Kashmir. QED.\nAnd I do not advise you to look at a website. Ron Chism advises you to look at his website. I was challenged to comment on Ron Chism’s advice by Louis – who then said I lacked the courage to do so, and now condemns me for finally being brave enough to accept his challenge. Frankly, Louis, you’ve twisted yourself into knots here. I would give it a rest if I were you.\n\n","date":"September 1, 2015 at 3:54 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209443","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I would go slow if I were you, Hugh. Did you read the title of the article? It doesn’t seem so,in fact you didn’t read the article itself carefully as you should have done. You wrote:\n——————\n“The first half is devoted to refuting the idea that Jesus went to Kashmir – and has nothing to do with the Shroud.”\n——————\nReally? Didn’t you read about the footprints and how a link with the Turin Shroud is claimed?\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nThe Rozabal tomb is exactly that, a tomb, in fact there are two tombs there, and not a temple. It is a Muslim shrine, that is, a shrine of mainstream Islam.\nPlease don’t twist my words and then conveniently ask to lay the matter to rest.\n————————————\nThis is what I wrote above:\n“Hugh says that a discussion about Kashmir has nothing to do with the Shroud and the BSTS and that I am being ridiculous. Whoever is interested can read:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nand judge whether what he says is correct. If Kashmir (the tomb) and the BSTS have nothing to do with the Shroud, why was he, the editor of the BSTS newsletter, and a couple of other “Shroudies” invited to the convention in Hampshire? It doesn’t appear that it was just to taste some nice curry or tandoori chicken when food was served.\nHe also advises us to look at a website. It contains little material that is useful and most of the sources cited are spurious.”\n—————————————–\nWhere did you read here that I asked you to comment on someone else’s remarks or said that you were scared to comment? I request you to check the sources in the website and then tell me which one is trustworthy.\nAnd… don’t forget Jalsa had one neat package to present, it was three-in-one; The Turin Shroud, the interpretation of Mark Guscin’s work to claim that it demonstrates that the Oviedo Sudarium was used on Jesus, who had survived the crucifixion, and lastly, the theory of “Jesus in India”.\n\n","date":"September 1, 2015 at 4:52 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209448","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Q. “Where did you read here that I asked you to comment on someone else’s remarks or said that you were scared to comment?” (Louis, 4:52, 1 Sept)\nA. “The discussion is […] about a provocative email […] leading to a comment that refers to a website. […]\nJohn Klotz and David Goulet have expressed their opinions. Would Hugh Farey and daveb please comment?” (Louis, 8:11, 31 Aug)\n“I can see that you unfortunately have no courage to comment, although you are editor of the BSTS newsletter.” (Louis, 9:08, 31 Aug)\nForgive me if I have misunderstood you, Louis, but it seems clear enough here. If you meant something else, then what, precisely, were you so keen for me to comment on that a delay of 12 hours implied that I lacked the courage to face? Does it have anything to do with the Shroud?\n\n","date":"September 2, 2015 at 2:31 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209462","author":"Hugh Farey","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hugh,it has everything to do with the Shroud, as you can see in our exchanges on this thread.\nWhat I object to is your directing us to a website with sources that are not exactly reliable, being thoroughly agenda-driven, not scholarly.\nDo some research if you have the time and get back to me.\n\n","date":"September 2, 2015 at 10:57 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209484","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I am a Catholic, a believer, but always questioning matters of faith and shroud…\nSometimes, during crises of faith, I’ve tried to find ways of rationally debunking the resurrection, but I always feel the arguments ‘against’ always come out weaker than the arguments ‘for’….and I’ve always found NT Wright’s arguments very compelling…of course those who dispel any notion of a spiritual world will always find the arguments ‘against’ the resurrection stronger than those ‘for’. It’s a ‘no brainer’ for them!\n\n","date":"September 1, 2015 at 4:31 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209416","author":"Thomas","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hello Thomas\nI was supposed to respond to your query about Epiphanius. In the letter to the bishop of Jerusalem he talks about a curtain on which there was an image of Jesus, but it is not our Turin Shroud.\n\n","date":"September 1, 2015 at 11:11 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209432","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Thanks Louis. How do we know it’s not a reference to the Shroud? I think it probably isn’t but can we be sure? What is the latin word used for ‘curtain’? Is it a straight ‘curtain’ or is there potential double meaning as there so often seemed to be?\n\n","date":"September 1, 2015 at 3:58 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209444","author":"Thomas","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Good question, Thomas. I will do more research and get back to you.\n\n","date":"September 1, 2015 at 4:08 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209447","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"John, if you take the carbon dating out,you still do not have scientific evidence of an earlier date, certainly not the first century. It just leaves a blank.\nMy approach is that you must start with establishing the date of the weave as without the weave you cannot have any images.\nEver since Raes left the date open in 1973-6,(‘the type of weave [of the Shroud] is not particularly distinctive and does not enable us to determine the period in which it was produced’.) there has been a mass of new work on ancient weaves -see the enormous compilation of recent evidence in Textiles and Textile Production in Europe, from Prehistory to AD 400, ed. M.Gleba and U. Mannering, Oxbow Books, 2012. Nothing shows anything  like a cloth with the dimensions and three-in-one herringbone weave of the Shroud. See also Orit Shamir’s study of Palestinian weaves where he can find nothing matching the Shroud.\nYet we do have medieval examples of this weave and this dimension of cloth.\nBalance of proof???\n\n","date":"September 1, 2015 at 5:44 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209419","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Charles,\nI don’t know whether you’ve read my book but I discuss carbon dating in three Chapters. However, since publication of my book there was additional matters posted by Pam Moon. Also, Ray Rogers whose book on the Shroud was published after his death found physical evidence that took the Shroud out of medieval Europe and into the Mideast omg before 1355.. I am not going to regurgitate all of that on this post because I don’t think you’ve read Rogers book. When you have, get back to us.\n\n","date":"September 1, 2015 at 5:53 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209420","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Sorry, John, I am too busy following the latest works on weaves and painted linens, especially Passion iconography, they seem to hold the key to the Shroud- but please let me know when Rogers’ work has been replicated by a specialist in these areas.\n\n","date":"September 1, 2015 at 2:01 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209439","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"You confirm my suspicion that you are only interested in artistic tomes that support with your predisposition. You are the parable of the blind men and the elephant personified.\n\n","date":"September 1, 2015 at 2:09 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209440","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"John- the weave is not primarily an artistic issue- you cannot begin to think about the images until you have defined the nature of the cloth on which they rest. We have had a vast amount of new research on weaves in the last forty years and obviously any serious scholar is going to research these to relate them to the weave on the Shroud. The problem here is the complete lack of any evidence to support a pre-medieval weave in the Shroud.\nThe problem rests with those who claim that it is first century. Until I have found a weave in linen that supports an earlier date I am sticking with the medieval period.\n\n","date":"September 2, 2015 at 12:53 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209461","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"What are these latest works please Charles? Keen to read them if you can provide references.\n\n","date":"September 2, 2015 at 3:15 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209464","author":"Thomas","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Would be keen to read those ‘latest works’. Or are they works in progress by the usual unnamed mysterious academics?\n\n","date":"September 2, 2015 at 3:58 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209497","author":"Thomas","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Thomas, you need to start with the Cambridge History of Western Textiles and acquaint yourself with the different kinds of looms, notably those used in the ancient world and the revolution of the medieval treadle loom.\nOnce you have faced the challenge of findinG a loom from the ancient world that was able to weave a cloth of over four metres ,you need to look at weave patterns. I have given a reference already above to an authoritative volume that deals with recent work on textile fragments up to Ad400. And there si the latest work on Palestinian textiles that I have also referenced above and which was actually publicised on this site.\nThe difficulty I in all these authoritative works is finding any combination of weave and loom from the ancient world, that matches the Shroud. For the medieval period we have no problem with length on a treadle loom and we know of a similar three-in-one herringbone weave in linen.\nThis is why Imgo for a medieval,origin of the Shroud. Over to anyone to find an equivalent form the ancient world!)\n\n","date":"September 2, 2015 at 4:58 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209498","author":"Charles Freeman","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Wiki has a very comprehensive article on the claim of the Roza Bal shrine containing the tomb of Jesus, including references to reviews by various heavy-weights.  In 2004 BBC Four produced a documentary “Did Jesus Die?”,  narrated by Bernard Hill and features Elaine Pagels, Peter Stanford, John Dominic Crossan, Paula Fredriksen, Father Jerome Murphy-O’Connor, Tom Wright, Thierry LaCombe (French Knights Templar conspiracy theorist), Richard Andrews, James Tabor, Steve Mason, and Ahmadi editor Abdul Aziz Kashmiri.  \nhttps://en.wikipedia.org/wiki/Roza_Bal  \nThe web-site would seem to have everything there that anyone would want to know in dispelling the claim, including some hoax material.  Originally a center of Buddhism, Hinduism, and Shaivism for a thousand years before Islam.  As well as Youza Asouf being presumed as a transliteration of “Jesus the Gatherer”, it has also been taken to refer to Gautama Buddha, but then I’m no expert in eastern languages.    \nA footnote at the end of the article may be enlightening or not:  “More recently the tomb at Roza Bal began to gain popularity among western tourists as the possible tomb of Jesus.  According to a 2010 BBC correspondent report, the old story may have been recently promoted by local shopkeepers who “thought it would be good for business”, and its inclusion in the Lonely Planet travel guide to India helped drive the tourist business.”  Sound familiar?\n\n","date":"September 1, 2015 at 9:42 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209458","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"The (Western) heavyweights are in the field of biblical studies, they have contributed nothing when it comes to outlandish theories like the one about Rozabal. My article is based on first-hand knowledge:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nYuz Asaf is considered to have been a Sufi mystic by the Muslim caretakers of the tomb, who dismiss the claim that Jesus is buried there, as maintained in my article. The success of the site has something to do with tourism.\nIt is absurd to think that the tomb was originally a temple. India is not Monaco, it is much bigger and no Muslim would ever build a tomb on a Hindu temple.\n\n","date":"September 2, 2015 at 10:48 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209483","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"From the Roza Bel web-site, I don’t see that any Muslim would have built the tomb.  Its history suggests it may have been built by either Buddhists, Hindus or Shaivists.  It would seem credible that some foreign holy man might have been buried there.  It seems to have suited the founder of the Amidiyya sect to claim that it was Jesus by a transliteration of the name Youza Asouf.  Whoever he was, he now seems to be quite unknown, hence the propagation of legendary accounts.  I see it as a typical piece of legendary syncretism, the sort of thing that frequently happens with founders of new religious sects.\n\n","date":"September 3, 2015 at 3:46 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209521","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Naturally the site would never say that a Muslim had built the tomb and it is absurd to suggest that Buddhists and Hindus, who were in Kashmir before Islam reached the region, would have built it. They do not bury their dead, they cremate them:\nThe whole story is here:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nIt seems that there are people who do not realise that the concept of monotheism in the Bible is being interpreted in a different light by university professors in Europe. A problem has even been detected in literature:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\nI will be explaining this further shortly.\n\n","date":"September 3, 2015 at 5:56 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209549","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Re Roza Bal shrine: \nThere is no record of the shrine during Kashmir’s Buddhist period, nor during the Kashmir Sultanate (1346–1586) when many Buddhist temples were converted into mosques, such as the Shankaracharya Temple or “Throne of Solomon”. \nThe shrine is first mentioned in the Waqi’at-i-Kashmir (Story of Kashmir, published 1747), also known as the Tarikh Azami (History by Azam)[13] by the Khwaja Muhammad Azam Didamari, a local Srinagar Sufi writer. Muhammed Azam states that the tomb is of a foreign prophet and prince, Yuzasuf, or in modern local Kashimiri transcription Youza Asouph.  \nA notable court case was brought mentioning the shrine in 1184AH/1770AD.  The full decision can be read at the URL given above, but of significance would seem to be the finding that the holy man Yuzasuf came to the valley during the reign of Raja Gopadatta, which would seem to be about 1000 years too late for it to have been Jesus late of Nazareth.\n\n","date":"September 4, 2015 at 4:26 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209570","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"It is amazing that what began as a rather supercilious post “Oy Veh” has resulted in a treasure trove of information from David, Louis and others. I have learned more about Jesus in Kashmir than I ever thought I needed to know – and did need to know.\n\n","date":"September 4, 2015 at 5:41 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209572","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Good morning, John\nThere is no “Jesus in Kashmir”, and the “Jesus in India”, actually the “Christ in India” reached the minds of two Hindu greats, Swami Vivekananda, the founder of modern Hinduism and Mahatma Gandhi, the father of Indian independence,both of whom did not believe in the Kashmir tomb:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nThis article is based on first-hand research, so there is no point in looking further. It is wasting time, something like looking for the golden tablets Joseph Smith said he found in Utah.\nWe should concentrate on “Jesus in Jerusalem”, where attempts to demonstrate that he was buried in Talpiot have failed. There will be more on this, but meanwhile:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\n\n","date":"September 4, 2015 at 7:39 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209577","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Thanks for the clarification Louis. But whether we are talking about Jesus in Kashmir or any other place on the sub-continent it’s a proverbial red herring distracting us from the tasks at hand which as you quite properly point out is dealing with the claim of Chrisit’s burial in family tomb in Israel which as been previously discussed on this blog.\n\n","date":"September 4, 2015 at 7:47 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209579","author":"John Klotz","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"You’re welcome, John.\nI think you know that my first-hand report is also based on knowledge of the customs as well as the languages.\nThere are two small things to add;\nSwami Vivekananda was so impressed with Christ that he began to translate “Imitation of Christ” into Bengali, his native language, and wrote that just one line from the Sermon on the Mount, ” Blessed are the poor in spirit..” was sufficient to show humanity the path, there was no need for any Scripture.\nThe only object hanging in Mahatma Gandhi’s living room was a crucifix and his favourite hymn was “When I survey the wondrous cross”.\nThousands of Hindus go to Catholic churches to light candles, looking for healing and curing and jobs, many Hindu temples even have images of Christ and the Virgin Mary. They are not interested in “Jesus in Kashmir” because they do not believe it.\n\n","date":"September 4, 2015 at 8:58 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209582","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Louis\nHindus and others in Eastern beliefs think highly of what Jesus said. Swami Prabhavananda wrote a book on it, “The Sermon on the Mount According to Vedanta.” Paul Brunton in his book, “The Short Path to Enlightmenment” quotes the bible often. Many ideas in the eastern beliefs are also in Christian beliefs, love, forgiveness, etc.  \nAs you know Hindus believe everyone one is part of the divine. One of the verses in the NT that always interested me is, “The kingdom of God is within you.” For the past 30 years I wondered what exactly is the writer trying to tell me. After starting to study Eastern beliefs a few years ago I believes it means we all are part of the divine. In fact for the only way the bible makes any sense to me is when I look at it with the mind of a Mystic, but that’s beyond the scope of this blog.\n\n","date":"September 4, 2015 at 10:48 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209590","author":"John Green","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hi John (Green)\nYou should read “Return to the Centre” by Dom Bede Griffiths, OSB an English monk who founded a Christian ashram in India as you will find some useful insights there. It is a short book.\nI believe that “The kingdom of God is within you” is linked to Jesus’ saying “Who do men say that I am?”. It is a highly complex topic on which I am working and will write about when there is time.\nScripture can leave people confused at times and has confounded scholars. The problem is that Freud, unlike Jung,limited his quest on account of the culture from which he came and said some very nasty things about the deity described in the Old Testament. His “Moses and monotheism” did not take cultures around the world into account:\n https://www.academia.edu/15308857/Freuds_incomplete_speculation_on_monotheism\nWe see reflections on that topic even in literature today:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\nI think you know that Einstein, who limited his scope on religious belief to Spinoza, rejected monotheism. Both science and scripture require further reflection. Otherwise there is just an existential spiritual legacy left by Jesus as a guide:\nhttps://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\n\n","date":"September 4, 2015 at 12:03 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209594","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Where is Thibault Hamburger? I am sure that Mr. Hamburger can do some experiments to test the idea that the sudject was alive.\n\n","date":"September 2, 2015 at 3:51 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209465","author":"Jerry","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"It’s Heimburger, Gerry.\n\n","date":"September 2, 2015 at 10:44 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209482","author":"David Goulet","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"The Portuguese medical practitioner Dr. Antero de Frias Moreira cleared the doubts a few days ago, on this blog. He is a very serious scholar.\n\n","date":"September 2, 2015 at 10:36 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209481","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Dear Louis\nI appreciate your kind words but I don’t consider myself «a very serious scholar»\nI’m just a humble Physical and Rehabilitation medical doctor fascinated by the Shroud who seeks to learn more and more about the Shroud and I learned a lot from your comments and from the ones of many bloggers in this wonderful website\n                                                                I thank all of you\n                                                           Antero de Frias Moreira\n\n","date":"September 4, 2015 at 10:41 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209589","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"Hello Antero\nI am judging from your comments and your blogspot. \nBest.\n\n","date":"September 4, 2015 at 11:21 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209592","author":"Louis","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"I’m late to this discussion but I would like to address Jesus’ comment that the “kingdom of God is within you.”  I’m quite sure this does not mean that we are all a little bit of God.  That desire to be God is the original sin of mankind and it keeps cropping up in various ways.  Some of my friends like the notion of being part of God because it eliminates any fear of permanent separation from God; i.e., hell.  Jesus’ teachings on this subject are quite clear: sin separates us from God and serious sin includes the risk of permanent separation in the afterlife.  Hindu and other Eastern religions do not inform our Christian truths although their effects on human behavior are worth studying and perhaps emulating in some aspects.\nIn considering the meaning of Christ’s various pronouncements it is important to remember that he was speaking on two levels: one, to his Jewish contemporaries who all expected the Messiah to establish a new kingdom and political entity on earth in cooperation with the Jews, his “chosen people.”  Noting that “the kingdom of God is within you” was telling them that he  was not here to establish an external kingdom to expel the Romans and make Israel the dominant nation of earth.  This message was slow to take root among the apostles who seemed to be in a state of constant befuddlement as to who Jesus was and what his teachings were all about despite their enthusiasm for his miracles.  They were still asking about Israel’s return to power when Jesus ascended to heaven following his crucifixion and resurrection!\nJesus’ words, of course, have a second level of meaning intended for all of us down through the ages.  In this context, the “kingdom of God is within you” refers both to our spiritual natures (souls) and the fact that our relationship with Him is primarily internal; i.e., it is the quality of our “hearts” rather than the keenness of our minds or the prowess of our bodies that determines whether we are in harmony with God and, therefore, happy.  This is not to say that external actions and events do not matter because those are the manifestation of what is in human hearts as well as opportunities to put our good hearts to work in furthering the love of God for humanity.  \nLouis calls the quotation “complex.”  I would not use that word since I think the concept is not complex.  However, there are folds of meaning in the context of both world and heaven that bear a great deal of analysis and discussion so perhaps our difference is mostly semantic.\n\n","date":"September 7, 2015 at 1:12 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209833","author":"Jim Carney","site":"shroudstory"},{"title":"Oy vey!  We’ve got a problem?","post":"You got it right, Jim. We do not know about Jesus’ relationship to the Father, that was his secret. According to Ernst Kasemann Jesus was the only manifestation of God we could have. I believe he told us not to bother much about material things, we have to seek the Kingdom of God, which involves a great internal struggle. It depends on an internal decision.\n;,\n\n","date":"September 7, 2015 at 1:44 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","id":"comment-209836","author":"Louis","site":"shroudstory"}]
