[{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"To call this  “stochastic process” a “natural stochastic process” is of course excessive. \nLook at the sentence in the introduction: “the hypothesis involving  an artistic forgery or a miraculous event must be discarded”. It is in my humble opinion far beyond what a scientist with just a possible explanation (and no definition of what a miracle is) is entitled to write.\nThis stochastic process could be a part of the answer, I really don’t know. But if we are talking of the burial cloth of Jesus, then you have a big problem with this “natural stochastic process”: you first have to assume that the tomb of Jesus wasn’t found empty… and this goes against the consensus view of New Testament scholars. \n.\n\n","date":"June 14, 2014 at 3:46 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-129340","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"It’s taken me a while to plough through this paper, but essentially it says nothing the authors haven’t said before, and it doesn’t even begin to “Explain the Coexistence of Bloodstains and an Image” which is the title of the report.\nAfter spending some 4 pages confirming to their satisfaction that there are blood images on the shroud, tossing out various derogatory remarks about scientists who don’t find their arguments as convincing as they do, it is firmly established that “the major part of the bloodstains are the result of a permanent contact between the corpse and the cloth.” The word ‘permanent’ is qualified as meaning remaining after the body had been left alone in the tomb.\nNext it is revealed that the body image is related to a very weak radiative interaction (producing a stochastic rather than a continuous discolouration pattern) whose strength is proportional to cloth-body distance.\nIt is not explained, or even understood, that ‘permanent’ contact bloodstains are found in areas of different discolouration intensity, which means areas of different cloth-body distance.\nThe authors’ conclusion: the “stochastic process is able to … resolve the apparent discrepancy that seems to exist between the formation of the bloodstains (which only happened through direct-contact transfers) and both body images (which happened through direct-contact and short distance types of transfers),” is wholly unjustified.\nThis is a major problem for a natural dead body explanation for the whole picture, and it would be a wonderful thing if anyone were to solve it convincingly. This paper doesn’t.\n\n","date":"June 14, 2014 at 4:37 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-129350","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"I had a little chuckle at the putdown of “self-styled” scientists, followed by that reference to singlet oxygen as a “free radical”. Singlet oxygen, lacking unpaired electrons, is NOT a free radical (it would not be able to survive for an hour or more under normal environmental conditions if it were). In fact it is ordinary unreactive ground state triplet oxygen that is the free radical, albeit a diradical with two unpaired electrons.  .O=O.\nPeople who live in glass houses …\n\n","date":"June 14, 2014 at 4:51 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-129352","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"An empty nutshell.\n\n","date":"June 14, 2014 at 5:06 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-129356","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"” ‘When I use a word,’ Humpty Dumpty said, in rather a scornful tone, ‘it means just what I choose it to mean — neither more nor less.’\n‘The question is,’ said Alice, ‘whether you can make words mean so many different things.’ ”\nLewis Carroll – ‘Through the Looking Glass’ \nIt is a distinct advantage when one uses technical terms or big words like “stochastic” to have some notion of their meaning first, otherwise one might be accused of Humpty-Dumpty thinking:\nCollins:  “stochastic”:\n1. (Statistics) a.(of a random variable) having a probability distribution, usually with finite variance. b.(of a process) involving a random variable the successive values of which are not independent. c.(of a matrix) square with non-negative numbers in each row that add to unity in each row.\n2. (Rare) involving conjecture\n(Etymology is C17: from the Greek referring to guessing) \nI rather suspect that the term the authors might be looking for is “discrete variable” as distinct from “continuous variable”, or do they really mean “conjecture”?\n\n","date":"June 14, 2014 at 7:16 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-129374","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"I think that’s a little unfair. A stochastic distribution is reasonably well understood, I think. Imagine watching a patio as a rainshower begins. Although overall the patio gets wetter and wetter, the initial distribution of wetness occurs as randomly spaced splashes of approximately uniform area and volume. I think the authors are discriminating between radiation which colour an an entire area uniformly – the more the radiation the deeper the colour – and weak radiation which – due to imperfections in the target – colours single fibres here and there, so that that the depth of colour depends not on the colour of any individual fibre, but on how many fibres are coloured. They seem to argue in this and other papers that while ‘background’ radiation (unexplained) is not stochastic, the body radiation (poorly explained) does have that effect. Leaving aside the scientific jargon, this is how the STURP team almost always explains the variable colour density of the Shroud, often using terms like ‘half-tone.’\n\n","date":"June 14, 2014 at 8:26 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-129393","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"In my opinion this paper needs to be read carefully.\nI do not not if the term “stochastic” is the best one.\nThe main problem comes from the fact that the surface distribution of the color in the Body image areas is not easy to describe.\nWith the help of the analogy with the effect of low doses of radiations in a large population, one can understand what the authors have in mind.\nIt is true that low doses of radiations have the properties described by the authors:\n1) There is no minimal level of radiations (except zero, which does not exist) without effect\n2) The number of tumors increases with the time/level exposition\n3) it is impossible to predict who will have a tumor in this population. \nThis is only an analogy.\nIs the TS image color distribution like a “stochastic “process ?\nIn my opinion, not exactly.\nWhy ?\nIt is true that the color distribution in a given image area depends only on the number of colored fibers having the same density (+/- 10%) and not on the density of the fibers (the half-tone effect).\nBut the colored fibers are not randomly colored.\nIn a colored thread, there are BUNDLES of colored fires adjacent to bundles of uncolored fibers     \nIf there is a stochastic process, it is at thread level and not only at fiber level.\nIn other words, a stochastic process at fiber level does not explain the fact that the colored fibers are bulked together in bundles adjacent to uncolored bundles of fibers in a given image thread.\n\n","date":"June 14, 2014 at 4:10 pm","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-129556","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"In other words it is not a stochastic process, it depends on the fibers’ surface properties.\n\n","date":"June 15, 2014 at 3:32 pm","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-129817","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"Humpty Dumpty had a great fall.\n\n","date":"June 14, 2014 at 7:59 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-129383","author":"Paulette","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"The first sentence itself says it is agenda-driven “science”.\n\n","date":"June 15, 2014 at 3:55 pm","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-129822","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"This may be a stupid question:  “Why is there not more random blood on the TS?”\n\n","date":"June 16, 2014 at 10:55 pm","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-130109","author":"clublu22014","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"Clublu: Barbet states that the vena cava would have emptied itself during the transport to the tomb and any remaining blood would have been lost if not collected. He also gives other reasons.  Some speculate that the body may have been given a cursory wash and that only the clots remained.\n\n","date":"June 17, 2014 at 12:13 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-130122","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin","post":"Or the blood / blood mix was added as an ‘artistic addition’\n\n","date":"June 17, 2014 at 2:47 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","id":"comment-130153","author":"Thomas","site":"shroudstory"}]
