[{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"Yannick,\nSuperb post and I really agree with virtually everything you said with one exception: that the image was created by a “miracle”. I believe that as our knowledge expands, that image maybe explained, perhaps by some quantum process. However, applying Occam’s Razor (or the Sherlock Holmesdisctum) it appears to me that the Resurrection is the simplest solutuon.\n\n","date":"April 21, 2012 at 10:39 am","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10667","author":"John Klotz","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"Yannick, don`t you consider a 4th option? It is the real burial shroud of Jesus Christ and a natural mechanism (Millard reaction , defended by Rogers or mercerization defended by Kohlbeck) took place in image formaton. From previous posts, I understood that you were for Roger hypothesis.\n\n","date":"April 21, 2012 at 11:37 am","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10668","author":"Gabriel","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"Bravo, Yannick!\nI subscribe to (almost) all you what say. Gabriel is right though in adding a fourth option.\nAlkaline waters (waters mixed with ashes or/and rich in limestone) soaking in the burial sheet and their water vapour concentration interacting with starch and saponaria present in ancient linen cloth could be key elements to be taken into account to solve once and for all the Shroud image formation mystery.\n\n","date":"April 21, 2012 at 1:06 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10669","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"I am thinking in terms of a yellow-coloured mordanting/oxydation of a thin layer of impurities. My theory implies elements of both Kohlbeck-Nitowski and Rogers to be combined together and others totally dismissed.\n\n","date":"April 21, 2012 at 1:19 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10670","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"Correction: “element of both Kohlbeck and Rogers to be REcombined together”\n\n","date":"April 21, 2012 at 1:25 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10671","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"I see a few problems with 1, 2 (& 4);  How does anyone remove a dead body from its burial wraps within two days of death (no corruption) without smearing or otherwise damaging (tearing?) the blood stains?  The dorsal image shows no sign of body deformation from the weight of the body (e.g. the buttocks areas), so that it seems to float above the burial slab.  Some studies maintain that the image appears to have holographic properties (light from the image diffuses in all directions) – Is this a normal property of Maillard or mercerisation reactions?  Will Maillard or mercerisation normally produce a quasi-3D image?  If the answers to these questions are in the negative, I think I’d have to vote for option 3!\n\n","date":"April 21, 2012 at 4:41 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10679","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"Hello everybody !  I’ll take your comments one by one and answer it :\n1- Quote from John Klotz : “I believe that as our knowledge expands, that image maybe explained, perhaps by some quantum process.”  \nMy answer :  I could answer this by simply saying to you :  Don’t you think a process like that wouldn’t fit into my second option as some kind of “undetermined natural phenomenon” ?  But I prefer to say this to you : We can extrapolate and speculate all we want about quantum process and things like that.  Personally, I believe what science can demonstrate !  So, until science can demonstrate that some natural “energy” like that (or some other kind of “naturally produced” energy) could have create the Shroud “naturally”, I will stay on my position and think that we are only left with 3 different possibilities and nothing else regarding the body images on the Shroud.  When it comes to think that the Shroud body images were formed by a “natural” process, in the present state of our knowledge, I just see some kind of complex chemical phenomenon(s) as a plausible answer.  I know some people have talked about a recent article in which the author state that during an earthquake, an electromagnetic energy could theoritically created some kind of an image on a linen Shroud, but personally, this seem to be so unlikely that I simply discard that possibility.\n2- Quote from Gabriel : “Yannick, don`t you consider a 4th option? It is the real burial shroud of Jesus Christ and a natural mechanism (Millard reaction , defended by Rogers or mercerization defended by Kohlbeck) took place in image formaton. From previous posts, I understood that you were for Roger hypothesis.”\nMy answer :  Read again my letter Gabriel !  I have, of course, consider that option (which I think his the best we have so far) and you can find it in my second option !!!  In fact, this second option include all the “natural” hypothesis like the one of Rogers, but also, to be honest, I left the door open to the very slim possibility that the body images on the Shroud could be those of someone else than Christ.  Effectively, if we think they were produced by some “natural” phenomenon(s), scientifically speaking, no one can be 100% sure that the corpse was the one of Jesus of Nazareth, even if a very big amount of evidence point in that direction.  Personally, because of the vast amount of evidence I just mention, of course I believe that this Shroud is the one of Jesus.  But to stay scientifically honest, I had to left the door open to the possibility that it could be the one of another crucified person…\n3- Comments by Max.\nMy answer :  Read what I said to Gabriel and my answer fits also very well with your comments Max.  Your hypothesis also fits perfectly into my second option !\n4- Comment from Daveb.\nMy answer :  I think your comment is more speculative versus the probability of each of my option to be the right one than a real questionning of the relevance of those 3 possibilities.  In that sense, I don’t have much to say.  I leave you answer which one of the 3 option is the most likely in your opinion.  Since it is your personal opinion, I don’t have much to say, except than saying that it is possible that I favored another option than yours !  But in the end, if someone favored #1, another person favored #2 (like I do) or if someone else favored #3 (like you do), it’s okay for me in the sense that everyone of those possibilities have some chances to be true, on the contrary to any scorch or rubbing hypothesis !!!   But I also want to say this :  we have to remember that, in the present state of our knowledge, it is impossible to estimate precisely what is the correct level of probability for each one of the 3 options I’ve written, so the door is open for all of them.  But I also want to say that, in my opinion, if I use the Ockham razor principle, I easily come up with #2.  But that’s just my own analysis and you can, of course, believe what you want…  As long as it is not some kind of artistic hypothesis !\n\n","date":"April 21, 2012 at 5:57 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10682","author":"Yannick Clément","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"Quote from Dan : “Yannick Clément writes at some length. Please keep in mind that English is not his first language and he goes to a lot of effort to be clear. I may not always agree with him on this or that. Nonetheless he has important things to say that warrant attention and careful consideration.”\nTHANK YOU VERY MUCH FOR THIS COMMENT.  You got the right kind of open mind to run a blog like this one.  I also want to say :  sorry for the length of many comments I’ve made.  I know that I repeat myself all the time but you get it right :  It’s just because I want people to understand perfectly what I try to say…\nHere’s a message for Dan to conclude this message :  You say that you not always agree with me on this or that.  SO WHAT ?  I think it’s perfectly normal that it is that way !  No problem at all with that.  Of course, it’s fun when someone agree with your point of view, but I always think that if someone expose his point of view with HONESTY, even if I disagree with him, I have to respect his point of view.  But, at the same time, that doesn’t mean I will not exchange with him (sometimes with passion) in order to debate our different ideas !!!  \nI think it is the correct way to act…  As long as it is done with great honesty in a constant research of the truth and not in some selfish seek of glory or things like that.  That’s what I think !\n\n","date":"April 21, 2012 at 6:05 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10683","author":"Yannick Clément","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"I would like to make a little addendum to my open letter :\nFirstly, I want to give you the complete name of the medical expert I quote at the beginning of my letter :  His full name was James Malcolm Cameron.  This man, who was a well-respected in his field, died in 2003.\nSecondly, I want to give you the title of the documentary I talk about in the intro :  it’s called “The Wonder of the Shroud” and it feature a conference done by Fr. Martin Haigh, a Dominican.  I truly recommend it to anyone interested by the Shroud, especially those of you who are already Christians, because this presentation make a very good link between the Shroud and our Christian faith !  It’s the kind of document that help to elevate the faith of someone who fight with doubt (i.e. :  every honest believer !).  And what is great is the fact that Fr. Haigh speech is in straight line with what I said in this open letter…  He too point out the fact that the Shroud cannot be a human artistic forgery and he used mainly the image itself to prove his case, which he did brilliantly !\nYou can buy this presentation in DVD here : http://www.shroudvideo.com/shroud_buy_the_video.html\nBelieve me, you won’t be disappointed ! \nAnd thirdly, because of his great contribution with the STURP team, I would like to add the name of Robert Bucklin to the list of experts I gave at the beginning of my letter which, undeniably, would agree with the statement of professor Cameron about the bloodstains.  And, of course, I could add more names to this important list of forensic experts, but I’ll stop there because I think the actual list I gave is well enough for you to understand that this statement from professor Cameron is completely true and lead to only one scientific conclusion about the Shroud :  It is not a human artistic forgery !  \nTo conclude, I want to say this : On this great scientific base, you can feel very confident by saying this FACT to all your friends and neighbor.  This is as solid as proclaiming that the earth is round !!!\nThat’s it for the addendum.\n\n","date":"April 21, 2012 at 6:17 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10686","author":"Yannick Clément","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"My favouring of Option 3 was conditional on the responses to the questions I raised, which as far as I can see have yet to be answered!  Options 1, 2 & 4 are not a matter of personal opinion.  They can only be accepted if there is satisfactory resolution to these questions, when those options can then be considered subject to further scientific enquiry.  If those questions cannot be answered, that only leaves option 3.  It is a matter of logical deduction – personal opinion doesn’t enter into it!\n\n","date":"April 21, 2012 at 8:26 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10690","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"don’t say 4 options !  I only talk about 3 !  Here it is again :\n1- It is a real burial shroud of someone who suffered the same tortures than Jesus, but who cannot be Jesus of Nazareth because a forger produces it “naturally” (without using any art technique).\n2- It is a real burial shroud of someone who suffered the same tortures than Jesus (and who can probably be Jesus of Nazareth) and was produced by some undetermined natural phenomenon(s).\n3- It is a real burial shroud of Jesus Christ and was produced by some undetermined supernatural action directly linked to his resurrection.\nAnd, as far as I know, science is not able to clearly state which one is the right one.  I’m sorry but nothing in the STURP data can permit to discard the first or the second option…  And if I listen to what Ray Rogers had to say, number 3 is HIGHLY UNLIKELY !!!\nBut I’ll say it again :  In the present state of our knowledge on the Shroud, nothing can discard one of those 3 options.  So, the door is open to personal opinions and preferences, but just remember that any of those 3 options can be considered as an accepted theory for the moment.  They are just general hypothesis and we’re still left with one big question :  \nWhen you understand that the body images on the Shroud came from a real corpse, then you ask yourself : Is it due to some natural or to some supernatural phenomenon(s) ???  More researches are needed to know the truth.\n\n","date":"April 21, 2012 at 9:05 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10691","author":"Yannick Clément","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"I want to add a comment :  There’s something that, eventualy, could discard the first and part of the second option (in the case it is the image of someone else than Christ).  It is the undisturbed aspect of the bloodstains.  In his book A doctor at calvary, Pierre Barbet talk about this very particular and unusual aspect of the bloodstains and, for him (and for me !), it is the great sign (not a proof) of the resurrection that can be found on the cloth !  For Barbet (who knew very well what he was talking about), this aspect of the bloodstains could not be explained by science (in the state of the knowledge of his time).  I don’t think anyone (whether he come from the pro or the anti-shroud side) have ever been able to offer a clear and scientifically sound explanation for the undisturbed aspect of the bloodstains.  But, at the same time, I’m not ready to discard the option #1 and #2 (if this is another person than Jesus), simply because I really don’t think that there was enough experiments done in laboratories to verify the claim of Barbet.  For the moment, I don’t think anyone can say with a 100% degree of confidence that Barbet didn’t made an error of interpretation (even if this seem highly unlikely).  I think more research should be done to fully understand all the physical effects (or absence of effect) that could happen when there’s a separation between a bloody corpse and a shroud that envelop him.  Who knows if, in a very particular scenario involving very particular conditions (for example : a very limited time of contact between the corpse and the shroud), the bloodstains could not come out just like those on the Shroud ?  So, to summarize this point, we can say that the aspect of the bloodstains seem to put the options #1 and #2 (if this is another person than Jesus) in geopardy.  If the assumption of Barbet about that can be shown experimentaly, then I think we could say that the chances for the cloth to be the real burial Shroud of Christ would be very high !  \nRegarding the question of the bloodstains on the Shroud, I’m amazed to note that there was, to my knowledge, absolutely no serious experiments done to evaluate the assumption of Barbet and evaluate if there is not a “natural” way that exist to extract a bloody corpse from a linen shroud while leaving the bloodstains undisturbed…  Would be nice if a real medical expert could investigate this particular question by making a series of test in laboratory.  If the conclusion would be that there is absolutely no way to obtain the same result that we see on the Shroud, then I think the case for a Shroud of Christ would be even better than it is right now.  Anyone interested ??? :-)\n\n","date":"April 21, 2012 at 10:23 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10693","author":"Yannick Clément","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"(Y) – “don’t say 4 options ! I only talk about 3 …”\nCheck posting #2 from Gabriel – “Yannick, don`t you consider a 4th option? It is the real burial shroud of Jesus Christ and a natural mechanism (Millard reaction , defended by Rogers or mercerization defended by Kohlbeck) took place in image formaton.” \nBarbet’s comments about undisturbed aspect of bloodstains deals with my query: “How does anyone remove a dead body from its burial wraps within two days of death (no corruption) without smearing or otherwise damaging (tearing?) the blood stains?” \nNow deal with the other queries I raised at posting #6: “The dorsal image shows no sign of body deformation ———- etc  Will Maillard or mercerisation normally produce a quasi-3D image?”  And there you have it.  Option 3 is looking highly probable!\n\n","date":"April 21, 2012 at 11:27 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10694","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Please, don’t forget the evidence of the bloodstains !!!","post":"Dave you say : “Check posting #2 from Gabriel – “Yannick, don`t you consider a 4th option? It is the real burial shroud of Jesus Christ and a natural mechanism (Millard reaction , defended by Rogers or mercerization defended by Kohlbeck) took place in image formaton.” \nCan I suggest you to read again my answer to this comment of Gabriel because I think many people have to understand perfectly what I tried to say at option #2 !!!  \nHere it is : “Read again my letter Gabriel ! I have, of course, consider that option (which I think his the best we have so far) and you can find it in my second option !!! In fact, this second option include all the “natural” hypothesis like the one of Rogers, but also, to be honest, I left the door open to the very slim possibility that the body images on the Shroud could be those of someone else than Christ. Effectively, if we think they were produced by some “natural” phenomenon(s), scientifically speaking, no one can be 100% sure that the corpse was the one of Jesus of Nazareth, even if a very big amount of evidence point in that direction. Personally, because of the vast amount of evidence I just mention, of course I believe that this Shroud is the one of Jesus. But to stay scientifically honest, I had to left the door open to the possibility that it could be the one of another crucified person…”\nI hope it’s more clear now !  In fact, I realize that I should have done 2 subcategories for my second option !  I should have wrote this :\n2A- It is a real burial shroud of someone else than Jesus who suffered the same tortures than him and was produced by some undetermined natural phenomenon(s).\n2B- It is a real burial shroud of Jesus and was produced by some undetermined natural phenomenon(s).\nThose 2 subcategories concern both some undetermined natural phenomenon(s) as the cause of the body image and that’s why I put them together in one single category in my letter.  But now, I realise that it wasn’t enough clear…  I should have wrote 4 options after all…  \nAnd personally, in face of all the STURP data, I still think (this is just my personal opinion) that if we use Ockham razor, the most likely option regarding the Shroud images should be “option 2B”.\nAnd you also said : “The dorsal image shows no sign of body deformation”  I’m sorry but that’s not exactly true.  In their great paper for STURP, Miller and Pellicori analysed the UV photos of the Shroud and conclude that the back image is generally a bit more distinct than the front image and Barrie Schwortz once confirmed to me that there is some slight signs of compressions found in the scapular region of the back.  In the UV photos paper, the 2 authors wrote that the difference between the back and the front image was much lower than they would expect, but since the body image formation is still unknown and all the conditions that prevailed inside the tomb are also unknown, I don’t think we have to go into extreme thoughts like there was a levitation of the body during the image formation !  Maybe that can be naturally explained someday.  I really think that people often make the mistake of thinking that the STURP investigation was the end of the world and that they check everything !  It’s not true at all and the best proof of that is the fact that, during the mid-80s, the STURP team planned to do a second round of direct examination of the cloth !!!  That’s the best proof that more researches need to be done before we can proclaim that science have come full circle about the Shroud !  In reality, we’re still very far from that point !  In this context, I don’t think it’s time to go into extreme hypothesis because we still don’t know if there’s not some natural explanation for the Shroud…  And if you can read the book of Rogers (it is a must read), I don’t think he reject the possibility that a Maillard reaction can create some real 3D images, in some very particular conditions.\nBut in the end, if you prefer option #3, that’s your freedom and I respect that.\n\n","date":"April 22, 2012 at 6:47 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","id":"comment-10725","author":"Yannick Clément","site":"shroudstory"}]
