[{"title":"Positive for AB is not the same as AB positive","post":"Thanks Kelly, It’s quite clear in English where adjectives are normally placed before the noun, and usually only after the noun in literary work for some effect.  I wonder how that translates into some non-English languages where adjectives normally come after the noun (eg. French, even Latin).  Any comments from our foreign language correspondents?  The adjective ‘positive’ actually refers to the ‘test result’ rather than the blood itself which may be Rh+ or Rh- as the case might be.\n\n","date":"January 8, 2013 at 3:07 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-21750","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"I was always told there was only AB, not positive or negative.  That clears it up in my mind.  Thanks Kelly.  Your expertise is highly valued by this reader.\n\n","date":"January 8, 2013 at 8:57 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-21759","author":"Andy Weiss","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"I am still trying to find out whether there is any evidence for AB before 1000 AD. So far the only case I have been offered is one very small sample from Israel from a paper in 1977 but more recent works on Jewish genetics do not seem to mention it and I have no evidence that it has been confirmed by any later testing. So as no one seems to have come up with any early AB material AS YET, I shall keep to my PRESUMPTION that an AB type suggests a date for the blood of after 1000 AD.\n\n","date":"January 10, 2013 at 6:07 am","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-21818","author":"Charles Freeman","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"It’s crystal clear that Professor Charles Freeman’s claims on the issue of Shroud’s bloodtyping AB have no other aim but trying to prove that the Shroud of Turin cannot be the one that wrapped Jesus’ body some 2000 years ago.\nWhy is that possibility discarded only on the basis of a single misleading claim and all the other aspects of the Shroud namely concerning ALL THE UNIQUE IMAGE PECULIARITIES  are simply neglected?\nAlthough he is right questioning the value of performing only serological tests, maybe in a near future there will appear DNA studies on that matter as Dr Kelly Kearse pointed out.\nNonetheless Dr. Kelly Kearse provided us one excellent posting entitled «Just how old is the AB blood type?» on this blog last October\n13 and she  also wrote a very interesting comment on ABO anthropological evolution making a rebuttal of D’Adamo’s theory.\n I guess that for the moment, what she explained it’s all we can know on this matter without speculating, and surely AB blood type existed long before Christ was born.\n                                    best regards\n                                    Maria da Gloria\n                         Centro Português de Sindonologia\n\n","date":"January 10, 2013 at 12:29 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-21845","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"The paper of 1977 used a sample of 55 corpses corresponding to a period between 1600\n and 2000 years ago, unearthed in the area of EinGedi and Jerusalem. Roughly, 51% of the samples were classified as belonging to the AB blood type.\nThis paper was peer~reviewed, and in my view, Charles is biased when he concludes that the validity of this study is doubtious on the only argument that new studies on the same subject have not been conducted since then.\nSorry to say but science does not work this way. Any result in this or other field can be refuted and in the future, perhaps this may be the case -why not?-  but currently, in science there are thousands of facts that are accepted because someone once provided solid evidences and no additional studies have been carried out in decades or even centuries.  If Charles criteria were applied to these thousands of facts and their validity rejected only because nobody has come back to it again, planes would not fly, cars would not run and fridges should be revisited in search of confirming evidences. We see these things with the supporters of inteligent design or those who deny the existance of a climate change, partially because they are based on results published perhaps years ago, no matter how solid and fully valid today they may be.\nFurthermore, after the paper I recently mentioned here regarding the evidence of mixing lineages of eastern and western origin dating back at least to the Iron Age, I think that Charles position at this point is truly weak.\n\n","date":"January 10, 2013 at 2:03 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-21851","author":"Gabriel","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"Here is a link to a recent report in Science News, which was published in Dec 12, 2012:\nhttp://www.sciencenews.org/view/generic/id/345987/description/Human_blood_types_have_deep_evolutionary_roots\nThis describes in relatively general terms the findings of a study  by Laure Seguel and Emma Thompson in Molly Prezeworski’s lab at the University of Chicago that was recently published in the Proceedings of the National Academy of Sciences.  \nThe study indicates that A,B, and O blood types in people are ancient and predate the evolution of various  primate species alive today.\nThe reference for the original study is PNAS 109: 18494-18498, 2012.\nAnother more generally written report that summarizes these findings is:\nhttp://theconversation.edu.au/as-easy-as-a-b-humans-and-other-primates-are-blood-brothers-10330\n\n","date":"January 10, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-21859","author":"Kelly Kearse","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"Maybe Charles Freeman has never heard of continental drift and Iron age nomadism.\n\n","date":"January 11, 2013 at 9:09 am","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-21878","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"Everyone agrees that A,B and O are ancient. It is AB ,which is distinct from them, that we are interested in, if that is the blood on the Shroud. The Hungarian evidence suggests that AB is not known there before AD 900 and is related to the genetic intermixing of A and B groups, with AB, understandably,only became a genetically embedded blood group two or three hundred years later. Bodies of the local population before 900 have been analysed for their blood grouping and so far no evidence of AB has been found. This is not conclusive but we need to do better than one  sample from 1977- why has it never been replicated?- why is it not quoted in later studies of genetic material from Israel? At the moment it remains alone so far as I know which is why I have continually asked everyone i know for other examples of early AB and I have not been given a single one. Until I have been, I am entitled to put the AB blood typing of the Shroud alongside the other evidence that it was made, by means as yet unknown, in the medieval period. I am ready to change my opinion if countervailing evidence is provided and if I am convinced I stand to make a lot of money from rewriting my book on medieval relics with an authentic example of a relic purporting to come from the first century. After all all these relics, from the Cross , nails, Crown of Thorns, burial shroud , bones of the apostles, the Virgin Mary’s slippers and girdles,  actually existed at one point- the question is whether any of them have survived. As any archaeologist working in this area (regional and with this kind of artefact) will tell you, it is unlikely especially as the evidence from early Christianity shows that, as with most Protestant communities today, the preservation of relics was not considered important.\nAs that great Church Father, Basil of Caesarea, complained when relic collecting BEGAN in the fourth century: ‘As the sun does not need the lamplight, so also the church of the congregation can do without the remains of the martyrs. It is sufficient to venerate the name of Christ, for the Church is his bride, redeemed by his blood’. The Protestant reformers agreed which is why they destroyed relics without compunction and that included those such as the bones of Thomas Becket that we know were genuine- it simply did not matter to them because they, like the early Christians, did not see relics as relevant to the way they worshipped God.\nSo my request remains open for examples of AB blood groups before 900 and I shall go on asking my history of medicine contacts who will not necessarily even know why I am asking them. No examples provided as yet.\n\n","date":"January 22, 2013 at 6:59 am","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-22376","author":"Charles Freeman","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"I think Kelly Kearse has answered to your question.\n\n","date":"January 22, 2013 at 1:59 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-22396","author":"anoxie","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"The antiquity of the ABO system does not necessarily mean that type AB blood is equally ancient. Modern Bonobos, for example seem to be exclusively type A, and gorillas seem to be mostly type O, while orang-utans do indeed include ABs. See (chimpanzeeinformation.blogspot).\nThat fact more than half the 1977 human sample were found to be type AB is more than extraordinary, even if type AB was indeed present, as it currently does not exceed 10% anywhere in the world. Did those who tested the sample speculate about it, I wonder?\n\n","date":"January 22, 2013 at 3:18 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-22398","author":"Hugh Farey","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"There is not a lot (new) to add here that hasn’t been covered in previous posts or comments.  It is certainly true that examples of ancient samples having AB blood type in the scientific literature may be considered slight.  However, it is equally true that the scientific database of blood typing of ancient samples is, in general, slight.  In my opinion, the polls are still open-less than a few percent of precincts have reported. This is especially relevant given the small frequency of the AB phenotype in the modern population.\n   Regarding the Shroud, I am always careful to discuss the blood studies as “types as AB using forward typing methods”.  When one donates blood, it is first analyzed by forward typing (which evaluates the ABO molecules on the red blood cells).  Before being transfused into a patient, it is always cross-checked by reverse typing (which evaluates the antibodies against ABO molecules in the serum).  Good science always verifies itself in a similar manner.\n   With the AB blood type, no anti-ABO antibodies should exist in the serum-a negative result, which is what was found with the Shroud studies.  However, it can always be argued that such antibodies were originally present but were degraded over time, giving the same readout.  So, the cross-check is somewhat short-circuited: it’s a circular argument.  If the Shroud were any other blood type than AB, these results could be distinguished.  As Ray Rogers once said “Nothing is ever easy with the Shroud”.\n   I, myself, would very much welcome a confirmatory cross-check on the AB blood type, it’s the only way to draw a firm, solid conclusion.  If sufficient DNA within the ABO coding region were intact, this could provide a confirmatory test.  Suppose such tests could be done and the blood on the Shroud was found to be genetically type O, (which has been verified in multiple individuals using modern molecular biology techniques from 5,300 and even 30,000 and 40, 000 years old), would this then be considered as positive evidence that the Shroud might be authentic, or simply dismissed as irrelevant?\n   The development and inheritance of ABO blood groups throughout human history (and that of related species) is an interesting and complex subject.  Numerous questions exist that remain to be answered, apart from the context of the Shroud.  Given the relative unknowns on the origin and appearance of ABO blood types in humans, it is probably not the best yardstick in terms of possible evidence for non-authenticity.\n\n","date":"January 22, 2013 at 10:28 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-22412","author":"Kelly Kearse","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"Hugh- if you read the original study, you will find, so far as I remember, that the supposed AB population were a small group from the same family buried together.\nKelly. As not a single one of the many thousands of medieval relics has yet been proved to come from the first century, the presumption is that such relics are not authentic unless very strong evidence is provided otherwise. I am waiting for some so that i can launch a second, more sensational, edition of my book on medieval relics!\n\n","date":"January 23, 2013 at 10:21 am","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-22462","author":"Charles Freeman","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"Charles, you are wrong regarding the original study (*).\n Please read the abstract:\n“Sixty-eight ancient skeletons, unearthed at Jerusalem and En Gedi and, according to the archeological data belonging to Jewish residents of these places from about 1,600 to 2,000 years ago, were ABO-typed by means of the hemagglutination-inhibition test. The blood groups of 13 skeletons were undiagnosable and the remaining 55 showed the following distribution: 30.91% A-group, 14.54% B-group, 50.91% AB-group and 3.64% O-group. According to these findings, the population to which these skeletons belonged must have had a high frequency of genesIA andIB, and a low occurrence of O blood group and its relatedIO gene.”\n(*)S. Micle, E. Kobilyansky, M. Nathan, B. Arensburg, H. Nathan. 1977. ABO-typing of ancient skeletons from Israel.American Journal of Physical Anthropology. vol. 47, 1, pp 89-91. DOI: 10.1002/ajpa.1330470115\n\n","date":"January 23, 2013 at 12:10 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-22466","author":"Gabriel","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"Well, at enormous expense I now have the original study.\nTwo collections of bones were studied, from Ein Gedi (4th Century) and from Jerusalem (1st Century). It would be remarkable if both collections were from the same family.\nFrom Ein Gedi, 6 of the 24 bodies were AB.\nFrom Jerusalem, 22 of the 47 were AB.\nThe authors also mention an earlier study of Egyptian mummies, where 9 of 24 were AB.\nThey charmingly conclude by saying “the gene frequencies of the ABO blood group system may have undergone important modifications in the course of human evolution.”\nEither that, or other blood types tend to deteriorate over time until they test as if they were AB.\nIf the blood on the shroud is 1st century, and if it really tests AB, then it comes from the commonest type of blood there was.\n\n","date":"January 23, 2013 at 2:05 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-22467","author":"Hugh Farey","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"‘If the blood on the shroud is 1st century, and if it really tests AB, then it comes from the commonest type of blood there was.’  No, it doesn’t, because this is a study of only 46 bodies (and I will provide the family links when i next access the article in Cambridge) which has never been replicated while the study of the Egyptian bodies has, so far,as i know, now been reclassified to show that they were A, although I will have to check my source for that. (I am not sure that the reclassified Egyptian mummies are the same mummies quoted in your source.)\nWe need, after 35 years in which techniques have improved enormously, to apply the same retesting on the Israeli sample but, as it does not seem to be quoted in later studies of early Jewish genetics I assume that it has not been taken seriously. It remains extraordinary that no one else can find any evidence of AB before AD 900. If testing of earlier samples is as unreliable as suggested then the israeli case can hardly be taken seriously.\nYour argument would imply that AB has diminished over the years to the c. 4 per cent we have today.\nI think we are often getting confused between ABO ( A,B and O, the original blood groupings,  and the distinct,  and probably much later, AB.)\n\n","date":"January 24, 2013 at 8:27 am","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-22516","author":"Charles Freeman","site":"shroudstory"},{"title":"Positive for AB is not the same as AB positive","post":"Sorry Charles, I should have said that “the 1977 findings suggest” that it comes from the commonest group there was. The argument that AB type blood has diminished from about 50% to its present 4% is not mine; it is implied by the slightly nervous statement (quoted above) with which the authors conclude their paper. While they were confident with their procedure, and tested each bone three times, they seem to me rather less confident with their conclusions. My own, hopelessly unqualified, view is that the huge proportion of AB they discovered is more likely due to the deterioration of the sample than either a freak double group of highly unusual people, or a very different proportion of AB then from now.\n\n","date":"January 24, 2013 at 1:22 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","id":"comment-22549","author":"Hugh Farey","site":"shroudstory"}]
