[{"title":"\nReal human blood #23: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic!\n","post":"\n\nI'm invoking the \"any shroud related topic on newest post\" rule.I was recently reading about the Sudarium of Oviedo and noticed that it is almost universally accepted that the radiocarbon dating tests performed on it were inaccurate.  I have been able to find very little information on it besides that.  Do you have an opinion on the accuracy of this test and do you think its inaccuracy has any bearing on your theories regarding the carbon dating of the Shroud?\n\n","author":"Kyle Wright","date":"June 5, 2017 at 10:49 PM","url":"http://theshroudofturin.blogspot.com/2017/06/real-human-blood-23-man-on-shroud.html","site":"moore"},{"title":"\nReal human blood #23: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic!\n","post":"\n\nKyle>I'm invoking the \"any shroud related topic on newest post\" rule.No need to invoke it. As long as a comment is not \"offensive or sub-standard\" then if it is \"under my latest post [it] can be on any one Shroud-related topic\" without being \"off-topic\" (see my policies below). >I was recently reading about the Sudarium of Oviedo and noticed that it is almost universally accepted that the radiocarbon dating tests performed on it were inaccurate. It wasn't that it was \"inaccurate\" but according to the then Director of the Arizona radiocarbon dating laboratory, Paul Damon, \"the dating was never carried out\":See my post 28Jul12 (words in bold are the Shroud sceptic  Charles Freeman's):----------------------------------Freeman continues to mislead his readers by selectively concealing from them relevant information in his claim that the Sudarium has had \"a radiocarbon-14 dating apparently of c. 700 AD\":Those trying to assess the authenticity of the Sudarium of Oviedo have to contend with a radiocarbon-14 dating apparently of c. 700 AD. But Freeman's claim is misleading (and what's more, since he surely must have read Guscin's book, he knows it is misleading) that \"the Sudarium of Oviedo \"had ... a radiocarbon-14 dating ... of c. 700 AD.\" What Freeman does not tell his readers is that Guscin went into this very thoroughly in his book, detailing his correspondence with the Tucson Arizona radiocarbon dating laboratory, and he concluded:\"The only conclusion that can be drawn from this, and the Tucson laboratory would seem to agree, is that the whole affair was something of a shambles. Mr Jull ends his fax to me offering to carry out a serious radiocarbon dating on a sample of interest. The samples were not taken with permission for radiocarbon dating, and had presumably been taken by Monsignor Ricci about 15 years before being sent to Tucson. When sent, insufficient provenance information accompanied them; one of the samples was even stated to be 11th century. Paul Damon says the dating was never carried out, and in the results sent to Italy the sample numbers do not coincide. The laboratory suggests a serious experiment. Taking all this into account, the supposed results of the carbon dating of the sudarium can safely be ignored.\" ([Guscin, M., 1998, \"The Oviedo Cloth,\" Lutterworth Press: Cambridge UK,] pp.83-84).\"---------------------------------->I have been able to find very little information on it besides that. See above.[continued]\n\n","author":"Stephen E. Jones","date":"June 6, 2017 at 11:23 AM","url":"http://theshroudofturin.blogspot.com/2017/06/real-human-blood-23-man-on-shroud.html","site":"moore"},{"title":"\nReal human blood #23: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic!\n","post":"\n\n[continued]>Do you have an opinion on the accuracy of this test ...See above that there was no test, or if there was one, it was so flawed that the Arizona radiocarbon dating laboratory has disowned it.But in general, if a radiocarbon date disagreed with other historical information (e.g. the Sudarium of Oviedo left Jerusalem in AD 614 - see my 24Jan17) then it is the radiocarbon date that is wrong, presumably due to contamination with younger carbon.>and do you think its inaccuracy has any bearing on your theories regarding the carbon dating of the Shroud?This is particularly so with the Shroud. The evidence is overwhelming that the Turin Shroud is authentic and the laboratories and Nature should have taken that into account. It is a form of scientific fraud to state the result of a scientific test without acknowledging the evidence against your result.The standard of scientific honesty that all scientists, including those involved in the radiocarbon dating of the Shroud, should adhere to is that set by the late Professor of Physics at Caltech, Richard P. Feynman (1918–1988) (my emphasis):\"It's a kind of scientific integrity, a principle of scientific thought that corresponds to a kind of utter honesty - a kind of leaning over backwards. For example, if you're doing an experiment, you should report everything that you think might make it invalid-not only what you think is right about it: other causes that could possibly explain your results; and things you thought of that you've eliminated by some other experiment, And how they worked-to make sure the other fellow can tell they have been eliminated. Details that could throw doubt on your interpretation must be given, if you know them. You must do the best you can-if you know anything at all wrong, or possibly wrong-to explain it. If you make a theory, for example, and advertise it, or put it out, then you must also put down all the facts that disagree with it, as well as those that agree with it ... the idea is to try to give all of the information to help others to judge the value of your contribution; not just the information that leads to judgment in one particular direction or another ... I'm talking about a specific, extra type of integrity that is not lying, but bending over backwards to show how you're maybe wrong, that you ought to have when acting as a scientist.\" (Feynman, R.P., 1985, \"Surely You're Joking, Mr Feynman!,\" Unwin Paperbacks: London, Reprinted, 1990, pp.340-343)Stephen E. Jones----------------------------------MY POLICIES. Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Except that comments under my latest post can be on any one Shroud-related topic. To avoid time-wasting debate I normally allow only one comment per individual under each one of my posts.\n\n","author":"Stephen E. Jones","date":"June 6, 2017 at 12:04 PM","url":"http://theshroudofturin.blogspot.com/2017/06/real-human-blood-23-man-on-shroud.html","site":"moore"}]
