[{"title":"Reality: Get Real Colin Berry","post":"Please not that Higgs boson discovery is still controversial http://news.discovery.com/space/might-the-higgs-boson-have-a-lookalike-imposter-120710.html. This is the second post in this blog gathering conclusions by guys based on this discovery, not fully confirmed yet.\n\n","date":"July 17, 2012 at 8:55 am","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","id":"comment-13915","author":"Gabriel","site":"shroudstory"},{"title":"Reality: Get Real Colin Berry","post":"I think the contrast between science and religion is a myopic statement.\n\n","date":"July 17, 2012 at 7:54 pm","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","id":"comment-13932","author":"Andy Weiss","site":"shroudstory"},{"title":"Reality: Get Real Colin Berry","post":"Get real Colin Berry? It’s you Shroudies who have to get real!!!\nI don’t have an answer as to how the shroud was created, but there are a number of facts that argue against authenticity:\n– The figure in the shroud is over 6 feet tall, he would have been a giant if he existed in Jesus’s time\n– The figure’s hair flows straight down, if it was a real man laid down then the hair would have fallen back\n– the arms are too long and the face is too long and narrow\nFlagellants were common throughout the 1300s, it’s likely this admittedly clever fake was influenced by the flagellants, and the image is consistent with the growing depiction from the 1300s of a  suffering Christ \nNote: I am a Christian, but I don’t take the Shroud’s authenticity seriously\n\n","date":"July 18, 2012 at 6:04 am","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","id":"comment-13943","author":"Matthias","site":"shroudstory"},{"title":"Reality: Get Real Colin Berry","post":"It’s obvious from your list of facts (erroneous as they may be) Matthias, that you have not studied the Shroud in any depth whatsoever!!! In fact most of the supposed ‘facts’ you list are pretty typically found on athiest non-authenticity sites…I’ve seen/read all those you mention above, many times before. It’s good to hear you claim your a Christian, but I would suggest you do take the Shroud seriously, and do some research before you start making comments such as “It’s you shroudies who have to get real!!!”….seriously.\nR\n\n","date":"July 18, 2012 at 11:58 am","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","id":"comment-13946","author":"Ron","site":"shroudstory"},{"title":"Reality: Get Real Colin Berry","post":"Matthias’ so called “facts” are trite and trivial comments, and have been dealt with many times before, on this site and elsewhere.  In order to be able to comment effectively, he needs to look into the matter in raher more depth, than he apparently has so far.\n\n","date":"July 18, 2012 at 4:45 pm","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","id":"comment-13953","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Reality: Get Real Colin Berry","post":"Ron / daveb\nI would appreciate your views on why my points are not supported by evidence.\nYou never know, compelling answers might change my mind….\n\n","date":"July 18, 2012 at 6:24 pm","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","id":"comment-13964","author":"Matthias","site":"shroudstory"},{"title":"Reality: Get Real Colin Berry","post":"I’m not going to write a whole book here to show the flaws in your points, you can search and read just as well as anyone. You can start at shroud.com where there you will find dozens of papers written and some cover the issues you posted. Furthermore it is up to you to support your evidence, so I ask you to point us to where you received your ‘so-called’ evidence….\nI will address your first point nonetheless, as I have time right now; “The figure in the Shroud is over 6 feet tall, he would have been a giant if he existed in Jesus’s time”- Typical garbage put out by Shroud skeptic authors; 1-Scientific studies have shown the actual height of the man on the Shroud to be anywhere from 5′,7″ to 5′,11′ tall, approximately, as it is very difficult to access proper measurements from the Shroud, it being a porous material and susceptible to stretching and shrinking. 2- Many archaeological studies have found that the [average] Jewish male in palestine in the first century, stood approximately 5′,11″ tall. This was concluded from study of hundreds of skeletal remains found to date in the Isreali/Palestinian area. Roman males on the other hand were known to be short compared to the Jewish population being on average 5′,4″ in height…these are scientific facts, which are indisputable. So in fact Jesus may have been on the short side for a Jewish male if he stood 5′,8″ and only average at 5′, 11.\nR\n\n","date":"July 19, 2012 at 4:47 pm","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","id":"comment-13991","author":"Ron","site":"shroudstory"},{"title":"Reality: Get Real Colin Berry","post":"Ron\nI would appreciate a more constructive apporach to enquiry and debate.\nI come to this forum as rather skeptical, but still open minded enough to consider alternative views, and even to re-evaluate my skepticism…..\nThank you for your response on the question of height. I would be most appreciative if you can provide references for your points 1 and 2 above. An average height of 5’11’ sounds very tall – that is roughly the modern day average of northern Europeans\n\n","date":"July 19, 2012 at 8:33 pm","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","id":"comment-13997","author":"Matthias","site":"shroudstory"},{"title":"Reality: Get Real Colin Berry","post":"La talla del Hombre de la Sábana era probablemente de 175±2 cm.\n(“Turin Shroud: Compatibility Between a Digitized Body Image and a Computerized Anthropomorphous Manikin”, Journal of Imaging Science and Technology, [Sep/Oct 2010] Volume 54, Issue 5, pp 050503-1-(8)).\nEn inglés no está disponible en la web (abstract only), pero puede encontrar el trabajo COMPLETO en ITALIANO en:\nhttp://www.dim.unipd.it/misure/fanti/Manikin.pdf\nCarlos\n\n","date":"July 20, 2012 at 2:19 am","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","id":"comment-14000","author":"carlos","site":"shroudstory"},{"title":"Reality: Get Real Colin Berry","post":"A suggestion for Fanti et al. So they have a 3D computerized image of the body and sheet. They can feed a software like FLUENT with them and rather simply, address the issue of the amines motion from the body. They could fine tune several conditions, like temeprature, humidity, specific weight of amines, sweat, cadaverine and others and finally confirm or rule out Rogers hypothesis. The advantage is that almost any environmental conditions could be tested, even the most extreme.\nFanti could also test his corona discharge hypothesis because if he supports the idea of a second image on the reverse of the cloth, the difference in intensity between both images (front and reverse) should be a function of the conductiviity of the linen (very very low).  If he cannot relate both (intensity of the image as pixel values and conductivity of linen) he should  either give up his hypothesis regarding corona discharge or his claim of double superficiality.\n\n","date":"July 20, 2012 at 4:51 am","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","id":"comment-14008","author":"Gabriel","site":"shroudstory"}]
