[{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nI read that type AB is the newest of blood types. Mostly starting only ten or twelve centuries ago. Is this true and what data supports this claim?\n\n","author":"Anonymous","date":"June 24, 2011 at 9:56 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nAnonymous>I read that type AB is the newest of blood types. Mostly starting only ten or twelve centuries ago. Is this true and what data supports this claim?Thanks for your comment. According to a Dr. Peter D'Adamo at http://www.dadamo.com/bloodtype_AB.htm:\"Type AB blood is rare – it’s found in less than five percent of the population. And it is the newest of the blood types. Until ten or twelve centuries ago, there was no Type AB blood type. Type AB resulted from the intermingling of Type A with Type B.\"Whether this is true or not, I don't know. In fact I don't see how anyone could know for sure, since it presumably is impossible to test the type of centuries-old blood and all old human blood tends to become type AB.And again the significance of the Shroud blood being type AB is that if it was anything else, e.g. type O, then that would be evidence against it being very old and evidence for it being European.Stephen\n\n","author":"Stephen E Jones","date":"June 24, 2011 at 11:20 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nHi, I've been researching the Eucharistic Miracle of Lanciano, the Sudarium of Oviedo, and Shroud of Turin and came upon the claim of all blood becoming AB over time, so I searched for that and found your posting.  I also found information on blood types of ancient Egypt and curiously, of the types listed in the research cited, AB is one of the least prevalent. Somehow, I don't think mummification would preserve the blood type that well if it is true that all blood eventually becomes AB over time.  If it did, it seems it would do a better job preserving the rest of the body. Of course, I'm no scientist, but that's the way it seems to me. The only places on the internet that I have been able to find claims of all ancient blood types reverting to AB is in reference to the Shroud and links to other Jesus related evidence.  Curious, isn't it?\n\n","author":"Anonymous","date":"July 3, 2011 at 12:42 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nAs often D'Adamo's theory is quoted in order to criticize the authenticity of the Shroud (if AB blood is recent the Shroud or the blood can not be 2000 years old)I would point out that Dr. D'Adamo is not a scientist. Dr. D'Adamo has no scientific publications and his theory about recent AB blood is published in a diet book!Prof. Gregory Thiemann from York University published an article criticizing this theory.\"Evolution, blood types, and weight-loss: A critical examination of a popular diet\", Proceedings of the Nova Scotian Institute of Science 43.\"While it seems odd that Type AB didn't emerge until very recently despite the coexistence of Types A and B for at least 10000 years, D'Adamo & Whitney base their timelime on the fact that \"prehistoric graves in Hungary show a distint lack of this blood groop\".It would be interesting to know precisely how many graves were examinated considering that blood group AB is quite rare in the modern human population\". (p.61)\"the various blood types therefore evolved before humans, chimpes or gorillas\".. \"It is clear that blood groups pre-date the exsistence of Homo spp.\" (p.63)http://fatlab.biology.dal.ca/docs/data/thiemann-NSIS-2005.pdf\n\n","author":"domenico","date":"August 2, 2011 at 3:08 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nOk Schwartz maybe a good sturp photographer but I don't agree with him on ancient blood turning ab. I can't really post links since I'm on my iPod but tested king tuts blood from his tomb and it tested type ab. If you want to come up with the excuse that the blood was preserved through the mummification process you can also make the case for the shroud because they found the blood on the shroud perfectly preserved probably from the aloe, myrr and other ingredients that were found on the shroud.The info on this took me a few hours but thanks to my extreme scrupulosity I finally found it. This debunks the theory that all blood degrades to type ab\n\n","author":"Bippy123","date":"February 7, 2012 at 6:35 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nBippy123>This debunks the theory that all blood degrades to type ab You haven't provided any evidence. Just assertions. Admittedly I haven't seen any hard evidence that old blood does degrade to type AB, but since type AB is the  absence of antibodies (see above), I assume that it is so.What I would like to see is blood from a 2,000 year or older body that is not type AB. If you know of any that is in an authoritative source, e.g. a scientific journal, not just a web page that asserts it, I would appreciate you or anyone supplying the details in a comment.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Each individual will usually be allowed only one comment under each post. Since I no longer debate, any response by me will usually be only once to each individual under each post.\n\n","author":"Stephen E Jones","date":"February 7, 2012 at 7:45 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nStephen as I said yesterday I am on my iPod and my bad luck tonight is that I am still on my iPod and unable to get to a pc to copy and paste the info.It's frustrating though.Try doing a search for king tut's blood type.I think you will find some interesting info as we both know tut is older than 2000 years. It's times like these I wished I had a laptop.In my former post I posted that tut had type ab, what I meant to say was type a2 which is definitely different than ab. Can anyone verify this about tut before I get to a desktop pc?\n\n","author":"bippy123","date":"February 9, 2012 at 4:23 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nbippy123>In my former post I posted that tut had type ab, what I meant to say was type a2 which is definitely different than ab.Thanks for the correction.>Can anyone verify this about tut before I get to a desktop pc?Googling on \"King Tut blood group A2\" I found a number of hits, including this one:\"King Tut's Dad's Toe Returns Home,\" Rossella Lorenzi, Discovery News, April 15, 2010 ... A toe belonging to King Tutankhamun’s father has been finally returned to Egypt, the Supreme Council of Antiquities said on Wednesday. The bone piece belonged to mummy KV55, which was identified as Akhenaton during a recent major genetic investigation into King Tut's family. The son of Amenhotep III and also the father of Tutankhamun, Akhenaton, (1353-1336 B.C.) is known as the \"heretic\" pharaoh who introduced a monotheistic religion by overthrowing the pantheon of the gods to worship the sun god Aton. The terminal phalanx of his great toe, probably from the left foot, was taken away in 1968, when the Department of Antiquities in Cairo, under the supervision of the then director, handed it over to the late Professor Ronald Harrison of Liverpool University. \"Since then, the specimen has been held securely in my laboratory, but I decided it had to `go home,' particularly since very few people knew where it was,\" Robert Connolly senior lecturer in physical anthropology from the University of Liverpool's Department of Human Anatomy and Cell Biology, told Discovery News. Connolly, who authored several scientific papers with Harrison, used the specimen to determine the blood-group of KV55, then believed to be Smenkharel, an ancient Egyptian pharaoh of the late 18th Dynasty. \"The remains appeared to be A2 with the antigens M and N present. This was identical to the blood group of Tutankhamun,\" Connolly said.  ...While not a scientific journal, I regard this Discovery News science news report as sufficiently authoritative, especially as it quoted Dr. Connolly's words: \"The remains appeared to be A2 with the antigens M and N present,\" to establish that old blood does not necessarily degrade to AB. Especially bearing in mind that at 14th century BC King Akhenaton's (not Tutankhamun's) remains are much older than the Shroud's presumed 1st century AD.Which means both the Shroud's and the Sudarium of Oviedo's blood group being AB is significant and cannot just be set aside by the claim that old blood always degrades to type AB. I am more than happy to be corrected on this one! Thanks again for the tip-off.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Each individual will usually be allowed only one comment under each post. Since I no longer debate, any response by me will usually be only once to each individual under each post.\n\n","author":"Stephen E Jones","date":"February 9, 2012 at 7:51 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nNo prob Stephen, as we are nothing looking honestly for the truth here. If it wasn't for this blog I also would not have known this myself. It's incredible how my extreme scrupulosity lead me to the shroud of Turin.You have a great blog SirGod bless\n\n","author":"Bippy123","date":"February 11, 2012 at 2:41 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nBippy123See my subsequent post, \"King Tut's Dad's Toe Returns Home,\" in my Shroud of Turin News for February 2012, where I acknowledge: \"I was alerted by a commenter bippy123 ... that King Tutankhamun's blood type was A2.\"Thanks again.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"February 11, 2012 at 5:53 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nI would also like to apologize to Barry Schwartz for my rash response. Sometimes my passion gets the better of meGod bless\n\n","author":"Bippy","date":"February 12, 2012 at 5:59 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nJust saw the article Stephen, thanks a bunch :)Hopefully this will get indexed quick by google so that other researchers could also get this out there.The more people that know this the better.Forgive me for the typos, arghhh, it's the iPod againGod bless\n\n","author":"bippy123","date":"February 12, 2012 at 6:07 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nBippy>I would also like to apologize to Barry Schwartz for my rash response.I am not sure what you are apologisng for, but his name is Barrie Schwortz and I know that he doesn't read my blog, let alone comments to it. He did not even realise that I had a Shroud of Turin blog until recently.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"February 12, 2012 at 8:56 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nbippy123>Hopefully this will get indexed quick by google so that other researchers could also get this out there.Yes. That's why I posted it in my February 2012 Shroud News, even though it was 2010 news. As far as I know, no Shroudies saw it.So thanks again for your contribution to Sindonology!Stephen E. Jones\n\n","author":"Stephen E Jones","date":"February 12, 2012 at 9:00 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nHi Steve,Further to this discussion on the blood typing and it's possible degradation; You may want to check out Dan's Shroud of Turin Blog as...Immunologist Kelly P. Kearse has written a fine post to this very topic.Thanks,F3\n\n","author":"Flagrum3","date":"February 16, 2012 at 7:00 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nFlagrum3>... You may want to check out Dan's Shroud of Turin Blog as ... Immunologist Kelly P. Kearse has written a fine post to this very topic.Thanks, I saw it: \"MUST READ: A lot of old blood types as AB: Not Exactly. I noted Kearse's summing up: \"Is the blood on the Shroud type AB? Probably. ...  it is best concluded that the results suggest that the Shroud bloodstains are type AB as shown by forward typing methods. To dilute the significance of these results by adding that \"however, all old blood types as AB\" or \"all old blood is degraded to AB\" unfairly oversimplifies the issue ... this is simply not always the case.\"Good to have that factoid put back in its box!\"... serological typing has been successfully used in the study of mummies by Robert Connelly, including King Tutankhamun with blood type A.\"And also to have it confirmed that the blood typing of 14th century BC Egyptian mummies as type A, was valid.I also found this interesting, that the Shroud's blood type could in principle be absolutely confirmed by DNA:\"... Expression of human ABO blood groups is controlled by a single locus in exons (coding segments) 6 and 7 of chromosome 9. If molecular analysis of this region were feasible, such studies would help address previous concerns raised with serological techniques regarding the blood type.\"Stephen E. Jones\n\n","author":"Stephen E Jones","date":"February 17, 2012 at 10:27 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\ni heard that any postmortem blood gives AB grouping  i mean to say blood taken during autopsy\n\n","author":"radha srinivas","date":"July 14, 2012 at 2:38 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"},{"title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n","post":"\n\nradha>i heard that any postmortem blood gives AB grouping i mean to say blood taken during autopsyYou don't cite any reference so I am unable to comment specifically on mere hearsay.But your comment prompted me to repost today as a separate post, \"Old blood does not always degenerate to type AB, so the Shroud of Turin's and the Sudarium of Oviedo's blood group being AB is significant!\" my comments on the article \"King Tut's Dad's Toe Returns Home,\" in my post \"Shroud of Turin News for February 2012,\" referred to in comments above, where a family of ancient Egyptian mummies has a blood type which was not AB.So what you heard, \"that any postmortem blood gives AB grouping\" is not true.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"July 14, 2012 at 8:51 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","site":"moore"}]
