[{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"I’m a very open minded person (I think it is highly likely based on the collective evidence that the Shroud is authentic, but I am certainly not 100% convinced), and as I said Colin talks sense sometimes when he is not talking nonsense (he’s better sticking to science, rather than getting into quite frankly absurd historical and artistic arguments). I think he has some interesting thoughts on his scorch theory, and I for one wouldn’t dismiss his theory that the Shroud image is a LIGHT scorch, hence why it is non-fluorescent. I would like to see this theory tested further, to me it is the only plausible argument for non-authenticity.\nHis thoughts on the crease marks adjacent to the head image being potential evidence for a scorching method are also quite interesting, in my view.\nIf someone disproved his theory I’d say I’m 100% convinced of authenticity (I have no time for bas-relief rubbing theories)\n\n","date":"July 30, 2012 at 7:04 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14322","author":"Matt","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"Read again my paper Matt.  The bloodstains on the cloth are a huge PROOF that the Shroud is not some kind of artistic forgery…  In that regard, the body image cannot be a scorch, unless you believe that the resurrection could have caused a light scorch on the top-most fibers of the cloth.  If that’s an hypothesis you think is possible, then it would fit into the scenario #4 I describe in my article.  But because scorched linen normally caused a fluorescence visible on UV fluorescence photos, the body image on the Shroud don’t react like a scorch, so I think it’s fair to say that this hypothesis is highly unlikely (to say the least)…\n\n","date":"July 30, 2012 at 1:02 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14332","author":"Yannick Clément","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"Yannick – but my point is that Colin’s theory is that a light scorch, as opposed to a heavy scorch may NOT cause a flourescence. Do you have any evidence to disprove that LIGHT scorches also do not cause flourescence\n\n","date":"July 30, 2012 at 6:46 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14343","author":"Matt","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"The evidence that the Shroud is not a manmade product of someone using a light scorch technique resides in the bloodstains !  In itself, they prove the Shroud is a real burial shroud of someone and not an artistic forgery…  Read again my paper ! ;-)\n\n","date":"July 31, 2012 at 1:02 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14358","author":"Yannick Clément","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"Another comment for Matt :  Don’t forget this important fact about the Shroud : There is no body image under the blood and the serum stains !!!  How in the world can you believe for 2 seconds that a forger could have taken a real burial shroud of a real scourged and crucified man (who was crucified with the Roman method), remove the corpse in it (without disturbing the bloodstains and the fibers underneat these stains), and only after that, used a light scorch technique to form a body image around the blood and serum stains that were already on the cloth (with absolutely no forensic error whatsoever) in order to produce a false relic of Christ ???\nIn face of all the data we have concerning the bloodstains, this idea is totally and purely ludicrous !  Here, we are in a very high speculation… So high that defy any law of good sense !\n\n","date":"July 31, 2012 at 3:48 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14363","author":"Yannick Clément","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"There is no ‘Lire copy’, only a ‘Lier copy’.\nhttp://en.wikipedia.org/wiki/Lier,_Belgium\n\n","date":"July 30, 2012 at 11:05 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14328","author":"Jos Verhulst","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"Colin Berry ha ido EVOLUCIONANDO, empezó quemando las telas con planchas de metal caliente y ahora, poco tiempo después, mantiene la hipótesis de la quemadura por LUZ. ¡ ja, ja, ja, ja !.\n¡Colin terminará siendo defensor de la autenticidad de la Sábana!\nEstoy en ese punto, la quemadura por LUZ, de acuerdo con Colin Berry.\nHay que tener mucho cuidado con la utilización de las palabras, asociar la palabra quemadura (SCORCH)  sólo con ALTA TEMPERATURA es una fuente de ERROR.\nUna quemadura es una oxidación-deshidratación y existe la oxidación- deshidratación producida por CALOR (alta temperatura), la oxidación-deshidratación producida por FRIO (baja temperatura), la oxidación-deshidratación por una sustancia química QUÍMICA ( sin tener relación con la temperatura)……..y otras probables maneras.\nDi Lazzaro obtiene la oxidación-deshidratación de la fibrilla del lino mediante luz ultravioleta al parecer sin aumento apreciable de la temperatura.\n[“Yo soy la luz del mundo; el que me sigue, no andará en tinieblas, sino que tendrá la luz de la vida”. Juan 8.12:  ]\nCarlos\n\n","date":"July 30, 2012 at 9:26 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14346","author":"corneliotel","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"Yannick\nThanks for your responses.\nThere are a couple of other things that still trouble me about the Shroud:\n1. Why is there no image on the top of the head. Surely the top of the head would have created an image, whether the rest of the image was created by radiation, amines or whatever? The lack of image on the top of the head provides some support for Berry’s bas relief scorch theory\n2. How about the creasemarks just below the chin / above the head? I think Berry makes quite a good argument that these creasemarks appear the product of a scorch ( they remind a bit of what happens when you iron a crease into a shirt)\n\n","date":"July 31, 2012 at 11:26 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14375","author":"Matt","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"1. There’s no definitive answer for this lack of body image.  I think the simpliest answer can be that something was present there to block the image formation process on the cloth.  Or maybe it is really due to the fact that the image formation process was a complete vertical projection.  This is also possible but harder to believe in the context of a possible natural process.\n2. I’ve read in one STURP paper published by Pellicori and Evans that this very distinct creasemark is effectively the product of a scorch made during the fire of 1532.  I don’t know if this hypothesis is generally accepted among Shroud’s scholars, but I think it’s a very rational conclusion.  The folding of the cloth at the moment of the fire has been established and if there really was a folding at this particular place, I think the hypothesis of Pellicori and Evans is most probably right.\n\n","date":"August 1, 2012 at 10:51 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14386","author":"Yannick Clément","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"Note : I know that the folding of the cloth at the moment of the fire has been established but personally, I don’t know the exact form it was.  I would definately love to see what it was like.\n\n","date":"August 1, 2012 at 10:52 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14387","author":"Yannick Clément","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"Hi Yannick\nRe: Number 1. I’m still not satisfied!!! What could possibly block the image formation through the top of the head?\nCould Jesus’s crown of thorns have prevented image formation, for example if the Crown of thorns was tall enough to prevent contact between the top of the head and the cloth? But even if that was possible, it would be unlikely that Jesus would have been wrapped in the shroud without removal of the crown of thorns?\n\n","date":"August 2, 2012 at 4:02 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14402","author":"Matt","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"There’s a message I want to give to all the persons who could be tempted to believe the Shroud of Turin represent one form or another of clever artistic forgery.  Reading Matt’s comment yesterday made me realized that there’s one MAJOR SCIENTIFIC TRUTH that I should have emphasized in my paper concerning the authenticity of the Shroud, but that I did not (or not enough).  Here is this truth that is SO OFTEN FORGOTTEN :  In order to explain the Shroud, one MUST take account of all the known and accepted data about the relic, AND THAT INCLUDE THE BLOOD AND SERUM STAINS PRESENT ON THE CLOTH !!!\nToo often I see people proposing all sorts of artistic techniques to explain the body image but, AT THE SAME TIME, these people don’t offer any rational explanation whatsoever concerning the blood and serum stains !!!  From a scientific point of view, this kind of acting represents a total lack of credibility and professionalism.  In fact, this is purely unscientific to act like that…  I’m sorry but the Shroud IS NOT just a body image !!!  People tend to always forget that essential FACT.  It is ALSO, AT THE SAME TIME, a blood and serum stained cloth !!!  You can’t proposed an explanation that would only account for the body image without even considering the blood and serum stains…  But unfortunately, almost all the skeptics out there do exactly what I just describe !!!  I thought I made it clear enough in pages 9 and 10 of the English version of my paper, but I realized that it’s probably not the case.  \nSo, I repeat it to make sure that anyone who’ll read this will remember it until the end of his life :  Any image formation proposition SHOULD, AT THE SAME TIME, be able to explain rationally the blood and serum stains that are present on the cloth as well as the body image !!!  It is scientifically forgiven to make a proposition for just one of these 2 main aspects of the Shroud of Turin !  You simply cannot separate one from the other.  Both are linked together.  In other words, every person who tries to explain the Shroud, SHOULD come up with a global explanation that would account rationally for EVERY ASPECTS of the cloth, including the blood and serum stains and not just the body image.  \nAnd please, don’t come talking to me about the “fact” that the blood and serum on the cloth don’t really come from a real tortured and crucified man, because this conclusion is one, if not the most solid that exist concerning this relic !!!  And this aspect of the Shroud is well enough to understand that this cloth is a real burial shroud of someone who bled a great deal prior to his death (and even after death).  In these conditions, I think that we should completely forget every proposal based on any kind of artistic technique and concentrate the debate on the 4 possible scenarios I proposed in pages 6, 7 and 8 of my paper.  If we can do this, I firmly believe that the Shroud authenticity debate would gain much credibility and valor !  Why constantly losing our precious time in sterile debate about some kind of artistic forgery, while these options were set aside long ago.  The STURP team drove the last nail in that coffin at the beginning of the 80s and even before, thanks to the work of Barbet and Vignon, among others, these options were already judged inadequate regarding the real nature of the Shroud (that include the blood and serum stains and not only the body image) !!!\nAnd to be even more punchy, I leave the place to William Meacham !  Here’s what he wrote in page 47 of his book The Rape of the Turin Shroud : “These conclusions (note: Meacham talk about the FACT that the Shroud is not some artistic forgery and, on the contrary, that it is an authentic burial shroud of someone who was tortured and crucified) should now be considered WELL-DOCUMENTED ARCHAEOLOGICAL JUDGEMENTS, approaching the level of certainty if normal standards are applied, ESPECIALLY SINCE THEY AGREE EXACTLY WITH THE EVIDENCE FROM MEDICAL STUDIES.”\nOnce you realize that the Shroud is a real burial cloth of someone who suffered the same tortures than Jesus of Nazareth, as reported by the Gospels, there’s not too much options that is left on the table.  In fact, I truly believe that there is just four and none of them involved some kind of artistic technique, even if one still involve a forger (see my recent paper, pages 6 to 8) !!!\nIt would be nice if this eternal debate about the authenticity of the relic could focus ONLY on these 4 options and disregard completely all the rest, especially those involving an artistic technique.  If we really want to find the TRUTH (and not just our little truth), I don’t think we should lose one minute searching in a direction that was set aside by science long ago…\nTo conclude, I would like to give you a very clever quote from John Heller and Alan Adler that we can find in page 50 of Meacham’s book and that fits perfectly with my comment : “The multidisciplinary nature of these publications (note : they talk here about all the STURP papers), ranging from mathematics, physics and chemistry through biology and medicine, is part of the complex Shroud problem and MUST BE CONSIDERED IN ITS ENTIRETY FOR AN EVALUATION OF THE EVIDENCE.”\nI think they could have add “and for an evaluation of any hypothesis of image formation.” !!!  Meditate on that folks !!!\n\n","date":"August 1, 2012 at 8:28 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14381","author":"Yannick Clément","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"Further to my last comment I see from searching the internet that some theorise that the crown of thorns was more like a cap. If that is the case, the cap of thorns would have prevented contact between the top of the head and the shroud, perhaps explaining the lack of image.\nHowever, if this is correct it may be problematic for resurrection induced radioactive image creation. Surely if the image was created by supernatural energy generated during the resurrection, that would have been emitted from the top of the head and the energy would have left an image of the top of the head and cap of thorns?\nTherefore, if we are to argue the case that the shroud really wrapped Jesus, perhaps image formation through some biological process resulting from contact between body and shroud is more likely?\nI find it hard to accept the vertical projection theory\n\n","date":"August 2, 2012 at 4:14 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14403","author":"Matt","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"Matt, think about it; If there was a cap of thorns, wouldn’t it also block the image of the forehead or back of the head image? …There was no cap of thorns when the image formation occurred, I think that can be concluded simply by studying the image. There is no top of the head image for the same reason there is no side images, as the cloth would follow a vertical plain in that area. Whatever the image mechanism was, it SEEMS to have worked in a vertical projection ONLY, hense no side images. The evidence is pretty clear on this and has been agreed upon by most Shroud experts. As for Colin’s new peave on the fact there is no image under the blood, he just can’t accept that it is a FACT, which we have covered before on here and also has been agreed upon by most Shroud experts.\nR\n\n","date":"August 3, 2012 at 8:44 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14444","author":"Ron","site":"shroudstory"},{"title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But.","post":"The URLs provided by Carlos (corneliotel) in the primary posting appear to be a report by the Chambery Poor Clares who mended the burn-holes in 1534.  The extract appears to come from a book written in the French language under the name of Leon Bouchage and published in 1891.  The URLs appear to be an Italian Shroud site, the first PDF is in Italian, the second is an English translation, which makes interesting reading.\nEnglish readers should check: http://www.shroud.it/CLARES.PDF   \nDespite above comments on blood stains, I note that Colin B in a later posting is now claiming that the evidence for no image under the blood stains, appears to be on too tenuous grounds which needs further rigorous confirmation.  This matter needs following up.\n\n","date":"August 3, 2012 at 6:37 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","id":"comment-14439","author":"daveb of wellington nz","site":"shroudstory"}]
