[{"title":"Let’s take a closer look at a subset of bloodstains that STURP says were imprinted before the body image… (Warning: this post is not for those who are convinced of the authenticity of the Shroud of Turin)…","post":"When the shroud was examined at the military academy it was found to be a photo negative on linen and it is a KNOWN FACT that the people of those days DID NOT have the techno savvy to do a fake of this magnitude and intricacy. Man, Animals, plants, mammals, and even microscopic organisms can all kill. NONE OF THEM can put life into total nothingness and NONE OF THEM can bring the design and order we have in the world out of a BIG BANG. I was a Hebrew bloodline boy with our ancestry hidden and politics plus religion were forbidden subjects in our house. I did not even know what they were or referred to. At about six years old, TV was not out yet and no church programs were on the radio. I never heard the words God, church, Jesus, Christ, or any of that. I started having visitations and God told me about these things. I started skiing my mother and she wanted to know where I was getting this from. The voice said, “Don’t tell them you are talking to God or they will put you in an insane asylum.” I kept telling my mother, “I don’t know, I am just curious.” She finally sat me down and told me about our ancestry and my life and that God showed me these things supernaturally because He will call the , now called Jews, Hebrew children home in the last days. I KNOW THERE IS A GOD AND I KNOW WHO AND WHAT HE IS!\n","date":"June 8, 2014 at 5:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/02/lets-take-a-closer-look-at-a-subset-of-bloodstains-that-sturp-says-were-imprinted-before-the-body-image-warning-this-post-is-not-for-those-who-are-convinced-of-the-authenticity-of-the-sh/","cat":"authenticity","id":"comment-4028","author":"Noel Benoist","site":"colinberry"},{"title":"Let’s take a closer look at a subset of bloodstains that STURP says were imprinted before the body image… (Warning: this post is not for those who are convinced of the authenticity of the Shroud of Turin)…","post":"Yes, but if you know your stellar processes you CAN get order out of the Big Bang. It arises in new and/or dying stars when protons and neutrons fuse to make larger nuclei, trapping vast amounts of nuclear energy in the process. It’s the later addition of electrons that creates the self-organizing order, at least at the chemical and biochemical level, because they have to be inserted into strictly quantised energy levels. That’s because the build-up principle gives rise to atoms with different ionization potentials and electronegativity, which in turn gives rise to the 92 or so naturally occurring elements, each with its distinctive chemistry as regards reactivity, valency etc.\nDon’t forget: all one needs to do is to COOL water vapour (withdrawing, not adding energy) and one can create beautiful six-sided snow crystals, no two of them identical we are told. Never underestimate the potential of atoms and molecules to self-organize via electrical interactions, which all goes back to the nature of subatomic particles and the energy arithmetic of stellar processes.\nNow if you were to ask me what is the nature of the pre-Big Bang singularity from which all this order arose via expansion and cooling,  I’d have to confess that I’m stumped for an answer.\n","date":"June 8, 2014 at 6:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/02/lets-take-a-closer-look-at-a-subset-of-bloodstains-that-sturp-says-were-imprinted-before-the-body-image-warning-this-post-is-not-for-those-who-are-convinced-of-the-authenticity-of-the-sh/","cat":"authenticity","id":"comment-4029","author":"colinsberry","site":"colinberry"}]
