[{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"En el individuo normal, sano, la hidroxiprolina sólo se encuentra como trazas en el suero sanguíneo, y en poca mayor cantidad en la orina como hidroxiprolina libre y hidroxiprolina conjugada con péptidos.\n-La hidroxiprolina AUMENTA de manera muy considerable en el suero sanguíneo y en la orina en los INTENSOS ESTIRAMIENTOS MUSCULARES MANTENIDOS, lo que es bien conocido por la MEDICINA DEL DEPORTE.\nCarlos Otal\n\n","date":"April 4, 2013 at 9:32 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29305","author":"escipion","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I am always amased at these discussions about coagulation, since it clearly looks like no physicians ever read them. Had anybody heard about DIC syndrome and what goes on during it? A man subjected to severe torture for hours, being dehydrated and in schock will develop DIC in a couple of hours and there won’t be any need in aditional anticoagulation.\n\n","date":"April 4, 2013 at 9:42 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29308","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"http://www.uptodate.com/contents/pathogenesis-and-etiology-of-disseminated-intravascular-coagulation\nDIC results from a massive activation of the clotting cascade. The major initiating factors are the release or expression of tissue factor, usually involving entry of tissue thromboplastins into the circulation, extensive injury to vascular endothelium exposing tissue factor, or enhanced expression of tissue factor by monocytes in response to endotoxin and various cytokines [4-6]\nTromboplastin release into circulation appears after disruption of endothelium, which in case of even minor trauma is massive.\n\n","date":"April 4, 2013 at 9:48 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29309","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"The other part which is strange that anybody discussing the color of blood stains questions the amount of bilirubin in the blood stream. Clearly, the tortured man will have hemolysis in is blood stream and therefore bilirubin levels are going to be increased, the extent varies individually but it is not going to be traces. Besides, in a shock condition multiorgan failure, including live failure is also a question of when, not if and additional amount of bilirubin, now not from hemolized erythrocytes, but directly from the biliary tree\n\n","date":"April 4, 2013 at 9:55 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29310","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"http://www.treat-nmd.eu/downloads/file/sops/dmd/MDX/DMD_M.1.2_006.pdf\nNow, about the hydroxiproline. It is NOT a rare compound in the body and in certain conditions is actually a marker of certain processes.\nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC3093059/\n\n","date":"April 4, 2013 at 10:03 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29311","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nescipion :En el individuo normal, sano, la hidroxiprolina sólo se encuentra como trazas en el suero sanguíneo, y en poca mayor cantidad en la orina como hidroxiprolina libre y hidroxiprolina conjugada con péptidos.\n-La hidroxiprolina AUMENTA de manera muy considerable en el suero sanguíneo y en la orina en los INTENSOS ESTIRAMIENTOS MUSCULARES MANTENIDOS, lo que es bien conocido por la MEDICINA DEL DEPORTE.\nCarlos Otal\nTHIS :\nIn the normal individual, healthy, hydroxyproline is found only in trace quantities in the blood serum, and in little more hydroxyproline in urine as free and conjugated hydroxyproline peptides.\n-The hydroxyproline increases very significantly in serum and urine in the intense muscle stretching HELD, which is well known to sports medicine.\n\n","date":"April 4, 2013 at 10:33 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29314","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Quote : “I am willing to consider the involvement of other possibilities that involve some type of conversion of chemical bonds, by natural or even supernatural means.”\nI think M. Kearse, as a scientist, should only concentrate on possible natural explanations unless every one of them could be proven to be scientifically wrong in the case of the Shroud.  Presently, we have two very interesting proposal of a natural explanation for the reddish aspect of the blood on the Shroud (the one of Adler concerning bilirubin and the one of Rogers concerning saponaria), so I think the focus of experts should be set on these 2 potential explanations and, truly, more researches under good laboratory control should be done to verify these 2 hypotheses properly.  I don’t see why, at this stage of Shroud science, any credible and honest scientist would have to look for some supernatural explanation concerning this reddish aspect of the blood.  If one day, all the natural explanations are proven wrong concerning the Shroud, then maybe we could go looking for more extravagant explanations, but not now.\nWhy looking for some extraordinary explanations when the solution is most probably related to the extreme tortured state of the Shroud man’s body during the time he was on the cross or to the ancient method of making linen cloths like the Shroud?\nThat’s my opinion.\n\n","date":"April 4, 2013 at 10:44 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29316","author":"Yannick Clément","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Thanks to both of you for your comments.  \nThe significance of DIC syndrome and no need for any additional anticoagulation-not a physician, myself, so others are more appropriate to comment, but is this is reference to enhanced coagulation of the blood relative to seepage from wounds or to the transfer of bloodstains (or both)? \nIncreased amounts of bilirubin, a question of when, not if-okay, but does this effectively translate, together with oxidized hemoglobin, into the reddish appearance of dried bloodstains?    I think that is what most have questioned.\nThe 2 hydroxyproline references in #5 are in relation to measurement in weighing individual muscles (humans) and homogenization of dried lungs (in mice).  Certainly not a rare compound in the body, but was focusing on hydroxyproline levels in the serum-elevated in certain conditions relative to a normal baseline-I thought that the inference that  hydroxyproline being so rare in the bloodstream that it must invoke involvement of connective tissue in animals was a bit much, particularly in relation the use of mass spec.  \nIt is interesting that hydroxyproline increases very significantly in the serum in intense muscle stretching held-do the kinetics indicate this occurs relatively quickly?\n\n","date":"April 4, 2013 at 11:05 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29320","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"DIC an enhanced anticoagulation( there is no coagulation at all – blood sips from any minor scratch) which is an simple and obvious explanation both to leakage from the body and wet staining the cloth. My remarks are caused not only by this article, but the whole bunch of them and ridiculous comments on them.\nMy comment on hydroxiproline is in sync with the first one here( in Spanish) – to assume that human body does not have elevated levels after strenous muscle activity ( try to carry a heavy object in scorching sun, uphill and dehydrated and then talk about traces) is to purposefully omit the obvious pathology of the case. I would bet that rhabdomyolysis would be present as well, with all the biochemical markers present as well.\n\n","date":"April 4, 2013 at 1:59 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29349","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Yannick,\nWe have discussed the issue of natural versus supernatural in the focus of science before, both in forums such as these and in private correspondence.  As you are aware, I believe it is possible for a science professional to check his or her personal beliefs in their back pocket, locked securely, in the analysis of experimental results-the data is the data.\nI mentioned this in the above only as a personal reflection, at the end.  The major focus is on the objective discussion of the science.\nBilirubin and Saponaria are 2 potential explanations that have been put forth to explain the reddish aspect of the blood on the Shroud.  There are others: CO association with hemoglobin, and ultraviolet stimulation to alter the coloration.  Each has their merits, each has their own issues.  No visceral reaction to the mention of ultraviolet-it has been reported that uv stimulation resulted in prolonged appearance of the reddish color, just as it is reported that Saponaria treatment has a similar effect.  Forget any association with theories of image formation, etc. isn’t it an interesting question on its own, what the molecular basis could be for such observations?  Why would hemoglobin, released due to Saponaria treatment, result in the persistence of a reddish color?  What would prevent the hemoglobin from becoming oxidized?  Does uv treatment alter the association/conformation of the heme group with neighboring molecules?  \nI do not really know at “stage of Shroud science” we’re at-the collection of samples was relatively limited by nature, technology has significantly improved over the past several decades-different people, including scientists, have different ways of looking at things, different angles.  I think there still may be much more to be learned. \nThus, I am willing to spend time discussing the science of an idea, even one like the use of leeches in the creation of bloodstains.   For me, it’s creative-it helps to push the scientific discussion beyond simply considering the same viewpoints repeatedly.  The coloration of the bloodstains is an interesting topic on its own-irrespective if one believes it may or may not be related to image formation.  Yannick, for the record, I think there is much, more more in the scientific context that could be discussed, explored before one even begins to approach eventually.  I do appreciate your comments.\n\n","date":"April 4, 2013 at 12:23 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29330","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I’ve often heard about the UV hypothesis but I completely disregard it because, in order to work, this hypothesis needs a miracle (i.e. The Hollywoodish idea of Jesus’ Resurrection of course!) and, truly, calling for a miraculous process like that when you wrote down an hypothesis, this is not what I call “doing good science”. As I said earlier, since there are some very promising natural explanations for the reddish aspect of the blood (the one I prefer is Adler’s explanation concerning the high level of bilirubin), I don’t see why we should look elsewhere (at least, for the moment).  And I truly believe some nice experience could and should be performed right now in order to test Adler and Rogers’ hypotheses properly…\n\n","date":"April 4, 2013 at 4:01 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29375","author":"Yannick Clément","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"” There are others: CO association with hemoglobin”\nWhy would there still be significant CO  associated with hemoglobin ? For hundred years atmosphere surrounding the shroud is almost CO free.\n\n","date":"April 4, 2013 at 4:35 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29386","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Can somebody briefly explain what is the problem with blood coloration? Per photographs the stains look exactly as the blood stains supposed to look.\nSorry for typos in my posts – I am using my phone and they happen\n\n","date":"April 4, 2013 at 2:05 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29352","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"From comment #9 “there is no coagulation at all – blood sips from any minor scratch) which is an simple and obvious explanation both to leakage from the body and wet staining the cloth.” \nForgive, but it’s not that simple & obvious (at least to me-not being medically trained, and being somewhat dense, in general), but I am sincerely interested in your point.  Perhaps a little more patient with your explanation, if possible, I am not that sure what is meant by “no coagulation at all”  This appears to be at odds with the general conclusion that the majority of the bloodstains represents transfer of dried clotted blood.  There’s \nAlso from #9, “My comment on hydroxiproline is in sync with the first one here( in Spanish) – to assume that human body does not have elevated levels after strenous muscle activity ( try to carry a heavy object in scorching sun, uphill and dehydrated and then talk about traces) is to purposefully omit the obvious pathology of the case.”  \nI did translate escipion’s original comment, I got that one, I was just noting the references referred to detection of hydroxyproline in muscle & lungs, not serum.  From the #9, follow up comment, I take it to mean that you are saying that, of course there would be elevated levels of hydroxyproline in the serum of someone that had undergone the events described in the gospel narratives, i.e. Jesus?  Is that correct or did I misconstrue your meaning?  Also, if the sample were from a bloodstain of a non-tortured individual, would the baseline levels of hydroxyproline in the blood be sufficient to detect by such methods?\n#11, I will briefly explain, but it might be best to hear from others as well-the point has been raised that the bloodstains look too much like fresh blood, they appear redder than what is typically observed for aged, dried blood that has undergone oxidation.  This was one of the first issues that caused many to suspect they might have been painted on. \nFinally, I am unclear as to what is meant by “My remarks are caused not only by this article, but the whole bunch of them and ridiculous comments on them.”  What exactly is “the whole bunch?” Are the “ridiculous comments” all of them or just certain ones?  Trying to understand exactly what you mean…\n\n","date":"April 4, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29357","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"“Forgive, but it’s not that simple & obvious (at least to me-not being medically trained,”\nyes it is simple for someone not only medically trained, but someone who has seen and treated DIC syndromes in dozens of patients. I have provided the link to medical review of pathogenesis of the DIC syndrome, and why the blood is simply sipping out without any coagulation is explained there. In brief – DIC at the stage of absence of coagulation factors because of their consumption at the initial stage resembles totally antigoagulated state. There are no factors in palsma and severe thrombocytopenia as well. the new factors are simply not yet synthetized by the body and if DIC is not treated the pt can simply die because f the hemorrhage – from every orifice of the body. The similar picture is observed with acute liver failure – liver is a synthetyc factory of the body and thee coagulation factors are synthetized there – if depleted and not repleted – hemorrhage occurs.\n “From the #9, follow up comment, I take it to mean that you are saying that, of course there would be elevated levels of hydroxyproline in the serum of someone that had undergone the events described in the gospel narratives, i.e. Jesus? Is that correct or did I misconstrue your meaning? Also, if the sample were from a bloodstain of a non-tortured individual, would the baseline levels of hydroxyproline in the blood be sufficient to detect by such methods?”\nYes, the hydroxiproline levels could  be extensively elevated in a severely tortured individual.\nI do not understand what are you asking in the second portion of the question – elevated hydroxiproline levels in a non-tortured individual are possible – in some medical conditions.\nThe problems with interpretation of medical results by non-medically trained public is that they tend to make them absolute. In the reality, medicine is not arythmetic and 2×2 is not always 4, but, depending on a very wiide spectrum of factors, it could be 5,7, 100 or -2.\n\n","date":"April 4, 2013 at 3:06 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29363","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#11, I will briefly explain, but it might be best to hear from others as well-the point has been raised that the bloodstains look too much like fresh blood, they appear redder than what is typically observed for aged, dried blood that has undergone oxidation. This was one of the first issues that caused many to suspect they might have been painted on.”\nOh, so these are also comments not by forensic pathologists, but by a lay public. Well, then I can assure you that they look absolutely like the old blood is supposed to look – at least on the photographs.\n“Finally, I am unclear as to what is meant by “My remarks are caused not only by this article, but the whole bunch of them and ridiculous comments on them.” What exactly is “the whole bunch?” Are the “ridiculous comments” all of them or just certain ones? Trying to understand exactly what you mean…”\nI read all the “blood articles” and the comments on them. Some snarky remarks by someone with a “40 years experience with rats” are the ones I am referring to.\n\n","date":"April 4, 2013 at 3:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29365","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#13-Thank you for the additional info, a couple of quick follow ups:  Regarding DIC and the bloodstains on the Shroud, would you conclude that the body was (significantly) washed before being wrapped in the cloth?  Also, in your opinion, are the majority of Shroud bloodstains consistent with the transfer of moist blood clots?\n#13-“I do not understand what are you asking in the second portion of the question – elevated hydroxiproline levels in a non-tortured individual are possible – in some medical conditions.”\nWhat I was asking here is, in a normal individual, is sufficient hydroxyproline present in blood serum to be detected-even without using techniques with increased sensitivity such as a mass spec.  I can understand, it becomes elevated under certain conditions, but I was referring to a normal baseline-hope that is more clear.\n#14 “Oh, so these are also comments not by forensic pathologists, but by a lay public. Well, then I can assure you that they look absolutely like the old blood is supposed to look – at least on the photographs.”\nI believe that Drs. Bucklin & Zugibe would qualify here as experienced forensic professionals, and include other specialists as well-I wouldn’t say that the comments originate from the lay public.  Is it your own opinion then that nothing appears that unusual because they don’t appear (overly) red or that many older bloodstains also exhibit a reddish appearance, even with prolonged time?    \n#14 “I read all the “blood articles” and the comments on them. Some snarky remarks by someone with a “40 years experience with rats” are the ones I am referring to.”\nOkay, I understand-I’m not interested in drudging up any snarky remarks-according to the Way of Brother Hirudo: Artic.1,15ii, such remarks take the focus off of the science.\nSounds as though you have a lot of experience which would be a great help to those interested in these and related questions-Thank you for your input.\n\n","date":"April 4, 2013 at 4:04 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29377","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#13-Thank you for the additional info, a couple of quick follow ups: Regarding DIC and the bloodstains on the Shroud, would you conclude that the body was (significantly) washed before being wrapped in the cloth? Also, in your opinion, are the majority of Shroud bloodstains consistent with the transfer of moist blood clots?\nI did not do the extensive research on the Shroud’s blood stains – even by literature available, so I can not answer that particular question,\n It simply caught my eye that somebody was sniffing off the possibility of wet staining the cloth because the blood should have been dried. The person making those remarks clearly have nothing to do neither with research, nor with clinical medicine.\nUpon reading remarks and articles it became clear that people exchanging views really do not have critical care medicine background, otherwise those remarks would not be possible.\n\n","date":"April 4, 2013 at 4:13 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29379","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"What I was asking here is, in a normal individual, is sufficient hydroxyproline present in blood serum to be detected-even without using techniques with increased sensitivity such as a mass spec. I can understand, it becomes elevated under certain conditions, but I was referring to a normal baseline-hope that is more clear.\nOf course. There are plenty of hydroxyproline assay kits available on a market – both for serum and urine measurement.\nHydroxyproline is produced by hydroxylation of the amino acid proline by the enzyme prolyl hydroxylase following protein synthesis (as a post-translational modification).\nHydroxyproline is a major component of the protein collagen.\nProline hydroxylation requires ascorbic acid (vitamin C). The most obvious, first effects (gingival and hair problems) of absence of ascorbic acid in humans come from the resulting defect in hydroxylation of proline residues of collagen, with reduced stability of the collagen molecule, causing scurvy.\nIncreased serum and urine levels of hydroxyproline have also been demonstrated in Paget’s disease.\n\n","date":"April 4, 2013 at 4:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29381","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I believe that Drs. Bucklin & Zugibe would qualify here as experienced forensic professionals, and include other specialists as well-I wouldn’t say that the comments originate from the lay public. Is it your own opinion then that nothing appears that unusual because they don’t appear (overly) red or that many older bloodstains also exhibit a reddish appearance, even with prolonged time? \nDid Dr. Bucklin and Zugibe question the looks of the blood stains?\nBlood stains color depends on a plethora of factors – including the material they stain, the conditions they have been through and the contaminations they have been subjected upon.\nThe original state of the human body is the least important in appearance.\nThose are the basics of forensic pathology, but if you insist, I may dig into specific literature.\nI am just interested who and when posed the question of too red, or too dark, or whatever, considering the color. Blood stains could be from bright red to almost black, depending on the above mentioned factors. Clotted blood differs form hemolized blood and so on.\n\n","date":"April 4, 2013 at 4:23 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29382","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Sounds as though you have a lot of experience which would be a great help to those interested in these and related questions-Thank you for your input.\nThank you. I am a physician and I have worked in critical care medicine a lot.\n\n","date":"April 4, 2013 at 4:24 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29383","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"About disseminated intravascular coagulation :\n https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/\nObviously, DIC has been suggested for a while.\n\n","date":"April 4, 2013 at 5:04 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29393","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"From #11, Yannick, I’m not talking about uv and Hollywood.  I’m just talking about the report that uv treatment can result in the persistence of red color in bloodstains relative to those that are untreated.  I find this interesting, on its own, apart from any connection to the Shroud.  UV treatment of blood is reported to be a (not-well) understood therapy to “boost the immune system”-it may have an effect just because of the succeptibility of bacteria & viruses to such treatment, similar to treating water in a laboratory setting with uv exposure.  Some have wondered about other (deleterious) side-effects where blood is concerned, what else might be affected.  A color change, if true, would indicate that the blood components themselves may have been altered.\nThe uv hypothesis didn’t originate with me-I included it because I try to give fair audience to all suggestions that have been made.  Not to violate the Way of Brother Hirudo, but such constant preaching about what being a “good honest scientist” is all about becomes rather stale.  \nThere have also been suggestions from (more earlier writings) that the color of the bloodstains may vary according to the light source, artificial lighting versus out of doors.  That could be an interesting question to consider, how might the type of light used influence the perception of the bloodstain color-for those that have not observed the Shroud up close, in person, our perception is based on different photographic representations-could this be a variable or is it insignificant?  Some “good science”/interesting questions might be in there somewhere, without the need to go Hollywood and say “Lights…”; okay let’s try again…”Lights, Camera, Action…”\n\n","date":"April 4, 2013 at 4:56 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29389","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"All I know is that, mysterious image or not, I don’t know any good, honest and, more than anything else, religiously unbiased scientist who would even think about any miraculous process when it comes to analysing an ancient burial cloth like the Shroud, while making sure he makes a full evaluation of all the possible natural process that can explain the reddish aspect of the blood or the presence of the image at the surface of the cloth.\nP.S. :  I never wrote these comments to accuse you of being a bad, dishonest and religiously biased scientist.  But I found your replies to me kind of bizarre because it tend to show that you thought I attacked you, which can be taken as meaning that, effectively, you could fit into the “bad” category of scientists I described and who do Shroud researches while thinking that the image (and maybe also the reddish color of the blood) probably came from the Resurrection.  I hope my perception is wrong here.\n\n","date":"April 4, 2013 at 5:08 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29394","author":"Yannick Clément","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"“ASSESSED URINARY LEVELS OF HYDROXYPROLINE 24, 48 AND 72 HOURS AFTER MAXIMAL STRECHING EXERCISE”. Rafaella.Bauerfeldt1.Antonio J.Luque Rubia2 José Villegas García…y otros.\nThe purpose of this study was to investigate the degree of catabolism of collagen as measured by levels of urinary excretion of hydroxyproline (HP) after static stretching exercise.\nStudy participants were 37 firefighters from the 1st GMAR of the State of Rio de Janeiro of the male gender, who are doing regular physical training, = + 29 years old, divided into two groups: control group (n = 17) which has not undergone any type of intervention and the experimental group (n = 20) which was submitted to static stretching exercise. As a methodological procedure was performed 4 urine samples for each individual.\nThe first collection was performed before the procedure to verify the level of HP as reference of the sample group (basal). The second, third and fourth collections were performed 24h, 48h and 72 hours after stretching static, with a fasting of 12 hours before sampling. For the determination of urinary levels of HP,was used ClinRep (complete kit for hydroxyproline in urine) by the method colorimetric. The results found on the levels of HP: Δ basal-24h=1,99 mg/24h. ; Δ 24h-48h= 9,01 mg/24h ; Δ 48h-72h= – 9,90 mg/24h e Δ Basal-72h= 1,09 mg/24h.\nFor the results it is concluded that there was a difference in the concentrations of HP between the baseline and 24h (p = 0,001 <0.05), with a significant increase in 48h (p = 0,001  0.05), matching it to the original level of the basal time, thereby\ndetermining that HP may be a biochemical index in the process of tissue repair and remodeling after exercise.\n—————————————————————————————————————–\nMi mal inglés no me permite seguir con “claridad” varios aspectos del debate.\nEn Jesús se daban todas las circunstancias que hacían posible un DIC,no he tenido acceso al trabajo de Bergeron que debe ser interesante:\n-Bergeron JW (2011).The crucifixion of Jesus Review of hypothesized mechanisms of death and implications of shock and trauma-induced coagulopathy. J. Forensic Legal Med.19, (3):113-116.\nAdemás de todo ello, con DIC o sin DIC, es muy posible que la CELULOSA del lino haya jugado un muy importante papel como “factor de coagulación”:\n-Másová L, Rysavá J, Krízová P, Suttnar J, Salaj P, Dyr JE, Homola J, Dostálek J, Myska K, & Pecka M (2003). Hemostyptic effect of oxidized cellulose on blood platelets. Sbornik lekarsky, 104 (2), 231-6 PMID: 14577133\n-Krízová P, Másová L, Suttnar J, Salaj P, Dyr JE, Homola J, & Pecka M (2007). The influence of intrinsic coagulation pathway on blood platelets activation by oxidized cellulose. Journal of biomedical materials research. Part A, 82 (2), 274-80 PMID: 17274026\nCarlos Otal\n\n","date":"April 4, 2013 at 5:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29397","author":"corneliotel","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#24 Yannick, I never took your remarks as a personal attack.  It is not my place to comment on whether or not I am a good scientist, to paraphrase Groucho Marx, “I wouldn’t even think of joining a club that would even consider having me as a member”.  I just try to maintain an objective approach and keep my mind open to the ideas of others.  Not directed specifically at you, but it does bother me to see certain scientists “attacked” or “semi-attacked”, I view as more as disrespected, because they are accused of being religiously biased-the irony is, without their efforts it is unclear that the concerted effort to scientifically examine the Shroud would have begun (and continued) in the first place.  But anyway, back to our own discussion, I do value your opinion.  I might suggest that you try not to be so threatened by any mention of the R word.  It’s the Shroud, I think it goes with the territory.  If the science is bogus and strictly made-to-fit, agenda driven, I believe this will be sorted out.  Alternatively, there is the bushwhack method, to head it off before it starts.  \nA final comment, consideration of an idea should not automatically be viewed as acceptance.  For example, if one believes that the red coloration of the bloodstains is due to some energetic resurrection event, involving some form of let’s say, uv, is it possible that the blood color might exhibit a type of gradient effect, the surfaces of the fibers on the body side of the cloth more red than those on the reverse side of the cloth?  Comparing the bloodstains on one side versus the other side, photo’d during the restoration, they don’t appear that different in terms of tone to me, although a spectrophotometric (mechanical) measurement is more objective (scientific).  One could argue that the energetic effect permeates (saturates) I suppose, but I think it’s reasonable that distance might attenuate the effect.  If bilirubin, Saponaria, CO, etc. one might expect the color to be unchanged on one side versus the other.  Which also raises the point about this being blood attached to a cloth-different sides-different histories , could this itself function as a variable in the coloration?\n\n","date":"April 4, 2013 at 6:33 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29401","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Mr. Kearse, I love your reasoning concerning the fact that the blood on the Shroud show the same reddish aspect on both sides (I agree that a spectrophotometric comparative analysis is needed to be completely sure of this, but the blood sure appear to be of the same tonality on both sides) and, because of that, I really think the supernatural hypothesis concerning UV light must, in all logic, be completely discarded, for the simple and logical reason that a flash of UV light would have only affected only the bloodstains located on the inner part of the cloth (the one that was in direct contact with the corpse).  THIS IS PURE RATIONAL THINKING!  The answer must reside in the extreme tortured state of the Shroud man and/or in the ancient technique of manufacturing linen cloth that was used.  Truly, in face of all the data and observation we know from the Shroud examination of 1978, I don’t see any other possibilities than these ones right now in order to find the correct explanation for this “mystery”.\n\n","date":"April 5, 2013 at 10:55 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29493","author":"Yannick Clément","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Kelly Kearse, what is the problem with reddish coloration of the stains? Blood stains have variations in color appearance, it has nothing to do with supernatural effects, more with the material where the stains are and the conditions they have been through, including temperature, humidity, sun exposure, heat exposure and so on and so on.\nCan you, please, provide the initial source of doubts of the coloring of the blood stains?\nBeing bright red is not abnormal. It is one of the variations of the normal blood stains.\n\n","date":"April 4, 2013 at 6:47 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29402","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"http://www.iabpa.org/uploads/files/iabpa%20publications/March%202010%20News.pdf\neven by brief scrolling of the text it is clearly visible the difference in color of different stains – and ALL are blood\n\n","date":"April 4, 2013 at 6:50 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29403","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Jesterof, hang in there, I am responding.\nHad to eat!  But I am back!   \nI can accept it nothing to do with supernatural effects, no problem at all there\nTrying to put together a few references for you…\n\n","date":"April 4, 2013 at 6:55 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29405","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"http://books.google.com/books?id=aM6hNdjHRSgC&pg=PA1&lpg=PA1&dq=evaluation+of+the+color+of+blood+stains+in+forensic+pathology&source=bl&ots=NPzQm98zRU&sig=Obf2yImGKBP3grdXYTHQKJ2bC94&hl=en&sa=X&ei=HwReUaukH5O68wTi5YDgDA&ved=0CJICEOgBMBk#v=onepage&q=evaluation%20of%20the%20color%20of%20blood%20stains%20in%20forensic%20pathology&f=false\nthat;s the whole textbook on forensic bloodstain pattern analysis.\nEnjoy\n\n","date":"April 4, 2013 at 6:55 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29406","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\nJesterof, hang in there, I am responding.\nHad to eat!  But I am back!\nI can accept it nothing to do with supernatural effects, no problem at all there\nTrying to put together a few references for you…\n\nbon apetite\nI will return in an hour – now I have to go :)\n\n","date":"April 4, 2013 at 6:57 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29407","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Jesterof,\nHere are a few:\n1. THE THIRD DALLAS INTERNATIONAL CONFERENCE\nON THE SHROUD OF TURIN: DALLAS, TEXAS, SEPTEMBER 8-11, 2005\nEVIDENCES FOR TESTING HYPOTHESES\nABOUT THE BODY IMAGE FORMATION OF\nTHE TURIN SHROUD\nGiulio Fanti1, Barrie Schwortz2, August Accetta3, José A. Botella4, Berns J. Buenaobra5,\nManuel Carreira6, Frank Cheng7, Fabio Crosilla8, R. Dinegar9, Helmut Felzmann10, Bob\nHaroldsen11, Piero Iacazio12, Francesco Lattarulo13, Giovanni Novelli14, Joe Marino15,\nAlessandro Malantrucco16, Paul Maloney17, Daniel Porter18, Bruno Pozzetto19, Ray\nSchneider20, Niels Svensson21, Traudl Wally22, Alan D. Whanger23, Frederick Zugibe24\nfind at: http://www.shroud.com/pdfs/docslist.pdf\nB52) The maintenance of the red bright color of the TS blood with time was observed, but the explanation of why the color is so red is not definitive (Brillante 2002)\n2. From N. Svensson’s (MD) 2012 article, “Medical and forensic aspects of the Man depicted on the Shroud”, pg 4 “It is well known, that blood darkens from red to black in few days due to oxidation process.  Shroud researchers have long wondered why the TSM blood is still red bearing in mind the TS assumed age of 2000 years”\n3. Zugibe, chief medical examiner of Rockland County, NY (1969-2003) discusses the color of the blood in his book on pg. 216.  “A question often asked is why are the blood areas that are incarnadine in color like that of fresh blood rather than a reddish-brown color of old blood?”  He then goes on to mention Saponaria, Adler’s hemolysis (bilirubin), and that others have suggested the effect of bacterial action.  Adler was not a pathologist, but a bench scientist, porphyrin specialist, who discusses the red color of blood in many of his writings.  Zugibe and Adler were contemporaries-I have never read where Zugibe challenged that the red color was ordinary, normal-the above would seem the place to mention it.  He is also a co-author (#24) on the above paper.\n4. I am unable to find mention of Bucklin discussing the color-his analyses may have been restricted to more anatomical details-I stand corrected on that, although others may have heard him discuss the blood coloration-I am relatively new in the Shroud crowd, particularly in regard to when regular symposia where held.\n5. Pierluigi Baima Bollone is an Italian pathologist who has examined the Shroud in person and was involved in the studies beginning in the late 70s commented that the “stains that surely are bloodstains stand out on the monochrome background of the towel for their carmine color”.  He postulated that the existence of a very high amount of bilirubin in the Shroud’s bloodstains could explain the red bright color of the bloodstains, even if this colour is not directly due to the bilirubin.  He suggested that CO binding to hemoglobin, produced during the breakdown of hemoglobin to bilirubin, may be responsible for the red bright color.\n6. In a different type of reference, apart from the Shroud crowd, Dr. Bill Bass, co-author of the book “The Inquisitor’s Key” a historical fiction novel involving the Shroud of Turin, writes on the opening pages of Chapter 14, “…the so-called bloodstains.  That would explain why those are bright red”…”Since when is dried blood cherry red?  Every death scene I see, dried blood’s almost black.  Right”.  As mentioned the book is a fictional work, but this is mentioned in interviews to publicize the book as one of the criticisms-Dr Bass is the creator of the world renowned Body Farm and is recognized as an international expert in forensic science and anthropology.\n7. I know that the red color of the blood was a major obstacle for Barrie Schwortz, the documenting photographer of the STURP team-he often mentions this in interviews, stating that it took around 18 years for him to this issue to be resolved for his own satisfaction-he could probably relate conversations with individuals, including Dr. Bucklin, better than anyone, certainly much more so than me.\n8. I do not know if the idea was voiced originally by Barbet & Vignon, I did a quick scan through their books, but didn’t see specific mention of reference to an unusual coloring, although I might have overlooked this.\nA few closing remarks, when I first looked at the bloodstains, to me, they appeared much redder than typical dried blood, just in my own, everyday typical experience-I worked with a lot of mice in the laboratory, and a certain number of rabbits, and even a few rats, but was more interested in what was in the blood, rather than examining the discarded material.  Thank you again for input.  When I first became interested in the question I searched the internet for pictures of old, dried blood, JFK, Lincoln, Mayan artifacts, most anything I could find-most looked brownish to me-I also e-mailed numerous forensic scientists/pathologists asking for any comments they may have-a number did not respond, perhaps they were busy, perhaps it was the Shroud effect (although I never mentioned this was the particular situation it is not difficult to guess with a quick internet search).  On the other hand, I have received a number of helpful replies, particularly in relation to hemoglobin chemistry, (de)oxygenation bilirubin levels in blood, etc., but you are the first to directly address that the coloration of bloodstains may not be that out of the ordinary.  Yannick, if you’re reading this, I haven’t (as of today) written any pastors or priests for their input  :)    \nI haven’t looked at the bloodstained reference you linked, but I will be interested in doing so.  Again, Thank you for your input.\n\n","date":"April 4, 2013 at 7:47 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29411","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Did a quick look of the links, thanks, I look forward to going through this more closely.  I appreciate it.  I wrote to the senior author of the whole textbook in the 2nd link several months back, but was unable to receive a reply.  Thank again.\n\n","date":"April 4, 2013 at 7:54 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29412","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Thank you, Kelly for an extensive reply. The photographs I have seen of the Shroud and the stains do not look out of ordinary, at least not for somebody who works in the operating room and in the ICU and sees blood stains all the time – of all possible hues of red. Some of the blood , even dried is never black as in one of your quotes is suggested. Some dry on tissues and remain red, bright red. If there is addition of mucous material to the blood, it will never darken even to brown.\nIn medical school I have also had a year of forensic pathology course ( I was very interested in that area at some point, but ended up treating alive people, not analyzing their remains) and from that course and later from experience and extensive exposure to all types of body fluids I can attest that blood stains are very different in their colors, blood stains are not always made by the whole blood as one imagines when they have the blood drawn for the blood samples. Diluted or hemolyzed blood, will stain in one color, severe bilubinemia might add additional hue, methemoglobinemia as carboxyhemoglobinemia are definetely different and so on. But the most important is the material stained, since the medium of the material might act as a stabilizer, fixator or reducer of a kind – chemical reactions of blood contents and contents of the stained material can also make the color different or more persistent.\nSince the Shroud has been under severe fire at least twice – the amount of CO potentially reacting with the stains or any other chemicals in fumes potentially can reduce already oxidized material of the heme and change the color.\nWe can not compare the color from before the fire and after the first fire, but it is certainly possible with the 1997 fire.\nThis is just my speculation from the top of my head.\nTo put it simply – I find differences in colors of blood stains not to be of any particular interest, since variations are very wide and that could even be seen on the photos I’ve provided in my links.\n\n","date":"April 4, 2013 at 8:31 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29414","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"jesterof,\nThank you. I appreciate the discussion and your comments.\n\n","date":"April 4, 2013 at 8:35 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29415","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#12 ” There are others: CO association with hemoglobin”\nWhy would there still be significant CO associated with hemoglobin ? For hundred years atmosphere surrounding the shroud is almost CO free.\nAnoxie, \nThe CO:hemoglobin suggestion is from Baima Ballone (2001), The basis behind it is that since CO is a product of hemoglobin breakdown, and CO binds to hemoglobin with 200x the affinity as does oxygen, the CO remains bound to hemoglobin in the bloodstream, and hence the bloodstains.  CO associated with hemoglobin maintains a red color-this is one of the indicators of CO poisoning.  CO-containing blood can stay red for over a year if teh tube remains covered (see below comment)\nThe spectra data of Adler suggests primarily methemoglobin (deoxygenated hemoglobin) although he does mention that other species may exist-carboxyhemoglobin has a different absorbance than methemoglobin and doesn’t appear to be there to any major extent, although I am by no means very experienced with spectroscopy.  Also, in communicating with those who study hemoglobin binding, they estimate that even though CO binding has a much higher affinity than oxygen, such blood would exchange out within a few days at the most when exposed to the atmosphere.\nAlthough not mentioned by Bollone, CO binding to the free heme group (separated from the hemoglobin polypeptide) has an affinity 20,000x greater than oxygen-it is unknown by me (or several whom I have contacted) if this is superglued in or given in would exchange as well.  I do not know, but believe it is not permanently affixed.  There would also be the problem of just how many hemoglobin molecules/heme groups would have to be saturated to result in an overall reddish appearance of the blood relative to oxidized species.  Just a thought.   \nRelated to this, I had also considered that a functional group on the cloth may interact with the porphyrin ring, a CO group, such as a carbonyl group, which are prevalent in carbohydrates (glycan coating as a result of Saponaria), but the structural biologists tell me the electron imprint would appear much different to the hemoglobin molecule than carbon monoxide.  Just another thought. \nSo, you’re right in asking why would there be significant CO associated with hemoglobin-it was just one of the suggestions that was proposed (in 2001) to account for the color, originally by BB.\n\n","date":"April 4, 2013 at 8:57 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29416","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"You are very welcome, Kelly\nhere are some more pictures to show what I mean by the staining material and differences in color :http://shs.westport.k12.ct.us/forensics/08-blood/bloodstains.htm\nthose flashcards are almost perfect in describing how and why color may differ:\nhttp://www.slideshare.net/rolfok/ageing-bloodstains\nthere are plenty of links on google if one types” color of blood stains in forensic analysis” or similar word combinations.\n\n","date":"April 4, 2013 at 9:02 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29419","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Although not mentioned by Bollone, CO binding to the free heme group (separated from the hemoglobin polypeptide) has an affinity 20,000x greater than oxygen-it is unknown by me (or several whom I have contacted) if this is superglued in or given in would exchange as well. I do not know, but believe it is not permanently affixed.\nIt is. To displace it in a human body, one needs to put the patient which is poisoned by CO inhalation in a barometric chamber so the patient can breathe oxygen under increased pressure to displace CO-Hb and  for a prolonged period of time.\n\n","date":"April 4, 2013 at 9:10 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29420","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"You need a barometric chamber… Or just time, it takes longer, but under ambient atmosphere, o2 displace CO-Hb.\n\n","date":"April 5, 2013 at 12:18 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29439","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"the treatment is called hyper-barometric oxygenation\n\n","date":"April 4, 2013 at 9:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29421","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"http://hbotnm.com/articles/CONeurologicalResearch.pdf\n\n","date":"April 4, 2013 at 9:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29422","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#37-Thanks, I also tried to contact the author of the 2nd link several months ago, was unable to do so successfully; flashcard 13/27 looks like the typical red to brown change in the color of aged bloodstains; this is mostly what I have run across when googling phrases like blood stains in forensic analysis, but will keep looking.\nI do appreciate the point abound staining material and how this may influence color.\n#38-40\nAm familiar with hyper-barometric treatment; had a friend in grad school that was treated in a chamber for a time-of course we all asked him if he had been under a lot of pressure lately…\nRegarding the permanent affixation of CO-Hb, several of the hemoglobin structural investigators that I have corresponded with ensure me that CO is label in iron hemes and will be replaced by oxygen if not kept under a partial pressure of CO.  Once bloodstains are exposed to air, CO should readily exchange with the oxygen molecule.  CO may have a higher equilibrium constant, but the CO concentration in air is extremely low.  \nThe superglue comment was more directed at CO binding to free heme relative to a bloodstain, not really CO within the body; those I have corresponded with indicate that free heme tends to aggregate; aggregated material doesn’t produce a red color.  Interestingly, the red color don’t occur only when heme is bound to a protein-if ligands are in place on either side of the iron, which also prevents, aggregation, the red color persists.  This was the idea related to the thought that something may be able to mimic CO binding to the porphyrin ring, with sufficient affinity to result in a red(dish) appearance. \n#41-mine-going to bed!\nThanks again\n\n","date":"April 4, 2013 at 10:22 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29431","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"CO? Don’t overlook anaerobically-produced nitrites and/or gaseous NO within leeches, and their likely curing effect on haem-bound iron, as in bacon curing.\n\n","date":"April 5, 2013 at 2:39 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29443","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"With the greatest respect for all you blood specialists, but don’t we need archaeological pathologists here? We’re not observing blood which is a few weeks or even a few years old, but (unless it has been touched up) some 700 or even 2000 years old. Has anybody reading this blog had access to bloodstains on battlefield relics (for example) of genuine antiquity? I’ve been trying to find out who first claimed that the stains were “too red” to be real blood – possibly Walter McCrone – without success, but several observers of the shroud itself, rather than photographs, describe them as looking “fresh” which would be unlikely for ancient blood, I think.\nI have never seen the shroud itself, but do think that almost every photo I have ever seen, including the excellent shroudscope, misrepresents both the colours and contrast of the actual material, so that perceptions of colour, however professional, from photos alone are likely to be unreliable. Those who have observed it sometimes remark how the bloodstains appear to change colour according to whether it is inside or outside, or lit by various different light sources.\n\n","date":"April 5, 2013 at 5:39 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29464","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#44\nI quick reply before heading out of the door\nHugh,\nYes-I couldn’t agree more.  See end of comment 23-it’s a younger period, but in looking around, I viewed as many Civil War relics (bloodstained uniforms), I could find.  The most relevant comparisons are made/discussed regarding older (ancient) blood.  \nI also agree with the comment regarding perceptions of color-see end of comment 32-it would be interesting to hear Barrie’s thoughts on light effects, photographic reproduction, etc. -he would be dialed in on this better than anyone.\nPersonally speaking, I don’t consider myself a blood specialist-my main focus/experience in the laboratory was on the white blood cell portion of the blood, particularly the cell biology of lymphocytes.\n\n","date":"April 5, 2013 at 6:25 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29468","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#43\nColin,\nOkay, we’ll add those to the list-\ngotta run!\n\n","date":"April 5, 2013 at 6:27 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29469","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I’ve been Googling… Enter “Charles I” and “Vest”, and you will be presented with an array of photos of a garment held at the Museum of London, reputedly worn by King Charles I at his execution (1649), and reputedly stained with his blood. What is interesting is how differently the ‘bloodstains’ show up on the photos. I had to examine some of them really closely just to check that they were of the same garment. It is even differently described as blue or green by different observers. Also interesting is the comment that attempts to prove the stains in the 1980s are described as ‘inconclusive.’\n\n","date":"April 5, 2013 at 7:09 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29473","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nHugh Farey :\nWith the greatest respect for all you blood specialists, but don’t we need archaeological pathologists here? We’re not observing blood which is a few weeks or even a few years old, but (unless it has been touched up) some 700 or even 2000 years old. Has anybody reading this blog had access to bloodstains on battlefield relics (for example) of genuine antiquity? I’ve been trying to find out who first claimed that the stains were “too red” to be real blood – possibly Walter McCrone – without success, but several observers of the shroud itself, rather than photographs, describe them as looking “fresh” which would be unlikely for ancient blood, I think.\nI have never seen the shroud itself, but do think that almost every photo I have ever seen, including the excellent shroudscope, misrepresents both the colours and contrast of the actual material, so that perceptions of colour, however professional, from photos alone are likely to be unreliable. Those who have observed it sometimes remark how the bloodstains appear to change colour according to whether it is inside or outside, or lit by various different light sources.\n\nwe do need a lot of different specialists because it is not a one plane issue. One must also take into account that in any amount of time any relic could be exposed to difference in maintenance, therefore what was subjectively observed ( referrence to the colors) 20 years ago might not be the same as 100, or 2000 years ago.\nAnd, BTW, maybe Walter McCrone is just a daltonist ?\n\n","date":"April 5, 2013 at 11:17 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29498","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"All right, genteleman, it looks like the issue of “color too bright” is a totally subjective interpretation of ONE man under unknown physical conditions, but with a very well known psychological bias, so what are we all discussing?\n\n","date":"April 5, 2013 at 11:19 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29499","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Molecular basis for red blood.\n\n","date":"April 5, 2013 at 11:40 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29503","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Yes, there has to be a molecular basis for the <a href = \"http://shroudofturinwithoutallthehype.files.wordpress.com/2012/07/blood-flakes-shroud-turin1.jpg?w=640&quot; carmine colour of Shroud blood scrapings. It is more than just a trick of the light.\n\n","date":"April 5, 2013 at 12:12 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29508","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"And what the heck is that?\n\n","date":"April 5, 2013 at 2:38 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29525","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Which molecules are you discussing? NaCl?\n\n","date":"April 5, 2013 at 2:42 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29526","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Hello goodbye.\n\n","date":"April 5, 2013 at 2:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29527","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"jesterhof, that red splodge of stuff was observed on one of the sticky tape samples taken off the shroud in 1978. I imagine Colin referenced it to give you an idea of quite how red the red stuff is. Of course, its a photo, with all the limitations referred to, and it might be iron oxide, or vermilion, or cochineal, or whatever, but it is clearly something. Do you still think it’s “normal” blood?\n\n","date":"April 5, 2013 at 4:55 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29537","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"bye-bye\n\n","date":"April 5, 2013 at 4:55 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29538","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nHugh Farey :\njesterhof, that red splodge of stuff was observed on one of the sticky tape samples taken off the shroud in 1978. I imagine Colin referenced it to give you an idea of quite how\nred the red stuff is. Of course, its a photo, with all the limitations referred to, and it might be iron oxide, or vermilion, or cochineal, or whatever, but it is clearly something. Do you still think it’s “normal” blood?\n\nthe problem is – it is a PHOTOGRAPH with specific light on it. And it is actually a mirror image, so to say, not the original. There is nothing to discuss – for me those photos look like blood stains, for him they look suspicious.\nBoth are totally EQUAL subjective OPINIONS.\nNeither of us here has seen the stains in a daylight on the original.\nSo all we are discussing is subjective opinions.\nThose are very far away from any resemblance of scientific discussion.\n\n","date":"April 5, 2013 at 5:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29541","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"yes, it is normal blood. One of the variations.\n\n","date":"April 5, 2013 at 5:20 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29543","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"and, btw, there is a very clear light interference on that photograph\n\n","date":"April 5, 2013 at 5:22 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29544","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#50   All right, genteleman, it looks like the issue of “color too bright” is a totally subjective interpretation of ONE man under unknown physical conditions, but with a very well known psychological bias, so what are we all discussing?\nThis ONE man being McCrone?\nand is it really just one man?\nDid the idea really originate form McCrone?\nMcCrone never examined the cloth in person; Baima Bollone preceded him, has examined the cloth in person and also noted the carmine color.\nDr. Curto, Turin Museum of Egyptology-I am not exactly sure of the timeline, but believed this may have been around the time of the 1976 Commission Report said “Darker, brownish marks on the body represent the trickle of blood or serum issuing from the wounds; we can also pick out two traces of crimson, simulating trickles of blood-which, however, would have turned brown when dry [if they had been blood].  Therefore these marks must certainly have been added later and deliberately”-this is from McCrone’s book, p. 15\nfrom p. 85 of Ian Wilson’s book The Blood and the Shroud, as we have remarked earlier, the very colour of the bloodflows as they appear on the Shroud proper (as distinct from the negative, where they all appear white), raises some very justifiable suspicions.  We all know that if we cut a finger and tie a handkerchief around it, the initial vivid red of the fresh blood will rapidly change to a dull brown, usually within a few hours.  Yet at long ago as the early sixteenth century one Antoine de Lalaing deescribed the Shroud bloodstains as ‘clear as if they had been made today’. Vignon, viewing the Shroud the 1930s, described the colour as mauve carmine”.\nHe goes on to add, “Whatever interpretation one makes of them, I would readily endorse both of these descriptions.  In the course of my own viewing of the Shroud in November 1973, I was present on occasions when the television lights were both on and off.  When the lights were switched off and the room where the Shroud was displayed remained in what may be best described as subdued interior daylight conditions, colour-wise the blood marks appeared much different than the body image.  When they were switched on the bloodstains took on a very distinctive ‘clean’ mauve-carmine color…”\nThe description of the color parallels exactly the phrasing of Vignon, one can interpret that in different ways I suppose, influence or best describes it/agrees.\nWherever the idea originated, even if it was the opinion of just one person, would that bias influence/permeate the many who have observed the Shroud in person or studied bloodstained fibers taken from it?  Does it stand to reason that someone (medically trained as some of those listed in #33), have said wait a minute, this red color is not that out of the ordinary?\n\n","date":"April 5, 2013 at 5:31 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29546","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Alan D.Adler was one of STURP’s top chemists, a porphyrin specialist, someone who could be relied upon to recognize a red colour that was simply too bright to be aged blood. Adler knew about meth(a)emoglobins and other oxidised haems, he knew about the crucial importance of the precise electronic configuration of the iron centre to properties like colour, uv/visible spectra, fluoresence etc. What’s more he reported the isolated porphyrin to have an aytpical spectrum. So what did he do? Say it was just a trick of the light, a artefact of photography? No, he was so taken  with the various anomalies that he felt obliged to propose new chemistry to explain his findings – namely that novel association between methaemoglobin and bilirubin that would account for those eternally red bright bloodstains.\nYet as soon as one dismisses Adler’s creative chemistry, and substitutes what one believes is more conventional chemistry – what happens? Folk pile in to deny the existence of the very effect that so preoccupied Adler. No, there’s nothing unusually red about the blood, they say, it’s all a figment of your imagination, and Adler is conveniently forgotten in the rush to repel the new threat, to retreat to a new defensive position.\nFor blood to have retained its bright red colour, one can reasonably assume that the iron centre has been retained at the centre of haem, probably as oxidized iron (III) in place of the original iron (II), but with a new electron donor or donors bonded onto the iron, maintaining its electron configuration in the form that keeps it bright red. Quite what the new donors might be is anyone’s guess. Carbon monoxide has been suggested, but I’m inclined to think it might be nitrite ion, NO2-,  or nitrogen monoxide (NO, a stable free radical). The first of those is responsible for giving ham and bacon and other cured meats their stable long-lived pink colour, so it’s possible a similar kind of chemistry might operate between aged haems and decomposition products  say of the arginine in globins. Where would this take place? Inside a leech of course, which is where one of us came in…\n\n","date":"April 5, 2013 at 6:04 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29550","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"jesterof,  would also be interested in your opinion, having examined numerous bloodstains, do you believe they could have been painted on, using human blood?\n\n","date":"April 5, 2013 at 5:34 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29547","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#48, Hugh I googled about Charles I and the vest-on the greyish garment, does make the color(s) difficult to distinguish.  I saw a few mentions where DNA testing was to be performed in 2010 to evaluate the identity, but didn’t run across any conclusions from this/more recent mentions.\n\n","date":"April 5, 2013 at 5:39 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29549","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\njesterof,  would also be interested in your opinion, having examined numerous bloodstains, do you believe they could have been painted on, using human blood?\n\nare you asking in general or specifically about the Shroud? In general – anything is possible. With the Shroud – I don’t know.\n\n","date":"April 5, 2013 at 6:46 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29557","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n#50   All right, genteleman, it looks like the issue of “color too bright” is a totally subjective interpretation of ONE man under unknown physical conditions, but with a very\nwell known psychological bias, so what are we all discussing?\nThis ONE man being McCrone?\nand is it really just one man?\nDid the idea really originate form McCrone?\nMcCrone never examined the cloth in person; Baima Bollone preceded him, has examined the cloth in person and also noted the carmine color.\nDr. Curto, Turin Museum of Egyptology-I am not exactly sure of the timeline, but believed this may have been around the time of the 1976 Commission Report said “Darker, brownish marks on the body represent the trickle of blood or serum issuing from the wounds; we can also pick out two traces of crimson, simulating trickles of blood-which, however, would have turned brown when dry [if they had been blood].  Therefore these marks must certainly have been added later and deliberately”-this is from McCrone’s book, p. 15\nSo IT is McCrone. The one man. With personal vendetta against other members of his initial group.\nThe color does not mean anything at all. First of all it is not carmine – there is all plethora of colors, if one will refer to the link posted here by colinberry. There are dark brown ones, lighter red and almost yellowish – and none are unusual.\nThe stain like that could be produced from the blood, plasma, sweat, saliva, lymph, interstitial fluid combinations and stains from the tortured body will not be whole blood ONLY.\n\n","date":"April 5, 2013 at 6:52 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29558","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"from p. 85 of Ian Wilson’s book The Blood and the Shroud, as we have remarked earlier, the very colour of the bloodflows as they appear on the Shroud proper (as distinct from the negative, where they all appear white), raises some very justifiable suspicions. We all know that if we cut a finger and tie a handkerchief around it, the initial vivid red of the fresh blood will rapidly change to a dull brown, usually within a few hours. Yet at long ago as the early sixteenth century one Antoine de Lalaing deescribed the Shroud bloodstains as ‘clear as if they had been made today’. Vignon, viewing the Shroud the 1930s, described the colour as mauve carmine”.\nthis is laughable. Those are real serious arguments of the people who are supposedly specialists on blood stains? or are they just simply lay people as are abundant here on the blog who have seen only blood brom the finger cut?\nThis man did not have his finger cut. he has been first subjected to beating and ripping of his skin – which by results does not even resemble finger cut, his wounds were not clear cut knife single wound, those were blunt, cut, ripped and all combinations possible wounds. Then he was carrying a very heavy object a long way under scorching sun, which leads to dehydration, rhabdomyolysis and DIC. And severe traumatic shock because of the pain as well.\nHave you ever had a blister on a foot? such a bad blister, that it fills with blood-tinged lymph? Guess what, the stain from that blister with the blood would not look like the stain from clear knife cut finger.\nAnd the stain from the blood tinged interstitial fluid from the lungs will also look different.\nNot to mention the stains from the sipping diluted blood from all orifices of the person who is suffering from DIC.\nAnd the bloody urine will stain even more differently.\nBloody sputum, bloody saliva, bloody gastric contents wiill ALL look differently as stain.\nKhm. mnestrrual blood stains also look differently\nEven blood stains from the initial cut during the start of the operation and the blood stains afterwards – stain differnetly.\n\n","date":"April 5, 2013 at 7:03 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29562","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"# 65-asking specifically about the Shroud-some skeptics are adamant that it’s just applied pigment; some accept that it’s blood, but believe that it had to be painted on as the Shroud is bogus-generally, the opinion is not voiced from skeptics that the bloodstains look phony, therefore the Shroud must be fake, but rather that the Shroud is fake, so the bloodstains must have been applied.  Some that question the authenticity may believe that a dead body (of someone) was under the cloth and the wounds were inflicted to mimic the torture & crucifixion described in the Gospel narratives\n# 66-The passage was from McCrone’s book, but he was quoting Dr. Curto’s earlier remarks\nI don’t know if one can definitively say this idea originated with him-others would probably know better than me\n\n","date":"April 5, 2013 at 7:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29566","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#66-Ian Wilson is not a blood specialist; de Lalaing, don’t know; Vignon, a biologist, but I don’t think he would be considered a blood specialist-I believe these may have been more personal observations than intended as serious arguments-as the question came up where the idea of red color originated, I am simply passing them along\nIt is unfortunate they are laughable-it is probably because many don’t have the experience as you, but there are those here who are sincerely interested in such things.  Certainly there are probably many lay people here on the blog who have only seen blood from a finger cut-there have also been the reports of those that have been medically trained that have commented on the red color of the blood on the Shroud- #33.\nIt is understandable, even by lay people, that “bloody sputum, bloody saliva, bloody gastric contents, [bloody urine], blood stains from the initial cut during the start of the operation and the blood stains afterwards  will ALL look differently”, but are all of those types of stains represented on the Shroud, ventral & dorsal?  \nDon’t get me wrong, I value your input and am surely trying your patience, but a couple of the issues I am unsure about are: \nTo me (the untrained), many of the stains on the Shroud appear to have a similar color-is this expected, or given the plethora of bloody origins, would more variation be more like it?\nSecond, experience with bloodstains, etc.-as some have also pointed out, does this fully apply to aged bloodstains?  Maybe you are convinced it does-I would like to understand as well.\nI’ve had lots of blisters on my feet, blood-filled yes; bruises, cuts on my face, blood-filled (pugilism), cuts on my fingers, yes, I can appreciate the variation.  As mentioned above, for me, maybe for others, that’s some of the issue: are the bloodstains on the forehead, back of the head, wrists believed to have been elevated similar color as many others, more anatomically positioned to contain blood from sputum, gastric juices, saliva, interstitial fluid, blood urine, etc.\n\n","date":"April 5, 2013 at 8:22 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29569","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n# 65-asking specifically about the Shroud-some skeptics are adamant that it’s just applied pigment; some accept that it’s blood, but believe that it had to be painted on as the\nShroud is bogus-generally, the opinion is not voiced from skeptics that the bloodstains look phony, therefore the Shroud must be fake, but rather that the Shroud is fake, so the bloodstains must have been applied.  Some that question the authenticity may believe that a dead body (of someone) was under the cloth and the wounds were inflicted to mimic the torture & crucifixion described in the Gospel narratives\nThis is too specific a question. I can’t tell if the bloodstains are phony just from looking on the photos.\nBut I can definitely tell that the arguments of skeptics that the stains can not be that color are phony – because those skeptics clearly have no idea what they are talking about.\n\n","date":"April 5, 2013 at 8:30 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29570","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n# 66-The passage was from McCrone’s book, but he was quoting Dr. Curto’s earlier remarks\nI don’t know if one can definitively say this idea originated with him-others would probably know better than me\n\nit was REPORTED by McCrone. If there is a reference to Dr. Curto’s direct speech outside McCrone’s book – then it is not just McCrone.\nI do not generally trust researchers who hold grudges against the conspiracy majority ( this is true in general, not particularly to this matter). usually the most laughable conspiracy theories get their start with offended researchers ( to name HIV as the most exemplary one)\n\n","date":"April 5, 2013 at 8:34 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29573","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#70-Okay\nWhat are your thoughts regarding the serum halos rings around the wounds, visible under uv light?\n\n","date":"April 5, 2013 at 8:36 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29574","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n#66-Ian Wilson is not a blood specialist; de Lalaing, don’t know; Vignon, a biologist, but I don’t think he would be considered a blood specialist-I believe these may have been more personal observations than intended as serious arguments-as the question came up where\nthe idea of red color originated, I am simply passing them along\nIt is unfortunate they are laughable-it is probably because many don’t have the experience as you, but there are those here who are sincerely interested in such things.  Certainly there are probably many lay people here on the blog who have only seen blood from a finger cut-there have also been the reports of those that have been medically trained that have commented on the red color of the blood on the Shroud- #33.\nIt is understandable, even by lay people, that “bloody sputum, bloody saliva, bloody gastric contents, [bloody urine], blood stains from the initial cut during the start of the operation and the blood stains afterwards  will ALL look differently”, but are all of those types of stains represented on the Shroud, ventral & dorsal?\nDon’t get me wrong, I value your input and am surely trying your patience, but a couple of the issues I am unsure about are:\nTo me (the untrained), many of the stains on the Shroud appear to have a similar color-is this expected, or given the plethora of bloody origins, would more variation be more like it?\nSecond, experience with bloodstains, etc.-as some have also pointed out, does this fully apply to aged bloodstains?  Maybe you are convinced it does-I would like to understand as well.\nI’ve had lots of blisters on my feet, blood-filled yes; bruises, cuts on my face, blood-filled (pugilism), cuts on my fingers, yes, I can appreciate the variation.  As mentioned above, for me, maybe for others, that’s some of the issue: are the bloodstains on the forehead, back of the head, wrists believed to have been elevated similar color as many others, more anatomically positioned to contain blood from sputum, gastric juices, saliva, interstitial fluid, blood urine, etc.\n\nKelly, you are not trying my patience at all. I gladly can explain what I can, and the variance in bllod stains is one of my daily work ( not as a major, obviously, bot as a constant visible side effect).\nThere is no reason to think that if a blood stain from venous hematoma differs from a blood stain of the blood-stinged sputum, those same stains in 100, 25 or 1967 years later will look alike, provided, they all were subject to the SAME conditions.\nWhat I am trying to make you see is a picture as a whole, not just blood stains, which an ordinary person usually sees after an accidental cut or bruise ( but even those differ in appearance, healing and marking the environment)\n I am used to look at the patient as a whole, since it is critical care medicine. An orthopedist might see only broken bones and holes, a cardiologist might just refer to pulmonary edema as a result of the acute left ventricular failure, a wound specialist would probably mourn the skin lacerations and probability of generalized infections, but a critical care specialist will have to look at a patient as a whole – including his skin disruption which resembles burns, multiorgan failure, dehydration, DIC, rhabdomyolysis and severe trauma. In surgical and trauma ICU those combinations happen all the time and as a side effect to treating those patients one can appreciate a variety of esthetics which include not only the wide range of possible deformities, discolorations and exudate of the human body, but also their reflection on the tissues, commonly known as stains.\nNow the other part, which I have tried to express before – the coloring of the stains NOW, or in the previous century has nothing to do with the initial coloring caused by the bodily fluids or their combinations. First, the cloth could have been prepared – impregnated by specific means; second – the body could have been also coated by specific substances; third – during whatever period of time the cloth with originally colored stains might have been subjected to influence by the fluids, fumes, temperature changes and light influence, which could have changed the initial coloring, as, for example happens when some wants to remove stains from the caret, clothing, furniture – not that the staining was a subject of removal, but as a result of accidental or not accidental influence.\nMethods of conservation do matter as well – since we do not know what were the conditions for centuries, claiming that the color of the stains are the proof of their artificial origin is childish, to say the least.\nSince the whole arguments of the “color skeptics” are basically – ” that’s the way I see it” without even trying to look for the whole picture, one starts to think – are all other skeptical arguments of the same amateurish level?\n\n","date":"April 5, 2013 at 8:57 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29575","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I don’t think Kelly Kearse is a skeptic, he is just looking for a rational explanation to red blood.\n\n","date":"April 6, 2013 at 1:19 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29588","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n#70-Okay\nWhat are your thoughts regarding the serum halos rings around the wounds, visible \nunder uv light?\n\nyou will have the same if the above mentioned blister stained a cloth.\nIt just means that the stain is of a mixed origin – blood with interstitial fluid, for example.\nThe stain from the WHOLE blood will happen if one has a clear surgical cut, as from the knife. Stains from blunt wounds, skin disruptions and other mutilations of the body are not goiing to be from the pure whole blood.\n\n","date":"April 5, 2013 at 9:03 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29576","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Okay, appreciate your answers very much\n\n","date":"April 5, 2013 at 9:53 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29580","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"An additional question before calling it a day-in # 4, you commented on increased physiological levels of bilirubin -thoughts on how this would influence the bloodstain appearance?\n\n","date":"April 5, 2013 at 10:20 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29582","author":"Kelly kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I sense a tone of frustration in jesterhof, who apparently has considerable experience of a variety of blood spillage on a daily basis, but hasn’t seen the Shroud, as opposed to a number of people (albeit including biologists, doctors and a ‘porphyrin specialist’) who have seen the Shroud, but are not as familiar with bloodstains. However, I must return to my comment 45, regarding degradation over time and ask jesterhof: How old was the oldest actual bloodstain (rather than a photograph) you have ever seen? It seems that in your experience blood can appear quite red for some time, but can you quantify that? How familiar are you with 100 year old blood (from, say Museums of the First World War?), 200 year old blood (Napoleonic?), 500 year old blood (European wars?). My point is that an expertise of various traumas is only the beginning of an understanding of how medieval blood can be described, with or without any medical knowledge, as “fresh.”\n\n","date":"April 6, 2013 at 5:02 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29602","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#74-anoxie, Thanks-this is absolutely where I’m coming from\n\n","date":"April 6, 2013 at 8:11 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29624","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nHugh Farey :\nI sense a tone of frustration in jesterhof, who apparently has considerable experience of a variety of blood spillage on a daily basis, but hasn’t seen the Shroud, as opposed to a number of people (albeit including biologists, doctors and a ‘porphyrin specialist’) who have seen the Shroud, but are not as familiar with bloodstains. However, I must return to my comment 45, regarding degradation over time and ask jesterhof: How old was the oldest actual bloodstain (rather than a photograph) you have ever seen? It seems that in your experience blood can appear quite red for some time, but can you quantify that? How familiar are you with 100 year old blood (from, say Museums of the First World War?), 200 year old blood (Napoleonic?), 500 year old blood (European wars?). My point is that an expertise of various traumas is only the beginning of an understanding of how medieval blood can be described, with or without any medical knowledge, as “fresh.”\n\nI already answered that question – if the appearance of blood stains INITIALLY is different there is no reason to think that in 10, 100. 500 or 1967 years they will start to look the same, no matter what the origin of the stain. If the other conditions are the same.\nIf you stain one cloth with whole blood, the other same loth with bloody stinged lymph and the third – with bloody mucous – and place them in the same container with the same temperature and environmental exposure, they will still look differently in 10, 100 or 100 years, if they look differently initially.\nThe amount of difference should be studied by experiment.\n\n","date":"April 6, 2013 at 8:58 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29626","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly kearse :\nAn additional question before calling it a day-in # 4, you commented on increased physiological levels of bilirubin -thoughts on how this would influence the bloodstain appearance?\n\nthey should make it brighter\n\n","date":"April 6, 2013 at 8:59 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29627","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nHugh Farey :\nI sense a tone of frustration in jesterhof, who apparently has considerable experience of a variety of blood spillage on a daily basis, but hasn’t seen the Shroud, as opposed to a\nnumber of people (albeit including biologists, doctors and a ‘porphyrin specialist’) who have seen the Shroud, but are not as familiar with bloodstains. ”\n\nI do not think that anybody here has seen the Shroud. And as Kelly mentioned above in some quote – the appearance and colors of the stains changed significantly when the lights were changed. In a bright daylight they might appear totally “normal” to an eye, but nobody from the living have seen the Shroud in the daylight.\nThe frustration you are referring to is more of the amusement that adult people in all seriousness are discussing the possibility of blood staining only in one fashion, whereas everyday life shows them that it is not possible.\n\n","date":"April 6, 2013 at 9:05 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29628","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Adult people are wondering how centuries-old blood-stains can be described as looking “fresh” or “carmine”. You have not addressed that point.\nYou seem to say that if the composition of two bloodstains looks different to start with, it will continue to look different after hundreds of years, but you do not explain why either of them should look “fresh.” Do you have any ideas about that?\nIt may be that you think the photos you have seen do not look particularly fresh (in which case you would be in disagreement with many who have observed the shroud itself) or it may be that you have experience of old blood which does look fresh (in which case we would very much like to share your experience).\n\n","date":"April 6, 2013 at 9:30 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29632","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"He goes on to add, “Whatever interpretation one makes of them, I would readily endorse both of these descriptions. In the course of my own viewing of the Shroud in November 1973, I was present on occasions when the television lights were both on and off. When the lights were switched off and the room where the Shroud was displayed remained in what may be best described as subdued interior daylight conditions, colour-wise the blood marks appeared much different than the body image. When they were switched on the bloodstains took on a very distinctive ‘clean’ mauve-carmine color…”\nThat is the quote I am referring to. So if one appreciates carmine coloring only under extensive TV lighting then it is not the original color to be blamed, or is it?\n\n","date":"April 6, 2013 at 9:08 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29629","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I’m sorry; I think our comments crossed in the ether. Quite apart from bright television lights, those who saw the shroud under sunlight also commented that the bloodstains looked unusual, and some of them were familiar with the stuff. So it is the original colour, not just TV lighting, that we are trying to explain.\n\n","date":"April 6, 2013 at 9:36 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29636","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#62\n1) Being objective, is the spectrum of nitrite- or NO-bound heme a good fit with the observed spectrum reported by Adler?  Are there spectral studies from leech-digests available that would provide an example that such chemistry occurs?  These are reasonable questions.\n2) The samples utilized by Adler to mimic a traumatic clot exudate were created by mixing drops of whole blood (finger stick) with drops of a commercially available (ca) bilirubin/albumin diagnostic standard.  Dried whole blood, (ca) bilirubin, and (ca) hemoglobin were used as controls. If one accepts that Adler knew what he was doing, which, correct me if I’m wrong, but it sounds as though it’s leaning that way, then what is the purpose for him having to be so creative-resorting to “new chemistry” Is the idea of methemoglobin + bilirubin really that far out?  To completely disregard Adler’s idea, for me it might be more convincing if spectral data of (unrelated) aged samples that contain a high level of bilirubin were produced, which don’t match the reported spectra of Shroud samples.  \nI am not an expert in the spectral analysis of porphryins, and have limited experience in spectroscopy in general.   For me personally, a basic experiment I would like to see (in Adler’s studies) is spectral analysis of simulated samples where increasing amounts of bilirubin were added.  Also, this is somewhat simplified, but parallel spots of such samples that were allowed to dry onto cloth, and observed a few weeks later to monitor the color.  Certainly such experiments could have been performed and recorded in a notebook without being included in a manuscript or a presentation-it is not a dealbreaker-some might also hold the view that it’s really not necessary as the most relevant groups are included.\n3) Others have commented on the presence of hydroxyproline in serum-Brother Hirudo has taken a vow of silence on this one, or is that an unfair assumption?  A stalemate-could be serum, could be medicinalis, or still must be medicinalis? \n4) New electrons donors bonded onto the iron, what they might be is anybody’s guess.  This appears to be common ground-Is it reasonable that the guess must only involve digestion products of leeches? Could such donors exist on the surface of a treated cloth?\n\n","date":"April 6, 2013 at 9:32 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29635","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#75\nI meant to include in original question, but was interested in your opinion if the presence of serum halo rings were diagnostic of a transfer stain (from a body) or would you expect the same thing if applied blood were used?  If already answered in #70, okay, but wanted to see if the same thing applied to the serum halo rings.\n\n","date":"April 6, 2013 at 9:42 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29642","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n#75\nI meant to include in original question, but was interested in your opinion if the presence of serum halo rings were diagnostic of a transfer stain (from a body) or would you expect \nthe same thing if applied blood were used?  If already answered in #70, okay, but wanted to see if the same thing applied to the serum halo rings.\n\nno, halo rings are  just a marker of a stain of blood with interstitial fluid – like the one which will form on a cloth from somebody coughing out the pulmonary edema froth.\nWhy do you always ask about applied blood? If one applies whole blood – the stains would be of one color, if one applies the mixture of blood and saliva, for instance – they will be different.\nThe halo markings do not prove or disprove the transfer or application – they only prove that the stain is not the whole blood. Given the state of the body after torture I do not see any reasons to question that the stains are mostly not from the whole blood, so the halo marks will be abundant.\nFrom the practical point of view application of the whole blood is easier, obviously, so in some angle, halo markings are rather proof of transfer from the body than application, but only because of the practicality – it is more easy to obtain whole blood than diluted.\n\n","date":"April 6, 2013 at 9:56 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29644","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"A general comment, for anyone, but if one accepts that the red color of ancient blood is in no way unusual, then what would be the molecular basis for a bloodstain to remain red?  \nMany of the above comments would suggest that comparison with new -> aged whole blood oversimplifies the issue.  Does the red color of the blood result solely from the chemical signature of the porphyrin ring, or is it a mosaic, with the presence of other (bodily) components/fluids in the stain and the background of the cloth contributing as well?  Is this the major disparity when only the porphyrin ring is considered as being solely responsible for the color?\n\n","date":"April 6, 2013 at 9:58 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29645","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nHugh Farey :\nI’m sorry; I think our comments crossed in the ether. Quite apart from bright television lights, those who saw the shroud under sunlight also commented that the bloodstains\nlooked unusual, and some of them were familiar with the stuff. So it is the original colour, not just TV lighting, that we are trying to explain.\n\nFor somebody to declare bloody stains unusual one would have to describe how many and how often he/she have been exposed to blood stain before. For colinberry the stains on the link look unusual, for me – they do not. \nAs I pointed before – we are discussing subjective opinions and those are not a scientific matters.\n\n","date":"April 6, 2013 at 9:59 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29646","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\nA general comment, for anyone, but if one accepts that the red color of ancient blood is in no way unusual, then what would be the molecular basis for a bloodstain to remain red?  \nMany of the above comments would suggest that comparison with new -> aged whole blood oversimplifies the issue.  Does the red color of the blood result solely from the chemical signature of the porphyrin ring, or is it a mosaic, with the presence of other (bodily) components/fluids in the stain and the background of the cloth contributing as well?  Is this the major disparity when only the porphyrin ring is considered as being solely responsible for the color?\n\nit may result from the chemical reaction with the material on the cloth or any material splashed, fumed or exposed to for centuries afterwards\nIn my opinion you are making the fundamental mistake – you are taking as a given that nowadays look of the stains is actually the same look it has been after the burial.\nAnd that is a very brave assumption, given the centuries which have passed afterwards and conditions the cloth has been in.\n\n","date":"April 6, 2013 at 10:03 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29647","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nHugh Farey :\nAdult people are wondering how centuries-old blood-stains can be described as looking “fresh” or “carmine”. You have not addressed that point.\nYou seem to say that if the composition of two bloodstains looks different to start with, it \nwill continue to look different after hundreds of years, but you do not explain why either of them should look “fresh.” Do you have any ideas about that?\nIt may be that you think the photos you have seen do not look particularly fresh (in which case you would be in disagreement with many who have observed the shroud itself) or it may be that you have experience of old blood which does look fresh (in which case we would very much like to share your experience).\n\nbecause they do not look fresh or carmine TO ME. And an eyewitness from the quote states clearly that they look carmine exclusively under the TV lights.\n\n","date":"April 6, 2013 at 10:05 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29648","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"3) Others have commented on the presence of hydroxyproline in serum-Brother Hirudo has taken a vow of silence on this one, or is that an unfair assumption? A stalemate-could be serum, could be medicinalis, or still must be medicinalis? \nHydroxiproline in serum is NORMAL – I thought we resolved that question way above.\n\n","date":"April 6, 2013 at 10:07 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29649","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\njesterof :\nHydroxiproline in serum is NORMAL – I thought we resolved that question way above.\n\nI thought the normal presence of hydroxyproline in serum was resolved in the very post of this thread.\n\nKelly Kearse :\n Hydroxyproline can be detected in normal human blood serum using simple immunological techniques that do not approach the sensitivity of mass spectrometry (ELISA kits, see kamiyabiomedical.com and mybiosource.com for examples). Using HPLC (high pressure liquid chromatography) methods, serum levels of hydroxyproline may be evaluated in patients as a measure of liver and renal function (E. Kucharz, Rom J Intern Med Oct-Dec; 32: 271, 1994; Inoue, et al. Analyst Apr. 120: 1141, 1995; Inoue, et al., Biol. Pharm. Bull. Feb 19: 153, 1996). The clinical significance of a hydroxyproline-containing protein in human plasma was reported by Carwile LeRoy and Sjorerdsma as early as 1965 (J. Clin. Investigation 44: 914, 1965). It is not a given that the presence of hydroxyproline is indicative of contamination by animal protein, i.e. leeches.","date":"April 6, 2013 at 10:34 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29652","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#88-It’s not really always, it’s just a couple of times-if the bloodstains did not originate from a body under the cloth, then someone must have added them.  Just trying to be objective-other physicians have noted the flow pattern and details of the bloodstains-I thought that it was a reasonable to ask someone that has had a lot of experience with blood wounds on a daily basis, similar to asking a forensics expert about being able to distinguish real blood stains at a crime scene versus those that had been fabricated-I didn’t know what the answer might be-if anatomically speaking it would be ruled out right away as too much for someone to fake it-I could see where an experienced detective might spot it right away at a crime scene because to the trained eye, the appearance is so different-that’s all\nWhile I’m in the box here, I have wanted to ask your thoughts on an unrelated topic, Hematohidrosis-I have read where in certain cases this could produce a yellow stain/different colored stains on the patient’s clothing.  Would such a condition continue following the scene in the Garden of Gethsemane, or would it be heightened at initial times of stress, then wane?  I’m not proposing that this is the basis for image formation-just curious about the physiological ramifications of this condition.  Apart from the relation to the Shroud, I have found the discussion on the physiological consequences of the events leading up to crucifixion interesting.\n\n","date":"April 6, 2013 at 10:17 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29650","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#93\n#62, I was tossing that one over to colin to see if he still remained convinced the other way, or might be willing to consider an alternative explanation\n\n","date":"April 6, 2013 at 10:21 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29651","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nanoxie :\n\njesterof :\nHydroxiproline in serum is NORMAL – I thought we resolved that question way above.\n\nI thought the normal presence of hydroxyproline in serum was resolved in the very post of this thread.\n\nKelly Kearse :\n Hydroxyproline can be detected in normal human blood serum using simple immunological techniques that do not approach the sensitivity of mass spectrometry (ELISA kits, see kamiyabiomedical.com and mybiosource.com for examples). Using HPLC (high pressure liquid chromatography) methods, serum levels of hydroxyproline may be evaluated in patients as a measure of liver and renal function (E. Kucharz, Rom J Intern Med Oct-Dec; 32: 271, 1994; Inoue, et al. Analyst Apr. 120: 1141, 1995; Inoue, et al., Biol. Pharm. Bull. Feb 19: 153, 1996). The clinical significance of a hydroxyproline-containing protein in human plasma was reported by Carwile LeRoy and Sjorerdsma as early as 1965 (J. Clin. Investigation 44: 914, 1965). It is not a given that the presence of hydroxyproline is indicative of contamination by animal protein, i.e. leeches.I thought it was resolved by the very first one – in Spanish. Hydroxiproline is abundant in human body and under certain conditions it levels in the serum may increase significantly. The very notion that hydroxiproline is absent in humans is… khm, ..wrong :)\n\n","date":"April 6, 2013 at 10:51 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29654","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Just out of interest, who said that ‘hydroxiproline’ (sic) is absent in humans? I certainly did not.  \nHydroxyproline (HP) being a product of connective tissue catabolism is a minor constituent of blood. But you would not have known that from reading the use to which Raymond Rogers made of HP disappearance –  roping it in as he did without preamble as a test for heated blood,. That was in a somewhat contrived argument against contact scorching as the mechanism of image formation, while overlooking to mention that the test is used by the meat industry, dealing with protein-incorporated HP , NOT free HP. Linen can be scorched at temperatures that do not even melt free HP, a very polar zwitterionic amino acid, far less volatilize it.\n\n","date":"April 6, 2013 at 11:17 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29657","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n#88-It’s not really always, it’s just a couple of times-if the bloodstains did not originate from a body under the cloth, then someone must have added them.  Just trying to be\nobjective-other physicians have noted the flow pattern and details of the bloodstains-I thought that it was a reasonable to ask someone that has had a lot of experience with blood wounds on a daily basis, similar to asking a forensics expert about being able to distinguish real blood stains at a crime scene versus those that had been fabricated-I didn’t know what the answer might be-if anatomically speaking it would be ruled out right away as too much for someone to fake it-I could see where an experienced detective might spot it right away at a crime scene because to the trained eye, the appearance is so different-that’s all\nactually presence of plasma halo point more to the natural way of stain occurrence, in order to manipulate this artificially one has to be very creative and patient. But it is not impossible if one puts forgery as a goal\n\nKelly Kearse :\nWhile I’m in the box here, I have wanted to ask your thoughts on an unrelated topic, Hematohidrosis-I have read where in certain cases this could produce a yellow stain/different colored stains on the patient’s clothing.  Would such a condition continue following the scene in the Garden of Gethsemane, or would it be heightened at initial times of stress, then wane?  I’m not proposing that this is the basis for image formation-just curious about the physiological ramifications of this condition.  Apart from the relation to the Shroud, I have found the discussion on the physiological consequences of the events leading up to crucifixion interesting.\n\nIn hematohidrosis blood is added material and sweat is the main one – the staining will have the characteristics of sweat more than blood, but the degree of blood expression vs sweat expression may vary\nIs it possible to continue after Gethsemane? during the torture and on the way to the Calvary? It certainly can, especially during the way uphill and on the cross – the condition is present when somebody is experiencing extreme stress, which is definitely the description of the Passion\n\n","date":"April 6, 2013 at 11:01 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29656","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#98\ncolin,\nit wasn’t me\nIn the section, 2. Is the presence of hydroxyproline in blood samples sufficient evidence of leech involvement?  I was careful in using your own phrasing to accurately reflect your proposal.  “A tenet of the leech hypothesis is that hydroxyproline is not a regular constituent in human blood, that there is scarcely any worth speaking of.”  In the follow up sentence (mine), I added,  “While true that hydroxyproline does not represent a principle component of human blood, its scarcity may be overhyped here.” Scarcity, not absence, from me.\n\n","date":"April 6, 2013 at 12:05 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29658","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"What our physician may not appreciate is that I was interested in the use that Rogers made of HP long before any thought of leeches had entered my head. Why was he suddenly talking about a large signal for HP in blood one moment, and then using the presence of that signal to dismiss any idea of scorching the next?  Did he know that the meat industry used HP evolution as a marker for unheated meat (i.e. heated meat would have already lost most or all its HP), and then go looking for it in blood? That seemed improbable and methodologically wrong – improbable because ordinary blood has trace amounts of HP only, and methodologically wrong because it is protein-HP in peptide linkage that is easily volatilized. That suggested that Rogers had discovered a large signal corresponding to HP by accident merely by eye-balling his pyrolysis mass spectrogram, and that having correctly identified it, then assumed it was normal for high levels of HP to exist in blood. (Whether he assumed the HP to be the free amino acid, or a serum protein with exceptionally high HP one can only guess, but on either count he would have been mistaken). Having this prominent marker he then hit on the idea of using as a ‘heated meat’ marker – which suggests he thought it was HP in intact collagen or similar.\nThe only way that I could make sense of all of that was to assume that Rogers had indeed found a very strong HP signal in Shroud blood, far in excess of what one would expect in ordinary blood, fresh or certainly aged. So why was it there, and might it be linked with the another anomalies – like the atypical porphyrin spectrum, the paucity of potassium, the absence of discernible RBC membranes in particular? Having realized that a forger might have preferred to use partially -digested blood from a leech, with its thicker consistency, anticoagulants etc, it was then natural to see if leeches were well-endowed with collagen or other HP-rich connective tissue, which indeed they are, so I have merely adduced Rogers’ presumed HIGH levels of Shroud blood HP as evidence of leech involvement. At no stage have I said that HP is not a constituent of normal human blood, indeed acknowledging from the outset that HP is a trace constituent, typically below 1mg% as I recall. \nI have yet to discover if Rogers gave a precise figure for his HP that would permit a decision on whether it was or was not in the likely range of human levels.  However, there are quicker, easier ways of testing the leech hypothesis – i.e. to look for leech antigens in Shroud bloodstains. Maybe there are some left-over sticky tape samples languishing in a lab somewhere that could be used for the test. If it’s negative, then one retired science bod is simply left with egg on his face. He shall no doubt survive such a grievous blow to his self-esteem.  If it’s positive, the Shroud blood could only have been painted on, making a major decorative feature linking it to the Gospel account invalid,  and producing an answer consistent with the radiocarbon dating (which I for one have never doubted for one moment, feeling as I do that the image is simply a contact scorch, and that the bloodstains are too good, too immaculate,  to be anything other than ‘painted-on’. Christianity may have had more than one immaculate conception…\n\n","date":"April 6, 2013 at 12:49 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29660","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :\nJust out of interest, who said that ‘hydroxiproline’ (sic) is absent in humans? I certainly did not.\n\nNo? So whose words are these:\n“A tenet of the leech hypothesis is that hydroxyproline is not a regular constituent in human blood, that there is scarcely any worth speaking of.” \nIt is a common constituent of human blood, especially under some circumstances, like exercise activity of the muscles or disruption of the connective tissue, which are certainly the components of the whole picture.\n\n","date":"April 6, 2013 at 12:37 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29659","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"“The only way that I could make sense of all of that was to assume that Rogers had indeed found a very strong HP signal in Shroud blood, far in excess of what one would expect in ordinary blood, fresh or certainly aged. So why was it there,”\n Because it was not an ordinary blood from a healthy individual reclining in a chair – it was the blood of the man who has been a subject to severe muscle exercise and a lot of disruption of collagen.\n\n","date":"April 6, 2013 at 1:41 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29662","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"You cannot be serious. If connective tissue were as fragile as you suggest, needing constant re-modelling, don’t you think we would have heard of it by now – in the form of sports injuries, lengthy recuperation periods? It seemed pretty tough stuff to me, years ago in zoology classes…\n\n","date":"April 6, 2013 at 2:04 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29664","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"# 102 \nThose words are mine, but I did say “not a regular constituent of blood”, I thought the word “regular” qualified the meaning, as in not a major constituent as related to the components present in higher quantities, hemoglobin, albumin, etc., together with Colin’s previous assertion that ” there is scarcely any to speak of”. Perhaps the use of the word “regular” was not the best choice-I did not intend it to imply that Colin suggested it was absent-my apologies for any misunderstanding.\nThe word “absent” was used in relation to hydroxyproline in comment # 97, but not by me\n\n","date":"April 6, 2013 at 2:16 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29665","author":"Kelly kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :\nYou cannot be serious. If connective tissue were as fragile as you suggest, needing constant re-modelling, don’t you think we would have heard of it by now – in the form of sports injuries, lengthy recuperation periods? It seemed pretty tough stuff to me, \nyears ago in zoology classes…\n\nThat’s you, who can not be serious. Which is understandable, since you do not have even a trace of medical training.\nDid you at least read the first post of the topic? it is easy to translate it through google\n\n","date":"April 6, 2013 at 2:17 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29666","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"The posting is about an idea I proposed some months ago – a testable idea – a scientific idea – so I make no apologies for having a scientific background (though biomedical as it happens).\nIf had to rank the plus points of the idea, strongest first, they would be:\n1. Practical convenience – leech blood does not clot, and is probably a better, thicker consistency for painting on.\n2. It would explain the absence of potassium (the leech disposes of plasma and its physiological electrolytes)\n3. It might explain the atypical porphyrin spectrum\n4. It might explain the unexpectedly bright red colour and its longevity.\n5. It might explain the (apparently) strong signal for hydroxyproline in Shroud blood – not free HP, but protein HP (as leech collagen).\nI consider there are enough ticks in enough boxes to warrant a test of leech markers in Shroud blood, especially if, as I suspect, tests for Adler’s  “bilirubin” with definitive analytical techniques (chromatography, mass spectrometry etc) were to prove negative, showing bilirubin has no role to play in the bright red colour.\nMedicine has a role to play in Shroudology – but only if one is approaching from a 1st century perspective. Mine is 14th century, post-radiocarbon dating, where medicine has NO role to play. Without the corroboration that comes from radiocarbon dating, medicine is not just irrelevant – it risks being seen as snake oil pseudoscience….\n\n","date":"April 6, 2013 at 3:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29673","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"HERE. I’ll repeat it.\nElevated hydroxyproline levels are common findings not only in sports medicine but in a lot of connective tissue disorders, which might be very mild in manifestation clinically.\n\nescipion :\nEn el individuo normal, sano, la hidroxiprolina sólo se encuentra como trazas en el suero sanguíneo, y en poca mayor cantidad en la orina como hidroxiprolina libre y hidroxiprolina conjugada con péptidos.\n-La hidroxiprolina AUMENTA de manera muy considerable en el suero sanguíneo y en la orina en los INTENSOS ESTIRAMIENTOS MUSCULARES MANTENIDOS, lo que es bien conocido por la MEDICINA DEL DEPORTE.\nCarlos Otal","date":"April 6, 2013 at 2:19 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29667","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"In the normal individual, healthy, hydroxyproline is found only in trace quantities in the blood serum, and in little more hydroxyproline in urine as free and conjugated hydroxyproline peptides.\n-The hydroxyproline increases very significantly in serum and urine in the intense muscle stretching HELD, which is well known to sports medicine.\n\n","date":"April 6, 2013 at 2:20 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29668","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"http://books.google.com/books?id=CpXVAwgOv7sC&pg=PT248&lpg=PT248&dq=elevated+hydroxyproline+levels+as+a+marker+of+connective+tissue+disorder&source=bl&ots=rXYCBIvi2q&sig=T4OEeOgX829iyM2wgDJT022SvDk&hl=en&sa=X&ei=UWhgUfHlNoe49QS1mIGoAg&ved=0CEQQ6AEwAg\nHYDROXYLYSINE\n high plasma levels indicate connective tissue breakdown.\n\n","date":"April 6, 2013 at 2:28 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29669","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"sorry, the last copy and paste is for hydroxyproline, not lysine\n\n","date":"April 6, 2013 at 2:29 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29670","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly kearse :\n# 102\nThose words are mine, but I did say “not a regular constituent of blood”, I thought the\nword “regular” qualified the meaning, as in not a major constituent as related to the components present in higher quantities, hemoglobin, albumin, etc., together with Colin’s previous assertion that ” there is scarcely any to speak of”. Perhaps the use of the word “regular” was not the best choice-I did not intend it to imply that Colin suggested it was absent-my apologies for any misunderstanding.\nThe word “absent” was used in relation to hydroxyproline in comment # 97, but not by me\n\nthere is scarcely any to speak of in a normal, healthy individual, I will add – in a resting state.\nWhich not the case we are discussing.\n\n","date":"April 6, 2013 at 2:32 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29671","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :\nMedicine has a role to play in Shroudology – but only if one is approaching from a 1st century perspective. Mine is 14th century, post-radiocarbon dating, where medicine has NO role to play. Without the corroboration that comes from radiocarbon dating, medicine is not just irrelevant – it risks being seen as snake oil pseudoscience….\n\nwell, at least it is honest.\nMine is 1st century and medicine not only explains but strongly supports all the evidence of the Shroud so I do not see any reason for testing the very stretched concept of leeches.\n\n","date":"April 6, 2013 at 3:24 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29674","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"It is skewed C-14 which was refuted many times which is irrelevant, not medicine.\nMedicine is right in the very center of the problem\n\n","date":"April 6, 2013 at 3:25 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29675","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"From #91\n“In my opinion you are making the fundamental mistake – you are taking as a given that nowadays look of the stains is actually the same look it has been after the burial.\nAnd that is a very brave assumption, given the centuries which have passed afterwards and conditions the cloth has been in”\nHang on here, let me explain.  I am not trying to imply that the look of the stains is the same now as before.  I think that would be a brave assumption also, if not a fallacious one.  Allow me to drop the phrase “remain”, it’s ingrained in most of us that blood starts out red then becomes brown with time-for the record, I received a pretty respectable gash replacing the burners on my grill this afternoon-I will be monitoring it closely in the next few days.\nI just want to talk about it being red-being red, right now or being red  when the samples were obtained.  The biochemical side in us (Colin, my degree is in immunology, but I did my first postdoc in the Biochem department at JHUSM), wants to look at the spectra, particularly that of hemoglobin, and try to make sense of the oxidation state(s) and conformation relative to the red color that we perceive.  I was trying to make the point that the porphyrin is only part of what should be considered-the contribution of other components/fluids as you yourself point out may/will be present, in addition to how the entire mix is perceived by the eye, when soaked into the “background” of a sepia-whitish-off-whitish cloth.  That the blood appears red because of a combination of contributions at several levels-maybe that has been part of the struggle in trying to “reconcile” the color issue, too much reliance on the porphyrin state in accounting solely/primarily for the color.  With fresh, whole blood the porphyrin state is the sole context that we are accustomed to-with a bloodstain, that may be of different composition due to the physiological factors you mentioned, and the textile component, we should not limit our reasoning to just consideration of the heme group as the (only) basis.  Hope this makes sense-apologies for any typos, am pecking away on an iPad.\n\n","date":"April 6, 2013 at 4:19 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29676","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Kelly, it is NOT being bright red. In the past few hours I’ve searched the internet for all possible pictures – and those stains ARE NIT BRIGHT RED. You can see those by yourself – the pictures of Shroud are available and in all possible dimensions. They look as they are supposed to look and that was my initial impression while starting discussions on this thread – the whole claim of strange coloring of the stains is bogus, because they look absolutely as they are suppose to look.\n\n","date":"April 6, 2013 at 7:15 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29692","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"They do not even differ too much from the other stains – same brownish-reddish, terracotta colors as one would expect.\nAll the talk about “crimson red” is only upon application of the special lights.\n\n","date":"April 6, 2013 at 7:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29693","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"But I agree with you in general approach – the color appreciations is dependent on what you describe.\nI just plainly do not see any specific brightness.\nMaybe, the brightness is only in the eye of the leech beholder ;)\n\n","date":"April 6, 2013 at 7:20 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29694","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"# 116, ah, but have you tried the new Shroud 2.0 app?\nJoking above, but I don’t believe I used the word “bright”-I believe I just said being red, to me there’s a difference in saying something is bright red as opposed to red.  In my view, most appear sort of flat red, at the most maroon-I would not conclude bright.  Maybe the most semantically correct description is redder than many might expect.  “Many” I suppose would be synonymous in 116,117 with the untrained.  \nSincerely, I hope you can appreciate that what some of us may be struggling with here is to understand why others with medical/forensic experience (#33) have made (repeated) reference to the color properties-also, to my knowledge, others would know better than me, but no one has really challenged the notion before-is your opinion that the idea has just permeated the scene so dominantly that it became accepted-that too much was made of something that really wasn’t exactly the case?\nAgain, I truly appreciate you patience, but in relation to this and Hugh’s comment in# 83, when you look at photos of unrelated, older bloodstained artifacts, does these appear as you would expect-more brownish, less red is within the variation?  All of the above are as one-with experience & training-would expect?  If yes, then is the expectation that a group of such artifacts, Shroud included, would show the same chemical signature in relation to the oxidation of hemoglobin?\nThank you again for your input\n\n","date":"April 6, 2013 at 8:09 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29696","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#101\nAbscence of discernible RBC membranes-not sure what method is being referred to here?\nABO antigens & MNS antigens are membrane proteins, would these qualify or are you talking about visualization studies?  Bollone has reported the presence of what may be an erythrocyte on the Shroud, in an adjacent panel he shows a picture of a silica particle-to his credit he points out the similarities in appearance.  The erythrocyte only picture is featured in the new Shroud 2.0 app.  For myself, I would like to see any assignments based on possible morphology by EM confirmed with the use of gold- or ferritin-conjugated antibodies that are specific to RBC molecules.  \nAlso, as morphological intact RBCs have been reported to survive in leeches for up to 18 months, wouldn’t this go the other way-significant amounts of RBC membranes would be expected in the leech scenario?\n\n","date":"April 6, 2013 at 8:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29706","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"jesterof, \nA final comment before calling it a night.\n[“It’s a madhouse!  A madhouse!”-astronaut Taylor POTA.]\nHere is a quote from Dr. Alan Adler’s lecture given at the Dept. Anatomy, University of Hong Kong, Shroud Symposia, 1986-this is a good summary of the perspective. \n“When we examined the blood areas on the Shroud at 30x magnification, it certainly had all of the normal characteristics of a blood stain.  Blood is of course a mixture of chemicals, and what one sees on the Shroud at 30x is certainly a mixture, it shows capillarity ( that is it goes through the whole cloth) and it shows cementation.  It all looks perfectly acceptable for blood except for one thing-it is too red for blood that is supposed to be some 600 to 2000 years old.  everyone knows that blood changes color when exposed to air; it changes to a methemoglobin which gives it a brown color.  So, we need to explain why the centuries-old blood on the Shroud is still so red”\n\n","date":"April 6, 2013 at 8:57 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29707","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Quote from Adler: “So, we need to explain why the centuries-old blood on the Shroud is still so red.”\nComment from me:  And since it is also believe to be a genuine burial cloth that was used on Jesus head, we also need to explain why this isn’t the case for the blood on the Sudarium of Oviedo, which, unlike the blood on the Shroud, appears to show a normal color tonality for a very old blood!\nAt least, I think we can already make this logical deduction:  If the reddish aspect of the blood on the Shroud is mainly due to the high level of bilirubin that was in the Shroud man’s blood at the time of his death, then the Sudarium was most probably not used to covered the same head than the Shroud.  \nAnd here’s another one: If, on the other hand, the reddish aspect of the blood on the Shroud is due to the presence of saponaria residues, then it is truly possible that the Sudarium was used on the same head than the Shroud but was never washed with saponaria, which would explain why the blood on it doesn’t appear reddish like the blood on the Shroud but appear much more normal for a very ancient blood (at least concerning the tonality of the blood’s color). \nSince it appears that no test was ever performed on the blood samples from the Sudarium to know the exact level of bilirubin, I’m affraid no one can give the correct answer right now for this important discrepancy between the 2 relics.\n\n","date":"April 6, 2013 at 9:31 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29711","author":"Yannick Clément","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Yannick you are forgetting the most important difference between the blood found on the Sudarium verses the Shroud; Pulmonary fluid…This in itself could possibly explain the colour difference.\nR\n\n","date":"April 7, 2013 at 6:51 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29737","author":"Ron","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"No Ron…  I wasn’t talking about the mixture of blood and a clear liquid.  I was talking about some bloodstains we found on the Sudarium that came from puncture wounds.  These bloodstains are not composed of a mixture of blood and a clear liquid but only of blood.  And unlike the bloodstains we found on the Shroud, these bloodstains on the Sudarium are dark like any normal ancient blood.\n\n","date":"April 7, 2013 at 5:37 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29797","author":"Yannick Clément","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I cannot recall seeing a single critical comment on this site (not counting my own) directed at Adler’s bilirubin story – the one that took as its starting point the observation that the TS blood looked too red to be ordinary aged blood. Indeed, Adler’s bilirubin is cited and re-cited as if unassailable fact, despite the fact that he never attempted to isolate what he called bilirubin, or measure it by its characteristic mass spectrum, relying instead on unreliable colour reactions in spot tests etc. \nWhen this one-time bilirubin researcher comes along, and dismisses the bilirubin story on the grounds that the bile pigment could not possibly survive for centuries with intermittent exposure to light, being photosensitive – what happens? We’re told that the “too-red-to-be-blood” prospectus is simply a myth, and that even if not mentioned by name (why not?) all those who observers who have expressed surprise at the ‘redness’ – from 16th century Poor Nuns to Barrie Schwortz, to Alan D. Adler have all been in the grip of an optical illusion.\nWould we have seen our physician’s assault on the central tenet – i.e. that Shroud blood is redder than one might expect – if I had not proposed a new, non-authenticity promoting explanation, and if Adler’s bilirubin story, you know, the one that just happens to promote authenticity,  had remained the default explanation – one that Barrie M.Schwortz* likes to quote as having been for him the ‘clincher’? Answers on a postcard please.\n*you know the Founder and Director of the so-called Shroud of Turin Educational and Research Association (Inc) and who is responsible for those ‘redacted’ versions of Adler’s and other STURP researchers’ work on the internet. (Apologies if my arguments are occasionally light on detail – but I am not willing to do business with any organization that claims to foster “education and research” while in fact promoting authenticity using arguments that I personally consider pseudo-science, in the same way that I consider Adler’s bilirubin story to have been pseudo-science, Rogers’ hydroxyproline story to have been pseudo-science, and much else besides that has emanated over the years and decades under the imprimatur of STURP and STERA).\n\n","date":"April 7, 2013 at 3:37 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29728","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Colin, I’m not convinced by the bilirubin explanation, I don’t think Kelly Kearse has ever been either.\nSo far there is no adequate scientific explanation.\n\n","date":"April 7, 2013 at 4:16 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29730","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"… which doesn’t mean bilirubin is not part of the answer.\nThe spectra obtained with addition of bilirubin and methemoglobin is non additive :\n\nAs far as color is concerned, red means more relative absorption in blue/violet.\n\n","date":"April 7, 2013 at 4:30 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29731","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Quick add to #121:\nThe POTA reference was not the comment, the Adler quote is-I just included this because I thought you might appreciate it-having so many question asked of you, many which may appear somewhat circular (though not intended as such)\n\n","date":"April 6, 2013 at 9:04 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29709","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"El SUDARIO DE OVIEDO, 83×53 cm, está bien documentado desde el siglo VII d.C, y estando  lleno de manchas de sangre de distintas intensidades y tonos es un buen ejemplo para establecer comparaciones.\n\nCarlos Otal\n\n","date":"April 6, 2013 at 10:26 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29713","author":"corneliotel","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"The bloodstains on the Sudarium that comes from puncture wounds and that are not composed of a mixture of blood and a clear liquid are definately dark like any normal ancient blood.  This important discrepancy with the color of the bloodstains we found on the Shroud must be explain when it comes to claim that the Sudarium was in contact with the same bloody head than the Shroud…  I don’t expect we will find the right explanation for this is a near future because there not seem to be great openness on the part of the Church to allow new direct tests on both relics right now.\n\n","date":"April 7, 2013 at 5:41 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29798","author":"Yannick Clément","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"“Colin, I’m not convinced by the bilirubin explanation, I don’t think Kelly Kearse has ever been either. So far there is no adequate scientific explanation.”\nWell, I guess that’s progress of sorts  anoxie. What’s needed now is for Barrie Schwortz’s STERA to release into the public domain all of the data on “bilirubin”. That way, with a little precis-writing from those of us who know our pyrroles from our porphyrins, folk should then be able to see for themselves that what was promoted as chemical inspiration, supposedly based on hard fact, was in all likelihood pure day-dreaming and speculation based on candy floss data. One suspects there was more than a little playing to a gallery when that authenticity-promoting explanation was conjured up for the waiting masses, the latter understandably hungry for some seemingly authoritative science, but unable to detect when a boffin with unaccustomed celebrity status had slipped back into blue sky mode.\n\n","date":"April 7, 2013 at 4:52 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29732","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nanoxie :\n… which doesn’t mean bilirubin is not part of the answer.\nThe spectra obtained with addition of bilirubin and methemoglobin is non additive :\nhttp://img.springerimages.com/Images/Springer/PUB=Springer_US-Boston/JOU=10470/VOL=2008.56/ISU=1-2/ART=2007_9076/MediaObjects/WATER_10470_2007_9076_Fig3_HTML.jpg\nAs far as color is concerned, red means more relative absorption in blue/violet.\n\nThat link makes the point better than anything I can say as to why all of Adler’s data need  to be searchable and accessible online, and not just in copyrighted books and so-called ‘Orphaned Manuscripts’ (redacted). The proposition being floated there is just plain ludicrous – namely that if mixing A and B reinforces absorption in particular parts of the spectrum – notably the blue/violet you mention – then regardless of what is happening elsewhere – you  re assured of your intensification of red colour.\nOne does not often meet intensely blood-red colours in the laboratory, so when one does, it pays to look closely at the absorption spectrum. A simple model compound for “blood” is iron(III) thiocyanate, with the Fe(CNS) ++ ion. When you look at its absorption spectrum, there is a single almost symmetrical peak, centred approximately on 480nm:\n\nThat’s the only kind of spectrum that guarantees that a compound will be blood red – one with a single peak at that value. I’m not saying that there cannot under any circumstances be secondary peaks or shoulders, simply that Adler’s mixing exercise is worthless unless one has a photograph of the end-result – to be certain that a convincing blood red colour really has been achieved . A set of absorption spectra on their own tell one next to nothing – and can in fact be highly misleading.\nDo you think that mixing bilirubin and oxidized haemoglobin would produce an end-result that was virtually indistinguishable to the viewer from fresh blood? Hugh Farey tried it – and just a few days ago reported here a negative result. Now there’s a surprise…\n\n","date":"April 7, 2013 at 5:41 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29733","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Except I didn’t use blood, I used paint, but unless some funny chemistry is involved, the result should be the same.\n\n","date":"April 7, 2013 at 7:50 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29740","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :\nOne does not often meet intensely blood-red colours in the laboratory, so when one does, it pays to look closely at the absorption spectrum. A simple model compound for “blood” is iron(III) thiocyanate, with the Fe(CNS) ++ ion.\nWhen you look at its absorption spectrum, there is a single almost symmetrical peak, centred approximately on 480nm :\n\nThat’s the only kind of spectrum that guarantees that a compound will be blood red – one with a single peak at that value.\n\nIf you look at O2-Hb’s spectrum (red blood) peak is around 620 nm.\nMetHb’s is flat.\n\nRed color is around 620–750 nm.\nYou should not mistake absorption spectrum and transmission spectrum. If you see a red color with a peak around 480 nm : well, it simply can’t be  a “single peak at that value [480 nm]”.\nThat said, with a flat and large peak around 480 nm on an absoption spectrum, you can see something red.\nThat the point with the non-additive bilirubin-Hb spectra (and non linear with increasing concentrations of bilirubin).\n\n","date":"April 7, 2013 at 9:59 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29749","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"620 nm peak is for SulfHb which is greenish.\nO2Hb absorbs under 600 nm.\n\n","date":"April 7, 2013 at 11:36 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29756","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"This value [480 nm] corresponds to nothing… Red is around 620–750 nm.\nThen something is roughly red if on an absorbance diagram, it absorbs more under 600 nm.\nExample, if you compare two samples, which one would look more reddish ?","date":"April 7, 2013 at 10:17 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29750","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Am not sure if your comment is addressed to me or Hugh, anoxie. If me:\n480nm is the range of blue light wavelength that needs to be absorbed for the solution to transmit remaining predominantly red light in the range you cite. Since it is Adler’s absorption spectra we are discussing, then 480nm is where one expects to see a prominent peak for his alleged MetHb-bilirubin complex, or as I would prefer to say, non-complex, minimally cluttered with other absorption bands, if wishing to be confident of a blood-red appearance.\n\n","date":"April 7, 2013 at 10:31 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29751","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Colin,\nYou are a one-time bilirubin researcher (#124) who knows your pyrroles from your porphyrins (#129)-I (KK) would like to see for myself, what was promoted as chemical inspiration (#129).  If patience will allow, I would like you to help me get there, so I can more fully understand. \n1. Your know your pyrroles from your porphyrins (#129).  Great-I really don’t.  What would be most helpful, for me (and perhaps others), is for you to comment on the specific peaks present in Adler’s spectra, pointing out the identity of which peaks could be confidently identified as particular species, and which peaks are anomalies (atypical).  For the atypical peaks, what could they possibly represent?  Treat it as a road map, start on the left of x-axis and work through the wavelength.  \nAdditionally, it would be helpful, if you are willing, to comment on what your expected  spectral profile would look like-what you would expect the results to be-in centuries old blood.   #124, bile-pigment could not possibly survive for centuries with intermittent exposure to light, being photosensitive-would you expect trace amounts of bilirubin to survive?  None?  With intermittent exposure to light, what would be the expected breakdown products of bilirubin, would any of these appear in the spectrum at all, or completely colorless?  What other peaks of blood products would you expect to be there and where would they be?  \nIn this way, someone like me (and perhaps others), who are not as familiar with their pyrroles and their porphyrins, could more fully understand.\n2. #124, cannot recall seeing a single critical comment on this site (not counting your own)\nMy own words in the main post “I am not convinced that bilirubin is the answer”\n#86  “I am not an expert in the spectral analysis of porphryins, and have limited experience in spectroscopy in general. For me personally, a basic experiment I would like to see (in Adler’s studies) is spectral analysis of simulated samples where increasing amounts of bilirubin were added. Also, this is somewhat simplified, but parallel spots of such samples that were allowed to dry onto cloth, and observed a few weeks later to monitor the color.” \nFor you in reviewing the data, are such experiments a major dealbreaker?  Or are the most relevant groups included in the spectral analysis?  \nColin, are you willing to help a brother out?  (or anoxie, or anyone else with relevant experience)?  Scientifically, objectively, will you walk me (and others who might be interested) through the data?\n\n","date":"April 7, 2013 at 11:51 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29758","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\nFor me personally, a basic experiment I would like to see (in Adler’s studies) is spectral analysis of simulated samples where increasing amounts of bilirubin were added.\n\nbasic experiment, picture comment #134\n\n","date":"April 7, 2013 at 11:56 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29759","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I was about to respond to anoxie in #132, which I think I must have missed earlier, when I spotted yours. \nIt might take a little while to address all the points you raise, given the complexity of haemoglobin spectra. \nFirst, let me disabuse anoxie of one thing, namely that I have confused absorption and transmission spectra. I have done no such thing, and if anoxie would care to take a look at this link, it’s clear that the absorption maximum of both Hb and HbO2 is in the 400s, ie. the blue part of the visible spectrum, exactly as one would expect of intensely red compounds, and consistent with the model compound I mentioned earlier, iron (III) thiocyanate:\n\nBut one has to consider the “whole picture”, across the entire visible spectrum, namely that to get the most intense red colour, one wants not just maximum absorbance in the blue, but minimum ‘spoiler’ absorbance in the red.  i.e. maximum red transmission.\nIf anoxie looks at those two spectra, it is clear that the largest difference between the Hb and HbO2 absorption spectra is indeed at the red end of the visible spectrum where one might least expect it. In other words, HbO2 has less of what I have above termed  ‘spoiler’ absorption in the red end on the right of the displayed spectra. Methinks it is anoxie who has absorption and transmission confused, perhaps by looking too closely at the 600-700nm region, which is NOT where the absorption maxima lie.\nI may or may not have time to address your other questions today, having some other matters to attend to.\n\n","date":"April 7, 2013 at 12:14 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29760","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :\nIf anoxie looks at those two spectra, it is clear that the largest difference between the Hb and HbO2 absorption spectra is indeed at the red end of the visible spectrum where one might least expect it. In other words, HbO2 has less of what I have above termed ‘spoiler’ absorption in the red end on the right of the displayed spectra. Methinks it is anoxie who has absorption and transmission confused, perhaps by looking too closely at the 600-700nm region, which is NOT where the absorption maxima lie.\n\nOk, you didn’t miss comment #132, it appeared delayed (for whatever reason) with erratum in comment #133.\n\n","date":"April 7, 2013 at 12:49 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29765","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#137\nanoxie, thanks, so:\n1. In Adler’s spectrum is there a shoulder in the 425-480 range that corresponds with such, that could be identified confidently?  If so, are any quantitative conclusions possible? \n2. Help me out a little with the red is 620-750, you’re saying that increased bilirubin would not correspond with this region anyway, so one cannot attribute a red color to just bilirubin by itself?    \n3. Also, the picture in #134 is with Hb:O2 with 2 concentrations of fresh bilirubin added?  Or is this incorrect?  This is not from Adler’s papers, but a separate experiment (yours, others?)  \n4. What are your thoughts on how bilirubin or its degradation products & methemoglobin are represented in Adler’s spectral profiles?\nSorry to be so dense, I am just a humble immunologist, but I very much appreciate your comments-please don’t see red because of my lack of understanding\n\n","date":"April 7, 2013 at 12:27 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29761","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n#137\nanoxie, thanks, so:\n1. In Adler’s spectrum is there a shoulder in the 425-480 range that corresponds with such, that could be identified confidently?  If so, are any quantitative conclusions possible?\n3. Also, the picture in #134 is with Hb:O2 with 2 concentrations of fresh bilirubin added? Or is this incorrect? This is not from Adler’s papers, but a separate experiment (yours, others?)\n4. What are your thoughts on how bilirubin or its degradation products & methemoglobin are represented in Adler’s spectral profiles?\n\nI don’t have Adler’s paper. But the shoulder in the 428-480 range on the picture, comment #134, is directly correlated to the level of bilirubin.\nIt is a method based on visible spectroscopy to quantify the concentration of bilirubin in cerebrospinal fluid (and differentiate hemorrhage from traumatic puncture).\n\nKelly Kearse :\n2. Help me out a little with the red is 620-750, you’re saying that increased bilirubin would not correspond with this region anyway, so one cannot attribute a red color to just bilirubin by itself?\n\nIncreased bilirubin increases absorption under 500 nm, whereas brownish color of old blood should come from lower absorbance over 500 nm.\nI’d like to see Adler’s spectral profiles and his interpretation about bilirubin.\n\n","date":"April 7, 2013 at 1:45 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29770","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#138\ncolin, okay, thank you for responding.\nI am in & out myself, but sincerely interested in what you have to say.\n\n","date":"April 7, 2013 at 12:31 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29762","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"OK.  While I’m here a small word of warning. Those plots need to be interpreted with great care. Note that the vertical scale on my link above is logarithmic. While the difference between the plots at 480nm may look small relative to that in the 600-700nm, region, it probably makes a much greater contribution to the perceived colour difference between arterial (HbO2) and venous (Hb) blood. Replotting on a linear scale would emphasize that point. Put another way, the logarithmic scale tends to compress the high-absorption end of the plot, i.e.the blue (left hand) end of the spectrum, despite that being the more crucial in producing the red colour that results predominantly from blue abstraction.\n\n","date":"April 7, 2013 at 1:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29769","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"It is not the vertical axis and absolute absorption which is important but the peak of deoxyhemoglobin which is closer to 450 nm (blue) than the one of oxyhemoglobin (closer to 400 nm).\n+ lower extinction of HbO2 in red (to get a real red and not brown).\n\n","date":"April 7, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29781","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Then is the most important blue extinction or red extinction or the ratio red/blue ?\n\n","date":"April 7, 2013 at 3:51 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29783","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"FYI venous blood has HbO2 as well\n\n","date":"April 7, 2013 at 4:16 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29790","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"# 143\nOkay, thanks for pointing out about the log scale & compression-got it\n\n","date":"April 7, 2013 at 2:37 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29774","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#141\nThanks for clarifying about the wavelength regions of the curve & the analysis.  The Orphaned Manuscript is a collection of papers by Adler that were published/presented elsewhere, there was only one which wasn’t (the orphaned one-it doesn’t contain any spectral profiles).\nMicrospectrophotometry of blood fibers in the visible range are in Applied Optics, 19 (16) 1980.\nFTIR absorbance patterns of fibers are in Archaeological Chemistry: Organic, Inorganic, and Biochemical Analysis, American Chemical Society Symposium Series, 625, Washington DC, 1996.\nFurther FITR patterns are in Proceedings of the 1998 Dallas Shroud Symposium, Michael Minor, Ed., Dallas 2000.\nThere is also “Ultraviolet-visible reflectance and fluorescence spectra of the Shroud of Turin” by Gilbert & Gilbert in Applied Optics 19, 1930-1936, 1980 and “Spectral properties of the Shroud of Turin” by Pellicori in Allied Optics 19, 1913-1920, 1980, if these might help.\nCopyright, etc., I am not comfortable publishing all of the figures, besides, there are quite a few of them, even in Adler’s papers alone.  Hope this is understandable.  I think it would also be best to have the text that goes with them.  I received the Orphaned Manuscript as a gift from a family member, but certain papers may be available online.  Some of the other papers I received by e-mailing Barrie Schwortz, who was very helpful in making them available.\n\n","date":"April 7, 2013 at 3:15 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29779","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Thank you very much for these references, i’ll try to get these articles.\n\n","date":"April 7, 2013 at 3:30 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29780","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nanoxie :\n… which doesn’t mean bilirubin is not part of the answer.\nThe spectra obtained with addition of bilirubin and methemoglobin is non additive :\nhttp://img.springerimages.com/Images/Springer/PUB=Springer_US-Boston/JOU=10470/VOL=2008.56/ISU=1-2/ART=2007_9076/MediaObjects/WATER_10470_2007_9076_Fig3_HTML.jpg\nAs far as color is concerned, red means more relative absorption in blue/violet.\n\nOK, so this might be relevant to Adler and his dreamt-up complex of methaemoglobin and bilirubin (or there again it might not). So somebody working in an entirely different field – subarachnoid haemorrhage – is trying to use bilirubin as a CSF marker for the condition, and is having trouble measuring it in the presence of methaemoglobin – the two appear to interact non-additively.\nOK, there may well be an interaction, at least as determined spectrophotometrically. But that does not prove the existence of a binary complex. There can be numerous reasons why spectra change when you mix A and B that have nothing to do with 1:1 adduct formation. \nWere you aware, for example, that there is still uncertainty regarding the precise state of molecular oxygen that is bound to oxyhaemoglobin (and perhaps methaemoglobin too)? I have seen it described variously as superoxide ion or singlet oxygen. But bilirubin is a known scavenger of at least one of those – possibly both- so all it takes is for bilirubin to de-oxygenate an oxidized haemoglobin, and hey presto you have a (probably dramatic) spectral change, without there necessarily being a complex formed, or even a shift to a brighter red. \nThe plain and simple fact is that Adler should have spared us all the spectrophotometry, and concentrated in the first instance on proving  conclusively the presence of bilirubin in Shroud blood, which he signally failed to do. He should have used chromatography and mass spectrometry to demonstrate its presence. (Personally, I think the chance of it surviving centuries of exposure to light and oxygen to be essentially zilch.)  Without that kind of hard analytical data, every word he wrote on bilirubin was pure speculation. Pardon me if I now bow out of this esoteric discussion on a highly esoteric proposal – one that I strongly suspect has no relevance whatsoever to the real world.\nNow, about that leech blood….\n\n","date":"April 7, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29784","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"They did not explain why it is not additive.\nI have absolutely no idea how bilirubin and methemoglobin/degradation products may interact. \nAnyway if you want to get red, you have to be selective in the 500-700 range, and bilirubin and methemoglobin are not.\n\n","date":"April 7, 2013 at 4:07 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29787","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Now we are going round in circles – or would be if there were still two to tango…\n\n","date":"April 7, 2013 at 4:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29789","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"What is needed is to analyse spectral data comprehensively as suggested by Kelly Kearse.\nThere is certainly no simple answer such as “bilirubin”.\n\n","date":"April 7, 2013 at 4:25 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29793","author":"anoxie","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Quote : “There is certainly no simple answer such as “bilirubin”.”\nAnoxie, if you ment that the hypothesis of Adler, a true blood expert, is certainly wrong, I would like to know how you can reach such a conclusion… \nAnd here’s a truth for you:  In science as well as in many other things in life, the simpliest explanation is VERY OFTEN the good one!!!  Having said that, I can’t help myself and I dare to say that, following this line of thinking, the Shroud’s image is most probably directly related to the presence of this dead body envelopped in the Shroud for less than 72 hours, which could have been formed by a natural process that still wait to be fully describe.  \nThis is, by far, the simpliest explanation for the image on the Shroud because we know for a fact that there really was a dead body in there for a short time and the image itself is showing just that: a dead man who had been recently scourged and crucified and who was still in rigor mortis at the time of the image formation!\n\n","date":"April 7, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29803","author":"Yannick Clément","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nanoxie :\nWhat is needed is to analyse spectral data comprehensively as suggested by Kelly Kearse.\nThere is certainly no simple answer such as “bilirubin”.\n\nSome might say there is no answer at all, simple or otherwise, if there is no bilirubin – the latter existing only in someone’s over-active imagination.\nHowever, the analysis of spectral data is unlikely to lead anywhere, not just because of the passage of time, but because of the subtlety of haem spectra, even in fresh material, when you consider the host of modifying factors – the oxidation level of the iron (+2 or +3), whether the haem is linked to globin or not, the range of small molecules that can bond to haem iron – oxygen, CO2, CO, NO, H2O etc.\nAs I see it, there are two highly conflicting hypotheses regarding Shroud blood that would lead to very different outcomes in a relatively simple analysis. One is that the Shroud blood is not in fact whole blood, but a serum exudate from retracted blood clots. That means just a little haem, but a lot of serum protein. At the opposite end of the chemical spectrum, so to speak, one has my leech hypothesis that proposes a lot of haem, but only a tiny amount of serum (more correctly plasma in the situation where there has been no clotting).\nSo what one needs to do is model those two processes, and measure, or rather estimate,  the ratio of haem to serum protein. One then needs to re-measure with robust technology for artificially-aged blood specimens, taken from retracted blood clots versus leeches. It might be that (1) haem is measurable by the red fluorescence under uv of chromatographically-separated free or esterified porphyrins after iron removal, and (2) serum or plasma proteins merely as micro-Kjeldahl (amino/peptide) nitrogen, an approximate measure of protein nitrogen. \nIf Shroud blood really is just haem-coloured serum, a wishy-washy exudate from retracted blood clots, which I somehow doubt, then there will be a large excess of Kjeldahl nitrogen over porphyrin. If it’s leech digesta (“blood paint”) then it’s the other way round –  a large excess of porphyrin over Kjeldahl nitrogen. OK, so it only gives a ballpark answer, but at least it’s in a real-life down-to-earth ballpark, as distinct from the confines of a fairy-tale castle in the sky.\n\n","date":"April 7, 2013 at 6:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29802","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"From Schwalbe and Rogers :” Heller and Adler have noted that there is no specific spectrum for blood per se: the spectral characteristics depend on the chemical state (coordination and decomposition) of the hemoglobin and also on its state of aggregation. They pointed out the strong resemblance of the Gilbert’s “blood” data to those for “perturbed” acid methemoglobin, which is a chemical state of blood in which  the iron in the hemoglobin has been oxidized. Cameron and George have published absorption spectra for acid methemoglobin in the range 480-680 nm. These data strongly resemble the Gilbert’s curve and even include the small absorption structure at about 630 nm.”\nI have the Cameron’s paper and the resemblance is obvious.\nFrom Heller’s book (Report on the Shroud of Turin, 1983), we know that the spectra were sent to Cameron (and another expert). The immediate answer was in both cases: “old acid methemoglobin”. \nThe presence of bilirubin or bile pigments is another question.\nDo we at least agree that the spectra are consistent with the presence of old acid methemoglobin?\nLet’s go step by step.\n\n","date":"April 7, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29805","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"If one wants somebody to provide “the proof” by certain compounds one at least would have to set clear parameters by the waveform not “i think this is too bright”.\nWhat wave length should be “proved”? 620 nm, 670 or 595?\n\n","date":"April 7, 2013 at 8:07 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29809","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"# 159 \nBack to # 119 from yesterday, also look at #116, but I don’t think I used the word “bright”?\nThe parameters I am interested in are a basic walk through the spectra, x-axis left to right through the wavelengths of the 1) reported spectra & 2) expected spectra.  \nColin, include a 3) expected leech spectra if you like, with 2) being a non-leech spectra\nAs Thibault notes in # 158, bilirubin & bile pigments are just part of it-Step by step is great.  Starting with acid methemoglobin is great-it can be built one compound at a time or certain ranges in the wavelength at a time, either would be fine.  I would just like to understand what is  atypical (& typical) regarding the spectra.  \n-Thibault, Do you have a reference for the Cameron & George article?\n\n","date":"April 7, 2013 at 8:54 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29815","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Reference: ” Factors influencing the absorption spectrum of vertebrate hemoglobin in solution” B.F. Cameron and P.George. Biochimica et Biophysica Acta,194 (1969) 16-24.\n\n","date":"April 8, 2013 at 3:16 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29909","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nYannick Clément :No Ron… I wasn’t talking about the mixture of blood and a clear liquid. I was talking about some bloodstains we found on the Sudarium that came from puncture wounds. These bloodstains are not composed of a mixture of blood and a clear liquid but only of blood. And unlike the bloodstains we found on the Shroud, these bloodstains on the Sudarium are dark like any normal ancient blood.\nI don’t know Yannick, the blood around the puncture wounds do not look any darker then the blood on the rest of the Sudarium. There are actually some other darker spots in various areas other then the puncture holes. It would seem it depends on the lighting used when the Sudarium is photopgraphed how dark certain spots appear.\nR\n\n","date":"April 7, 2013 at 9:19 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29816","author":"Ron","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Ron, I think you should ask Barrie Schwortz !\nLast year, he saw the Sudarium with his own eyes and was clear about the fact that the color of the bloodstains on that cloth appears to be normal for old blood (i.e. they are dark instead of red like on the Shroud).  Now, it’s up to you to believe Barrie or not, but remember that he’s one of the few persons alive that had the chance to see both relics up, close and personal !  I think there’s no reason to doubt his judgement about that!\n\n","date":"April 8, 2013 at 3:49 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29912","author":"Yannick Clément","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n# 159\nBack to # 119 from yesterday, also look at #116, but I don’t think I used the word \n“bright”?\n-Thibault, Do you have a reference for the Cameron & George article?\n\nKelly, I am not smirking at YOU.\nI though it is clear whom my irony is directed at.\nAt leech worshiper :)\n\n","date":"April 7, 2013 at 9:34 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29818","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\n\nKelly Kearse :\n# 159 \nThe parameters I am interested in are a basic walk through the spectra, x-axis left to right through the wavelengths of the 1) reported spectra & 2) expected spectra.\nColin, include a 3) expected leech spectra if you like, with 2) being a non-leech spectra\nAs Thibault notes in # 158, bilirubin & bile pigments are just part of it-Step by step is great.  Starting with acid methemoglobin is great-it can be built one compound at a time or certain ranges in the wavelength at a time, either would be fine.  I would just like to understand what is  atypical (& typical) regarding the spectra.\n-Thibault, Do you have a reference for the Cameron & George article?\n\nThe parameters I am interested in are a basic walk through the spectra, x-axis left to right through the wavelengths of the 1) reported spectra & 2) expected spectra.\nColin, include a 3) expected leech spectra if you like, with 2) being a non-leech spectra\nAs Thibault notes in # 158, bilirubin & bile pigments are just part of it-Step by step is great.  Starting with acid methemoglobin is great-it can be built one compound at a time or certain ranges in the wavelength at a time, either would be fine.  I would just like to understand what is  atypical (& typical) regarding the spectra.\n-Thibault, Do you have a reference for the Cameron & George article?\n\none has to set up parameters in order to have meaningful discussion – and one can set up those which are assumed are the parameters of the “too red” stains of the Shroud.\nWhat are they?\n\n","date":"April 7, 2013 at 9:37 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29819","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Until we have a wavelength of the “too red” stain there is nothing to “prove” in terms of additive or not additive, bilirubin or methemoglobin addition.\n\n","date":"April 7, 2013 at 9:41 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29820","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"# 162\nOK-I thought you were  telling me they weren’t bright red, as though I had said so\nBTW, have you looked the app?\n# 163\nFor me, the parameters are those listed above-that’s where I’d like to start, let’s put methemoglobin up first \n# 164\nSigning out for now, will check in tomorrow as I am able (packed day)\n\n","date":"April 7, 2013 at 9:53 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29822","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"# 164, 165\noops, got bumped, thought I was next in line\nI’m not exactly sure what you mean by a wavelength of the too red stain, we have spectra of the Shroud samples, I’d just like to go through it, piece piece-we can put bilirubin aside for now, just stay with methemoglobin\n\n","date":"April 7, 2013 at 9:59 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29823","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"# 166 piece by piece\n\n","date":"April 7, 2013 at 10:02 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29824","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n# 162\nOK-I thought you were  telling me they weren’t bright red, as though I had said so\nBTW, have you looked the app?\nI did.\n\nKelly Kearse :\n# 162\n# 163\nFor me, the parameters are those listed above-that’s where I’d like to start, let’s put methemoglobin up first\n# 164\nSigning out for now, will check in tomorrow as I am able (packed day)\n\nMy question is still there – what is the wavelength of the stain perceived to be “too red” on thee Shroud?\nUntil this simple question there is no discussion, because we can not talk about other hemoglobins before we actually set up the parameters of it.\n\n","date":"April 7, 2013 at 10:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29825","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n# 164, 165\noops, got bumped, thought I was next in line\nI’m not exactly sure what you mean by a wavelength of the too red stain, we have spectra of the Shroud samples, I’d just like to go through it, piece piece-we can put bilirubin aside for now, just stay with methemoglobin\n\nI mean exactly what I have said – what is the absorption wavelength of the stain described as “too red” – is it 670? 600? 597? at last the range ( but not like 600-750, as it is a wavelength of “red” altogether)\nBefore this is set up there is no point in discussing the absorption wavelength of carboxyhemoglobin, methhemoglobin or bilirubin.\n\n","date":"April 7, 2013 at 10:15 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29826","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"OK, good night :)\nI will check out tomorrow, but not early\n\n","date":"April 7, 2013 at 10:16 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29827","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#168,169\nI’m not very experienced in spectroscopic analysis-this you know as I have said so in the above posts-others recognize this and are willing to be more tolerant in their explanations-I thought the discussions were meaningful-if you’re having fun, okay, but I can’t help you much here- bear in mind, I’m pretty dense, but it’s a sincere dense\n\n","date":"April 7, 2013 at 11:08 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29831","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"It’s a classic beginner’s mistake in science to suppose that the discovery of a new effect requires that everything go on hold while one determines the mechanism of that effect. The result as often as not is a string of flawed hyptheses. Nowhere do we see that better than with the “Shroud blood too red to be aged blood” effect. That caused Adler to pluck his bilirubin hypothesis out of the sky, and it has gummed up Shroudie literature ever since. If Adler had been the “blood expert” that some on this site claim him to have been (he wasn’t – he was a synthetic organic chemist, specializing in porphyrins- something entirely different) he would never have invoked bilirubin, knowing its notorious photosensitivity, and have taken a different more constructive tack.\nThe trick is to make those new effects work for one, while keeping the understanding of their mechanism on the back burner until one has a decent purchase. As often as not, the answer when it finally comes may look academic, compared with the interim spin-off.\nWhy not simply take the “too red” observation as one more piece of evidence that Shroud blood has some unexpected properties that do not chime well with it being ordinary aged blood? There are others that get far less attention than they deserve, notably the paucity of potassium or packed red blood cells (or recognizable debris therefrom). We also have that “serum exudate from retracted blood clot” hypothesis, nay mantra, that looks like a classic case of making facts fit a narrative, instead of the other way round. That has led to the absurdity of double-counting – with folk claiming to see under uv a “serum halo” on the periphery of what they are already claiming to be a patch of transferred serum.\nWhat Shroudology needs is a big clear out of dud hypotheses – ones that no one can be bothered to test – that are being used purely to make a good pro-authenticity story that can then be intoned drearily on this site as if written on tablets of stone.\nStart by acknowledging that being invited to join STURP did not turn otherwise competent specialist chemists overnight into world class scientists of Nobel laureate standing.  It’s time their limitations were recognized, to recognize they were fallible, as can be seen from standing back, and taking a long hard look at some of the “ingenious explanations”  and too-clever-by-half  arguments which they attempted to conjure up out of thin air….\n\n","date":"April 8, 2013 at 2:41 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29838","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#172\n“Start by acknowledging that being invited to join STURP did not turn otherwise competent specialist chemists overnight into world class scientists of Nobel laureate standing. It’s time their limitations were recognized, to recognize they were fallible, as can be seen from standing back, and taking a long hard look at some of the “ingenious explanations” and too-clever-by-half arguments which they attempted to conjure up out of thin air….”\nStanding back…Lets’s start that long hard look beginning with the spectral data- such conjuring should fall out in the details, yes?  We can set aside the “too” from the red, or use reddish-brown for the appearance, but I’d like to more fully understand the ingenious explanations specifically in relation to the data.\n\n","date":"April 8, 2013 at 6:23 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29847","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Give me quantitative over qualitative data any day – and you yourself acknowledged some months ago the non-quantitative basis for Adler’s fanciful claims for bilirubin. \nEarlier I suggested that one shelve the study of spectral shifts – there being too many different influences at work – some obvious, some less so – and concentrate on measuring a simple but informative ratio – total porphyrins / total serum/plasma proteins. \nIf the ratio were found to be low, then that would be evidence for the view that it’s not whole blood, but a wishy-washy serum exudate. Or it might be the expected ratio for whole blood. Or there again, the ratio might be higher than one would expect for whole blood. My money’s on it being the third, thanks to some creative artwork by that Brother Hirudo.\n\n","date":"April 8, 2013 at 6:41 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29852","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I would like to make a point and ask a question.  The visible blood marks are quite possibly the result of multiple causes. An initial one, whatever it was, and then, over the centuries, well-meaning attempts by its various custodians to “touch them up” for the benefit of pilgrims travelling great distances to see the shroud  and possibly – even when they arrived – having to view it from some distance.  Certainly scores of metres.  The holy blood being a major attraction the custodians might have felt justified to use anything from vermillion to other mammalian blood direct or via a leech.  It would have been done with great care and dexterity so that these later applications remain undetectable.\nWhat interests me are the invisible (to the naked eye) stains. I believe that the “halo” is only readily observed when fluoresced.  Whether bilirubin or not, can this be nailed to a blood related phenomenon?\n\n","date":"April 8, 2013 at 6:46 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29853","author":"David Rolfe","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"What price then the claim that the bloodstains arrived before the body image if there has been “touching up” in later centuries? \nThe “blood-first” dogma is central to authenticity. If just some of the bloodstains were later additions, one is entitled to ask whether ALL of them might not be artistic additions made by a medieval monk (say) with a paint applicator in one hand, and a New Testament checklist in the other… \nAnd if the blood is fake, then who’s to say the basal image isn’t also of medieval provenance, like, you know, a contact scorch from a heated metal or ceramic template or templates.?\n\n","date":"April 8, 2013 at 7:18 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29854","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I don’t see how over-painting the blood stains would have any impact on the initial stain and its prior appearance on the cloth to the body image.\n\n","date":"April 8, 2013 at 1:56 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29898","author":"shroudenigma","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"The serum haloes are another of the phenomena of the shroud that owe more to overexcited reporting than they do to actual observation. I have before me Miller and Pellicori’s paper with its comprehensive coverage of the shroud in UV. There are seven photographs covering the whole shroud.\nStarting with the big bloodstain of the foot (dorsal image) there is a clearly fluorescent serum fringe around the base of the instep which is not easily visible in ordinary light. No other part of the bloodstain has a visible serum fringe. None of the scourge marks on the dorsal image has a serum fringe, nor the rivulets of blood across the back, and if the marks of the crown of thorns have any, they are very faint indeed. None of the bloodstains on the front of the head (including the famous epsilon) show any fringe at all. The spear wound has a slight border on its top and top left ‘shoulder’ only. The wrist wound has a nice little halo around the upper ‘finger,’ but nowhere else, and the arm rivulets have no halo at all.\nIt is not impossible that this might be explained by the stains of the foot-wound, spear-wound and wrist-wound being derived from reopened injuries, while the rest were derived from the remoistening of dried blood.\n\n","date":"April 8, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29941","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"We are being led back to the old story: McCrone versus Adler et al.\n\n","date":"April 8, 2013 at 8:46 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29859","author":"Louis","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Do you means authentic versus non-authentic? If so, why trivialize the issue by presenting it merely as a replay of a spat from 30 years ago? Did McCrone and Adler between them have the last word to say on the issue of authenticity? Their dispute centred as I recall mainly on iron(III)oxide, and whether its presence was a marker for ochre artist’s pigment or degraded haems or retting-acquired impurities. Nobody has mentioned iron oxides thus far on this thread, so let’s draw a line under that and move on, shall we?\n\n","date":"April 8, 2013 at 9:06 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29863","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"so there is no wavelength of the absorbtion of the stains, only subjective waving in the air of the term “too red” or”looking(sic!!!) fresh”, am I correct?\n\n","date":"April 8, 2013 at 10:58 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29882","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Nothing I wrote previously said anything about McCrone and Adler having the last word about the issue of authenticity. What prompted the comment was the suggestion that vermilion had been used, so please see “Red Ochre and Vermilion on Shroud Tapes?” by Walter McCrone, McCrone Research Institute, Chicago, available on the Internet.\n\n","date":"April 8, 2013 at 9:55 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29869","author":"Louis","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#174\n“Give me quantitative over qualitative data any day – and you yourself acknowledged some months ago the non-quantitative basis for Adler’s fanciful claims for bilirubin.”  Yes, I believe that it might be difficult to quantitate the amount of billirubin in dried bloodstains, it would seem reasonable that you would have to normalize it relative to other blood components-albumin?  But then again, I have limited experience relative to the precise details of what such spectral data can and cannot tell you.  I’m counting on you to guide the way in helping me to properly interpretet the data, to convince me, if you are willing what is and isn’t a stretch.  What’s a yes, a no, and what could be a maybe. \nPretend, if you wish, that your leech idea has taken off to the point that you are now head of the major biotech enterprise Leech Ingesta Inc.  A framed portrait of Brother Hirudo hangs on the laboratory wall, set in a high quality, cherry wood frame, polished to a rich brown luster-(although some say that at certain times of the day, when the sun shines in just right, flecks of red are visible in the grains).\nIf STURP scientists were so out of their league as suggested, then surely their instrumentation was experienced-machines are objective, they simply respond to the press of a button.  So, in essence, these STURP scientists have done you a big favor: they have already collected the data for you.\nOne of your lab personnel brings in such data collected by mute, unknowing machines and lays it across your desk, eagerly awaiting your personal interpretation of the results, as you know your porphyrins from your pyrroles. Explain to them where the issue(s) are, “see this region right here, there should be a peak there, but there isn’t”; “this shoulder is extended way too much, it should be much sharper”.  You can even put forth why the presence of certain peaks, or their absence, or their irregular behavior are telling that the sample has leech involvement written all over it.\nSuggested experiments that should/could be done, are all well & good, but doesn’t it seem most reasonable to specifically review what is already in hand first?  If some things are obvious and some are less so (#174), let’s start with the obvious ones.\n\n","date":"April 8, 2013 at 10:01 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29874","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Well, I’m sure I don’t need to remind you Dr.Kearse that one does not need to be a University professor in order to follow an analytical protocol involving mainly forensic-type tests. In fact that kind of work is often best left to people who do nothing but those kinds of tests, and get very expert at doing so. Having said that, I acknowledge that Prof. Adler might have wanted to take a hands- on approach, given the limited amount of material available.\nLook, it’s not my intention, now or ever, to give any kind of overview of his entire career, certainly not to write things that might give offence to his surviving relatives. My concern is purely with the specifics, and with the use that he made of his data in his various high-profile summaries detailing his STURP involvement.\nEven then, I would confine myself to a light touch commentary, pointing out just one or two  features that strike me as quirky and in some instances disturbing.\nHere’s a case in point. Everyone is familiar with what Adler wrote in his Orphaned Manuscript, published in 2002, claiming that the unusual and centuries-old red colour of Shroud blood was the result of oxidized haemoglobin forming an association with bilirubin. There was no mention made there of the most elementary property of bilirubin, namely its photosensitivity and chemical instability to light. So was Adler unaware of that?  \nAnswer: NO!  Here’s what he was saying earlier in 1999 when discussions were taking place on the best way to conserve the Shroud:. Note the last paragraph (bolded)\n“Getting it (the Shroud) conserved properly is NOT a trivial problem!”\nDr. Alan Adler\nRichmond Shroud Conference\nJune, 1999\nThis remark was made in response to a Panel on Imaging held as a part of the Conference. The panel participants (Messrs. Grundfest, Propp, Schumacher, Schwortz, and Whanger) had made several remarks pointing out the potential for light to induce potentially damaging changes on the Shroud.\nDr. Adler expanded on the panel’s comments with the following comments of his own:\n    Bilirubin, which is found in the bloodstains on the Shroud, is NOT light-stable. Every time it’s illuminated, whether by ambient light, fluorescent light, photographic imaging lighting or even a flashbulb, the clock runs down to the time when the bilirubin will change in color. Further, the effects of these light-induced chemical changes on the adhesion of bilirubin to the linen is not known and could be detrimental. \nHere is a scientist who knew in 1999 that bilirubin was chemically unstable, yet 3 years later was stating almost as fact that it maintained the red colour of blood when one expects the latter to go brown or black. It is  the latter that people remember, the “ingenious idea/discovery” that everyone quotes, including the authenticity-promoting founder of STERA, stating that the bilirubin effect was for him the clincher. Yet by Adler’s own admission it was a complete non-starter in chemical terms.\nSorry, call me old-fashioned if you like, but I have zero tolerance for pseudoscience, especially Shroudie pseudoscience that as we know is agenda-driven. Adler’s attention-grabbing bilirubin story was not only pseudoscience, but Adler himself KNEW IT, and made it the punch line in his personal Shroud memoirs.\nThe more I learn about certain STURP celebs and their MOs, the less I like… When the curtains opened, they did not want to disappoint their fan base, did they?\nPSEUDOSCIENCE!\n\n","date":"April 8, 2013 at 10:49 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29881","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"You are talking of McCrone personal. Endettas and botched C-14 tests, don’t you?\n\n","date":"April 8, 2013 at 11:06 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29884","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nshroudenigma :\nI don’t see how over-painting the blood stains would have any impact on the initial stain and its prior appearance on the cloth to the body image.\n\nAny evidence that the Shroud had been over-painted would totally and fatally compromise the proposition that its “original” bloodstains had been acquired 20 centuries ago. That’s unless you know of a foolproof means of distinguishing between 14th and 1st century blood. \nThere’s also the small matter of the bloodstains all looking much the same from head to toe. Place a question mark against just one of them, and you place question marks against all.\n\n","date":"April 8, 2013 at 3:04 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29903","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"So, you accept that it would make no difference to the prior appearance. Thank you.\n\n","date":"April 8, 2013 at 4:01 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29915","author":"shroudenigma","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"We’re not in the TV studio now, you know, attempting to score easy debating points. Look back through this thread, and you will see it’s about the chemical nitty gritty, not adversarial point scoring.\n\n","date":"April 8, 2013 at 4:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29922","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\njesterof :\nYou are talking of McCrone personal. Endettas and botched C-14 tests, don’t you?\n\nit was from the phone so typos made it all twisted.\nshould read:\nyou are talking of McCrone personal vendettas and botched C-14 tests, don’t you?\n\n","date":"April 8, 2013 at 3:05 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29904","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"# 182\n“My concern is purely with the specifics, and with the use that he made of his data in his various high-profile summaries detailing his STURP involvement.  Even then, I would confine myself to a light touch commentary, pointing out just one or two features that strike me as quirky and in some instances disturbing.”\nOkay, I understand, my interest is also purely with the specifics.\n#182\n“Look, it’s not my intention, now or ever, to give any kind of overview of his entire career, certainly not to write things that might give offence to his surviving relatives.”  \nIt’s not my intention either-I don’t think discussing the data objectively is demeaning, it’s part of helping to push the science forward.  Some might wonder how an accusation of “pseudoscience” might be perceived in this context.  \nSurely the machines that were used in such experiments that collected the data were not also conspirators in such “pseudoscience’?   \nHere are a couple of light touch questions:\nA simple question, yes or no, have you really ever given the spectral results their due, and critically examined the data?    \nIf yes, what is the first area/peak that sets off an alarm, or raises a flag that points to leeches or anything else abnormal?  \nJust  trying to understand\n\n","date":"April 8, 2013 at 3:06 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29905","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"“It’s not my intention either-I don’t think discussing the data objectively is demeaning, it’s part of helping to push the science forward. Some might wonder how an accusation of “pseudoscience” might be perceived in this context. ”\nHow could the entirely speculative implication of bilirubin (“extraordinary” levels thereof arising we were told from crucifixion trauma) be seen as pushing science forward when the initiator of that idea had previously acknowledged that bilirubin is photosensitive and chemically unstable? Was that not perverse and misleading? Some might consider my label “pseudoscience” to be over-polite.\nSpectral results? The anomalies in the porphyrin spectra must have been profound for a porphyrin specialist like Adler to have felt obliged to invoke not just trauma-induced bilirubin but trauma-induced ‘para-hemic’ methaemoglobin too (I’m still trying to find a reference to the latter outwith the Shroud literature). When there’s an exotic porphyrin spectrum, the like of which Adler had clearly never been seen before, don’t you think it’s up for grabs, and that anyone with a chemical background is  entitled to seek alternative explanations, especially those that don’t have qualifying assumptions (like acute physiological trauma)? \nI had simply kept that anomaly at the back of my head for some months until  (challenged on this site to provide an explanation) I had wondered what a forger might have used as a source of non-clotting blood. As soon as the L word entered my head, an explanation for the peculiar spectrum followed in short order, and for other anomalies  too – like the paucity of potassium, the virtual absence or red blood cells (lysis?)… One thing leads to another…  That’s sciencebiz for you.\n\n","date":"April 8, 2013 at 3:55 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29913","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Apologies, the references posts in # 187 is in reference to #183, not #182\n\n","date":"April 8, 2013 at 3:10 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29907","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Colin,\nDo you there is no bilirubin in the TS bloodstains?\n\n","date":"April 8, 2013 at 3:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29908","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Typo:”do you THINK…”\n\n","date":"April 8, 2013 at 3:22 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29911","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"None whatsoever. If bilirubin starts greening up on TLC plates within hours, – and verdins are just one class of photoderivative  – then what chance is there that it would or could survive centuries on linen, exposed to light and air? It doesn’t stop at  green either – it bleaches fairly rapidly in light – one reason being that it is a self-sensitizer for production of singlet oxygen, the latter adding across double bonds to produce dioxetanes and other oxidation products. The presence of other substances – e.g. methylene blue – greatly increases the sensitization, so I would  not be surprised if haems and free porphyrins work too, knowing their photodynamic action that is responsible for skin lesions etc. \nNope, no bilirubin on the Shroud, and it’s a pity we cannot see video clips of the evidence on which Adler based his claim for “extraordinary levels”.\n\n","date":"April 8, 2013 at 4:08 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29917","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Thank you for the answer.\nBut….\n“If bilirubin starts greening up on TLC plates within hours, – and verdins are just one class of photoderivative – then what chance is there that it would or could survive centuries on linen, exposed to light and air?”\nAccording to Adler, he found in the samples taken at the margins of the bloodstains (serum) many “olive” (green + yellow) shards (verdin ?)\nThe TS was very rarely  exposed to light. In addition the bloodstains are completely dried.\nDo you think that taking into account these conditions, the bilirubin would have been completely destroyed ?\nAdler used the Erlich’s reagent using the method of Jendrassik (microspotting technique). “Using the same microspotting technique as described above, characteristic blue azobilirubin colors could be positively detected in reflected light on the surfaces of the olive colored shards, the orange globs, and also, weakly on the more orange colored red coated fibrils. The test was sensitive to acid, turning a paler purple, and was discharged by 10 minutes of short wave UV light as is characteristic of this color test. In the previous spectral work it was noted that a peak does appear both in the whole cloth reflection studies and in micro-spectrophotometry of the tape samples at about 450 nm. This is quite typical of bilidienes and similar bile pigments structures…” \nI understand that the Erlich (classical) test for bilirubin was positive and that the spectra were consistent with the presence of bilirubine. \nFor me, taking into account all the parameters (the bood on the TS is real blood, olive color of some of the “objects” mainly found in the serum areas, the results of the Erlich tests on these objects, macro and microspectrometry data) are self consistent.\nIf you think that there is no bilirubin, you must interpret the Erlich test results as a false positive. Is it a false positive and if so what are the other possibilities ?\n\n","date":"April 9, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30085","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#161\nThibault-Thanks\n\n","date":"April 8, 2013 at 3:22 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29910","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#192 What exactly makes the porphyrin spectrum exotic relative to the expected spectrum in centuries old blood?  \nBack again to #191, to simplify the question even further, yes or no, have you looked at Adler’s spectral data?\n\n","date":"April 8, 2013 at 4:53 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29925","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Please let’s avoid inquisitions about precisely what I have or have not read.  I’ve told you the kind of data I consider crucial, and the kind that is not my cup of tea, the latter including spectrophotometric plots with indistinct overlapping peaks and shoulders, to say nothing of those logarithmic absorbance axes. If you suspect I have overlooked spectral or other data that are worth discussing or debating, then please feel free to link to them here – but I insist on the right to remain non-committal. Horses for courses and all that…\n\n","date":"April 8, 2013 at 5:20 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29931","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"# 199\nIt’s not an inquisition, I’m just asking because I don’t hear any specifics-it’s like trying to talk about constellations without ever going outside or looking through a telescope or comparing photographs.\n” I’ve told you the kind of data I consider crucial, and the kind that is not my cup of tea,”\nThe kind of data, we’ve been told ad nauseum, but when asked for any details about such”indistinct overlapping peaks and shoulders” on existing data, no mention of even a region of the curve to refer to. \nIt would difficult for me to comment on any spectral data you may have overlooked, when it is not obvious at what you might have looked at. \nYou are certainly within your right to remain non-committal, others are within their rights to wonder why the green curtain is guarded so tightly. I would ask Adler the same type of questions if it were possible-I would think the data would be the first place most scientists would want to start-the secure scientist is typically happy to walk someone through the data that shows an interest in their field, not become overly defensive.  \n My intent from these questions the past few days was to be able to learn from those who have experience regarding  porphyrins, pyrroles, hemoglobin species, etc. what specifics they accept without reservation, what specifics they think are totally unjustified, and what specifics they agree may be in the grey area.  Any true, open discussion must be data-driven, or else that, too, may fall within the shadow of pseudoscience.\n\n","date":"April 8, 2013 at 7:21 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29948","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Please sir, can I be excused mind games today…?\n\n","date":"April 9, 2013 at 2:18 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29983","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Apologies again, last post refers to #200, not #199\n\n","date":"April 8, 2013 at 7:23 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29949","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n# 199\nIt’s not an inquisition, I’m just asking because I don’t hear any specifics-it’s like trying to talk about constellations without ever going outside or looking through a telescope or comparing photographs.\n.\n\nthe re won’t be ANY specifics. Nobody from the Shroud-deniers want any specifics, just to talk in general or about personalities.\nI am trying for the second day to get an answer to the very simple question – WHAT IS THE WAVELENGTH of the absorption of the suspicious, too red or looking fresh blood stain on the stain – to no avail.\nMaybe because the answer will leave no room for speculation about the leeches and pyrroles?\n\n","date":"April 8, 2013 at 8:49 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29957","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Actually page 30-31 of Adler’s book in a chapter named Spectroscopic Tests gives a very clear explanation WHY our Shroud-denier clearly does not want to provide the answer, especially taking into consideration comparative nature of the analysis.\n\n","date":"April 8, 2013 at 9:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29963","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I would say the same to you as I have just said to Dr.Kearse – I am here to discuss science, not play mind games.\nIf you consider that i have overlooked something important as regards the spectrum of  Shroud blood, then you are at liberty to say so. For my part, I prefer to stay clear of any spectra that are not of the fingerprint variety – mass, infrared, nmr etc – and especially visible absorption spectra of porphyrins which I regard as a quicksand sown with landmines. The crucial question that needs to be addressed is the ratio of total porphyrin to total serum/plasma proteins. If the serum exudate hypothesis is correct, it should be lower than normal blood. If the leech theory is correct it should be higher.\nReminder re blogging etiquette: it is not for you to choose, far less demand, the ground on which I choose to state my case.\n\n","date":"April 9, 2013 at 2:30 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-29984","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"There is also a discussion etiquette – if one stubbornly avoids the answer to the very simple question, muddling it in porphyrins et al it is usually indicative that that pesson knows perfectly well, that the answer is not supporting his arguments, therefore he’d rather talk about personality traits, internet manners and leeches.\nMuch the same was with hydroxyproline impossibility in the human body after strenous activity. You used questionable defence “I do not believe it all” since you did not have any arguments left, now you are trying to hide behind the etiquette mask.\nThe reality is simple – you know that you do not have the arguments which will prove your point ( at lest in those two instances) and do not have the courage to admit that.\nOh, and when one is typing from the phone, spelling mistakes happen easily(sic!!)\n\n","date":"April 9, 2013 at 4:36 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30080","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#201, 202\nMind games?  Certainly not my intention.\nOther than on my iPod, I have zero interest in playing mind games.  If you feel that way, sorry, I guess you just gotta let it….you gotta let it-go.\n\n","date":"April 9, 2013 at 9:48 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30027","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"The reason there are “no specifics” on spectrophotometry in the visible range is there are no specifics, no diagnostic utility, no molecular fingerprinting possibilities, certainly not in crude unfractionated mixtures (like Shroud blood solubilised in hydrazine). \nSo why am i being pressed to address spectral plots that I consider to be not just valueless, except to signpost “anomaly”? Why all the insinuations (if not from you) that I have studied those plots and don’t like what I see? Why the impression that is forming in my mind that this thread is nothing more than a baiting exercise?\nHere’s a link to a paper I published in 1972 that is highly relevant to the issues under discussion (I’ll probably be accused of self-promotion, but shan’t lose any sleep on that account).\nhttp://www.sciencedirect.com/science/article/pii/0006291X72906171\nNote that I separated the bilirubin derivatives first, using chromatography. Note that I did record their visible absorption spectra, but only to support and document their chemical identity as rhodins and purpurins. Note that it was mass spectrometry – a fingerprinting technique – that was used to assign chemical structures. Note I was not content to observe absorption spectra, and then immediately proceed to inflict crazy unsupported ideas on the reader. Had I done so, the paper (published in Biochim.Biophys.Res.Commun.) would never have been accepted for publication.\nYou as a scientist should know that what matters at the end of the day is NOT leaving every stone unturned, but (life being short) devising hypotheses that are testable in principle and in practice. I’ve done just that –  by proposing that one measure the ratio of total porphyrins to serum proteins. The answer should allow one to judge whether Shroud blood is more ‘dilute’ than whole blood, through being a serum exudate, or more concentrated, due to having been inside a leech that rids itself of excess fluid (and plasma proteins). The reason for its long-term redness is of secondary importance and can be left for another day. \nI’ll read your reply, naturally, but don’t promise to respond, feeling as I do somewhat weary of this site and its repeated failure to display generosity of spirit towards those who take the radiocarbon dating at face value, seeing no major errors, no incompetence, no dark conspiracies. Yes, it would have been nice to have had more than one sampling site, but the ranging shot answer makes it virtually impossible that re-testing would or could give a non medieval result. Nobody goes to the trouble of invisibly mending an inconspicuous corner when there is major damage elsewhere.\n\n","date":"April 9, 2013 at 10:27 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30034","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#206\nWould evaluating such a ratio really be that definitive?  Or would it still leave things substantially up the air-how might potential differences in degradation/stability (in general, not necessarily related to photosensitivity) affect this over time?  A more crucial and direct test for so-called leech involvement would be the detection of specific leech antigens-that’s more to the bullseye of providing definitive evidence-I know you’ve suggested that approach before-in my view, that cuts to the chase.\nNo need to reply here (and I’m not being sarcastic), this is just a thought I’m throwing out\n\n","date":"April 9, 2013 at 10:04 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30029","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Colin,\nI posted #209 before reading #208.  I think there can be an honest variation in the  importance of turning over certain stones, for different people (scientists) individually, especially among those in different disciplines-sometimes this can help you better design testable hypotheses.  \nNo part of this has ever (intentionally) been a baiting exercise from me, of that I am certain-I’m sorry you might have felt that way.  I appreciate the time you took in the discussion.\n\n","date":"April 9, 2013 at 11:12 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30041","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Thank you Kelly. I have never doubted your sincerity for one moment – just discomfited that you should set so much store by visible absorbance spectra, not just because there are vastly more informative fingerprinting techniques available – but because it risks feeding red meat to those who mischievously claim I am ignoring those slurred visible light spectra for all the wrong reasons. Having been brought up in the school of hard knocks, I prefer to ignore those hugely problematical plots that mean different things to different people – for all the RIGHT reasons…  ;-)\n\n","date":"April 9, 2013 at 11:27 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30044","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :The reason there are “no specifics” on spectrophotometry in the visible range is there are no specifics, no \ndiagnostic utility, no molecular fingerprinting possibilities, certainly not in crude \nunfractionated mixtures (like Shroud blood solubilised in hydrazine). \nP>\nThis is simply not true. Not only ARE  there spectroscopic specifics of the whole blood, not the fractions, but based on those specisfics there is a widely used everyday practical technology used in every hospital and not only there.and it is called pulse oximetry and uses exactly that – the spectroscopic variations in absorbance of the light waves of the whole blood, depending on the oxygen saturation. Oxygenated blood absorbs infrared light ( 950 nm) whereas deoxygenated blood will absor the red wavelength, which is 650 nm.\nNeither of  th peaks or ranges of the light absorbance in the samples studied from the Shroud were even close to 650 nm – which is the charachteristic deoxygenated blood, which is visually VERY dark and is more of the dark garnet color, than red.\nThe blood on the shroud is deoxygenated, obviously, so its charachteristics are in a totally expectable range of the wavelenghth ( I encountered 420-450, 560 and one peak for one sample 600 nm).\nSo the whole concept of some samples appearing “too bright” or ” too fresh looking” is simply ridiculous, as by pure comparison of the wavelenghts, without even digging into components it is obvious, that thay are neither “too red” or “too bright”.\nToo bright or too re would have to be at least over 700 nm, which none of the samples absorbs.\n\n","date":"April 9, 2013 at 5:05 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30084","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#198\nThibault,\nA quick question, if okay\nRegarding the the presence of “shards” -is this the result of protein aggregation, which occurs as the bloodstain dries, becomes dehydrated?\n\n","date":"April 9, 2013 at 6:58 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30090","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#214\njesterof,\nCan you help me out just a little bit with understanding this, are these values (encountered ones, see quote below) in reference to the data on pg. 31 in the Adler book that you mentioned earlier #206?  This is line B?  \nThe blood on the shroud is deoxygenated, obviously, so its charachteristics are in a totally expectable range of the wavelenghth ( I encountered 420-450, 560 and one peak for one sample 600 nm).”\nAnd also, to understand correctly, the main point you are making is that even from the spectral data, one can see that the color/wavelength does not even begin to approach where red, intense red color lies?\n\n","date":"April 9, 2013 at 7:17 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30093","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Has anybody read “Age estimation of blood stains by hemoglobin derivative determination using reflectance spectroscopy” by Bremmer et al., in Forensic Science International, Volume 206, Issues 1–3, 20 March 2011, Pages 166–171?\nI thought not, otherwise it would surely have been mentioned bv someone. An abstract and its diagrams can be found by Googling, and there is a slideshow resume at http://www.slideshare.net/rolfok/ageing-bloodstains.\nIn it we can find four simple reflectance spectra of blood at four different ages (1 hour, 1 day, 7 days, 63 days), which can be compared to the Gilberts’ reflectance spectra from the shroud, which can be found at http://www.shroud.com/pdfs/rogers5faqs.pdf, with the proviso that the Gilbert’s blood spectrum is an average of, I think, four different stains and may not exactly represent any particular one.\nThe “Redness” of a stain appears to be related to a steep rise in reflectance between 500nm and 600nm, the closer to 600nm the better. The Gilberts’ bloodstain spectrum shows the steep rise, but it begins at about 520nm, and would probably be better described by ‘orange’ rather than ‘red.’ Maybe I should give Billy Reuben another chance, although it could be argued that the Gilberts’ spectrum is sufficiently different from any of Bremmers as to suggest that the shroud stains are not in fact blood at all.\n“Brown-ness” seems to be indicated by a steady and gradual rise in reflectance from about 500nm to about 800nm. This pattern is followed by Bremmer’s 63-day old blood, and also by the Gilberts’ “image” spectrum.\nAll in all the contrast between these two sets of spectra seems to me to warrant all the discussion that has so far appeared on this blog, and probably a great deal more!\n\n","date":"April 9, 2013 at 7:25 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30094","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Hugh,\nI believe jesterof listed this in one of his postings on the thread-with the numerous discussion and bump/shuffling of posts, it could have been easy to miss-will go back & look at this again-I had tried to contact the author of this once, but the e-mail kept bouncing back as undeliverable\nA question about the Gilbert spectra & the averaging-would there be a significant variation in from one bloodstain to the next-or even within a single bloodstain area?  \nIn the original Gilbert & Gilbert paper, Figure 14 & 15 says the bloodstained areas on the Shroud that were evaluated were: wrist, F3E, side-F6B, forehead 3 mark-F6B, and back-B3C\nBilly Reuben-good one\n\n","date":"April 9, 2013 at 8:06 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30100","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"The areas scanned were 6mm x 3mm, so I think were representative of each blood area decided upon. To confirm this, each individual spectrum has roughly the same shape, it is merely higher or lower up the y-axis, indicating that the blood is all the same colour, just lighter or darker according to various factors, such as intensity of application or subsequent erosion. Surprisingly, the foot area tested was the brightest, followed by the forehead and wrist more or less the same, and the lance being the darkest. As I would have said the foot area represents quite a deep stain, this suggests that any particular gross stain area could have quite a variation of intensity.\nInterestingly, the average spectrum is listed as being taken from: wrist-F3E, side-F6B, forehead-F8C, and back-B3C, while the individual spectra are listed as: wrist-F3E, lance-F6B, forehead-F8C and foot-B1A. Why one diagram includes the foot and the other includes the back is not explained.\nSince there is overall consistency in the shape of all the individual spectra, we are entitled to ask for an explanation for a distinct spike at about 610nm on all four bloodstains, which does not correspond with any kind of blood. It could be from the addition of a red pigment to touch them up, I guess, although materials such as iron oxide or vermilion don’t have such pronounced peaks in their spectra.\n\n","date":"April 10, 2013 at 5:22 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30166","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Methinks one has to be very careful Hugh to state what type of spectrum is being reported. Is it an absorption spectrum – one that measures wavelength subtraction, the subject of my preceding comment – or is it a reflectance spectrum that measures the wavelength of the light that is NOT absorbed, whether it is reflected off the surface, or transmitted through the far side? If that 610nm is a peak on an absorption spectrum, then the pigment is blue or maybe green. If it’s the wavelength of reflected/transmitted light, then it’s red or orange. (Not trying to teach a grandfather how to suck eggs – just making a plea for carefully specifying labels whenever discussing Adler’s spectrophotometric results)\n\n","date":"April 10, 2013 at 5:40 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30167","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Sorry, Colin, I should have continued to make it clear. My first post used the word ‘reflectance’ four times, my second one not at all, but it did refer to the same spectra.\n\n","date":"April 10, 2013 at 7:50 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30193","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nThibault HEIMBURGER :\nThank you for the answer.\nBut….\n“If bilirubin starts greening up on TLC plates within hours, – and verdins are just one class of photoderivative – then what chance is there that it would or could survive centuries on linen, exposed to light and air?”\nAccording to Adler, he found in the samples taken at the margins of the bloodstains (serum) many “olive” (green + yellow) shards (verdin ?)\nThe TS was very rarely  exposed to light. In addition the bloodstains are completely dried.\nDo you think that taking into account these conditions, the bilirubin would have been completely destroyed ?\nAdler used the Erlich’s reagent using the method of Jendrassik (microspotting technique). “Using the same microspotting technique as described above, characteristic blue azobilirubin colors could be positively detected in reflected light on the surfaces of the olive colored shards, the orange globs, and also, weakly on the more orange colored red coated fibrils. The test was sensitive to acid, turning a paler purple, and was discharged by 10 minutes of short wave UV light as is characteristic of this color test. In the previous spectral work it was noted that a peak does appear both in the whole cloth reflection studies and in micro-spectrophotometry of the tape samples at about 450 nm. This is quite typical of bilidienes and similar bile pigments structures…”\nI understand that the Erlich (classical) test for bilirubin was positive and that the spectra were consistent with the presence of bilirubine.\nFor me, taking into account all the parameters (the bood on the TS is real blood, olive color of some of the “objects” mainly found in the serum areas, the results of the Erlich tests on these objects, macro and microspectrometry data) are self consistent.\nIf you think that there is no bilirubin, you must interpret the Erlich test results as a false positive. Is it a false positive and if so what are the other possibilities ?\n\nI could respond to TH’s progressively deeper inquisitions, almost as if I were on trial here, having every word finely scrutinized – almost at a microscopic level -for its accuracy. But I shan’t. This nonsense has to stop. What’s in the frame here is not what I write about Adler’s appalling exposition of his so-called “science”  (one hopes the science itself was better than his exposition thereof) but the exposition itself. Am I the only one to consider that passage was essentially gibberish?\n\n","date":"April 9, 2013 at 8:24 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30103","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Correction: that link did not go to the particular passage I had in mind. Here it is in full, with the most egregiously unscientific part highlighted. It’s also worth keeping in mind that the writer had himself acknowledged years earlier that bilirubin was photosensitive and thus unstable on exposure to light and oxygen, yet here he is using it to “explain” not only a colour change, but one that survives centuries. It is Adler who should be under your microscope, TH!\n    … The next test we did was to take micro-spectrum photometry of the non-birefringent red-coated fibrils from the Shroud. It was obvious that the spectrum it produced did not match the spectrum of methemoglobin, at least as it is given in the standard references, which is a solution spectrum of blood. But in a film of hemoglobin there is a confirmation (sic) change ;it no longer remains in the “met”form but goes to the para-hemic form. It is  known now that there is a certain species which will spontaneously go the para-hemic form if there is not enough turnover in the spleen and liver to process the blood fast enough. We found a spectrum that was characteristic of only one known group of compounds -the so-called high spin, high iron porphyrin. So instead of being wrong, the spectrum peaks were in the right place. What we were seeing was the breakdown products of hemoglobin – bilirubin and biliverdin. And one began to make sense out of all of this. There is an extraordinarily high bilirubin count, almost as high as the methemoglobin. Now how does one account for such a high bilirubin  in a person? One possibility is that the person had a severe malaria, but this does not seem very likely. But a torture, scourging and crucifixion leading to shock – that would produce a tremendous hemolysis. In less than 30 seconds the hemolyzed hemoglobin would run through the liver, building up a very high bilirubin content in the blood. If that blood then clots, an exudate forms, and all the intact cells with bilirubin stay behind, only the hemolyzed hemoglobin goes out along with the serum albumin which binds the bilirubin. So what one ends up with is on the cloth is an exudate which has an enhanced bilirubin with respect to the hemolyzed hemoglobin.You now mix bilirubin which is yellow-orange with methemoglobin in its para-hemic form which is an orangey-brown and you get blood which has a red color.\n    In fact, we have been able to simulate the spectrum in the laboratory by the process described above. This very strongly suggests that the blood stains are of a man who was severely beaten. No one would have ever dreamed when we first started doing the analysis that the chemistry would provide corroborating evidence to what the pathologists concluded long ago about the Shroud figure. The blood has no cells, is very low in potassium, and has the right color and composition for the blood of a man who was severely flogged and crucified. This is entirely consistent with the forensic evidence…”\n\n","date":"April 9, 2013 at 8:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30105","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"My question was (in short) : according to you is there bilirubin in the TS bloodstains ?\nYou wrote:  # 197 : “Nope, no bilirubin on the Shroud”.\nI have the answer.\nBut, you obviously refuse to answer to my very basic questions (# 198).\nYour answer: \nCB:  ” I could respond to TH’s progressively deeper inquisitions, almost as if I were on trial here, having every word finely scrutinized – almost at a microscopic level -for its accuracy. But I shan’t. This nonsense has to stop. ”\nInquisitions. Nonsense. In fact you can not answer to my questions.\nIn addition, on your own blog you wrote 6 days ago: “I remain to be convinced that there is ANY surviving bilirubin in Shroud blood, and even if there were, I defy anyone to show it can link up with oxidized haemoglobin (methaemoglobin) to form a permanently red pigment”.\nI would like to see where Adler wrote or suggested  that “surviving bilirubin” was BOUND to oxidized  methemoglobin .\n\n","date":"April 10, 2013 at 5:10 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30249","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Yes, there is a gadfly quality about your persistent buzzing around, TH, and half the time I don’t have the faintest clue what it is you expect of me. I’ve already  said I don’t think there is ANY bilirubin on the Shroud. So you come back and say it has been kept in the dark for most of its history (how can you possibly know that?). What response are you expecting – that I will go away and reconsider my answer? Repeat: I do not consider there is ANY bilirubin on the Shroud.\nAnd what am I supposed to make of your “I have the answer”? The answer to what? Life? The Universe? Or do you have evidence there is bilirubin on the Shroud. If so, please elucidate. I’m all ears…\n\n","date":"April 10, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30254","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Oh, and as regards the positive Ehrlich diazo test: you are aware, aren’t you, that the Ehrlich reagent, diazotized sulphanilic acid, can be used to make literally hundreds of different azo dyes, with all the colours of the rainbow, simply by coupling to any of a wide range of phenols, naphthols etc. The only reason why it works specifically with bilrubin is firstly  that  fresh authentic blood is reasonably free of interfering agents (phenols etc) and secondly such interference as does exist can be countered by adding alkali at the end which converts the red/violet azobilirubins to a blue form which is less interference-prone. What you cannot do is take Shroud blood and imagine it is the same well-defined predictable stuff as the blood sitting in in a hospital fridge.\nThere is also the fact the Adler did not use his Ehrlich reagent in a test-tube. It was spotted onto fibres, and he observed bits of blue colour here and there. That’s simply not good enough to make a positive identification of bilirubin, even with the added touches (uv bleaching etc). \nHere’s what he should have done as a bare minimum. Instead of using polar diazotized sulphanilic acid, he should have used the more lipid-soluble diazotized ethyl anthranilate, then extracted the azobilirubins into organic solvent, and then run on TLC against authentic standards. \nBasing a test on a blue colour, when a diazo reagent can produce them non-specifically from so many coupling agents, is simply not world class science, which the world had a right to expect from Adler. I see no evidence at all that he ever consulted bile pigment specialists or used any of the then state-of-the-art technology. Why are you defending the man, given he floated his bilirubin hypothesis in that Orphaned Manuscript three years after acknowledging that bilirubin was constantly degrading on exposure to light and oxygen?\n\n","date":"April 10, 2013 at 5:59 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30257","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :\n#214\njesterof,\nCan you help me out just a little bit with understanding this, are these values (encountered ones, see quote below) in reference to the data on pg. 31 in the Adler book that you mentioned earlier #206?  This is line B?\nThe blood on the shroud is deoxygenated, obviously, so its charachteristics are in a totally expectable range of the wavelenghth ( I encountered 420-450, 560 and one peak for one sample 600 nm).”\nAnd also, to understand correctly, the main point you are making is that even from the spectral data, one can see that the color/wavelength does not even begin to approach where red, intense red color lies?\n\nyes, exactly. Red starts above 600, and it is very dark red. The fully oxygenated bright red arterial blood will be in the very high portion of thee scale.\nI encountered in descriptions of the Shroud’s blood samples the wavelength of 400-450 and somewhere else one sample was also described as ~ 600 ( maybe 620, can’t find it immediately)\nThe wavelength and it’s correspondence to the colors is well known :\nhttp://science-edu.larc.nasa.gov/EDDOCS/Wavelengths_for_Colors.html\nobviously there are combinations of colors – brown is not in the standard spectrum, but it is low on the wavelength\n\n","date":"April 9, 2013 at 9:48 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30110","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Here’s a handy graphic for those wanting to get a handle on the colours of dyes and pigments in relation to their absorbance of visible light of differing wavelengths. \n\nIt confirms what I was saying earlier about red dyes absorbing blue or blue-violet light, and blue dyes absorbing red or orange-red light, while a green dye is one that absorbs both red light and blue light.\nSo if one is attempting to explain a blood-red colour, one expects to see maximum absorption at -or a little above – 500nm and minimum absorption of red light in the region of 600nm. So it’s a mystery why there are these constant references from anoxie and jesterof to the 600nm region. That is the wavelength of red light certainly, but is of NO relevance to the perceived colour of a dye that is the result of a subtractive process. The only possible relevance is in a negative sense, i.e. that the greater the absorption at 600nm, the greater the filtering out of red light that would otherwise be transmitted by a blue-subtracting chromophore, and the WEAKER the red colour one would observe.  \nHere endeth this morning’s (photo)chemistry lesson.\n\n","date":"April 10, 2013 at 5:20 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30165","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Because we are right and you are wrong . I suspect Anoxie works with practical application of the wavelength absorption of the whole blood as I do and if the TECHNOLOGY is based on the wavelength of 650 – 950 for specifically blood, you may post as much curves as you want, but RED whole blood starts to absorb RED light not earlier than 600 nm.\nIt is a practical application of the light absorption not just tfeory on MONOCHROMIC plots. Blood is not monocgromic\n\n","date":"April 10, 2013 at 10:32 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30203","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#222\nJesterof,\nI understand wavelength, correspondence to colors, visible light spectrum, etc., just wondering where the values from the Shroud samples came from, which data you were looking at-I saw mention of the previous reference to page numbers in Adler’s book, was trying correspond the two.\n\n","date":"April 10, 2013 at 5:40 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30168","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Yes, it was Adler’s book with a name with manuscript ( or similar) can’t post a link now – I am posting from the phone. He was actually comParing the stains from the Shroud to 1 year old stains of the whole blood of his assistants and the latter got 650 or so absorbtion wavelength.\n\n","date":"April 10, 2013 at 10:45 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30204","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"http://books.google.com/books?id=J2jBnDN3VxMC&pg=PA30&lpg=PA30&dq=spectral+data+of+the+Shroud+blood&source=bl&ots=zenDjCt69-&sig=WmPZiDBpkxQp61QSspVy4ZjVddk&hl=en&sa=X&ei=F3djUc-uOYmi8gTL1oCIBw&ved=0CKoBEOgBMA0#v=onepage&q=spectral%20data%20of%20the%20Shroud%20blood&f=false\n\n","date":"April 10, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30230","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"#219\nHugh,\nThanks-do you happen to have the Pellicori paper “Spectral properties of the Shroud of Turin” Applied Optics 19, 1913, 1980?  I am heading out the door here, but are some additional data, includes Gilbert mean data for comparison in Fig 4, also other data, other Figures.\nRegarding the 610 spike, a touch up of non blood materials-I think I know the answer on this one, but have any blood samples that soaked through to the reverse side ever been analyzed/compared spectrally?\n\n","date":"April 10, 2013 at 6:07 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30173","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"There needed to be only one touching-up exercise (or Rolfe-like concession that it may have taken place) to render null and void all the research on:\n(a) ABO blood grouping\n(b) authenticity or otherwise of bloodstains\n(c) the “blood-before-image” claim-cum-mantra- a prerequisite for authenticity\n(d) the entire Adler/Shroud canon on the nature of the Shroud’s bloodstains (serum exudate etc).\n(e) the final STURP report’s conclusions that the blood on the Shroud was genuine human blood consistent with a scourging/crucifixion narrative as per Gospel accounts.\nIf there is any fake “touching-up” blood on the Shroud, then who is to say that ALL of it is not fake – of medieval provenance?\n\n","date":"April 10, 2013 at 6:30 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30179","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Correction: Adler/Heller\n\n","date":"April 10, 2013 at 6:32 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30180","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Kelly, I do have Pellicori’s paper, and I’m afraid it reads a little like the special pleading of the kind Colin so abhors.\nAll blood spectra, whether derived at random from the internet, specifically related to forensic investigation like Bremmer’s paper, or even those in Pellicori’s paper, show a small reflectance bump (absorption trough) at about 500nm, twin reflectance troughs (absorption bumps) at about 525nm and 575nm, and a steep reflectance increase (absorption decrease) from about 600nm to 700nm. The type of blood, its brightness, substrate or its age produce variations on the theme, but the general description above appears to apply to it all.\nThe shroud stains, by Pellcori’s own admission, exhibit none of these characteristics except the steep 600nm-700nm slope. And they do have that most uncharacteristic reflectance peak (absorption dip) at 600nm. Neverthless, Pellicori concludes that “there is, however, sufficient correlation in the spectrophotometry to decide that the material on the shroud is blood.” He reinforces his conclusion by saying that “the resemblance to blood as seen in the photomicrography in these areas is strong.” He finally decides that the shroud spectrum “suggests denatured met-hemoglobin” to which all I can say is; not to me, it doesn’t.\n\n","date":"April 11, 2013 at 6:13 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30323","author":"Hugh Farey","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"So, Shroud blood is nothing like ordinary blood – unless one is prepared to ignore textbook spectra –  and the difference cannot be explained away by invoking bilirubin (unless one rewrites the textbooks on that photosensitive pigment too). Yet received wisdom, c/o STURP, is that the blood on the Shroud is entirely consistent with human blood, right down to Group AB.\nHow did we ever come to find ourselves in this place? Somewhere there has been a massive failure in the methods of “science”.\nTo Adler and Heller’s credit, they did note the paucity of potassium and red blood cells – but tried to explain that away with their “exuded serum from retracted blood clots” hypothesis. Some might think that the prominence of the blood stains belies that explanation, and in any case it would not have been rocket science to have measured the ratio of porphyrins to serum proteins to test that idea – which I strongly suspect to be another of those self-serving authenticity-promoting ones designed to kill a second bird with the same stone (attempting to explain how hours-old blood could still manage to leave almost stencil-like imprints on linen).\nSquare One is calling us back, methinks. Leech blood anyone?\n\n","date":"April 11, 2013 at 7:22 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30335","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\njesterof :\nBecause we are right and you are wrong . I suspect Anoxie works with practical application of the wavelength absorption of the whole blood as I do and if the TECHNOLOGY is based on the wavelength of 650 – 950 for specifically blood, you may post as much curves as you want, but RED whole blood starts to absorb RED light not earlier than 600 nm.\nIt is a practical application of the light absorption not just tfeory on MONOCHROMIC plots. Blood is not monocgromic\n\nYou need to learn some elementary physics…\n\n","date":"April 10, 2013 at 10:46 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30205","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"And you need to learn some elementary principals of application of physics which you obviously lack.\nI am not even labeling your trick of substituting dyes for whole blood and expecting nobody will see it\n\n","date":"April 10, 2013 at 11:01 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30207","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I think I know the source of your confusion. You are taking the diagnostic wavelengths that are used in pulse oximetry to distinguish between oxygenated and deoxygenated blood, and assuming that if they can be used to discriminate between their two shades of red, then they are universally applicable to all situations where there is a difference in redness. That is not so. The wavelengths chosen have nothing to to with the primary reason for redness – i.e. absorption of blue wavelengths. By operating in the red there might be an attempt to pick up a small difference in red filtering, but I suspect that the main reason is that oxygenated and de-oxygenated haemoglobin just happen to have sizeable relative differences in their absorbances in the red that can be measured with good sensitivity, despite the relatively low absorbances compared to those at the blue end (recalling that absorbance scales are logarithmic and that by far and away most absorbance is in the blue.)\nBut with Shroud blood, whether “as is” initially, or pre-processed, as in a leech, we are not dealing with native oxygenated v de-oxygenated. blood  as tested in hospitals.  All the blood will be in the aged oxidized methaemoglobin state (at least) with the iron in the +3 oxidation state. That would preclude the reversible binding of oxygen that occurs in non-denatured blood. Anyone wishing to explore the colour differences between “ordinary” aged blood (brown or black) and anomalously red or red-brown Shroud blood would be exceedingly unwise to confine their search to the red wavelengths at 600nm or higher., and be sadly misguided if relying on pulse oximeter theory or practice. The only folk likely to do that would be trainee technicians with a limited grasp of scientific principles. One can make allowances for technicians. However, I would not expect a physician with a proper and thorough preclinical training to make so elementary an error… (Yes, I was once a preclinical lecturer at a major London teaching hospital).\nYou did say you were a physician, didn’t you? Or was it ‘medically trained’?\n\n","date":"April 10, 2013 at 11:31 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30212","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :\nBut with Shroud blood, whether “as is” initially, or pre-processed, as in a leech, we are not dealing with native oxygenated v de-oxygenated. blood  as tested in hospitals. \n\nIt does not matter, or you think that live blood can not contain methhemoglobin?\n\ncolinsberry :\n All the blood will be in the aged oxidized methaemoglobin state (at least) with the iron in the +3 oxidation state. That would preclude the reversible binding of oxygen that occurs in non-denatured blood. Anyone wishing to explore the colour differences between “ordinary” aged blood (brown or black) and anomalously red or red-brown Shroud blood would be exceedingly unwise to confine their search to the red wavelengths at 600nm or higher., and be sadly misguided if relying on pulse oximeter theory or practice. The only folk likely to do that would be trainee technicians with a limited grasp of scientific principles. One can make allowances for technicians. However, I would not expect a physician with a proper and thorough preclinical training to make so elementary an error… (Yes, I was once a preclinical lecturer at a major London teaching hospital).\nYou did say you were a physician, didn’t you? Or was it ‘medically trained’?\n\nthe “anomality” of the redness of the Shroud’s blood is only in you wishful thinking. It is not anomalous at all – the range of the wave absorption is in 400-450 range with only one spike of one sample to about 600.\nAnd since you obviously have had no idea about the pulse oximetry technology and its practical application of the wavelength above 600 you might be parascientifically trained, don’t you?\n\n","date":"April 10, 2013 at 2:51 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30231","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"I’ve said all I want to say regarding the science (maybe in the fullness of time we’ll have some 2nd or 3rd opinions that will show which of the two of us has the better grasp of scientific principles). \nAs for your attempting to dismiss the Shroud blood colour anomaly, I can only repeat what I said earlier: no one on this site had any trouble with Adler pointing it out, not while there was an authenticity-promoting narrative to account for it – that fanciful bilirubin story. \n It’s only when I come along, first pointing out (a year ago) that bilirubin could never have survived intact for centuries in Shroud bloodstains, and then, just a couple of days ago reported here a quotation from 1999 in which Adler himself had acknowledged as much, that all of a sudden there is no red anomaly, that it is all just a figment of our imaginations. \nIf there were no spectral signature for that red anomaly, then how could Adler have claimed to have modelled it with combinations of methaemoglobin and bilirubin? Are you aware that it is not me you are contradicting, so much as Alan D.Adler?  Speaking for myself, I have no objection to your doing that – but do make an effort to maintain a modicum of scientific and logical consistency.\n\n","date":"April 10, 2013 at 3:19 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30236","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Oh, and BTW, Colin, you have demonstrated this before – when you are upset, you tend to denigrate your opponents. \nWhy are you, upset, Jupiter?\n\n","date":"April 10, 2013 at 3:07 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30234","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :\nI’ve said all I want to say regarding the science (maybe in the fullness of time we’ll have some 2nd or 3rd opinions that will show which of the two of us has the better grasp of scientific principles). \nAs for your attempting to dismiss the Shroud blood colour anomaly, I can only repeat what I said earlier: no one on this site had any trouble with Adler pointing it out, not while there was an authenticity-promoting narrative to account for it – that fanciful bilirubin story.\n It’s only when I come along, first pointing out (a year ago) that bilirubin could never have survived intact for centuries in Shroud bloodstains, and then, just a couple of days ago reported here a quotation from 1999 in which Adler himself had acknowledged as much, that all of a sudden there is no red anomaly, that it is all just a figment of our imaginations.\nIf there were no spectral signature for that red anomaly, then how could Adler have claimed to have modelled it with combinations of methaemoglobin and bilirubin? Are you aware that it is not me you are contradicting, so much as Alan D.Adler?  Speaking for myself, I have no objection to your doing that – but do make an effort to maintain a modicum of scientific and logical consistency.\n\nIt does not matter WHOM I am contradicting, because as I have stated at the very beginning – the whole concept of too bright, too fresh or too red – is flawed, IMHO, as it is based on the subjective evaluation. If Adler picked up the battle – it is not my concern, but his own evaluations have shown the wavelengths of the samples way below the 600 nm of the live blood I was initially referring to.\nThe wavelength absorption of the whole blood depends on it’s pH, the hemoglobin concentration and some other conditions, which are applicable to dried blood as well.\nWhy did he picked up the battle with bilirubin ( which is not a stable compound, does not interfere with live blood spectrophotometry, at least the one used for pulse oximetry evaluation) I do not know.\nI am not defending him in particular, I am trying to find out what started this strange description  “the blood on the Shroud looks too fresh” when the data does not support this assumption at all.\n\n","date":"April 10, 2013 at 3:49 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30238","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"One more to add – the wavelength absorption differs dramatically depending on the method used. \nSo if this is taken into account, the spectrum of blood absorption ( talking about live blood) ranges from low 400s to infrared spectrum.\n\n","date":"April 10, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30239","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\njesterof :\nYes, it was Adler’s book with a name with manuscript ( or similar) can’t post a link now – I am posting from the phone. He was actually comParing the stains from the Shroud to 1 year old stains of the whole blood of his assistants and the latter got 650 or so absorbtion wavelength.\n\nJesterof, \nOkay-got it-Thanks\n\n","date":"April 10, 2013 at 4:59 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30246","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\njesterof :\nYes, it was Adler’s book with a name with manuscript ( or similar) can’t post a link now – I am posting from the phone. He was actually comParing the stains from the Shroud to 1 year  old stains of the whole blood of his assistants and the latter got 650 or so absorbtion wavelength.\n\nJesterof,\nOK-got it-Thanks\n\n","date":"April 10, 2013 at 5:03 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30247","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"jesterof,\nI have a few other questions I wanted to get your thoughts on, if okay.\nNo super rush-will be away for the next couple of days, but wanted to hear your comments.\n1. It has been reported that (fresh) whole blood applied to Saponaria-treated cloth retains a red color, whereas that applied to similar cloth that has not been treated changes from red to brown.  The red color on the Sap-treated cloth has been reported to persist for 25+ years.    \nIn general, even apart from possibles implications related to the Shroud,  any thoughts on the molecular basis for the persistence of the red color with Sap-treatment?\nI can understand that Sap is hemolytic and permeabilizes RBCs, releasing hemoglobin, but why would such hemoglobin not undergo typical oxidation (as indicated from the typical red -> brown color change).  Could the porphyrin ring be stabilized through an interaction with the (treated) cloth?  Or are the differences between the reported colors both within the range of variation, is it oversimplified to base this on visual appearance alone?\n2. The side wound-in your view, would the fluid that appears to be mixed with the blood in this bloodstain represent released pleural fluid that has built up in the lungs-or fluid from the piercing of the pericardial sac-or both?  Also, what is the main basis for this being classified as a post-mortem wound from the appearance of the bloodstains alone-is it the blood flow pattern or the fact that just not that much blood flows, indicating that the heart was not pumping at the time the wound was made?  \nRelated to the latter, if the wound had been made pre-mortem, and then much of the blood wiped away after the person had died, and the blood that you see resulting from post-mortem seepage from the wound, would you be able to distinguish this from a post-mortem wound, with no wiping away of blood?\n3. It has been suggested from viewing the negative images that the man on the Shroud  exhibits an extended chest and a distended abdomen, consistent with respiratory distress, difficulty in breathing-in your view, is this consistent with the appearance from the negatives, and physiologically does this make sense?\nThanks again for your time.\n\n","date":"April 10, 2013 at 9:09 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30276","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Jesterof,\nQuick follow up to previous post on Sap-treatment, didn’t mean to imply that the oxygen had to be remaining bound here (just relating that to typical association with color change), hemoglobin could be oxidized, but why the persistence of the red color relative to that which dries on untreated cloth (brown)-can the conformation of the heme be stabilized/affected differentially as a bloodstain dries on certain textile materials as opposed to other surfaces?\n\n","date":"April 11, 2013 at 6:20 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30324","author":"Kelly Kearse","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"2. The side wound-in your view, would the fluid that appears to be mixed with the blood in this bloodstain represent released pleural fluid that has built up in the lungs-or fluid from the piercing of the pericardial sac-or both? Also, what is the main basis for this being classified as a post-mortem wound from the appearance of the bloodstains alone-is it the blood flow pattern or the fact that just not that much blood flows, indicating that the heart was not pumping at the time the wound was made?\n as I remember by the Scriptures the side wound was made after Jesus died – to confirm it. Obviously, the blood from that wound is not a whole blood, but an addition to interstitial fluid, probably pleural transsudate and quite possibly from pericardial sack. If it was deep enough then the heart wmight have been damaged as well – and from the heart the whole blood might have poured. wholecould have al been flawing from the big vessels in the lungs. Distinction with a postmortem wound vs alive has to based on a different charachteristics – I do believe that those have been described before quite a bit. I am not a phorensic pathologist per se and ifyou want me to find the educational materials ton the subject, I certainly can do it, only it will require for me some time.\n.cl\nRelated to the latter, if the wound had been made pre-mortem, and then much of the blood wiped away after the person had died, and the blood that you see resulting from post-mortem seepage from the wound, would you be able to distinguish this from a post-mortem wound, with no wiping away of blood?\n\n","date":"April 11, 2013 at 12:43 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30362","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nKelly Kearse :Jesterof,\nQuick follow up to previous post on Sap-treatment, didn’t mean to imply that the oxygen had to be remaining bound here (just relating that to typical association with color change), hemoglobin could be oxidized, but why the persistence of the red color relative to that which dries on untreated cloth (brown)-can the conformation of the heme be stabilized/affected differentially as a bloodstain dries on certain textile materials as opposed to other surfaces?\nTHere is NO ersistent red color remaining\nThere\n\n","date":"April 11, 2013 at 12:35 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30361","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Take a look at the epsilon bloodstain on Shroud 2.0 App – Dan’s current posting – especially on the 1-over-3 crossover theads of the herringbone weave. They are faint pink, not the brown that one would expect of centuries old oxidized haemoglobin. This ain’t no normal blood we are looking at. It’s as if the haemoglobin has been cured and preserved, like the muscle myoglobin in ham or bacon. Methinks the chemistry might be the same, as I suggested earlier (nitrite ion and/or nitric oxide has bonded onto the oxidized Fe(III)iron centre of the haem. So there  ;-)\n\n","date":"April 11, 2013 at 12:56 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30365","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Colinberry; “This ain’t no normal blood we are looking at.” Finally, someone sees the light. This ain’t no normal blood is absolutely right, it is the blood of Christ….Mystery solved.\nR\n\n","date":"April 11, 2013 at 1:09 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30368","author":"Ron","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"at 600 nm hemoglobin is totally deoxygenated and it is a dark color blood. very dark. I do not see it as red remaining, I see it a bit more reddish than the others, which are clearly BROWN, as they are supposed to be. With the reference to the stain color of experimental blood stain of 1 year old ( as described in that Adler’s experiment – I have no reason not to believe him) – that stain was absorbing 650 nm and he described it as GARNET colour, and garnet is very, very, very dark red, almost black. So why it is so persistently related at 600 nm as RED is beyond my understanding.\nMaybe it was washed out with something, maye it was washed by Saponaria and it had it’s own effect on it ( it looks somewhat washed, at least on the app) – it could have been washed by other fluids, the Ahroud has been through a lot during 2000 years.\nI simply can not understand WHY even the defenders of the original authenticity are describing something with the lower wavelength absorption spectrum than the one which is a very dark color of the experiment they conducted as “reatining red color”.\nI am sorry, but if a patient has a hemoglobin level of 10 – he is anemic, and you can not call him somewhat anemic, comparing him to somebody with hemoglobin level of 11 and calling that one severely anemic.\nIt just does not make any sence to me – at all.\nAll this bruha-ha around one stain with one spike to the level which is not even abnormal, and the decades-long battle around linguistics.\n\n","date":"April 11, 2013 at 12:54 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30364","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"As to the changing of the color of a blood stain after you wash it with something – just from clearly practical point of view – if you have a blood stain which you want to wash out – one never uses hot water, because hot water will permanently stain the cloth, only with cold one. How it changes the color – needs to be observed experimentally, but from my practical remembrance ( washed blood stains from the white coat million times) it does lightens it.\nSo just plain WATER, simly hot, not cold washed over the stain could permanently change it – and it could have been water, which was used while the fires were put down ( we know about the on big fire and even have the water stains as a proof, but there could have been MORE, or hot water was splashed on the Shroud by any other occasion).\nSo even if just plain hot water can permanently change the blood stain, imagine when something is added to the water.\nOr water could have had a lot of the ions which will react with the stain – water splashed over the Shroud was not distilled or even clean – there are million possibilities.\n\n","date":"April 11, 2013 at 1:05 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30367","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :Take a look at the epsilon bloodstain on Shroud 2.0 App – Dan’s current posting – especially on the 1-over-3 crossover theads of the herringbone weave. They are faint pink, not the brown that one would expect of centuries old oxidized haemoglobin. This ain’t no normal blood we are looking at. It’s as if the haemoglobin has been cured and preserved, like the muscle myoglobin in ham or bacon. Methinks the chemistry might be the same, as I suggested earlier (nitrite ion and/or nitric oxide has bonded onto the oxidized Fe(III)iron centre of the haem. So there ;-)\nme thinks it was just washed out by hot water LOL\n\n","date":"April 11, 2013 at 1:10 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30369","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"and if theat is PINK – you are clearly color blind, colin\n\n","date":"April 11, 2013 at 1:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30370","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\nRon :\nColinberry; “This ain’t no normal blood we are looking at.” Finally, someone sees the light. This ain’t no normal blood is absolutely right, it is the blood of Christ….Mystery solved.\nR\n\nGod must have a sense of humour then – in first sending STURP to suggest it was all to do with bilirubin…\n\n","date":"April 11, 2013 at 1:22 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30371","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"colinsberry :(nitrite ion and/or nitric oxide has bonded onto the oxidized Fe(III)iron centre of the haem. So there ;-)\nYESSSS!!! EXACTLY!!!! Thank you, Colin.\nNitrites and nitrates are ABUNDANT in water – in ponds, in rivers, EVERYWHERE.\nThey poured contaminated by nitrites and/or intrates water from the near-by source when the fire was put down – because of the flames and temperature – water became hot ( it has to be just 40C to permanentlystain) – and here you go – the stain is washed out and has that ONE SPIKE to 600 nma and some colorblind sceptics call that stain PINK ;-)\nP.S. I suppose, you do not think they used Aquafina for the fire :-))))\n\n","date":"April 11, 2013 at 1:23 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30372","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :\n\nRon :Colinberry; “This ain’t no normal blood we are looking at.” Finally, someone sees the light. This ain’t no normal blood is absolutely right, it is the blood of Christ….Mystery solved.R \nGod must have a sense of humour then – in first sending STURP to suggest it was all to do with bilirubin…\nSTURP do not differ from you at all – in terms of absolut disconnect of the “pure scientist” from the practical world as is so clearly\n demonstrated by the arguments from BOTH sides.\n\n","date":"April 11, 2013 at 1:33 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30378","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"Your own particular agenda, aka hang-up, is becoming plainer by the minute…\nReminder: scientists and technicians need each other…\n\n","date":"April 11, 2013 at 1:36 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30379","author":"colinsberry","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"\ncolinsberry :Your own particular agenda, aka hang-up, is becoming plainer by the minute…Reminder: scientists and technicians need each other…\nyes, because they are  alike – operate in a very limited world.of protocols… at least some scientists, I won’t point fingers :-)))\n you are way  too sensitive to the mocking (when it comes to you precious self) for a seasoned scientist ***rolling eyes smiley***\n\n","date":"April 11, 2013 at 2:36 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30389","author":"jesterof","site":"shroudstory"},{"title":"Blood Clotting and the Strange Case of Brother Hirudo","post":"jesterof, Hugh \nThank you for your comments on my recent  Q.  a couple of days ago-am now back-\nThis doesn’t have to be a closure on the thread, per se, but just wanted to acknowledge-I very much appreciate your taking the time-\n\n","date":"April 12, 2013 at 8:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","id":"comment-30548","author":"Kelly Kearse","site":"shroudstory"}]
