[{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"The “Blood (red) on the Shroud face in fluorescent light” illustration here is biased/most inaccurate. The transverse crease in the cloth just under the jaw-line is not that bloodied at all and very fine tiny blood details (< 0,5mm) are either half or totally lost.\n\n","date":"February 18, 2013 at 8:18 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24669","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Typo: < 0,5cm\n\n","date":"February 18, 2013 at 8:19 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24670","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Even the water stain looks “bloodied”?l\n\n","date":"February 18, 2013 at 8:36 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24672","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"BEWARE! Jones also used a photograph that is presented on SST as “2002 Durante Shroud Face Photograph”. Now it is actually nothing but a close-up view of the 2002 Durante Shroud OVERALL PHOTOGRAPH. Many significant tiny details (among which the same tiny bloodstains < 0,5cm) are lost.\n\n","date":"February 18, 2013 at 9:09 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24678","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Bloodstains. As usual, the “obvious” turns out to be almost the exact opposite. While few (perhaps none) of Stephen Jones’s observations are incontrovertibly incorrect, even fewer (perhaps all) are utterly unchallengeable.\nLet’s take a few, probably in no particular order.\n1) The two different angles of flow on the forearms correspond to the two different angles at which they were suspended on the cross. If this is so, then that pattern was maintained after the blood dried, the body was removed from the cross, transported to the tomb and ended up being transferred to the shroud, without being rubbed or washed off…\n2) unlike the dribbles of blood which would have descended from the spear thrust, which have mysteriously disappeared, to be replaced by the randomly directed dribbles we see today, zigzagging around below the wound and flowing from one side to the other of the shroud. From one side to the other at least twice, or possibly from one side to the other and back again. There is no pooling of blood in the middle, as might be expected from a shroud carrying a body – so how did it dribble across? Presumably it was before the body was placed on top, and dried so quickly that the body did not smudge or distort it all as it was laid down.\n3) It is easy to find pictures of people who have suffered head traumas. Do they have clean, stain-free hair, with a handful of well defined dribbles placed on the surface, as we see on the shroud? Nothing like. Blood, people seem to forget, starts at the scalp, and oozes its way through. If Jesus’s hair was matted with blood, it did not transfer to the shroud at all. Curious. Some people have suggested that the blood came from the sides of the face when the cloth was wrapped around the head (but nothing was transferred from the hair), and then the shroud was realigned to receive the image of the hair. If it is hair, and not a packing of spices.\n4) There have been quite convoluted attempts to distinguish between bloodflows that occurred during crucifixion and dried, bloodflows from wounds reopening as the body was taken down, and bloodflows from wounds reopening as the body was laid in the shroud. Also between wet, dry and re-wetted blood, and even venous and arterial. They are not based on the colour or appearance of the blood, but entirely on its position on the shroud, taking it for granted that the flows must be genuine and attempting to explain the inconsistencies. Nothing wrong with that, but the premise is not proved thereby.\n5) The flogging marks. These are very neat and tidy, as if the body had been washed clean, and then new exudates had seeped from the wounds onto the cloth. But if it wasn’t washed (see above for ‘crucifixion’ flows), then where is all the mess?\n6) The serum. The bloodstains are certainly not surrounded by neat rings of serum under UV light. One prong of the wrist stain has a kind of halo, the spear wound has a rim, and there is an interesting pattern on the big foot stain.  Much of the blood is completely without serum.\n7) The Oviedo cloth, to be sure, is not inconsistent with a seriously injured head. In fact it is so heavily marked it is not inconsistent with almost any assembly of serious head wounds. To claim it is a perfect match of blood and fluid stains is wholly unjustified.\nI could go on, but these will be enough, I hope, to encourage people who might otherwise have swallowed Jones’s article whole at least to go back to a photo of the shroud (not that absurdly miscaptioned image which graces Jones’s posting) and see for themselves whether these inconsistencies don’t need answering.\n\n","date":"February 18, 2013 at 10:02 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24686","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Reminder: In the most likely hypothesis the TS is Yeshu’a (an hypothesis NO ONE can totally rule out), the latter’s blood mixed with sweat and desert dust was mostly dried on burial as his bloodied body on the cross was left exposed to a dust storm (khamsin/shrarav/ruaH qadym) for three hours (see The Gospels). Most likely too, it was remoistened for a specific purifying ritual and dried out to observe a funerary custom and practice. At close examination (by an archaeological blood stain pattern analyst and/or archaeological image cryptanalyst), the intriguingly non-disturbed blood stains stains/traces/patterns on the cloth along with the aged degraded blood stain still looking fresh on the cloth can provide important clues on how the TSM’s burial unfolded.\n\n","date":"February 18, 2013 at 2:41 pm","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24711","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Typos; the intriguingly non-disturbed blood stains/traces/patterns on the cloth along with the aged degraded blood stains still looking fresh on the cloth can provide important clues on how the TSM’s burial unfolded.\n\n","date":"February 18, 2013 at 2:48 pm","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24712","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"+ typo: the aged degraded BLOOD still looking fresh on the cloth\n\n","date":"February 18, 2013 at 3:00 pm","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24714","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Hugh, why don’t you tell (late) Prs Bucklin, Baima-Bollone, Zugibe and Cameron are very poor forensic medical examiners when it comes to the Shroud image? Don’t you mistake Jones’ most awkward review of the blood stain issue and the true forensic science behind most of it.\n\n","date":"February 18, 2013 at 3:19 pm","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24717","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Typo:  Prs (late) Bucklin, Baima-Bollone, Zugibe and Cameron\n\n","date":"February 18, 2013 at 3:20 pm","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24718","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"The problem here is we are dealing with ARCHAEOLOGICAL not really fresh blood…\n\n","date":"February 18, 2013 at 3:31 pm","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24720","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Extra care seems to have been taken to keep the blood with body and cloth.\n\n","date":"February 18, 2013 at 4:16 pm","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24724","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Jones’ illustrations for the blood stains issue can be regarded as inferior/biased when compared not only to the original photographs but also to that of the Shroudscope.\n\n","date":"February 18, 2013 at 3:48 pm","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24721","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"While I wouldn’t dream of telling your famous quartet of forensic pathologists their business, I note that they have studiously refrained from telling me mine. Either they have not addressed the issues I have raised, or they have disagreed with each other in their explanations. The question of pre- and post-mortem bloodflows, whether the body was washed or not, the position of the hand wound, the cause of death – on no single one of these are all four scientists agreed. They are scientists, and I’ve no doubt would all attribute their varied conclusions to the fact that they were working from a photograph of a sheet rather than a dead body, but varied their conclusions are, for all that. My inconsistencies remain unexplained.\n\n","date":"February 18, 2013 at 6:43 pm","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24741","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Hugh, lately Mr Collin Berry wrote my theory about the image formation process (due to a specific Judean burial ritual) was “untestable”.\n  He is totally wrong as he is totally ignorant of experimental archaeology (he would better keep in mind chemistry cannot explain/account for everything he sees or thinks he see on the TS).\n  Experimental archaeology e.g. could show you how blood on stiff rigid corpse can be transferred to a shroud, “without being rubbed or washed off”; how post portem handling of the corpse on burial, the presence of a possible loin cloth and pre-burial head cloth can account for most of intriguing bloodstains on the famous cloth etc.\n  The only snag with true experimental archaeology is it has a cost and just cannot be done in a kitchen.\n\n","date":"February 19, 2013 at 6:11 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24801","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Typo: possible pre-burial loin and head cloths\n\n","date":"February 19, 2013 at 6:47 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24804","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"+ typo: truly experimental archaeology/experimental archaeology in the state of the art\n\n","date":"February 19, 2013 at 6:51 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24806","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":"Re to knowing whether the body was washed or not, the issue shall not be tackled from a modern viewpoint as the correct answer just depends on one’s capacity to archaeologically reconstruct the event (most likely a Judean burial) according to a specific purifying and drying out ritual implying shed (innocent) blood being kept/buried with the body.\n\n","date":"February 19, 2013 at 7:10 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24810","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Posting on the Bloodstains","post":">Bloodstains. As usual, the “obvious” turns out to be almost the exact opposite. While few (perhaps none) of Stephen Jones’s observations are incontrovertibly incorrect, even fewer (perhaps all) are utterly unchallengeable\nThey are not MY observations, as though I just made them up off the top of my head. I meticulously referenced each point I made back to the Shroud pro-authenticity literature. And of course, in our postmodern age, ANYTHING can be, and IS, challenged, but that does not thereby make it UNTRUE.\nThere are indeed many problems of understanding how and why the bloodstains appear on the Shroud the way they do, and I don’t pretend to have all the answers. The evidence seems to suggest that the body was washed which moistened the bloodstains and it is that moistened blood which appears on the Shroud, explaining at least partly why earlier bloodstains on the Shroud which would have dried appear to be as fresh as later bloodstains. I will deal with that under section “12.Objections” or “13.Questions.” \nBut it always gets back to the only two reasonable alternatives (see my “1.3 The central dilemma of the Shroud“). Either 1) the Shroud is an incredibly brilliant medieval or earlier FAKE, intended to depict Jesus’ crucified body and blood on it; or 2) the Shroud is AUTHENTIC, the very burial sheet of Jesus, with the image of His body and His blood transferred to it. \nIf the latter alternative is true, as I am persuaded it is, then any problems of how Jesus’ image and blood were transferred to the cloth are merely APPARENT problems. Problems of our limited UNDERSTANDING, not problems in REALITY. After all, we don’t have Roman crucifixion victims and their shrouds available today to scientically study, let alone RESURRECTED ones! \nAnd as my posts say, I am collecting one by one the problems of the only reasonable alternative: the medieval or earlier forgery theory, to be brought together and discussed in  section “9. Problems of the forgery theory.” As will then be seen, any problems of the authenticity theory PALE INTO INSIGNIFICANCE compared to problems of the forgery theory.\nStephen E. Jones\n\n","date":"February 19, 2013 at 8:40 am","url":"https://shroudstory.com/2013/02/18/stephen-jones-new-posting-on-the-bloodstains/","cat":"blood_studies","id":"comment-24848","author":"Stephen E. Jones","site":"shroudstory"}]
