[{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Let’s go back to basics, great interview !\n\n","date":"March 5, 2013 at 9:01 am","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26505","author":"anoxie","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Rudy Dichtl has made great contributions but there is a point where we have to make decisions on the evidence available. Based upon all the evidence available, the Shroud is a burial cloth of Jesus Christ.\nIt is a matter of probabilities. How many Jews were crucified in 30-33 CE who claimed to be the Messiah?\nThat is the specific event we are considering. Best bet is probably only one, but I would like to be challenged on that with specific cases if they exist. Saying there MAY have been others when there is no historical evidence of any others in that time period does not create doubt, reasonable or otherwise.\nYes, there were other individuals who claimed to be the Messiah, but how many were crucified by the Romans circa 30 CE (AD). The Roman historian Tacitus noted that “Christus” was executed by Pontius Pilot at that time period but that the execution didn’t put an end to his superstition which spread to Rome where 20 or so years later Nero launched his persecution of the Christians that ultimately took the lives of Peter and Paul.\nIS THERE ANY OTHER CULT WHICH SPREAD TO ROME AFTER ITS FOUNDER WAS EXECUTED BY PONTIUS PILATE? NAMES PLEASE!!!!\nIt’s circumstantial evidence – you betcha. But every year in the United States where the standard is proof beyond a reasonable doubt, people are convicted of crimes and sometimes executed on the basis of circumstantial evidence.  We do not order our lives by proof beyond a reasonable doubt. The circumstances are such that they establish the authenticity of the Shroud, and, I believe, beyond REASONABLE doubt.\nReasonable doubt is a not a lingering suspicion that comes in the middle of the night. Where the facts point so strongly in one direction, reasonable doubt must then be based on facts. When evidence is adduced that a certain event probably happened, doubt not based on facts is not reasonable.\nThere is no authentic doubt about the Shroud once it is established that it is a linen cloth that once enwrapped the body of a crucified man who was scourged, beaten, nailed to a cross   and his side pierced with a post-mortem (after death) spear wound. There is even evidence that he carried the cross-bar on his shoulders and walked through streets that had limestone stone dust compatible with the streets of Jerusalem. There is also evidence that he fell and because he was carrying the cross-bar, he couldn’t break his fall, injuring a knee and the tip of his nose.\nThe accumulation of facts is overwhelming. The question that nobody has ever answered, given the circumstances is: If not HIM, who?\n\n","date":"March 5, 2013 at 10:49 am","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26515","author":"John Klotz","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Ho hum, well, we covered this a little while ago. Look at all the comments to January 25, 2013 “Eric J. Jumper to Speak on the Shroud of Turin.”\nBriefly:\nSuppose a new Carbon test of the Shroud dates as 30AD plus or minus 100 years, and it is demonstrably the shroud of a crucified man. To within an order of magnitude some 100 000 people were crucified in Judea at that time. One of them was Jesus.\nOur shroud has:\nmarks of the crucifixion – so would all the others\nmarks of carrying his cross – so would all the others\ndust from the streets – so would all the others\nunbroken legs and a spear-wound – as might 25% of the others\nmarks of a flogging – as might 5% of the others\nmarks of a helmet of thorns – as might 1% of the others\nThat gives about a dozen shrouds which could have had similar marks to ours. Or more.\nThe fact that Jesus later achieved a fame that none of the others managed cannot be automatically connected to the preservation of his shroud. No doubt lots of other crucifixion victims had devoted friends and relations.\nThe accumulation of facts turns out not to be overwhelming at all. A nice balance, tipping, if you like, in favour of an identification with Christ, but overwhelming? I think not. Even in the United States, I think I could instill ‘reasonable doubt’ into a jury.\n\n","date":"March 5, 2013 at 2:37 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26535","author":"Hugh Farey","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Honestly, I cannot understand how after so many sound evidences against C14 being an appropiate tool for a case like this, arguments still start by “Suppose a new C14 test dates this or yields that” or “Carbon 14 Dating has to be Redone”.\nI have the impression that the bias introduced in the 80’s where the radiocarbon test emerged as the only feasible technique is still fully operating and trapping the SHroud studies in an endless loop. Well against the overwhelming scientific evidence published since last century’s eighties clearly indicating that C14 test is not an appropiate technique to be applied to the Shroud.\n\n","date":"March 5, 2013 at 4:46 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26541","author":"Gabriel","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"I’m with you on  this Gabriel! The c14 dating done in 1988, atleast to those that have studied radiocarbon dating, it’s methods and shortcomings would have to be BLIND not to see it is not the answer and cannot be used to any certainty on the Shroud with all it’s contamination accumulated over the centuries. A new test would most likely be futile.\nR\n\n","date":"March 5, 2013 at 5:58 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26547","author":"Ron","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"John, just ask a  Muslim. He most likely will reply this is his double/twin ;-)\n\n","date":"March 5, 2013 at 11:17 am","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26518","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"What I would ask for is for any evidence that such a double twin existed outside of Muslim lore. Tacitus was not a Christian and he thought them an ignorant, superstitious lot.\nIf it were a trial, and a man was found with a gun, which matched the bullets which killed somebody, and he was seen with the victim a few minutes before shots were heard. If he were to claim that it was twin brother who he had loaned the gun to for five minutes that  wouldn’t fly if in fact, he produced no evidence indicating that he had, in fact, a  twin brother.\n\n","date":"March 5, 2013 at 11:30 am","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26522","author":"John Klotz","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"No verses explicitly say “double twin” and they are still the subject of controversy. Any impartial,atheist historian who has studied the NT,the Talmud and other non-Christian accounts would agree that if it was not Jesus himself who was crucified there would be no Christianity…. and no other scripture mentioning the event. The other question that arises is: why was so special about this “other man” that he left such an extraordinary image that is even the reason for the existence of the shroudstory blog?\n\n","date":"March 5, 2013 at 11:59 am","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26526","author":"Louis","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Hugh’s list of attributes omits one telling piece of circumstantial evidence.  How many of his dozen or so speculative burial cloths lack a body but would leave an image of an uncorrupted body, unaffected by subsequent corruption and unsmeared by subsequent deliberate removal of the body?  Why would any persons unknown, and entirely notionary, set out to remove a body from its burial cloth within 40 hours after its death?  How many of his putative messiahs had implied before their death that they would then return to life within three days? Such a unique assertion has ever only been made by one person who set himself this daunting task and by all the accounts we have, achieved it.  This alone can be the only explanation of why we now have a burial cloth without a body, but leaving an image of an uncorrupted body apparently in rigor mortis.  Methinks that defence attorney Hugh will have more work cut out for him than he presently imagines to persuade his jury\notherwise.  \nAddendum:  The high quality of the cloth with its 3:1 herring-bone weave is entirely consistent with it being purchased by a wealthy person such as Joseph of Arimathaea, as recorded in all the accounts we have.  Nailed it yet??  [Apologies for the deliberate pun!]\n\n","date":"March 5, 2013 at 4:12 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26539","author":"daveb of wellington nz","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Hugh’s list is chock-full of extraordinary assumptions; 100,000 people crucified? How does one know this? Maybe only 5000 were crucified during the whole period, for all we know, and most would have occurred during the destruction of Jerusalem in 68ad, where I would assume the taking down of the bodies and proper burial were NOT honoured as the Romans would not give a rats a** then about Jewish customs…Then 25% would have been speared instead of having the legs broken? Where does he get that figure, out of a hat? Chances are spearing was a rare and unusual practice. Practically, one could speculate it occurred only 5% of the times. Scourging? Normal? Not from what I have read. Scourging yes, but not the excessive scourging as testified by the image on the Shroud. The crown of thorns is still one very strong point as how many crucified victims do we have knowledge of, that claimed to be a king? Then take the excellent point made by Daveb into account, and one must certainly see the chances are extremely low that the man depicted on the Shroud is anyone other then the crucified Christ.\nR\n\n","date":"March 5, 2013 at 6:17 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26549","author":"Ron","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"One must also wonder, if so many were crucified; Why has in only one circumstance, has evidence been found of a crucifixion victim in the escavation and study of hundreds of tombs surrounding Jerusalem? You’d think was hundreds of thousands of victims. more would certainly show up.\nR\n\n","date":"March 5, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26550","author":"Ron","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Yes, I thought there’d be repercussions. Daveb is, of course, eminently sensible, but Ron – if my style of argument is wrong, don’t fall into the trap of using it yourself. My figure of 100 000 crucifixions was based on 1 per day (for 200 years), which I think is a fairly mild assumption, plus, according to Josephus, 500 a day during rebellions. Is that unreasonable? Upon what do you base your “Maybe only 5000 were crucified during the whole period, for all we know” come from? That’s only 10 days rebellions’ worth.\nNext. You “would assume the taking down of the bodies and proper burial were NOT honoured” when Josephus specifically mentions that they were.\nNext: “Chances are spearing was a rare and unusual practice.” Now I’m guessing, I admit, but it’s a lot harder to smash a wooden beam against somebody’s legs than to run a spear into their heart. If a crucifixion victim were clearly already dead, the token stab with a spear seems an eminently more efficient guarantee of death than going to the trouble of breaking his legs. What makes you think spearing was rare and unusual?\nNext: “the excessive scourging as testified by the shroud.” The bible is quite specific in saying that the scourging was not excessive. Whatever, was excessive scourging rare? According to wikipedia (yes, I know) flagellation was used as a prelude to crucifixion, and at least four Roman authors refer to victims who died of their floggings.\nNext: “the crown of thorns.” What crown of thorns? The Shroud shows numerous bleedings from the scalp, not a crown of thorns. Instead of mocking a man who claimed to be king, a wreath, cap or helmet of thorns could have been inflicted on any leader of any riot, or a soldier, or anyone else who wore identifying headgear.\nFinally. Where are all the crucifixion victims’ skeletons? Why has only one turned up? Perhaps they have been found. Crucifixion, it seems, may well have left no damage to the bones, as the nails slid past them. The one heelbone we have with a nail right through it would be a clumsy exception to the rule. The associated armbones are undamaged (although some archaeologists claim slight abrasions to the inside edges, others don’t).\nNope, I don’t think my assumptions are extraordinary at all.\n\n","date":"March 5, 2013 at 7:13 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26551","author":"Hugh Farey","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"daveb – I tend to agree. If the shroud does date from the 1st century,  I think its highly unlikely that it was not Jesus’s shroud \nIn my view, there are two clear options:\n1. The Shroud is Jesus’s burial cloth\n2. Colin Berry is right\nBerry gets knocked here, but in my view his theory is perhaps the only credible anti-authenticity argument going. Sure, there are some challengeable aspects to his theory, but so there are for the theory that the shroud is Jesus’s burial cloth\n\n","date":"March 5, 2013 at 8:20 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26559","author":"Matthias","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Professor Avinoam Danin devoted a lot of time to studying the Shroud and also mentions the thorns in his beautifully illustrated book “The Botany of the Shroud”. Emphasis must be placed on research on these thorns, and this calls for Church cooperation.\n\n","date":"March 5, 2013 at 7:22 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26553","author":"Louis","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Prevalence of crucifixion: Crucifixion as a form of capital punishment was practised by Persians, Seleucids, Carthaginians, and Romans from about the 6th century BC to the 4th century AD, until Constantine abolished it in the Roman Empire in 337 AD. In 519 BC, Darius I, king of Persia crucified 3,000 political opponents in Babylon;  In 71 BC, following the uprising of Spartacus, the Roman consul Marcus Licinius Crassus crucified 6,000 slaves on crosses set up on the Appian Way between Capua and Rome;  In 88 BC, Alexander Janneaus the Judean king and high priest crucified 800 Pharisaic opponents.  Following the death of Herod the Great in 4 BC, riots broke out in Jerusalem while his heir Archelaus was in Rome obtaining imperial ratification of Herod’s will.  The Syrian governor suppressed the uprising, crucifying some 3,000 Jews.  Further crucifixions followed the fall of Jerusalem in 70 AD, and Nero practised mass crucifixions during his anti-Christian persecutions.  Notwithstanding this prevalence, few bodies have been specifically idesntified as crucifixion victims.  One reason is that crucifixion nails were highly prized as medical talismans by the Roman soldiery.  Another reason is that bones were seldom penetrated by the nails – the Romans were “awfully” good at it.  The identity of the crucfixion victim visible on the Shroud is a fair question. \nFor those who have not already read it, my own attempt at an answer can be found on Andy Weis’ Shroud museum site: http://shroudnm.com/docs/2012-07-09-David-Belz-Shroud-Article.pdf\nTo that I might add my additional comments at #9 above. \nDespite Constantine’s abolishing crucifixion in 337, barbarism continues alive and well in the southern states of Saudi Arabia.  This morning’s news reported that seven young men have been sentenced to three days of crucifixion after which they will be finished off by firing squad.  Their crime revealed by confessions extorted after torture was that as juveniles they were alleged to be part of a ring of jewellery store thieves.  All of them deny killing anyone.  Allahu Akbar anyone?\n\n","date":"March 5, 2013 at 8:59 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26561","author":"daveb of wellington nz","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Why is carbon dating considered to be so important?  Rogers gave us an alternate way to date the Shroud with vanillian.  Are there any other ways to date the Shroud?\n\n","date":"March 5, 2013 at 9:11 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26562","author":"Andy Weiss","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"RE the  Sindon image, the latter can be dated by means of palaeography.\n\n","date":"March 5, 2013 at 9:30 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-26564","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"\nHugh Farey :Yes, I thought there’d be repercussions. Daveb is, of course, eminently sensible, but Ron – if my style of argument is wrong, don’t fall into the trap of using it yourself. My figure of 100 000 crucifixions was based on 1 per day (for 200 years), which I think is a fairly mild assumption, plus, according to Josephus, 500 a day during rebellions. Is that unreasonable? Upon what do you base your “Maybe only 5000 were crucified during the whole period, for all we know” come from? That’s only 10 days rebellions’ worth.\nNext. You “would assume the taking down of the bodies and proper burial were NOT honoured” when Josephus specifically mentions that they were.\nNext: “Chances are spearing was a rare and unusual practice.” Now I’m guessing, I admit, but it’s a lot harder to smash a wooden beam against somebody’s legs than to run a spear into their heart. If a crucifixion victim were clearly already dead, the token stab with a spear seems an eminently more efficient guarantee of death than going to the trouble of breaking his legs. What makes you think spearing was rare and unusual?\nNext: “the excessive scourging as testified by the shroud.” The bible is quite specific in saying that the scourging was not excessive. Whatever, was excessive scourging rare? According to wikipedia (yes, I know) flagellation was used as a prelude to crucifixion, and at least four Roman authors refer to victims who died of their floggings.\nNext: “the crown of thorns.” What crown of thorns? The Shroud shows numerous bleedings from the scalp, not a crown of thorns. Instead of mocking a man who claimed to be king, a wreath, cap or helmet of thorns could have been inflicted on any leader of any riot, or a soldier, or anyone else who wore identifying headgear.\nFinally. Where are all the crucifixion victims’ skeletons? Why has only one turned up? Perhaps they have been found. Crucifixion, it seems, may well have left no damage to the bones, as the nails slid past them. The one heelbone we have with a nail right through it would be a clumsy exception to the rule. The associated armbones are undamaged (although some archaeologists claim slight abrasions to the inside edges, others don’t).\nNope, I don’t think my assumptions are extraordinary at all.\nHugh I think you should go back and read Josephus a little closer. He states clearly that they ‘used’ to bury them properly, but not at that particular time. Meaning except for his few friends, which were taken down, most all that were hanged during the revolt were left to rot. The Romans spared very few, only the woman and children, whom were sold into slavery during and after the revolt in 68…The Romans would not have cared one morsal about Jewish law at that point. Earlier revolts or uprisings in early first century bce or ce palestine were just as violent and uncarring, where most, including woman children were also smited.\nWhere did my 5000 figure come from? Out of a hat just like your 100,000. No one can make an educated or proper guess at the amount crucified. Did Josephus actually count his 5000 a day? doubt it very much, so again an unknown number, that was my point. It could just have been far far less then you GUESSED.\nMost all of the other comments I made, such as spearing being a rare occurance or the crown “cap” of thorns being used in distinction are not my personal thoughts, but thoughts by others whom have far more knowledge then I into ancient practices. Who am I to contest what the experts say? I’m just passing on what I have read.\nR\n\n","date":"March 10, 2013 at 9:00 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-27032","author":"Ron","site":"shroudstory"},{"title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone","post":"Who are you to contest what the experts say? You’re a man with an inquiring mind and an ability to draw conclusions of your own from the evidence. And, judging solely by that passage I used from Josephus, you’re better read in that respect than I am. So don’t just pass on the judgement of experts. I told you how I estimated my 100 000. If you think it’s an overestimate, explain why – using the evidence of others if you like, but not merely parroting their conclusions. If you think there is no way of judging the number crucified, then you have no option but to agree that I might be right, and neither has anybody else.\nThe spearing, the cap of thorns? Does anyone have more knowledge than you? (Or I?) Who are these experts? What is their evidence? As far as I know there is very little evidence about crucifixion at all, and even less about 1st century Judea.\nIf I’m wrong, by all means show me where.\n\n","date":"March 11, 2013 at 9:14 am","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","id":"comment-27071","author":"Hugh Farey","site":"shroudstory"}]
