[{"title":"Was Adler’s Analysis Science?","post":"Neither chemistry nor biology are my first disciplines.  However I thought we had settled much of the Blood stain debates with Dr Kelly Kearse’s posting of 16 February.  Colin’s comments on her paper I recall (one of many praising it) was “Splendid account … a model of precision and clarity”.  You can drop quickly onto Kelly’s posting and related comments on this site by going to Categories (below at right) / Science / Blood Studies.  I failed to spot if she had made any comments at the time specifically on Adler’s work, but she certainly dealt comprehensively with work carried out by other reputable scientists.\nSo I’m not sure just what Colin’s problem is, whether (a) He is raising questions solely about Adler’s work, or (b) whether he is seeking to have the whole question of blood stains recycled yet again.  With regard to (b) I thought we had been there, done that!\n\n","date":"April 21, 2012 at 8:03 am","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10663","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Okay, I’ll bite…Not exactly sure if the objection here is regarding the explanation for the red color of the blood & the “anomaly” of the spectrum, or the conclusion that real blood is, in fact, present.\nRegarding the color/spectrum, there was a major post on Jan 10, 2012 “Let’s Talk Red Blood: Bilirubin, Saponaria officinalis and UV”, that discusses these issues, including the suggestion by Ray Rogers that the residue left from preparation of the cloth may also have contributed to hemolysis.  I’m unable to add anything else that wasn’t covered in the previous post/comments.  Admittedly, my own lab bench experience with spectral analysis is rather limited, but Adler’s explanation & approach seem very reasonable & balanced.  I’m going to vote science.\nFor the second point, Adler & colleagues performed 11 different chemical tests to assay for the presence of blood.  These findings were confirmed & extended by immunological tests, demonstrating the presence of the expected major blood components, albumin & immunologlobulin.  The chemical analysis is extremely thorough & the immunological findings are a clincher.  I’m also going to vote science on this one-big time.\n\n","date":"April 21, 2012 at 8:20 am","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10664","author":"Kelly Kearse","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Hello again Kelly\nWhile not wishing to appear too dogmatic about Adler’s proposed sequence of events, I feel that Occam, taking at look, would decide to put his razor away in its box, rather than have it blunted.\nBut even if Adler’s multiple-event scenario were true, and a novel trauma-induced complex of high-spin methaemogobin and bilrubin accounted for the red colour and spectrum, it would still leave a physicochemical elephant in the room. Why should that novel association between porphyrin and bile pigment confer everlasting chemical stability on its two components, notably bilirubin which as we know  is highly sensitive to degradation by light and oxygen?\nPersonally i consider it exceedingly improbable that the red colour is due to surviving blood pigments, whether in novel association or not. It is far more probable that it represents an exogenous pigment – chemical constitution still to be determined. \nBut that would mean that at some stage in its history the Shroud had been doctored to make it look as if it carried stains of real red blood. If that were the case, then who is to say that real blood has not also been added from time to time? That could give rise to a heterogeneity in “blood” stains, with some real, some simulated with a dye or pigment, or even mixtures where one overlays the other. \nAs for Saponaria, I confess to being  mystified. i can understand why Adler’s internal haemolysis can produce at least some additional bilirubin (though probably not nearly as much as suggested) akin to marathon runner’s foot strike haemolysis. But why should external haemolyis, through contact with natural detergent, alter the colour or stability of the haemoglobin, or porphyrins. All it would do surely is to lyse red blood cells, releasing haemoglobin, but it would simply oxidise and darken as per usual, with or without the natural soap being present. Since when has soap been an agent that confers everlasting chemical stability?\nIt’s suggested elsewhere that I have changed my stance on “blood”, since commenting on that splendid contribution of yours.Not so.  I was simply commending you  on the clarity of your exposition re blood typing, in particular  those  false positives, false negatives and possible interferences from microorganisms etc. Nowhere did I say that I accepted without reservation with any of the blood typing results of those whose work you cited, given the “awkwardness” of the material under test.  But that’s the internet for you. Folk can always be relied upon to read more into one’s comments than one has actually said. \nThose blood stains will look like a side show, compared with the post I am preparing for tomorrow … Some folk here will need to have their tranquilisers and blood pressure pills handy. Hint: New Bridge (Paris).\n\n","date":"April 21, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10681","author":"colinsberry","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Mickey Mouse strikes back!\n\n","date":"April 22, 2012 at 3:11 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10713","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Hints: CB\n\n","date":"April 22, 2012 at 4:16 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10715","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Linen/bloodstain  biochemistry from biased photographs to come: a breakthrough in Science!\n\n","date":"April 22, 2012 at 4:19 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10716","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"The scorching/cooking mummy kitchen “chemistic” Almighy God of Mickey Mouse science is sitting back and listening to our comments. My comment will be short: Cambronne’s word! (True G.d, forgive me!).\n\n","date":"April 21, 2012 at 2:16 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10672","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"I do hope Daveb WELLINGTON won’t take it for him or make it a personal matter..\n\n","date":"April 21, 2012 at 2:26 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10673","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"More seriously: The main question here is: if the man on the Shroud is Yeshua, how can we archaeologically account for 1st century blood stains on it still being reddish in colour? \nHere is the most likely answer (in the light of Yeshua’s burial): this fact may not only result from extended torture (or even hematidrosis) in se but FIRST AND FOREMOST from the very process of mordanting fresh blood on cellulose fibres in alkaline waters (either mixed with the ashes of the Red heifer or/and rich in Jerusalem limeston.\n\n","date":"April 21, 2012 at 4:16 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10675","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Correction: “fresh or remoistened blood”\n\n","date":"April 21, 2012 at 4:22 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10677","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Correction: “limestone”.\n\n","date":"April 21, 2012 at 4:18 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10676","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"One shall always keep alert to junk Shroud science and its varlets (mostly archaeologically and forensically illiterate.scientists such as the most deceiful Colin Berry that, most unashamedly, push eccentric pseudo scientific ideas of his own about the Shroud image wanting us to believe it is as a thermostencil/scorchography/barography while working from biased material, ignoring the very chemistry and physics of ancient textiles.\n\n","date":"April 21, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10680","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"typo: “scorchograph/barograph”\n\n","date":"April 21, 2012 at 6:16 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10685","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Pont Neuf…hmmmm :)\n\n","date":"April 21, 2012 at 7:56 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10689","author":"Kelly Kearse","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Pont neuf…..???\n\n","date":"April 22, 2012 at 12:34 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10708","author":"Ron","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Pont Neuf are two  words, Kelly (anyway, I do appreciate your sense of humour).\n\n","date":"April 22, 2012 at 3:06 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10712","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"My Pont Neuf comment was in response to the last line in Colin’s post above (#3), time-stamped @ 5:55, hope this doesn’t have any other meanings!\n\n","date":"April 22, 2012 at 3:47 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10714","author":"Kelly Kearse","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"I still don’t see the point in being rude to anyone on this site, on the slender basis that we disagree with their views.  It’s a poor debating tactic and totally ineffective as a persuasive ploy in any kind of mature discussion.  “Let him without sin cast the first stone.”  “First cast the beam out of your own eye …”\n\n","date":"April 22, 2012 at 4:31 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10717","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Cambrone’s is a  five letter word “historical” response. Cambronne was one of Napoleon’s generals…\n\n","date":"April 22, 2012 at 4:32 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10718","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Kelly, your deliberate or undeliberate sense of humour is “kelling” me…\n\n","date":"April 22, 2012 at 4:50 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10721","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Ok Daveb WELLINGTON starting with yourself so…. BTW Colin was the first to cast the stone (See CB’s very courteous comment  of Di Lazzaro’s paper). Ever heard of the boomerang effect or Measure for Measure? “Being vague” still doesn’t ring any Wellington “courtesy” bell?\n\n","date":"April 22, 2012 at 4:41 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10720","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Correction: “A breakthrough in Mickey Mouse science!”\n\n","date":"April 22, 2012 at 5:31 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10724","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was Adler’s Analysis Science?","post":"Max, I really wish you would stop bombarding blogs with mutiple incoherent posts. You make it difficult for other’s posts to be picked up, literally making them lost in a minefield of babble….I beg of you.\nRon\n\n","date":"April 23, 2012 at 11:28 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","id":"comment-10797","author":"Ron","site":"shroudstory"}]
