[{"title":"Was Jesus’ Body Washed?","post":"I don’t recall which article or how many years ago that I had read that the body of our Lord Jesus was lightly cleaned just before his burial.  There was/is still some dirt from his feet on the bottom of the Shroud.  Apparently the body was still oozing some blood a minor amount of bodily fluids water, oils etc.\n\n","date":"October 11, 2015 at 4:25 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212273","author":"ekmcmahon","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"The controversy about the washing of the blood plays into the hands of those for whom the similarity in consistency and patterning of the various trickles is evidence that the blood was applied to the image after it had been made. The blood trickles down the arms are clearly not post-mortem dribbles, and have equally clearly not been washed off. On the other hand the precise indications of the scourge marks suggest that the mass of blood which covered the back and chest of the man was indeed washed off. The various dribbles down the hair, brow and spear wound, all with very similar zigzags and widths, are also somewhat contradictory from a washing point of view.\nI note that Stephen includes a photograph of an entirely speculative flagrum, made specifically  so that its leaden weights match the marks on the Shroud, and captions it: “A Roman flagrum excavated from Herculaneum.” He must know that this is transparent nonsense.\n\n","date":"October 11, 2015 at 6:31 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212284","author":"Hugh Farey","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"And while I’m at it, Stephen’s ‘installments’ are what I would call ‘updates and enlargements’.\nReaders must not get the impression that there are ten parts to Stephen’s reply to his correspondent Daryl, as they will waste their time trying to look for them. There are in fact three:\n“Why would Jesus have violated the 2nd commandment regarding religious images” (28 Sept 2015)\n“Wasn’t Jesus wrapped like a mummy like Lazarus?” (29 Sept 2015)\n“Wasn’t Jesus’ body washed before putting it in the grave” (30 Sept 2015)\n\n","date":"October 11, 2015 at 6:45 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212285","author":"Hugh Farey","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Me parece que hay una cuarta posibilidad: ¿Podría haber caído una gran lluvia ese día que lavó “a medias” el cuerpo de Jesús”\n\n","date":"October 11, 2015 at 7:50 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212288","author":"Gonzalo Alvear","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Some news:\nPope Francis has sent his greetings to an Iraqi prelate, who is also a “Shroudie”: Mar Gewargis III, who was elected Patriarch of the Assyrian Church of the East and consecrated in Saint John’s Cathedral, Irbil, Iraq:\n  http://www.catholicherald.co.uk/news/2015/09/22/pope-sends-greetings-and-prayers-to-newly-elected-assyrian-patriarch/\nPope John Paul II and the previous Patriarch, Mar Dinkha IV had signed a ” Common Christological Agreeement” some years ago:  http://www.vatican.va/roman_curia/pontifical_councils/chrstuni/documents/rc_pc_chrstuni_doc_11111994_assyrian-church_en.html\n\n","date":"October 11, 2015 at 11:00 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212297","author":"Louis","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"I agree with Dan that Frederick Zugibe makes a very convincing case for the body washing and subsequent oozing of blood.  Further, Jones has an obvious bias in his assertions as he tries to dismiss Zugibe by calling his arguments “inconsistent and unconvincing”–a standard ploy for anyone confronted with evidence that contradicts their position–while asserting his own foregone conclusions (“surely they would have been”) unsupported by any analytical evidence.  We know from the New Testament that the burial “team” was under a lot of time pressure to get Jesus into the tomb before the sabbath began.  It is entirely plausible that the washing was hasty, superficial and incomplete.  \nAs for dirt on Jesus’ face, this is the first time I have heard of that.  Dirt on the bottoms of the feet, okay.  Makes sense.  But what authoritative source identifies dirt on his face?  It is certainly not noticeable in any of the Shroud photographs.\n\n","date":"October 11, 2015 at 3:55 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212311","author":"Jim Carney","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"The trickles down the arms are not consistent with Zugibe’s hypothesis. His very feeble post mortem ooze photograph from a wrist is also less than convincing. Hasty semi-washing does seem the best bet, but has problems of its own.\nAs for the dirt, Jones is, as ever, reliant on secondary sources which confirm his pre-conceived pro-authenticity commitment, and it is not always easy to find out where the original findings came from. Jones references Mark Antonacci, who mentions dirt on the knee several times, but I cannot find his primary source. Jones particularly mentions the left knee, and it perhaps significant that no tape samples were taken from either the left knee or the nose. The Gilberts did sample the heel and the nose, but neither knee, and they made no reference to any alleged dirt in their paper on their work, and none of their spectra show anything unusual. In Ray Schneider’s “Enduring Mystery” lecture series, part 2 slide 35 says: “STURP detects spectral responses of dirt on the Feet, Nose and Knee of the man in the Shroud” under the heading “STURP team Examines X-ray Radiography.” However Mottern, London and Morris do not mention any of this in their paper.\nI, too, would like to know if this is anything more than a speculative extrapolation given spurious authority simply by being repeated, unquestioned, for decades.\n\n","date":"October 11, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212319","author":"Hugh Farey","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Hugh, you wrote: “The trickles down the arms are not consistent with Zugibe’s hypothesis. His very feeble post mortem ooze photograph from a wrist is also less than convincing. Hasty semi-washing does seem the best bet, but has problems of its own.”\nCan you explain ?\n\n","date":"October 12, 2015 at 2:38 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212388","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Yes, Thibault. Zugibe says that the body was washed. It is not possible that the trickles down the arms were post mortem issues, and they were clearly not washed. Zugibe is anxious to show that the bloodflows from the wrist and spear wounds were post mortem, but his illustration, of a tiny drip of blood taking four hours to emerge from a cadaveric wrist, is hardly justification of that. If we are to have a clean back and torso, but maintain the trickles down the arms, then a very partial wash seems to be the best explanation – or possibly a rain storm, as I first mentioned two years ago.\n\n","date":"October 12, 2015 at 5:41 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212397","author":"Hugh Farey","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Dear Hugh,\n” Zugibe says that the body was washed. It is not possible that the trickles down the arms were post mortem issues, and they were clearly not washed.”\nNo.\nThe arm blood flows were not washed, because, according to Zugibe they were post-mortem blood flows.\nWhy ?\n1) When the TS man was crucified, the hand/wrist was compressed against the crosspiece of the cross by nailing, “thereby preventing any discernable blood flows. In addition (..), the blood pressure was very low and the arms were in elevated position” (FZ, the crucifixion of Jesus, p. 222).\nRemember that, after scourging, the blood pressure was likely very low and the blood itself very “viscous”.\n2) “It is obvious that the blood flows on the arms occurred right after removal of the nails (which had sealed the wounds during suspension from the hand areas, causing the blood that contained  fibrinolysins to flow down the back of the arms from the nail exit wound while the arms were suspended above the head still in rigor at the same angle in which they had been nailed to the crosspiece (…) Forensically speaking, the reason for the small amount of blood on the arms is due to the fact that the heart was not beating when the nails were removed and the arms were in a suspended position. Moreover, the arms would have been free of blood prior to death because the large nails would have sealed the wounds, the blood pressure was very low, and the arms were in elevated position” (FZ).\n “Zugibe is anxious to show that the bloodflows from the wrist and spear wounds were post mortem, but his illustration, of a tiny drip of blood taking four hours to emerge from a cadaveric wrist, is hardly justification of that”.\nYes.\nFZ is very confusing here. The illustration shows that AFTER WASHING, some blood from a wound of a deceased victim appears at the surface of the skin.\nIn my opinion this observed fact has nothing to do with the blood flows on the arms but rather with the problem of the scourge marks.\n\n","date":"October 14, 2015 at 3:36 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212497","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"I do not believe the trickles down the arms can possibly be post mortem flows. After the death of the victim, the draining of blood downwards, and the clotting of the smaller blood vessels, prevents any flow out of an upwardly directed arm. If the arm is not upwardly directed, but pointing in any other direction, then any blood seeping out would drip straight off the arm or downwards over the fingers. If the blood pressure was low and the blood viscous even during life, there is zero possibility of anything emerging from an arm elevated at any appreciable angle. His own experiment, with an arm horizontal, produced such a tiny amount of blood after four hours than even if he had tipped the arm upwards it would not have trickled down it at all. \nZugibe was wrong. Yup. With all those years of experience, he was, quite simply, wrong.\nWouldn’t you agree?\n\n","date":"October 14, 2015 at 4:34 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212502","author":"Hugh Farey","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Mr.Farey  your logic is correct. Otherwise they may have carried Jesus to tomb from cross by holding from his arms and legs. (how many people carried Jesus from Cross to Tomb? Did soldiers help them to carry Jesus body after hearing the words of Centurian.\n\n","date":"October 14, 2015 at 5:16 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212509","author":"Sampath Fernando","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"I’ve always had doubts about the arm trickles. Just seem too good to be true. Too neat.\nSomething often not contemplated by anyone – because in the world of Shroud debate it usually seems to be a black or white, pro-authenticity versus anti-authenticity conversation – is that the body image and perhaps some of the blood stains might be authentic, but some of the blood stains were later added.  I see no fundamental problems with the theory of  this idea…. It goes like this:\n– Shroud is authentic. Image is authentic plus perhaps some of the blood stains\n– At some point in the Shroud’s history, extra blood is added to align with the developing artistic tradition of the crucified and wounded Christ\n\n","date":"October 12, 2015 at 1:31 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212334","author":"Thomas","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"It’s not impossible, Thomas, and has been considered from time to time. Even Walter McCrone thought the blood could have been touched up. Dyed-in-the-wool authenticists will cling to the evidence that there is no image under the blood, so that all the blood must have arrived first, but it’s not terribly strong.\n\n","date":"October 12, 2015 at 1:39 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212335","author":"Hugh Farey","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"I don’t think they wash the body of Jesus. According to Synoptic Gospels they did not have time even to Anoint the body. As a result of that they wrap the body till Sunday morning to anoint the body and give a proper burial.\n\n","date":"October 12, 2015 at 3:05 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212338","author":"Sampath Fernando","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"I agree Sampath. The “burial” was not a burial. It was a very temporary and hasty deposition prior to the proper burial rites that were planned for the Sunday. So if the body wasn’t washed, that’s problematic for the pro-authenticity argument for things like the scourge marks which rely on the body washing…unless…if Christ was on the cross for several hours following the scourging, could not the blood across the back have dried but then some sort of slightly raised welts then left imprints on the Shroud as Christ was carried in the Shroud to the tomb?\n\n","date":"October 12, 2015 at 4:36 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212344","author":"Thomas","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Unless it rained at some point. :)\n\n","date":"October 12, 2015 at 2:20 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212384","author":"David Goulet","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Hay un PEQUEÑO problema para los que creen en la sangre añadida.\nNadie ha podido obtener, añadiendo sangre, una imagen (de sangre) similar a las que aparecen en la Sábana Santa.\nEs muy fácil el hablar “por boca de ganso”…..\nCarlos\n\n","date":"October 12, 2015 at 3:40 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212340","author":"Carlos","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"On the contrary, es muy fácil. A teat pipette and a small lancet are quite sufficient to acquire and dribble the required blood wherever required; along the arms, down the hair and brow, big splodges for the hand, feet and side, and maybe a dabbing with a stencil of sponge, like a potato print, for the scourge wounds. Bloodletting of half a litre or so was a common medical procedure throughout the medieval period, so getting someone to lose a few teaspoons full was not a problem.\n\n","date":"October 12, 2015 at 4:12 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212341","author":"Hugh Farey","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"¿ y cómo la mantienes ROJA?\nCarlos\n\n","date":"October 12, 2015 at 4:26 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212343","author":"Carlos","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Bit of vermillion? Bit of madder? Bit of iron oxide? Plenty of choices…\n\n","date":"October 12, 2015 at 10:13 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212372","author":"Hugh Farey","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Creía que estábamos hablando de la posibilidad de AÑADIR SANGRE a las imágenes de sangre en la Shroud………y eso NO PARECE (negación) posible.\nSi se añade PINTURA está sobrando el añadir sangre.\n(usted advirtió su ERROR y pretende corregirlo con pintura).\nPENOSO.\nCarlos\n\n","date":"October 12, 2015 at 12:00 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212377","author":"Carlos","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Hugh Farey comment above Oct 11, 5:54 pm, relating to dirt on feet, nose and knee,  xxx “a speculative extrapolation given spurious authority by (repetition)”  xxx: \nSee ref: “Evidence for testing Hypotheses … (etc)” by (Shroud-Science group),  Dallas, 2005;  http://www.shroud.com/pdfs/doclist.pdf  ,  The several items are classified as A, B, C according to the reliability of the observation, A – unquestionable, to C – observed and agreed by some only.  \nOn p.7, under 2.1(e) “OTHER”:\n“A79) Earthy material (limestone composed of aragonite with strontium and iron) was found on the feet of TS Man (Kohlbeck 1986, Nitowski 1986, 1998, Antonacci 2000). Earthy material was also found in correspondence with the nose and the left knee (Pellicori 1981).” \nNote that item is classified ‘A’;  Pellicori 1981 cited as “144. PELLICORI S. F. and EVANS M. S., “The Shroud of Turin Through the Microscope,” Archaeology, January/February 35-\n43 (1981).”  \nOn p.10, under 2.2(e) “OTHER”:\n“B57) The limestone found on the feet contains calcium in the form of aragonite. Similar\ncharacteristics were found on samples coming from Ecole Biblique tomb in Jerusalem (Levi-Setti 1985, Antonacci 2000).”  \nItem is classified ‘B’;  Citations: “108. LEVI-SETTI R.,CROW C., WANG Y. L.: “Progress in H>igh Resolution scannino Ion microscopi and Secondary Ion Mass Spectrometry Imaging Microanalysis”, Scanning Electron Microscopy 2, 1985; 535-552” ;  “10. ANTONACCI M., “The Resurrection of the Shroud”, M. Evans and C. Inc., New York, USA, 2000.”  \nAlso refer paper by Barta & Bracaglia on H.S.G. site concerning work by Kohlbeck & Nitowski, relating to identification of limestone with that sampled by Nitowski at the Damascus gate in Jerusalem:  http://holyshroudguild.org/ceacutesar-barta.html  \nIn John Klotz’s narrative of the STURP hands-on work in Turin, he states that during the Gilbert’s spectrographic examination, Marty Gilbert identified three anomalous areas – a foot, a knee-cap and the tip of nose.  Pellicori was summoned and identified it as dirt;  Rogers took sticky-tape samples, but it seems he sent only the tapes from the foot to Kohlbeck.\n\n","date":"October 12, 2015 at 4:40 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212345","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Dave has really nailed it with his post. I would point out that my source was primarily Heller who although not personally in Turin, did participate in the follow-up conferences and interviewed the participants.\nObviously the primary source for this information is Sam Pellicori.\nRight now, I can not comment further. I have pressing professional commitments that require around the involvement.\nAs far as the Shroud is concerned I am content with the evidence of authenticity and I am moving on to the issue of the providence of the Shroud’s survival among other things. But most importantly, humanity is literally on the brink of irreversible processes leading to its extinction, a real not a metaphorical apocalypse.\nI have dubbed it the Apocalypse of Selfishness and the epitome of selflessness for me remains Christ on the Cross. The working title of what will be a palimpsest of “Quantum Christ” is “The Apocalypse, the Pope and the Shroud.” See Chapter 17 of “Quantum Christ.” A lot has happened since I wrote that.\nFrankly, Shroud skeptics are in my mind like the neighbors of Noah who couldn’t understand why he was building that big boat.\n\n","date":"October 12, 2015 at 5:20 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212347","author":"John Klotz","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Noah? There is no evidence of Noah, an Ark, or a world flood.  \nhttp://www.pbs.org/wgbh/nova/ancient/secrets-noahs-ark.html\nProgram Description\nIn 1948, a British pilot serving in Iraq acquired a clay tablet with an intriguing, 3,700 year-old inscription. The ancient writing tells the story of how the god Enki warns a Sumerian king named Atra-Hasis of a future flood that will destroy mankind; Enki gives him instructions for building a boat to save his family and livestock. If that sounds like a familiar tale, it’s because this was one of several ancient flood traditions that, centuries later, would inspire the biblical story of Noah. But the tablet’s inscription describes a boat very different from the traditional image of the Ark—it’s said to be circular and made of reeds. Is this nothing more than a fanciful myth? Or could such a reed boat have carried Atra-Hasis’ family of more than one hundred and his many animals? Join NOVA as a team of historians and expert boat builders investigates this fascinating flood legend and sets out to rebuild a tantalizing, ancient forerunner of the Ark.\n\n","date":"October 12, 2015 at 8:20 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212359","author":"John Green","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"John,\nThe Old Testament is not recorded history. It’s stories though reflect human experience in a metaphorical form.\nAs far as worldwide flood, I am in perfect agreement with you. However, at the end of the last Ice Age there were in fact floods of apocalyptic size. The Persian Gulf was once an idyllic land, perfect for a hunter-gather society. Are you denying that ocean levels rose dramatically after the end of the last Ice Age?\n\n","date":"October 12, 2015 at 8:28 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212360","author":"John Klotz","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"John, \nClearly there were massive floods in the pass. Years ago NOVA did the story of a massive lake that formed in Canada when the ice was melting. At some point the ice dam that was holding back this lake melted and the water poured out and reshaped the northwest part of the United States on its way to the ocean. I’m sure that many other massive floods happened at the same time as that.\n\n","date":"October 12, 2015 at 10:13 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212371","author":"John Green","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Daveb’s post is a perfect example of what I described above as “a speculative extrapolation given spurious authority simply by being repeated, unquestioned, for decades.”\nStarting with the microscopical particle/s found on the foot, which I do not dispute, readers will note that there is no reliable source for dirt being found on a knee or the nose. Pellicori’s magazine article (1981) includes the words: “The nose area might also contain dirt or residual skin material.” This is not based on his own researches – his scientific papers contain no reference to dirt – but on speculative observation of Mark Evans’ micrographs. He does not mention the knee.\nJohn Klotz’s dependence on Heller is unsatisfactory. Here is a paraphrase of Heller’s account. Roger and Marty Gilbert dealt with reflectance spectroscopy. After measuring the background, they began at the foot and worked their way up the the body to obtain spectra. The heel spectrum was totally different from the others. When the Gilberts reached the knee, Sam Pellicori was called in to look at the foot area under the macroscope and found dirt. Actually, of course, the heel spectra look very little different from any other image spectra except in intensity, as can clearly be seen in their paper, and they never “moved slowly up the leg” or did any spectrographic tests on either knee. As they show, clearly, in their paper.\nSo, back to my initial point. There is no evidence for dirt anywhere than on the foot, and precious little of that. See this blog’s “So Maybe it is a Painting After All” from 24 September 2014 for more details.\nOf course, I could be wrong, but please, gentlemen, Primary Sources, not oft-repeated speculation, if you’d be so kind.\n\n","date":"October 12, 2015 at 10:11 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212369","author":"Hugh Farey","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"You know many years ago I was involved in a Internet NG headed by Farrell Till (I posted under another handle not my real name). And I would say that most of the Christians that posted to that NG really believed in the story of a world flood that covered all the land on earth. And they believed in Noah and the Ark. Some even believed that man lived along side of real Dinosaurs like the one of millions of years ago ( like the Fred Flintstone). \nIt’s refreshing to see people here that are willing to look at these stories in another way. One that agrees with science, yet doesn’t affect their faith.\n\n","date":"October 12, 2015 at 11:41 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212376","author":"John Green","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"“Frankly, Shroud skeptics are in my mind like the neighbors of Noah who couldn’t understand why he was building that big boat.”\nBoy, that boat must have been more than huge.\n\n","date":"October 12, 2015 at 11:56 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212407","author":"PHPL","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Look, it’s a myth, a metaphor, a  parable. But it has a certain value as a myth or metaphor or parable. Much of scripture, particularly Genesis should not be read as a scientific or historical tract but as a reflection of humanity coming to terms with itself and its divided nature which aspires to the divine while yielding to the basic drives that drove evolution. \nBut the simple historical and scientific fact is that at the end of the last Ice Age humanity was in fact inundated by huge floods and rising tidal waters. The Persian Gulf was once an idyllic place where hunter-gathers could prosper: A veritable lost Eden perhaps.\nThe legend of a hero overcoming the flood sent by the God(s) exists in more than one ancient culture. They may be a tiny spark of truth in those legends. That there was a Noah who saved all the living creatures by taking them two by two aboard an huge Ark is neither history nor scientific fact.\n\n","date":"October 13, 2015 at 9:28 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212434","author":"John Klotz","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"There are several ancient flood stories, nearly all of them from civilisations dependent on rivers subject to erratic flooding, and occasionally these floods would be extremely devastating.   \nDuring the 1980s when I was studying Ancient Mythologies, I recall that one of my fellow-students presented a paper identifying several of these stories and their places of origin.  However she made a point that there were no such stories emanating from Egypt.  Why?  Because the Nile floods were predictable, always occurred during a fixed season, and were seen as essential to the fertility of the Nile Valley!  \nIn the closing chapters of The Epic of Gilgamesh, we are told of Utnapishtim, who alone of all humanity, except for his family escaped such a devastating flood, and resided at the mouth of the Euphrates.  Gilgamesh, overcome with grief by the death of his companion Enkidu, sets out on a journey to find Utnapishtim and to discover the secret of immortality.  However a serpent stole the plant from Gilgamesh he had obtained which would give immortality, and so his quest was unsuccessful. \nGilgamesh is the first human hero that was ever set down in writing and its earliest known tablets date from before 2000 BC.  There are very close parallels with the incidental details of the story of Noah.  These would indicate that this story was set down in Genesis during the Babylonian Captivity sometime in the 6th century BC.  However there are major differences.  In the Utnapishtim story, the floods are sent by a goddess as an act of spite against humanity.  The Jewish writers give the story of the flood an entirely different religious meaning, more profound, and Noah is saved as an act of a merciful God.   \nDoubtless there were devastating floods at the end of the Ice Age, but it would seem unlikely that there would be any group memory of such events.  The purpose of the Noah story, is intended to be religious, and its setting can be related to devastating floods that occurred in ancient Uruk.\n\n","date":"October 14, 2015 at 12:16 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212461","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"As I wrote some time ago, Mesopotamian mythology crept into the Old Testament texts. There is a lot more plagiarism than many would imagine. The rest will come later.\n\n","date":"October 12, 2015 at 9:13 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212363","author":"Louis","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Louis,\nI covered the pre scripture origins of the Noah story in Quantum Christ. The prevalence of flood myths indicates that while the hero may be mythic, the apocalyptic floods were not. Take a look at any map of the Earth during the Ice Age and you will see that vast stretches of what are not ocean bottom were once dry land. That includes the Persian gulf. For example: http://www.iceagenow.com/Sea_Level_During_Last_Ice_Age.htm\n\n","date":"October 12, 2015 at 10:03 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212367","author":"John Klotz","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"typo: are not ocean bottom = are NOW ocean bottom.\n\n","date":"October 12, 2015 at 10:08 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212368","author":"John Klotz","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Hi John\nI’m sorry, I should have been more clear. There is no doubt that you are right about the apocalyptic flods. I was referring to the Gilgamesh epic and other Near Eastern texts, which will be elaborated in an article I am writing on OT texts/archaeology.\nIn general, I am following the line of the Protestant scholars Harnack and Käsemann and the Catholic scholars Schnackenburg, Fitzmyer and Blenkinsopp.\n\n","date":"October 12, 2015 at 10:51 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212374","author":"Louis","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Louis,\nMy point would be that the Gilgamesh and other ancient texts are reflections of a vestigial memory and oral traditions probably handed down generations by people who survived them. Also, cf noosphere which may reflect quantum information of the universe as it was later hypothesized after Teilhard’s death.\nI am ducking in and out of this as I deal with other matters of a pressing matters totally unrelated to the Shroud except that I am beginning to pull together my published material and some recent critical publications (meaning extraordinarily important) relevant to The Apocalypse, the Pope and the Shroud. \nFor example, last December Scientific American quoted a study that 2014 was the hottest year on record.and the in August a study that the first seven months of 20155 were the hottest on record and that 2015 was on track to be the hottest year of record. Then again there was an excellent blog in the NYTime blog about how the man made destruction of the Amazon rainforest will in fact cause the atmosphere to become drier, reducing precipitation worldwide. \nOceans rise while desertification spreads. I can’t  believe that the condo market in Florida is booming.\n\n","date":"October 12, 2015 at 11:27 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212375","author":"John Klotz","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"I didn’t get you, John. Are you writing on the Apocalypse, the Pope and the Shroud? The native indians in the Amazon were reported to be selling huge tree trunks for USD 40.00 each, while the first buyer sells them for USD 500.00 each. They seem to havê learnt from the traders of European stock how to be cunning. They like radios and other stuff. Well, it is human nature. It  contributes to the apocalypse.\n\n","date":"October 12, 2015 at 12:20 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212378","author":"Louis","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"stay tuned\n\n","date":"October 12, 2015 at 12:40 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212379","author":"John Klotz","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"OK.\n\n","date":"October 12, 2015 at 12:42 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212381","author":"Louis","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"I think if the body were not washed at all, there would hardly be an image if he was beaten as the evidence seems to indicate.  It seem logical the body was washed quickly.\n\n","date":"October 12, 2015 at 2:20 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212383","author":"Dcn Andy","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Or it rained at some point.\n\n","date":"October 12, 2015 at 2:23 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212386","author":"David Goulet","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"I keep mentioning the possibility of rain ‘washing’ the body prior to it’s being wrapped. The Gospel does mention a storm (may just be a literary device or it could have been a sand storm). Thought experiment (pro authenticity model): what if it rained while Jesus was carrying the cross to Golgotha? If the rain was heavy enough it may have washed much of the topical blood from his body. If the rain occurs while he is on the cross, this too may wash away topical blood. How does blood flow on wet skin vs dry? Is this why we have dirt on the toes (where even rain water would have trouble washing away the caked in dirt) but less so on the nose and knees where rainwater could have more effect? If Jesus was removed from the cross wet, some of the topical blood may have wiped itself onto the transport linen (not the Shroud). When the body is then placed on the dry burial linen moist wounds may have continued to ooze blood. It’s interesting that a few movies about the Passion have a rainstorm occurring — again this is artistic license but who is to say it is not based on actual events? How would rain affect the blood images we see?\n\n","date":"October 12, 2015 at 2:36 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212387","author":"David Goulet","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"If there was a transport linen it would have to be kept in the tomb because it contained blood, and could therefore not be discarded. Actually the burial customs during the períod required two burial shrouds. It was changed in AD 50 by Rabban Gamaliel II, who ruled that one shroud was sufficient. It is possible that Joseph could only obtain one Shroud since he had little time.\n\n","date":"October 12, 2015 at 4:21 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212390","author":"Louis","site":"shroudstory"},{"title":"Was Jesus’ Body Washed?","post":"Hi Louis – But there are no evidence from the Shroud of Turin to tell us that it was the same shroud used to transport Jesus body from the cross to the Tomb.\n\n","date":"October 12, 2015 at 8:07 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","id":"comment-212400","author":"Sampath Fernando","site":"shroudstory"}]
