[{"title":"Why Doesn’t the Blood Create an Image?","post":"Maybe it’s a case of macrostructure (teeth, hair) versus something on a much smaller scale (cellular debris, proteins of blood).  Teeth & hair are significantly more scaffolded, more dense than blood, even in the dried form of a clot.  Within keratin, do the eyebrows significantly image?  Can they effectively be distinguished from the presumed bone structure/skin in this region (compare with area underneath eyes)? Is it keratin that’s being imaged or the collective density of it (in the hair around the face), similar with the teeth?  I don’t know if the resolution down to cellular debris, protein of hair, teeth versus blood is equivalent. if the imaging mechanism, whatever it is, occurs at that magnitude, detail.  Just my thoughts.\n\n","date":"July 13, 2014 at 8:34 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137611","author":"Kelly Kearse","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Interesting questions regarding the blood have been raised here, but these have to be tackled by the experts in the field. And for that we are fortunate to have have Kelly Kearse.\nNow, exception must be taken to what Stephen Hawking has said, correctly quoted by Dan, but which has left an unanswered question, one that Hawking could not answer.\nAnd, what, is that question?\nHawking attributed everything to “spontaneous creation” precisely because he could not answer the question.\nOk, but what exactly is the question?\nIt is one he himself raised, could not answer, then retreated because it led to metaphysics.\nFair enough, it is the right approach, because scientists have to tackle “how”, not “why”.\nThe problem is that Hawking sort of dodged the problem by mixing “how” with “why”.\nDid he answer the question by this means?\nNo, he did’nt.\nWhy?\nHe did not answer the question about the reason behind “spontaneous creation”.\nAnd why he didn’t answer the question?\nBecause he couldn’t, it would lead him to metaphysics.\nSo the “solution” was to mix things up, but it is no real solution.\nThis problem he faces was mentioned years ago in the first two paragraphs of the introduction to the interview-article:  https://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\n\n","date":"July 13, 2014 at 9:26 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137618","author":"Louis","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"“Interesting questions regarding the blood have been raised here, but these have to be tackled by the experts in the field. And for that we are fortunate to have have Kelly Kearse.”\nKelly is an immunologist.  I am a biochemist (with extensive biomedical experience). In what way does that make Kelly the expert when it comes to human tissue, and me presumably inexpert? \nThat is the crudest of putdowns, but it’s what I have come to expect from this site.\nI don’t care anyway for the tern “expert”. It’s largely meaningless in the context of Shroud studies. There are those prepared to accept received wisdom, others who are not, for whom everything is open to question.\nMy next target is “imaging across air gaps” by unspecified radiation, allegedly collimated by orthogonal projection, and subject to severe attenuation by small thicknesses (3-4cm)  of air.\nYeah, right.\nBeware incoming (like the facts).\n\n","date":"July 13, 2014 at 11:29 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137647","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"“Kelly is an immunologist. I am a biochemist (with extensive biomedical experience). In what way does that make Kelly the expert when it comes to human tissue, and me presumably inexpert?”\nIf I wrote “interesting questions” it meant that both, the one who raised the question and the one attempting to answer it were in my view apt to write on this topic. I know there may be more commenters with qualifications in the field to comment, and that is better than listening to amateurs.\n\n","date":"July 13, 2014 at 11:39 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137651","author":"Louis","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Thank you for the clarification.\n\n","date":"July 13, 2014 at 11:41 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137653","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"You’re welcome.\n\n","date":"July 13, 2014 at 11:49 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137656","author":"Louis","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"A hypothesis:\nIf the image is related to the process of Resurrection, then the image would consist of what was being resurrected. Blood that had left the body and created stains would not be a part of the process.\nIt does appear that the blood stains which were “left behind” did block the information THAT that the process recording the Resurrection.\n[Sill on vacation].\n\n","date":"July 13, 2014 at 10:30 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137634","author":"John Klotz","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"By that reckoning, hair would not be imaged either. It too is dead protein that has (largely) left the body, albeit anchored in a hair follicle (the only part that is still living).\nIngenious answer, all the same. Where would shroudology be without its ingenious answers?\n\n","date":"July 13, 2014 at 11:36 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137649","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Colin’s question brings up a fundamental issue that those who hope that natural processes from a dead body could be responsible for the shroud have to address. It is observed that there is an intensity/distance correlation, and assumed that this implies a distance/effector relationship, where the effector is some kind of radiation or vapour transfer. For this to work, it mst be assumed that the body itself is entirely homogenous in structure, so that there is no variation in effector intensity at its surface, whether it be skin, blood, hair, fingernail or teeth, and whether the underlying structure be fatty, bony, muscly or whatever. If, for example, the image is taken to be a result of some form of heat radiation, if would have to be assumed that the extremities of the body (hands and feet) did not emit less radiation than the core (chest and abdomen), or the distance/intensity relationship would fall down.\nIf, of course, the body were indeed entirely homogenous in structure, such as a bas relief or similar, then heating it, or smearing it with some gas-emitting chemical, would produce minimum surface emittor variation, and a much more regular distance/effector, and thus distance/intensity, correlation.\n\n","date":"July 13, 2014 at 12:30 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137681","author":"Hugh Farey","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Hugh: tell me, does the name Bernard A Power mean anything to you? He is a retired Canadian meteorologist who has written some amazing stuff on the Shroud (as a sideline)  with fascinating insights into radiation as a prospective effector (or not).  Judging by his writings, he probably knows more about radiation effects on matter than anyone else in shroudology.\nAs far as I can tell, his writings have never appeared on this site. Why not?  He’s pro-authenticity, but has gone to some considerable lengths to cast doubt on radiation mechanisms.\nHere’s his main site, but I can give links to a couple of highly informative pdfs if you want.\nhttp://www.shroudscience.info/index_files/THE%20SCIENTIFIC%20FACTS%20Word.htm\nIncredibly, this guy seems to be invisible in shroudology (why????).  I only discovered his work by chance through googling radiation and cloth-body distance.\n\n","date":"July 13, 2014 at 12:54 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137690","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Here’s his main site, but I can give links to a couple of highly informative pdfs if you want.\nYes, we want. Thank you for providing a link, Colin, indeed very good site.\n\n","date":"July 13, 2014 at 1:15 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137694","author":"O.K.","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"To you, and Louis: try these:\nhttp://www.sindone.info/POWER1.PDF\nhttp://www.sindone.info/POWER2.PDF\nI tell you, this guy is a genius (and I say that despite his pro-authenticity)\n\n","date":"July 13, 2014 at 1:21 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137698","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"One paper by Bernard A. Power entitled “Image formation on the Shroud of Turin by the Attenuation of Radiation in the Art” is cited in shrouduniversity, however the link seems to be dead:\nhttp://www.shrouduniversity.com/opticalsciences.php\n\n","date":"July 13, 2014 at 1:13 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137692","author":"Louis","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"It’s “attenuation of radiation in AIR”,  if you don’t mind my saying  – and a qualifying, dare one say quirky assumption in the radiation hypothesis, one of which Bernard Power is deeply sceptical, and rightly so. \nDoes Occams’ Razor Inc (motto: “We deal instantly with needlessly multiplied entities”) have a call-out service?\n\n","date":"July 13, 2014 at 1:41 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137702","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Colin, thanks for the links. Your instincts are are good and, coupled with science, this is helpful in taking the discussion in the right direction. We now need someone to tackle the blood.\n\n","date":"July 13, 2014 at 3:35 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137747","author":"Louis","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"The current blog topic put the spotlight on blood stains being out of stereoregister with body image. Today I discovered a place where ‘body’ image, in the widest sense of the term, is out of register with its own image, with implications for imaging mechanism. Where you might ask? \nClue: it’s the chin/neck region, produced by a re-routing  of linen to follow facial contours as it was forced onto the underside of the chin before impacting on the neck and later the chest. It put surrounding image (hint hint) out of stereoregister. In short – no tenting of linen from chin to chest, as per Vignon diagram, but close conformity (under applied pressure) with body contours.\n\n","date":"July 13, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137752","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I am wondering if you can show with some imaging technique. I’m sure it would help to get a clearer picture..\n\n","date":"July 13, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137776","author":"Louis","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Have just this minute put up a new posting showing where I see longer “hair” than has previously been supposed, due to a break in image continuity, i.e. ‘out-of-stereoregister’\nhttp://colinb-sciencebuzz.blogspot.co.uk/2014/07/could-this-be-turin-shroud-image-that.html\nWhy out of register? Because the linen became kinked through being forced to follow the contours under the chin before meeting the neck. So there was NO tenting across the chin-chest gap , contrary to the Vignon radiation model (see diagram) with its large supposed cloth-body separation at that point. Instead, there’s a light band, corresponding with low contact pressure between underside of chin and linen, and below that a more intense band, due to higher impaction pressure against the ‘square-on’ neck.\n\n","date":"July 13, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137810","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I can see what you mean, Colin. But to what do you attribute the cloth distortion? You have seen the long hair, at least.\n\n","date":"July 13, 2014 at 6:09 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137817","author":"Louis","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"In a word, pressure (or impaction). In other words the linen was not draped loosely over the subject (whether corpse or statue) as imagined in radiation models.  More likely, at least where the frontal image is concerned, the subject was forced face-doen down into the linen, probably with something soft and yielding underneath, causing the linen to turn in under the chin. It was that which produced the permanent baked-in chin crease, but also caused a discontinuity in the imaging of the hair.\nThe radiation modellers (Vignon initially) seem to suppose there was scarcely any imaging of the neck, due to a large body-cloth separation., But there is imaging of the neck, with a pale band above it, which I interpret as (a) neck and (b) underside of chin respectively. The contact model does NOT allow any air gaps, even small ones, The radiation model does, but air gaps are not allowed to exceed 3-4cm, due to the imagined ‘attenuation by air”. Some of us uncharitably see the latter as creative accounting designed to cock a snoot at Newton’s Inverse Square law relating radiation intensity to distance.\n\n","date":"July 13, 2014 at 6:25 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137821","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"The neck region is controversial, there are even some who see no neck. One thing is not clear: what is the soft and yielding material you assume was there with the linen?\nI think that we would have images of the sides if the cloth bound the body tightly. What if the cloth was held by some things placed on the sides of the body, and it was this that caused the distortion in the region?\n\n","date":"July 13, 2014 at 6:57 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137840","author":"Louis","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"It’s not difficult to see why the neck region is controversial when so may still imagine the TS image to be a photograph. It’s not. It’s an X-ograph, and the nature of X is a matter of speculation. Personally I think it’s an ‘impactograph’ produced by thermal imprinting under pressure.\nSome who say there’s no neck are presumably focused on the pale largely image-free band immediately under the chin/beard. But have they not asked themselves what caused the dark band below that?  I say it’s the lower dark band that is the neck, the upper pale band being the underside of the chin. Yes, it’s speculation, but there can be no model building  or testing without it.\nThe underlay could be sand, or maybe sacking. Either way, it takes a lot of force to push a corpse or effigy into an underlay, so even if  it were fully 3D, the chances are that any imprint would look as if it had come from a bas relief. (It’s not impossible that imprinting was done from a bas relief). So failure to imprint sides is easily explained in an impaction model. \nRadiation models try to explain it in terms of orthogonal projection of (unspecified) radiation. Do you know of any precedents for rays streaming out from an object in that disciplined fashion, all parallel with one another, and in a direction that just happens to be convenient for imprinting onto an enveloping shroud, with no possibility of side images? I don’t, but that’s probably down to a lack of imagination.\n\n","date":"July 13, 2014 at 7:21 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137849","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I get your point, but the problem is that the image seems to have been formed in an extremely fast manner. I can’t see how that could have been done with a bas relief statue or corpse inside an underlay.\nWell, we are speculating and will have to wait for the paper to be presented by Dr. Joseph Accetta at the Saint Louis conference.\nAnd more needs to be said about the blood.\n\n","date":"July 13, 2014 at 7:40 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137856","author":"Louis","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Interesting papers, although I think Power misses an important point. He is presumably assuming collimated radiation, when he looks for wavelengths that are attenuated by air. He has not considered radiation from a point source on a spherical wave front. In that case, the intensity of any radiation is attenuated by distance. Of course, the possibility of producing an image in such a case (when every point on the shroud receives radiation from numerous points on the body) is much reduced….\n\n","date":"July 13, 2014 at 2:12 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137711","author":"Hugh Farey","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Yes Hugh. Power’s starting point was the Shroud image and its supposedly encoded 3D (not unique as some would like us to believe, being demonstrable with model scorches).\nHe says, quite rightly in my view, that imaging would not be possible with  (fanciful) orthogonal projection i.e. collimated radiation,  unless there were a sharp fall-off with distance. \nSince the attenuation (no image beyond 3-4cm) is too severe to be in accordance with Newton’s inverse square law,  we have the conjured-up 3-4 cm rule based on attenuation in air. \nBut as Power points out, there are only two kinds of electromagnetic radiation that exhibit that behaviour – one in the microwave region, and the other in shortwave uv.  One  would have to posit an improbable mix of the two, he says,  if trying to explain all the image characteristics of the Shroud.\nOK, so a classical point source of radiation  which you suggest,  is the preferred starting point, certainly. But where’s the converging lens in a 1st century tomb that would allow those diverging rays to come to a sharp focused image? What kind of radiation could produce a scorch image on linen without  some kind of a high temperature incandescent source (producing pyrolytic damage to linen as Power points out)\nThe Achilles heel in the entire radiation hypothesis is in one of those Power pdfs. It’s the one with the Vignon profile of image intensity versus supposed cloth-body distance. \nI shall try putting together a post in the next day or two, showing that the twin-profile  (intensity v cloth-body distance)  is at odds  with the facts at each of 3 crucial points (top of head, neck/chin and frontal feet). The  real profile should have shown image intensity versus points of cloth-body contact (NOT hypothetical variable cloth-body separation across air gaps). \nForget air gaps where Shroud imaging is concerned. They fly in the face of known physics and chemistry. Shroud imaging did NOT occur across air gaps.\n\n","date":"July 13, 2014 at 3:16 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137736","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I agree Hugh.\nI have to add that:\n1) PDF1 (yes PDF, Colin :-)) shows that no single radiation hypothesis does explain the observed facts. The author has to mix two kinds of microwave radiations. This is obviously an ad hoc hypothesis. I hate ad hoc hypotheses.\n2) PDF2 is based on Moran’s paper (‘pixel elements’) which has been destroyed by Rogers (A chemist’s perspective on the Shroud ot Turin, p.81-82)\nI’ll try to answer to Colin tomorrow about his interesting question: “If that’s the case, then why isn’t there a double blood image, one set on the cheek,  as a subset of “body image” say, matching exactly the blood trails on the adjacent hair?”\n\n","date":"July 13, 2014 at 3:22 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137738","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Pdf 1 : I/I0= exp(-k x) is way too simplistic…\nPb is the model, not the nature of the distant mechanism.\n\n","date":"July 13, 2014 at 6:37 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137831","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I’ve been checking out Radon, which UK workplace and other sources say account for 50% of natural radiation;  Most commonly found associated with metamorphic geology, granites, schists, gneiss, and to a lesser extent LIMESTONE (i.e. Jerusalem geology).  Accounts for second greatest cause of lung cancers, only after tobacco smoke. \nSee simple comprehensive overview:\nhttp://en.wikipedia.org/wiki/Radon \nSeveral isotopes, all radioactive, most common is 222Rn, half-life 3.8 days, daughter products also radioactive:\nDecay chain:  Source chain – 238U to 226Ra to 222Rn:\nDaughter chain:  222Rn half-life 3.8 days, emits alpha to: 218Po half-life 3.10 minutes emits alpha to: 214Pb half-life 26.8 minutes emits beta to: 214Bi half-life 19.9 minutes emits beta to: 214Po h-l – 0.16ms, emits alpha to: 210Pb h-l 22.3 years, etc. \nDe Liso only obtained images in seismically active Piedmont, with emission of radon, changes in geo-magnetic-electric field, presence of gneiss (metamorphic), and presence of infra-sound.  \nA radio-active source may be implicated with image formation;  Caveat: Beta is not microwave nor UV shortwave as reported by Bernard Power cited by Colin Berry;  But alpha and beta might conceivably still be implicated.  Uranium source might still be present in limestone but in small amounts sufficient to generate Radon decay chain.\n\n","date":"July 13, 2014 at 8:30 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137878","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Millions of people the world over live in areas over granite bedrock and other radioactive geology, which results in accumulations of radon gas in the basement cellars etc. Surely we would have seen or heard of numerous incidents of Shroud-like images if radon, supplemented by “infra-sound” or whatever, were the prime causative agent?\nOr would De Liso say that one or other critical component from her ever expanding pre-Occamized checklist was missing?\n\n","date":"July 14, 2014 at 1:02 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137948","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I think it’s curious that De Liso seems to have been the only one to have produced anything that looks like persuasive looking images by a natural means.  To what extent they match the Shroud image properties (superficiality etc) she doesn’t state in her paper so that has to be a reservation.  She did use cloths with aloe and myrrh ‘inhibitions’.   Images were of a snake and a metallic key, and the key of course wouldn’t be generating amines.  Rogers dismissed the likelihood of radiation causing the TS image, as he couldn’t see it giving the necessary superficiality.  I think it may well be that radiation has some kind of role, perhaps in collimating the imaging process, or in producing the orthogonality.  I note there has been some research where 50 kHz power lines seem to have influenced the localised distribution pattern of radon molecules.  If it’s a natural process, it’s obviously very elusive, quite complex, but I’d suggest that radiation, although not necessarily the primary cause, may have some kind of significant role. And sure, I’m speculating!\n\n","date":"July 14, 2014 at 2:24 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137964","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I tried reading one of her papers once. Jargon-laden and largely impenetrable!\n\n","date":"July 14, 2014 at 2:28 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137966","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Possibly suffered in the translation.  She reports on 12 years of field experiments, that’s dedication.  The experiments themselves are interesting.  What you might make of them could be your subjective reaction to the text.  Lots of citations.  Check: Shroud-like image formation during seismic activity; Giovanna de Liso; ENEA Frascati Conference May 2010.\nhttp://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\n\n","date":"July 14, 2014 at 3:45 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137981","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Yup. That’s the paper I read (or tried to). Need I say more….\n\n","date":"July 14, 2014 at 3:51 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137983","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"“I like the question. It sort of supports my idea that the image, which I believe is somehow related to the Resurrection – an event I believe in – was not formed by a natural chemical reaction or by any form of energy that was the byproduct of a supernatural event. I know that sounds like I’m calling the image impossible. I know. But the Resurrection is impossible. The incarnation is impossible. Creatio ex nihilo is impossible. Right?”\nDan, very articulately conveyed, and I agree.\n\n","date":"July 14, 2014 at 3:35 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137977","author":"Thomas","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"If the sheet was pulled taut just before being imaged as per Izabel Piczek, assuming the blood is already there, you wouldn’t expect a secondary blood image.\n\n","date":"July 14, 2014 at 4:17 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137987","author":"ChrisB","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Methinks you might, ChrisB. Admittedly I referred only to relative movement between subject and fabric between transfer of blood and image-imprinting. I overlooked to mention the chief reason adduced to explain out-of-stereoregister bloodstains on hair instead of face – due to the need to imagine orthogonal projection of radiation, conveniently parallel to the Earth’s gravitational field – to explain imaging of upper and lower surfaces, not sides.\nI see that the formidable Bernard Power has tried to account for that orthogonal projection – some kind of distortion in the space-time continuum affecting the speed of light, balance between light and dark energy etc etc. One has to admire the guy’s chutzpah.\nOh, I misquoted him on the mix of radiation needed to sustain a radiation model, saying one was in the uv. That was a misreading of the summary on his main site. It would have been a mix of two kinds of microwave radiation he reckons, though still improbable. We agree on that much. His grounds for dismissing direct scorching, i.e. off a hot statue, are interesting. I feel another posting coming on.\n\n","date":"July 14, 2014 at 4:35 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-137990","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"John Jackson tries to explain the same kind of artifact at the neck region about 7 min into this clip:\n\nI think his configuration of the shroud is equally possible as Colin’s (but I side with Berry when it comes to close contact vs radiation).\n\n","date":"July 14, 2014 at 5:13 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138003","author":"Henrik","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Thanks Henrik. I needed one more (apart from myself) to make contact imprinting a modern ‘school of thought’. I shall now go and watch your video clip.\n\n","date":"July 14, 2014 at 5:20 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138005","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"“Forget air gaps where Shroud imaging is concerned. They fly in the face of known physics and chemistry. Shroud imaging did NOT occur across air gaps.”\nImage is continuous between the fingers. There are air gaps between fingers. \nOh yes, the TS man was chubby, had “moobs” and no air gap between fingers. \nOh no, it was a hot template.\nOh no, a hot template made on a real corpse.\nOr maybe, a thermochemical reaction.\nOr maybe, an impactogram.\n\n","date":"July 14, 2014 at 5:24 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138006","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"To our waspish commentator: I see scarcely any air gaps when I hold my hand up to the light.Try doing it with yours.\nBut there is tenting when linen is draped over crossed hands, and one sees an absence of image on the TS precisely where one expects it at the junction of the two hands.\nIt was Angel who introduced “breasts” into the discussion, not I. Yes, I used the term “moobs” light-heartedly, but do not subscribe to her thinking re genetics and feminization syndromes.\nI am still experimenting with thermochemical imprinting, and getting nowhere fast.\nThe initial idea that a corpse might release enough moisture (moisture note, not heat) to give a thermochemical reaction with quicklime, and thence heat for imprinting around the contours of the corpse, was tested and found wanting. One needs liquid water to get sufficient heat to scorch linen, and the latter has to be in direct contact with the quicklime, making it difficult or impossible to adapt for image-imprinting off a template, any template..\nIt is not an abandonment of simple thermal imprinting – just an alternative source of thermal energy, possibly more convenient than having to manoeuvre and heat metal effigies over hot charcoal. \nI have not abandoned the quicklime idea, but it’s probably a hiding to nothing: the heat abstracted  by a metal template  to raise its temperature means the maximum temperature achieved is then not high enough to scorch linen.\n\n","date":"July 14, 2014 at 5:46 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138015","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"No thumb, no air gap… aren’t you in an active (lively) position ?\n\n","date":"July 14, 2014 at 5:51 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138017","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"So you’re back in full point-scoring mode this morning. Speaking for myself I prefer to leave the set-piece battles  (“Shroud Wars”) to others.\n\n","date":"July 14, 2014 at 6:05 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138023","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"1- this is an active position\n2- even if you hold this position firmly there will be air gaps\nThank you for your answer.\n\n","date":"July 14, 2014 at 6:12 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138026","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"“Image is continuous between the fingers. There are air gaps between fingers”\nOn re-reading the above, I’m wondering if I interpreted your point correctly. Are you saying the fingers show a continuous image on the TS, despite expected air gaps? Or are you saying that the contact model requires a continuous image between the fingers, and that the TS image shows air gaps.\n\n","date":"July 14, 2014 at 6:33 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138037","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"The fingers show a continuous image on the TS, despite air gaps.\n\n","date":"July 14, 2014 at 6:37 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138041","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I can’t believe you just said that anoxie (though had misgivings, thus the request to get you to clarify).\nOf course there are “gaps” between the fingers on the TS. Take another look if you don’t believe me (making sure its a positive image, e.g. Durante 2002). But it’s the interpretation of those gaps that needs great care.\nThe gaps, more correctly poorly or non-imaged areas, could be due to one of two things. Either the fingers were separated, and the imaging process faithfully reflected those gaps, OR there were no gaps between the fingers of the subject (or at best very small ones), but the imaging process created a false impression of gaps.\nConversely, working back from image to subject: if one sees apparent gaps between the fingers on the TS image (which one does) then it could be due to one of two things: either the fingers really were separated with air gaps, OR the fingers were not separated, but the imaging process failed to imprint the entire width of the finger, due perhaps to their cylindrical nature, or because the underlying bone is what is predominantly captured in an ‘impactograph’, which is slimmer than the full-flesh finger.\nConclusion: the apparent separation of fingers in the TS image may or may not be real, depending on imaging mechanism. Finding the fingers ‘separate’ with ‘apparent gaps’  that are not necessarily real gaps does not allow one to differentiate between  the two imprinting mechanisms.\nFinding  ‘separate fingers’ on the TS is not inconsistent with a contact process, contrary to what you seem to suggest. Neither is it inconsistent with a radiation mechanism, but you are the one who have brought fingers into the debate, not I.\n\n","date":"July 14, 2014 at 6:57 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138055","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"The fingers show a continuous image on the TS.\nNot clear enough ?\nFingers are not separate.\nNo outline.\nHow an impactograph would imprint air gaps (no impact) ??\n\n","date":"July 14, 2014 at 7:06 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138059","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Could you try being less telegraphic with your comments, anoxie? I’m having difficulty in understanding you.\n\n","date":"July 14, 2014 at 7:13 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138062","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Shroud image is largely a contact image.\nStill, to get this image with a real corpse, no outline and slight distortion, you’ve to consider air gaps (“tenting”) and a distant mechanism.\n\n","date":"July 14, 2014 at 7:28 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138064","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Final comment: I prefer to look at image characteristics and try to decide what the subject was that produced the image, and by what process. That’s coming in from the opposite direction, needless to say,  from making a prioriassumptions about the subject from which the image was imprinted, and in so doing narrowing the range of image-imprinting mechanisms, and then trying to fit observations to just one of a multiplicity of conceivable image/image-imprinting models. It’s a case of leaving no stone unturned.\n\n","date":"July 14, 2014 at 7:55 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138073","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Final comment and you raise another question, is the subject a real corpse ?\nI guess it closes the discussion about air gaps. Thibault is right, you jump from one subject to another, then end discussion abruptly. \nEventually pdfs may be a good way to deal with your fancy theories.\nFinal comment i guess.\n\n","date":"July 14, 2014 at 8:24 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138080","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I made no reference to corpses in that last comment, anoxie. It was cast entirely in generalities. Once again, you are trying to damage my blogging credentials by any and all means possible.\nNo I have not closed discussion here on air gaps. I have closed discussion with trolling anoxie.\n\n","date":"July 14, 2014 at 8:29 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138082","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I’m getting lost here. It seems to me that the fingers of the hand which produced the image were in contact with one another so that there were no ‘gaps’ between them. I don’t think anoxie and Colin are in disagreement here? But the fingers appears well defined on the shroud. The fact that the fingers appear distinct on the shroud may be because:\na) Some form of collimated radiation or gas emission which attenuated with distance was responsible for the image.\nb) The whole hand was in contact with the cloth, but there was more pressure on the ridges of the fingers than in the troughs between them, and the image density depends on pressure.\nIf the image of the fingers does not depend either on the distance of the body from the cloth or on the relative pressure of the cloth in contact with the body, or a mixture of the two, then is anything else suggested?\n\n","date":"July 14, 2014 at 8:52 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138090","author":"Hugh Farey","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I have to head off, Hugh, but just had time to do a quickie experiment, at great personal expense (Nutella, £1.59).\nI smeared the stuff over the back of my hand, coating in between the fingers, then held my hand with fingers pressed together, and pressed into white cotton.\nHere’s the result:\n\nNot surprisingly in my view, the image makes it seem as if the fingers were separate, as per TS. But they weren’t, honest guv. \nI see no reason why imprinting with a viscous paint-like medium should give a result different from that of a template used as to produce a  ‘thermal impactograph’. In both instances, it is only those parts of the template that make direct contact with the fabric that can leave an imprint.\nBye for now.\n\n","date":"July 14, 2014 at 9:22 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138100","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Wonderfull outlines, air gaps between fingers, shroud image is continuous.\n\n","date":"July 14, 2014 at 9:28 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138103","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Try Vegemite next time. never waste Nutella — even for science.\n\n","date":"July 14, 2014 at 10:07 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138114","author":"David Goulet","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"My wife suggested Marmite,autolysed brewers’ yeast,  David, which as I expect you know, one either likes or loathes. I like, but considered it sacrilege to waste it on so mundane an experiment. Thus a trip to my local store for something else that is brown and tacky. It tastes fine, but I see the main ingredient is sucrose, which is getting a very bad press these days.\nWhat’s occurred to me since reporting that experiment is this: the TS fingers have also had a bad press for being excessively “bony” and unrealistic. Luigi Garlaschelli thought they were fabricated, and they have been used elsewhere in the TS literature to make the case for X-ray imaging (August Accetti etc).\nBut my own fingers look “bony” in that Nutella test, and so presumably would everyone else’s. Why? Because the fingers do not imprint across their entire width, due to curvature and supporting bone. So even fingers held together imprint as if parted from each other, i.e.splayed. \nConclusion: while the TS fingers maybe look a bit on the long side, they are not bony if the imprint were as I believe NOT a photograph, but an ‘impactograph’.\n\n","date":"July 14, 2014 at 10:49 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138130","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Do you think the force that caused the impact came from outside of the cloth or the inside?\n\n","date":"July 14, 2014 at 10:57 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138133","author":"David Goulet","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Outside obviously,  David, given my belief in the correctness of the radiocarbon dating pending further tests (thus man-made medieval artefact).\nBut if I were  100% pro-authenicity, and it were to be proved beyond any shadow of doubt that the TS image had been made by impaction of subject on linen (or linen on subject) I’d be tempted to suggest that Jesus made a high speed exit from an enveloping shroud, the process being what is technically termed  “resurrection” according to my one and only handbook on the subject (New Testament).  Not so much cloth-collapse theory (Jackson) but cloth-collision theory. \nNuff said. Mustn’t go putting ideas into impressionable minds…\n\n","date":"July 14, 2014 at 11:12 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138138","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Hi there, Colin and David\nThat Jesus had the ability to heal and cure was never contested even by his enemies, in fact it is this power that led one Israeli archaeologist to assert that it was what made the religious authorities fear him and pave the way for the crucifixion. This same archaeologist also stated that Jesus must have learnt medicine, only he did not say how and where.\nThe late Professor Geza Vermes, of Oxford, who I had occasion to interview in connection with his translation of the Dead Sea Scrolls, stuck another label on Jesus:\n“Exorcist”. Did he chase away evil spirits or did he also cure those were mentally ill? In the case of the Gerasene demoniac the NT itself says that he was siting in his “right mind” after Jesus cured him.\nWhatever, the narrative on the case of the woman with the issue of blood says that Jesus felt that “power” had gone out from him when she touched his cloak and was cured of the disease. She had been looking for a cure for twelve years.\nWas this the same power that acted during the Resurrection? Or was it lying dormant within his dead body and was activated by God?\n\n","date":"July 14, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138161","author":"Louis","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"“the fingers do not imprint across their entire width, due to curvature and supporting bone. So even fingers held together imprint as if parted from each other, i.e.splayed.”\nIt is the opposite we can see on the shroud : no outline.\nSo yes, it is a wonderful image to disqualify your thought, this is disarming.\n\n","date":"July 14, 2014 at 12:43 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138174","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"ps. What does everybody mean by ‘tenting’? In some cases it seems to mean that a cloth draped across an uneven surface sometimes does not follow the surface precisely, but hanging between two prominences does not make contact with the ‘valley’ beneath. Is that it?\nHowever, I think there is another draping effect which may also be called tenting. If a two dimensional cloth is draped over a three dimensional surface, then it buckles, producing whole ridges of cloth which do not hang, but stick up (like tents?) away from the surface. Draping a cloth over a uniformly painted ball, for example, results in several V-shaped areas of non-contact non-colouration. We do not see any of this on the shroud. Has anybody addressed this?\n\n","date":"July 14, 2014 at 9:02 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138093","author":"Hugh Farey","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Just waiting for the next ad hoc hypothesis, “tortles all the way down” said the old lady…\n“Tenting” : impactogram, no image (cf nutella experiment); shroud, image between fingers (distant mechanism).\n\n","date":"July 14, 2014 at 10:03 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138113","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Anoxie, you sound like someone who knows more than the casual Shroudie about the science being discussed. It would be helpful if you provided more background on what you feel the image is or isn’t.\nIt’s rather unsporting to take pot shots at Colin (and others) without offering your own ideas up for target practice.\n\n","date":"July 14, 2014 at 1:46 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138197","author":"David Goulet","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"“It is the opposite we can see on the shroud : no outline.\nSo yes, it is a wonderful image to disqualify your thought, this is disarming.”\nI’m discussing basic image characteristics, and Colin basic misunderstanding.\n\n","date":"July 14, 2014 at 2:01 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138205","author":"anoxie","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I can’t speak for others, Hugh, but when I use the term tenting it’s in the first of your two senses. \nAs regards the second of your scenarios, that’s pushing the envelope a bit (literally) methinks in attempting to imprint off so 3D an object as a sphere.\nThe trick with pressure imprinting is to press downwards into fabric placed over some kind of easily compressible underlay (sand, sacking). Even with fully round templates, the resistance to the template is such as to make it behave effectively as if a bas relief, with imprinting off the highest relief only with minimal ‘wrap-around’ lateral distortion. \nI’ve just done another Nutella experiment, comparing two modes of presentation – downward as described above, compared with placing the fabric on top of the template and manually moulding to contours.\n\nNote the unsightly lateral distortion when done by the second method.\nThere’s little doubt in my mind  if the TS image had been made by contact imprinting under pressure, then the geometry was fabric underneath, template on top, and the ‘bony’ fingers are exactly as expected from the model system, even using plain old Nutella as a kind of printer’s ink instead of a linen-modifying heat source.\n\n","date":"July 14, 2014 at 12:53 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138185","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Colin: ‘There’s little doubt in my mind if the TS image had been made by contact imprinting under pressure, then the geometry was fabric underneath, template on top (…)’\nFabric underneath, template on top: this is your ‘old method’:  LUWU method (Linen Underneath, with Underlay).\nIt seemed to me that you favorite method was now the LOTTO method: ‘(LOTTO = Linen On Top, Then Overlay).\nhttp://shroudofturinwithoutallthehype.wordpress.com/2013/11/30/more-thoughts-on-why-lotto-is-the-way-to-go/\nI would like to understand.\n\n","date":"July 14, 2014 at 2:37 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138213","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"I was wondering who’d be first to pick up on that detail!  Entrez Thibault.\nMy preference in principle for the LOTTO method was based on it being easier to obtain a reliably faint and subtle image, one that was scarcely visible under the microscope except as a very faint yellow discoloration.\nThat was before the age-attrition notion came along:  the extreme superficiality of the TS image might be due to loss over the centuries of more highly discolored fibres, a result of increased brittleness and mechanical fragility, tending to break off leaving just the fainter less damaged ones.\nIf the attrition idea is right (testable in principle if one had access to the TS) then there isn’t the same need to write off the face-down imprinting method, though it admittedly needs more careful control of temperature than the LOTTO method.  But that’s not asking too much, surely, of the people who built magnificent cathedrals that stand to this day.?\n\n","date":"July 14, 2014 at 3:00 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138217","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Thanks Colin,\nSo, if I understand well the ‘age-attrition’ notion (hypothesis ?) has something to do with your new/old paradigm.\nBut the ‘age-attrition’ idea is not true. The proof is on the Shroud itself.\nSee Fig.28 and 29 here:\nhttps://shroudofturin.files.wordpress.com/2014/04/scorch-2-eng-final.pdf\nDo you have other reasons to prefer now your old method?\n\n","date":"July 14, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138226","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Sorry, Thibault. No disrespect, but you cannot continue in this fashion, ignoring my critiques of your work, then dangling your pdfs under my nose as if the last word on the subject.\nThe pdf you cite made a totally incredible claim, one that anyone can disprove in their own home in minutes:\nQuote: \n“The cross section experiments show clearly that a light scorch, which is able to give a superficial\nimprint at fabric level is not superficial at all at\n thread level: the entire thickness of the threads\nin contact with the template is colored (while the\nthreads or portions of threads which are not in\ncontact with the hot template are not colored).” \nAll that anyone reading this needs to do is heat some metal,  scorch a linen thread, then tease the thread apart and count scorched v unscorched fibres. The vast majority will (or can be) unscorched, even from highly scorched threads.\n I posted a critique on Thursday, June 19, 2014\nTitle:  “Thibault Heimburger is incorrect. A linen thread CAN be scorched from a heated metal template on ONE SIDE ONLY.”\nhttp://colinb-sciencebuzz.blogspot.co.uk/2014/06/thibault-heimburger-is-incorrect-linen.html\nThus far there has not been a single word in response. Precisely the same happened when Thibault published his first anti-scorching pdf. I pointed out the totally unsuitable nature of his template – the opposite of bas relief, i.e. sunken relief. yet on the basis of that template he made some wild claims to the effect that a scorch would always display excessive contrast between light and dark, Nothing could be further from the truth, as I have shown with any number of bas relief  templates with subtle gradations of tone AND 3D-enhancibilty.\nAgain, Thibault refused to respond, claiming I had been rude (certainly I was scathing, but who wouldn’t be, given the way his pdf was written as if the last word on the subject, and treating me (clearly the target of the paper) as a non-person, there being not a single mention of any of MY experiments, to say nothing  a highly biased introduction, having the reader believe that contact scorching had been dismissed years ago. I cannot imagine that pdf ever being accepted for publication in a peer-reviewed journal, given that Introduction.\nHow I wish that Bernard Power was commenting on this thread. Now there’s a scientist (and I say that despite his pro-authenticity stance). He understands how science operates, via model building, patient model evaluation via open discussion with other workers in the field,  with progressive model refinement. Shroudology needs more Bernard Powers.\nGoodnight.\n\n","date":"July 14, 2014 at 4:31 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138244","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Tenting, Jul 14 comments: HF 9:02 am, CB 12:53 pm.\nAny surface curved in three dimensions cannot be developed in the plane without distorting or stretching.  The cylinder and cone are not curved in three dimensions and can be so developed; Spheres and ellipsoids cannot.  Commonest example is the globe of the earth.  It is impossible to create a two-dimensional map of the earth and to preserve the scale of all distances between any two places. \nIt is theoretically possible to enclose a sphere with a rubber sheet, to stretch it non-uniformly so that all points of the sphere are in contact with the sheet.  The distortion stretch of the rubber sheet cannot be uniform but must be variable (simple example – a child’s toy balloon cherry).  Most fabrics have neither the elasticity nor extensibility to maintain such contact.  If one of the curvatures is fairly flat then some practical fabrics may be sufficiently extensible to maintain contact. \nParts of the human body are curved in three dimensions: skull, shoulders, extremities, insteps, buttocks, small of the back.  Other parts are curved in two dimensions with only minimal curvature in the third dimension: limbs and trunk and semi-planar aspects. \nIt is therefore impossible, a mathematically physical certainty, to wrap a body in a linen shroud so that all parts of the body surface are in contact with it, and some tenting is inevitable where the body is sufficiently curved in three dimensions.  This compromises any assertion that the Shroud image can only arise from direct contact with the cloth.  Jackson and Jumper have of course shown that some of the imaging process can cross a small air gap, perhaps up to 4 cm, with some attenuation of the image.\n\n","date":"July 14, 2014 at 11:46 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138358","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"One of the most obvious details of the TS image is its incompleteness. Not only is there no imaging of the sides of the body, but there is no imaging of the top of the head, nor the sides of the face.\nThat’s not all. When scientists in the past have modelled the effect of placing a shroud over a corpse (see this simple sketch diagram in the Power paper)\n\n they reveal a fairly limited number of places where one expects an appreciable air gap between cloth and body:\n(a)  under the chin, assuming correctly (or otherwise) that the cloth tents between chin and chest\n(b) the area around the crossed hands\n(c) the frontal feet, assuming tenting at the tips of the toes.\nI have examined each of those three crucial points in my current posting, and in each instance find the facts fit the model albeit with some minor qualifying assumptions, supportive of a contact model, fitting with everyday experience, and obviating the need for mysterious radiation that can image across air gaps.\nIt’s proposed that the linen followed the contours of the chin, underside of chin, neck, chest to produce the peculiar alternation of light and dark we see in the neck region of the TS, where light and dark is not due to size of air gap, but to applied pressure (or directional vector thereof) between cloth and subject’s contours. \nYes, In the region of the crossed hands, we do see the effect of air gaps between  hands and abdomen, producing an either/or imprinting. Put another way there is scarcely if any imaging of those areas of the abdomen that abut on those raised hands, due to a tenting effect.\nThe hands and fingers themselves are interesting, and despite yesterday’s sniping, I have anoxie to thank for prompting my quick experiment with the Nutella that explains why the TS man’s fingers look so bony. I regard those results as a major step forward in my own understanding of those peculiar fingers, though I can’t speak for anyone else here.  \nReminder: no matter how close together one’s  fingers are when contact-imprinted, they will look skinny and separated on the imprint, at least when pushed DOWN into fabric.\nAs for the feet, I believe I also scored a first in showing that the “missing foot” (missing we were told because it is crosses over becoming superimposed onto the other) is in fact not entirely missing, that the tips of the toes were (if one looks closely) imaged exactly as one expects from tenting in the body-cloth profile referred to earlier.  It’s that tenting effect, not overlap, that explains why it’s only the tips that are imaged, the sizeable air gap explaining the absence of the rest of the “missing “ foot.\nTalk about spheres etc in the context of the TS is somewhat of a needless distraction methinks (I speak as an experimentalist, not a mathematician).. In modelling studies the human form could be said to behave more like a bas relief in the impaction model, albeit with those crucial “awkward bits” listed. But it’s the focus on those very same awkward bits that allows one to test model against reality, and though I say it myself I consider the model emerges with added credibility and dare I say scientific respectability (Thibault Heimburger and other anti-scorch evangelists please note), \n Meanwhile the radiation model looks increasingly improbable, lacking not just theoretical rigour but a complete absence of experimental confirmation.\n\n","date":"July 15, 2014 at 1:36 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138370","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Keep on, Colin. I suspect you’re on the right track. But I believe that track leads to an image theory that lies in the ‘let’s not go there’ territory you mentioned in a post above. Every insight you’ve shared recently points in that direction.\nFascinating stuff to be sure.\n\n","date":"July 15, 2014 at 9:49 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138486","author":"David Goulet","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Yup, the lonely furrow is by degrees turning into a good motoring road, though the absence of other traffic is peculiar and a little worrying. Shame too about the cracked windscreen due to local troublemakers firing off air gun pellets from the bushes that line the road.\n\n","date":"July 15, 2014 at 10:01 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138488","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Colin, I hope you’re eating at least some of that Nutella. That stuff is too good just to use for experiments.\n\n","date":"July 15, 2014 at 11:55 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138511","author":"Chesterbelloc","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Gourmet considerations aside. Nutella handprints on old cotton pillowcases work out a lot cheaper than heated brass crucifixes on linen.\n\n","date":"July 15, 2014 at 12:03 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138513","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Colin, no disrespect too but:\nyou wrote: ‘The pdf you cite made a totally incredible claim, one that anyone can disprove in their own home in minutes:\nQuote [from my pdf 2]:\nhttps://shroudofturin.files.wordpress.com/2014/04/scorch-2-eng-final.pdf\n“The cross section experiments show clearly that a light scorch, which is able to give a superficial imprint at fabric level is not superficial at all at thread level: the entire thickness of the threads in contact with the template is colored (while the threads or portions of threads which are not in\ncontact with the hot template are not colored).”\nYour comment: ‘All that anyone reading this needs to do is heat some metal, scorch a linen thread, then tease the thread apart and count scorched v unscorched fibres. The vast majority will (or can be) unscorched, even from highly scorched threads.’\nReread please your own words:\n‘ It is asking too much to expect one to categorise individual fibres by colour, say by probing with a needle. A subtle scarcely visible scorch is just that – a subtle scarcely visible scorch.’\nhttp://colinb-sciencebuzz.blogspot.fr/search/label/wilful%20misrepresentation%20of%20the%20scorch%20hypothesis\nThat’s true and for that reason I made some cross-section experiments and I have shown the results. \nRogers wrote in his book (A Chemist’s perspective on the Shroud of Turin, p.28):\n‘ When I looked at image areas through a microscope while pushing surface fibers apart with a needle, I could not be sure that colored fibers existed more than two deep in the dense image area at the tip of the nose. In some other image areas, it was nearly impossible to see a second level of colored fibers’. \nI have 2 precise questions:\n1) What about the ‘attrition mechanism’? It was my previous question and you did not answer.\n2) you wrote: ‘I posted a critique on Thursday, June 19, 2014\nTitle: “Thibault Heimburger is incorrect. A linen thread CAN be scorched from a heated metal template on ONE SIDE ONLY.”\nhttp://colinb-sciencebuzz.blogspot.co.uk/2014/06/thibault-heimburger-is-incorrect-linen.html\nYes a linen thread can be scorched from a heated metal template on one side only. I have even shown that in my first PDF.\nThe fact that there is no color on the obverse of a heated thread does not mean that the color is only found on the 2 or 3 first layers of the fibers of the thread.\nI have shown that in my PDF2.\nBut I have not seen a precise documented critical paper of my PDF 2.\nWhy?\n\n","date":"July 16, 2014 at 2:25 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138755","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Good evening Thibault. To avoid an overlong response, here’s a partial reply for starters, with a critical but well-intentioned observation at the end.\nSo, you make the bizarre claim that scorching is an all-or-nothing phenomenon at the thread level (thread note, no fibres, of which there can be 100+ or even 200+ per thread) and what’s your response? To quote back at me words I wrote in a somewhat different context! \nAt least you had the decency to give a link to where I wrote those words – a posting that goes right back to April 14th – 3 months ago, As I say, it was a different context, to do with the  faintest scorches that are scarcely visible, at least at the individual fibre level. So when I read your claim that light scorches affected the entire width of the thread, I decided immediately not to even try to reproduce your conditions, but to go for a much heavier scorch that would be easily visible to anyone shown the photographs.  Note that I was making it harder for myself, not easier.  Yet when I did that experiment, the result was as I expected – one can create an intense scorch on one side of a thread, without affecting the opposite side. (One can also tease it apart, and see a few heavily scorched fibres, i.e. deep brown the rest being essentially colourless.).\nHere’s a link to my photograph, showing a thread that is clearly scorched on one side only. \n\n“That’s true and for that reason I made some cross-section experiments and I have shown the results. \nCertainly you showed cut ends under the microscope which showed even coloration under your microscope,  though that’s not the same as making a thin transverse section as obtained with a microtome, and your only true cross-sections are in fact schematic diagrams, not actual photomicrographs.\nGiven you are still looking at relatively intact fibres and threads, you must be aware of the artefacts that are possible under the microscope, due to refractive index differences, dichroism, total internal reflection etc. Personally I set little store by what I see under the microscope unless supported by other evidence.\nI have to say think you have your work cut out for you, explaining how or why you can see complete thread scorching under your microscope when anyone with 5 or 10 minutes to spare, a linen thread and heated metal should be able to reproduce my photograph in seconds, showing that  two-tone end-result on the one thread. What’s more they don’t need a microscope to see the result of teasing it apart, with majority of fibres having escaped being scorched.\nOr are you claiming that the faintest of scorches can miraculously propagate across every single fibre in the entire thread, while a heavier scorch cannot? Why would a low-energy scenario produce a greater effect at a distance than a much higher energy input? Sorry, but that makes no sense whatsoever.\nI must break off now, havingsome other matters to attend to, and will respond to your other points later, probably tomorrow.\nIn the meantime, might I commend to you the following extract from the physicist/meteorologist Bernard Power, whom I complimented a day or two ago for his thoroughgoing scientific approach, even of we are poles apart on some of his assumptions (e.g. that 3D enhancement needs a radiation model, when both of us know otherwise from applying ImageJ to contact scorches.). Note especially the last paragraph ( my bolding) . \nExtract from Bernard Power PhD\nI’ve omitted his numbers to references.\nhttp://www.shroudscience.info/index_files/THE%20SCIENTIFIC%20FACTS%20Word.htm\n                      #######################################\nWas the Shroud image made by a scorch from  a heated  metal statue?\nThis theory originated from the observation that image on the linen has many of the characteristics in hue and shading that a thermal scorch on linen can produce.  Consequently it was theorized by Ashe  and others that if a linen cloth were to be draped over a metal effigy heated to 250 deg. C (which is about the scorch temperature threshold for linen) then the image could have been produced. Since the draped cloth would have various air gap distances between statue and the cloth draped over it, and since thermal radiation is attenuated in air to some degree as it passes across the air gap, then some three dimensional information might be transferred to the cloth, points closest to the statue being more scorched than those farther away. However, thermal radiation spreads out widely, and so would not give the required definition to the image features. In addition, the attenuation rates, or the drop off in radiation intensity with distance traveled through air, could not  match those observed on the Shroud image.\nFurthermore, a true scorch also causes linen to fluoresce under ultraviolet or X-ray examination. But the STURP team of investigators who examined the Shroud  in 1978 found that, although the burnt patches on the Shroud from the 1552 fire did fluoresce as expected, the image areas showed no signs of fluorescence at all.  Therefore, the  image on the Shroud  was not made by a thermal scorch.\nAlthough, since it is a ‘fraud theory’, the hot statue theory  is today untenable against  the accumulated evidence for authenticity, it   has been historically very useful  because it proposed a chemical degradation of the cellulose, and so spurred investigation of an essential ingredient of any plausible image formation theory.\n                    #######################################\nNow there’s someone who understands the role and indeed necessity of model building in science. You Thibault would appear not to. Do you not have any ideas at all about how the image was formed? Are you content to nitpick on minute detail, or  (worse still) to disseminate via your unchallengeable pdfs totally misleading or incorrect information about thermal imprinting, i.e. scorching by contact, while making no constructive contribution yourself. Note the self-critical manner in which Power develops his own ideas re the alternative radiation model. \nMessage to Dan Porter; how come Bernard Power has slipped below your radar screen, despite publishing some truly seminal work on the radiation hypothesis?\n\n","date":"July 16, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138774","author":"Colin Berry","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"What do make of this paper by Power re: the side strip:\nhttp://www.shroudscience.info/index_files/The%20Side%20Strip.pdf\n\n","date":"July 16, 2014 at 4:49 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138776","author":"David Goulet","site":"shroudstory"},{"title":"Why Doesn’t the Blood Create an Image?","post":"Thought-provoking, provided one’s prepared to make a willing suspension of disbelief.  That’s true for most of his writing across a wide range of topics (tornadoes, climate change, cosmology etc etc). He’s a highly original mind, worth reading even if 90% is wrong. The 10% that remains could be gold dust.\nMaybe you should direct your question to Adrie Van Der Hoeven. She’s all clued up on that side strip. I personally tend to give wide berth to anything that looks remotely like a riddle, wrapped in a mystery, inside an enigma.\n\n","date":"July 16, 2014 at 6:09 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","id":"comment-138794","author":"Colin Berry","site":"shroudstory"}]
