[{"title":"Yannick Clément on Paul Maloney’s St. Louis paper","post":"Very nice piece Yannick.\nyour number 3 is always compelling for me. The one or two rare exceptions are small or private pieces. Very different from a “forgery” designed for wide public viewing!!!!\n\n","date":"December 8, 2014 at 3:24 am","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","id":"comment-175189","author":"Thomas","site":"shroudstory"},{"title":"Yannick Clément on Paul Maloney’s St. Louis paper","post":"The no.3 feature you find so compelling, Thomas, namely the absence of a loin cloth, is maybe not so unexpected if you think through the logistics of producing an artefact that is hardly a ‘forgery’ (there being no ‘original’ for us to view) but something maybe better described as an elaborate hoax.\nThe key question that needs to be asked is “What was the hoaxer attempting to portray, especially as regards the faint, almost ghost-like body image?” A ‘photocopy’ captured at the instant of resurrection seems unlikely: it may appeal to 20th/21st century imagination, but there’s no evidence I’m aware of that it was ever interpreted in those terms by the first cohorts of pilgrims, least of all St. Francis de Sales, Bishop of Geneva,  in that 1614 letter home to his mother. He saw the image as one of ‘sweat and blood’, and that to me would seem as good a starting point as any: the TS body image was (as I have proposed here a number of times) skilfully engineered as a ‘Veil of Veronica’ -like sweat imprint.\nOK, so one sets out to fabricate what a sweat imprint might look like if taken shortly after crucifixion. Does one show a loin cloth on one’s body image? Answer: NO!. Any loin cloth would have absorbed the sweat and blood seat and ‘stolen’ the imprint of the problematical midriff  region, preventing it appearing on Joseph of Arimathea’s linen. \nWas there an alternative way of preserving modesty? Yes, indeed there was. Show hands crossed over groin, even if, as some suggest, no one really has arms long enough to do that naturally after death. Buttocks? Ensure they get their fair share of those 372 scourge marks. Indeed the latter – flagellation overkill — serves a crucial role anyway in allowing one to make a visual spectacle of a very faint body imprint:a spectator may not be able to make out the body image clearly from a distance, as Charles Freeman has been at pains to point out (then proceeding straight to the scene of the accident – his misguided paint theory) but he can make out the form of a naked male if the latter is covered from head to foot with blood and scourge marks. \nA gory spectacle did not need an intense background body image, and indeed it, and a “painting-like’ loin cloth would have detracted from credibility. The genius of the TS lies in the hard logic and self-discipline that determined not only what was to be imaged, but,just as important, what NOT to image. I say it was designed and executed to represent an imprint in sweat and blood. Artistic add-ones  like a loin cloth or crown of thorns, even tears and/or punctures in body flesh,  were ruthlessly rejected at the planning stage. Everything had to be “just right”. Nothing that was allowed to feature in the TS image that would leave no imprint in sweat or blood . That’s one of the reason why its held its fascination for so long (that and the 3D properties that show it was template-derived, not a freehand portrait in artist’s pigments).\n\n","date":"December 8, 2014 at 4:14 am","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","id":"comment-175193","author":"Colin Berry","site":"shroudstory"},{"title":"Yannick Clément on Paul Maloney’s St. Louis paper","post":"Berry said:  “the TS body image was (as I have proposed here a number of times) skilfully engineered as a ‘Veil of Veronica’ -like sweat imprint.”\nAgain, what sources are you quoting who ever observed the Veil of Veronica as a “sweat imprint”?  \nThe only person who has seen (close up) what the Vatican says is the Veronica was Jesuit art historian Joseph Wilpert who saw only “a square piece of light coloured material, somewhat faded through age, which bear two faint rust-brown stains, connected one to the other”.  (Nothing about looking like a sweat-imprint).\nFurther, all of the probable copies and all of the suspected copies of the Veronica from the Middle Ages (from all over Europe) attempted to portray a full-color face, not a sweat imprint.  You can see them on-line.  No one attempted to portray, in their copy, a “sweat imprint.”  \nTherefore, NO ONE would have attempted to “engineer” a TS body image as a “sweat imprint”.  Is there a burial shroud anywhere in Europe that  would  have inspired a hoaxer to try such a scheme, and have other people (who had also not seen such a thing) believe it?\n\n","date":"December 8, 2014 at 12:03 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","id":"comment-175237","author":"Nabber","site":"shroudstory"},{"title":"Yannick Clément on Paul Maloney’s St. Louis paper","post":"Nabber: my advice to you is to start thinking BIG and out-of-the-box. You will never be able to understand the impact of the TS, past and present, unless or until you  are prepared to do that. \nRegard the Veronica as a trial run, one that conceptually allows an instantaneous sweat imprint to morph by  degrees, over years, maybe decades, into something altogether more striking, the process aided and abetted by generations of artists, all exercising artistic licence, all pushing the envelope (if you’ll forgive modern parlance).\nTheir likely medieval defence when credibility was questioned:  simply invoke the supernatural. It’s the Son of God we’re dealing with here, after all, immediately prior to crucifixion (Veronica legend ) and then immediately post-crucifixion  (biblically endorsed, generating a FANCIFUL, dare one say Veronica-like imprint onto Joseph of Arimathea’s linen). Don’t ask for supporting evidence for fanciful imprints. That’s to miss the point entirely.\n  Oh, and never underestimate human imagination and ingenuity in situations where anything seems possible. Personally, I try to keep an open mind.  Some things are not possible in conventional scientific terms, but nothing is impossible for those prepared to think BIG. Medieval artists knew that intuitively in progressively ratcheting up the Veronica from monochrome sweat imprint to fully-fledged life-like facial image. \nThe TS, with its non-photogenic negative image, with spare and uncompromising  gory realism., was somewhat conservative in comparison. That is and was surely the secret of its enduring success – the in-your-face realism as distinct from artistic fancy.\n\n","date":"December 8, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","id":"comment-175240","author":"Colin Berry","site":"shroudstory"},{"title":"Yannick Clément on Paul Maloney’s St. Louis paper","post":"CB:\n1.You have cited no other sweat prints during medieval times–do so or abandon your Veronica and TS as sweat prints theories.   2. You have cited no one who ever described the Veronica as a sweat print (except you).  3.  You have described a magical concept in which medieval artists (and oh by the way, ALL of them) turned a sweat print into a painting rather than what really happened, simply turned a painting into a copy of a painting.\n\n","date":"December 9, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","id":"comment-175390","author":"Nabber","site":"shroudstory"},{"title":"Yannick Clément on Paul Maloney’s St. Louis paper","post":"p.s., Colin, you’re not helping your case but responding like a pompous ***\n\n","date":"December 9, 2014 at 12:54 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","id":"comment-175391","author":"Nabber","site":"shroudstory"},{"title":"Yannick Clément on Paul Maloney’s St. Louis paper","post":"Hello Nabber.\nOff-topic.\nYou once mentioned on this blog that some archeologist found red old blood on some artifact.\nDo you have some reference for that?\nIf so, maybe it would be a good idea to send them to Dan.\n\n","date":"December 9, 2014 at 12:55 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","id":"comment-175392","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on Paul Maloney’s St. Louis paper","post":"I was looking for articles about the discoveries of Thomas Loy.  Let me search again and get back to you.  It was first mentioned by Kelly Kearse, who had seen it in Ian Wilson’s writings.\n\n","date":"December 9, 2014 at 2:55 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","id":"comment-175402","author":"Nabber","site":"shroudstory"},{"title":"Yannick Clément on Paul Maloney’s St. Louis paper","post":"Loy et al. (1990) reported on material found at rock-art site DMP6 from Laurie Creek, Northern Territory, Australia. The material was described as a brown-red “pigment” that had naturally exfoliated from a rock shelter. The material was dissolved in water and applied to an Ames Hemastix test strip and gave a positive reaction for the presence of blood. The solution was then subjected to a dot-blot test using SP-A and produced a positive identification for IgG. The substance was then examined with a sandwich ELISA test. The first antibody was supposed to bind primate serum albumin in the residue; the second antibody was monoclonal for human serum albumin. The test was positive for human blood. The AMS radiocarbon date on the material was 20,300 yrs +3100yrs  -2300yrs B.P.\nLoy (who died in 2005) found lots of Red-Blood-Cells on lots of artifacts — the problem we are talking about, though, is whether the observed color was red, or brown/black, of any of the discovered Red Blood Cells.  I couldn’t find any more of the “observed red”.\nSource:  A Consumer’s Guide to Archaeological Science, 2011\n\n","date":"December 9, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","id":"comment-175408","author":"Nabber","site":"shroudstory"},{"title":"Yannick Clément on Paul Maloney’s St. Louis paper","post":"It is this:\nhttp://tinyurl.com/lhprbgh\nThanks, Nabber.\n\n","date":"December 10, 2014 at 3:13 am","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","id":"comment-175492","author":"O.K.","site":"shroudstory"}]
