[{"title":"Yes, Blood on the Shroud Really Could Be Really Old","post":"The only value in Colin Berry’s comments is that they engender inspired posts like this one. Berry is a classic pseudo-skeptic. He has a belief system that can not tolerate the existence of the Shroud as a true artifact. So he swings wildly and pontificates on matters far beyond his expertise.\nThe downside to Berry’s posts is the time we often waste paying attention to them. Yet, we must confront the pseudos head-on in the marketplace of ideas. In this time and place,\n\n","date":"July 19, 2012 at 6:41 am","url":"https://shroudstory.com/2012/07/19/yes-blood-on-the-shroud-really-could-be-really-old/","cat":"blood_studies","id":"comment-13975","author":"John Klotz","site":"shroudstory"},{"title":"Yes, Blood on the Shroud Really Could Be Really Old","post":"I haven’t been following the shroud posts recently but I see that Colin Berry still has an axe to grind concerning the authenticity of the shroud.And I see also that he’s been shot down…again.\n\n","date":"July 19, 2012 at 8:27 am","url":"https://shroudstory.com/2012/07/19/yes-blood-on-the-shroud-really-could-be-really-old/","cat":"blood_studies","id":"comment-13977","author":"John K. M.","site":"shroudstory"},{"title":"Yes, Blood on the Shroud Really Could Be Really Old","post":"The blood on the Shroud has been proven to be real human blood by Adler and Heller from STURP and this conclusion was independently confirmed by Baima Bollone in Italy almost at the same time (beginning of the 80s).  The fact that blood on the Shroud is real human blood is maybe the strongest scientific FACT concerning the Shroud of Turin, proving that there really was a tortured and crucified man enveloped in that burial cloth for less than 72 hours (a man who bears all the stigmatas of the Passion of the Christ, as reported by the Gospels).  This is the main goal of my upcoming paper to emphasize this FACT.  By the way, my paper is done and in a very near future, it should be published on an american website dedicated to the Shroud.  Stay tune for more information about that.  I hope Colin will take time to read this upcoming paper of mine.  I don’t think he’ll change his mind, but at least, this paper will force him to reflect upon one or two thing, which is a very good thing.\n\n","date":"July 19, 2012 at 3:08 pm","url":"https://shroudstory.com/2012/07/19/yes-blood-on-the-shroud-really-could-be-really-old/","cat":"blood_studies","id":"comment-13985","author":"Yannick Clément","site":"shroudstory"},{"title":"Yes, Blood on the Shroud Really Could Be Really Old","post":"It seems clear; Colin has NOT done much research in this area, as there are many examples of study on ancient blood which can be found easily through some simple Google searches. Further to Hiemburger’s list above lets not forget [Otzi the Iceman] and his 5300 yr old blood cells, or the 2000 yr old blood found on Obsidian knifes at the Canlona site in Mexico or the fact that Thomas H Loy found blood residue on a 10,000 yr old [slab of stone] in Turkey, blood on a slab that had undoubtably been exposed to the elements for millennia, and blood in which he was still able to analyze quite well…I think Colin’s (amongst other’s) futile attempts to disregard the true scientific studies done by Adler, Heller and Ballone on the blood of the Shroud, experts in their field and, proving it is human blood, has put him in a corner and he now blindly reaches for nonsensical  solutions.\nR\n\n","date":"July 19, 2012 at 3:59 pm","url":"https://shroudstory.com/2012/07/19/yes-blood-on-the-shroud-really-could-be-really-old/","cat":"blood_studies","id":"comment-13989","author":"Ron","site":"shroudstory"},{"title":"Yes, Blood on the Shroud Really Could Be Really Old","post":"¡No me permite los comentarios! Me indica que están duplicados.\n\n","date":"July 20, 2012 at 8:01 pm","url":"https://shroudstory.com/2012/07/19/yes-blood-on-the-shroud-really-could-be-really-old/","cat":"blood_studies","id":"comment-14039","author":"carlos","site":"shroudstory"},{"title":"Yes, Blood on the Shroud Really Could Be Really Old","post":"¡Lo escribo de otra manera! Lo he intentado sin éxito poner siete u ocho veces…..\nEscribía el “abstract” del trabajo de Sam.F. Pellicori publicado en Applied Optics Vol.19, Issue 12, pp 1913-1920 (1980) , Optical Society of America, titulado “Spectral properties of the Shroud of Turin”.\nEntre otras cosas dice:\n“The bloostained areas have the spectral characteristics of human hemoglobin.”\n\n","date":"July 20, 2012 at 8:13 pm","url":"https://shroudstory.com/2012/07/19/yes-blood-on-the-shroud-really-could-be-really-old/","cat":"blood_studies","id":"comment-14040","author":"carlos","site":"shroudstory"},{"title":"Yes, Blood on the Shroud Really Could Be Really Old","post":"Otro trabajo interesante es el de “Analysis by Raman Microscopy of powder samples drawn from the Turin Shroud”. Giulia Moscardi. 2008\n“Method of sampling and analyzing The samples analysed are dusts recovered through aspiration by G. Riggi from Numana, in 1978 and 1988, in the space between the Turin Shroud and the Holland Cloth stitched to it. Such dusts are conserved at the Fondazione 3M of Milan-Segrate and partly they were freely delivered to G. Fanti for the purpose of study; they were selected and arranged in suitable slides. Those samples have been analysed with the team of prof. Pietro Baraldi (University of Modena and Reggio Emilia, Italy) by means of Raman microscopy.\nConclusions and Perspectives\nThe analyses with Raman microscopy enabled the presence of HEMOGLOBIN and of poorly crystallized iron oxides as blood degradation products to be ascertained.\nThe presence of a number of pigments and materials used in painting has been referred to a contamination and attributed to the painters who usually prepared copies of the Shroud.\nWhereas the presence of some materials can not find an interpretation, the one of Silicon Carbide SiC, typical of the Turkish coast, should confirm the historical datum of the passage of the Shroud in that area.\nThe Raman technique has supplied interesting new data; the research could be extended to other powders, in order to identify other characteristic materials and thereby widen the database available. An experimental study of the kinetic and conditions of blood degradation as a consequence of heating, light and radiation should be included.”\nGiulia Moscardi está especializada en el estudio mediante la “Raman Microscopy” de obras de arte y arqueologicas.\nCarlos\n\n","date":"July 22, 2012 at 5:47 am","url":"https://shroudstory.com/2012/07/19/yes-blood-on-the-shroud-really-could-be-really-old/","cat":"blood_studies","id":"comment-14086","author":"carlos","site":"shroudstory"}]
