[{"title":"You guys are brutal","post":"That is why no relic in the Catholic Church is an article of faith.\n\n","date":"October 8, 2013 at 12:14 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46486","author":"Louis","site":"shroudstory"},{"title":"You guys are brutal","post":"Title: “You guys are brutal”\nThe term “brutality” does not exist in the scientist’s lexicon.There is no place for finer feelings – all that matters is getting to the truth.\nNote: this comment will not appear until vetted by the site’s  Protestant Episcopalian but quasi-Catholic host –  protecting  as always the finer sensibilities of Catholic relic-worshippers.  Those shrinking violets express no opinions here, being content to send Dan Porter protesting emails whenever they encounter a “brutal” comment. \nWhat a crap wolf-in sheep’s clothing site…You disappoint me Dan Porter. Get some Protestant balls for God’s sake.\n\n","date":"October 8, 2013 at 12:47 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46489","author":"colinsberry","site":"shroudstory"},{"title":"You guys are brutal","post":"The only reason Colin’s posts are monitored now — they weren’t always — is because of his ‘brutal’ ad-homs in lieu of substance.\n\n","date":"October 8, 2013 at 12:56 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46490","author":"Dan","site":"shroudstory"},{"title":"You guys are brutal","post":"One man’s ad hom is another’s pointed observation. As I say, what matters is the truth, and this particular commentator has lost count of the number of “ad homs” he’s encountered on this site through attempting to peel away the mythology that masquerades as Shroud “science”. “Image always under bloodstain” anyone? “Only the Shroud has encoded 3D information” anyone? “Invisible reweaving” that invalidates the radiocarbon dating but which fails to disturb that subtle banding one sees under uv anyone?\nBye once again. Have fun endlessly procrastinating,  when all that is needed is to repeat the radiocarbon dating on a less peripheral strip of Shroud. (But it’s a lot more fun blackening the credentials of the Oxford and other labs, isn’t it, they being “anti-faith” scientists?).  Jesus wept.\nAwaiting pre-moderation by your ever-anxious-to-please relic-friendly blog host.\n\n","date":"October 8, 2013 at 1:13 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46494","author":"colinsberry","site":"shroudstory"},{"title":"You guys are brutal","post":"Hullo Colin, long time no hear. Dan is open-minded and allowing commentators to have their say and not many are Catholic relic-worshippers, some are are Protestants, sceptics, atheists, and the blog has improved a lot because posts are monitored to delete personal attacks, four-letter words, nasty comments from anonymous commentators…\n“Protestant balls”? Have you seen those websites and blogs belonging to Evangelical Protestants in the US?\n\n","date":"October 8, 2013 at 1:08 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46492","author":"Louis","site":"shroudstory"},{"title":"You guys are brutal","post":"Colin, what is ‘truth’?\n\n","date":"October 8, 2013 at 2:52 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46512","author":"David Goulet","site":"shroudstory"},{"title":"You guys are brutal","post":"What is truth?  I cannot speak for truth in the spiritual dimension. But the TS is not a spiritual concept. It’s a physical entity, carbon-dated to the 13th/14h century. and thus amenable to the scientific method, whether or not the dating is entirely accurate.\n  While I am competent to speak on scientific truth, based on general precepts like concordance between hypothesis and fact, predictive utility, you know, all those down-to-earth pointers, I don’t claim to be the ultimate authority where scientific or any other truth is concerned. Why should anyone in their right mind claim to be? So what is the point of  challenging someone to state what they understand by truth, except to hint or suggest  that truth is an illusion?  Is a communicating laptop an illusion? Is computer code a mere approximation to truth? Are you receiving a garbled version of my words?  \nSo what is the point of your question? Is it to suggest that one is going beyond the science into realms beyond science? I am not, repeat, not doing that. I am discussing the Shroud of Turin. So what are you discussing. What do you understand by “truth” – scientific truth that is?\nYou could try directing your question to the Nobel prize awarding committees.They seem pretty good at distinguishing truth from ephemeral fads.\n\n","date":"October 8, 2013 at 3:38 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46525","author":"colinsberry","site":"shroudstory"},{"title":"You guys are brutal","post":"You, sir, are a drama queen. Dan, you can delete this if it is an ad hom. However to me it’s simply an observation.\n\n","date":"October 8, 2013 at 4:03 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46532","author":"David Goulet","site":"shroudstory"},{"title":"You guys are brutal","post":"“You, sir, are a drama queen”. No sir. I am a retired scientist, and you, with your  obnoxious comment, represent everything that is wrong with this site.\n\n","date":"October 8, 2013 at 4:11 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46533","author":"colinsberry","site":"shroudstory"},{"title":"You guys are brutal","post":"You see that was an experiment I just did. Real science! Thanks for confirming my hypothesis.\n\n","date":"October 8, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46534","author":"David Goulet","site":"shroudstory"},{"title":"You guys are brutal","post":"Enough with the personal attacks.\n\n","date":"October 8, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46535","author":"Dan","site":"shroudstory"},{"title":"You guys are brutal","post":"I asked Colin, ‘what is truth’, to better understand what exactly he seeks from this blog. His answer was revealing. The majority of his reply was what I would expect from a retired scientist and there’s nothing wrong in that. But it was also infused with assumptions of my motivation for even asking the question. It reminded me of Groucho Marx’s take as Rufus T Firefly who works himself into a lather imagining the insult that his opponent is about to deliver (when it fact the man was about to shake his hand). We went off track from there. My apologies for the unhelpful diversion.\n\n","date":"October 8, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46537","author":"David Goulet","site":"shroudstory"},{"title":"You guys are brutal","post":"How disappointing. Whether or not contributors to this blog agree, or don’t,  most posters here are civil.  I am guilty of some pretty risqué tongue-in-cheek, but to insult Dan-no way, man. No way.  This is not the place for sectarian insults, or anti-religious diatribe, or hostility masquerading as scientific detachment.  Dan, I can’t ask you to censor anyone, but this Colin drags everyone here down to a level incompatible with intelligent debate. No one here should be calling names or attacking anyone personally, its just not the place, simple as that.\n\n","date":"October 8, 2013 at 10:48 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46578","author":"Josie L. Tyner","site":"shroudstory"},{"title":"You guys are brutal","post":"No one here should be calling names or attacking anyone personally, its just not the place, simple as that.\nNice sentiment. Shame that the sole raison d’etre of the site is to defame the people who produced the radiocarbon dating, and to do so with barely concealed innuendos and smears that stop just short of legally-actionable libel. \nThis site has to be just about the worst advertisement for Christianity imaginable, and you – with that comment – have just contributed to the rank odour of nauseating hypocrisy, whether aware of having done so or not.\n\n","date":"October 9, 2013 at 4:26 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46601","author":"colinsberry","site":"shroudstory"},{"title":"You guys are brutal","post":"ROFLMAO\n\n","date":"October 9, 2013 at 7:10 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46615","author":"Dan","site":"shroudstory"},{"title":"You guys are brutal","post":"More extravagant nonsense from the serpent yet again raising its head in the Garden of Paradise.\n\n","date":"October 9, 2013 at 5:35 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46606","author":"daveb of wellington nz","site":"shroudstory"},{"title":"You guys are brutal","post":"gee, my 5 year old daughter is more mature (and intelligent) than some here….\n\n","date":"October 9, 2013 at 5:44 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46607","author":"Matthias","site":"shroudstory"},{"title":"You guys are brutal","post":"Oh, it makes me soooo mad. (Lou Costello, circa 1950).\n\n","date":"October 9, 2013 at 6:54 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46613","author":"John Klotz","site":"shroudstory"},{"title":"You guys are brutal","post":"Fressssssshly wikipromoted Dr I. Colinssssssberry ssssstrikessssss again. How inssssssipidly insssssightlesssss!\n\n","date":"October 9, 2013 at 8:57 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46628","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"Through Dr I. C’s eyes, all that matters is everybody getting to his pseudo-scientific & pseudo-archaeological ‘truth’: a neo-Templar hoax as a cloth painted with leeches used as blood felt-tipped pens in reference to Jacques de Molay burning at the stakes (sic!). The ‘conversion to such an allegedly ‘academic’ view is likely to take some time…\n\n","date":"October 9, 2013 at 9:18 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46637","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"I actually liked Colin’s leech theory. It was an example of creative problem-solving backed by attempted science on his part. It’s that type of creative science that leads to unexpected insights. Give me more of that and less of the haranguing and it’s all good.\n\n","date":"October 9, 2013 at 9:48 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46642","author":"David Goulet","site":"shroudstory"},{"title":"You guys are brutal","post":"Pseudo-science, pseudo-archaeology and pseudo-history (Dan Brown type) can be fun in fiction or science-fiction. Ohterwise it is only spoiling the field when not poisoning the well.\n\n","date":"October 9, 2013 at 10:31 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46651","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"…the well of truth.\n\n","date":"October 9, 2013 at 10:38 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46652","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"I am not seduced at all by Dr I. Colinsberry’s leech theory. It just belongs to romance.\n\n","date":"October 9, 2013 at 10:41 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46654","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"BTW, CB, no news from ‘your’ Royal Academy?\n\n","date":"October 9, 2013 at 9:20 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46638","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"Colin, see #5, which you did not answer. This blog is not advertising Christianity at all, so much so that sceptics, anti-“archmiraculists” like Max, who has made some good contributions, atheists, freethinkers and so on have joined the debate. This would not be possible in those fundamentalist sites and blogs maintained by those who have “Protestant balls”, and regarding these “Protestant balls”, are you Protestant? If not, then it means the approach is like the one adopted by RD, with his anti-Catholic diatribe, linked to his old fashioned Anglican unconscious, which, strangely, has not “evolved” for a neo-Darwinian like him. It is outmoded in most of today’s Anglican intelligentsia. Remember, Queen Elizabeth II, not the Duke of Norfolk, invited Pope Benedict XVI to visit England. If prejudices are brushed aside and genuine scientific discussion takes place, everyone would welcome it.\n\n","date":"October 9, 2013 at 9:38 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46640","author":"Louis","site":"shroudstory"},{"title":"You guys are brutal","post":"Louis, I am anti-archfraudulists too…\n\n","date":"October 9, 2013 at 10:44 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46655","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"Yes, Max, I know that, and you are needed because of your on-site research.\n\n","date":"October 9, 2013 at 12:12 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46667","author":"Louis","site":"shroudstory"},{"title":"You guys are brutal","post":"I no longer comment here routinely because of pre-moderation. So I do not intend to answer your question in detail. All I would say re the objectivity of this site, with its categorical statement that the Shroud is “at least twice as old as the now discredited (sic)carbon 14 date”,  and its religious bias is this: take a look at what appears under the “About” tab.\nhttps://shroudstory.com/about/\nNote also the protest from one Brad Gore, who says he was involved in the original radiocarbon dating, and see what response he gets from the site’s host (none whatsoever, followed by “comments are closed”). Scientific objectivity? Ha!\n\n","date":"October 9, 2013 at 11:23 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46663","author":"colinsberry","site":"shroudstory"},{"title":"You guys are brutal","post":"PS:   Brad H. Gore was third author on the 1989 Nature paper with the radiocarbon dating:\nDepartment of Physics, University of Arizona, Tucson, Arizona 85721, USA\n\n","date":"October 9, 2013 at 11:45 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46664","author":"colinsberry","site":"shroudstory"},{"title":"You guys are brutal","post":"See also “Brad H.Gore says”.\nhttps://shroudstory.com/2008/09/28/brad-h-gore-says/\n\n","date":"October 9, 2013 at 7:06 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46717","author":"colinsberry","site":"shroudstory"},{"title":"You guys are brutal","post":"Dr. Michael Tite was present at the Round Table convened by Cardinal Severino Poletto, Prof. Christopher Ramsey is still open to suggestions and Brad Gore got his replies in this very blog a long time ago. With so much controversy there seems to be no point in cutting a piece of the relic for yet another CD test, not forgetting that there is no guarantee that correct results will be obtained. We will probably have to wait for further developments in science, and as IW wrote years ago, God may have turned down the blinds. If he hadn’t there would be no shroudstory. We humans are finite, there are limits to what we want to arrive at. Stephen Hawking wants to know the mind of God, and decades after Freud we still do not know enough about the mind, and decades after Einstein we still do not know the mind of God. True religion teaches us about the Will of God and that was what Einstein was aiming at when he spoke about God because he knew we will never know the mind of God.\n\n","date":"October 9, 2013 at 10:07 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46728","author":"Louis","site":"shroudstory"},{"title":"You guys are brutal","post":"With so much controversy there seems to be no point in cutting a piece of the relic for yet another CD test, not forgetting that there is no guarantee that correct results will be obtained. We will probably have to wait for further developments in science,\nSo you are content to see the radiocarbon scientists maligned and slandered on this site routinely, to be accused by some here of colluding in some giant conspiracy, yet will not raise a finger to have the testing repeated with a wider range of sampling sites. You say there is “no guarantee of correct results”. So people’s reputations are less important to you than having a result that is 100% certain – is that what you are saying? Since when has 100% certainty been required in analytical determinations from restricted sampling sites? Why waste the time of scientists and statisticians who state upfront that they are content to operate at the conventional 95% level of confidence, i.e. that there is a 5% probability (p<0.05) that any differences observed could have arisen purely as a result of random sampling error? If you and co-religionists are going to employ the services of outside experts, then at least get acquainted with the limitations of data derived from limited sampling sites, don't set them impossible objectives, and most important of all, don't slander them when they produce the wrong result. Some might think that some of the  ire and contempt directed at the three labs is a pretty poor advertisement for the faith and convictions that underlie the belief in the Shroud's authenticity. But then most of the hate in the world today originates with religion, or what is claimed to be religion. I give it another name – bigotry.\nIt would seem to me that you have not only prejudged on the matter of authenticity, despite the available science that states otherwise. You are so convinced of your rightness that you have also prejudged the scientists too, declaring that they and their methodology have failed abysmally. You and others are, needless to say, encouraged to adopt that warped position by what the site's host has written under \"About\" regarding the radiocarbon dating and what he declares baldly to be wrong science. What he omits to tell us is something about his own scientific background that allows him to be so categorical and dismissive. In fact he tells us nothing whatsoever about his background there or elsewhere, except that he is an Episcopalian. So what are the special scientific insights that Episcopalians have that are denied to us ordinary mortals?\n\n","date":"October 10, 2013 at 3:50 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46760","author":"colinsberry","site":"shroudstory"},{"title":"You guys are brutal","post":"Colin, we are not about maligning anyone. To question the 1988 carbon dating is to be scientific. Did Lemaître and Hubble malign Einstein by questioning his conclusion that the universe was static? Were they wrong in doing so. The work on the shroud goes on and it should. And yes, some things done by the carbon dating labs or others involved in the testing look suspiciously like — dare we say it — pseudoscience. Well, if not that, poorly executed. To suggest, as you do, that the “sole raison d’etre of the site is to defame the people who produced the radiocarbon dating, and to do so with barely concealed innuendos and smears that stop just short of legally-actionable libel” is preposterous. \nAs for my scientific qualifications I took a chemistry class in high school and I can stir up a mean Andouille and chicken gumbo. \nAs for your question, “So what are the special scientific insights that Episcopalians have that are denied to us ordinary mortals?”, only this: For every two Episcopalians there are three opinions (fact) and thus given enough of us there is a good chance that within a multi-universe (and maybe some of them are static) one of us, somewhere, has evolved within our species, homo-episcopalianis, enough so to be right.\n\n","date":"October 10, 2013 at 5:03 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46769","author":"Dan","site":"shroudstory"},{"title":"You guys are brutal","post":"So pronouncements coming from the British Museum are “ex cathedra”? Have they forgotten about Piltdown Man, Lindow Man and not read scientific literature demonstrating with facts that carbon dating does not have the infallibility imparted to it? Why cut another piece of the Shroud? I have not maligned or slandered any one, only pointed out that there can be errors in science and, as for the “giant conspiracy”, there is indeed a lot more evil in the world than most people imagine. It can work silently, it can be subtle, it permeates every facet of existence. \nYou took the expression “raison d’etre” which I had employed while referring to the BSTS and pasted it to refer to shroudstory and there is no justification for this because they are two very different things. I am not saying that no one has the right to serve as a devil’s advocate in Shroud studies, what was meant is that if the reliable work done in this field is questioned, and only that, then what is the point in having such a society? What will be published in the newsletter? Shroudstory is a very different case, all sorts of views are presented, coming from Catholics, Protestants, Atheists, Agnostics, Freethinkers, those sitting over the wall. When something is said about “special scientific insights that Episcopalians have” it is a personal attack that blogmaster Dan does not deserve, more so because he has been fair in presenting comments from both the pro- and anti-authenticity camps, and makes it a point to be well informed, not indulging in nitpicking. The blog has improved considerably, eliminating personal attacks, four-letter words, offensive comments posted by anonymous commentators and so on.\n\n","date":"October 10, 2013 at 10:50 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46847","author":"Louis","site":"shroudstory"},{"title":"You guys are brutal","post":"The impact of both tiny invisible mendings AND a 1st c. CE Judean purifying and drying specific burial ritual should be investigated to make sure “a little something” along the CD line has not been TOTALLY overlooked.\n\n","date":"October 10, 2013 at 6:15 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46786","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"Correction: 1863 CE tiny invisible mendings\n\n","date":"October 10, 2013 at 6:19 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46789","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"This is the one of the two cores of my 2007-2008 unpublished paper on the CD fiasco.\n\n","date":"October 10, 2013 at 6:16 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46787","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"Rzeminder for Dr I. Colinsberry: thruth is adequatio rei et intellectus\n\n","date":"October 10, 2013 at 6:24 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46790","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"See Ninth Century neoplatonist Isaac Israeli’s Veritas est adaequatio rei et intellectus, “Truth is the adequation] of things and intellect”.\n\n","date":"October 10, 2013 at 6:30 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46792","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You guys are brutal","post":"“So pronouncements coming from the British Museum are “ex cathedra”?  etc etc”\nJust because I’m a Brit does not mean I hold a brief for the BM or its directors past or present. I was there not so long back – admiring the Pompeii exhibition-  and marvelling at the advanced lifestyle, at least of its richer citizens. But I’ve never regarded its morals as impeccable – not while it hangs on to the Elgin Marbles which should be back in Athens.\nIf the Shroud custodians select the BM’s director as an honest broker, well-judged or otherwise –  then that is their decision. If he’s later suspected of bias, then don’t blame me. I cannot even recall mentioning Tite. \nThere is no need to regard the 88/89 testing as the last word on the matter. Repeat the radiocarbon dating with a proper sampling frame, and get the director of the Louvre or the Smithsonian or that splendid Berlin museum on the banks of the Spree whose name I have forgotten to oversee matters. I would also recommend my own town museum, but they are busy with an exhibition of local memorabilia right now.\n\n","date":"October 10, 2013 at 11:12 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46853","author":"colinsberry","site":"shroudstory"},{"title":"You guys are brutal","post":"There was no attack on Dr. Michael Tite, it was about the role of the BM as coordinator. About what could be back at the place of discovery, it is obvious that the Assyrian material should remain where it is, at least for the time being. I do not want to be a broken record when it comes to fresh carbon dating, harping on the issue of why it is still a controversial method, more so when it comes to an object like the Shroud.\n\n","date":"October 10, 2013 at 12:52 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46869","author":"Louis","site":"shroudstory"},{"title":"You guys are brutal","post":"“…harping on the issue of why it is still a controversial method”\nThe cutting edge of science is always controversial. It wouldn’t be science otherwise.\n\n","date":"October 10, 2013 at 1:30 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","id":"comment-46872","author":"colinsberry","site":"shroudstory"}]
