[{"title":"New thread on type AB blood: Does all old blood become AB?","post":"Thanks Dan, \nIf anyone is interested just follow the first link above “responded to a reader…”, scroll down to the posting by bippy123 on February 7, 2012 and read on…From further reading I found out that apparently back in 2005 there were some DNA and other studies done on a number of mummies by a Robert Connelly and he identified the blood group from the mummy of Akhenaton as A2, using two different methods; ABO blood typing system and the MNS system. Apparently Tutankhamun’s blood type is also A2 and this evidently was known before the above tests. This blood is 3400 years old! and that means theres good reason to believe that both the Shroud and Sudarium’s blood was originally AB!\nThoughts? ….\nR\n\n","date":"February 14, 2012 at 8:38 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8229","author":"Ron","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"Fascinating discussion. I would like to see if there’s anything that discusses what methods were used on the acnient blood in both cases to avoid getting false postives for different blood types. If all the known precautions were taken it would seem that any conclusions made would be strong. However, there doesn’t seem to be anything along that lines published for laymen, yet.\n\n","date":"February 14, 2012 at 11:13 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8233","author":"Chris","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"I know Baima Bollone don’t share the same view as Adler on this topic and he pretend that the AB blood type of the Shroud and of the Sudarium are the real blood type of the body (or bodies) that was covered by those 2 cloths…\nWho’s right ?  Who’s wrong ?  Adler was a great blood chemist.  Baima Bollone is a forensic expert.\nPersonally, I have a tendency to favored Adler on the base of his great expertness in blood chemistry (old blood in particular), but I would like to read more scientific facts and studies about this intriguing aspect of the Shroud…\n\n","date":"February 14, 2012 at 11:32 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8234","author":"Yannick Clément","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"I’m guessing, from the lack of respondents here, that this topic is not as important as I thought lol…The fact that 3500 year old blood has not reverted to AB as we’ve been told all blood does, does not seem to highten anyone’s curiosity, is simply a mystery to me!… I’ve heard the statement (that all blood reverts to AB) for years now but have never seen any scientific documents-(FACTS) to this, and I’ve searched, believe me. In my mind this statement is possibly just ‘conjecture’ and has never been scientifically proven. Where is the proof for this statement? \nOn the otherhand we have from (RECENTLY TESTED and using 2 methods of testing), 3500 year old blood still showing it’s original A2 blood grouping? The ramifications of this to the authenticity of the Shroud and it’s counter part the Sudarium of Oviedo is huge. Atleast to me it seems so…It means; Blood does not revert to AB after so many centuries or that AB is a more recent blood group i.e. only 1300 or so years, it further strengthens the hypothesis that the Shroud and Sudarium are intimately connected and in all probability contacted the same body! ….Q; Am I just getting carried away here over nothing?\nR\n\n","date":"February 14, 2012 at 6:31 pm","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8249","author":"Ron","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"If there were in fact no degradation and the AB for Turin and Oviedo are true readings, then this is reasonably significant.  Wikipedia has an extensive table on the distribution of Blood Groups, world-wide and for particular indigenous populations.  The most common is O at 44%.  O is extremely prevalent in New World populations, and even reaches 100% in some cases.  A and B are 34.8% and 16.6% respectively.  From western Europe through to eastern Asia there is a gradation in the percentages from A to B.  Norwegians and Swiss being 50% A,, 7 – 8% B.  On the the other hand, Koreans for example are 32% A, 31% B.\nGroup AB averages out as only 5.1%.  English & Belgians are only 3% AB;  It seems to be highest in Asia, with Peking Chinese reaching 13% AB and the Ainu of Japan the highest at 18% AB.  Hungarian Gypsies are 10% AB, Tartars 13% AB.\nFrom about Bulgaria in the West, through to Arabs, German & Polish Jews, Armenians, and Egyptians, the percentage for AB is about 6% to 8%, somewhat about or above the world-wide mean of 5.1%.\nThe relative rarity of AB therefore lends some little additional weight, to both the Oviedo and Turin artifacts, having a common origin.  BUT only if universal degradation to type AB can be discounted.\n\n","date":"February 15, 2012 at 12:40 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8257","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"Ron, in this early study (*) by researchers from the University of Pisa, they were able to determine that the blood group of 28 out of 33 Inca or pre-Inca Peruvian mummies, mostly coming from Ancon and Cuzco, were found to be group 0, while 5 samples were not diagnosed.\nThis means that at least group 0 can be detected in at least 500-600 years old mummies. The authors mention that that they use the same technique as used to analyze Egyptian mummies. \n_________________\n(*)Journal of Human Evolution\nVolume 8, Issue 6, September 1979, Pages 589–595\nBlood-group determination in ancient Peruvian material ☆\nS.M. Borgognini Tarli, G. Paoli, R. Parenti†\n\n","date":"February 15, 2012 at 4:08 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8263","author":"Gabriel","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"If type O blood doesn`t degradate to AB with time, it could be an initial argument in favor of original AB type persisting in both cloths (Turin and Oviedo). It would be interesting to know if other types like A or B become or not AB with time. I have largely commented this before but in my opinion,a complementary analysis of the composition of trace elements present in both linens could definitively determine if they have the same origin.\n\n","date":"February 15, 2012 at 4:30 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8265","author":"Gabriel","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"All blood to revert to Type AB?  Well, I’m just a plain old biochemist by training, not an immunologist, but am capable of consulting wiki the same as everyone else:\nchemical differences between ABO blood types\nFor reversion to AB to occur, some quite remarkable biochemistry would have to take place. Blood group O would have to acquire a -NAG terminal on its carbohydrate chains, i.e. N-acetylglucosamine, which it does not have in its existing chains, at least those on the red cell membrane.\nFor blood group A, to become AB, it would have to acquire copies of its A, but with a crucial modification: a terminal -NAG would have to become a galactosamine residue.\nThe mirror image would have to happen for B to become AB, i.e. with galactose turning into NAG.\nMaybe there’s a post-mortem enzyme that works away in dried blood stains doing all this to intrigue future forensic archaeologists But what to call the two amazing enzymes? How about ABO glycosylation conjureuperase and swaparounderase?\n\n","date":"February 15, 2012 at 5:45 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8266","author":"colinsberry","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"So what are you saying (In Layman’s terms), that degradation of Blood types is not just simply the loss of antigens? Which is basically all I’ve understood was the case. Or basically that it may be simply hogwash? …My knowledge in this area is extremely lacking, so please elaborate.\nR\n\n","date":"February 15, 2012 at 9:03 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8284","author":"Ron","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"Click on that link to the graphic, Ron. Don’t be scared. Treat it like a Krypton Factor puzzle – all the information you need is there. No specialised knowledge of immunology or biochemistry is required – just the ability to compare sugar sequences in the carbohydrate side chains associated with membrane-associated glycoproteins (which are the cell surface-associated antigens responsible for ABO blood group incompatibilities)..\nThere can be no such thing as “degradation” to Type AB – it would require addition of sugars or sugar derivatives that are not already there (O to AB) , or substitution of one type of sugar for another A to AB; B to AB). In short it would require highly precise chemical synthesis and/or modification. It’s the sort of thing that might be possible in principle in the Golgi vesicles of a healthy functioning liver (though not in any metabolic pathway that I know of) but definitely not in a post-mortem sample of dried blood.\n\n","date":"February 15, 2012 at 9:27 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8286","author":"colinsberry","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"Correction: for galactosamine read galactose.\n\n","date":"February 15, 2012 at 5:47 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8267","author":"colinsberry","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"“There can be no such thing as degradation to type AB”…Interesting statement! So if what you say is true, what exactly has everyone been talking about for decades now?….This would mean Adler amongst many other’s got it wrong?… just speculation, conjecture? To me anyways, this is an important issue, I would have expected others with much more knowledge then I, would have recognised this before and brought it forth.\nI’d really like to hear another view to this most interesting statement you make.\nOh and Colin I did click the link, I fear very little, but being a complete laymen, I had very little idea what it meant, as to your very cryptic post ;-) …Anyways thanks.\nR\n\n","date":"February 15, 2012 at 6:14 pm","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8324","author":"Ron","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"Oops. Yet another correction: for N-acetylglucoamine, read N-acetylgalactosamine.  How I wish WordPress allowed a preview or ability to edit!  I’m hopeless at spotting the typos in spider’s thread type face.\n\n","date":"February 15, 2012 at 6:10 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8270","author":"colinsberry","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"As a sometime amateur editor, I’ve discovered that proof-reading is an acquired skill, which requires remarkable focus, even so typos still creep through, particularly if you’re prone to complex-new-word-synthesism!  Read it through three times before hitting the Post-Comment button!\n\n","date":"February 15, 2012 at 7:28 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8280","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"If Colin is correct in his assertion of no degradation to AB (and I see no reason to doubt this), then that has remarkable implications for the Turin & Oviedo artifacts.  Both are alleged to show AB blood residues, whereas world-wide AB is only 5.1%, Middle East – 6 – 8%, whereas France where Shroud first emerged in the West is only 3%.\nThe random probability that BOTH should show AB has to be very low, say 0.25%, or conditional probability that one will show the same as the other, only ~5%, but my stat math is now starting to get a bit rusty.\n\n","date":"February 15, 2012 at 6:22 pm","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8325","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"Right on Daveb! Thats the point here; if AB is the original blood type and add that to the numerous other evidence MATCHING the Shroud and Sudarium, taking in of course the “probability factors”, means we have very strong evidence now that the two items were “intimately-related” and did at very close periods in time, contacted the same body! Hense totally refutting ANY proposed carbon dating dates, as the Sudarium can be literally traced back to the early 6th century…Furthermore, now that the Sudarium can be said in all probability to be the actual cloth that covered Christ’s face; gives us pretty precise timing of occurences following Christ’s death on the cross to his actual burial in the tomb.\nR\n\n","date":"February 18, 2012 at 5:50 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8424","author":"Ron","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"Sorry error above; should read; traced back to the early 7th century.\n\n","date":"February 18, 2012 at 5:53 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-8426","author":"Ron","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"The Sudarium was recognized and authenticated by the Spanish Government, The King of Spain on March 14, 1075 to be THE PROPERTY OF JESUS OF NAZARETH. The official historical document would be acceptable evidence in any court of law.  It is hardcore evidence the head cloth belongs to Jesus. The Sudarium is not unlike having the dental records of a known person to compare with the remains of a murder victim to make positive ID.\nIn this case it is Jesus Of Nazareth we need to identify.   \nThe Sudarium of Oviedo is “the napkin that was about his head not lying with the linen clothes, but wrapped together in a place by itself”\n(Now it is wrapped together in a place by itself in Ovideo, Spain) \nI placed the Sudarium (The Napkin) Over the 3-D Image of The Man In The Shroud in a process similar to the polarized image overlay technique used by The Spanish Center of Sindonolgy\n(This is also used by forensic detectives in unsolved murder cases to positively identify a victim)\nFACT: We know the man whose head was wrapped in the Sudarium Of Oviedo was leaned 20 degrees to the right,.\nKnowing this I chose a 3-D Image of Jesus that was also leaning 20 degrees to the right. \nSo all we need to do is to lay the Sudarium over the head of the Man In the Shroud and see if it matches up.   \nIT DOES!  (Not unlike a fingerprint)\nTRIANGLE SHAPED WOUND ON RIGHT CHEEK…MATCH\nSWELLING AND BRUISING OF LEFT CHEEK…MATCH\n120 POINTS THAT MATCH FROM FRONT TO BACK\nIDENTICAL FORM OF CHIN (not by coincidence)\nNOSE IS 8CM ON BOTH\nBOTH CONTAIN POLLENS FROM PASSOVER\nBOTH CONTAIN AB POSITIVE BLOOD WITH BILIRUBIN\nBOTH CONTAIN POST MORTEM BLOOD\nBOTH CONTAIN BLOOD WHILE PERSON WAS LIVING\nBOTH CONTAIN PULMONARY EDEMA FLUID\n(When the Shroud image is placed over Sudarium you can see where edema fluid is coming from nose and mouth of the Jesus)\nTRACE AMOUNTS OF MYRRH ON BOTH\nFABRIC IS SAME THICKNESS ON BOTH\nFABRIC HAS SAME THREADS PER SURFACE UNIT\n(The Table Napkin and Table Cloth Go Together)\nNO EVIDENCE OF DECOMPOSITION (The blood is fresh)\nBLOOD IS NOT COAGULATED ON BOTH\n(Indicating violent death)\nThe new seed of doubt being planted by the skeptics is \n“All blood degrades to type AB” \nIf the above argument was presented to a jury it would immediately be over ruled as speculation, a theory not based in fact, bearing no weight on the case.  \nIt can be said “there is still doubt”\nBut is it reasonable doubt?\nThere are cases where unnamed victims have been given a Positive ID, on less than half the evidence presented in this post. \nWe have not even mentioned the blood evidence and heart tissue that appeared during a mass in Italy in the 7th century that also matches The Shroud of Turin and the Head Cloth. \nWe can go on all day long with this and at the end the investigation the forensic detective who has done his/her homework will find himself/herself backed into a corner with only 1 possibility remaining.  \n“The Shroud of Turin is the burial cloth of Jesus” \nBy process of elimination it cannot be anything else.\n\n","date":"March 17, 2013 at 1:24 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-27513","author":"Robert Page","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"To Ron:I would like to also mention that in the history of the Earth, there has never been a relic/item of historical significance that was officially authenticated from reliable sources as belonging to a certain figure in history that somehow over the course of time became unauthentic without just cause or reason.  \nIn this case we are talking about the Spanish Government, The King of Spain in the 10th century authenticated the Sudarium of Ovideo, as the property of Jesus.\n It is on the record, historical documents that we can hold in our hand and read and know to be genuine. Acceptable evidence in any court of law without question.  \nYou cannot come back over 1000 years later and say “No, the documents are not authentic, the head cloth does not belong to Jesus” with absolutely ZERO evidence to support the relic/item is not authentic or belonging to the person the historical record positively connects the item/relic too with unmistakeable clarity.\n “I hate Jesus”  is not going to work in a court of a law as a reason to un-authenticate a historical document, signed by a King who successfully ruled for nearly 40 years and was Emperor of Spain, well respected by the people and known for his great wisdom, of sound mind and body.  He was known as “EL Bravo”  A man of courage and honesty,\ncharacter traits that are lacking in the people of this day and age.    \nIf you had a video taped close up of the head of a skeptic examining that document you would see a vein getting ready to burst,\nIt is hard to deny a genuine demonstrated reality in front of your face, yet somehow the people of this day and age are able to do just that.\n It all goes back to the original sin of pride. The failure to acknowledge the good works of others, A evil desire to be more important and more attractive than others. Money hoarded for security and not circulated for improvement.\nEvil desire gives birth to sin and sin gives birth to death.\nThe Man In The Shroud conquered that.\nLove is eternal, more powerful than death.\nMay that eternal gift of love be yours.\n\n","date":"March 17, 2013 at 2:57 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-27514","author":"Robert Page","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"I’m sorry, Robert, but I have difficulty with your “official historical document,” which although would have had authority in any court of law at the time, would quite rightly, like any other centuries old pronouncement, be laughed at today. The very words of the translation you use – THE PROPERTY OF JESUS OF NAZARETH – are absurd; perhaps the original Spanish was less so. An opinion does not become a fact because a King says so, however well respected.\nFurthermore, many of the points of congruence often cited are an unjustified extrapolation of the fact that if two cloths are covered in blood, there are likely to be several places where blood stains coincide. An appropriate control experiment might be to take a couple of randomly stained cloths and, in a similar, super-imposition exercise, see how many points of coincidence there are.\nVarious other comments leave me slightly mystified: Are you suggesting that the Shroud and the Oviedo cloth were originally table-cloth and napkin? Or that the bloodstains on the Oviedo cloth look as fresh as those on the Shroud? I do not know that there is evidence for either of these.\nI agree that there is much in common between the Shroud and the Oviedo Cloth, and that there is evidence (albeit none of it unchallenged) to suggest their connection. However many of the comments on this site refer to “courts of law,” and “reasonable doubt,” and both pro- and anti- authenticists need to be aware of contradictory arguments before committing themselves too certainly one way or another.\n\n","date":"March 17, 2013 at 5:50 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-27525","author":"Hugh Farey","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"If you lack historical records you can be in a dead end :\nIs it Caesar or does it look like Caesar ?\nA definite answer is unlikely…\nOk, the level of proof is way higher concerning the shroud, but you can reach the truth/authentification only asymptotically.\n\n","date":"March 17, 2013 at 4:11 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-27518","author":"anoxie","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"Similar location of bloodstains\nType AB blood (by forward typing) on both*\nSuggestive evidence, yes, but a more definitive approach would be to extend this to DNA analysis: nuclear or mitochondrial (best).  This is a true comparative test.  \nDNA degradation may preclude such tests, but it may not.  It isn’t necessary that all 20,000-25,000 genes of the entire genome be intact, just segments of of particular genes of interest.  The high copy number of mitochondrial DNA (1,000-10,000 copies/cell) is particularly advantageous in situations where the DNA is in a degraded state.  In addition, the restriction of mitochondrial DNA to maternal inheritance makes it extremely unlikely that two unrelated individuals would show identical mitochondrial DNA.\nNuclear DNA, although present in much lower copy number, offers the advantage that it can distinguish if such DNA truly originates from the bloodstains or is from contaminating (touch) DNA.  See previous posting on the blog:  “Whose DNA is it, anyway? Immunoglobulin, the T cell receptor, and the Shroud of Turin”    \n*Not AB positive, but positive for AB, or better yet, just AB\n\n","date":"March 17, 2013 at 10:18 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-27536","author":"Kelly Kearse","site":"shroudstory"},{"title":"New thread on type AB blood: Does all old blood become AB?","post":"This would be a very interesting test indeed.\n\n","date":"March 17, 2013 at 3:43 pm","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","id":"comment-27560","author":"anoxie","site":"shroudstory"}]
