[{"id":"comment-12895","author":"davor_aslanovski","post":"You might be interested in the following two posts on my blog: http://deumvidere.blogspot.co.uk/2012/06/image of edessa and turin shroud part.html http://deumvidere.blogspot.co.uk/2012/06/image of edessa and turin shroud part 22.html.","date":"2012-06-22","mins":"8:10 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12901","author":"davor_aslanovski","post":"@ menedemus: I cannot discuss Nicolotti’s (I suppose you meant Nicolotti rather than Lombatti) work before I have read it. If I have indeed only retold in English what he had already published in Italian, I will delete my posts. For the time being, though, I think I can safely assume that our arguments are not exactly identical. @ Max Patrick Hamon: I, naturally, don’t think that there is anything erroneous in that article. I will explain why you are wrong on the Robert de Clari’s testimony, but before I do so, I must ask: is it really only ‘one example among many’ and, if so, what else do you object to?.","date":"2012-06-22","mins":"10:12 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12917","author":"davor_aslanovski","post":"Is there anything in relation to my posts, rather than to the perils of Coca Cola consummation, that you would like to discuss?.","date":"2012-06-22","mins":"2:41 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12925","author":"davor_aslanovski","post":"Would you kindly put all these and any other comments/questions you may have together and post them on my blog? Let’s not lead this conversation in two places. Also, can you please explain the distinction you are making between the ‘Image of Edessa’ and ‘The Holy Face of the Holy Mandylion’?.","date":"2012-06-22","mins":"5:08 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-13497","author":"davor_aslanovski","post":"Exactly how many times would it take for me to repeat that I do not believe the image in the Shroud to be a painting before you can finally hear me? Tell me the figure, and I’ll quote myself the necessary number of times… In any case, let’s get it over with..","date":"2012-07-05","mins":"10:35 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","title":"Davor Aslanovski is right for once"},{"id":"comment-13495","author":"davor_aslanovski","post":"No, absolutely not. And I never said anything to the effect. Whatever gave you such an idea?.","date":"2012-07-05","mins":"9:04 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","title":"Davor Aslanovski is right for once"},{"id":"comment-13544","author":"davor_aslanovski","post":"Daveb, if you don’t mind me asking, do you consider yourself to be a Christian?.","date":"2012-07-06","mins":"2:35 pm","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","title":"Davor Aslanovski is right for once"},{"id":"comment-13499","author":"davor_aslanovski","post":"Btw, I’m glad to see that Mr Porter CAN take a joke..","date":"2012-07-05","mins":"10:41 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","title":"Davor Aslanovski is right for once"},{"id":"comment-15948","author":"davor_aslanovski","post":"Let’s start at the beginning: where is this quote from? Because it isn’t from page 9 of that book..","date":"2012-09-06","mins":"4:35 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15972","author":"davor_aslanovski","post":"1.) I have noted myself that Belting has made some very interesting changes to the various editions of his book – especially between the German original and the French and English translations. I have pointed out one such peculiarity that ‘sindonologists’ might find particularly interesting here: http://deumvidere.blogspot.com/2011/05/i.html It was a paper that I actually e mailed and asked Dan Porter to promote in these circles, as I thought it had to a lot to offer on the matters discussed here. But, of course, since it says absolutely nothing about imaginary Vignon markings, doesn’t pick out one among tens of thousands of Byzantine neologisms (‘tetradiplon’) and then pretend it is the only one, and doesn’t even mention the Cherubim gates in Antioch – no one here read it. I do admit that it doesn’t read like a fairytale, doesn’t have any mythological creatures or cryptological puzzles in it, doesn’t even come with pretty pictures. But I once again suggest that you have a look at it. If for no other reason, then at least to give you an idea of what is really wrong with certain academic approaches to Christian art. And how a Christian art historian (with proper training and proper understanding of what the academic world really is) would begin to solve these issues. If he only wasn’t always so stranded for time. 2.) It proves nothing that there is no mention of the burial cloth’s arrival to Constantinople. The first mention of a relic at the capital usually coincided with either the foundation or a restoration of a shrine in which it was/would be housed. We rarely find that the one is recorded without some mention of the other. Of course, you would only know and understand this if you had any training in Byzantine history. 3.) The reason why Wilson only needed 3 months to do all the research for his books, while it takes us silly academic people so much more is that we worry too much when an ancient author makes claims that are not substantiated elsewhere. And we go and check. And we check ALL the relevant sources. And we compare. For instance, we don’t just read one ancient author and go: ‘AHA! So the heads of Cyril and John were buried in the Hagia Sophia – Anthony of Novgorod says so!’ No, we are read on and often find that the author himself contradicts this when he says: ‘there is no tomb in Hagia Sophia except for that of St Anthenogenes.’ So, in a word, reconstructing Byzantine history takes a little more time and a little more work than you people think it does. Just imagine if, for instance, medical diagnoses were established and medicines administered the way that things are done here. You have some pain in your belly, you say? That must be appendicitis. We must operate immediately. Wait here while I call our surgeon. What is that? You have had tea while you were waiting and the pain is now gone? Oh great, so now we know a simple cure for appendicitis and surgeries will no longer be necessary. Thank God that a little more thought and effort goes into that and thank God the first book that came into Mr Belz’s hands wasn’t something that said Jesus never existed. We would now have to be listening to his ‘editorializing’ about how the shroud cannot be authentic because there never was a crucifixion victim crowned with thorns. 4.) When one has so very little understanding of the Byzantine world that he doesn’t even know that the Turks were not Arabs (see above), is he really equipped to wrestle with questions of the true motivation of the Byzantine military and diplomatic campaigns? It may seem like a small mistake to someone who doesn’t know much about this world, but to anyone who has ever read even the shortest introduction to Byzantine history – this is the same the same as if they were being asked to discuss whether George W. Bush was right to attack Egypt after 9/11. 5.) About the Vignon markings. As Mr Belz has noted above, I have recently posted a likeness of Jesus Christ made with the help of these markings on my blog. The idea was to show that that is not how you achieve likeness in visual art. What you do (and I cannot believe that I have to say this!) is you measure the features and proportions of the face – e.g. Length of nose, distance between the eyes, width of mouth, and how they relate to each other. Anyone who has any artistic ability and a sound mind knows this. If all the ancient icons of Christ showed the same facial proportions – you would have a case. But with Vignon markings you have nothing but a drawing made by someone who is either psychologically or neurologically unwell..","date":"2012-09-07","mins":"3:38 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15992","author":"davor_aslanovski","post":"Dan did post that paper here. I have nothing to reply to the rest of your comment. You are an adolescent in your sixties and I will from now on ignore you completely..","date":"2012-09-07","mins":"11:48 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15840","author":"davor_aslanovski","post":"Dear Mr Belz, What in the world gave you the idea that I was a single discipline specialist? And what would that have to do with the question whether the image reverently transferred to Constantinople in 944 can be identified with the Turin Shroud?.","date":"2012-09-04","mins":"10:39 am","url":"https://shroudstory.com/2012/09/04/so-what-is-the-problem-ian-wilson-freeman-jones-or-this-cult-of-ours/","cat":"art","title":"So what is the problem: Ian Wilson, Freeman, Jones or this “cult” of ours?"},{"id":"comment-15864","author":"davor_aslanovski","post":"1) I will form my views on ‘scientific matters concerning the Shroud’ if the object is examined by scientists, lege artis, and if the results are published in peer reviewed journals. In the meantime, I believe the only thing we CAN discuss is the object’s history. Which, based on what we know at the moment, doesn’t seem to stretch any further than the late 1300’s. And I wasn’t pathetically psychoanalysing anyone. Recognizing that people are psychologically unwell, feeling sorry for them, and asking yourself ‘Aren’t relics supposed to bring healing?’ is no psychoanalysis. 2) Wilson’s theory is a scientific heresy in relation to the kind of history we do in the academic world today. Once again, I have restricted myself to the subject of history because it is the only subject where we possess enough information to form any opinion. And I think I have both addressed this question myself and pointed to others who have dealt with different aspects of it. So, QUOD erat demonstrandum? You are not making any sense..","date":"2012-09-05","mins":"2:49 am","url":"https://shroudstory.com/2012/09/04/so-what-is-the-problem-ian-wilson-freeman-jones-or-this-cult-of-ours/","cat":"art","title":"So what is the problem: Ian Wilson, Freeman, Jones or this “cult” of ours?"},{"id":"comment-15881","author":"davor_aslanovski","post":"Discussing here how scientific research should be conducted and where and how the results of it should be presented would be a waste of time. The idea that academic historians today could be ‘conspiring’ against the Shroud shows how little Markwardt understands what the academic world is and what historians do – despite the fact that he calls himself a historian. And the case that he mentions dates from a hundred years ago and has to do with nothing but the d’Arcis memorandum. And Wilson’s theory has not been rejected on the basis of the d’Arcis memorandum. (In case it still isn’t clear, it was rejected because there is no evidence for it. It is a piece of historical fiction. And if it’s historical fiction you want, give me five pounds and I’ll tell you a dozen more amusing stories to ‘explain’ the ‘provenance’ of the Shroud. And for a tenner, I’ll let you see where the aliens probed my spine.) And as for Dreisbach, these few lines will exemplify why I don’t hold his writings in very high regard: ‘On that first Easter morning the Magdalene “saw two angels in the place where Jesus had lain…one at the head and one at the feet.” (John 20:2l). Could this be the very first description of the ventral and dorsal images of the Man of the Shroud?’.","date":"2012-09-05","mins":"7:50 am","url":"https://shroudstory.com/2012/09/04/so-what-is-the-problem-ian-wilson-freeman-jones-or-this-cult-of-ours/","cat":"art","title":"So what is the problem: Ian Wilson, Freeman, Jones or this “cult” of ours?"},{"id":"comment-15882","author":"davor_aslanovski","post":"‘In the beginning God created the heavens and the earth.’ – could this be a prefiguration of the ventral and dorsal images that His Son would one day leave on the burial Shroud? The heavens foreshadowing the wound in Jesus’ side, because water comes down from heaven just like it came out of this wound? And the earth symbolising His back, because His back would one day be laid on the ground, when He is taken down from the cross?.","date":"2012-09-05","mins":"7:59 am","url":"https://shroudstory.com/2012/09/04/so-what-is-the-problem-ian-wilson-freeman-jones-or-this-cult-of-ours/","cat":"art","title":"So what is the problem: Ian Wilson, Freeman, Jones or this “cult” of ours?"}]
