[{"id":"comment-13641","author":"davor_aslanovski","post":"David Belz: ‘My main reference source for this article is “The Turin Shroud” by Ian Wilson, Victor Gollancz, 1978’ Dan Porter: ‘It is excellent.’.","date":"2012-07-09","mins":"6:40 am","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"New Article on the Shroud of Turin"},{"id":"comment-13741","author":"davor_aslanovski","post":"DB, I am sorry, but your name is too difficult for me to spell… so I’ll just use initials. But I’m glad I finally know your full name. Since you were the first to start personally insulting me when I disagreed with your view of history, you will always hold a special place in my heart. Others came after you, with more imaginative insults, but you were my first. So it’s good to know your name. Nice to meet you, DB. They call me DA. And we’re both Catholics. With some interest in the Turin Shroud. Interesting. I will remember you in my prayers and I suggest you remember me before you go to your next confession. Have I spoken ill of someone? Remember that one? Well, in this day and age, it should probably be rephrased into something like: ‘Have I ran off at the mouth in my internet debates?’ But, to business… I don’t understand why you’re working yourself up like this. My only intention was to point out that what Dan rated as ‘excellent’ was nothing but a quote from the ‘sindonological’ catechism. It looks like I touched a delicate point there. I guess we tend to be sensitive when someone lightly dismisses something we’ve put a lot of work in. I’m sorry, but, hey, now you know how it feels, so maybe there’s a chance to learn something. Plus, I didn’t know that it was you who wrote that article. And now I do. As for ‘history’ vs (white coat) ‘science’ in ‘sindonology’, let me use your qualification: I don’t think either would be fit to offer testimony in a New Zealand court of law. I have already confessed that, upon my first reading of Wilson, I thought he presented a pretty strong case. And I have felt very much the same upon reading many other ‘sindonological’ papers. Sure, I noticed that Markwardt doesn’t understand what Disciplina Arcani is, that Vignon has never taken a life drawing lesson, that Dreisbach can’t tell a theological from a historical interpretation, and a couple of million small problems like that… but, in the main, I thought the current ‘sindonological’ story was sound. Then, of course, I examined the historical evidence for myself. That was the part about which I could form my own opinion, because I had both the necessary training and direct access to the object of examination. And I found out that everything was wrong. Indeed, I would be very hard pressed to think of a single thing that the ‘sindonological’ account of history got right. (Perhaps that there was an image in Edessa that was reverently transferred to Constantinople. Or that a look into Byzantine texts and art would be a good place to start. But any further than that and we’re completely off the chart.) And if history has been so terribly misinterpreted, how am I to know that the same has not been done with every other type of ‘evidence?’ I don’t possess the specialist knowledge to go into questions like the bilirubin in the stains on the Shroud. (And, btw, neither did Herbert Thurston, so I don’t know why you’re dragging him out.) What do I know about bilirubin? I can only listen to what others tell me. And after I have seen what violence has been done to history, I cannot trust the (white coat) ‘science’ part of ‘sindonology’ either. In words of George W. Bush, ‘fool me once, shame on you… fool me twice… uhmm… you’re not gonna fool me twice.’ This, I believe, answers all your questions. But just to make sure. A) I do not believe that it is the authentic image of ‘rabbi Yeshua’. Neither do I like it when Christians call Him that (does any New Testament or patristic text call Him that?), nor do we have any RELIABLE evidence for that identification. It MIGHT BE an authentic image. Or it might not. In order to know the truth, the investigation should be conducted within the confines of the academic world, and not the way that it has been conducted by ‘sindonologists’. And the more it is conducted by ‘sindonologists’, the less likely it is to ever be conducted by serious scientists. B) Wilson is at least a good and original writer. Markwardt and Scavone have equally misinterpreted history, but are not even particularly good wordsmiths. So between them and Wilson, I choose Wilson. C) I have shown what I think of the Vignon markings here: http://deumvidere.blogspot.co.uk/2012/07/picture normally says thousand words.html D) As for your last paragraph, the Byzantine attitude towards the sacred is exactly what I am researching. Most particularly, I am looking at anthropomorphic conceptions and representations of the transcendental in Byzantium. So, yes, I’d say I’ve given this some thought. It’s when you go from ‘Byzantines concealed the liturgy of the Eucharist from the common gaze’ to ‘The texts on the Image of Edessa really talk about the Turin Shroud’ that you are pushing a square peg of nonsense into a round hole in my mind. Let me rephrase that last bit. It’s a non sequitur. Oh, and did you not end your article with: ‘In a subsequent article, I hope to outline the evidence for some of the theories concerning the early history of the Shroud prior to its first emergence in France in about 1350.’ Isn’t it pretty obvious what you’re next article will say? So why point out that this part doesn’t yet touch upon the Mandylion theory? Here’s a piece of advice, one Catholic to another: apologize to me and mention your rash words in a confession; give a good thought to the fact that experts have rejected Ian Wilson’s theory; and then be very careful what you tell your ‘diverse community of “ordinary” Catholics’ about historical ‘evidence’..","date":"2012-07-11","mins":"12:13 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"New Article on the Shroud of Turin"},{"id":"comment-13657","author":"davor_aslanovski","post":"Poor, because it would also have consulted only one source..","date":"2012-07-09","mins":"2:40 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"New Article on the Shroud of Turin"},{"id":"comment-13680","author":"davor_aslanovski","post":"And I note that daveb, blinded by his personal dislike for me, has once again totally missed my point. It’s not that the article doesn’t PRESENT a full bibliography – it’s that it USES only one reference source. And so it does not ‘inform a modern diverse community of “ordinary” Catholics of an important aspect of their heritage’, but of what Ian Wilson believes and teaches. Judging from what I see here, the author will have achieved his goal if at least one reader is willing to blindly accept Wilson’s teaching and to make it his or her way of imitatio Christi to personally insult anyone who dares to differ..","date":"2012-07-10","mins":"5:16 am","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"New Article on the Shroud of Turin"},{"id":"comment-11699","author":"davor_aslanovski","post":"Dear Yannick, I agree with you, and I am aware that English is not your first language, but please do get a thesaurus. You have used the words ‘speculations, extrapolations, and assumptions’ in that same order of appearance so many times it’s turning into a mantra. ;).","date":"2012-05-29","mins":"4:42 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","title":"Scientific Study of the Shroud of Turin hampered by STURP?"}]
