[{"title":"A Folding Method Charles Freeman Might Accept","post":"Tetradiplon is just not a relevant issue as it only ,in one comparatively late text, referred to the cloth before it had been handed to Jesus. I am quite happy with it being used to describe a double folding four times as shown on the Parthenon frieze cloth! Why search any further when we have visual evidence of a cloth folded doubled four times. I don’t need to play around with alternatives.\nIt is Wilson who needs to rewrite his text to make it quite clear that there is no reference to tetradiplon after Christ had wiped his face! I cannot work out whether he was just being careless or dot dot do dot. but if he does write another edition he needs to leave it out as it is simply not relevant to an already hopelessly weak argument.\n\n","date":"May 8, 2015 at 7:34 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198604","author":"Charles Freeman","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"BTW when Stephen Jones wrote: “A COMMENTER ON DAN POTER’S Shroud of Turin BLOG (upper cases) pointed out what I had previously realised, but had forgotten, that Dan’s “Tetradiplon” graphic illustrating how the Shroud of Turin, when “four-doubled” (Greek tetradiplon), with Jesus’ face uppermost, results in Jesus’ face only within a rectangle, in landscape aspect (exactly as in the oldest copies of the Image of Edessa), has a flaw in that it only shows three doublings of the Shroud (see above).”, actually, he was not so much referring to Charles as to… me (copyright, please ;-)! Please carefully, re-read the posts on the issue.\n\n","date":"May 8, 2015 at 8:18 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198608","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"The true fact is Charles just took up my idea and made it its own.\n\n","date":"May 8, 2015 at 8:20 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198609","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"Okay, Max.  Next time we are in the same city at the same time I’ll buy you a drink.\n\n","date":"May 8, 2015 at 9:01 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198613","author":"Dan","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"Max- Well any intelligent reader would have spotted that Wilson got the illustration wrong but few would have gone back to the original text to find that he had got the placing of tetradiplon in the original text wrong too. And I think I have  a first in showing that the sacred cloth of the Panathenaic festival was doubled over four times, the most obvious meaning of tetradiplon, so possibly implying that the cloth when given to Jesus as  tetradiplon it had a sacred status. There is nothing in the text to suggest that that the cloth was anything but an image of a face and, as I have also pointed out, the grave cloths are mentioned later in the same text so the tetradiplon cloth cannot have anything to do with the Shroud.\nIt is better for Wilson to cut out the whole issue to save himself further embarrassment.\n\n","date":"May 8, 2015 at 9:16 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198615","author":"Charles Freeman","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"Charles, methinks your are confusing the Constatinople Sindon with the Constantinople Mandylion ;-)\n\n","date":"May 8, 2015 at 9:25 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198619","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"BTW the Holy Face of the Holy Mandylion in Constantinople was kept in a large flat sliding box about 40 x 60cm (un grand coffret de 22 pouces sur 15 pouces soit 59,554cm x 40,605cm, d’argent doré sur âme de bois, peu épais, muni d’un couvercle à glissière qui coulissait pour laisser apparaître la relique)\n\n","date":"May 8, 2015 at 9:34 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198621","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"Charles, re your having ‘a first’ in showing that the sacred cloth of the Panathenaic festival was doubled over four times, I 100% agree.\n\n","date":"May 8, 2015 at 9:19 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198616","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"And what about my ‘first’ too re the Grek word tetradiplon to be reconsidered in terms of process and/or result ;-) for reconstruction’ sake?\n\n","date":"May 8, 2015 at 9:23 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198617","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"Please know that in the Ray Castle at Ray sur Saone France is the original wooden box that the Shroud  of Turin was brought from Constantinople in and one can find the size of the\nFolds by the size of the box….Also my Verloin de Gruy Ancestors Chateau Magny Fouchard\nWas located near the le Ray (Lirey) chapel south of Troyes where the Shroud was brought\nAfter our Vergy ancestor married the famed French knight de Charney…it is a fact that our\nDe Gruyere Ancestor,s (count Michael) mother was a Vergy as was the wife of the last\nHoly Roman Emperor , Otto Von Habsburg who died not long ago at age 100 with many\nSecrets of the Priory de Sion…I have written much about this history over the past decade,\nFirst for DeGruy Family history and now for my nightly blog based on my life & work….\nGOOGLE : eugenerayarchitect.blogspot.com.  (For my nightly blog)\nGOOGLE :  EUGENE RAY / SHROUD OF TURIN\nAlso\nGOOGLE :  EUGENE RAY /  KNIGHTS TEMPLARS  (the de Gruy were Templars )\nGOOGLE  :  EUGENE RAY /  RAY CASTLE\nAlso\nGOOGLE. :  EUGENE RAY /  ORIENT FOREST  (site of  DeGruy chateau , le Ray Chapel)\n\n","date":"May 8, 2015 at 2:57 pm","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198650","author":"Eugene Ray, architect, professor emeritus, sdsu","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"Note it is profound that the original 9 knights Templars came from the Orient Forest  (orient refers to Jerusalem) and that Saint Bernard’s monastery is located close to the de Gruy chateau Magny Fouchard and that Charles de Gaulle settled nearby and that Joan d’Arc crossed the Aube river near the Gruy Chateau…all of the above persona adopted the\nTemplar Cross…The CROSS OF LORRAINE !!! Used also by Otto Von Habsburg and\nI believe links w/ Merovingian Blood  History !\n\n","date":"May 8, 2015 at 3:09 pm","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198654","author":"Eugene Ray, architect, professor emeritus, sdsu","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"Stephen Jones did a good job, in fact I always thought that any folding had to mimimise straining at the fold edges.\n\n","date":"May 8, 2015 at 7:42 pm","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198666","author":"Louis","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"Diplon is usually translated as ‘folded in half’, but if it simply means ‘folded’, then there are several ways of folding the shroud four times to achieve the one-eighth size attributed to the mandylion/image of Edessa. Stephen Jones’s zig-zags put one in mind of Aldo Guerreschi’s watermark investigations, which might be relevant.\n\n","date":"May 9, 2015 at 1:47 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198676","author":"Hugh Farey","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"But the basic point is ,Hugh, is that is not a shred of evidence that the cloth was folded in any way at all AFTER  the image of the face had been placed on it. This is where Wilson misleads by giving the impression in his The Shroud  that tetradiplon refers to the face cloth after Jesus had wiped his face on it. This is why he should take out this section altogether.\nIf we are talking about possible foldings these should only refer to how the face cloth was folded before it was given to Jesus. And it is a face cloth as the grave cloths are mentioned separately in the same tExt.\nNow, overwhelmed ( actually underwhelmed) by Colin’s bright blue chemical mixtures, I must drop out to focus on the group of 22 that I am leading around the Greek Peloponnese for the next ten days. They are all convinced that the Greek economy will collapse leaving them stranded on a mountain hillside somewhere – getting them all to the airport will be challenge enough!\n\n","date":"May 9, 2015 at 2:01 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198677","author":"Charles Freeman","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"“Now, overwhelmed ( actually underwhelmed) by Colin’s bright blue chemical mixtures”\nBest you stick (endlessly) to banging on about  your bete noir Ian Wilson and his interpretation of face-cloth folding terminology, instead of revealing, yet again, your ignorance of imprinting technology and image-processing, Charles\nThe blue colour of my recent image-processing had nothing WHATSOEVER to do with the chemicals, needless say, that I used to develop the imprint on the linen as a YELLOW-BROWN negative image. The blue colour arises from the use of ImageJ to do a Secondo Pia style TONE_REVERSAL, which converts sepia to blue (everything is reversed – colour balance as well as image intensity).\nHad I so much as suspected that someone would mistake the blue of an ImageJ inversion and/or 3D rendering as a “chemical”, I would have converted my imprints to B/W monochrome first.\nOh the perils and pitfalls of being an internet-scientist…\n\n","date":"May 9, 2015 at 2:16 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198679","author":"Colin Berry","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"yawn …rant rant…yawn show off show off cruising around Greece…pompous and not as clever as he thinks\n\n","date":"May 9, 2015 at 2:32 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198680","author":"Thomas","site":"shroudstory"},{"title":"A Folding Method Charles Freeman Might Accept","post":"There are different ways to fold the shroud in order to show only the face of Christ. Some were known in the Ancient world, as the technic of “Leporello” (as an accordion).  Others are purely imaginative as the Stephen Jones proposal. The Leporello way doesn’t match the “tetradiplon theory” and Jones’ hypothesis has not any support in facts. \nThe scheme of wrinkles that is added in this thread is incorrect and cannot be related with the first Century. Flury-Lemberg affirms that the main wrinkles –that is to say, those that refer to a way of folding-, are relatively recent and they are organised around a longitudinal wrinkle that folded the Shroud leaving the image in the interior. Sindonists’ scheme (Jones and Jackson) omits these facts in order to select only the appearances that justify their theory. \nFlury-Lemberg’s Sindone 2002 L’intervento conservative is quoted here from Andrea Nicolotti:  “Una reliquia costantinopolitana dei panni sepolcrali di Gesù secondo la Cronaca del crociato Robert de Clari”, p. 174, note 82.\n\n","date":"May 10, 2015 at 5:36 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","id":"comment-198759","author":"David Mo","site":"shroudstory"}]
