[{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nStephenFreeman's comment that interest in the Shroud has only been intense in the last 50 years is patently untrue.The large number of copies of the Shroud from the 1500s is witness to the interest that has always existed in it.It is certainly true that interest in the Shroud is MORE intense and  widespread today, thanks to technology, as well as the benefit of photography.\n\n","author":"Matt","date":"July 5, 2012 at 3:52 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMatt >Freeman's comment that interest in the Shroud has only been intense in the last 50 years is patently untrue.Agreed. Freeman's evident prejudice adversely affects his reliability. Check out these responses to Freeman by historian James Hannam and Thomas de Wesselow. Each point out simple errors of fact by Freeman, due to not reading carefully the source he is critcising and so both reviews are (or should be) deeply embarrasing to Freeman. >The large number of copies of the Shroud from the 1500s is witness to the interest that has always existed in it.Yes. It is hard to understand how a professional historian make such a patently false statement as:\"... the Turin Shroud is very much a cult of the past fifty years, not a medieval one.\"unless it is because Freeman simply cannot accept the threat to his anti-Christian worldview that the Shroud represents. And also Freeman is trying to \"poison the well\" so his readers will, he hopes, not bother taking the Shroud seriously enough to check it out for themselves.>It is certainly true that interest in the Shroud is MORE intense and widespread today, thanks to technology, as well as the benefit of photography.Agreed. But since to Freeman, Christianity MUST be false, and supernatural miracles CANNOT occur, therefore increased intensity of interest in the Shroud MUST be \"a cult\"!Also, later in his paper Freeman tries to argue that there wasn't much interest in the Shroud in the Medieval era, so presumably he is trying set the stage for that argument.But I am going to answer: what other medieval relic caused a local Bishop (d'Arcis) to complain to the Pope about the effect it was having? And what other medieval relic did the Savoy royal family (who presumably knew a thing or three about the authenticity of medieval relics) exchange TWO CASTLES and land for? Not to mention the TENS OF MILLIONS of dollars (in today's money) the Savoys spent building chapels to house the Shroud. Freeman presumably knows all this, but he is counting on his readers not knowing much about the Shroud, and he hopes to keep it that way.For that reason alone I am pleased to see that a Google search on \"Charles Freeman Shroud\" (without the quote marks) shows in FIRST place:-----------------------------------The Shroud of Turin: My critique of Charles Freeman's \"The Turin ... This is part 1 of my critique of historian Charles Freeman's, \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" May 24, 2012.-----------------------------------Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"July 5, 2012 at 5:10 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nIt's odd. From the little I've read of him, Mr. (Dr.?) Freeman always rubbed off as a relatively honest historian, at least for somebody who writes on the topics he does with the views he does.But this piece seems largely polemical, especially when he starts with as blatant a falsehood as that interest in the Shroud has been confined to the last 50 years!\n\n","author":"Gio","date":"July 6, 2012 at 3:33 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nGio>It's odd. From the little I've read of him, Mr. (Dr.?) Freeman always rubbed off as a relatively honest historian, at least for somebody who writes on the topics he does with the views he does.Freeman may well be an honest historian generally. I wouldn't know because I haven't read his other work, except his review of de Wesselow's \"The Sign\".But I do claim that in this paper of his that I am critiquing, Freeman is dishonest in concealing from his readers evidence that undermines his thesis: that the Shroud of Turin is just another fake relic. >But this piece seems largely polemical, especially when he starts with as blatant a falsehood as that interest in the Shroud has been confined to the last 50 years!Freeman doesn't actually say that. What he wrote was:\"Relic cults come and go and the Turin Shroud is very much a cult of the past fifty years, not a medieval one.\"But this is remarkable imprecise for a historian to whom chronological accuracy should be very important. The \"past fifty years\" is since 1962. But what happened in 1962 that was significant regarding the Shroud? NOTHING as far as I am aware. As is borne out by Ian Wilson's \"Highlights of the Undisputed History: 1900's\" on Shroud.com:-----------------------------------December 17, 1961: Death of Dr. Pierre Barbet.June 16-18 1969: On the orders of Turin's Cardinal Michele Pellegrino, the Shroud is secretly taken out of its casket for its state of preservation to be studied by a team of experts. These examine, photograph and discuss for three days, but do no direct testing. During this same period, and with the Shroud hung vertically for the purpose, Giovanni Battista Judica-Cordiglia takes the first ever Shroud photo in color, also fresh black and white ones, and ones by Woods light.-----------------------------------If by \"a cult\" Freeman means the renewed modern scientific interest in the Shroud, then, apart from it being an inversion of the truth, it is historically false. As I pointed out in my post above, the modern scientific interest in the Shroud began in 1898, when Secondo Pia photographed the Shroud and discovered that it was a photographic negative!:-----------------------------------\"Highlights of the Undisputed History: 1800's\"May 28, 1898: Public exhibition. Secondo Pia, an Italian amateur photographer, makes the first photograph of the Shroud of Turin. It ushers in a new era in the Shroud's history, the era of science.-----------------------------------But Freeman is here not interested in historical truth. What he is attempting to do in this paper is to \"poison the well\" against the authenticity of the Shroud:\"Poisoning the well (or attempting to poison the well) is a rhetorical device where adverse information about a target is pre-emptively presented to an audience, with the intention of discrediting or ridiculing everything that the target person is about to say. Poisoning the well can be a special case of argumentum ad hominem ... The origin of the term lies in well poisoning, an ancient wartime practice of pouring poison into sources of fresh water before an invading army in order to diminish the invading army's strength.\" (\"Poisoning the well,\" Wikipedia, 4 February 2012).so that his readers won't bother checking for themselves the evidence for the Shroud's authenticity - which is overwhelming!Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 6, 2012 at 9:58 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nStephen, nice find and a very accurate portrayal of Freeman's review.It looks like Freeman is tailoring his review of Wesselow's book to complete newbies.Why is it when Atheists like Freeman ask for evidence and get it that completely ignore the scientific evidence and turn all pseudo-scientific on us. I truely believe that they must reject the shroud at all costs because of the strong evidence for authenticity.Even when googling about the shroud I couldn't believe all of the nonsensical information on the skeptical websites I have seen. Back in 2009 I was totally ignorant of the shroud and thought it was just some relic. Ironically it was the atheist funded and failed replication of the shroud , and all of the hoopla that surrounded it worldwide that got me to take a deeper look into it.Thank God for websites such as yours that actually study the relevant info pertaining to the shroud.Do you have a donate page ?I think that would be a great idea to help this website growGod blessBippy\n\n","author":"Bippy123","date":"July 8, 2012 at 7:54 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nHas anyone here  read the entire article?I'd like to see a rebuttal to it by Ian Wilson, if possible.\n\n","author":"Anonymous","date":"July 8, 2012 at 9:36 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nBippy>Stephen, nice find and a very accurate portrayal of Freeman's review.Thanks.>It looks like Freeman is tailoring his review of Wesselow's book to complete newbies.Yes. Although I basically agree with Freeman's critique of that part of de Wesselow's \"The Sign\" which attempts to explain away the post-resurrection appearances of Jesus that they were really the disciples looking at the image on the Shroud.>Why is it when Atheists like Freeman ask for evidence and get it that completely ignore the scientific evidence and turn all pseudo-scientific on us. I truely believe that they must reject the shroud at all costs because of the strong evidence for authenticity.Atheists are like cultists (or actually ARE cultists) whose minds have been made captive to a philosophy:Colossians 2:8. \"See to it that no one takes you captive by philosophy and empty deceit, according to human tradition, according to the elemental spirits of the world, and not according to Christ.\"namely Naturalism (nature is all there is-there is no supernatural). It is a very powerful cultism in that: 1) it is held by some of the best and brightest; 2) it has brought great material benefits in science and technology; and 3) it is not recognised to be a cult by those whose minds Naturalism has captured.But there is absolutely no reason why Christian Theism cannot be true. Then what is true in Naturalism is just a subset of Christian Theism.And the Shroud of Turin is just another piece of the empirical evidence that Christian Theism is true, which God has graciously granted to those whose minds are not closed to receive it.>Even when googling about the shroud I couldn't believe all of the nonsensical information on the skeptical websites I have seen. I haven't read much of them, but what I have read, I agree is largely nonsensical. A major problem for Shroud anti-authenticists is that few (if any of them) have invested in buying and reading Shroud pro-authenticist books.They are therefore largely dependent on Shroud anti-authenticist websites and discussion forums. But that is just a case of \"the blind leading the blind\" (Matthew 15:14).>Back in 2009 I was totally ignorant of the shroud and thought it was just some relic. Ironically it was the atheist funded and failed replication of the shroud , and all of the hoopla that surrounded it worldwide that got me to take a deeper look into it.Great!>Thank God for websites such as yours that actually study the relevant info pertaining to the shroud.Indeed, to God be all the thanks. If I had not by His providence happened to see Stevenson & Habermas' \"Verdict on the Shroud\" (1981) in a secondhand bookstore for $3, I would probably still be totally ignorant of the Shroud and assuming it was just another fake medieval relic.>Do you have a donate page ?No. And I don't intend to have one. But thanks for suggesting it.>I think that would be a great idea to help this website growBy God's grace it will grow anyway.>God blessThanks and the same to you.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"July 8, 2012 at 10:00 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nAnonymous>Has anyone here read the entire article?I have printed out Freeman's article and am reading through it, highlighting key points. I am up to the second-last page, so I should finish it tomorrow. Actually I have now finished reading the whole article. And I can report that there is much in it that is wrong, some in it that I agree with, and nothing in it that causes me any problems.Freeman suffers from the same disadvantage that all Shroud anti-authenticists suffer from. And that is the Shroud is a VAST field, requiring a HUGE investment in time and money to keep up with (let alone to master), and which no Shroud anti-authenticist, including Freeman, is prepared to pay. Therefore Freeman dropped at least one major clanger due to simple ignorance.>I'd like to see a rebuttal to it by Ian Wilson, if possible.That would be great. But Wilson doesn't seem to publicly respond to critiques of his works.Maybe as an author he works on the principle that \"there is no such thing as bad publicity\"? Or to paraphrase St. Paul's version of it in Philippians 1:15-18:\"Some indeed write about the Shroud of Christ from envy and rivalry, but others from good will. ... What then? Only that in every way, whether in pretense or in truth, the Shroud of Christ is proclaimed, and in that I rejoice.\"So maybe it is up to lesser lights like me, to critique Freeman's attack on the Shroud? One interesting item I found in Freeman's paper on page 13, which no one had mentioned to me-so I wonder how many commenters here have actually read right through it:\"The trouble was that no one else could see this elaborate text on the Shroud although there have been some brave attempts to decipher what are apparently Hebrew letters that some are able to see after hours looking with special glasses. (If you don't believe me, see Stephen E. Jones' Shroud of Turin blog for November 2008 on Hebrew letters on the Shroud.)\"So maybe Dr Freeman will read my series of critiques of his article?Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 8, 2012 at 11:03 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMatt>Further to my comment at 10.25.The 1516 copy backs up my point. In that copy, the frontal image shows three holes on one side of the image, and four on the other.Agreed. Maybe a pattern of 3 and a pattern of 4, `poker holes' was whoever created the Mandylion protective surrounds' way of symbolising all the `poker holes'.Just as the Pray Manuscripts' 4 x L-shaped pattern and 5 P-shaped patterns of circles may be its artist's way of symbolising all the `poker holes'.And if the `poker holes' were evidence of the Mandylion's survival of an Islamic trial by fire in 680, then that would be something to be proclaimed on an update of its protective surround. Which would be necessary after that trial by fire, if a red-hot poker was thrust through it, into the Shroud beneath.>Just theorising here, but maybe the Sakli image, as a later image of the Image of Edessa, shows the poker holes where earlier depictions don't, because the poker holes were created some time between the earlier depictions and the Sakli depiction?That is possible. Or maybe the Sakli image is a more faithful representation of the Mandylion's post-680 trial by fire protective surrounds?The Sakli church is deep within Turkey (check out the location of \"Goreme\" on Google maps). Maybe it was more important in that location to proclaim the Christian God's victory over the Islamic God in the Mandylion's survival of that Islamic trial by fire by faithfully representing the pattern of `poker holes' on the Mandylion's post-680 protective surrounds?Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 8, 2012 at 11:42 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMatt>personally I think the unique use of the word \"tetradiplon\" is one of the most compelling factors in support of authenticity Agreed. As I pointed out, a unique word signifies a unique way of folding.And again, the probability that doubling the Shroud over between the two head images, then folding it three times again, i.e. a total of four doublings, could `just happen' by chance to produce and EXACT copy of the Mandylion, with Jesus' head in LANDSCAPE mode (perhaps unique in all of art for a single head portrait), would be close to zero. In fact it cannot be done and arrive after a doubling in four with a landscape mode of a head with the space around the head that the Mandylion copies depict (e.g. at St Catherine's Monastery, and the Sakli Church) without starting with a cloth about the same length and width of the Shroud.Starting with the about 4.4 x 1.1 metre Shroud, 4 x 2 = 8 halvings yields a cloth 4.4/8 = 0.55 x 1.1 metres or 1.1 x 0.55 metres with the head in about 1:2 landscape mode.Again, I would like to wind up these comments which have strayed far from my original Lombatti post (by allowing this I am indicating that I will in future more flexible on what \"off topic\" means).I would appreciate new comments to be on Charles Freeman's paper under my \"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey.\"Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 9, 2012 at 12:43 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nStephenThe atheist Freeman notes the following under an image on an early page of his piece:\"Above, this wonderful icon from c. 1500, now in the Museum of Byzantine icons in Venice, shows clearly how the discarded burial cloths were seen in the eastern tradition, based doubtless on the gospel accounts. There is a separate sudarium and the wrappings from which Christ had extricated himself. The cloths found in the Jerusalem tomb in 2009 correlate with this tradition, an interesting example which points to the historical reliability of John’s gospel.\"Note the references to the separate sudarium and the  wrappings, and the reference to the 2009 tomb findings supporting this. This supports the notion that the Pray Codex lower image Plate III shows the sudarium on top of the Shroud. As we know some anti-authenticists claim the Shroud is the small cloth object on top of a sarcophagus lid.It's also interesting looking at this image and seeing the tomb / sarcophagus without a lid adjacent to it. Again, contrary to what some anti-authenticists say, it is actually far more common in art to see the empty tomb without an adjacent lid than an empty with an adjacent lid.Also of interest to me is Freeman's acknowledgement of the historic reliability of John's gospel - quite an admission from an atheist!!!!      I'm working my way through his paper and will offer more views.\n\n","author":"Matt","date":"July 9, 2012 at 11:08 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMattThanks for commenting under this post.>The atheist Freeman notes the following under an image on an early page of his piece:>\"Above, this wonderful icon from c. 1500, now in the Museum of Byzantine icons in Venice, shows clearly how the discarded burial cloths were seen in the eastern tradition, based doubtless on the gospel accounts. Freeman is writing about \"an early sixteenth century Byzantine icon ... [called] Noli Me Tangere (when Mary Magdalene meets Jesus in the garden).\" See John 20:11-17. I wasn't even going to quote this because being 16th century the icon is more recent than the Shroud's first public appearance in Lirey, France in c.1355, and therefore it is of no value in tracing the Shroud's \"missing history\" through congruencies between it and 6th-13th century Byzantine icons. >There is a separate sudarium and the wrappings from which Christ had extricated himself. The cloths found in the Jerusalem tomb in 2009 correlate with this tradition, an interesting example which points to the historical reliability of John’s gospel.\"Note Freeman's anti-Christian \"wrappings from which Christ had EXTRICATED HIMSELF.\" Not \"had been RESURRECTED THROUGH.\" Presumably the atheist/agnostic Freeman holds to a version of the `Jesus did not die on the Cross' theory. Because a dead body cannot \"extricate himself\" from his burial wrappings! And a resurrected Jesus would just pass through them (or rather, according to Jackson's \"cloth collapse\" theory, they would pass through Him).>Note the references to the separate sudarium and the wrappings, and the reference to the 2009 tomb findings supporting this.Again I see nothing of great significant in this. Freeman does waste a lot of space in his article discussing irrelevant side-issues.>This supports the notion that the Pray Codex lower image Plate III shows the sudarium on top of the Shroud. I am not sure what you mean by \"on top of the Shroud.\" Do you mean the burial clothes emerging from the sarcophagus lid? Or do you mean Jesus' head on Mary Magdalene's right shoulder and arm?[continued]\n\n","author":"Stephen E Jones","date":"July 9, 2012 at 4:24 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\n[continued]>As we know some anti-authenticists claim the Shroud is the small cloth object on top of a sarcophagus lid.I am not aware of that. Probably because I don't normally read comments on other Shroud blogs.But in keeping with the Pray Codex artist depicting the Shroud symbolically in terms of contemporary 12th century Western burials (e.g. the empty tomb is depicted symbolically as a sarcophagus and its lid, decorated with the Shroud's `poker holes,' herringbone weave and bloodstains), the empty burial garments emerging from the sarcophagus are just part of the artists' symbolic depiction of Jesus' resurrection leaving behind the Shroud and the Sudarium.The Sudarium was, until the rediscovery in 1965 by Sindonologist Guilio Ricci of the Sudarium of Oviedo, thought to be the chin band around the head of a Jewish body to keep its mouth closed until rigor mortis had set in. And the chin band (and therefore the Sudarium) probably are (mistakenly) depicted by the artist in the strips of cloth around the neck space of the garment emerging out of the sarcophagus lid. >It's also interesting looking at this image and seeing the tomb / sarcophagus without a lid adjacent to it. Again, contrary to what some anti-authenticists say, it is actually far more common in art to see the empty tomb without an adjacent lid than an empty with an adjacent lid.OK.>Also of interest to me is Freeman's acknowledgement of the historic reliability of John's gospel - quite an admission from an atheist!!!!Yes, that is interesting. Even some Christian theologians deny that. Earlier Freeman wrote, \"These relics did, of course, exist at some point, Christ did die on the Cross and was buried in a linen cloth ...\" which I found interesting. It is fashionable for atheist/agnostics (like Richard Dawkins) to deny that Jesus even existed!>I'm working my way through his paper and will offer more views.Great! Feel free to comment on issues in Freeman's paper before I get to them.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 9, 2012 at 4:32 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nFreeman says:\"An even more bizarre explanation comes when Wilson tackles Byzantine art. Seventy years ago a Frenchman, Paul Vignon, noted that the bearded face on the Turin Shroud has some of the characteristics of Byzantine art. All kinds of measuring was done and some enthusiasts found as many as sixty resemblances. This is all interesting but Wilson goes on to make the absurd suggestion that this was because Byzantine art was born from the Image of Edessa, also known to Wilson as the Turin Shroud! Wilson makes some vague points about a new period in art at this time and finds a reference to two wandering Georgian monks with contacts with Edessa in the 530s who may have painted images. His key argument is the appearance in iconography of Christ with a beard happens just at this time. Yet, even if Wilson claims, against Belting who prefers a date fifty years later, that the Image of Edessa was known from the 540s, Byzantine art was well under way by then. So we have the earliest bearded Christ in the catacomb of Commodilla in Rome in about 390 and then a fine central image of a bearded Christ in the church of San Pudenziana of c. 405 (below). Even a brief glance at a standard history of early Christian art would have shown Wilson the emergence of these fully fronted bearded portraits in the fifth century.\"Actually, as I have stated before, the story of St Alexius has him travelling to Edessa in 405AD to venerate an icon, that eventually \"talks to him\" and influences his spiritual path.Whilst the evidence is not categorical, I consider it very likely that the icon is the Image of Edessa, which takes us back to 400AD at least. So it is likely that the Image of Edessa DID  influence the bearded depictions of Jesus that began to arise in the late 300s / early 400s\n\n","author":"Matt","date":"July 9, 2012 at 5:26 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nFreeman says:\"If Wilson’s thesis that this linen cloth was the Mandylion was not already in enough trouble, he still has a major issue to tackle, the history of the Shroud from AD 30 to the second half of the sixth century when the Edessa Image aka to Wilson the Turin Shroud is first recorded in Edessa. It is a long period, much more challenging than filling in a mere 150 years.\"I have suggested above that the story of St Alexius strongly suggests that the Image of Edessa was in Edessa at least as early as 400 AD. Freeman overlooks the fact that Christianaity was persecuted in its first few hundred years of existence, and as result Christian relics would hardly be widely publicised!!! Once Emperor Constantine stepped in to cut that nonsense out in the early 300s, we then have less than 100 years of a lack of documentation. I would suggest that is a relatively insignificant gap. Or even if the St Alexius story is not accepted, about 200 years which again isn't really problematic.It should also be remembered that the iconoclasm from the early 700s likely saw many images and / or records of the Mandylion / Image o Edessa / Shroud of Turin destroyed\n\n","author":"Matt","date":"July 9, 2012 at 5:36 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nI turn to Freeman's criticism of the Pray Manuscript: \"These scenes are supposed to show that the illustrator knew of the Turin Shroud. However, let us start with what would be obvious to anyone who had seen the Shroud, the size of the cloth and the two images. So to turn to the Pray Codex, it shows Christ being laid onto a shroud, which, in traditional Jewish style, as recorded in John’s gospel, reaches only to his shoulders. There does seem to be some sort of fold under the buttocks but hardly enough to make up the size of the Turin Shroud. Surely anyone knowing the Turin Shroud would have shown it with the top half of the Shroud above his head ready to be folded back over the body and fixed at the feet. Then the Turin Shroud shows a bearded Christ, this illustration does not, unless it is a very light beard.\"As Stephen has shown, actually the Shroud in the Pray Manuscript is much bigger than it first appears, as the figures in the background are holding an area of the shroud much greater than that which lies under Jesus's body.Also the illustration of Jesus does  show him with a light beard.The beard on the Shroud image is not particularly heavy either, and many illustrations of Jesus in art history have him with a relatively light beard.\n\n","author":"Matt","date":"July 9, 2012 at 7:15 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMy last point:Freeman says:\"When one looks at the lower image of the Codex, the discarded burial cloths are there but if the illustrator had seen the Shroud he would have surely shown the image of Christ on them. As it is they are jumbled up and hardly seem anything like the size of the Turin Shroud.\"Comment: Why didn't the illustrator show the image of Christ on the Shroud? I don't know! But I can only hypothesize. Most significantly, the size of the Pray Manuscript is very small and it would have been very hard for the artist to meaningfully depict Jesus's image at this scale.There is also the question of HOW he would depict what is a very faint image. I believe the Shroud image of Jesus is symbolically represented by the cross motifs near the angel's foot, and this is an easy way to get around both the scale issue as well as the faint image issue.   Freeman goes on:   \"The most important point of all is that a blown-up image shows that the sudarium is depicted as a separate piece of cloth and so the source seems, once again, to be the account in John’s gospel where the sudarium is reported as lying separately. This cannot be the Turin Shroud! The usual practice of taking the gospel accounts as an inspiration seems to have been followed here.\"Comment: I'm glad Freeman acknowledges the small bundled up cloth is far too small to be the Shroud. Indeed it is! He rightly identifies it as the Sudarium, which is supported by the alpha letter connecting the sudarium to Jesus's head behind Mary's right arm. So at least Freeman is one step more advanced than our friend \"Science bod\" who thinks this small piece of cloth is in fact the shroud (no matter what you think of the artist's abilities, he does tend to get scale and perspective quite accurate in the illustration, and this cloth is far too small relative to the human figures adjacent to be the shroud. You are on the right track Mr Freeman!!!).    And finally Freeman again:\"No one who had seen the Turin Shroud and been impressed with it would have illustrated the discarded burial cloths of Jesus as is actually done on the Pray Codex, with, in the conventional gospel representation from John, of the sudarium being shown separately as it clear from a blow-up pof this part of the manuscript. There is not a single hint that there is anything to do with the Turin Shroud here!\"Comment:Wrong! Freeman the historian should know as much as anyone that ancient art used much symbolism. He acknowledges the small bundled cloths are the sudarium (good!) but fails to see the Shroud beneath it. He dismisses the random asymmetrical 4 holes in an L shaped pattern but does not offer an alternative explanation. He thinks it is a sarcophagus lid but ignores the two red streaks which subtly represent the blood of Christ on the Shroud. If it is a sarcophagus lid then what are the two red stripes? And is it mere coincidence that the red stripes and the 4 holes are located adjacent to the cross like motifs, echoing the blood images on the Shroud image and the holes just to its side? BUT Freeman has actually done our case a great service. He recognises the small bundle of cloths as the sudarium, but then wonders why there isn't a shroud, since the sudarium is consistent with John (but missing the shroud of John). Well, Mr Freeman, the image is more consistent with John than you imagined, because both the head cloth AND the shroud is there in the image (the former on top of the latter). To be fair to Mr Feeeman, the shroud is encoded in the artwork rather subtly and symbolically.\n\n","author":"Matt","date":"July 9, 2012 at 7:44 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMattI am going to answer these comments which are about other parts of Freeman's paper only briefly. Otherwise I will be duplicating what I am going to write later.>\"An even more bizarre explanation comes when Wilson tackles Byzantine art. Note Freeman's preface of \"bizarre\" to Wilson's theory that the Edessa Image was the Shroud of Turin doubled-in-four, with only the face 1/8th of the Shroud visible in landscape mode.As mentioned in my post above, this is part of Freeman's ongoing attempt to \"poison the well\" against Wilson's theory in the minds of Freeman's readers.>Seventy years ago a Frenchman, Paul Vignon, noted that the bearded face on the Turin Shroud has some of the characteristics of Byzantine art. Vignon was not only \"a Frenchman\", but a Professor of Biology and an artist. But to be fair to Freeman, Wilson does not mention this in his latest book \"The Shroud\" (2010) which Freeman is relying on. >All kinds of measuring was done and some enthusiasts found as many as sixty resemblances. Note Freeman's \"enthusiasts\" being part of his continuing attempt to \"poison the well\" against Wilson's theory in the minds of his readers. And Freeman conceals from his readers that Wilson in his book only mentions 15 of these \"Vignon markings\" - unique congruencies between Byzantine depictions of Christ starting from the early 6th century and the Shroud.>This is all interesting but Wilson goes on to make the absurd suggestion that this was because Byzantine art was born from the Image of Edessa, also known to Wilson as the Turin Shroud! More \"poisoning of the well\" by Freeman. Wilson's theory that \"the Image of Edessa\" is \"the Turin Shroud\" is dismissed by Freeman as \"absurd\". This is what we might expect from some anonymous commenter to a blog, not a professional historian.>Wilson makes some vague points about a new period in art at this time and finds a reference to two wandering Georgian monks with contacts with Edessa in the 530s who may have painted images. They were actually \"Assyrian monks ...Theodosius from Edessa and Isidore from Edessa's sister city Hierapolis ... Both monks travelled to Georgia specifically to paint interpretative versions of their charges for the newly founded churches there.\" (p.136). For a historian, Freeman is remarkably careless with historical facts!>His key argument is the appearance in iconography of Christ with a beard happens just at this time. Here Freeman sets up a \"straw man\" effigy of Wilson's \"appearance in iconography of Christ\" claim, so he can knock it down more easily. Wilson's clam is NOT ONLY that icons of Christ appeared \"with a beard.\" But I will go into that in detail when I get to that part of Freeman's paper.[continued]\n\n","author":"Stephen E Jones","date":"July 10, 2012 at 8:23 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\n[continued]>Yet, even if Wilson claims, against Belting who prefers a date fifty years later, that the Image of Edessa was known from the 540s, Byzantine art was well under way by then. More of Freeman's \"straw man\". Wilson does not claim that \"Byzantine art\" BEGAN \"from the 540s.\">So we have the earliest bearded Christ in the catacomb of Commodilla in Rome in about 390 and then a fine central image of a bearded Christ in the church of San Pudenziana of c. 405 (below). Wilson acknowledges in his other writings that there were isolated parallel depictions of Christ with a beard, e.g. in the catacombs of Rome, etc. But these do not have the distinctive Vignon markings, and so are probably derived from independent traditions ultimately based on memories of what Jesus looked like.>Even a brief glance at a standard history of early Christian art would have shown Wilson the emergence of these fully fronted bearded portraits in the fifth century.\">Actually, as I have stated before, the story of St Alexius has him travelling to Edessa in 405AD to venerate an icon, that eventually \"talks to him\" and influences his spiritual path.Thanks. There is a lot of other information that the Image of Edessa is the Shroud doubled-in-four, which Freeman presumably knows about, but conceals from his readers. Even if Freeman is basing his paper on Wilson's latest book, in the interests of scholarly honesty, Freeman should have revealed the existence of that other information to his readers, so as not to mislead them.>Whilst the evidence is not categorical, I consider it very likely that the icon is the Image of Edessa, which takes us back to 400AD at least. So it is likely that the Image of Edessa DID influence the bearded depictions of Jesus that began to arise in the late 300s / early 400sGood point. Wilson's claim is NOT that the rediscovery of the Image of Edessa in 525 was the FIRST TIME Christians had seen the Shroud and what Jesus looked like on it. Wilson's theory IS that the Shroud existed from AD 30 in Jerusalem and was later taken to Edessa. And that at some point it was folded eight times (\"doubled-in-four\") and encased in a protective surround, so that only the face of Jesus was visible. So, even if the Shroud was not shown publicly, which would place the Shroud and its guardians in danger of it being confiscated by Christianity's enemies-the then much more numerous and powerful Jews and Romans, there presumably would have been hundreds, if not thousands of Christians who knew what Jesus looked like from the Shroud.And also, there is no reason why traditions of what Jesus looked like independent of the Shroud/Image of Edessa did not persist into the 4th and 5th centuries. While the New Testament does not mention what Jesus looked like, it would have been common knowledge in the early church. We must also remember that we have only a tiny `tip of the iceberg' of early Christian art that has survived. Apart from the Iconoclast movements in the 8th and 9th centuries in which over-zealous Christians themselves destroyed all the depictions of Jesus they could find, almost all ancient art (Christian and otherwise) has not survived.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 10, 2012 at 8:35 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nStephenFurther to my previous points about the real suffering of Jesus not being graphically shown until the 1400s, I've borrowed a book called \"Jesus Christ\" by J.R. Porter. Porter is Professor Emeritus of Theology at the University of Exeter.A chapter on the history of Jesus's representation in art is written by art historian / lexicographer Jennifer Speake. On page 216 she states:\"In the post-Romanesque West a concentration on the physical torment of the Passion aimed to elicit powerful emotions of horror and sympathy in the onlooker. FROM THE FIFTEENTH CENTURY ONWARD, a growing observation and understanding of anatomy in the West brought to the NEAR-naked body of Jesus on the Cross a disturbing realism completely absent from the stylized torsos and musculature in Eastern icons.\"So this from an art historian backs up my own non-art historian observations that the kind of graphic, body-wide torturous suffering we see on the Shroud was not observed until well into the 1400s (some from the 1420s / 1430s, most from after 1450) in art, and further that all art (I think there might be one known exception) showed Jesus's moedesty protected by a loin-cloth at least.Anti-authenticists need to explain the following:- Why would an \"artist\" create the shroud in a manner that departs so radically from the conventional artistic depictions of Jesus at the time? (ie. prior to 1357 AD). We know in modern art that there have been radical innovators who have departed from the norm, but in ancient times artistic evolution was far more gradual.- In particular, if an \"Artist\" did it as a way to benefit from the relic trade, then it doesn't make sense to show Jesus's brutal inflictions when most people at this time would have found such a depiction offensive      - Furthermore, even into the 1400s and 1500s Jesus was almost universally shown with a loin cloth as a minimum protecting his modesty. Again it makes no sense that an artist looking to profiteer from the relic trade would create the shroud without the loin cloth, with buttock images on full display- Similarly, an artistic creation would surely aimed to unambiguously show Jesus with wounds in both hands, let alone one wrist. The Shroud image alludes to a wound on both hands by virtue of the streams of blood on both forearms, however it is hard to imagine that a artist looking to profiteer from the relic trade would be so subtleSupporting these points is that ALL the copies of the Shroud do one or more (usually all) of the following:- Show Jesus with a loin cloth- Show Jesus with both hands pierced- Do not show the body-wide flagrum marks\n\n","author":"Matt","date":"July 11, 2012 at 9:14 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nThe representation of Christ with wounds and heavily bleeding actually goes back to the fourteenth century. The book to look for is Caroline Walker Bynum's Wonderful Blood where she illustrates  the grotesque wounded pietas which first appear in the early fourteenth century. Note for instance the Fritzlar pieta, dated to pre 1350, where a bearded Christ is shown with a gaping wound in his side and many scourge marks. Rachel Fulton's From Judgement to Passion  deals with the earlier literary sources that dwell on the wounds of Christ which she dates to the eleventh century or earlier. So, for instance, the Old English poem Christ III ' And downcast in soul they shall also behold the ancient gashes and the gaping wounds in their God, even as his foes pierced his white hands and hallowed feet with nails, and likewise made blood run from his side, where blood and water issued forth together in the sight of all, flowing before the face of men, when he was on the cross'. (Fulton p. 57.)Neither of these books have anything to do with the Turin Shroud at all, they simply represent current scholarship on the suffering Christ with particular emphasis on his wounds.\n\n","author":"Christian Art historian .","date":"July 11, 2012 at 4:17 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nChristian Art HistorianThanks, I hadn't come across that pieta statue. I have also seen a date of 1360, so not sure how reliable the dating is. Can you provide reliable source of its dating?What I can say is that most of the pieta showing Jesus's extreme suffering date from 1390 or later: Refer:http://en.wikipedia.org/wiki/Piet%C3%A0And in terms of painting, such grotesque depictions of Jesus certainly didn't become commonplace until well into the 1400s.\n\n","author":"Matt","date":"July 11, 2012 at 7:49 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMatt. Have only got pre-1350 date from Caroline Bynum's book but she is a highly regarded scholar so unlikely to be far out for the pieta. Agree with you re suffering as this is a book which concentrates on blood relics and therefore the examples will not necessarily be typical of the art of the period as a whole. Most of her examples are fifteenth century.I believe the crucifixion that Giotto painted at Assisi (?date but must be early fourteenth century) shows blood coming out of jesus's wounds. Try Google Images, Giotto crucifixion assisi.\n\n","author":"CAH","date":"July 12, 2012 at 12:02 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMatt>Actually, as I have stated before, the story of St Alexius has him travelling to Edessa in 405AD to venerate an icon, that eventually \"talks to him\" and influences his spiritual path.Yes. Repeating a comment I made under \"`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti:----------------------------------\"Linda Cooper `The Old French Life of Saint Alexis and the Shroud of Turin', Modern Philology [a journal devoted to research in medieval and modern literature], University of Chicago Press, August 1966, pp.1-17. The eleventh century Old French Life of Saint Alexis, generally recognized as the first masterpiece of French literature, contains the passage: Then he [Alexis] went off to the city of Edessa Because of an image he had heard tell of, Which the angels made at God's commandment... As Linda Cooper shows in this highly scholarly paper, the `image' referred to is none other than the Image of Edessa, and when the various versions of St. Alexis's life are studied, it makes a great deal of sense that this was one and the same as the Shroud. She cites, for instance, the Bollandist Vita Alexius which calls it `... an image of our Lord Jesus Christ made without human work on a sindone'; also the Latin Cod. Monac. Aug. S.Ulr. 111 ... `[he came] to the city of Edessa, in which there was preserved a blood-stained image of the Lord not made by hands'. Both passages clearly refute arguments that the Image of Edessa was incompatible with the cloth we know today as the Turin Shroud.\" (Ian Wilson, BSTS Newsletter, No. 16, May 1987, p.14).Also:St. Alexius (or Alexis) lived in Edessa between 412 and 435:\"Saint Alexius or Alexis of Rome or Alexis von Edessa was an Eastern saint whose veneration was later transplanted to Rome, a process facilitated by the fact that, according to the earlier Syriac legend that a \"Man of God\" of Edessa, Mesopotamia who during the episcopate of Bishop Rabbula (412-435) lived by begging and shared the alms he received with other poor people was, after his death there, found to be a native of Rome.\" (\"Alexius of Rome,\" Wikipedia, n 24 March 2012).So if while St. Alexius was in Edessa between 412-435, the Shroud was there and known to be full-length (and \"an image of our Lord Jesus Christ made without human work on a sindone\" and \"Edessa, in which there was preserved a blood-stained image of the Lord not made by hands'' can be nothing else) then that is more evidence for Ian Wilson's theory that the Image of Edessa/Mandylion and the Shroud of Turin are one and the same.----------------------------------Again Freeman conveniently ignores evidence that undermines his theory that: 1) the Image of Edessa is not the Turin Shroud, and 2) both are just two of many fake relics.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 13, 2012 at 8:44 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMatt >Freeman says:>\"If Wilson's thesis that this linen cloth was the Mandylion was not already in enough trouble, Wilson's thesis that the Turin Shroud was the Mandylion (aka Image of Edessa), doubled-in-four and encased in a flat, rigid, container, so that only the face of Christ appeared in landscape mode, is not in ANY trouble at all. Rather, iIt is Freeman's thesis that: 1) the Image of Edessa is not the Turin Shroud, and 2) both are just two of many fake relics, which is in trouble.>he still has a major issue to tackle, the history of the Shroud from AD 30 to the second half of the sixth century when the Edessa Image aka to Wilson the Turin Shroud is first recorded in Edessa. It is a long period, much more challenging than filling in a mere 150 years.\"First, as you say, there IS evidence that the Shroud was in existence \"from AD 30 to the second half of the sixth century\" and I will quote some of it when I get to that part of Freeman's paper.Second, as Beecher pointed out in 1928, like an ancient \"bronze statue that was found at the bottom of the Aegean Sea,\" it still can be accepted as genuine without ANY documentary evidence, based on its own \"intrinsic proofs of authenticity\":\"I have heard many say that they are convinced that the Shroud was not produced in the fourteenth century, and that it has all the appearance of being the genuine Shroud of Christ, but they own to a feeling of diffidence regarding the long stretch of time from the thirteenth century backward. My aim in this chapter is, so far as I am able, to win the confidence and assent of such persons, and to convince them that the proof of authenticity, as it spans these centuries, is not so formidable as it appears. My chief argument is the self-proof which the Shroud has stamped upon it. This in itself, even if we had not a single document to quote, is quite sufficient. And I wish to stress the same with all the emphasis I can, lest, in the course of our long historical enquiry, it should be lost sight of. When, for instance, archaeologists desire to know the history of some ancient building or monument, they do not think of going to parish registers in search of documents. NO, they examine the building or monument itself, and they are satisfied with whatever reasonable testimony may be found therein. I will give an example even more to the point. Some eighteen months ago the London Times had a photograph of a bronze statue that was found at the bottom of the Aegean Sea. Experts examined it and pronounced it a genuine Greek statue. It was accepted as such; no one doubted the opinion that was expressed; and it will be labelled for all future time as a Greek statue. [continued]\n\n","author":"Stephen E Jones","date":"July 13, 2012 at 10:04 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\n[continued]Suppose someone had objected and said: `No; I refuse to believe that it is a Greek statue unless I get documentary evidence as to when and where it was made, and how it came to be at the bottom of the sea.' Would that attitude be regarded as reasonable? Would his opinion influence anyone? NO, rather he would be looked upon as eccentric in not being able to see that the statue carried in itself its own proof of its genuineness. Very well, but we have vastly stronger intrinsic proof for the genuineness of the Shroud. We are dependent on the opinion of a few experts in regard to the statue. They may be wrong for aught we know, yet we trust them. But in the Shroud we have not one but several intrinsic proofs of authenticity, the force of which, at least several of which, even the untutored can see. And while not even legend has a word to say for the Greek statue, we have attaching to the Shroud a jealously guarded tradition that was never broken. In a word, if it be not what these many and varied proofs coalesce in proclaiming it to be, then it is at once a challenge and a mystery. Rather than this alternative, do not common-sense and logic both say that, even in the absence of historical evidence, it should be accepted for what it is on the strength of its own intrinsic proof?\" (Beecher, P.A., \"The Holy Shroud: Reply to the Rev. Herbert Thurston, S.J.,\" M.H. Gill & Son: Dublin, 1928, pp.136-137. Emphasis original).>I have suggested above that the story of St Alexius strongly suggests that the Image of Edessa was in Edessa at least as early as 400 AD. And there is more evidence than that. Check out historian Jack Markwardt's 2008 Ohio Shroud Conference, paper (PDF 2 mb+), \"Ancient Edessa and the Shroud: History Concealed by the Discipline of the Secret\"). Markwardt argues for a Jerusalem->Antioch->Edessa variation on Wilson's theory, which I find more plausible than Wilson's Jerusalem->Edessa theory.   >Freeman overlooks the fact that Christianaity was persecuted in its first few hundred years of existence, and as result Christian relics would hardly be widely publicised!!! Agreed.>Once Emperor Constantine stepped in to cut that nonsense out in the early 300s, we then have less than 100 years of a lack of documentation. I would suggest that is a relatively insignificant gap. Agreed. But it wouldn't matter if there was a ~1300 year gap until the Shroud appeared in Lirey, France in the 1350. The Shroud bears within itself its own proof of its authenticity. What is Freeman's (and his ilk's) alternative explanation of how the Shroud image was formed? They don't have one.>Or even if the St Alexius story is not accepted, about 200 years which again isn't really problematic.Agreed.>It should also be remembered that the iconoclasm from the early 700s likely saw many images and / or records of the Mandylion / Image o Edessa / Shroud of Turin destroyedAgreed. But we should get sucked into playing by Freeman's rules, i.e. `the Shroud cannot be accepted as authentic until there is an unbroken paper trail going back to AD30.' But even if there was, the Freemans of this world wouldn't accept it. Freeman (and his ilk) denies even that the Pray Manuscript (1192-95) was based on the Shroud, so it is clear that NO evidence for the Shroud's authenticity would suffice for him/them.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"July 13, 2012 at 10:14 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMatt>My last point:I hope so. Before you respond, please read the last paragraph of this my multi-page response to your unnecessarily long and repetitious comment.>Freeman says:>>\"When one looks at the lower image of the Codex, the discarded burial cloths are there but if the illustrator had seen the Shroud he would have surely shown the image of Christ on them. As de Wesselow pointed out in his book, \"The Sign,\" the artist may not have been permitted by the Constantinople authorities to copy the Shroud (as those copies would become competing icons to the Shroud itself). So what the Pray Codex artist has done, is depicted the Shroud symbolically.>As it is they are jumbled up and hardly seem anything like the size of the Turin Shroud.\"This is FALSE. As shown (outlined in green) on my \"My critique of \"The Pray Codex,\" Wikipedia, 1 May 2011,\" the Pray Codex's (Berkovits, 1969, plate III, upper) Shroud is \"about 3.0 times Jesus' body, compared to the Shroud of Turin's about 2.4 times the length of Jesus' body.\">Comment:Why didn't the illustrator show the image of Christ on the Shroud? I don't know! But I can only hypothesize. Most significantly, the size of the Pray Manuscript is very small and it would have been very hard for the artist to meaningfully depict Jesus's image at this scale.Yes. As previously pointed out, the artist used \"artistic license\" to include Joseph of Arimathea, Nicodemus and John in the entombment of Jesus by draping the Shroud around them. But to fit all this within a portrait mode illuminated manuscript miniature forced the artist to depict the Shroud about 25% longer than it is.>There is also the question of HOW he would depict what is a very faint image. I believe the Shroud image of Jesus is symbolically represented by the cross motifs near the angel's foot, and this is an easy way to get around both the scale issue as well as the faint image issue.As previously mentioned, IMO many elements of the Pray Codex's Entombment and Visit to the Sepulchre scenes (Berkovits plate III) depict the Shroud symbolically.>Freeman goes on:>>\"The most important point of all is that a blown-up image shows that the sudarium is depicted as a separate piece of cloth and so the source seems, once again, to be the account in John's gospel where the sudarium is reported as lying separately. This cannot be the Turin Shroud! The usual practice of taking the gospel accounts as an inspiration seems to have been followed here.\"If Freeman is talking about the image of Jesus' head in profile near Mary Magdalene's right arm, then that is self-evidently NOT the Sudarium (i..e. \"the face cloth [Gk. soudarion], which had been on Jesus' head, not lying with the linen cloths but folded up in a place by itself\" in John 20:7). First, a face cloth would not show the features of Jesus' face; and second, the scene being depicted is not John 20:7, which involved Peter and John but no angel, but rather Mark 16:5-6:\"5 And entering the tomb, they [Mary Magdalene, Mary the mother of James, and Salome-v.1] saw a young man sitting on the right side, dressed in a white robe, and they were alarmed. 6 And he said to them, `Do not be alarmed. You seek Jesus of Nazareth, who was crucified. He has risen; he is not here. See the place where they laid him.'\"[continued]\n\n","author":"Stephen E Jones","date":"July 15, 2012 at 8:01 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\n[continued]>Comment: I'm glad Freeman acknowledges the small bundled up cloth is far too small to be the Shroud. Indeed it is!Agreed. Freeman, the historian, does not realise what de Wesselow, the ART HISTORIAN pointed out, that the WHOLE of plate III depicts the Shroud (and I would add the Empty Tomb) SYMBOLICALLY.>He rightly identifies it as the Sudarium, which is supported by the alpha letter connecting the sudarium to Jesus's head behind Mary's right arm. Disagree that the Sudarium is the empty grave clothes. The soudarion was probably thought by the artist, as it was until the discovery of the Sudarium of Oviedo, to be the strip of linen binding a Jewish body's jaw to prevent its mouth from opening until rigor mortis set in. In which case it is depicted around the neck area of the empty grave clothes emerging from the sarcophagus. The alpha letter is ambiguous. But agreed that it probably is intended by the artist to connect the empty grave clothes with Jesus' head on the Shroud in profile, behind Mary Magdalene's right arm.>So at least Freeman is one step more advanced than our friend \"Science bod\" who thinks this small piece of cloth is in fact the shroud \"Sciencebod\" has been permanently banned from commenting on this blog, because of his repeated breach of its policies. Therefore, as previously requested, I don't want him to be mentioned her because: 1) it gives him a continued proxy presence on my blog; and 2) it could be claimed by him to be unfair, that he is attacked in comments on my blog, but is unable to post comments in reply defending himself.>(no matter what you think of the artist's abilities, he does tend to get scale and perspective quite accurate in the illustration, and this cloth is far too small relative to the human figures adjacent to be the shroud. You are on the right track Mr Freeman!!!).Disagee. See above. Freeman has the wrong Gospel scene and the wrong burial cloth.>And finally Freeman again:>>\"No one who had seen the Turin Shroud and been impressed with it would have illustrated the discarded burial cloths of Jesus as is actually done on the Pray Codex, What with the sarcophagus and its lid, decorated with the Shroud's `poker holes' and herringbone weave, the the \"discarded burial cloths of Jesus\" are all part of the artist's depiction of the Shroud SYMBOLICALLY.>with, in the conventional gospel representation from John, of the sudarium being shown separately as it clear from a blow-up pof this part of the manuscript. Again, see above that Freeman gets his Gospel scenes mixed up. The artist is showing Mark 16:5-6, not John 20:7>There is not a single hint that there is anything to do with the Turin Shroud here!\">Comment:>Wrong! Freeman the historian should know as much as anyone that ancient art used much symbolism. He probably does, but his ex-Catholic prejudice against relics, including the Shroud, has clouded his mind.>He acknowledges the small bundled cloths are the sudarium (good!) but fails to see the Shroud beneath it.Agree with the second, but not the first. See above.[continued]\n\n","author":"Stephen E Jones","date":"July 15, 2012 at 8:05 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\n[continued]>He dismisses the random asymmetrical 4 holes in an L shaped pattern but does not offer an alternative explanation. Presumably you mean \"dismisses AS random ...\" Such a weak non-explanation by Freeman that the distinctive L-shaped set of 4 circles and P-shaped set of 5 circles on the Pray Codex which match their counterparts on the Shroud, shows the BANKRUPTCY of his atheist/agnostic Shroud anti-authenticity position.>He thinks it is a sarcophagus lid It is probably the Empty Tomb (or that and the Shroud combined) which is depicted symbolically as an empty sarcophagus and its lid, albeit decorated with the Shroud's `poker holes,' herringbone weave and bloodstains.>but ignores the two red streaks which subtly represent the blood of Christ on the Shroud. Agreed. >If it is a sarcophagus lid then what are the two red stripes? And is it mere coincidence that the red stripes and the 4 holes are located adjacent to the cross like motifs, echoing the blood images on the Shroud image and the holes just to its side?It is difficult to untangle the artist's combined symbolism. I interpret it that the empty sarcophagus and lid, decorated with the Shroud's `poker holes,' weave and bloodstains, with the empty graveclothes emerging from the sarcophagus, and the face of Jesus in profile near Mary Magdalene's arm, TOGETHER depict the Empty Tomb and the Shroud COMBINED.>BUT Freeman has actually done our case a great service. He recognises the small bundle of cloths as the sudarium, He is wrong. See above.>but then wonders why there isn't a shroud, The Shroud is there-depicted SYMBOLICALLLY.>since the sudarium is consistent with John (but missing the shroud of John). It isn't \"John\" that the Pray Codex's \"Visit to the Sepulchre\" scene is depicting but Mark 16:5-6. See above.>Well, Mr Freeman, the image is more consistent with John than you imagined, because both the head cloth AND the shroud is there in the image (the former on top of the latter).No. Freeman (and you Matt) are both wrong about the scene being \"John.\" And therefore you are also both wrong about the head cloth.>To be fair to Mr Feeeman, the shroud is encoded in the artwork rather subtly and symbolically.Agreed, but why \"be fair to Mr Freeman\"? He is so prejudiced against the Shroud's authenticity that he REFUSES TO SEE the obvious symbolic elements of the Shroud in the Pray Codex's artwork. And remember that Freeman had already reviewed de Wesselow's book pointing this out.Matt, there was a lot of unnecessary repeating of the same points, including \"Comment:\" on a separate line, which made your comment (and my response) longer than it needed to be. Please be more succinct in future. And also, you have made your point and I have made mine in response, a number of times. So please don't continue going around in circles arguing the same points. The readers can make up their own minds. Otherwise I will have to reconsider re-introducing my \"usually only one comment per commenter rule.\" Because the more time I have to spend on responding to comments, the less time I have to actually blog.   Thanks.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"July 15, 2012 at 8:13 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\nMatt>I turn to Freeman's criticism of the Pray Manuscript:I will preface Freeman's words with \">>\" to distinguish them from yours.>>\"These scenes are supposed to show that the illustrator knew of the Turin Shroud. However, let us start with what would be obvious to anyone who had seen the Shroud, the size of the cloth and the two images. So to turn to the Pray Codex, it shows Christ being laid onto a shroud, which, in traditional Jewish style, as recorded in John’s gospel, reaches only to his shoulders. This is false on two counts. First, a Jewish shroud doubled as a bed sheet, so it could have been double a man's length. Second, there is no necessity for the Shroud to have been specifically intended as a burial sheet. Although English translations say that \"Joseph bought a linen shroud\" [Gk. sindon]:Mk 15:46. \"And Joseph bought a linen shroud, and taking him down, wrapped him in the linen shroud and laid him in a tomb that had been cut out of the rock.\"it is the same Greek word that Mark uses in the previous chapter for the \"linen cloth\" that a \"young man\" (probably himself) was solely wearing (presumably his bed sheet):Mk 14:51. \"And a young man followed him, with nothing but a linen cloth [Gk. sindon] about his body. And they seized him,\"So the Shroud that Joseph of Arimathea bought to bury Jesus in, was a large linen sheet that could have been used for any purpose, including making clothes, soft furnishings, a burial shroud, etc.>>There does seem to be some sort of fold under the buttocks but hardly enough to make up the size of the Turin Shroud. This is true. But as I have pointed out elsewhere, that appears to be a garment with two halves, with an opening for the neck and ties across the shoulders. It is therefore is not the Shroud. But we should remember that the Pray Codex artist probably was not an expert in first century Jewish burial garments, and since both Luke and John (Lk 24:12; Jn 20:6-7) refer to \"linen cloths\" plural [Gk. othonia] there is no Biblical reason why Jesus could not have been laid on a garment.>>Surely anyone knowing the Turin Shroud would have shown it with the top half of the Shroud above his head ready to be folded back over the body and fixed at the feet.Why? Again there is no reason to think that the Pray Codex's artist was an expert in Jewish burials. And even if he was, the artist does show the Shroud, but around Joseph of Arimathea, Nicodemus and John, and that evidently was his artistic priority, to depict their involvement in Jesus' burial. >>Then the Turin Shroud shows a bearded Christ, this illustration does not, unless it is a very light beard.\"As I pointed out in my post, \"My critique of `The Pray Codex,'Wikipedia, 1 May 2011,\" the Christ of the Pray Codex does have a beard, albeit a light one. And the reason for that may be traditional, cultural and/or even medieval Christian anti-Semitism. The Apostle John is depicted with no beard at all, yet Joseph of Arimathea and Nicodemus are depicted with full Jewish beards.It could even be due to the artist's misinterpretation, since the beard on the Shroud Man is faint.[continued]\n\n","author":"Stephen E Jones","date":"July 18, 2012 at 5:49 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"},{"title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n","post":"\n\n>[continued]I just now realised that I never continued from the above comment and I don't feel like trying to work out now, ten days later, what I was going to write!Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 28, 2012 at 9:52 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","site":"moore"}]
