[{"title":"Charles Freeman and the Huffington Post Caption Writer","post":"The India-born or American of Indian origin Carol Kuruvilla is Associate Religion Editor at Huffington and wrote a balanced report, probably because of her background. Huffington is a mixed bag and can sometimes, unfortunately, confuse people with their pluralistic approach.\n\n","date":"April 21, 2015 at 10:09 am","url":"https://shroudstory.com/2015/04/21/charles-freeman-and-the-huffington-post-caption-writer/","cat":"2015","id":"comment-197053","author":"Louis","site":"shroudstory"},{"title":"Charles Freeman and the Huffington Post Caption Writer","post":"A question that has always intrigued me about the Shroud being a painting, is why has no other work by the artist ever surfaced?\nI mean, what does an artist do all day…and even more so given that this artist was able to paint a perfect photographic negative 100s of years before proof could be established. I wonder how he/she explained that little plus-point to their patrons?  :)\n\n","date":"April 22, 2015 at 6:58 am","url":"https://shroudstory.com/2015/04/21/charles-freeman-and-the-huffington-post-caption-writer/","cat":"2015","id":"comment-197165","author":"Steve","site":"shroudstory"},{"title":"Charles Freeman and the Huffington Post Caption Writer","post":"Steve. I have just been visiting the Cathedral Museum in Ferrara. They have a wonderful set of sculptures of the months, each of the survivors from the original twelve having beautifully sculpted figures. We do not know who the sculptor was nor do we have any other works of art that are recognisably his so he is simply known as the Master of the mese( months) in Ferrara. This is quite common as documentation is often very poor and names and works have been lost. If the artist of the Shroud specialised in painted  linens , so few have survived that it would be highly unlikely that we would have any others left by him. So that is not really an issue here.\n\n","date":"April 22, 2015 at 12:23 pm","url":"https://shroudstory.com/2015/04/21/charles-freeman-and-the-huffington-post-caption-writer/","cat":"2015","id":"comment-197209","author":"Charles Freeman","site":"shroudstory"}]
