[{"title":"Charles Freeman’s Article Covered in Forbes","post":"Is this going to be a one sentence book?  “I think the Shroud was used in a Easter Play”\nHere is my new book,”I Think The Shroud Was Made In Southern Turkey” in the 14th century for the annual myrrh and aloes festival, This is where they soak one of the local fisherman with myrrh and aloes and wrap him in a cloth and unwrap it 3 days later.  Then they build a big fire in the form of a circle and one of the local leaders of the village holds up the cloth with the image of the fisherman while the people dance around it.  These types of rituals were common in the middle ages. It was believed to bring good luck to the village.\nThat is my theory.  I know it does not agree with any of the forensic evidence on the cloth, but I refuse to look at scientific facts, then I would have to admit I am wrong.  I can’t do that.   I must stay with my pet theory.   I hate Jesus and religion to, especially the Catholic Church, that is the real reason I don’t think the Shroud is genuine.  Even if it is genuine it is not.  That is how I feel about it.  At the end of the day it is all about me and what I want, and I don’t want the shroud to be genuine. So it is not.\n\n","date":"November 8, 2014 at 1:44 am","url":"https://shroudstory.com/2014/11/07/charles-freemans-article-covered-in-forbes/","cat":"press_coverage","id":"comment-169741","author":"Dave Hines","site":"shroudstory"},{"title":"Charles Freeman’s Article Covered in Forbes","post":"Yes, all this sounds very plausible. We have about four hundred accounts of the Quem Queritis ceremony ( see Karl Young’s book on medieval drama).,so how many hundreds can you provide of yours? Young provides instances of a single cloth being held u p before the empty tomb by two priests and then processed to the altar where the cloth was given due reverence. If you want an illustrated example there is a medieval artefact called the Lirey Pilgrim Badge that shows just this.\nI am sorry to hear that you hate the Catholic religion. As a historian who likes tradition I am pleased that the pope himself is coming to Turin to venerate the Shroud in a tradition that now goes back six or perhaps seven hundred years.  This  kind of continuity is important and I also like to come across similar processions ,etc ,from the medieval period that are still gong strong.\nOf course, the pope seems to be within the tradition  of Clement VII in being careful not  to say that this is  the authentic burial cloth but this does not make it any less worthy of respect. Thank goodness there is no evidence that it was designed to deceive or we would really be in trouble.\nGood luck with your researches and be sure to post your findings.\n\n","date":"November 8, 2014 at 11:55 am","url":"https://shroudstory.com/2014/11/07/charles-freemans-article-covered-in-forbes/","cat":"press_coverage","id":"comment-169886","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman’s Article Covered in Forbes","post":"I am going to take a Step 10 on my last post: “We Continued to take personal inventory and when we were wrong promptly admitted it”\nI admit being wrong with my previous sarcastic smart ass post.  I apologize to you and Dan Porter for doing so.  I have no excuse.   I can become unrestrained and even hostile when it comes The Shroud of Turin subject.  I become less useful to the Lord in whom I serve by doing so. I apologize to him as well.  I aspire to put on a better defense for the Man In The Shroud/Jesus. There is racial bias against him, he is not being treated with fairness.\n There are ancient relics that have been authenticated on far less evidence than the Shroud.  If we applied the same harsh criteria to other items as being authentic as is being done with the Shroud, nothing could be viewed as being authentic.  We would be carbon dating swords and linens from other famous figures in history.  We would have to close every museum in the world and re-examine all those items to be sure they are authenticate, including the jaws from monkeys glued into human skulls to fool people into believing in Evolution.\nAll sports memorabilia would be in question, we would have to stop all sales of those items and re-examine them.  Instead of 3 different handwriting experts to agree on a signature we will need at least a dozen. It could take up to 10 years to make a decision on whether or not Babe Ruth actually signed his name on that baseball, photograph or jersey.  We could just start flipping coins to decide if we really get impatient.\nAll antique auctions would be put to a halt; we can’t have some poor soul getting a fake antique.  We would have to start exhuming bodies of out every grave in the world and make sure the name on the headstone is really that person.  That could be a mannequin buried in the ground and not a real person and some kind of insurance fraud took place.  Birth certificates would be in question; we would have to put a freeze on every person’s bank account until they can prove they are who they say they are.  Yes, we need to be sure those birth certificates are not computer generated forgeries.   How do we know for sure those are not faked?\nAnd if the trace pollen evidence left on The Shroud, or absence of vanillin or recent stress tests on the fabric is not acceptable or convincing  evidence of The Shroud’s ancient history then we need to start releasing rapists, thieves and murderers from prison, because they were convicted on the basis of similar evidence. \n  BOTTOM LINE; IF THE SAME CRITERIA CURRENTLY IN USE THAT HAS AUTHENTICATED OTHER ANCIENT RELICS WAS APPLIED TO THE SHROUD,\nThe Shroud would be authenticated and accepted worldwide as the pure linen garment that wrapped the body of Jesus without any doubt or question in regards to its authenticity.   Not a single person would question it.  We would not be talking right now.\nThe reason that we are is because there is  RACIAL BIAS AGAINST MY CLIENT.\n\n","date":"November 8, 2014 at 6:56 pm","url":"https://shroudstory.com/2014/11/07/charles-freemans-article-covered-in-forbes/","cat":"press_coverage","id":"comment-169950","author":"Dave Hines","site":"shroudstory"}]
