[{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Dan, did you mean ‘righting’ or writing in your second last sentence above? …\nI wouldn’t go as far as saying Jones has been “Unhorsed”, maybe a few kinks have been placed in his armour at best ;-)\nBut that should not take away from Jone’s very detailed and accurate rebuttal to Freeman’s paper. Freeman’s comments that Wilson’s hypothesis has “manifold problems” or that Jones has “failed to tackle the actual points” are as dubious as his paper.\nI think it makes a big difference whether Freeman was paid or not. It is similar to acquiring a hired-gun in a sense. You hire someone who ‘shows’ to be a genuine historian, has written a couple of books or papers, you get him to write what you want to your bias, with very little reference and you also knowing your specific audience very well, an audience with little or no inclination to question this ‘historians’ argument….Considering where the article in question was written and the inclination of most of it’s readers, they would take this historians word, as if written in stone and could not possibly be wrong or irresponsibly written.\nNow if FREEman wasn’t paid, as he states, that gives a completely different meaning to the term ‘freelance writer’ ;-)\nR\n\n","date":"September 1, 2012 at 5:06 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15696","author":"Ron","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Good catch, Ron. Thanks.\n\n","date":"September 2, 2012 at 1:39 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15729","author":"Dan","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Stephen Jones’ egg on face unhorsing is an objective lesson in the dangers of without evidence impugning the character of those we may disagree with, regardless of whether their signatures are Charles Freeman, Ian Wilson, Giulio Fanti, daveb, DA, MPH, CB or YC.  The argument is to be addressed not the character.  Jones’ site is informative and he is a powerful advocate for the authenticity of the Shroud.  However his credibililty has now been compromised by exposing a silly throwaway comment on Freeman’s character as basically unsubstantiated.  Readers of his blog will now exercise greater caution in accepting what he asserts, regardless of its true value.  There will be flow-on negative effects.  \nBloggers on this site should take careful note, and desist from Ad hominem attacks, which in the long run will always be seen as failing to support their argument. \nOf course, substantive evidence of character deficiency might be another matter entirely, such as any proven evidence of corruption in carbon dating issues for instance.  But if you’re going to attack character, you need to be on much stronger ground than is sometimes seen on this site, and you had better be right!  You may have to eat your words!\n\n","date":"September 1, 2012 at 6:02 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15698","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"After the long and exhaustive research I have done on the subject, I can ensure you all that Freeman’s principal arguments and conclusions in his article against Wilson’s hypothesis are totally correct.  Of course, if you have already made up your mind and believe blindly in Wilson’s ideas, good for you and neither hi or Freeman will change anything to your point of view.\nBut for those who still have an open mind about this subject, I just want to say that you can trust me and Freeman on the main point, which is :  Wilson’s hypothesis is wrong !  Period.  We got to search for another answer concerning the Shroud’s obscure years instead of being stuck with this weak hypothesis, just like it was a proven and accepted theory (which is very far from being the case) !!!\nI think scholars today should take the great work and conclusions of Vignon and try to start from there.  For Vignong (and for me), the Mandylion was NOT the Shroud but the Mandylion WAS based on the Shroud’s image.  When we consider all the historical and artistic facts that exist on the subject (there’s a lot and you can learn many of them in my article as well as in the article of M. Freeman) without forgetting anything and with honesty, we have no other choice than to conclude that Vignong’s conclusion is probably correct. Of course, this cannot be proven without any doubt, but using the Occam’s razor principle to evaluates all the possibles solutions that exist in link with all the known historical and artistic facts, Vignon’s conclusion must come on top of your list of possible explanation concerning the Shroud and the Mandylion (and also some other so-called miraculous images of the living Christ that came out at the same time – second half of the 6th century – than the Mandylion). \nI still don’t understand perfectly why most English speaking pro-shroudies have so much problem to admit that Wilson’s hypothesis as some chances (great chances in my mind) to be wrong, while the alternative hypothesis of Vignon is not anti-shroud at all !  In fact, if Vignon is correct (as I think he is), then that mean the Shroud was present in the Middle East during the second half of the 6th century !  I know that it is still far from the 1st century A.D., but nevertheless it’s much better than the date given by the C14 labs in 1988 and allowed us to eliminate of our minds some possibilities of a medieval or Byzantine forger (around Constantinople or in Europe) that would have used the corpse of a real crucified man to produce a false relic between the second half of the 10th century (when we found the first written mention of a Shroud of Christ present in Constantinople) and the first public showing of the Shroud in Lirey, around 1357.  That’s a great step in the right direction no ?  Why being so stuck to Wilson’s hypothesis like there was no other possible solutions to explain the Shroud’s ancient history ???  I have a hard time to understand this reality.  \nAll I can say to you is this :  Please, go very deep in your research about the Mandylion and I’m sure you’ll find easily many problems linked with Wilson’s hypothesis.  Or at least, take the time to read carefully and with an open mind my recent paper on the subject and the one of M. Freeman…\n\n","date":"September 1, 2012 at 6:04 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15699","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"One last thing I would like to point out because it is very important :  After I finished my historical research concerning the Mandylion’s hypothesis of Wilson, I wrote the paper that was published on June 29, 2012 on this blog by Dan (https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf). At that time, I NEVER heard of M. Freeman and had no idea that he was doing his own historical research on the same topic than me. It’s only after that time that I found his paper by accident and when I read it, it was interesting for me to note how his arguments and conclusions were CLOSE TO MINE. This fact is important in my mind.  When I read M. Freeman’s paper, it was, in many ways, an independent confirmation of my own arguments and conclusions.\nI hope you will believe me when I say that M. Freeman and my own conclusions are very close and, at the same time, TOTALLY INDEPENDENT of each other.  I hope this FACT will make you reflect upon that and maybe you will start to consider our main conclusion (i.e. that Wilson’s hypothesis is surely wrong) as having some good chances to be correct after all.\n\n","date":"September 1, 2012 at 7:38 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15707","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"I think the biggest problem for shroudies is a linguistic problem. Since most of the shroudies is not a professional scholar, and does not have language skills – which is in general a very serious problem among English speaking people – they have no knowledge of what happens outside the English-speaking countries. Generally, therefore, ignore what is written in Europe in nations that have a very strong tradition in humanistic studies, that use German, Italian, Franch, and also Spanish languages. The criticism that Freeman and others now focus on the theory of Wilson, like many other critics in general, have been discussed many times there. In Italy by prof. Pier Angelo Gramaglia, for example, more than twenty years ago, even in scientifical reviews. And when (not so often) the same things are written in English, it seems that are new things! In reality, you are discussing things just discussed twenty years ago. Even I have written an entire book last year about Mandylion of Edessa and the Shroud, certainly the most thorough analysis of all the arguments from the historical and philological point of view. Surely outside Italy and outside academic circles, it will be totally ignored. If someone wants to discuss historical issues, he has to study foreign and ancient languages. It will be surely also a great gratification for him, I’m sure\n\n","date":"September 2, 2012 at 9:01 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15720","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Bravo.  I agree perfectly with all you said and I even bring on this point here on the blog :  English people (especially Americans) still believe they are the center of the Universe and on almost everything, most of them only focus on things coming from USA (and England also) and sadly the Shroud world is no different…\n\n","date":"September 2, 2012 at 5:20 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15735","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Charles Freeman has offered the only thing that anyone writing on this subject can do: yet another autopsy of a joke that had already been done to death.\nIn comparison to your autopsy, dear Andrea, Freeman’s is incomparably less exhaustive. In comparison to mine, it is much more general. In comparison to Yannick’s, much more anodyne. In comparison to those of Professors Gramaglia, Brock, or Cameron, Robin Cormack or Hans Belting, it is substantiated by far less of an academic career.\nSo why is Stephen E Jones dissecting this particular one in so many parts, while others have not been granted such dignity?\nIs it not primarily because Freeman’s article was published on a website ‘Dedicated to Free Inquiry, Naturalistic Humanism, Freethought, and the Philosophies of Naturalism, Empiricism, Rationalism, and Skepticism: The Heritage of the Enlightenment that Produced Science and the Modern World?’\n\n","date":"September 2, 2012 at 10:53 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15721","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"In other words, is it not because Jones believes that ‘there is a deeper and darker dimension to these attacks on the Shroud and on Shroud pro-authenticists?’ \nJust read these few lines: \n‘Freeman and his anti-Christian ilk don’t realise that in so doing they are acting out their part in Christs’ Play. In “The Parable of the Weeds” (Mt 13:24-30) He whose image is on the Shroud told us that He allows these weeds to “grow … until the harvest” at which time (if they don’t repent) He “will tell the reapers, Gather the weeds … and bind them in bundles to be burned.’\nNow, Jones doesn’t know whether you are a Christian or not, because your book wasn’t published by a publisher that openly peddles anti-Christian pamphlets and eulogies to human reason that produced the horrors of the French Revolution.\nHence, your silly book is not of much interest to him.\nBut he positively knows that Freeman (the following is a quote from part one of Jones’ six-part bravura) ‘is evidently an atheist/agnostic having published papers critical of Christianity in the New Humanist online magazine, the subtitle of which is “Ideas for godless people”, and is “produced by the Rationalist Association … dedicated to reason, science, secularism and humanism.” Freeman in his review of philosopher James Hannam’s book, “God’s Philosophers: How the Medieval World Laid the Foundations of Modern Science” (2009), describes Hannam as “a Catholic convert,” in contrast to himself, “(I have passed the other way),” so presumably Freeman is now an ex-Catholic and an anti-Christian.’\nAnd he knows that ‘Therefore, according to Freeman’s presumed personal atheist/agnostic philosophy, Christianity must be false, supernatural miracles are impossible, and the Shroud of Turin must be a fake!’\nAnd he positievly knows that Freeman was mentioned both in the Gospel according to Matthew and in the Apocalypse of John. And he knows that his duty as a Christian is to speak up against this beast.\nYannick and I, who claim to be Catholic, although we don’t agree with Wilson (?!?!) are a different thing. There may be some little hope for us. But Freeman is the anti-Christ.  And Jones will put on his shiny armour and battle this dragon in however many parts it may take to quote the entire ‘Catechism According to Wilson’ and the Wikipedia’s entire entry on logical fallacies.\nSo, no, Andrea, the problem isn’t that your book is in Italian. You are simply not the devil.\n\n","date":"September 2, 2012 at 11:17 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15722","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"I don’t think you got to be an anti-Christian, an atheist or an anti-Shroud person to understand the invalidity of Wilson’s hypothesis concerning the Mandylion…  I am the best proof of that !  I am a Christian Catholic who believe the Shroud is the authentic Shroud of Jesus Christ and still, because of the extensive research I’ve done about this topic, I just can’t buy Wilson’s hypothesis.  I’m just too rational I guess !!!  A rational Christian !  I think that’s two words who can really describe me very well !  And I hope I’m not the only one who’s interested in the Shroud !!!!\n\n","date":"September 2, 2012 at 5:23 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15736","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Kind Davor, I do not know if I am the devil or not (maybe a devil without self-consciousness?). I have written a big book on diabolical possession, perhaps this was not without consequences. Perhaps you are right, but I am sure that the problem of languages is maybe not the only problem, but one of them. And it is easier make battles with internet pages, than refute scholar publications: when a book is too deep or difficult, is better to ignore it.\nBy the way: ony now I see that the “dissection” of Stephen E Jones you pointed out. It is… embarrassing.\nI have opened a page at random. I read: “A 10th century codex, Codex Vossianus Latinus Q 69 found by Gino Zaninotto in the Vatican Library [wrong: the Vossianus is in Leiden and was not found by Zaninotto!] contains an 8th-century account [wrong: the account can be of the 8th, 9th or 10th] saying that…….\nThe source is Wikipedia. For me is enough to close it.\n\n","date":"September 2, 2012 at 12:09 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15724","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Errata corrige: “only now I see the “dissection””…\n\n","date":"September 2, 2012 at 12:11 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15725","author":"conteandrea","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Davor: “In other words, is it not because Jones believes that ‘there is a deeper and darker dimension to these attacks on the Shroud and on Shroud pro-authenticists?’ ” (Etc)\n“And he knows that ‘Therefore, according to Freeman’s presumed personal atheist/agnostic philosophy, Christianity must be false, supernatural miracles are impossible, and the Shroud of Turin must be a fake!’ ”\nI suspect that Davor is correct in this assessment.  Any fair-minded critique of Wilson deserves to be heard.  However I would tend to concur with Jones’ general view that Freeman’s paper is not so fair-minded.  It is only too apparent I feel  that Freeman’s agenda is suspect.  I am not persuaded by Freeman’s arguments.  It includes for example this type of circular reasoning (to precis):  Early Byzantine art forms would not present a dead Christ (and so would not show blood stains for instance)  Notwithstanding the apparent presence of Vignon markings on their images (icons and coins) showing Christ, he is shown as alive and triumphant, without blood stains;  therefore the image on Shroud could not have been used as the model on their icons and coins.  There is more that I am not satisfied with, for example that there were so many relics and imitations that there could have been no original model; that although the negative image clearly shows a dead Christ, this is not so apparent on the original cloth.  I may attempt to address these after I have studied Freeman’s paper in more depth. \nI did not see in Freeman’s paper an attempt to address Jack Markwardt’s modification of Wilson’s hypothesis, that the Shroud was kept in Antioch until the the 6th century; nor Scavaone’s modification that it was kept in Besancon after being sent to Athens, rather than being held by the Knights Templar.  Both of these hypotheses seem more credible than Wilson’s primary hypotheses. \nDespite Andrea’s claim that much other research had already been carried out in European countries, Ian Wilson deserves credit for reaching a wider public in English-speaking countries, and making the Shroud of some topical interest in these countries.  As far as I am aware his is one of the few attempts to vest the Shroud with some kind of historical provenance prior to the 14th century, and thus oblige a sceptical world to take it more seriously, than it had hitherto.\n\n","date":"September 2, 2012 at 5:04 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15732","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Markwardt’s hypothesis concerning Antioch and the Shroud rely as much (if not even more) on special assumptions, speculations and extrapolations…  If you want to put your trust in weak hypothesis coming out of someone who got a good imagination, it’s your problem Daveb !  But be sure of one thing :  By acting like that, you prove to be unworthy of the real and authentic scientific spirit…  Read again my paper on the subject and try to think that all these problematic facts are real and cannot be discarded with just a good imagination.  Maybe that will start a good reflection and you could open a bit more your mind on the possibility that Wilson can be wrong after all and that we (the ones who believe the Shroud is authentic) have to search ELSEWHERE in order to find a most credible explanation for the dark ages of the Shroud (i.e., before 1357 in Lirey, France).\n\n","date":"September 2, 2012 at 5:28 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15737","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"I consider that Markwardt’s hypothesis has more going for it than Wilson’s theory that the Shroud went to Edessa in the 1st century, and was walled up there for 400 or so years.  I’m surprised that from your point of view you don’t seem to think that that’s progress!\n\n","date":"September 2, 2012 at 5:47 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15741","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Daveb, please read the long comment I just post (https://shroudstory.com/2012/09/02/charles-freeman-the-manifold-problems-with-wilsons-hypotheses/#comment-15740) and you’ll understand easily (I hope so !) why I don’t put my faith in things published by Wilson or Markwardt.  You should never forget that with a good imagination, you can make believe the Shroud was once kept on the moon !!!  But that’s not history in his noble sense…\n\n","date":"September 2, 2012 at 6:01 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15745","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Daveb:\nI did not see in Freeman’s paper an attempt to address Jack Markwardt’s modification of Wilson’s hypothesis, that the Shroud was kept in Antioch until the the 6th century; nor Scavaone’s modification that it was kept in Besancon after being sent to Athens, rather than being held by the Knights Templar.  Both of these hypotheses seem more credible than Wilson’s primary hypotheses. \nMORE CREDIBLE? 1) the Shroud was kept in Antioch: invented. 2) the shroud was in Athens: invented. 3) Was held by the Knights Templar: invented. It seems that anyone can invent something, and shroudies transform it in an “hypothesis”. If one is false, the other one maybe is true. Please, this is not history. Is Dan Brown.\nAs far as I am aware his is one of the few attempts to vest the Shroud with some kind of historical provenance prior to the 14th century, and thus oblige a sceptical world to take it more seriously, than it had hitherto.\nYou said well: “some kind of historical provenance prior to the 14th century”. Any kind of. The important is not if it is true, the important is to say *something*. Athens, Rome, Edessa, Antioch, Besançon, Constantinople, everywhere. I add Cabot Cove.\n\n","date":"September 2, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15738","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Andrea, I think you should at least recognize the fact that there is 2 or 3 ancient sources (that all have been contested I know) about a possible presence of the Shroud in Athens (in the hands of Othon de la Roche) after the sack of Constantinople in 1204.  The fact that some written documents (even if there’s only a few) exists should not be enough for you to, at least, be prudent regarding that possible hypothesis instead of puting the tag “invented” over it.  You must also acknowledge the possible authentic coffin that is still kept in the Ray-sur-Saône castle (Othon de la Roche’s castle in France) and that could have been used to preserved the Shroud for a while…  Personally, I think it’s much more prudent to keep this possible path for the Shroud (Constantinople-Athens-Ray-sur-Saône-Lirey) open while we wait for historians to make more research about this particular option.  IF (the “if” is important) the Shroud was really in Constantinople at the time of the sack of the city and reappeared in Lirey around 1357, then I think the city of Athens should be considered as one truly possible place where the Shroud could have been kept for a while after the sack…\n\n","date":"September 2, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15742","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"And concerning your other tags of “invented”, I AGREE WITH YOU TOTALLY and I appreciate that you, like me, are able to see the close connexion that exist between Ian Wilson and Dan Brown !  Personally, when it comes to the style of doing pseudo-historical research in order to sell many books, I think they are both very tough to beat !!!\n\n","date":"September 2, 2012 at 5:58 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15743","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Yannick, can you tell me where are these 2 or 3 ancient sources?\n\n","date":"September 2, 2012 at 6:01 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15744","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Andrea, I admit I am not a scholar and my writing skills lack much skill, yet I am still totally aware to exactly what sources Yannick is pertaining too! Therefore, I now  question your remark as to your “entire” book and it being “certainly the most thorough of all the arguments from a historical and philological point of view”.\nR\n\n","date":"September 2, 2012 at 6:58 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15751","author":"Ron","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Ron, I know not 2 or 3, but even more “ancient” alleged sources, but all what I have examined is false, or invented, or mistranslated or non correctly understood. So I was asking Yannick where are these sources, because I have not found any kind of these sources. As I have read so many books and articles for one year about the shroud, from the morning to the night, before writing something, I think is difficult that such important sources are escaped from my research. Concerning the book I wrote: before we were speaking about the Mandylion, and not about Athens. I have dedicated a book only to the mandylion-theory, and there I study the supposed history of the Shroud from Edessa to Constantinople. But no problem! The theories about the presence of the Shroud in Athens or elsewhere, from 1204 to 1350, are examined in another book I have published six month before the other one, so I am well-informed also on this. So, I hope that you are not thinking about “chartularium culisanense” or other forgeries like that…… Because, excepting the forgeries, I repeat that I have not found any source.\n\n","date":"September 2, 2012 at 7:38 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15753","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Andrea, not finding the sources of these supposed letters is the reason why I wrote that all these “references” have been contested by scholars…\nThe fact that Scavone is so precipitate to used them to defend at all cost Wilson’s poor case is a good indicator of the biased of his researches and conclusions on this topic.  It’s very sad for me to note this but THAT’S THE REALITY.  I have read a lot of things from Scavonce, well enough to understand that this guy was full of bias concerning Wilson’s hypothesis.  And you can be sure that he’s not the only Shroud researcher like that.  IT’S A SHAME FOR SINDONOLOGY !!!\nInstead of having an independent, scholarly and critical look over Wilson’s weak hypothesis (and seeing that this guy is a real “opportunist”), these Shroud “scholars” are all defending Wilson’s views AT ALL COST, even if that mean publishing papers in which we found a lot of speculations, extrapolations and bad assumptions not worthy of someone who pretend to be an historian.\n\n","date":"September 2, 2012 at 7:59 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15754","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"In my research, I have found 2 different letters to the Pope Innocent III that seem to have been written shortly after the sack of Constantinople.  One would have been written by Alexios V Doukas (the one who was the Emperor of Constantinople at the moment of the sack : http://en.wikipedia.org/wiki/Alexios_V_Doukas) and the other would have been written in August 1st, 1205 by Theodore Komnenos Doukas Angelos (http://en.wikipedia.org/wiki/Theodore_Komnenos_Doukas).  Both letters mentioned the presence of the Shroud in Athens and the second letter (the one of Theodore Komnenos Doukas Angelos) even state that it was not the Venetians crusaders who have stolen the Shroud but the French crusaders.  The letter states that the Venetians were more interested by the gold that could be found in Constantinople.\nScavone talk about the first letter I mentioned in page 3 of a recent article he published : http://www.acheiropoietos.info/proceedings/ScavoneBesanconWeb.pdf \nThis letter was reported by Antoine Legrand (the great Shroud scholars from France) in an article published in 1982 and entitled “Du nouveau pour le Suaire de Turin : Une lettre de l’empereur Alexis V”. \nI found the second reference in an article published by Scavone in 2006 and entitled “Acheiropoietos Jesus Images in Constantinople : The Documentary Evidence”.\nAnd Scavone mentioned also another source in the same recent article I already mentioned and that can be found here : http://www.acheiropoietos.info/proceedings/ScavoneBesanconWeb.pdf.  This is a document called “MS 826” by historians (the author of the text is unknown) and in it, Scavone indicate that there’s a direct mention of Othon de la Roche has the one who was once the owner of the Shroud.  But since that document has been highly criticized, I don’t put too much faith in it.\n\n","date":"September 2, 2012 at 6:32 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15747","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Andrea N: “1) the Shroud was kept in Antioch: invented. 2) the shroud was in Athens: invented. 3) Was held by the Knights Templar: invented.” \nJack Markwardt’s two papers on the Shroud in Antioch are:\n1) “Antioch and the Shroud” presented at Dallas conference 1998, (modified in 1999) found at:\nhttp://www.shroud.com/pdfs/markward.pdf\n2) “ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET” presented at Ohio conference 2008 at:\nhttp://ohioshroudconference.com/papers/p02.pdf\n“The author’s 1999 hypothesis,that the Shroud was taken, in apostolic times,to the Syrian city of Antioch, concealed and lost in 362,rediscovered in ca. 530, and conveyed to Edessa when Antioch was destroyed in 540,is supported by historical records which evidence the presence of a Christ-icon in both fourth-century Syria and sixth-century Antioch.\nIn the fourth century, Athanasius, the Bishop of Alexandria (ca. 328-373), affirmed that a sacred Christ-icon,traceable to Jerusalem and the year 68, was then present in Syria:” citations provided.  \nDaniel Scavone’s paper “BESANÇON AND OTHER HYPOTHESES FOR THE\nMISSING YEARS: THE SHROUD FROM 1200 TO 1400” presented at Ohio conference 2008, at: http://ohioshroudconference.com/papers.htm; Scavone postulates that Othon de la Roche took the Shroud to Athens from Constantinople, and then consigned it to his home town of Besancon.  Perhaps Andrea N would postulate that Constantinople was also “invented”.  But curt dismissal does not create a cogent argument, nor is it a valid response!   \nI know of no assertions that the Shroud was in Cabot, nor Cove, nor for that matter in Wellington NZ.  Wilson’s hypothesis that the Knights Templar held it during the “missing years” was a brave attempt to explain its whereabouts during those years, but more effectively covered in Scavone’s paper. \nI find it remarkable that all these knowledgeable historians, while quick to dismiss genune attempts to discover the Shroud’s true history, can come up with no other meaningful explanations of their own.  Perhaps they all think it’s a 14th century fraud!\n\n","date":"September 2, 2012 at 6:46 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15750","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Daveb, few words, because for me the discussion here is not useful and I desire to close it. You showed me not some scholar article, or recognized historical research, but three pdf from shroudie conferences. Please, ask yourself why these kind of pseudo-historiography lives only among shroudies.\n1) Markwardt paper says that Shroud was in Antioch. No proofs of it, only conjectures or legendary texts, sometimes not well read or interpreted. What no one historian can use to proof something. I know a lot of theories like that, that “prove” that the Shroud was everywhere, in Antioch, in Jerusalem, in Rome, in Costantinople, in Alexandria. Obviously all are in contradiction among them, because all are false. But as shroudies do not know all them, but retain only what they like, they choose one and believe in it. Again: invented.\n2) The second paper is even worse. Markwardt cites an Athanasius’ text speaking about an “icon”. What a discovering! Maybe we have to be grateful to this shroudie historian that in 2008 discovered a new text that until now we ignored. The only problem is that every true historian with a minimum ok knowledge of the ancient christian literature knows that this text is not of Antanasius, that this text is pertaining to a painted image of Christ made by Nicodemus (do you believe also in that?), and obviously that this text says nothing about any shroud. Mr. Markwardt clearly has not idea about what is speaking of. Again: invented.\n3) Scavone is incomparably better than this Markwardt. No comparable. But has a similar problem: no proofs. He uses Wison’s book as a “shroud bible” (quoted) and his theory about Othon de la Roche is based on these arguments or documents: 1) The letter of Theodorus Angelus to the Pope. A modern forgery. 2) Some words written by Nicola di Otranto about Christ’s bands (the Shroud is made of bands?) not well interpreted and used in a shroudie perspective. 3) The conjecture that Otho had a shroud from the Blachernae palace because garrisoned in this palace in 1204. Said without proofs (by another shroudie, but obviously taken as true without any control, because many shroudies believe any conjecture useful to “support” their theories, and despise all the rest) 4) a tomb of Othon in France described by the shroudie chemist Alessandro Piana; but the tomb is not a tomb of this Othon, and it is interesting that this tomb has an inscription in Latin of 8 words that was copied by Piana with 3 mistakes (good wok!), that Scavone repeated. I wonder if they know some Latin. 5) Scavone adds another invention: the Shroud was brought to Othon by Pons de Chaponay in1219. The proof? They were friends!\nI have explained all this in my book and now I cannot summarize here, but ony I say that in this manner surely I can demonstrate that the Shroud was in Cabot Cove, discovered by Jessica Fletcher.\nPlease, open your eyes.\n\n","date":"September 4, 2012 at 10:42 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15841","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Post scriptum: opening at random the document of Markwardt, I see another funny pretended PROOF of the presence of the Shroud in Antioch: the Gospel of Hebrews. Markwardt wrotes: “Although the lost second-century Gospel of the Hebrews related that Jesus gave his Shroud to “the servant of the priest”, scholars have suggested that, before falling victim to a copyist’s error, this text had actually stated that the Shroud was given to Peter”.\nInteresting. Who are these “scholars”? In the footnote we find… Ian Wilson!!! What a coincidence! Wilson is a source? Surely. Only we, academic historians without faith, we are headstrong in looking for authentic sources. And the book of Wilson is not a source.\nBut obviously Wilson is not responsable of such a complex theory. The responsable is…. another shroudie, J.T. Dodd, that in 1931 published a very “disinterested” article intitled “The Appearance of Jesus to The Priest’s Servant, as Recorded in the Gospel of the Hebrews, and The Holy Shroud”. A guarantee! Which is the idea of this Dodd? That where in the Gospel of Hebrews is written “dedit sindonem servo sacerdotis” (he gave the sindon to the slave of the priest) we must read: “dedit sindonem Petro” (he gave the sindon to Peter). Why? Because he wants. Any manuscript says that? No. Any translation? No. Any old translation? No. Any other scholar? No. And why he wants to make such a manipulation? Because, Dodds thinks, if this shroud was given to the Jewish priest, it was not on the christian hands of Peter, and also the account of the Gospel of John is wrong. Impossible for Dodd to understand that the Gospel of Hebrews is not an historical reliable source. He MUST save this little sentence because it remembers his loved shroud! And now, after 90 years, shroudie Mr. Markwardt can use the manipulation of his shroudie ancestor Mr. Dodd to write in his article that Peter had the Shroud and brought it in Antioch (conjecture+conjecture=reality). “Scholars” says that. In the meantime, the editions of the Gospel of Hebrews have not this manipulated text, and the rest of the academic world knows that in the Gospel of Hebrews is written “he gave the sindon to the slave of the priest”. Stop. The “scholars” thinking what Markwardt says, are only in his own fantasy or in the book of Wilson. But surely all scholars are obstinate incompetents and Wilson and Markwardt are right. The American congress of the shroudies will say the truth.  :-)\nI have a new hypothesis: the Gospel of Hebrews has to be corrected like this: “dedit sindonem servo regis” (he gave the shroud to the servant of the KING). The king is Abgar of Edessa, his servant is Ananus. All make sense. So, the Shroud is the Mandylion. Now we have the proof. Please, invite me to the next shroudie congress.  :-)\n\n","date":"September 4, 2012 at 6:52 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15855","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Yannick, I agree with you. What I do not know, is if Wilson is an “opportunist”. With me both Scavone and Wilson were kind, not as other shroudies. I think both are not good historians, but to be in disagreement does not mean to be enemies. I think also Guscin wrote some wrong things, but I had with him and he had with me a cooperative behaviour. I have appreciated, for example, that Wilson wrote a terrible review of the Barbara Frale’s books, that are maybe a biggest falsification of the last 30 years about the Shroud, having read my arguments against her. Maybe he did it because Frale was manipulating his theories presenting herself as the authentic “discoverer” of them? Or because he realized that Frale was untruthful with him? Or because of the love of the truth? I do not know, but he did it.\nAbout shroudies and history, the problem is simple: as until now we have not documents about the Shroud before 14th century (I hope that something will be discovered, but UNTIL now we have nothing), the only history that a “real” historian can write is the history of the “idea” of a shroud, the history of the relics in general, or the history of the alleged false sources about the Shroud. The last one started in the 16th century and is continuing now, with a growing vitality. Is what I am doing now, studying the sindonology as an example of pseudo-historiography. As usual, with few exceptions, the pseudo-historiography normally lives outside universities and is rejected or ignored by the scholar academical world. But is very pervasive because is propagandized in popular books and media, and believed by people not ready to understand what is wrong and what is true. Normally the pseudo-historians are not professionals, and always are inaccurate, superficial, unreliable and conjectural in what they write. Normally they work with religious or political arguments, that can reach the emotivity of the not-so-historically-educated people. As here: people WANTS that someone find documents about the Shroud in the centuries 1-14, so they – with or without consciousness – provide them what they want. I assure you that the study of the pseudo-historiography is not easy, but very instructive. And also funny. Obviously, the “normal” historian will not sell so many books, but… for me this is not so important.\n\n","date":"September 2, 2012 at 8:38 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15755","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Being “kind” is often the trademark of “opportunists” !!!  To me, the fact that Wilson is an opportunist is so obvious !  In 1978, the STURP team anounced that they will do a great series of direct researches on the Shroud, and totally by chances, a few time before they came to Turin, Wilson published his first book on the Shroud !\nThen, right between the 1998 and the 2000 public showings of the Shroud, he published another book on the subject (The Blood and the Shroud).\nThen, right before the 2010 public showing, he published yet another book on the subject (Shroud Fake or Fact).\nOf course, all this is just an accident !  There’s no connexion at all between these big media covers of the Shroud and the books he published on the Shroud…\nNice or not, If that’s not being opportunist, I don’t know what it is…\nAnd no, I really don’t consider Wilson and Scavone has “good historians”.  First, Wilson is not even an historian, he is a journalist (just like Fanti is not a chemist or a microscopist but he is a engineer !).  Secondly, when you defend a very unlikely hypothesis (that rest mainly on special assumptions) at all cost like Wilson do (and Scavone too behind him), that’s not what I call doing good history.  That’s more doing good propaganda.\nAnd for Guscin, he tried to remain more neutral even though it’s evident that he is very friendly toward Wilson and his hypothesis.  At least, he don’t get too far into the propaganda that’s going on in the Shroud world about this weak hypothesis and that contribute greatly to kill the few amount of credibility that sindonology may still have.\nThat’s my opinion and I have no fear to tell it because, unlike most researchers, I have nothing to gain by being polite toward those guys…  I AM FREE.\n\n","date":"September 2, 2012 at 9:08 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15756","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"In the end, that Wilson is an opportunist in the Shroud world is not the most important.  Realizing the weakness of his hypothesis versus the Mandylion, that’s what really matter.\n\n","date":"September 2, 2012 at 9:22 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15757","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"¡Teníamos pseudo-ciencia y ahora tenemos pseudo-historiografía! ¡Ja,ja,ja…!\n¡Gracias a los “auténticos eruditos”, como Nicolotti, sabemos que “the Picard crusader Robert de Clari in Saint Mary of Blachernae did not see the Shroud, but rather a silk veil, in front of an icon of the Virgin, than every Friday would have risen miraculously”!\n¡Eso es ERUDICIÓN!\nSon muy interesantes algunos de los comentarios de Marinelli sobre los últimos libros de Nicolotti:\n“A small cloth to be destroyed”\nhttp://www.shroud.com/pdfs/n75part8.pdf\n“Wiping the slate clean”\nhttp://www.shroud.com/pdfs/n74part8.pdf\nEs muy afortunado que existan los Wilson, Scavone, Guscin, Marinelli, etc, etc\nLos ataques DESAFORTUNADOS de Yannick hacia Ian Wilson creo que sirven para hacer más fans de Wilson\n¡Lea, compare…… y elija!\nPersonalmente este debate me está sirviendo para reforzar la idea de que la imagen de Edesa era lo que hoy conocemos como Sábana de Turín.\n!Anteriormente no lo tenía tan claro!\n\n","date":"September 2, 2012 at 9:42 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15758","author":"Carlos Otal","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"As you wish my dear Pro-Shroudie.\nI never saw one real Byzantine scholar outside the pro-Shroud world agreeing with Wilson’s weak hypothesis.  That’s the reality and you can change a thing about it.\n\n","date":"September 2, 2012 at 9:45 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15759","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Sorry, you should read : That’s the reality and you can’t change a thing about it. \nNow that’s better !!!  He he !!!\nIt’s incredible to see how people, even when they face the truth, are not able to change their mind.  EGO, EGO, EGO.\n\n","date":"September 2, 2012 at 9:47 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15760","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"One last thing about Carlos last comment : He call all this a “debate” and that’s true.  But don’t you think it’s funny to note how this debate is only present inside the pro-Shroud world ?  When I look at the Byzantine scholars group (the real scholars on this subject), I don’t see ANY DEBATE AT ALL about the hypothesis of Wilson !!!!\nAll of them agreed that this hypothesis is highly unlikely (and they used that term to stay polite).\nDon’t you find it strange folks that every “scholars” who defend Wilson’s ideas are pro-Shroudies ???  You really believe it is due only to hasard ???  You don’t think this has much more to do with their pro-Shroud bias ??? Asking the question is finding already the answer in my book.\n\n","date":"September 2, 2012 at 9:58 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15761","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Yannick should ask himself why such a debate should occur outside the “pro-Shroud world”.  Would a non-Shroudie ever support any constructive hypothesis that might validate the Shroud as auhentic?  I think I shall wait for eternity before a non-Shroudie “historian” ever comes up with any other kind of constructive hypothesis as to its history.  They hide behind “maybe this”, “maybe that”, but as Wilson / Markwardt / Scavone are not part of their academic history establishment “they couldn’t possibly be right”.  Or could they?\n\n","date":"September 3, 2012 at 12:23 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15766","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"You should read : Asking the question is finding already the answer, in my book.  My expression is easier to understand that way.\n\n","date":"September 2, 2012 at 9:59 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15762","author":"Yannick Clément","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Yo no he hablado de la hipótesis de Wilson.\nHablo de la identidad de la imagen de Edesa y la Sábana de Turín.\n¿es usted periodista?\n¿es usted historiador?\n¿qué criterios tiene para decidir quiénes son los “verdaderos eruditos”?\n¿no encuentra extraño que los “eruditos” que atacan la identidad de la imagen de Edesa con la Sábana de Turín sean anti-Shroudies?\n¿no cree que eso tiene mucho más que ver con su sesgo anti-Sudario?\n¿quiénes son los “verdaderos eruditos” que CREEN en la autenticidad de la Sábana de Turín?\n¿Usted quizás?\nCarlos Otal\n\n","date":"September 2, 2012 at 10:39 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15763","author":"Carlos Otal","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Ian Wilson’s comment (http://www.shroud.com/pdfs/edessa.pdf) about Guscin’s book, The Image of Edessa (Brill, 2010) , is very interesting:\n “For adherents of the Turin Shroud it might at first seem a disappointment that Mark Guscin’s book makes no direct reference to the Shroud. In actuality his book is all the more powerful for this. First because any potential hostile scholars – and there certainly are some – can hardly accuse the author of twisting his translations to suit a pro-Shroud argument if the Shroud goes unmentioned.” \nThis is a modern version of two truths strategy: there is a truth for “adherents” and there is a truth for “hostile scholars”. In the first case you can twist your translations. In the second case you must be “objective”. But I think Wilson doesn’t actually think the hostile scholars are “some”. There should be strange change the truth for “some potential scholars”. Guscin change of truth because is writing for a well known publishing. And there are some things that you can’t write if your public is not “adherent”. \nPS: It is not true that Guscin doesn’t twist de words. His conclusion is a good example of twisting words. It is only more cautious. No mention to the Shroud, helas!\nFor a less “adherent” review of Guscin’s book, see: Averil Cameron in The Medieval review. (https://scholarworks.iu.edu/dspace/bitstream/handle/2022/3734/09.09.21.html?sequence=1 )\n\n","date":"September 3, 2012 at 3:02 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15767","author":"David Mo","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Some answers for carlos:\n<<<<<<¡Teníamos pseudo-ciencia y ahora tenemos pseudo-historiografía! ¡Ja,ja,ja…!<<<<<\nCarlos, la pseudo-historiografía no es un invento creado para molestar a los sindonologos. Se enseña en la universidad, es parte de la metodología de la investigación histórica. Hay ejemplos de esto en los manuales, hay una larga tradición de lucha contra la pseudo-historia. Si no sabes, es porque no es tu trabajo. Y no te importa la historia, estás interesado en la Sábana: la historia puede ser sólo una manera de confirmar lo que quieres oír. Puedes reír, pero en ese caso risus abundat in ore stultorum.\n<<<<<<<Son muy interesantes algunos de los comentarios de Marinelli sobre los últimos libros de Nicolotti:<<<<>>¿no encuentra extraño que los “eruditos” que atacan la identidad de la imagen de Edesa con la Sábana de Turín sean anti-Shroudies?<<<<\nNo encuentras extraño que los “eruditos” que atacan Dan Brown sean cristianos ?\nBy the way : nadie « ataca ». La identidad de la imagen de Edesa con la Sábana no es una teoría que alguien acepta otro ataca. Es una teoría de sindonologos escrita por sindonologos. Nadie afuera la acepta. De ahí no sale. Y ahí permanecerá, en los blogs de sindonologos, y en los libros y escritos por sindonologos que no saben cómo vivir sin ella. Si te gusta el gueto, quédate ahí. A mi no me pasa nada.\n\n","date":"September 3, 2012 at 6:09 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15771","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Wilson’s Theory as you call it, is not a theory at all, it is an Hypothesis, you should know as a scholar there is a difference. Hypothesis are created to be challenged openly!…Wilson states this in his books and from what I’ve read; Wilson has never, ignored or ‘attacked’ any  “viable” opposition to his hypothesis, unless they are of shoddy construction, as seen clearly in Wilson’s response to Cameron’s writings for instance.\nR\n\n","date":"September 3, 2012 at 11:15 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15784","author":"Ron","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"I do not know why, but in the last post the central part of my answer was lost:\n<<<<<<<Son muy interesantes algunos de los comentarios de Marinelli sobre los últimos libros de Nicolotti:<<<<<\nSí, muy interesante. Yo escribí 400 páginas buscando fuentes y documentos como nadie lo había hecho antes, en griego, latín, siríaco, árabe y armenio, y recibí la aprobación de TODOS los otros historiadores que hasta hoy se exprimieron. Demostré la falsedad de los libros de Frale y muchas otras cosas, como por ejemplo la falsedad del cartulario culisanense. Y los sindonologs qué hacen? Publican en su revista de sindonología un comentario escrito por una sindonologa licenciada en ciencias naturales, que ni siquiera puede entender lo que yo traduje, que (muy nerviosa porque he demostrado cuanto es equivocada cuando escribe, i cuanto le gusta copiar lo que otros escriben) manipula lo que escribí y no dice nada de lo que estudié, porque no le gusta. Calos, si te gusta el gueto, quédate ahí.\n\n","date":"September 3, 2012 at 6:38 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15772","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Thank you David Mo for your references to reviews of Mark Guscin’s book “The Image of Edessa”.  I found them both interesting.  To some extent I suppose the tone of the reviews was hardly surprising, given the two respective reviewers’ different predelictions.  \nYou may be aware that Averil Cameron has directly challenged Wilson on aspects of his hypotheses.  Wilson’s response to her is detailed and comprehensive.  It can be found in the Meacham archive: http://freepages.religions.rootsweb.ancestry.com/~wmeacham/  .  Select both  and wilson2> for his complete response with citations and bibliographical references.  \nI found Guscin’s concluding paragraph quoted in Wilson’s review of the book rather compelling:\n“…it should be stressed that there are no artistic representations of the Image of\nEdessa as a full-body image or with bloodstains, and the majority of texts\nmake no reference to either characteristic; but at the same time it is undeniable\nthat at some point in the history of the Image of Edessa, some writers were\nconvinced, for whatever reason, that it was indeed a full-body image on a\nlarge cloth that had been folded over (possibly in such a way that only the face\nwas visible), and that it did contain bloodstains.” \nNo doubt it would not satisfy Professor Cameron.  But then I suspect that nothing ever would, if it did not conform to her own predelictions!\n\n","date":"September 3, 2012 at 6:40 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15773","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Error correction to files in meacham archive: “Select both ‘wilson1’ and ‘wilson2’ for his complete response with citations and bibliographical references.” [For some obscure wordpress reason, first file did not display.  The main file is wilson1; The wilson2 file is merely an additional page with a few more citations.]\n\n","date":"September 3, 2012 at 7:09 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15774","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"<<<<<it is undeniable that at some point in the history of the Image of Edessa, some writers were convinced, for whatever reason, that it was indeed a full-body image on a large cloth that had been folded over (possibly in such a way that only the face was visible), and that it did contain bloodstains<<<<<\n The problem is not what Cameron likes, the problem is ONLY that what Guscin wrote is not true.\n\n","date":"September 3, 2012 at 7:20 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15775","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Please prove your statement!…It is one thing to come on here and state everyone is wrong or things are not true, but another to back it up with facts. This is a serious issue.\nIt has been stated here several times that all historians ‘outside the shroud world’ are against Wilson’s hypothesis…WELL, lets see these papers that can actually refute his work. Furthermore if it so easily refutted; Why has no true historian written a paper and made it accessible to all on Shroud.com?\nThank-you.\nR\n\n","date":"September 8, 2012 at 10:08 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-16031","author":"Ron","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"\nRon :\nWhy has no true historian written a paper and made it accessible to all on Shroud.com?\nThank-you.\nR\n\nRon, Guscin wrote a book and some articles, and the sentence you quoted is taken from a book, not from Shroud.com. Historians write books and articles, and Shroud.com is not a place to make historical discussions or publish articles. I do not see differences. But maybe if Shroud.com is interested, they can ask historians to reproduce their papers, and perhaps sometimes will be possible.\n\n","date":"September 9, 2012 at 4:25 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-16042","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Nicolotti:\nEl problema No suele ser el dato, el problema es la INTERPRETACIÓN DEL DATO.\n¿Cómo se digiere o “se come” el ser HIPERCRÍTICO con el dato y ACRÍTICO en su interpretación?\n¿Cómo se digiere o “se come” que Robert de Clari NO VEA la imagen de Jesús y SI VEA la imagen de la Virgen?\n(es tan sólo un ejemplo de “su manera” acrítica de INTERPPRETAR)\n¿Cuál es la “fórmula”? ¿ Se enseña quizás en la Universidad también?\nCarlos Otal\n\n","date":"September 3, 2012 at 8:00 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15776","author":"Carlos Otal","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Carlos, el problema con la sindonologia pseudo-historica es también problema de DATOS, antes que de INTERPRETACIÓN DEL DATO, debido a que los pseudo-históricos generalmente no conocen los datos, los manipulan, traducen mal, conocen parcialmente. Déjame darte un ejemplo con ti mismo. Acabas de escribir: “¿Cómo se digiere que Robert de Clari NO VEA la imagen de Jesús y SI VEA la imagen de la Virgen?”. Esto demuestra que tu también tienes problemas con los datos. Porque nunca, en su libro, De Clari asegura haber visto algo el la iglesia de las Blachernas. Esto sería el FUNDAMENTO del la interpretación, pero te falta. Todo lo demás, lo expliqué en un artículo publicado en una revista de estudios bizantinos. Pero tu no la leíste. Así que estás hablando de lo que no sabes. Lo único que sabes es que lo que yo digo no te gusta porque no está de acuerdo con tu idea de Sábana. Eres un perfecto pseudo-histórico.\n\n","date":"September 3, 2012 at 8:33 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15779","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"En el supuesto poco probable de que Robert de Clari no hubiera visto la imagen de Nuestro Señor, él afirma que TODOS los viernes se podía ver en Sainte Marie de Blakerne. \nEl testimonio sigue siendo VÁLIDO para la presencia de una Sábana con la imagen del Señor ( que a usted obviamente le desagrada) y desconocemos si él fue o no fue testigo presencial, con mayor valor el dato si fuere testigo presencial.\nSu problema es:\n1.- Probar que NO la vió.\nUsted NO puede probarlo.\n2.- Probar que es FALSO el contenido de la frase “et entre ches autres en eut un autre des monstiers que on apeloit me dame Sainte Marie de Blakerne ou li Sydoines la ou Notre Sires fu envelopes i estoit, qui cascuns de venres se drechoit tout drois, si que on poit veir la figure de Notre Seigneur” , o sea que en Sainte Marie de Blakerne NO se mostraba los vierne la sydoines donde se veia la figura de Nuestro Señor.\nUsted NO puede probarlo.\nLa viera o no la viera el testimonio de Robert de Clari es muy favorable a la presencia de una Sábana con la Imagen de Nuestro Señor en Constantinopla.\nCarlos Otal\n\n","date":"September 3, 2012 at 9:29 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15781","author":"Carlos Otal","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Carlos: \nThe two Marinelli’s articles you linked are perfect examples of bad history and worse literature. She intends to reply to complex arguments of 45 pages with two lapidary sentences or an irony. It results a chaos of simplistic refutations with some basic logical mistakes. It is confusing and unconvincing. \nShe has not grasped (or she does not want to recognize) the Nicolotti’s hypothesis about what actually De Clari saw in St. Mary of Blachernae. She talks about it as if it should be a Nicolotti’s capricious choice to rely or not on Clari’s testimony. Nicolotti has a well argued statement about this subject, it is not capricious. You can see a brief comment in my  blog: http://sombraenelsudario.wordpress.com/2012/08/08/robert-de-clari-ii-un-testimonio-dudoso . I’ll be very happy if you go and post some comment.\n\n","date":"September 3, 2012 at 9:59 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15782","author":"David Mo","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Reacción típica de pseudo-histórico. Dice una cosa. Alguien dice que no es correcta. El cambia de tema. Antes has dicho que Clari vió la Sydoine. Te digo que no està escrito. Entonces usted dice que *tal vez* la vió, pero no es tan importante. Y de ahí se pasa a la siguiente objeción.\nAhora descubrimos que tal vez De Clari no era un testigo presencial. Entonces, si hubieras estudiado De Clari, habrías descubierto que escribió su crónica no en Constantinopla, pero algunos años más tarde, cuando regresó a Francia. A continuación, habría constatado que comete varios errores en la descripción de Constantinopla. Y también que era analfabeto, y su testimonio lo escribía otra persona en su lugar. Y que era muy crédulo, y cuenta episodios que nadie creería. Entonces se verá que dice que el Mandylion estaba en una iglesia en el otro lado de la ciudad, así que si él dice la verdad eso es una otra prueba que Wilson aún más està equivocado. Entonces descubrirías que su cuenta de la historia del Mandylion es tan equivocada que queda claro que sus fuentes no eran buenas. Por último, se descubriría que su relato de lo que ocurre en Blacherne es contrario a toda la mas segura tradición bizantina y latina. Uno contra todos.\nY màs:\n1) Dice: “Su problema es: 1.- Probar que NO la vió”. Es exactamente lo opuesto.\n2) La transcripción de la versión francesa, que me has dado, no es buena. Curiosamente la veo en el Internet. Tal vez ha copiado desde allí?\n3) para mi, despues un LARGO ESTUDIO de toda la obra de Clari e de TODOS los testimonios sobre la iglesia de Blachernae, Clari està equivocado. Pero el porqué no se explica en un blog. \n4) « La viera o no la viera….”. No, Carlos. La viera o no la viera no es lo mismo.\n5) Si en Blachernas habia una sàbana con la Imagen de Nuestro Señor en Constantinopla – yo no lo creo – no sabemos nada sobre sus orígenes y su realidad. Podría ser cualquier tela con la imagen de Cristo muerto, como muchas estaban en ese momento, con una función litúrgica que Clari, siendo francès, no entendìa. Y si estaba, no hay razón para pensar que era la misma que 150 años más tarde aparece en Lirey. Pueden ser objetos independientes, o incluso ser una copia de la otra, o ser dos entre muchas que existian. Así que este testimonio no cambia nada, sino para demostrar (si fuera verdadero, y yo no lo creo) que ya en el siglo 13 alguien dijo que existian sàbanas con imagen. Lo cual es interesante, pero no cambia la historia de la sàbana de Turin. Eso no me preocupa y tampoco me “desagrada”. No soy un fanatico de la Sábana. No soy un sindonologo ni un anti-sindonologo. Simplemente, no me importa.\n\n","date":"September 3, 2012 at 10:25 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15783","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Nicolotti:\nLe agradezco sinceramente que muestre en sus comentarios su “forma” de pensamiento, es ESCLARECEDORA. Usted además entiende y escribe perfectamente el español, así que doblemente le agradezco su respuesta.\n1.- “Antes has dicho que Clari vió la Sydoine.”\nERRÓNEO.\nEn ningún momento he hecho ESA AFIRMACIÓN. (¡muéstrela si puede!).\nYo he dicho:\n-¿Cómo se digiere o “se come” que Robert de Clari NO VEA la imagen de Jesús y SI VEA la imagen de la Virgen?\ny\n-En el supuesto poco probable de que Robert de Clari no hubiera visto la imagen de Nuestro Señor, él afirma que TODOS los viernes se podía ver en Sainte Marie de Blakerne.\n2.-” « La viera o no la viera….”. No, Carlos. La viera o no la viera no es lo mismo.”\nTENDENCIOSO.\nUsted, Nicolotti, ha entendido perfectamente mi escrito e el que dije:\n“……y desconocemos si él fue o no fue testigo presencial, con mayor valor el dato si fuere testigo presencial.”\n¿o quizás no enténdió el significado de “CON MAYOR VALOR SI FUERE TESTIGO PRESENCIAL”?\n3.- “La transcripción de la versión francesa, que me has dado, no es buena. Curiosamente la veo en el Internet. Tal vez ha copiado desde allí?”\nTENDENCIOSA Y EQUIVOCADA SUPOSICIÓN (marginal a la bondad o no bondad de la traducción)\nHe utilizado una de las varias traducciones que tengo, en este caso la utilizada por Mark Guscin en su artículo “LA SÍNDONE Y LA IMAGEN DE EDESA”:\n“De interés especial es lo que observó en la iglesia de Santa María en Blachernae: “et entre ches autres en eut un autre des monstiers que on apeloit me dame Sainte Marie de Blakerne ou li Sydoines la ou Notre Sires fu envelopes i estoit, qui cascuns de venres se drechoit tout drois, si que on poit veir la figure de Notre Seigneur”, lo cual en español significa “Y entre otras, había otra iglesia que llamaban Mi Señora Santa María de Blachernae, donde se guardaba la sydoine en que se había envuelto Nuestro Señor. Se levantaba cada viernes para que el cuerpo del Señor se pudiera ver con claridad”.”\nPero podría haber utilizado la de Dembowski:\n“There was a Church which was called of My Lady Saint Mary of Blachernae, where there was the shroud (syndoines) in which Our Lord had been wrapped, which every Friday, raised itself upright so that one could see the form (figure) of Our Lord on it, and no one either Greek or French, ever knew what became of this shroud (syndoines) when the city was taken [by the Crusaders]” (Robert de Clari, La Conquete de Constantinople, ed. Ph. Lauer [Paris, 19241, P. 90, 11.42-50).\nO alguna de las que utiliza Scavone:\n“Et entre ches autres en eut un autre des mousters que on apeloit medame Sainte Marie de Blakerne, ou li sydoines la ou nostres sires fu envelopes, i estoit, qui cascuns desvenres se drechoit tous drois, si que on i pooit bien veir le figure nostre seigneur, ne seut on onques ne Griu ne Franchois que chis sydoines devint, quant le vile fu prise”.\ny\n“In the church of Our Lady of Blachernae the sydoines of Jesus stood up straight every Friday [cascuns devenres se drechoit tous drois] so that the figure of Our Lord could be plainly seen there.” \nO la de P.Savio:\n“et entre ches autres en eut un autre des monstiers que on apeloit me dame Sainte Marie de Blakerne ou li Sydoines la ou Notre Sires fu envelopes i estoit, qui cascuns de venres se drechoit tout drois, si que on poit veir la figure de Notre Seigneur”.\nNo afectan al contenido de mi comentario.\n4.- El hecho del analfabetismo, estar escrito por otra persona alfabetizada, estar escrito en Francia, cometer errores en la descripción de Constantinopla, su credulidad, etc, etc NO MODIFICAN sustancialmente el que Robert de Clari relate algo TAN SIMPLE como la existencia de una ceremonia de culto en que se muestra la “sydoines” con la imagen de Jesús.\n5.- ” Podría ser cualquier tela con la imagen de Cristo muerto, como muchas estaban en ese momento”\n¡OHHHHHHHHH!\nPURA ESPECULACIÓN.\nSi hubiera existido la posibilidad de existencia de ALGUNA tela con la imagen de Cristo muerto, ya se habrían encargado ustedes de DEMOSTRAR SU INEXISTENCIA, ¡por si acaso! \n6.- “Así que este testimonio no cambia nada, sino para demostrar (si fuera verdadero, y yo no lo creo) que ya en el siglo 13 alguien dijo que existian sàbanas con imagen”.\nMODIFICABLE.\nEste testimonio sirve para demostrar ( si fuera verdadero, y o SI lo creo), que muy a principios del siglo 13 alguien dijo que existía en Constantinopla UNA sábana con la Imagen de Jesús.\n[que es lo que he mantenido en otros foros de debate]\n7.- Dije al PRINCIPIO de este comentario que su “forma” de pensamiento era ESCLARECEDORA.\nUsted, Nicolotti, en este breve “debate” conmigo en un blog de Internet ha cometido errores ( yo no he afirmado que Robert de Clari viera la Imagen de Jesús, dije sólo que era probable), ha sido tendencioso, ha supuesto equivocadamente y ha especulado sin fundamento sólido ( “podría ser cualquier tela…..”).\n8.- Lo cual me hace suponer con un cierto fundamento dada esta breve experiencia, que esas “cualidades no deseadas” podrían trasladarse a parte de sus otros escritos……..\nCarlos Otal\n\n","date":"September 3, 2012 at 3:32 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15801","author":"Carlos Otal","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"SADLY enough, when addressing the legends attached to the Image of Edessa issue, both so-called historians & art historians TOTALLY overlook the 10th-13th c. CE Byzantine iconography CURRENTLY featuring the resurrected Christ dressed in himation (a large rectangular piece of fabric/cloth (sindon in Greek), about four times longer than wide (tetradiplon in Greek) and arranged around the body in a variety of different ways either as a warm cloak (of loosely woven thick wool) over a short chiton (a basic garment that covered the upper body and varying portions of the legs) or as an achiton (of tightly woven lighter fabric usually linen covering the upper body and varying portions of the legs) next to the skin (i.e.. worn as a summer wear, spring wear, evening wear or work wear). Men normally wore the himation alone. \nBoth so-called historians & art historians seem to TOTALLY ignore this basic fact in terms of Greek and Greek Byzantine clothing. They also ignore that the large rectangular piece of fabric/cloth could be draped over one’s head to veil his face and cover both his arms with it.  Had both so-called historians & art historians been aware the upper left edge of a himation could also be used to wipe one’s face, they would have understood the reason why in the 7th c. CE, John Damascene e.g. used this very word (himation) to describe the cloth that received the imprint of Yeshua’s face (the Image of Edessa). \nHow come both historians & art historians just keep ignoring the Greek and Greek Byzantine clothing? Most obviously they TOTALLY missed the whole point here. Reminder for both so-called historians & art historians: the Turin Sindon is about four times longer than wide and as such can be described both as a tetradiplon AND a himation (a large rectangular piece of fabric/cloth) NOT JUST as a  small face cloth. In the different legendary versions, the receiving surface of the Image of Edessa is (either implicitly or explicitly) described BOTH as a small face cloth AND a large full body cloth. Why should the John Damascene’s version of the Abgar legend be TOTALLY ruled out just because the Greek word himation doesn’t fit at all with so-called historians’ and art historians’ pre-conceived ideas? Why should they TOTALLY ignore the resurrected Yeshua’s himation Byzantine iconography?\nAcademics such historians and art historians are NOT serious-mistake-proof as they would like us to believe…\n\n","date":"September 3, 2012 at 1:23 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15790","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Mistyping: Academics such AShistorians and art historians are NOT serious-mistake-proof as they would like us to believe…\n\n","date":"September 3, 2012 at 1:24 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15791","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Mistyping: NOT as a small face cloth\n\n","date":"September 3, 2012 at 2:21 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15795","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"“a large rectangular piece of fabric/cloth (sindon in Greek)”\nLOL\n“four times longer than wide (tetradiplon in Greek)”\nLOL\nYou are right, academics and art historians are all wrong.  Save the world!\n\n","date":"September 3, 2012 at 2:00 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15794","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Your sheer ignorance of ancient Greek and Byzantine Greek makes me LOL! Ever heard Greek words such as ‘sindon’ and ‘tetradiplon’. can have more than one meaning/acception? Both Byzantine Greek words do apply to the Turin Sindon. \nWhat about your sheer academical ignorance of the resurrected Christ’s himation Byzantine iconography? I am supposed to  LOL at you?  BTW the Byzantine iconography does confirm my reading of both Byzantine Greek. \nEver heard of Greek and Greek Byzantine clothing? Am I supposed to LOL at ypu sheer ignorance again and again?\n\n","date":"September 3, 2012 at 2:38 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15796","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Mistyping; BTW the Byzantine iconography does confirm my reading of both Byzantine Greek. \nAm I supposed to LOL at your sheer “academical” ignorance again and again?\n\n","date":"September 3, 2012 at 2:41 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15797","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"both Byzantine Greek words (sindon & tetradiplon) in conjunction with the word himation.\n\n","date":"September 3, 2012 at 2:45 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15799","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Ever heard of Greek Byzantine weaver’s technical jargon?\n\n","date":"September 3, 2012 at 2:43 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15798","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"AN, BTW you can feel lFREE to ignore tne words ‘sindon’ and ‘tetradiplon’ in conjunction with the word ‘himation’, feel FREE to ignore the resurrected Christ’s himation  in Byzantine iconography if you think ignorance is one of your best virtue as academics.\n\n","date":"September 3, 2012 at 3:01 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15800","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Andrea N., BTW The Greek designations “rakos tetradiplon” and “tetradiplon” used in conjonction with the word “sindon” can be replaced by the word “himation” (used by John Damascene) as a word DESCRIBING/IMPLYING a(n) [old soiled/stained] 4-5 meter long and 1.2 meter wide cloth), which is both archaeologically and anatomically TOTALLY consistent with a reference to the Turin Sindon and the Turin Sindon Man height  As a so-called ‘academics’.you are also FREE to ignore this very fact. known by any true specialist of Greek and Greek Byzantine clothing and true philologists…\n\n","date":"September 3, 2012 at 4:04 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15802","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"…which, most obviously, you are not.\n\n","date":"September 3, 2012 at 4:10 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15804","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Reminder: the word tetradiplon can be read as “folded in four [successive foldings]” i.e. four times [onto itself] AND/OR as a qualitative noun ” a 4 x 1″ i.e.  fa piece of fabric/cloth four times longer than wide. “Doubled in four” would be rather misleading (describing the result not the folding process = THREE successive foldings).\n\n","date":"September 3, 2012 at 4:22 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15805","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"There is a minimum level below what is not possible to fall. Y no me gusta que me tomen el pelo. Quis habet aures intendiendi, intendat.\n\n","date":"September 3, 2012 at 4:25 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15806","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Most definitely this is a very strong  philological and archaeological argument of yours LOL!\néphrâym ravo o ahad aouphry lé-apharym\n\n","date":"September 3, 2012 at 5:07 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15809","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Carlos: I repeat you in Spanish because you continue asking the same over and over again. Nicoloti da buenas razones para suponer que de Clari no vio realmente el sudario que dice haber visto. Está explicado en su libro y en un artículo que comento en mi blog. Eche un vistazo allí y no volverá a poner pegas sin demasiado sentido: http://sombraenelsudario.wordpress.com/2012/08/08/robert-de-clari-ii-un-testimonio-dudoso . Es un breve comentario, pero le dará una idea.\n\n","date":"September 4, 2012 at 1:56 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-15823","author":"David Mo","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"CRYPTOHISTORIOGRAPHY OF THE IMAGE OF EDESSA\n  I wish both historians and art historians were more aware of CRYPTOhistoriography. E.g. I would be very much curious to know how the servants of the HIgh Priests of Byzantine History and Art History interpret the Edessa Easter rituals (before 944). I have my own lttle archaeocryptological idea about it….\n  In the chief description of this ritual we read e.g. the image was kept in a gold scrinium and on Easter it used to “change its appearance according to different ages: it showed itself in infancy at the first hour of the day, childhood at the third hour, adolescence at the sixth hour, and the fullness of age at the ninth hour, when the Son of God came to His Passion and cross”.\n Can any of those servants (Cameron, Nicoletti, Aslanovky etc) of the “High Priests”  gives/offers us their own scholar explanation (if they have any)? Methinks we’re going to wait for eternity before they really can…\n\n","date":"September 9, 2012 at 5:29 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-16045","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Mistyping: scholarly explanation\n\n","date":"September 9, 2012 at 5:39 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-16049","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"\nAndrea Nicolotti :\n\nRon :Why has no true historian written a paper and made it accessible to all on Shroud.com?Thank-you.R \nRon, Guscin wrote a book and some articles, and the sentence you quoted is taken from a book, not from Shroud.com. Historians write books and articles, and Shroud.com is not a place to make historical discussions or publish articles. I do not see differences. But maybe if Shroud.com is interested, they can ask historians to reproduce their papers, and perhaps sometimes will be possible.\nThanks for the response Andrea, You wouldn’t be aware, but I have never purchased Guscin’s book! It’s price is well above what I’ll pay for a book ;-) …So this would mean I’ve read that specific quote somewhere else, and seeing I get alot of my info from shroud.com, I would assume it was there or maybe the BSTS journals. Certainly shroud.com is not a place for historical discussion or to ‘publish’ papers, but one needs only to email shroud.com or Barrie Schwortz to have their any papers submitted. I am 100% sure that with one of your standing, your papers would definately not be refused. It would be a great thing if more Historians would submit thier papers to the site and with references to thier books. It could only go to helping all understand better.\nThanks,\nR\n\n","date":"September 11, 2012 at 4:14 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-16153","author":"Ron","site":"shroudstory"},{"title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!","post":"Ron, two answers: 1) I have written a short article about the mandylion in a book called “Sacre impronte e oggetti non fatti da mano d’uomo”, that you can freely find on google and also download. It contains other papers by other historians. For me is very difficult to write in English, and nobody translates it for me, so… is useless to send to an American web site a paper in italian just published on internet\n2) I have written an entire book about the mandylion and the Shroud, but this is not free and I cannot put on internet (the editor has the property). And again, it is in Italian. I think it would be very difficult that some people here will translate it in English to publish it in English and “to helping all understand better” …      :-)))\n\n","date":"September 11, 2012 at 5:21 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","id":"comment-16154","author":"Andrea Nicolotti","site":"shroudstory"}]
