[{"id":"comment-1149","author":"john_lupia","post":"Ellen J. You are describing a book very different than mine. For the correct information about the book please go the URL below. Http://www.reginacaelipress.com John.","date":"2010-03-12","mins":"1:20 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1157","author":"john_lupia","post":"I too will welcome reviews from those that read the book. I can’t wait to read Dan’s review as he promised..","date":"2010-03-12","mins":"6:36 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1153","author":"john_lupia","post":"So who is Ellen J? besides a completely masked concealed and anonymous persona. Let the farce continue since I no longer wish to post on the “Mystery Persona Blog” run by an anonymous blogger, whom Stephen Jones addresses as Dan. I can make a very good educated guess who Dan the Episcopalian is, besides the fact that in a private Yahoo Group he mentioned his blog at word press. But I cannot even begin to guess who Ellen J. Is. Who are you? Lighten up and answer some questions. Unmysteriously, John Lupia.","date":"2010-03-12","mins":"5:16 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1151","author":"john_lupia","post":"Ellen J. Your concerns are not warranted and ill informed. Pay Pal does not process credit cards in scams. You have now accused Paypal of doing just that by your comments, which is libel. Your initial post claims the book is 8.5 x 11 printed at Staples, which is libelous, since it is absolutely false. As for your other complaints and vituperative caustic comments one seriously doubts your sincerity in reading the book, but rather, to cast doubts to others and dissuade them from buying the book. You seem to have no qualms about posting libel and caustic comments against Pay Pal, me, the book, and the publisher on an anonymous blog with the identity of Episcopalian and yourself merely as screen names. Why are you concealing your identity? Who is Ellen J..","date":"2010-03-12","mins":"4:15 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1137","author":"john_lupia","post":"CAZAB That is correct. The “sadîn shel buz” is a tallit. John.","date":"2010-03-10","mins":"1:38 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1141","author":"john_lupia","post":"Stephen Everything you posted is old outdated information no longer true or valid. All of these speculative theories were proven false. Flury Lemberg confirmed the cloth was cut and sewn together. Below is a quote from footnote 17, on page 38 of my new book The Ancient Jewish Shroud at Turin (Regina Caeli Press, 2010) Flury Lemberg made this report at the Symposium at Turin, March 2 5, 2000. It was reported a bit confused where one might think there are two seams in the British Society For the Turin Shroud, 51, June (2000). However, in private correspondence with Dr. Flury Lemberg she did not appear to confirm the misinterpretation of Wilson’s report regarding her paper. Instead she referred to her article, “The Linen Cloth of the Turin Shroud : Some Observations On Its Technical Aspects,” in Sindon, 16, decembre (2001), 55 62, which reports only one, not two.” John.","date":"2010-03-11","mins":"11:57 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"},{"id":"comment-1145","author":"john_lupia","post":"Stephen If you never read my book I can see how you can think the side strip raises problems for my theory. Once again, you amusingly point out problems to sources I give you, which I have read and studied years before you, implying either I never read them or else never understood them. This is a bit insulting. Once again, you make unwarranted caustic comments about a book you never read. This book is destined to be the most important book ever written in the history of Shroud literature. This claim is obviated by the fact the thesis it contains authenticates the Shroud as a first century Jewish tallit and obstacle of greater magnitude to the 1988 C 14 dating 1260 1390 than it posed to authententication. Both cannot be correct. My thesis is self evident to all readers. Scrutiny by experts worldwide is expected just as both praise and caustic scathing reviews. But in the end the thesis will prevail. Try reading the book before you condemn it. Otherwise any criticism about a book you never read is dishonest. This reminds me of the child at dinner table who refuses to eat his spinach saying he hates it, though he never ate it before. John.","date":"2010-03-12","mins":"10:24 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"}]
