[{"id":"comment-1076","author":"john_lupia","post":"I would like to clarify that the book is not available on CD ROM as a PDF. It was originally slated to be one of the formats for the book to be published this way but there are too many difficulties in PDF publishing that warranted this format to be rejected. The book was always intended to be a print publication and is now the only format Regina Caeli Press will publish it in. The first issue is in softcover or paperback. As the blogger says by implication that there is not a single Shroud researcher aware of the first century tallit type and consequently they cannot think I am correct in my identification. But most researchers on the Shroud of Turin are not archaeologists and have never studied archaeological textiles. I appreciate Stephen’s comments very much. Especially the fact that if the Shroud of Turin can be shown to be an ancient Jewish tallit type before A.D. 66 then authentication becomes accomplished. It would be rather difficult for anyone to argue that it is a medieval forgery since the first century tallit type was not known during this time. It was not until the 17th century that anyone could even have connected the Shroud with the tallit. First century tallitot (plural) were not exclusively made of wool. The most ancient and popular fabric for them was linen. You cannot rely on Wikipedia or any other link on the internet to learn about the tallit because nearly all if not all describe the tallit as we know it today that has precedence beginning about 1000 A.D. This fact alone supports the view that a medieval forger would not have known about the ancient type. The issue of the side strip is given careful attention throughout the book and plays an important role in helping us identify several important matters that help in identification of the Shroud as a tallit. Tzitzyot (plural) were removed at burial. If the Shroud of Turin is an authentic tallit then we should not find them attached on the Shroud. But, this issue is a bit more complicated than this simplified explanation and is explained in the book. The dimensions of the Shroud do not conform to 8 x 2 cubits of any sort. If you do the math you see for yourself. The correct dimensions are in my book. As for the Gospel of Mark telling us about the role Joseph of Arimathea played with the Shroud it has been completely obscured by inept translations. The original Greek does not necessarily read as translations have it. But all of this is explained in the book. The problem is not inherently impossible to resolve, Stephen, as there are many factors involved you can only learn by reading the book, which, by the way, also includes explanations about the C 14 dating done in 1988 based on physics. John.","date":"2010-03-03","mins":"1:28 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1085","author":"john_lupia","post":"Theologian It would seem a nutty notion that the Shroud of Turin is a tallit if you only understand the tallit form that has come down to us since 1000 A.D. The tallit is not a medieval invention but an ancient one at least 3,000 years before those that emerged in 1000 A.D. The book explains the ancient Jewish tallit form during the first century, a form very different to that used today, and were the dimensions of the Shroud of Turin. The guy to whom you refer is Shimon Gibson who has made unwarranted comments for which he alone is responsible. I am making mine in the book for which I alone am responsible. Just as you are responsible for the comments you have made here. Anyone can make any claim they wish, but they need supportable and verifiable data to back it up. I can only answer for myself. My book contains supportable and verifiable data to back my claim that the Shroud of Turin is an ancient Jewish tallit. The question on translations I have explained in my second reply to Stephen. Inept here means not suitable to the time, place or event. There is great difficulty involved in determining the most suitable sense of the text, i. E., keeping the author’s intended sense. A typical example has already been given above when some translations of Mark 15:46 characterize the linen as unused. This, of course is inept, i.e., not suitable since the text does not say that. The key words are “agorasas sindona” and there is no sense in which it can convey an “unused linen” outside of interpretation. If the Greek phrase is interpreted to mean that Joseph of Arimathea went out to the market to buy a sindon then it would naturally seem logical that he bought a new one, i.e., one that was unused. But this is all part of the translator’s interpretation. But was that the author’s intended sense? Since these sorts of translations have been around so long there are generations of readers who have just such a picture painted in their mind of Joseph of Arimathea going out to the market to buy a sindon and cannot think outside of that image so deeply embedded in their minds. Yet it never occurs to many that this is not suitable for the time, place and event since it was a Jewish holy day and it is scarcely conceivable that shops selling linen or anything else were open. It should be pointed out that “agorasas” does not exclusively mean “to purchase, or to buy”, since it can also mean “redeem” or “to pay the tax”. Moreover, the Greek sindon is left here to mean “linen”, a very broad term. But sindon more precisely means tallit. The sources for this are in the book. So if you translate this text where “agorasas” means “to redeem” and “sindona” to mean “tallit” there is an altogether different reading where Joseph of Arimathea went out to redeem the tallit. And from whom would he redeem it from? In the Gospels the tallit of Jesus was the booty in the Roman soldier’s hands who won it tossing dice. In this case Joseph of Arimathea went out to redeem the tallit from the Roman soldier. I hope you see that there are various ways a text can be translated. Each one requires the translator to interpret the best they can rendering the text suitable according to that historical time, place and event. Moreover, there are various variants among texts going back to the early church papyri. Perhaps you might enjoy reading my review of Comfort & Barrett http://www.amazon.com/review/R38 HE9 UXGSIMRM “Everyone is free, then, to contradict me. I would only ask my readers for that initial goodwill without which there can be no understanding.” — Benedict XVI, Jesus of Nazareth, xxiv John.","date":"2010-03-04","mins":"7:42 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1096","author":"john_lupia","post":"Stephen In this world we can only express what we think. Every translation you have ever read in print expresses what the translator thinks the original message says. If you think that is a climb down then stick to the original Greek text and even then what you think it says is in the end only your opinion, or what you think it says. As for my translation it is a supportable and verifiable one based upon various considerations fully explained in my book. The Pesach Eve is a Jewish holy day, not only the Pesach (Passover). I can see you never understood my point that Joseph of Arimathea purchased back or redeemed the tallit of Jesus won in a dice game at the crucifixion. I never said the tallit was that of Joseph of Arimathea which he bought back, obviating you never understood what I was saying since you wrote : Even if it be granted that “redeeming” was a usual term for buying used linen, which seems unlikely, as “redeem” has the meaning of buying back something that one formerly owned, i.e. “To recover ownership of by paying a specified sum” (The Free Dictionary). Which is especially unlikely in the case of the “rich man” Joseph of Arimathea (Mt 27:57) that he would have to buy back (e.g. From the 1st century equivalent of a pawnshop?) linen that he had previously owned! I hope it is a bit clearer now that Joseph bought back the tallit belonging to Jesus Christ to bury him with it. Best regards, John.","date":"2010-03-05","mins":"4:14 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1099","author":"john_lupia","post":"Stephen It is clear that discussing a book in a blog with someone who has not read the book can easily come to misunderstandings about what the book actually says. This is especially true when discussing the book with the author who is very reluctant to reveal the crux of the arguments, giving away the store, so to speak, but would rather have readers discuss the book who actually read it. So my recommendation to you and any other poster to this blog is to either buy the book or borrow a copy from a library, read it, and then discuss it here or anywhere else they wish to. Regarding the Pesach Eve, an ancient Jewish custom, you have asserted it is contemporary, not ancient. Yet, in your correct reading of the Gospel it clearly says Sabbath eve, meaning the approaching sundown for the Sabbath, when no work was allowed since the Sabbath began about 6 p.m. Friday evening. This is the eve of the Sabbath. Jews throughout history have left all work undone Friday afternoons usually around 2 p. M. To be home before sundown because there were restrictions on how far they could travel home and beyond that it was considered work and a Sabbath violation. Even when they got home they were limited to what they could do not to violate the Sabbath by working at home preparing for the Sabbath feast. So they left early (around 2 p.m.) to get home and prepare for the Sabbath. This tradition is still true throughout the Middle East when Friday afternoon comes around all commerce ceases around 2 p.m. However, this was no ordinary Sabbath but one of the major Holy Day’s in the Jewish liturgical calendar, Passover (Pesach). This Pesach eve has always been part of the traditional Jewish celebration for Passover, nothing new, nothing modern, but rather, ancient. The redemption or buying back of the tallit of Jesus by Joseph of Arimathea from the Roman soldier is more clearly explained in the book when you read in context. Yes, himation was ONE of the Greek words used as a synonym for tallit. Other synonyms are given in the book. If it were that easy to find them all on your own then everyone would have easily known them all and the tallit theory would have been long discussed for years as a common piece of knowledge. That is why researchers do the research and publish. They have done the work and presented it on a silver platter so that readers can gain in moments what it took years for a researcher to learn and find through arduous investigations. I appreciate your enthusiasm doing biblical searches in Greek lexicons, etc. It shows you are very interested in Scripture and are serious about studying and learning as much as you can. I am sure you will enjoy reading my book whether you buy a copy or borrow one from a library because the study of Greek will be “right up your alley”, to use the American colloquialism. I have known about Donald Smith and his theorizing since that publication came out. I have been researching the Shroud of Turin since 1970. I had already developed the tallit theory about a year prior to Smith and was surprised at that time that anyone else considered it. It put me in a bit of a panic thinking it would catch on and that I needed to complete my work ASAP and publish it before anyone else did. But, nobody followed up on this and I breathed a sigh of relief knowing I had more time to research and investigate further since I was not content with the state of my research 1996 1997. As you can see I spent 14 years just studying the tallit specifically. I only ask that you be fair and kind and show charity and goodwill and mutual respect as a gentleman about a book he has never read and allow their neighbor (me) to have the book read by actual readers and listen and learn in order to come to a fuller understanding of just what the book says. It is a bit awkward for me as an author to reveal too much. If you reveal too much too soon it does harm to the commercial value of the book. The book is my intellectual property and all I ask is that you respect that. Perhaps in a month or so you will be reading reviews by readers of the book and you might find by that time it is available in your local library in Perth, Australia. So, be patient and keep all of these thoughts in the back of your mind until you read the book first hand. I am very glad to see that you have an enthusiastic interest in this subject since I am sure you will find something in the book worthwhile. It would be not realistic for any author to expect nothing but rave reviews about their book. This is especially true about a book written about a subject that is controversial like the Shroud of Turin. Surprisingly, there are even advocates of the Shroud of Turin who for one reason or another will delight in giving this book scathing reviews, even though the book provides evidence to authenticate the Shroud. It seems that this group of critics fails to recall the words of our Lord in the Gospel of Mark 9:40 “for whoever is not against us is for us.” But age brings about wisdom, and as an older man I have come to realise one thing, that I can only control my behavior, not my neighbors. I began my journey in research on the Shroud of Turin as a dark haired young man. The book is now published when I am an older man with white hair. So please allow me, your neighbor, who is neither against you, nor against our Lord, nor against the Shroud, a chance to share his research with others who might be interested enough to buy the book. You are free, of course, to continue to make judgments against me, my abilities, my theories, and my book. I only ask in Christian charity that you be fair and base your comments and criticisms on the merits or demerits of the book itself. For in the end any sensible author knows that all publicity, whether good or bad, stirs up interest in their book. Best regards, John.","date":"2010-03-06","mins":"11:21 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1105","author":"john_lupia","post":"Stephen Thank you for the continued publicity and diligence in attempting to find flaws in my book which you have not read. If you ever read the book all of your questions will be happily answered in the text. It is rather naive to think that the Gospels are photo journalistic in the sense that they are recording every single minute detail such as Joseph of Arimathea having the tallit of Jesus washed and dried and brought to the tomb for burial. If a tallit is clean, as Matthew 27:59 says it is, by implication it has been washed. For even new unused tallitot were washed if sold in the market. So the sword you swing swings both ways. I think I heard you cry “Ouch” all the way from here! Thanks again for your continued publicity of my book. All the best, John.","date":"2010-03-06","mins":"9:02 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1103","author":"john_lupia","post":"Stephen I can see you are only continually looking for loopholes to prove my thesis has no valid basis in scripture and is easily refutable. That is pretty discourteous to the author since it suggests that something so self evident eluded him and that insufficient study and research has led him down the wrong path. The book was forty years in the making and the last fourteen years were spent on the study of the tallit. The book is thoroughly and meticulously researched, and the manuscript was peer reviewed to assure that no blatant or any other form of errors were contained in it. I do not mean layout and copy editors but specialists in the fields of archaeological textiles and biblical studies and sacred scripture reviewed the book manuscript. Without having read the book it is impossible for you or anyone else to say that the thesis is refutable since you have not read it. The scriptural narratives were exhaustively researched and the explanations given in the book address and answer the very point you have made since there is strong evidence that the tallit Shroud was washed prior to burial. This is not anything new in the field of Shroud research since a few Shroud researchers have already made this as a viable theory, including the late Ray Rodgers, who identified some of the chemicals on the Shroud used in laundering it. Please try to refrain from being judgmental. You might have simply asked about the seeming contradiction rather than being so assertive and adversarial claiming that you are right and I am wrong. But thanks for the continued publicity. John.","date":"2010-03-06","mins":"7:12 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1110","author":"john_lupia","post":"Stephen In the first place I was showing you how Mt 27:59 certainly means washed since it was typical during the first century that even new unused linen bolts or garments were washed by the workshops that wove them before selling them in the market. This fact alone overcomes your objection that Mt 27:59 does not mean washed since it certainly does. However, it requires someone who is familiar with the historical context and culture of that milieu to be able to comprehend that. When we translate or interpret scripture outside of the historical context in which it is written it is anachronistic and opens up Pandora’s box to every unwarranted thought and suggestion and either everything becomes possible or else a rigid narrow minded view is imposed where only one exclusive anachronistic meaning is possible. In this case you have clearly opted for the latter. You wrote : “Not washed clean of bloodstains from being placed over a bleeding living body that had been scourged and crowned with thorns!” This is a fragment sentence and does not make sense grammatically. Your next sentence seems to imply that what you are saying is that if Jesus’ tallit was bloodstained it was ceremonially unclean. I think you finally see my point. According to Mark 15:25 Jesus was crucified at the third hour, which requires us to calculate the time from the Roman hours of the day telling us it was at 9 a.m. If he was being buried between 5 and 6 p.m. That gave the Apostles and Joseph of Nicodemus 8 or 9 hours to have the tallit washed and dried. The actually number of hours to do this in Jerusalem during springtime is certainly less than half that time. Having lived in the Middle East and laundered clothes drying them outside I can tell you from experience it would not take more than a few hours. So judging from my own experience I can assert that it would have only taken about a quarter or less of the allotted time in the timeline. Yet you claim : “There is also the impossibility of cleaning a 4.5 square metres, absorbent linen sheet of all traces of blood, in the limited time available.” You continually make wrong conclusions and vigorously assert them very dogmatically as if they are facts. As for your following comments I will preface them by what I have said previously : I can see you are only continually looking for loopholes to prove my thesis has no valid basis in scripture and is easily refutable. That is pretty discourteous to the author since it suggests that something so self evident eluded him and that insufficient study and research has led him down the wrong path. If you are a Jew then you do not work on a Holy day. If you are a Roman fullo you can work since they were Gentiles and not bound by Mosaic law. Judea was ruled by a Roman Procurator and many Gentile Romans lived in Jerusalem at the time of the crucifixion. Once again your object is easily overcome by anyone familiar with the historical context and culture of that milieu and obviates the fact that you have not done your homework. As for Jesus’ burial shroud being his own personal tallit all the original sources are cited in my book. Your continued demonstration of convoluted logic, ignorance of biblical Greek, philology, historical context and culture of that milieu, is doing you more harm as an author to your prospective readers than you are attempting to foist on me. The objections you propose are those of a layman and I am glad you have voiced them allowing me to air them out here in the event anyone else comes to these same considerations. Here they will find a wealth of information to help them see there are explanations that easily overcome them. So, for this opportunity I thank you very much allowing my prospective readers to plainly see that my thesis is not self contradictory as you dogmatically and continuously assert though you never read my book. This also makes readers of this blog wonder what your real motive might be since I have already politely asked you that if you do think you see problems or objections to my thesis to kindly ask me for an explanation which I would most generously provide as I already have. Yet you continually take a confrontational and adversarial approach that winds up backfiring on you making your readership wonder about the validity and quality of research of your own books. Thanks again for helping to publicize my book. You are doing a great job. Best regards, John.","date":"2010-03-07","mins":"12:41 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1111","author":"john_lupia","post":"Theologian I find your comments here amusing to me since you characterize my book, which you have never read, as liberal biblical revisionism. The reason I find this amusing is that most of the biblical scholars who know me think I am a very conservative Catholic. You wrote : “Isn’t such revisionism always an attempt to make the narrative fit a theory, usually an off the wall theory?” This also swings both ways. Though I am not a liberal revisionist and have only taken the path of sound biblical scholarship citing the writings of published biblical scholars, none of whom are classified or thought of as liberal revisionists, on the other hand, a real liberal revisionist can deny the validity of all the previously published biblical scholarship cited in my book that shows what I am saying is valid in order to fit their own pet interpretation that wants to falsify it. . . . . (the rest of the comment has been deleted as inappropriate by admin because it applies to an inappropriate comment that has been removed).","date":"2010-03-07","mins":"1:33 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1120","author":"john_lupia","post":"Once again, I repeat, your continued demonstration of convoluted logic, ignorance of biblical Greek, philology, historical context and culture of that milieu, is doing you more harm as an author to your prospective readers than you are attempting to foist on me. The objections you propose are those of a layman, amateur and hobbyist since you cite authors whom you think are authorities that no biblical scholar would cite as an authoritative source or reference, like Vine. In biblical Greek scholarship the two standard references are to Kittel and BGD. Now you are imputing violation of the Sabbath law not to work to a Jew who hires Gentiles to do the work for them. This is very convoluted logic. If you choose to characterize this as Joseph of Arimathea as well as all Jews who did this as a practice as having “circumvented the Mosaic Law” or “dishonesty in the things of God” you are only showing that you do not understand the culture and are viewing this anachronistically, since by doing so any Jew that did this acted within the law and was not circumventing or being dishonest with God, but rather, did what was permissible, i.e., what God allowed. You wrote : “But apart from the dishonesty in the things of God you would then be attributing to Joseph, a devout Jew (“a disciple of Jesus” – Mt 27:57; Jn 19:38; who was “waiting for the kingdom of God” – Mk 15:43; Lk 23:51), that would still be work in that it would be a Jew buying services off a Gentile on a holy day (according to you).” Now you are saying that buying services is work in violating the Sabbath prohibition, but fail to consider by your own logic that buying linen would too be the same violation. Once again, this is very convoluted logic. You wrote : “And if only Gentiles could then work on Passover Eve (according to you) then why could not Joseph have “bought some linen cloth” (Mk 15:46) from a Gentile market stall? Since Syria was then the major linen production centre in the Middle East, it is highly likely that there would have been Syrian markets selling linen open on Passover Eve, if not in Jerusalem itself, then outside the then city’s walls.” First, your conditional phrase ““And if only Gentiles could then work on Passover Eve” is incorrect since it is a fact. Only Gentiles could work when Jews were prohibited by law. Second, your suggestion that a Jew buy linen or a tallit from a Gentile once again shows your ignorance of the historical context and culture of that milieu of Judea in the first century or any other time for that matter. No Jew would buy anything to wear or touch that has been touch by Gentiles (goyim), which makes the object unclean. Jewish merchants sold tallitot, not Gentiles. Third, you are asserting based on very limiting reading that “Since Syria was then the major linen production centre in the Middle East” something that is not quite true. The Roman Province of Syria was only one of the important linen production centers. Palestine was also a major linen center. So was Egypt. Perhaps you never heard of Egyptian linen before. Fourth, you wrote : “it is highly likely that there would have been Syrian markets selling linen open on Passover Eve, if not in Jerusalem itself, then outside the then city’s walls.” Maybe they have Syrian markets in Perth, Australia! There was no such thing known in first century Judea. Syrian merchants together with all the other merchants may have had a place in the agora to sell wares but there were not any Syrian markets set up in Judea. The rest of your post only shows your lack of knowledge of New Testament Greek and the accepted scholarly sources. For your own edification buy a copy off Kittel and BGD. Also very excellent sources on NT Greek are Abel, Balz, Chantraine, Funk, Lampe, LSJ, Louw, Spiq, Strong, Swetnam, and Zerwick..","date":"2010-03-08","mins":"10:45 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1124","author":"john_lupia","post":"Stephen “There are more things in heaven and earth, Horatio, than are dreamt of in your philosophy.” I do not expect you to ever fathom the original Greek since you insist on rigid narrow applications that are not exclusive to all others. But for your benefit I have included some citations you may be interested in reading. I know you will always come to conclude that Joseph of Arimathea “bought a linen”. So lets move on. You must be using an abridged edition of Kittel, which unabridged is 10 volumes. You cite p. 19 which is incorrect in the full 10 volume edition. See Liddell, Henry George, and R. Scott, and H. Stuart Jones (1996) Greek English Lexicon, Oxford: Oxford University Press; page 13, entry: agorazo 2. Cites B. P. Grenfell, Revenue Laws of Ptolemy Philadelphus, 60.23 with the meaning of a tax or state contract. See also Spicq, op. Cit., volume 1: 26 28; Buchsel, Friedrich, “agorazo” in Gerhard Kittel, ed., Theological Dictionary of the New Testament (Wm. B. Eerdman’s Publishing Company, Grand Rapids, Michigan, 1999): Volume 1:124 128..","date":"2010-03-08","mins":"12:43 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1080","author":"john_lupia","post":"Stephen Thank you for your reply. It is clear that the dimensions cannot be translated exactly as even you admit. In my book all of this is explained and the unit of measurement given which is exact, not a close approximation, but exact. However, this answer is too simplistic because there are other variables going on that only reading the book can explain with clarity. The key to the Markan text is understanding the what is being said in the Greek. This is very well explained in my book. I do understand your frustration with my comment, but reading the book will clarify all this..","date":"2010-03-04","mins":"11:24 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1123","author":"john_lupia","post":"Theologian No. I did not make this up and it is not a joke. A tallit is no ordinary garment, but sacred. No Jew would buy a holy thing that is religio culturally considered sacred from a Gentile. John.","date":"2010-03-08","mins":"12:25 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1133","author":"john_lupia","post":"Lk 23:53 KAI KAQELWN ENETULIZEN AUTO SINDONI “And he took it down and wrapped it in his tallit” The object AUTO is most probably to be understood as complementing both verbs. So there is a kind of elipsis here, in the first part of the phrase. I think that is an elegant (and classical) stylistic feature. What is remarkable is that the pronoun changes to masculine in the following verse, no? As mentioned earlier the more precise meaning of sindon in New Testament is Greek is tallit. This was known since the 17th century. Read about this remarkable discovery in my book. John.","date":"2010-03-10","mins":"12:07 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1136","author":"john_lupia","post":"Stephen It is incredible that you write : “On past experience, I don’t expect John to accept this evidence, so I am writing it for other readers to help them make up their own minds who to believe, the above leading NT Greek English lexicons, or John.” This is incredible because your argument is solely based on sources I have pointed out exclusively and not those sources that I have not pointed out on this blog but are in my book. The fact that I have already checked the sources you cite for many years should tell you I already know what they say. What you do not know are the sources I cite that verify what I say is valid since I did not cite them in this blog but in my book. All who do read this blog will know that I have checked the sources I cited in this blog, just as you have, but they will also know that I have other sources cited in my book not revealed in this blog that support and defend what I am saying. It is not that these lexicons I referred you to in this blog are wrong, but incomplete. It is true that himation means tallit, but it is false to say it is the exclusive word that means tallit. It is true to say that sindon means linen, but it is false to say it only means linen to the exclusion of tallit. It is true to say that sindon is the preferred word for tallit and false to say that it is not. Consequently, anyone or any lexicon that says sindon cannot mean tallit is incorrect. The word sindon has been known since the 17th century to mean tallit. This truth has been confirmed by the most prominent Jewish scholar accepted as the authority in biblical studies. I have not cited the 17th century sources not the Jewish scholar just mentioned. As already mentioned earlier in this blog I pointed out that researchers spend years to discover things and publish them so that readers can learn in a few moments what it took the researcher years to learn. As for your attempt at refuting my translation I gave to Luke 23:53 the commentary I posted is not mine but a New Testament Greek scholar cited in my book. When I made this discovery that Luke 23:53 could be translated this way I wrote to this Greek New Testament scholar to ask his opinion and he confirmed it and what you have read is what he wrote. As already mentioned by me here in this blog I have always consulted the best authorities directly. I could see and understand your point in your constant effort to debunk me if I worked in complete isolation and everything I claim in the book is something never before consulted, but the book has been peer reviewed. No intelligent author publishes new discoveries they have made, especially discoveries that authenticate a controversial subject like the Shroud of Turin, without expert consultation. Can’t you be so kind as to accept this? And have an open mind that others may have something new to offer that without reading their book you can never understand..","date":"2010-03-10","mins":"12:09 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1127","author":"john_lupia","post":"Stephen Thank you for your opinion. However, I never said Jews cannot buy linen on Passover Eve. I said they could not sell on a holy day. I also said they would not be able to buy a tallit on a holy day since tallitot were sold by Jews and they could not sell on a holy day. The event of Joseph of Arimathea purchasing the tallit of Jesus from the Roman soldier is an obvious exception since he was not a merchant but a soldier. Scholars will read the book and their opinions will prevail, most probably after a long protracted debate. However, I can assure you that the gist of what you are saying above will be found to be completely refuted. Since the Shroud of Turin is a very controversial subject any new book with new ideas and a huge discovery that authenticates it is going to be vehemently challenged and debated by many authorities. I have no concern since I know in the end my theory will stand up against scrutiny. There is no need to further respond. Thank you, John.","date":"2010-03-08","mins":"7:33 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1148","author":"john_lupia","post":"Stephen All of your criticisms are ill informed due to lack of scholarly knowledge of the subject. If you read my book you will learn a great deal. Your constant attacks critiquing a book you never read is not only dishonest but risible. Buy the book. No Shroud researcher should be without a copy of my book if they are to be taken seriously..","date":"2010-03-12","mins":"12:58 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1082","author":"john_lupia","post":"Stephen Regarding the translations of Mark 15:46 take a look at your reply to me. You wrote , ” This agrees with my Interlinear Greek translation: “And having bought a piece of unused linen …” This is a good example of what I am referring to since this is not what the Greek reads. The translators, as all translators must do, interpreted the meaning to read according to their translation criteria. The phrase “unused linen” is an interpretation of “sindona” which is a critically important word for understanding what the Shroud of Turin really is. My guess is whoever rendered this translation conflated the meaning with Matthew 27:59 who uses the phrase: sindoni kathara. Again, this phrase too has been subjected to interpretation to read “a clean linen”. It is outside the scope of writing in a blog to explain the intricacies of New Testament Greek translations. The key idea you must keep in mind is that when translations are made the translators interpret. Interpretations are based upon their assumptions or model or view of what is going on in the text and what each word refers to according to the author’s intention. This is not an easy task. These texts are clearly explained in the book. Best regards, John.","date":"2010-03-04","mins":"12:41 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1168","author":"john_lupia","post":"Stephen The theory presented by Dr. Mechthild Flury Lemberg is her theory, not a fact. She presented her theory in order to explain the Shroud of Turin as we see it today with the side strip as original at the time of manufacture as her best explanation. I discussed this with her for about two months and she did seem to agree that another explanation as I have given is possible. The Greek lexicons you have do not put sindon = tallit for some reason. However, the Greek word sindon has been known to mean precisely “tallit” since it was discovered in the 17th century in Hebrew and Greek texts by John Lightfoot in 1653. This is an interesting fact in itself that precludes any medieval forgery. Also, very interesting is the fact that his work is never cited by Greek lexicons. Also interesting is the fact that Marcus Jastraw the highly respected source of multiple volume lexicons that provide Hebrew and Greek translations of ancient original texts where he too cites sindon as tallit is also not cited in the Greek lexicons that you consult. It is not that they are wrong but incomplete. Since they do not contain complete citations does not falsify the meaning of sindon = tallit. That would be an illogical conclusion for anyone to assert since the evidence refutes it. The remainder of your so called Poperian falsification is circular argumentation since you cannot ascertain that sindon means tallit. You can, of course, comprehend this if you do the research as I have done and read Lightfoot and Jastraw. Until you do you are doing nothing more than repeating ad nauseum the same claim which my book clearly shows is dead wrong. The fact that you continue to pursue the same arguments over and over again without checking sources that were cited in the review already shows your lack of objectivity and dedication to research in the matter. Can you please explain why you never checked Lightfoot and Jastraw which the review cited? Until you do you are only doomed to circular argumentation. You have never proven that sindon does not mean tallit. All you have done is shown that certain Greek lexicons do not have it, which is no proof at all. You claim the tzitzyot were removed from the four corners in a manner not proposed in my book. I also find it risible that you refer NOW to the dimensions of the Shroud from the Restoration in 2002 something you NEVER knew until I pointed it out to you. The same is true about the theory proposed by Dr. Flury Lemberg, which you NEVER knew until I pointed it out to you. These two facts are clear in the blog here and in the associated blog on this site under Shimon Gibson saying nothing about the Shroud. Yet you purport to be an expert on the Shroud and never knew these two very basic facts published widely these past eight years. I have known these facts along these years and analyzed them in the book. Without reading my book you will never learn about their analysis unless a blogger or some other website cites them. As for Gilbert Raes you have made an enormous blunder. You apparently know nothing about his writings. Raes reports are completely contrary to what you are purporting he said. He is the expert who did find cotton inside the threads at the time of spinning NOT weaving. All biblical evidence supports my thesis since my thesis is based primarily on the biblical evidence. But you would need to read my book to find that out. It is rather curious that a so called proponent of authentication of the Shroud of Turin is so driven to disprove a viable thesis that proves the Shroud is authentic. It is like the football player who catches the ball and runs the wrong way making a touchdown on the opponents goal line. One is wondering whose side you are really on. Your own words seem to suggest which. Matthew 7:16 By their fruit you will recognize them. Luke 6:44 Each tree is recognized by its own fruit..","date":"2010-03-21","mins":"10:36 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1088","author":"john_lupia","post":"Stephen You wrote 1) the Shroud linen (if it is authentic) “is after all, a cloth measured in a pre industrial society,” with the clear implication that it is unreasonable to expect it to conform to modern standards of exact measurement; First, I make no claim that the Shroud conforms to modern standards of exact measurement, but ancient standards of exact measurement. Second, you claim 1) the Shroud linen (if it is authentic) “is after all, a cloth measured in a pre industrial society,” This is anachronistic. There was industrial society using very strict standards and units of measurement in the first century; or else your own argument falls apart claiming the the various cubits were applicable. I agree with your number 2 but in Shroud literature there is little or no evidence to show the length has been shortened. In my book I do show the length has been shortened and I speculate using the standard unit of measurement at the time how much is missing. Your number 3 is off the mark. Since 2002 the Shroud width does not measure 111 cm, but 113 to 113.7. This does not equal 110 cm. The unit of measurement you are applying is the wrong one. The correct one is published in my book. Your number 4 also like 3 above applies to the pre 2002 conservation. The shrinkage and expansion of the Shroud was due to it being sewn onto the Holland cloth, now removed. It has been carefully stretched out now and sandwiched between glass panels to keep it stretched out. The new reading of the measurements should be true or the same throughout time. I think we actually might be saying the same thing, in a sense, since you are assertive that the Shroud can be shown to conform to an ancient unit of measurement, just as I do. So, I agree. The only difference is I found another ancient unit that works much better. I think you will be very pleased when you read about it. Cordially, John.","date":"2010-03-04","mins":"10:22 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1086","author":"john_lupia","post":"Hi Stephen If you read my comment to Theologian below you will understand my initial point more clearly. I do not think the translation that reads Joseph of Arimathea “bought some linen cloth,” is expressing the author’s intended sense. Best regards, John.","date":"2010-03-04","mins":"8:02 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"}]
